{
  "head": {
    "counts": {
      "questionCount": 2566,
      "resultCount": 2566
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  Under the Waste Management (Farm Plastics) Regulations 2001, producers of farm plastic products must establish a deposit and refund scheme for farm plastic waste or participate in an approved compliance scheme for the recovery and recycling of this waste stream.  Since the introduction of the farm plastics extended producer responsibility (EPR) model, producers have opted to participate in the compliance scheme which is run by the Irish Farm Film Producers' Group (IFFPG). IFFPG is a not-for-profit organisation owned by its producer members and the IFA, operating under Ministerial Approval.  IFFPG manages the collection and recycling of farm plastic waste on behalf of its members and funds its operations from producer fees and collection charges. The setting of fees and charges, as well as commercial arrangements for the collection and recycling of this waste stream, are operational matters for IFFPG and its Board.  An application for approval to act as a compliance scheme for farm plastic waste has been submitted by IFFPG and is currently being assessed. As per the 2001 Regulations, IFFPG’s performance regarding measures taken and effects of these measures with regard to the recovery of farm plastic waste, achievement of targets, and nature and frequency of information provided to the Department and the financial stability of the Scheme, are all under consideration as part of this process. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 190. Deputy Michael Fitzmaurice asked the Minister for Climate, Energy and the Environment if he will commit to incorporating a provision in the renewal of  Ministerial approval for a group (details supplied) that will compel the approved body to establish and implement a mechanism for payment of the net necessary cost of collection and recycling to any RMO that can verifiably demonstrate the processing of obligated farm plastic, subject to an audited validation process, thereby ensuring a fair return for all market participants who contribute to national compliance targets; and if he will make a statement on the matter. [71578/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_124",
          "debateSectionId": "dbsect_124",
          "showAs": "Recycling Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_124.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_190",
        "questionNumber": 190
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  As the Deputy will be aware, community centres, sports clubs and other community facilities were a vital part of the immediate response to storm Éowyn. I visited a number of these in the days after the storm and saw first hand how important they were, and how community volunteers were so central to the response.  These facilities will continue to be central to our emergency response in the future as they have the potential to provide access to basic welfare needs such as food, mobile phone charging, shower and hygiene facilities, and wifi access.  As part of the response to the aftermath of storm Éowyn, the Department of Housing, Local Government and Heritage are establishing a network of  'Community Support Centres'. This is a resilience initiative which will see local authorities pre-identify suitable premises that can be utilised in response to emergency events. This  puts a more formal and planned structure on the type of response hubs mobilised during storm Éowyn, with facilities being identified and supported in advance as required.  In many instances, these are facilities that are supported by my Department through schemes such as the Community Centre Investment Fund, CLÁR, the Town & Village Renewal Scheme and LEADER.  In addition, my Department is working with the National Directorate for Fire & Emergency Management and local authorities to fund a bank of mobile emergency generators in each local authority area. These can then be deployed as needed to community facilities that are activated as ‘Community Support Centres’ during an extreme weather event.  I envisage that there would be 3 to 4 generators made available to each local authority at the outset. The tender process for these generators is nearing completion and the timeline for rollout will be confirmed as part of that tender process.  I will continue to work with my colleagues across Government to support effective responses to future weather related incidents. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 5. Deputy Michael Fitzmaurice asked the Minister for Rural and Community Development and the Gaeltacht in light of storm Éowyn, when the number of generators will be finalised for community centres and hubs; the breakdown, by county, of same; and if he will make a statement on the matter. [68989/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_52",
          "debateSectionId": "dbsect_52",
          "showAs": "Weather Events",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_52.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_5",
        "questionNumber": 5
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  The Waste Management (Farm Plastics) Regulations 2001 require producers of farm plastics to either establish a deposit and refund scheme for farm plastic waste or to participate in an approved compliance scheme for its recovery and recycling. Since the introduction of the farm plastics extended producer responsibility (EPR) model, producers have chosen to participate in the compliance scheme which is run by the Irish Farm Film Producers' Group (IFFPG). IFFPG is a not-for-profit organisation owned by its producer members and the IFA.  IFFPG funds its operations from producer fees and collection charges. The Group also contracts collection and recycling services following an established procurement process. The setting of fees and charges as well as the contracting of waste collectors and recyclers is an operational matter for IFFPG. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 168. Deputy Michael Fitzmaurice asked the Minister for Climate, Energy and the Environment in advance of a decision to approve an organisation (details supplied) as the operator of the extended producer responsibility (EPR) scheme for farm plastics; the provisions he has made for recovery operators that collect, process and recycle farm plastics distinct to the organisation, and in compliance with all relevant legislation, have equal access to the levies gathered under this EPR scheme. [68536/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_182",
          "debateSectionId": "dbsect_182",
          "showAs": "Environmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_182.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_168",
        "questionNumber": 168
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to Active Travel. Funding is administered through the National Transport Authority (NTA), who, in partnership with local authorities, have responsibility for the allocation of funding to and the development of specific projects in each local authority area.  Noting the role of the NTA in the matter, I have referred your question to that agency for a more detailed answer. If you do not receive a reply within 10 working days, please contact my private office. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 189. Deputy Michael Fitzmaurice asked the Minister for Transport whether the National Transport Authority was aware of the Local Area Plan non-compliance in a local authority (details supplied) before releasing Active Travel funding; the checks the authority carried out once this information was provided; and if he will make a statement on the matter. [68546/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_201",
          "debateSectionId": "dbsect_201",
          "showAs": "National Transport Authority",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_201.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_189",
        "questionNumber": 189
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to Active Travel. Funding is administered through the National Transport Authority (NTA), who, in partnership with local authorities, have responsibility for the selection and development of specific projects in each local authority area.  Noting the role of the NTA in the matter, I have referred your question to that agency for a more detailed answer. If you do not receive a reply within 10 working days, please contact my private office. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 190. Deputy Michael Fitzmaurice asked the Minister for Transport to clarify the governance arrangements that apply when the National Transport Authority funds senior staff in a local authority; how the authority ensures that decisions to apply for or authorise public expenditure are supported by valid delegated authority; and if he will make a statement on the matter. [68547/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_202",
          "debateSectionId": "dbsect_202",
          "showAs": "National Transport Authority",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_202.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_190",
        "questionNumber": 190
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The interpretation of any judgment made against a local authority is a matter for the local authority concerned and, should the Deputy have queries regarding a specific judgment, he may wish to address his query to the relevant local authority.  Furthermore, specific 'transport projects' may constitute, from a planning perspective, planning applications that the Minister would be precluded from commenting upon in light of Section 30 of the Planning and Development Act 2000 (as amended). ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 311. Deputy Michael Fitzmaurice asked the Minister for Housing, Local Government and Heritage whether transport projects can lawfully proceed in an area where the planning authority has been found by the High Court to be in non-compliance with its mandatory duty to prepare a Local Area Plan; and if he will make a statement on the matter. [68544/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_294",
          "debateSectionId": "dbsect_294",
          "showAs": "Local Authorities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_294.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_311",
        "questionNumber": 311
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The Office of the Planning Regulator (OPR) is an independent public body which was established on 3 April 2019 under the Planning and Development Act 2000, as amended to perform the following functions:  independent assessment of all local authority forward planning and regional assembly forward planning, including development plans, local area plans and regional spatial and economic strategies;  reviews of the organisation, systems and procedures used by any planning authority, including An Bord Pleanála, in the performance of any of their planning functions under the 2000 Act; and  conducting national education and training programmes for members and staff of planning authorities and regional assemblies in relation to proper planning and sustainable development; and also conducting research on matters relevant to the OPR’s functions and such other matters as may be requested by the Minister for Housing, Local Government and Heritage.  The information requested is not held by my Department as this is a matter for the Office of the Planning Regulator.  Arrangements have been put in place by all bodies under the aegis of my Department to facilitate the provision of information directly to members of the Oireachtas. This provides a speedy, efficient and cost effective system to address queries directly to the relevant bodies. The contact email address for the Office of the Planning Regulator in this regard is oireachtas@opr.ie .   ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 312. Deputy Michael Fitzmaurice asked the Minister for Housing, Local Government and Heritage whether the Office of the Planning Regulator received formal notifications about Local Area Plan non-compliance in a local authority (details supplied); the actions that followed from those notifications; and if he will make a statement on the matter. [68545/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_295",
          "debateSectionId": "dbsect_295",
          "showAs": "Local Authorities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_295.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_312",
        "questionNumber": 312
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 365 and 366 together.  The provisions in the Civil Law (Miscellaneous Provisions) Act 2021 were extended on 26 November 2025, for a further six months, until 31 May 2026.  Street furniture licences are issued by the relevant Local Authority under Section 254 of the Planning and Development Act 2000. It is, therefore, a matter for the relevant Local Authority to determine the precise area of public land that will be subject to a Street Furniture Licence. Queries in respect of the specifics of Street Furniture Licences should be directed to the Minister for Housing, Local Government and Heritage.  A licensee who successfully applies and is granted a Street Furniture Licence pursuant to s.254 submits this authorisation to the District Court (for a licence renewal) or to the Circuit Court (for a first time applicant), along with a map which delineates the area authorised for use by the Street Furniture Licence in red. The area provided for in the Street Furniture Licence is then deemed to be part of the licensed premises and therefore subject to the provisions of the licensing Acts and the Public Order Acts, as well as for insurance purposes etc.  As part of the licenced premises, subject to the provisions of the Licensing Acts, a failure by a licensee to adhere to the law in respect of the presence of children on a licensed premises applies to the outdoor seating area. Failure to adhere to these provisions is a breach of the law, and a licensee could be subject to a number of sanctions including criminal sanction and/or the forfeiture of their licence.  Compliance in relation to the Public Health (Alcohol) Act 2018 is a matter for the Minister for Health.  In May of this year the Government approved the priority drafting of the Criminal Law and Civil Law (Miscellaneous Provisions) Bill 2025. This Bill will contain provisions to put outdoor seating on a permanent statutory footing and will remove the need for the continued renewal of these provisions by resolution every six months going forward. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 365. Deputy Michael Fitzmaurice asked the Minister for Justice, Home Affairs and Migration whether it is intended to continue the practice of licensing public roads, footpaths and public spaces for use by outdoor commercial premises, particularly in circumstances where the licensed areas are remote or freestanding and are separated from the licensed premises by a public footpath or other public space; the legal basis in such cases for granting such licences; the policy intention regarding their long-term or permanent use; the arrangements proposed to address responsibility, liability and insurance for these non-contiguous areas that remain in public ownership; and if he will make a statement on the matter. [68548/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_337",
          "debateSectionId": "dbsect_337",
          "showAs": "Outdoor Events",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_337.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_365",
        "questionNumber": 365
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 365 and 366 together.  The provisions in the Civil Law (Miscellaneous Provisions) Act 2021 were extended on 26 November 2025, for a further six months, until 31 May 2026.  Street furniture licences are issued by the relevant Local Authority under Section 254 of the Planning and Development Act 2000. It is, therefore, a matter for the relevant Local Authority to determine the precise area of public land that will be subject to a Street Furniture Licence. Queries in respect of the specifics of Street Furniture Licences should be directed to the Minister for Housing, Local Government and Heritage.  A licensee who successfully applies and is granted a Street Furniture Licence pursuant to s.254 submits this authorisation to the District Court (for a licence renewal) or to the Circuit Court (for a first time applicant), along with a map which delineates the area authorised for use by the Street Furniture Licence in red. The area provided for in the Street Furniture Licence is then deemed to be part of the licensed premises and therefore subject to the provisions of the licensing Acts and the Public Order Acts, as well as for insurance purposes etc.  As part of the licenced premises, subject to the provisions of the Licensing Acts, a failure by a licensee to adhere to the law in respect of the presence of children on a licensed premises applies to the outdoor seating area. Failure to adhere to these provisions is a breach of the law, and a licensee could be subject to a number of sanctions including criminal sanction and/or the forfeiture of their licence.  Compliance in relation to the Public Health (Alcohol) Act 2018 is a matter for the Minister for Health.  In May of this year the Government approved the priority drafting of the Criminal Law and Civil Law (Miscellaneous Provisions) Bill 2025. This Bill will contain provisions to put outdoor seating on a permanent statutory footing and will remove the need for the continued renewal of these provisions by resolution every six months going forward. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 366. Deputy Michael Fitzmaurice asked the Minister for Justice, Home Affairs and Migration whether the Civil Law (Miscellaneous Provisions) Act 2021 has been extended; if not, if he plans to extend the Act, to provide for the licensing of alcohol consumption in outdoor seating areas located on public property that is abutting, adjoining, or remote and freestanding on public roads; if so, the specific legal provisions that now apply to such areas; in circumstances in which alcohol is conveyed from a licensed premises across an unlicensed public footpath or other public space to reach such an area; the legal basis that permits this movement; the way in which compliance with existing liquor legislation and the Public Health (Alcohol) Act 2018 will be ensured, particularly where children may be present; the way in which these areas are mapped and recorded in the annual licensing court process; the way in which public participation will be facilitated on a yearly basis given that these authorisations are described as temporary; the way in which the granting of street furniture licences that allow private commercial use of public land is reconciled with existing licensing law; and if he will make a statement on the matter. [68549/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_337",
          "debateSectionId": "dbsect_337",
          "showAs": "Outdoor Events",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_337.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_366",
        "questionNumber": 366
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  Since becoming Minister for Rural and Community Development and the Gaeltacht, I have prioritised investment in community infrastructure. As part of Budget 2026, I was delighted to announce increased funding for the programmes that are delivering on this priority. This includes an increase in the annual budget for the Community Centre Investment Fund (CCIF) by €3 million to €20 million.  The CCIF was introduced to provide high quality, accessible, community spaces that are available to all groups in all communities in both rural and urban areas. Some €110 million has been allocated since 2022 for the enhancement and refurbishment of existing community centres and the construction of new centres where such a need has been identified.  The last tranche of announcements was in respect of category 2 projects under the 2024 refurbishment measure, in March this year I approved funding of over €26 million for almost 370 projects providing funding of up to €100,000 for enhancement works to existing community centres.  I am committed to delivering further iterations of the fund in the coming years in line with the commitment in the Programme for Government for this to become a permanent rolling fund. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 547. Deputy Michael Fitzmaurice asked the Minister for Rural and Community Development and the Gaeltacht when he will announce the grants for community centres; and if he will make a statement on the matter. [68990/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_490",
          "debateSectionId": "dbsect_490",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_490.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_547",
        "questionNumber": 547
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  The Agri-Climate Rural Environment Scheme, or ACRES, is the flagship environmental scheme provided under the 2023-2027 CAP Strategic Plan, with €1.5 billion in Exchequer and EU funding allocated over the course of the scheme. There are currently just over 53,600 participants in ACRES.  Almost €700 million has been paid in respect of the core ACRES scheme to date (1 December 2025) to ACRES participants. This includes almost €179.6 million which has issued in recent weeks in advance payments in respect of 2025. I can confirm that a total of 41,734 participants, representing just under 78% of active participating herds, have now received their 2025 advance payments. There are just under 12,000 herdowners awaiting their 2025 advance payments.  The issuing of advance payments in respect of 2025 commenced on 6 November 2025. My Department is continuing to process payment claims to issue in the next scheduled payrun. The schedule for future payments will be confirmed when finalised. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 208. Deputy Michael Fitzmaurice asked the Minister for Agriculture, Food and the Marine when the next payment run will be made for farmers who are not paid their ACRES first payment for the scheme year 2025, and the figures not paid yet for 2025 first payment; and if he will make a statement on the matter. [68177/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_179",
          "debateSectionId": "dbsect_179",
          "showAs": "Agriculture Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_179.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_208",
        "questionNumber": 208
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  My Department's gross voted allocation for 2025, including capital carryover, is €2.172 billion. In addition, my Department also received a Supplementary Estimate allocation of €98 million to address funding shortfalls for TB and ACRES. This brings the total voted gross allocation for 2025 to €2.270 billion.  Within this, the allocation for livestock schemes is €131.7 million, with a further €295 million allocated to ACRES.  In addition my Department also makes EU scheme payments totalling in excess of €1.25 billion to Irish farmers.  My Department is fully committed to making payments to farmers under the various schemes at the earliest date possible and to paying the maximum number of farmers possible. This commitment to farmers is evidenced in the very high payment rates achieved across all schemes over the last number of years in respect of both Exchequer and EU funded schemes.  The timelines for all schemes, including the planned payment dates are outlined in the Farmers' Charter.  Payments under a number of schemes, including the Areas of Natural Constraints (ANC) scheme and the Basic Income Support for Sustainability (BISS) and Complementary Redistribution Income Support for Sustainability (CRISS) are well underway, having commenced in September and October respectively.  In addition payments under the ACRES scheme commenced recently, while payments under the Beef Welfare Scheme 2025 commenced Monday (1 December).  Payments under all schemes will continue on an ongoing basis as further cases are cleared for payment. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 209. Deputy Michael Fitzmaurice asked the Minister for Agriculture, Food and the Marine if his Department has enough funding to pay farmers in the different agricultural schemes the money they are owed before the year end 2025; and given his Department’s payments and budget, whether he envisages a shortfall in any scheme; and if he will make a statement on the matter. [68178/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_180",
          "debateSectionId": "dbsect_180",
          "showAs": "Agriculture Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_180.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_209",
        "questionNumber": 209
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school to which the Deputy refers was approved to enter the Department's pipeline for a project under the Additional School Accommodation scheme. The project will provide a three Class SEN Base, two General Classrooms, a Music Room, a Graphics Room, a Science Lab and Prep area, an Engineering Room and Prep area, a Home Economics Room and an Art Room.  A Stage 2a Report for the project was received by my department in June 2025 and is currently being reviewed from both a technical and cost perspective in accordance with the requirements of the Public Spending Code. All projects, including this one, will undergo the necessary due diligence outlined in the public Infrastructure Guidelines. Managing timing, scope, and cost is crucial to staying within budgetary limits for the overall program.  As this is a devolved project, all payments to design team members are managed directly by the School Authority. Once the required documentation is received, my Department will arrange for the appropriate funding to be issued to the School Authority.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project roll-out for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project roll-out over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  My department is now preparing an NDP implementation plan which is due for publication later in the year. This plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 218. Deputy Michael Fitzmaurice asked the Minister for Education and Youth when a project (details supplied) will receive stage 2 approval for the extension required; when outstanding stage one payments will be processed; and if she will make a statement on the matter. [67416/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_202",
          "debateSectionId": "dbsect_202",
          "showAs": "Education Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_202.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_218",
        "questionNumber": 218
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I am happy to advise that in 2022, the school referred to by the Deputy was approved for a traditional build project to provide 2x Mainstream classrooms, 1x Music room, 1x Graphics room, 1x Art room, 1x Science lab and prep area, 1x Engineering room and prep area, 2x Project stores, 1x Home Economics room and 3x Special education classrooms which is currently at stage 2A.  In 2024, the school was also provided with capital funding to provide an interim Home economics room and conversion of space to provide female toilets due to a change to co-education status.  In July, the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation the Department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project roll-out for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project roll-out over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  All Government departments are expected to publish their sectoral NDP Implementation Plans shortly. My department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  The school's application for additional accommodation is currently being considered as part of the prioritisation process and the school will be advised directly once this process is completed and a decision has been made. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 219. Deputy Michael Fitzmaurice asked the Minister for Education and Youth if approval will be granted for the required four modular classrooms and a modular technology engineering room for a school (details supplied) to allow it to cater for current students and to cater for the increasing enrolment in September 2026; and if she will make a statement on the matter. [67417/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_203",
          "debateSectionId": "dbsect_203",
          "showAs": "School Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_203.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_219",
        "questionNumber": 219
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  In 2025 my Department provided for an overall budget of €854,000 under the Equine Technical Support Scheme. The scheme supports the development of our native equine industry through targeted investment under three programme headings, namely  -General Programme;  -Training/Education Programme; and  - Research into Equine Diseases Programmes.  The information requested by the Deputy in respect of the Equine Technical Support Scheme 2025 is as follows:  ETS Projects Approved 2025     Year    Recipient    Project    Funding approved    Rate of aid (%)      2025    Connemara Pony Breeders' Society    Parentage Verification for First Time Registrations 2025    €86,716.00    70%      2025    Connemara Pony Breeders' Society    AIM’S Reset API    €6,650.00    70%      2025    Connemara Pony Breeders' Society    Database upgrades    €1,470.00    70%      2025    Connemara Pony Breeders' Society    Database upgrades    €1,435.00    70%      2025    Connemara Pony Breeders' Society    Online Inspection entry    €7,770.00    70%      2025    Connemara Pony Breeders' Society    IT development    €8,155.00    70%      2025    Connemara Pony Breeders' Society    IT development    €15,155.00    70%      2025    Connemara Pony Breeders' Society    Online Show Entry    €9,275.00    70%      2025    Connemara Pony Breeders' Society    Purchase of new passport stud machine    €4,033.74    70%      2025    Connemara Pony Breeders' Society    CPBS Stand at the RDS (Dublin Horse Show) 2025    €11,655.00    100%      2025    Connemara Pony Breeders' Society    Marketing and Promotion    €16,000.00    80%      2025    Connemara Pony Breeders' Society    Inspections within the CPBS Studbook    €79,142.00    70%      2025    Connemara Pony Breeders' Society    Connemara Pony Breeders Education Initiative 2025:  Bridging Tradition and Innovation    €11,211.20    80%      2025    Horse Sport Ireland (HSI)    Exhibit at Royal Dublin Society - Dublin Horse Show 2025    €10,681.63    33%      2025    Horse Sport Ireland (HSI)    Horse Sport Ireland Studbook foal DNA Typing (Parentage verification and genotyping)    €114,100.00    70%      2025    Horse Sport Ireland (HSI)    Genetic Indexing    €6,174.00    70%      2025    Horse Sport Ireland (HSI)    Irish Cob Studbook Stallion, Mare & Gelding Inspections.    €6,064.80    70%      2025    Horse Sport Ireland (HSI)    Selection of Mares in the Irish Draught, Irish Sport Horse and Irish Sport Pony Studbooks    €54,079.20    70%      2025    Horse Sport Ireland (HSI)    Lean processing – Passporting and registrations services    €22,000.00    50%      2025    Horse Sport Ireland (HSI)    Irish Draught, Irish Sport Horse, and Irish Sport Pony Studbook Stallion Selections    €38,026.52    70%      2025    Horse Sport Ireland (HSI)    HorseSource I.T. Development    €50,000.00    70%      2025    Horse Sport Ireland (HSI)    Customer Services Training    €1,500.00    50%      2025    Horse Sport Ireland (HSI)    Studbook Arena Party Training    €5,166.00    100%      2025    Horse Sport Ireland (HSI)    Exchange of Information for Inspection Processes - Irish Draughts 2025    €7,104.00    100%      2025    Horse Sport Ireland (HSI)    Linear Profiling & Research Dissemination    €5,180.00    70%      2025    Warmblood Studbook of Ireland (WSI)    Advanced Training in Evaluation of Conformation, Gaits, Loose-Jumping, and Arena Jumping Using WSI's Linear Profile System    €6,846.41    100%      2025    Warmblood Studbook of Ireland (WSI)    Equipment for Studbook Development    €4,515.28    70%      2025    Warmblood Studbook of Ireland (WSI)    Stallion Inspections for Designation as WSI Approved Stallion    €12,878.48    70%      2025    Warmblood Studbook of Ireland (WSI)    WFFS1 Testing of Fillies, Approved Mares, and Studbook Mares    €2,730.00    70%      2025    Kerry Bog Pony Co-operative Society Limited    Studbook Development: Kerry Bog Pony Studbook Inspections    €4,900.00    70%      2025    Kerry Bog Pony Co-operative Society Limited    Studbook Marketing: Kerry Bog pony Pop-up banners and associated marketing materials    €1,168.50    100%      2025    Kerry Bog Pony Co-operative Society Limited    Education and Training: Training seminar covering the importance of Kerry Bog Pony Inspections to the Studbook    €2,100.00    100%      2025    Irish Harness Racing Association CLG    PA System    €9,850.00    50%      2025    Irish Harness Racing Association CLG    Upgrading IHRA Vaccination and Medication Database    €17,500.00    70%      2025    Irish Harness Racing Association CLG    Upgrade of Passport producing equipment    €990.50    70%      2025    Irish Harness Racing Association CLG    National Ploughing Championship 2025    €6,069.00    100%      2025    Irish Harness Racing Association CLG    Number Cloth Identification System 2025    €9,120.00    70%      2025    Irish Harness Racing Association CLG    Irish Harness Racing Stud Book Development    €3,194.80    70%      2025    Irish Harness Racing Association CLG    Breeding Performance Authentication 2025    €40,000.00    70%      2025    University College Dublin    Decoding the uterine microbiome in healthy fertile mares: a path for practical applications    €48,842.00    100%      2025    University College Dublin    Placentitis in Irish Broodmares: Examining diagnostic methods to maximise mare and foal health and welfare    €37,000.64  *REVISED TO:  €36,738.28    100%      2025    Irish Equine Centre (IEC)    Molecular characterization of Methicillin Resistant Staphylococcus aureus (MRSA) isolates from Irish Horses    €122,648.40    100%      2025    ITBA    ITBA Education Programme 2025    €9,409.00    100%      2025    Irish Horse Board (IHB)    Education & Training-Marketing skills for breeders and producers to maximise their market opportunities    €27,372.50    100%      2025    Connemara Pony World    Connemara Pony Tales Podcast: Promoting the Connemara Pony Worldwide    €12,441.45    50%      2025    The Irish Field    Artificial Intelligence in the Equine Sector Seminar    €5,000.00    100%       ETS Projects not approved 2025     Year    Recipient    Project    Funding approved    Rate of aid (%)      2025    UCD    Healthy Horses and ponies during and after general anaesthesia for a common elective surgical procedure    n/a    n/a      2025    WSI    Graphic Design of SDI Logo and Breeding & Production Passport Cover    n/a    n/a      2025    CPBS    CPBS stand at National Ploughing Championships 2025    n/a    n/a      2025    HSI    World Breeding News Magazine    n/a    n/a      2025    WSI    Studbook Subscription to Breeding News for Sport Horses for Breeder Education    n/a    n/a      2025    CPBS    Genomic Profiling for First Time Registrations    n/a    n/a      2025    CPBS    Genomic Profiling for adult animals & first-time registration adult animals    n/a    n/a      2025    CPBS    Connemara Pony Breeders’ Society stand at HOYS (Horse of the Year Show) 2025    n/a    n/a      ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 462. Deputy Michael Fitzmaurice asked the Minister for Agriculture, Food and the Marine further to Parliamentary Question No. 801 of 12 November 2025 if he will confirm the money allocated to each project application in 2025 under the equine technical support scheme, the percentage rate of funding; the unsuccessful applications, in tabular form; and if he will make a statement on the matter. [67718/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_406",
          "debateSectionId": "dbsect_406",
          "showAs": "Horse Racing Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_406.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_462",
        "questionNumber": 462
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  The Studbook Service contracts to which the Deputy refers commenced in January 2023 for a period of 24 months with the option to extend the term of the contract for a period up to 24 months with a maximum of one such extension. In line with the provisions of the contract it was decided that the contract would be extended for 12 months to the end of 2025.  A procurement competition was recently held for the provision of this service for the period from 1 January 2026. This procurement process is on-going and accordingly I am not in a position to release specific details requested regarding this competition.  The evaluation panel and qualifications for the studbooks request for tender were as follows:  Assessment Panel – Studbooks     Name    Qualifications      Mr Paul Dillon – Chair of panel    Former Assistant Secretary General of the Department of Agriculture, Food and the Marine. Invited onto the assessment panel to contribute his extensive knowledge, experience and competence in dealing with processes and procedures within the Civil Service and his broad and detailed knowledge of the Agricultural sector in Ireland.      Prof Donagh Berry    Prof. Donagh Berry is a Senior Principal Researcher in Quantitative Genetics at Teagasc. He leads research in quantitative genetics and animal breeding across a range of species including cattle, sheep, horses and dogs pioneering the development of genomic selection in cattle in Ireland as well as the national breeding objectives and breeding scheme design. He has a PhD in quantitative genetics and MSc in Bioinformatics and Systems Biology. Donagh was invited to form part of the evaluation panel because of his >25 years’ extensive knowledge on topics contributing to the success of animal breeding programs including phenotyping strategies, genetic and genomic evaluations, decision support tools, breeding goal development and deployment, breeding scheme design, validation and knowledge exchange      Dr Bridget Younge    Dr. Bridget Younge is an Associate Professor in Animal Nutrition at the University of Limerick. Her research includes nutrient metabolism and gastrointestinal function. She has over 25 years’ experience in animal nutrition research and university teaching, She lectures in equine nutrition, animal feeding and digestion, and equine genetics, and supervises undergraduate and postgraduate research. She also holds key governance roles as Course Director for Equine Science, Chair of the Student Status Committee, and the University Animal Ethics Committee. Bridget was invited to form part of the evaluation panel due to her practical and extensive knowledge of the sport horse industry and her research contributions, experience in academic governance and scientific evaluation.      Ms Frances MacAodhain    Frances MacAodhain is a Principal Officer in the Department of Agriculture, Food and the Marine. She is responsible for Animal Identification and Registration including equine traceability and the delivery of the Minister’s Action Plan to reform the equine traceability system in line with the recommendations of Professor Patrick Wall’s report. Ms MacAodhain was invited to form part of the evaluation panel due to her knowledge of the complexities of equine identification legislation and her role in overseeing equine passport services to ensure they are efficient, reliable and secure.      ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 463. Deputy Michael Fitzmaurice asked the Minister for Agriculture, Food and the Marine the reason a tender process was initiated one year earlier than expected for the studbook services contracts; the number of applicant bidders for each lot; the score each bidder received in each lot; the names and qualifications of each member of the evaluation panel; and if he will make a statement on the matter. [67719/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_407",
          "debateSectionId": "dbsect_407",
          "showAs": "Horse Racing Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_407.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_463",
        "questionNumber": 463
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "showAs": " 413. Deputy Michael Fitzmaurice asked the Minister for Education and Youth further to Parliamentary Question No. 93 of 6 March 2024, where the specific information requested regarding the publication of documentation demonstrating whether bank accounts, fund transfers, or other records prove that a surplus of €8.195 million from school transport was held by Bus Éireann on her behalf as of 31 December 2011 was not included; whether she accepts that the precise information sought was not supplied; whether she will now provide this information; the reason it was withheld; and if she will make a statement on the matter. [65905/25] ",
        "debateSection": {
          "showAs": "Bus Éireann",
          "debateSectionId": "dbsect_399",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_399",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_399.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Michael Fitzmaurice",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10",
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10"
        },
        "questionNumber": 413,
        "answerText": " Minister of State at the Department of Education  I propose to take Questions Nos. 413, 414 and 415 together.  As previously outlined, the 1975 Summary of Accounting Arrangements form the basis of the payment to Bus Éireann for the operation of the School Transport Scheme. In this regard, the Department reimburses Bus Éireann for a range of costs incurred in the operation and administration of the scheme. Re-imbursement to Bus Éireann is on a cost recovery basis.  The Comptroller and Auditor General (C&AG) carried out an examination of the provision of school transport and completed its report in August 2017 – the C&AG Special Report 98. The C&AG report referenced a surplus in the Transport Management Charge element of the costs. This amount was held by way of an uncommitted reserve by Bus Éireann to be used solely for the purposes of the School Transport Scheme. The balance on the uncommitted reserve was €8.1m at the end of December 2011 and reduced to €6.7m at the end of December 2018 when it was repaid fully to the Department.  The school transport scheme is a demand-led service based on the number of eligible children who apply to avail of transport. My Department works with Bus Éireann to analyse costs to the scheme on an on-going basis while each year the company produces an audited statement of account. This ensures that the financial information provided by Bus Éireann is in accordance with the relevant summary of accounting arrangements.  Bus Éireann provide the Department with an annual projected cost of school transport services together with a provisional spread of payments. These figures are incorporated into the Department’s annual profile of expenditure and are monitored on a monthly basis both in terms of the Department’s monthly profile of expenditure and Bus Éireann information based on actual costs versus projected costs. Expenditure headings and profiles are discussed at monthly meetings held between the Department and Bus Éireann. Where changes in projected expenditure occur, a new year-end forecast is submitted by Bus Éireann and reflected in a revised spread of payments.  Actual expenditure is finalised in the Bus Éireann annual statement of account which is independently audited by the Bus Éireann auditors in accordance with the 1975 Summary of Accounting Arrangements. Balances, where they occur, are accounted for in the following year’s projected cost.  The provision of the supporting documentation requested by the Deputy is not within the Department’s possession and the information provided above still remains. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_413",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 414. Deputy Michael Fitzmaurice asked the Minister for Education and Youth further to Parliamentary Question No. 94 of 6 March 2024, if she will investigate the reason her officials did not provide the information to the minister at the time in the preparation of the response sought by this Deputy regarding whether the transaction purportedly returning the net cash surplus of €6.7 million to her in 2018 was drawn from ‘the ring-fenced bank account’ purported to exist to separate funds from school transport from its commercial business; the corrective actions that will be taken to correct the record; and if she will make a statement on the matter. [65906/25] ",
        "debateSection": {
          "showAs": "Bus Éireann",
          "debateSectionId": "dbsect_399",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_399",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_399.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Michael Fitzmaurice",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10",
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10"
        },
        "questionNumber": 414,
        "answerText": " Minister of State at the Department of Education  I propose to take Questions Nos. 413, 414 and 415 together.  As previously outlined, the 1975 Summary of Accounting Arrangements form the basis of the payment to Bus Éireann for the operation of the School Transport Scheme. In this regard, the Department reimburses Bus Éireann for a range of costs incurred in the operation and administration of the scheme. Re-imbursement to Bus Éireann is on a cost recovery basis.  The Comptroller and Auditor General (C&AG) carried out an examination of the provision of school transport and completed its report in August 2017 – the C&AG Special Report 98. The C&AG report referenced a surplus in the Transport Management Charge element of the costs. This amount was held by way of an uncommitted reserve by Bus Éireann to be used solely for the purposes of the School Transport Scheme. The balance on the uncommitted reserve was €8.1m at the end of December 2011 and reduced to €6.7m at the end of December 2018 when it was repaid fully to the Department.  The school transport scheme is a demand-led service based on the number of eligible children who apply to avail of transport. My Department works with Bus Éireann to analyse costs to the scheme on an on-going basis while each year the company produces an audited statement of account. This ensures that the financial information provided by Bus Éireann is in accordance with the relevant summary of accounting arrangements.  Bus Éireann provide the Department with an annual projected cost of school transport services together with a provisional spread of payments. These figures are incorporated into the Department’s annual profile of expenditure and are monitored on a monthly basis both in terms of the Department’s monthly profile of expenditure and Bus Éireann information based on actual costs versus projected costs. Expenditure headings and profiles are discussed at monthly meetings held between the Department and Bus Éireann. Where changes in projected expenditure occur, a new year-end forecast is submitted by Bus Éireann and reflected in a revised spread of payments.  Actual expenditure is finalised in the Bus Éireann annual statement of account which is independently audited by the Bus Éireann auditors in accordance with the 1975 Summary of Accounting Arrangements. Balances, where they occur, are accounted for in the following year’s projected cost.  The provision of the supporting documentation requested by the Deputy is not within the Department’s possession and the information provided above still remains. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_414",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 415. Deputy Michael Fitzmaurice asked the Minister for Education and Youth further to Parliamentary Question No. 94 of 6 March 2024, to give supporting documentation demonstrating whether the ring fencing in bank accounts existed or whether fund funds were co-mingled in bank accounts and used as general cash flow (liquidity) as working capital across Bus Éireann’s commercial business; and if she will make a statement on the matter. [65907/25] ",
        "debateSection": {
          "showAs": "Bus Éireann",
          "debateSectionId": "dbsect_399",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_399",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_399.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Michael Fitzmaurice",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10",
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10"
        },
        "questionNumber": 415,
        "answerText": " Minister of State at the Department of Education  I propose to take Questions Nos. 413, 414 and 415 together.  As previously outlined, the 1975 Summary of Accounting Arrangements form the basis of the payment to Bus Éireann for the operation of the School Transport Scheme. In this regard, the Department reimburses Bus Éireann for a range of costs incurred in the operation and administration of the scheme. Re-imbursement to Bus Éireann is on a cost recovery basis.  The Comptroller and Auditor General (C&AG) carried out an examination of the provision of school transport and completed its report in August 2017 – the C&AG Special Report 98. The C&AG report referenced a surplus in the Transport Management Charge element of the costs. This amount was held by way of an uncommitted reserve by Bus Éireann to be used solely for the purposes of the School Transport Scheme. The balance on the uncommitted reserve was €8.1m at the end of December 2011 and reduced to €6.7m at the end of December 2018 when it was repaid fully to the Department.  The school transport scheme is a demand-led service based on the number of eligible children who apply to avail of transport. My Department works with Bus Éireann to analyse costs to the scheme on an on-going basis while each year the company produces an audited statement of account. This ensures that the financial information provided by Bus Éireann is in accordance with the relevant summary of accounting arrangements.  Bus Éireann provide the Department with an annual projected cost of school transport services together with a provisional spread of payments. These figures are incorporated into the Department’s annual profile of expenditure and are monitored on a monthly basis both in terms of the Department’s monthly profile of expenditure and Bus Éireann information based on actual costs versus projected costs. Expenditure headings and profiles are discussed at monthly meetings held between the Department and Bus Éireann. Where changes in projected expenditure occur, a new year-end forecast is submitted by Bus Éireann and reflected in a revised spread of payments.  Actual expenditure is finalised in the Bus Éireann annual statement of account which is independently audited by the Bus Éireann auditors in accordance with the 1975 Summary of Accounting Arrangements. Balances, where they occur, are accounted for in the following year’s projected cost.  The provision of the supporting documentation requested by the Deputy is not within the Department’s possession and the information provided above still remains. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_415",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 906. Deputy Michael Fitzmaurice asked the Minister for Health further to Parliamentary Question No. 1825 of 4 November 2025, if she will insure that the most vulnerable and disadvantaged people that are incapable of safely and effectively managing their medication regimen, will not be impacted by the ceasing of free dispensing of prescription medication in blister packs in January 2026 (details supplied); and if she will make a statement on the matter. [65924/25] ",
        "debateSection": {
          "showAs": "Medicinal Products",
          "debateSectionId": "dbsect_792",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_792",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_792.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Michael Fitzmaurice",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10",
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10"
        },
        "questionNumber": 906,
        "answerText": " Minister for Health  I propose to take Questions Nos. 879, 905, 906, 907, 931, 932, 933 and 934 together.  The Community Pharmacy Agreement 2025 was published on the 18th of September 2025, following the successful conclusion of negotiations with the Irish Pharmacy Union (IPU). The Agreement is supported by a €75 million new investment across 2025 and 2026.  The Agreement marks a significant milestone in the strategic collaboration between the Department of Health, the Health Service Executive (HSE), and the IPU. It sets out a comprehensive and ongoing pathway to modernise and expand the role of community pharmacy in Ireland’s healthcare system.  The Agreement is available on the Department of Health’s website at the following link: www.gov.ie/en/department-of-health/publications/community-pharmacy-agreement-2025/.  It is important to note that the Community Pharmacy Agreement 2025 does not remove phased dispensing.  Phased dispensing was introduced in 1996 for patient safety reasons. The supply of medication in instalments can support patients prescribed certain high-risk medications who are at risk of medication misadventure if these medications were to be supplied monthly, as is the norm under the community drug schemes. Where a phased dispensing claim is submitted, the current requirement is that an item must be dispensed in the pharmacy across multiple supply occasions. Community pharmacies receive additional payments in respect of phased dispensing.  Monitored Dosing Systems are systems that enable the individual medicine doses to be organised according to the prescribed dose schedule. These are sometimes referred to as blister packs. The State has never agreed to fund Monitored Dosing Systems.  However, a practice has built up whereby the use of Monitored Dosing Systems are charged as if for phased dispensing. The State has never agreed to this. Phased claiming was never intended to be used to submit claims in lieu of the provision of Monitored Dosing Systems.  Whilst Monitored Dosing Systems may have a role for some patients there is significant uncertainty around the robustness of the evidence supporting its use. The National Centre for Pharmacoeconomics carried out an evidence assessment which indicated that the evidence was, at best, equivocal to support such a programme.  Significant expenditure is therefore being incurred where it was never intended by the State. It has been agreed to introduce improved controls in this regard and to limit the use of phased dispensing to specified high risk drugs, where a patient safety concern may exist.  Phased dispensing support is currently available for medical card holders under the General Medical Services (GMS) Scheme for the following reasons:  Reason 1 - at the request of a patient's physician.  Reason 2 - due to the inherent nature of a medicinal product i.e. product stability and shelf life.  Reason 3 - where a patient is commencing new drug therapy with a view to establishing patient tolerance and acceptability before continuing on a full treatment regime.  Reason 4 - in exceptional circumstances where the patient is incapable of safely and effectively managing the medication regimen.  Under the Community Pharmacy Agreement 2025, from January 2026, phased dispensing under reason 1 and 4 will be limited to a defined set of high-risk medication classes. These are:  Psychotropics;  Opioids;  Codeine;  Pregabalin and gabapentin.  The approved list of medications under these classes will be provided by the HSE in due course.  For reasons 1 and 4, by focusing phased dispensing reimbursement on the medication categories on the approved list, phased dispensing payments can be targeted to medications with the highest risk or potential for misuse.  Phased dispensing fees will remain payable as per current arrangements under reasons 2 and 3 and will not be subject to the approved list.  The salient point here is that appropriate phased dispensing is not being removed in this Agreement.  The introduction of improved controls around phased dispensing is being done in a way which puts patient safety first and allows the State to repurpose €20m of funding to be used to implement new patient-centred services.  It remains open to pharmacies to charge patients for the use of Monitored Dosing Systems as a private service. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_906",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 907. Deputy Michael Fitzmaurice asked the Minister for Health if there is an established set of criteria put in place to assist pharmacies when assessing eligibility to receive free dispensing of prescription medication in blister packs; and if she will make a statement on the matter. [65925/25] ",
        "debateSection": {
          "showAs": "Medicinal Products",
          "debateSectionId": "dbsect_792",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_792",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_792.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Michael Fitzmaurice",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10",
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10"
        },
        "questionNumber": 907,
        "answerText": " Minister for Health  I propose to take Questions Nos. 879, 905, 906, 907, 931, 932, 933 and 934 together.  The Community Pharmacy Agreement 2025 was published on the 18th of September 2025, following the successful conclusion of negotiations with the Irish Pharmacy Union (IPU). The Agreement is supported by a €75 million new investment across 2025 and 2026.  The Agreement marks a significant milestone in the strategic collaboration between the Department of Health, the Health Service Executive (HSE), and the IPU. It sets out a comprehensive and ongoing pathway to modernise and expand the role of community pharmacy in Ireland’s healthcare system.  The Agreement is available on the Department of Health’s website at the following link: www.gov.ie/en/department-of-health/publications/community-pharmacy-agreement-2025/.  It is important to note that the Community Pharmacy Agreement 2025 does not remove phased dispensing.  Phased dispensing was introduced in 1996 for patient safety reasons. The supply of medication in instalments can support patients prescribed certain high-risk medications who are at risk of medication misadventure if these medications were to be supplied monthly, as is the norm under the community drug schemes. Where a phased dispensing claim is submitted, the current requirement is that an item must be dispensed in the pharmacy across multiple supply occasions. Community pharmacies receive additional payments in respect of phased dispensing.  Monitored Dosing Systems are systems that enable the individual medicine doses to be organised according to the prescribed dose schedule. These are sometimes referred to as blister packs. The State has never agreed to fund Monitored Dosing Systems.  However, a practice has built up whereby the use of Monitored Dosing Systems are charged as if for phased dispensing. The State has never agreed to this. Phased claiming was never intended to be used to submit claims in lieu of the provision of Monitored Dosing Systems.  Whilst Monitored Dosing Systems may have a role for some patients there is significant uncertainty around the robustness of the evidence supporting its use. The National Centre for Pharmacoeconomics carried out an evidence assessment which indicated that the evidence was, at best, equivocal to support such a programme.  Significant expenditure is therefore being incurred where it was never intended by the State. It has been agreed to introduce improved controls in this regard and to limit the use of phased dispensing to specified high risk drugs, where a patient safety concern may exist.  Phased dispensing support is currently available for medical card holders under the General Medical Services (GMS) Scheme for the following reasons:  Reason 1 - at the request of a patient's physician.  Reason 2 - due to the inherent nature of a medicinal product i.e. product stability and shelf life.  Reason 3 - where a patient is commencing new drug therapy with a view to establishing patient tolerance and acceptability before continuing on a full treatment regime.  Reason 4 - in exceptional circumstances where the patient is incapable of safely and effectively managing the medication regimen.  Under the Community Pharmacy Agreement 2025, from January 2026, phased dispensing under reason 1 and 4 will be limited to a defined set of high-risk medication classes. These are:  Psychotropics;  Opioids;  Codeine;  Pregabalin and gabapentin.  The approved list of medications under these classes will be provided by the HSE in due course.  For reasons 1 and 4, by focusing phased dispensing reimbursement on the medication categories on the approved list, phased dispensing payments can be targeted to medications with the highest risk or potential for misuse.  Phased dispensing fees will remain payable as per current arrangements under reasons 2 and 3 and will not be subject to the approved list.  The salient point here is that appropriate phased dispensing is not being removed in this Agreement.  The introduction of improved controls around phased dispensing is being done in a way which puts patient safety first and allows the State to repurpose €20m of funding to be used to implement new patient-centred services.  It remains open to pharmacies to charge patients for the use of Monitored Dosing Systems as a private service. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_907",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_296",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_296",
          "showAs": "Flood Risk Management",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_296.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 405. Deputy Michael Fitzmaurice asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if a location (details supplied) is showing on the flood plain; and if he will make a statement on the matter. [64727/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_405",
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation (Deputy Kevin Boxer Moran)  The OPW, through the Catchment Flood Risk Assessment and Management (CFRAM) Programme, carried out the largest ever flood risk study in Ireland to date, which assessed 80% of properties at risk from Ireland’s main causes of flooding. The OPW Flood Maps, that show the flood risk for 300 communities, are a key output of the study together with 29 Flood Risk Management Plans, with the proposed flood relief measures to address the flood risk in each community.  The Flood Maps are available to the public to view at www.floodinfo.ie. However, it is important to note that they are community based maps. The maps were not designed to designate individual properties at risk. The maps show the probable extent of flooding based on current and future projections.  In recent correspondence on this matter the Deputy has raised the issue of flood insurance. As I have set out in my response to the correspondence, the Disclaimer and Conditions for Use of OPW flood maps on www.floodinfo.ie includes a provision that users of the website must not use the flood maps, or any other content of the website for commercial purposes. As such, the Disclaimer prevents insurance companies from using the flood maps generated by the OPW.  The insurance industry has its own flood modelling tools for assessing the level of risk that it is willing to underwrite in relation to individual properties. Insurance Ireland, the representative body of the insurance industry, has highlighted to the OPW that it does not use the OPW flood maps to inform its flood modelling. The decision on whether to offer insurance, the level of premiums charged and the policy terms applied are matters for individual insurers. Insurance companies make commercial decisions on the provision of insurance cover based on their assessment of the risks they would be accepting on a case-by-case basis.  Insurance Ireland operates an Insurance Information Service for those who have queries, complaints or difficulties in relation to obtaining insurance, which can be contacted at 01 676 1914 or feedback@insuranceireland.eu. Similarly, Brokers Ireland, the representative body for insurance brokers in Ireland, has access to a wide range of providers and products, and can offer advice for customers when sourcing cover. Brokers Ireland can be reached at 01 661 3067. Furthermore, where an individual considers that they have been treated unfairly, they have the option of making a complaint to the Financial Services and Pensions Ombudsman (FSPO). The FSPO can be contacted either by email at info@fspo.ie or by telephone at 01 567 7000.  The Department of Finance has the lead policy responsibility for insurance matters, including flood insurance. The Department of Finance engages with the insurance industry on all aspects of insurance reform, including flood cover issues and efforts continue to be made to encourage a responsive approach to the provision of flood insurance from the insurance industry. In accordance with the EU framework for insurance (Solvency II Directive), the Government cannot direct the provision or pricing of insurance products.  The OPW in partnership with Galway County Council have appointed Arup in conjunction with Hydro-Environmental Ltd. to assess, develop and design a viable, cost-effective and environmentally sustainable flood relief scheme for Ballinasloe. Ryan Hanley Ltd. has also been appointed to undertake the environmental appraisals for the scheme. The Ballinasloe Flood Relief Scheme is currently at scheme development and preliminary design stage with the Statutory Public Exhibition period scheduled to commence in Q2 2026. Further information on this Scheme is available at, www.floodinfo.ie/ballinasloefrs. ",
        "questionNumber": 405,
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  The European Union (Household Food Waste and Bio-waste) Regulations 2023, which came into force on the 1st January 2024, obliges collectors to provide a reusable receptacle for bio-waste to all their customers regardless of where they live.  Enforcement of the regulations is a matter for the relevant local authority.  As such I would advise any householder who has not yet been provided with bio-waste collection service by their waste collector to contact their relevant local authority who will investigate the matter on their behalf. The Environment section of Galway County Council may be contacted at Environment@galwaycoco.ie.  Household and commercial waste segregation is a National Waste Enforcement Priority for 2025 therefore local authority waste enforcement efforts will continue to be targeted towards ensuring that all waste collectors are providing the level of service as required. ",
        "to": {
          "showAs": "Climate",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Michael Fitzmaurice",
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_181.xml"
            }
          },
          "debateSectionId": "dbsect_181",
          "showAs": "Waste Management",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_181"
        },
        "questionNumber": 224,
        "date": "2025-11-12",
        "showAs": " 224. Deputy Michael Fitzmaurice asked the Minister for Climate, Energy and the Environment when a company (details supplied) will provide the composting bins to customers pursuant to 2023 legislation to allow every household in the State to be provided with a brown bin for food waste and light garden waste by their waste collector; and if he will make a statement on the matter. [60910/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_224"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The Programme for Government contains a commitment to introduce the Automatic Enrolment (AE) Retirement Savings System.  The aim of introducing AE is to address the pension coverage gap that exists in Ireland and to provide workers with greater comfort and security regarding their retirement income. The new system - to be known as My Future Fund - will commence from 1 January 2026.  The implementation of My Future Fund will pave the way for around 800,000 workers to be brought into a retirement savings scheme for the first time and I look forward to its implementation.  My Future Fund is designed to complement rather than replace existing retirement savings provision.  Employees who are already enrolled in a qualifying occupational scheme, PRSA, trust RAC or a PEPP and who pay their contributions through payroll will be exempt from My Future Fund.  Such employees will not qualify for the direct State top-up contribution of €1 for every €3 that a participant in My Future Fund will be provided with when they save for their retirement. Instead, the financial incentive that contributors to qualifying occupational pension schemes, PRSAs, trust RAC or a PEPP benefit from is provided through income tax relief on pension contributions, which is given at their marginal rate of income tax.  I hope that this clarifies matters for the Deputy. ",
        "to": {
          "showAs": "Social",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Michael Fitzmaurice",
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_567.xml"
            }
          },
          "debateSectionId": "dbsect_567",
          "showAs": "Pension Provisions",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_567"
        },
        "questionNumber": 649,
        "date": "2025-11-12",
        "showAs": " 649. Deputy Michael Fitzmaurice asked the Minister for Social Protection if a person who has a private pension scheme through their employment would be able to qualify for the Government contribution part of the auto-enrolment pension scheme from January 2026, when the new pension scheme comes into effect; and if he will make a statement on the matter. [60984/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_649"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The farm assist scheme was introduced in 1999 to provide income support for low income farmers.  It replaced the former smallholder's unemployment assistance payment. In line with the then pre-existing arrangements for unemployment assistance (including smallholders), any income from self-employment was exempt from the class S social insurance charge applied to self-employed workers, regardless of the level of such income.  This exemption was abolished in 2007.  Since 1 January 2007, those persons receiving farm assist are liable to pay a class S social insurance contribution on their annual self-employed income, provided it is €5,000 or more.  These contributions entitle such persons to a range of social insurance benefits, most notably the state pension (contributory).  For those earning below €5,000 per annum, the voluntary contributions scheme may be available to them, dependent on meeting the qualifying criteria.  This scheme gives an opportunity to persons who were, but who are no longer, compulsorily insured under the social insurance system, to pay contributions directly to my Department.  Voluntary contributions ensure continuity of social insurance for pension purposes during periods where former contributors are no longer insured as employed or self-employed persons.  The credited contribution scheme (“credits”), which relates to employee contributions only, is an integral part of the social insurance system.  Credits cover gaps in an employee’s social insurance record where they are not in a position to pay social insurance such as during periods of unemployment, illness, etc.  Credits are not available to class S self-employed contributors, including recipients of farm assist.  Employees are only insured on a week by week basis while self-employed contributors are insured on an annual basis.  This means that self-employed contributors pay a single annual social insurance contribution which entitles them to the full 52 contributions awarded in a year, regardless of when they worked to generate their income, whether in as little as one week or throughout the full year.  I am satisfied with the current arrangements whereby class S PRSI is payable from a low level of income of €5,000 per annum and the voluntary contributions scheme is available for those with income below that level.  I trust this clarifies the matter for the Deputy. ",
        "to": {
          "showAs": "Social",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Michael Fitzmaurice",
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_600.xml"
            }
          },
          "debateSectionId": "dbsect_600",
          "showAs": "Social Welfare Benefits",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_600"
        },
        "questionNumber": 685,
        "date": "2025-11-12",
        "showAs": " 685. Deputy Michael Fitzmaurice asked the Minister for Social Protection to reconsider the decision to make farm assist a credited benefit so that participants do not lose out on contributions while in receipt of this payment; and if he will make a statement on the matter. [62041/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_685"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  The Equine Technical and Equine Breeding Scheme 2024 and 2025 comprised of three programme headings: General Programme; Training/Education Programme; and Research into Equine Diseases Programme. The funding is provided to support various equine industry projects. Applicants must comply with the specific terms and conditions of each programme which are published annually on my Department's website. The 2024 and 2025 ETS Terms and Condition for these programmes are attached and the link to the 2026 ETS Scheme and Conditions is Animal Breeding).  As per EU Regulation 2022/2472, certain project costs may be capped in respect of the maximum funding permitted by my Department towards the overall cost of the project. Any shortfall in funding a project as a result of applying these caps is a matter for the recipient.  A detailed breakdown of the recipients of the 2024 funding, the initiatives supported, and the grant awarded is attached. All recipients of payments in 2024 met the eligibility criteria. In 2024, certain research projects were granted a deviation to allow extra time for research reports to be published.  The 2025 projects are currently being assessed for payments. However, a list of the 2025 approvals can be found at ETS_2025_Approved_Projects_140425.pdf.      2024 Equine Technical Support Scheme                            Year      Recipient      Project      Funding granted      Funding paid      % Funded of overall cost       2024    CPBS    Passport Tracking on AMS 2024    €3,400.00    €3,400.00    70%      2024    CPBS    DNA Testing for first time Registrations 2024    €82,150.00    €80,861.53    40%      2024    CPBS    DNA Status Display (AMS Upgrade)    €1,950.00    €1,950.00    50%      2024    CPBS    Inspections within the CPBS Studbook    €69,730.50    €62,702.93    70%      2024    CPBS    DNA Status Display (AMS Upgrade) #2    €9,875.00    €8,475.00    50%      2024    CPBS    CPBS Stand at RDS Dublin Horse Show 2024    €10,950.00    €9,450.05    100%      2024    CPBS    SNP Passport Tracking on AMS    €2,050.00    €2,050.00    50%      2024    HSI    Selection of Mares in the Irish Draught, Irish Sport Horse and Irish Sport Pony Studbooks    €53,978.40    €34,034.23    70%      2024    HSI    Irish Cob Studbook Stallions, Mare & Gelding Inspections    €7,887.57    €1,519.78    70%      2024    HSI    Genetic Indexing    €5,365.50    €0.00    70%      2024    HSI    World Breeding |News Magazine    €4,250.00    €4,250.00    100%      2024    HSI    Exhibit at Royal Dublin Society Dublin Horse Show 2024    €10,642.02    €7,628.33    33%      2024    HSI    Irish Draught, Irish Sport Horse and Irish Sport Pony Studbook Stallion Inspections    €40,578.61    €31,960.45    70%      2024    HSI    Horse Sport Ireland Studbook DNA Typing    €136,920.00    €122,925.87    70%      2024    HSI    Linear Profiling    €12,555.00    €2,417.02    100%      2024    HSI    Exchange of Information for Inspection Processes Irish Draughts Studbook 2024    €11,418.20    €5,530.00    100%      2024    HSI    Exchange of Information for Inspection Processes Irish Sport Horse    €10,148.20    €8,432.73    100%      2024    IEC    Investigation of viral diarrhoea in foals - surveillance, improved diagnostics & metagenomic analysis    €163,397.00    €163,397.00    100%      2024    IHRA    Irish Harness Racing Studbook Development    €3,858.75    €2,117.64    70%      2024    IHRA    Breeding Performance Authentication 2024    €43,879.50    €39,467.49    70%      2024    IHRA    IHRA Studbook Development & Performance Infrastructure    €37,500.00    €37,500.00    50%      Education Training 2024    Funding of Research    Technical Support Scheme General 2025    Technical Support Scheme General 2024    Funding research in to Equine Diseases    Terms and Conditions Education Training 2025  ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Michael Fitzmaurice",
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_694.xml"
            }
          },
          "debateSectionId": "dbsect_694",
          "showAs": "Horse Racing Industry",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_694"
        },
        "questionNumber": 801,
        "date": "2025-11-12",
        "showAs": " 801. Deputy Michael Fitzmaurice asked the Minister for Agriculture, Food and the Marine if he will make the terms and conditions available for the equine technical support scheme operated by his Department for 2024 and 2025; if he can confirm the recipients of the funding, the initiative supported, the amount of grant awarded and eventually paid to date to each recipient, in tabular form; if he is satisfied that each recipient of the funding met the stated eligibility criteria; the non-Department costs of each initiative, and how that shortfall was funded; to highlight any deviation from the stated criteria and the reasons for such deviation; and if he will make a statement on the matter. [61398/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_801"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Health  Hi, we have asked the HSE to respond directly to the Deputy on this matter, thanks ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Michael Fitzmaurice",
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_880.xml"
            }
          },
          "debateSectionId": "dbsect_880",
          "showAs": "Health Services Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_880"
        },
        "questionNumber": 1023,
        "date": "2025-11-12",
        "showAs": " 1023. Deputy Michael Fitzmaurice asked the Minister for Health if she will address the issue that a national transfer system does not exist for health and social care professionals only for clerical and management grades; when the need for fair mobility across the system will be available; and if she will make a statement on the matter. [61633/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_1023"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1106. Deputy Michael Fitzmaurice asked the Minister for Housing, Local Government and Heritage if carer’s allowance income is accessible when local authorities assess the income of a person in receipt of social housing supports; and if he will make a statement on the matter. [59347/25] ",
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1106",
        "questionNumber": 1106,
        "answerText": " Minister for Housing, Local Government and Heritage  Local authorities set and collect rents on their dwellings in accordance with section 58 of the Housing Act 1966. The making or amending of such rent schemes is generally a matter for local authorities within broad principles set out by my Department, including that rent levels should be based on income and reflect tenants’ ability to pay. The rent payable by a household deemed eligible for social housing support is calculated following the allocation of a dwelling.  Local discretion and flexibility are inherent in the devolved administration of rent schemes and different approaches are taken to rent setting across local authorities. Accordingly, decisions regarding the sources of income, such as Carer's Allowance, included and disregarded for rent assessment purposes are matters solely for individual local authorities. I have no role in this regard. ",
        "debateSection": {
          "showAs": "Social Welfare Payments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_963",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_963.xml"
            }
          },
          "debateSectionId": "dbsect_963"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Social",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1148. Deputy Michael Fitzmaurice asked the Minister for Social Protection to outline the decision making process on setting the limit on the length of time a person can work while been in receipt of carer’s allowance or carer’s benefit; and if he will make a statement on the matter. [57777/25] ",
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1148",
        "questionNumber": 1148,
        "answerText": " Minister for Social Protection  The key role of the Department of Social Protection is to provide income supports where an income need may arise due to, for example, unemployment, illness, disability or caring responsibilities.  The main income supports for family carers provided by my Department are Carer’s Allowance, Carer’s Benefit, Domiciliary Care Allowance and the Carer’s Support Grant. Spending on these payments is expected to amount to over €2.2 billion in 2026.  Carer’s Allowance and Carer’s Benefit are payments for people who are providing full-time care to someone who needs significant support due to age, disability or illness, including mental illness. The main objective of these payments is to provide an income support to carers whose ability to earn is substantially reduced because of their full-time caring responsibilities.  To qualify, for Carer's Allowance, Carer's Benefit or the Carer's Support Grant, the carer must provide full-time care and attention to a person who is so incapacitated that they require this level of care for at least 12 months.  A carer is considered to be providing full-time care and attention to a relevant person, where the number of hours providing such care is not less than 35 hours in a period of seven consecutive days, and care is provided on any five days, whether consecutive or not, within a period of seven consecutive days.  While these payments are based on the provision of full-time care and attention by the carer, they do allow carers to engage in training, education or work up to 18.5 hours per week. This threshold was increased from 15 hours as part of Budget 2020 following feedback from carers and carer's organisations who found the 15 hours too restrictive. In effect, this allows carers to participate in these activities for half of a full-time working week. During this time, adequate provision must be made for the care of the relevant person.  Both the full-time care and attention requirement and the 18.5-hour threshold are contained in the respective legislative provisions of the Carer’s Allowance, Carer’s Benefit and Carer’s Support Grant schemes.  In setting the relevant working hours thresholds, it is essential to balance the needs of the carer and the needs of the person receiving care.  I am satisfied that the 18.5-hour rule represents a reasonable balance between meeting the requirement for providing full-time care for the care recipient and the needs of the carer to engage in education, training or employment, supporting a carer’s continued connection to the workforce and broader social inclusion.  I trust this clarifies the matter for the Deputy. ",
        "debateSection": {
          "showAs": "Social Welfare Code",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_993",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_993.xml"
            }
          },
          "debateSectionId": "dbsect_993"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1624. Deputy Michael Fitzmaurice asked the Minister for Health if it is the case that the paediatric cardiology department at Crumlin Hospital is no longer seeing children in clinic, and only prioritising emergencies; and if she will make a statement on the matter. [57693/25] ",
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1624",
        "questionNumber": 1624,
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "debateSection": {
          "showAs": "Hospital Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1393",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1393.xml"
            }
          },
          "debateSectionId": "dbsect_1393"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1825. Deputy Michael Fitzmaurice asked the Minister for Health to review the Community Pharmacy Agreement to ensure that the most vulnerable that is, people who have reading difficulties, people with mobility difficulties, elderly disadvantaged persons will not be impacted by the ceasing of free dispensing of prescription medication in blister packs in January 2026 as these persons rely on the provision of blister pack medication by pharmacies for safe self - medication; and if she will make a statement on the matter. [58733/25] ",
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1825",
        "questionNumber": 1825,
        "answerText": " Minister for Health  The Community Pharmacy Agreement 2025 does not remove phased dispensing.  Phased dispensing was introduced in 1996 for patient safety reasons. The supply of medication in instalments can support patients prescribed certain high-risk medications who are at risk of medication misadventure if these medications were to be supplied on a monthly basis, as is the norm under the community drug schemes. Where a phased dispensing claim is submitted, the current requirement is that an item must be dispensed across multiple supply occasions. Community pharmacies receive additional payments in respect of phased dispensing.  Monitored Dosing Systems are systems that enable the individual medicine doses to be organised according to the prescribed dose schedule. These are sometimes referred to as blister packs. The State has never agreed to fund Monitored Dosing Systems.  However, a practice has built up whereby the use of Monitored Dosing Systems are charged as if for phased dispensing. The State has never agreed to this. Phased claiming was never intended to be used to submit claims in lieu of the provision of Monitored Dosing Systems.  Whilst Monitored Dosing Systems may have a role for some patients there is significant uncertainty around the robustness of the evidence supporting its use. The National Centre for Pharmacoeconomics carried out an evidence assessment which indicated that the evidence was, at best, equivocal to support such a programme.  Significant expenditure is therefore being incurred where it was never intended by the State. It has been agreed to introduce improved controls in this regard and to limit the use of phased dispensing to specified high risk drugs, where a patient safety concern may exist.  Phased dispensing support is currently available under the GMS (medical card) Scheme for the following reasons:  • Reason 1 - at the request of a patient's physician.  • Reason 2 - due to the inherent nature of a medicinal product i.e. product stability and shelf life.  • Reason 3 - where a patient is commencing new drug therapy with a view to establishing patient tolerance and acceptability before continuing on a full treatment regime.  • Reason 4 - in exceptional circumstances where the patient is incapable of safely and effectively managing the medication regimen.  Under the Community Pharmacy Agreement 2025, from January 2026, phased dispensing under reason 1 and 4 will be limited to a defined set of high-risk medication classes. These are:  • Psychotropics;  • Opioids;  • Codeine; and  • Pregabalin and gabapentin.  The approved list of medications under these classes will be provided by the HSE in due course.  For reasons 1 and 4, by focusing phased dispensing reimbursement on the medication categories on the approved list, phased dispensing payments can be targeted to medications with the highest risk or potential for misuse.  Phased dispensing fees will remain payable as per current arrangements under reasons 2 and 3 and will not be subject to the approved list.  The salient point here is that appropriate phased dispensing is not being removed in this Agreement.  The introduction of improved controls around phased dispensing is being done in a way which puts patient safety first and allows the State to repurpose €20m of funding to be used to implement new patient-centered services.  It remains open to pharmacies to charge patients for the use of Monitored Dosing Systems as a private service. ",
        "debateSection": {
          "showAs": "Departmental Policies",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1583",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1583.xml"
            }
          },
          "debateSectionId": "dbsect_1583"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1986. Deputy Michael Fitzmaurice asked the Minister for Health if she will carry out a review of the Community Pharmacy Agreement to ensure that the most vulnerable i.e. people who have reading difficulties, people with mobility difficulties and elderly disadvantaged people will not be impacted by the ceasing of phased dispensing in January 2026 (details supplied); and if she will make a statement on the matter. [59540/25] ",
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1986",
        "questionNumber": 1986,
        "answerText": " Minister for Health  The Community Pharmacy Agreement 2025 does not remove phased dispensing.  Phased dispensing was introduced in 1996 for patient safety reasons. The supply of medication in instalments can support patients prescribed certain high-risk medications who are at risk of medication misadventure if these medications were to be supplied on a monthly basis, as is the norm under the community drug schemes. Where a phased dispensing claim is submitted, the current requirement is that an item must be dispensed across multiple supply occasions. Community pharmacies receive additional payments in respect of phased dispensing.  Monitored Dosing Systems are systems that enable the individual medicine doses to be organised according to the prescribed dose schedule. These are sometimes referred to as blister packs. The State has never agreed to fund Monitored Dosing Systems.  However, a practice has built up whereby the use of Monitored Dosing Systems are charged as if for phased dispensing. The State has never agreed to this. Phased claiming was never intended to be used to submit claims in lieu of the provision of Monitored Dosing Systems.  Whilst Monitored Dosing Systems may have a role for some patients there is significant uncertainty around the robustness of the evidence supporting its use. The National Centre for Pharmacoeconomics carried out an evidence assessment which indicated that the evidence was, at best, equivocal to support such a programme.  Significant expenditure is therefore being incurred where it was never intended by the State. It has been agreed to introduce improved controls in this regard and to limit the use of phased dispensing to specified high risk drugs, where a patient safety concern may exist.  This is being done in a way which puts patient safety first and allows the State to repurpose €20m of funding to be used to implement new patient-centred services.  It remains open to pharmacies to charge patients for the use of Monitored Dosing Systems as a private service. ",
        "debateSection": {
          "showAs": "Community Care",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1721",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1721.xml"
            }
          },
          "debateSectionId": "dbsect_1721"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Budget 2026",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_421.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_421",
          "debateSectionId": "dbsect_421"
        },
        "to": {
          "showAs": "Social",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Social Protection  On Tuesday 7th October, over €1.15 billion of new social protection measures targeted to assist households were announced as part of Budget 2026.  The measures contained in the Budget are designed to support the most vulnerable in our society and there is a particular focus on tackling child poverty.  Included in this package are increases of €10 per week to maximum personal payment rates, benefitting people such as pensioners, people with disabilities, carers and lone parents, with proportionate increases for people receiving a reduced payment rate and for qualified adults.  The Budget increase of €10 in the maximum personal rate will bring the maximum personal rate of State Pension (Contributory) to €299.30 per week, and the maximum personal rate of State Pension (Non-Contributory) to €288.00 per week.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "showAs": " 511. Deputy Michael Fitzmaurice asked the Minister for Social Protection if he will confirm that all weekly contributory and weekly non-contributory pensioners will receive the full ten euros increase in Budget 2026 (details supplied); and if he will make a statement on the matter. [56523/25] ",
        "questionNumber": 511,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Michael Fitzmaurice",
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_511"
      }
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "by": {
          "showAs": "Michael Fitzmaurice",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10",
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "date": "2025-10-16",
        "questionNumber": 397,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/dbsect_377",
          "debateSectionId": "dbsect_377",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/mul@/dbsect_377.xml"
            }
          },
          "showAs": "Health Strategies"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-16/pq_397",
        "showAs": " 397. Deputy Michael Fitzmaurice asked the Minister for Health the breakdown, by location of each CR hub and its corresponding dedicated CR WTE allocation (details supplied); and if she will make a statement on the matter. [56461/25] "
      },
      "contextDate": "2025-10-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "by": {
          "showAs": "Michael Fitzmaurice",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10",
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "date": "2025-10-16",
        "questionNumber": 398,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/dbsect_378",
          "debateSectionId": "dbsect_378",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/mul@/dbsect_378.xml"
            }
          },
          "showAs": "Health Strategies"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-16/pq_398",
        "showAs": " 398. Deputy Michael Fitzmaurice asked the Minister for Health if she will provide a detailed list of hub sites and identify which locations are currently providing phase III CR (details supplied); and if she will make a statement on the matter. [56462/25] "
      },
      "contextDate": "2025-10-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "by": {
          "showAs": "Michael Fitzmaurice",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10",
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "date": "2025-10-16",
        "questionNumber": 399,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/dbsect_379",
          "debateSectionId": "dbsect_379",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/mul@/dbsect_379.xml"
            }
          },
          "showAs": "Health Strategies"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-16/pq_399",
        "showAs": " 399. Deputy Michael Fitzmaurice asked the Minister for Health the number of patients who completed a full phase III CR programme during 2024 in the community hub CR setting (details supplied); and if she will make a statement on the matter. [56463/25] "
      },
      "contextDate": "2025-10-16"
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_153.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_153",
          "debateSectionId": "dbsect_153"
        },
        "to": {
          "showAs": "Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Education and Youth  I wish to advise the Deputy that it is expected that all teachers who are employed in schools, or who are working in substitute capacity, are registered with the Teaching Council, which includes amongst other things having a teaching qualification.  Section 30 of the Teaching Council Act commenced on 1 November 2013 and took effect on 28 January 2014. From then, all teachers in recognised schools must be registered with the Teaching Council in order to be paid by the State. At the same time the Minister made regulations (further to amendment of Section 30 of the Teaching Council Act 2001 in the Education (Amendment) Act 2012), to enable a school in urgent or unforeseen circumstances e.g. to avoid closure of a school or cancellation of classes, to employ, for up to five consecutive days at a time, a person who is not registered as a teacher with the Teaching Council.  I can advise you that a statement of service has now been sent to the individual concerned, which notes the number of hours which have been completed by her in primary, secondary, community and comprehensive schools, to date. Should the individual have been employed by the Educational Training Board (ETB) she will need to contact them directly to obtain a statement of her service. ",
        "questionType": "written",
        "showAs": " 153. Deputy Michael Fitzmaurice asked the Minister for Education and Youth the number of hours   a person (details supplied) has completed in both national school and in secondary school since their time registered with her Department; and if she will make a statement on the matter. [55726/25] ",
        "questionNumber": 153,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Michael Fitzmaurice",
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_153"
      }
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Disease Management",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_292.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_292",
          "debateSectionId": "dbsect_292"
        },
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "questionType": "written",
        "showAs": " 304. Deputy Michael Fitzmaurice asked the Minister for Health the reason there is no acute asthma management plan in place, in and being adhered to in University College Hospital Galway; or if there is such a plan, if she could provide a copy of same; and if she will make a statement on the matter. [55678/25] ",
        "questionNumber": 304,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Michael Fitzmaurice",
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_304"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Animal Diseases",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_584.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_584",
          "debateSectionId": "dbsect_584"
        },
        "to": {
          "showAs": "Agriculture",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Agriculture, Food and the Marine  I published the Bovine TB Action Plan, “Addressing Bovine TB in Ireland”, on 9 September. The Action Plan follows extensive discussions with stakeholders in recent months. I also received support and approval from Cabinet on 24 June to address the current high levels of Bovine TB (bTB). The Action Plan is based on scientific research and veterinary expertise. There are five measures, which are underpinned by 30 actions:  Support herds free of bTB to remain free  Reduce the impact of wildlife on the spread of bTB  Detect and eliminate bTB infection as early as possible in herds with a bTB breakdown and avoid a future breakdown  Help farmers improve all areas of on-farm biosecurity  Reduce the impact of known high-risk animals in spreading bTB  Farmers from TB restricted herds can currently sell cattle directly to a single controlled finishing unit (CFU) without a pre-movement test. However, CFUs are required to comply with stringent conditions around bio-security and twice-yearly TB testing rules for CFUs with grazing. The new policy regarding the rules for movement of TB test negative animals from restricted herds to CFUs, via online mart sales, including the requirement of a 30 day pre-movement testing, is currently being reviewed by my Department. ",
        "questionType": "written",
        "showAs": " 732. Deputy Michael Fitzmaurice asked the Minister for Agriculture, Food and the Marine the reason a farmer with a TB restricted herd can sell cattle directly to a controlled finishing unit with no conditions attached, regardless of whether they are inside or outside the 30-day TB test window (details supplied); if marts will be allowed to operate under the same conditions as a farmer selling direct to a feedlot; and if he will make a statement on the matter. [54767/25] ",
        "questionNumber": 732,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Michael Fitzmaurice",
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_732"
      }
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10"
        },
        "showAs": " 230. Deputy Michael Fitzmaurice asked the Minister for Education and Youth if an increase in capitation funding for primary schools will be considered in view of rising costs; and if she will make a statement on the matter. [53783/25] ",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_237.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_237",
          "showAs": "School Funding",
          "debateSectionId": "dbsect_237"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_230",
        "answerText": " Minister for Education and Youth  The Government is committed to increasing funding to support schools, and the Programme for Government commits to increasing capitation funding to schools of all types to ensure that schools can meet the elevated day-to-day running costs.  The commitment in the Programme for Government builds on the progress which has been made in recent years, including an over €30 million permanent increase in capitation funding to assist schools now and longer term with increased day-to-day running costs through Budget 2025. This represents an increase of circa 12% on current standard rates and enhanced rates. This has resulted in the standard rates increasing from €200 to €224 for primary schools and from €345 to €386 per student in post-primary schools with effect from September 2025. Over the last two Budgets there has been a circa 22% increase in the level of capitation grant rates paid to schools. Enhanced rates are also paid in respect of pupils with special educational needs and Traveller pupils.  As part of the capitation package in Budget 2026, I am pleased that a total of €39m was secured for a permanent increase in mainstream capitation grant funding for schools, bringing the mainstream rate of capitation to €274 per pupil in primary schools and to €406 in post-primary schools for the 2026/2027 school year.  The Department is committed to providing funding to recognised primary and post-primary schools in the Free Education Scheme by way of per capita grants. The two main grants are the capitation grant to cater for day-to-day running costs such as heating, lighting, cleaning, insurance and general up-keep, and the ancillary grant to cater for the cost of employing ancillary services staff. Schools have the flexibility to use capitation funding provided for general running costs and ancillary funding provided for caretaking and secretarial services as a common grant from which the Board of Management can allocate according to its own priorities, except for the employment of relevant secretaries as per Circular 0036/2022.  The current standard rate of capitation grant is €224 per pupil in primary schools and €386 per student in post-primary schools. Primary schools with fewer than 60 pupils are paid the capitation and the ancillary grants on the basis of having 60 pupils.  Schools should also ensure that they are availing of the available OGP procurement frameworks and getting best value for money for all school expenditure.  The Financial Support Services Unit (FSSU), funded by the Department, is an important source of advice and support to schools on financial matters, including budgeting and cashflow management. Contact details for FSSU can be found on www.fssu.ie. ",
        "questionNumber": 230
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10"
        },
        "showAs": " 684. Deputy Michael Fitzmaurice asked the Minister for Health if the case of a person (details supplied) who is in a nursing home and in receipt of the fair deal support will be examined. [53697/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_630.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_630",
          "showAs": "Nursing Homes",
          "debateSectionId": "dbsect_630"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_684",
        "answerText": " Minister of State at the Department of Health  Under the Nursing Homes Support Scheme Act (2009), responsibility lies with the HSE to consider each individual application and accept it or reject it on the basis of legislative and operational guidelines.  I am precluded by the provisions of Section 10B of the Health Act 2004 (as inserted by Section 6 of the Health Service Executive (Governance) Act 2013) from directing the Health Service Executive (HSE) as regards any function of the HSE relating to the provision of treatment or of a health or personal social service to any particular person, or as regards any decision whether or not a particular person is eligible for a particular health or personal social service or the extent to which and the manner in which a person is eligible for such a service.  Under the Health Act 2004, the day-to-day operational responsibility for the management and delivery of health services is a matter for the HSE. Your query has therefore been forwarded to the HSE for their appropriate attention. ",
        "questionNumber": 684
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-24/pq_138",
        "answerText": " Minister for Agriculture, Food and the Marine (Deputy Martin Heydon)  The Department has lands at the locations listed on the attached excel document.  I can confirm that my Department did not receive CAP Payments in respect of the listed lands in 2024.  Details of all CAP beneficiaries in 2024 are available online at https://capben-ui.apps.services.agriculture.gov.ie/ and is searchable.   Schedule of land  ",
        "date": "2025-09-24",
        "questionNumber": 138,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/dbsect_150",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/mul@/dbsect_150.xml"
            }
          },
          "debateSectionId": "dbsect_150",
          "showAs": "Common Agricultural Policy"
        },
        "showAs": " 138. Deputy Michael Fitzmaurice asked the Minister for Agriculture, Food and the Marine further to Parliamentary Question No. 977 of 17 September 2025, if he will provide the details of the level of CAP funding received by his Department on Department for Agriculture; Food and the Marine lands in 2024; if he will provide a detailed list and funding amount for same; and if he will make a statement on the matter. [50618/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-24"
    },
    {
      "question": {
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-24/pq_150",
        "answerText": " Minister for Agriculture, Food and the Marine (Deputy Martin Heydon)  Details of all CAP beneficiaries in 2024 are available at CAP Beneficiaries Publication (https://capben-ui.apps.services.agriculture.gov.ie/) which is available on my Department's website at www.agriculture.gov.ie.  Further details on the definition of the categories of beneficiary sought would be needed in order to provide a more detailed response. ",
        "date": "2025-09-24",
        "questionNumber": 150,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/dbsect_157",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/mul@/dbsect_157.xml"
            }
          },
          "debateSectionId": "dbsect_157",
          "showAs": "Common Agricultural Policy"
        },
        "showAs": " 150. Deputy Michael Fitzmaurice asked the Minister for Agriculture, Food and the Marine to provide details of the level of CAP funding received by farmers only, Coillte, investment fund operators, not-for-profit organisations and for afforestation licence applications in 2024; and if he will make a statement on the matter. [50647/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-24"
    },
    {
      "question": {
        "date": "2025-09-23",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10"
        },
        "showAs": " 378. Deputy Michael Fitzmaurice asked the Minister for Housing, Local Government and Heritage if Statutory Instrument No. 374 of 2024, European Union (invasive Alien Species) Regulations 2024, are retrospective to before the date of the statutory instrument or S.I.; and if he will make a statement on the matter. [49931/25] ",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/mul@/dbsect_363.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/dbsect_363",
          "showAs": "Invasive Species Policy",
          "debateSectionId": "dbsect_363"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-23/pq_378",
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  The general principle is that legislation cannot be read to take effect retrospectively unless explicitly set out in the SI itself, and for very defined reasons. There are no such savers in Statutory Instrument No. 374 of 2024, European Union (invasive Alien Species) Regulations 2024. ",
        "questionNumber": 378
      },
      "contextDate": "2025-09-23"
    },
    {
      "question": {
        "date": "2025-09-23",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10"
        },
        "showAs": " 510. Deputy Michael Fitzmaurice asked the Minister for Agriculture, Food and the Marine if he will consider a review of his Departments approach to online restricted herd sales, in order that marts are allowed to operate on the same terms as private sales to CFUs; if he will move to 60 days; if so, when (details supplied); and if he will make a statement on the matter. [49868/25] ",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/mul@/dbsect_470.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/dbsect_470",
          "showAs": "Animal Sales",
          "debateSectionId": "dbsect_470"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-23/pq_510",
        "answerText": " Minister for Agriculture, Food and the Marine  I published the Bovine TB Action Plan, “Addressing Bovine TB in Ireland”, on 9 September. The Action Plan follows extensive discussions with stakeholders in recent months. I also received support and approval from Cabinet on 24 June to address the current high levels of Bovine TB (bTB). The Action Plan is based on scientific research and veterinary expertise. There are five measures, which are underpinned by 30 actions:  Support herds free of bTB to remain free  Reduce the impact of wildlife on the spread of bTB  Detect and eliminate bTB infection as early as possible in herds with a bTB breakdown and avoid a future breakdown  Help farmers improve all areas of on-farm biosecurity  Reduce the impact of known high-risk animals in spreading bTB  The Bovine TB Action Plan allows for the sale of bTB test negative cull cows from restricted herds through special cull cow sales in marts to Controlled Finishing Units. This measure was introduced to provide competition in the market for cull cows. These animals will not require a specific pre-movement test once they are negative at the breakdown test. The sale of cull cows from restricted herds at special mart sales will be expanded to include the sale of all dairy cull cows with no animals allowed return home from such sales. Cull dairy cows from non restricted herds can continue to be sold in marts on ordinary sale days.  Some of the actions in the plan will require ongoing engagement between my Department and stakeholders and this will continue in the coming months. My Department will ensure ongoing communications on the implementation of the actions in this plan to farmers. ",
        "questionNumber": 510
      },
      "contextDate": "2025-09-23"
    },
    {
      "question": {
        "date": "2025-09-18",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10"
        },
        "showAs": " 311. Deputy Michael Fitzmaurice asked the Minister for Agriculture, Food and the Marine if a premium will be payable to persons who as a result of storm Éowyn have to replant their forest under the new scheme; and if he will make a statement on the matter. [49341/25] ",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-18/writtens/mul@/dbsect_276.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-18/writtens/dbsect_276",
          "showAs": "Environmental Schemes",
          "debateSectionId": "dbsect_276"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-18/pq_311",
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  I recognise that the winter storms caused unprecedented challenge that the recent storms caused to forests and stakeholders this year. The volume of timber normally felled over a 2.5-year period was blown down overnight during storm Éowyn. An assessment carried out jointly by Coillte and my Department indicated a total of around 27,000 hectares were blown down, with just over 11,400 hectares of private forest.  My Departments developed a clear action plan in response which has included: setting up of a Windblow Taskforce; bringing in machines into the country to help with harvesting efforts; working with the ESB to protect power lines in case of future similar events; allowing thinning and clearfell licences to be used in removing storm damaged trees; and prioritising the processing of storm-related felling and road licence applications.  This action plan has redirected approximately 90% of the harvesting capacity in the country to work in windblow areas, and resulted in 65% of windblown trees already having a felling licence with an additional 20% applications in the system being prioritised.  While direct compensation cannot be paid, in accordance with EU State Aid rules, my Department is working to introduce a Reconstitution Scheme and I want to reassure affected forest owners that they will not be disadvantaged by undertaking works now.  I wish to reassure the Deputy and forest owners, that we continue to work hard to support everyone effected by Storm Éowyn and to secure a future for forestry in Ireland. ",
        "questionNumber": 311
      },
      "contextDate": "2025-09-18"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10"
        },
        "showAs": " 977. Deputy Michael Fitzmaurice asked the Minister for Agriculture, Food and the Marine the details of the level of CAP funding received by his Department on its lands; and if he will provide a detailed list and funding amount for same; and if he will make a statement on the matter. [48940/25] ",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_804.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_804",
          "showAs": "Common Agricultural Policy",
          "debateSectionId": "dbsect_804"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_977",
        "answerText": " Minister for Agriculture, Food and the Marine  The Department has lands at the following locations.  Backweston Farm, Celbridge, Co Kildare  Ballyderown Farm, Kilworth Co Cork  Kildalton Farm, Piltown, Co Kilkenny  Longtown Farm, Clane, Co KIldare  Mellows Campus, Athenry, Co Galway  Tops Potato Farm, Raphoe, Co Donegal  I can confirm that none of the above are in receipt of CAP Payments. ",
        "questionNumber": 977
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10"
        },
        "showAs": " 978. Deputy Michael Fitzmaurice asked the Minister for Agriculture, Food and the Marine to provide details of the level of CAP funding received by farmers only, Coillte, investment fund operators, not-for-profit organisations and for afforestation licence applications, in 2025; and if he will make a statement on the matter. [49000/25] ",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_805.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_805",
          "showAs": "Common Agricultural Policy",
          "debateSectionId": "dbsect_805"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_978",
        "answerText": " Minister for Agriculture, Food and the Marine  Details in relation to 2025 CAP Beneficiaries payments will not be available until the next publication date which is due on or before 31 May 2026. ",
        "questionNumber": 978
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10"
        },
        "showAs": " 1323. Deputy Michael Fitzmaurice asked the Minister for Health when the drug givinostat will be available through the HSE; and if she will make a statement on the matter. [48901/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_1131.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_1131",
          "showAs": "Medicinal Products",
          "debateSectionId": "dbsect_1131"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_1323",
        "answerText": " Minister for Health  Under the Health (Pricing and Supply of Medical Goods) Act 2013, the HSE has statutory responsibility for decisions on the pricing and reimbursement of medicines and medical devices; therefore, the matter has been referred to the HSE for attention and direct reply to the Deputy. ",
        "questionNumber": 1323
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 385. Deputy Michael Fitzmaurice asked the Minister for Transport when free travel for children under nine years of age will come into effect; and if he will make a statement on the matter. [46732/25] ",
        "by": {
          "memberCode": "Michael-Fitzmaurice.D.2014-10-10",
          "showAs": "Michael Fitzmaurice",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Fitzmaurice.D.2014-10-10"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_385",
        "questionNumber": 385,
        "answerText": " Minister for Transport  I propose to take Questions Nos. 383, 385 and 389 together.  The new Child (5–8) TFI Leap Card was launched on 3rd September, extending free travel on all PSO services to children aged 5 to 8 years. This welcomed initiative was announced as part of the Budget 2025 package of measures and delivers on a key Programme for Government commitment to make public transport more affordable and accessible for families. The extension of free travel for children under 9 builds on the 2017 introduction of free travel for children under five on subsidised public transport services.  The Child (5–8) TFI Leap Card expires at the end of the month in which the child turns nine. After this point, they should transition to using the Child (5–15) card for discounted fares. Revised Child (5-15) Leap Card products were introduced on 1st September across the Dublin Commuter Leap fare zones, offering a significantly increased discount of 67% off adult fares, up from the previous 50%. These enhanced fares apply to daily, weekly, and monthly ticket products and are available through the TFI Leap Top-Up App and leapcard.ie.  These changes follow a fare determination made in July, building on earlier adjustments in April and June, which established four new Leap fare zones covering Dublin and surrounding commuter areas.  Children travelling in Zones 2, 3, and 4 will now benefit from the same discount levels as those in Dublin City (Zone 1). Additionally, the revised structure allows onward travel within Zone 1 on TFI rail, Luas, and Dublin city buses at no extra cost.  This enhancement responds directly to public feedback and aims to make public transport more equitable, inclusive, and affordable for young people. ",
        "debateSection": {
          "showAs": "Public Transport",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_320",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_320.xml"
            }
          },
          "debateSectionId": "dbsect_320"
        }
      },
      "contextDate": "2025-09-08"
    }
  ]
}