{
  "head": {
    "counts": {
      "questionCount": 210,
      "resultCount": 210
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Culture, Communications and Sport  Coimisiún na Meán's strategy statement 2025-2027 sets out how it is working towards, amongst other things, an online media landscape that upholds the rights, wellbeing and development of children and their safer engagement with content. With that in mind, my Department and An Coimisiún have been engaging with relevant stakeholders to explore the feasibility of implementing a survey in schools in 2026. The structure, format and content of the planned survey has yet to be decided but the views of relevant stakeholders will be taken into consideration in doing so.  Online safety for children will be a key priority for me during Ireland's EU Presidency, which will run from July to December 2026. As part of preparations for this role, my Department will be working with children and young people to ensure that their voices are heard and reflected in discussions around the topic which will into our six-month Presidency programme. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 494. Deputy Joanna Byrne asked the Minister for Culture, Communications and Sport if the planned nationwide survey of children about their online experiences will include questions on gambling and gambling-related harm; and if he will make a statement on the matter. [73587/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joanna-Byrne.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29",
          "showAs": "Joanna Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_467",
          "debateSectionId": "dbsect_467",
          "showAs": "Online Safety",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_467.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_494",
        "questionNumber": 494
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The provision of a fire service in its functional area, including the establishment and maintenance of a fire brigade, the assessment of fire cover needs and the provision of fire station premises, is a statutory function of individual fire authorities under the Fire Services Acts, 1981 and 2003.  My Department supports the fire authorities through setting general policy, providing a central training programme, issuing guidance on operational and other related matters and providing capital funding for equipment and priority infrastructural projects.  Louth County Council has indicated that Dunleer remains their top priority project, and a new fire station at Dunleer is provided for in the Fire Services Capital Programme 2021 - 2025.  Upgrade works are also being progressed at the Dundalk firefighter training centre. The proposed training centre upgrade works would take place within the curtilage of the current site that is already in council ownership.  Louth County Council is working to finalise the acquisition of their preferred new site for Dunleer fire station. Upon final confirmation of the site acquisition, I understand that Louth County Council will move quickly through the necessary phases to progress the construction of a new station for Dunleer. My Department will continue to support Louth County Council to progress the new Dunleer fire station project. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 333. Deputy Joanna Byrne asked the Minister for Housing, Local Government and Heritage the status of the proposed new fire station in Dunleer, County Louth, in view of funding being redirected towards the firefighter centre of training in Dundalk; and if he will make a statement on the matter. [67648/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joanna-Byrne.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29",
          "showAs": "Joanna Byrne"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_301",
          "debateSectionId": "dbsect_301",
          "showAs": "Fire Stations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_301.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_333",
        "questionNumber": 333
      },
      "contextDate": "2025-12-02"
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 188. Deputy Joanna Byrne asked the Minister for Culture, Communications and Sport if the Telecommunications Response and Resilience Group (T-RRG), chaired by his Department will initiate a plan to ensure telecommunications poles are protected in future storms by identifying dangerous trees and initiating a tree cutting plan; and if he will make a statement on the matter. [66515/25] ",
        "answerText": "",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_188",
        "debateSection": {
          "showAs": "Telecommunications Infrastructure",
          "debateSectionId": "dbsect_177",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_177.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_177"
        },
        "date": "2025-11-26",
        "questionNumber": 188,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Joanna Byrne",
          "memberCode": "Joanna-Byrne.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29"
        },
        "questionType": "written",
        "to": {
          "showAs": "Culture",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 189. Deputy Joanna Byrne asked the Minister for Culture, Communications and Sport if the Telecommunications Response and Resilience Group (T-RRG) has identified measures to ensure that there are no future extended losses of connectivity for vulnerable people using a health monitoring/pendant alarm, as happened after storm Éowyn; and if he will make a statement on the matter. [66516/25] ",
        "answerText": "",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_189",
        "debateSection": {
          "showAs": "Telecommunications Infrastructure",
          "debateSectionId": "dbsect_178",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_178.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_178"
        },
        "date": "2025-11-26",
        "questionNumber": 189,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Joanna Byrne",
          "memberCode": "Joanna-Byrne.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29"
        },
        "questionType": "written",
        "to": {
          "showAs": "Culture",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "question": {
        "showAs": " 423. Deputy Joanna Byrne asked the Minister for Education and Youth the number of schools in County Louth that have sought assistance from the Financial Support Service Unit for each of the years 2020 to 2025; and if she will make a statement on the matter. [65935/25] ",
        "debateSection": {
          "showAs": "School Funding",
          "debateSectionId": "dbsect_407",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_407",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_407.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29",
          "memberCode": "Joanna-Byrne.D.2024-11-29"
        },
        "questionNumber": 423,
        "answerText": " Minister for Education and Youth  The table below lists the schools that have requested financial assistance from the Financial Support Service Unit (FSSU) for the years 2020 to 2025 for Co. Louth.     Schools seeking financial assistance in Co. Louth referred to the FSSU              School Year    Number of schools referred    Number of schools that received an advance in Capitation grant funding      2020/21    0    0      2021/22    0    0      2022/23    0    0      2023/24    0    0      2024/25    1    0      2025 (to date)    1    0     Schools in financial difficulty are encouraged to contact my Department for advice and support. The Department is committed to offering all available and appropriate supports to schools, which may include an advance in capitation grant funding or other measures.  The Department is constantly engaging with a number of schools in this respect. Schools that have contacted the Department have been referred to the FSSU.  The Financial Support Services Unit (FSSU), funded by the Department, is an important source of advice and support to schools on financial matters, including budgeting and cashflow management. Contact details for FSSU can be found on www.fssu.ie. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_423",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 428. Deputy Joanna Byrne asked the Minister for Education and Youth the date for the publishing of the proposed new DEIS Plan; and when her Department intend to communicate with school principals at existing DEIS schools in County Louth regarding the proposed DEIS plus part of this plan. [65943/25] ",
        "debateSection": {
          "showAs": "Educational Disadvantage",
          "debateSectionId": "dbsect_412",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_412",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_412.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29",
          "memberCode": "Joanna-Byrne.D.2024-11-29"
        },
        "questionNumber": 428,
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 428, 431, 432 and 433 together.  Tackling educational disadvantage and helping students reach their full potential is a key priority for me as the Minister for Education and Youth and for Government. Currently, the DEIS programme supports almost 1,200 primary and post-primary schools, reaching approximately 260,000 students, with an annual investment of over €180 million. Budget 2026 allocates an additional €16 million in 2026, rising to €48 million in 2027, to support the implementation of the new DEIS Strategy and introduce the DEIS Plus scheme, which will commence in 2026.  A new DEIS Strategy, which will include a DEIS Plus scheme will be published in early 2026. This strategy will focus on improving the opportunities and achievement levels of children at risk of educational disadvantage, developing more innovative approaches to tackling education disadvantage, and working towards a more flexible system of supports to ensure that a school can receive the right support at the right time.  The DEIS Plus scheme will provide additional support to schools with the highest levels of need, in line with the Government’s commitment. It will target a cohort of schools with high concentrations of children and young people experiencing intergenerational disadvantage where there is a significant gap in outcomes and there are barriers to those children and young people achieving their potential.  The process to identify schools for inclusion in DEIS Plus will be evidence-informed, using available data be evidence-informed, using available data.  The details of the DEIS Plus scheme are currently being finalised within an overall programme of work to tackle educational disadvantage and will be outlined in the new DEIS Strategy. Future allocation of overall resources will be considered within the context of the new DEIS Strategy and the availability of resources. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_428",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 429. Deputy Joanna Byrne asked the Minister for Education and Youth the form of collaboration that took place with principals of existing DEIS schools in County Louth regarding the development of the proposed DEIS plus scheme. [65944/25] ",
        "debateSection": {
          "showAs": "Educational Disadvantage",
          "debateSectionId": "dbsect_413",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_413",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_413.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29",
          "memberCode": "Joanna-Byrne.D.2024-11-29"
        },
        "questionNumber": 429,
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 429 and 430 together.  Tackling educational disadvantage and helping students reach their full potential is a key priority for me as Minister for Education and Youth. Currently, the DEIS programme supports almost 1,200 primary and post-primary schools, reaching approximately 260,000 students, with an annual investment of over €180 million. Budget 2026 allocates an additional €16 million in 2026, rising to €48 million in 2027, to support the implementation of the new DEIS Strategy and introduce the DEIS Plus scheme, which will commence in 2026.  In 2024, the Social Inclusion Unit in my Department carried out consultation workshops, focus groups and other engagements with key education stakeholders. These enabled direct engagement between policymakers and education stakeholders and were an opportunity for stakeholders to contribute to the development of the new DEIS Strategy and DEIS Plus scheme. Principals of schools in the DEIS programme in County Louth were involved in these consultations.  The workshops gathered detailed insights from teachers, school leaders, students, young people and other education experts on how resources are being used in schools. These insights informed the development of the new DEIS Strategy and DEIS Plus scheme and helped translate the OECD’s review on resourcing in schools to tackle education disadvantage recommendations into practical actions that can improve support for schools and students.  To further inform the development of the DEIS Plus scheme, a design advisory group was established including school principals, Home School Community Liaison officers, and School Completion Programme coordinators - professionals who work directly with children experiencing high levels of disadvantage.  The DEIS Plus scheme will provide additional support to schools with the highest levels of need, in line with the Programme for Government commitment. It will target a cohort of schools with the highest concentrations of children and young people experiencing intergenerational disadvantage where there is a significant gap in outcomes and there are barriers to those children and young people achieving their potential.  The process to identify schools for inclusion in DEIS Plus will be evidence-informed, using available data. The details of the DEIS Plus scheme are currently being finalised within an overall programme of work to tackle educational disadvantage and will be outlined in the new DEIS Strategy, which I intend to publish in early 2026.  Future allocation of overall resources will be considered within the context of the new DEIS Strategy and the availability of resources. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_429",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 430. Deputy Joanna Byrne asked the Minister for Education and Youth the form of engagement or collaboration that took place with home school community liaison workers, school completion programme workers, and children and young people from schools in County Louth in line with her stated intention to \"form a student-centred design approach\" for the proposed DEIS plus scheme. [65945/25] ",
        "debateSection": {
          "showAs": "Educational Disadvantage",
          "debateSectionId": "dbsect_413",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_413",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_413.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29",
          "memberCode": "Joanna-Byrne.D.2024-11-29"
        },
        "questionNumber": 430,
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 429 and 430 together.  Tackling educational disadvantage and helping students reach their full potential is a key priority for me as Minister for Education and Youth. Currently, the DEIS programme supports almost 1,200 primary and post-primary schools, reaching approximately 260,000 students, with an annual investment of over €180 million. Budget 2026 allocates an additional €16 million in 2026, rising to €48 million in 2027, to support the implementation of the new DEIS Strategy and introduce the DEIS Plus scheme, which will commence in 2026.  In 2024, the Social Inclusion Unit in my Department carried out consultation workshops, focus groups and other engagements with key education stakeholders. These enabled direct engagement between policymakers and education stakeholders and were an opportunity for stakeholders to contribute to the development of the new DEIS Strategy and DEIS Plus scheme. Principals of schools in the DEIS programme in County Louth were involved in these consultations.  The workshops gathered detailed insights from teachers, school leaders, students, young people and other education experts on how resources are being used in schools. These insights informed the development of the new DEIS Strategy and DEIS Plus scheme and helped translate the OECD’s review on resourcing in schools to tackle education disadvantage recommendations into practical actions that can improve support for schools and students.  To further inform the development of the DEIS Plus scheme, a design advisory group was established including school principals, Home School Community Liaison officers, and School Completion Programme coordinators - professionals who work directly with children experiencing high levels of disadvantage.  The DEIS Plus scheme will provide additional support to schools with the highest levels of need, in line with the Programme for Government commitment. It will target a cohort of schools with the highest concentrations of children and young people experiencing intergenerational disadvantage where there is a significant gap in outcomes and there are barriers to those children and young people achieving their potential.  The process to identify schools for inclusion in DEIS Plus will be evidence-informed, using available data. The details of the DEIS Plus scheme are currently being finalised within an overall programme of work to tackle educational disadvantage and will be outlined in the new DEIS Strategy, which I intend to publish in early 2026.  Future allocation of overall resources will be considered within the context of the new DEIS Strategy and the availability of resources. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_430",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 431. Deputy Joanna Byrne asked the Minister for Education and Youth the number of additional people the proposed DEIS Plus plan will support in County Louth. [65946/25] ",
        "debateSection": {
          "showAs": "Educational Disadvantage",
          "debateSectionId": "dbsect_412",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_412",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_412.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29",
          "memberCode": "Joanna-Byrne.D.2024-11-29"
        },
        "questionNumber": 431,
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 428, 431, 432 and 433 together.  Tackling educational disadvantage and helping students reach their full potential is a key priority for me as the Minister for Education and Youth and for Government. Currently, the DEIS programme supports almost 1,200 primary and post-primary schools, reaching approximately 260,000 students, with an annual investment of over €180 million. Budget 2026 allocates an additional €16 million in 2026, rising to €48 million in 2027, to support the implementation of the new DEIS Strategy and introduce the DEIS Plus scheme, which will commence in 2026.  A new DEIS Strategy, which will include a DEIS Plus scheme will be published in early 2026. This strategy will focus on improving the opportunities and achievement levels of children at risk of educational disadvantage, developing more innovative approaches to tackling education disadvantage, and working towards a more flexible system of supports to ensure that a school can receive the right support at the right time.  The DEIS Plus scheme will provide additional support to schools with the highest levels of need, in line with the Government’s commitment. It will target a cohort of schools with high concentrations of children and young people experiencing intergenerational disadvantage where there is a significant gap in outcomes and there are barriers to those children and young people achieving their potential.  The process to identify schools for inclusion in DEIS Plus will be evidence-informed, using available data be evidence-informed, using available data.  The details of the DEIS Plus scheme are currently being finalised within an overall programme of work to tackle educational disadvantage and will be outlined in the new DEIS Strategy. Future allocation of overall resources will be considered within the context of the new DEIS Strategy and the availability of resources. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_431",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 432. Deputy Joanna Byrne asked the Minister for Education and Youth the way in which the funding announced in Budget 2026 for the introduction of the DEIS Plus scheme will be allocated to schools in County Louth; and if she will make a statement on the matter. [65947/25] ",
        "debateSection": {
          "showAs": "Educational Disadvantage",
          "debateSectionId": "dbsect_412",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_412",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_412.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29",
          "memberCode": "Joanna-Byrne.D.2024-11-29"
        },
        "questionNumber": 432,
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 428, 431, 432 and 433 together.  Tackling educational disadvantage and helping students reach their full potential is a key priority for me as the Minister for Education and Youth and for Government. Currently, the DEIS programme supports almost 1,200 primary and post-primary schools, reaching approximately 260,000 students, with an annual investment of over €180 million. Budget 2026 allocates an additional €16 million in 2026, rising to €48 million in 2027, to support the implementation of the new DEIS Strategy and introduce the DEIS Plus scheme, which will commence in 2026.  A new DEIS Strategy, which will include a DEIS Plus scheme will be published in early 2026. This strategy will focus on improving the opportunities and achievement levels of children at risk of educational disadvantage, developing more innovative approaches to tackling education disadvantage, and working towards a more flexible system of supports to ensure that a school can receive the right support at the right time.  The DEIS Plus scheme will provide additional support to schools with the highest levels of need, in line with the Government’s commitment. It will target a cohort of schools with high concentrations of children and young people experiencing intergenerational disadvantage where there is a significant gap in outcomes and there are barriers to those children and young people achieving their potential.  The process to identify schools for inclusion in DEIS Plus will be evidence-informed, using available data be evidence-informed, using available data.  The details of the DEIS Plus scheme are currently being finalised within an overall programme of work to tackle educational disadvantage and will be outlined in the new DEIS Strategy. Future allocation of overall resources will be considered within the context of the new DEIS Strategy and the availability of resources. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_432",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 433. Deputy Joanna Byrne asked the Minister for Education and Youth the plans in place to ensure that proposed DEIS Plus funding and resources are made available to schools in County Louth before the end of the current academic school year allowing schools sufficient time to plan and prepare ahead of the proposed September 2026 rollout; and if she will make a statement on the matter. [65948/25] ",
        "debateSection": {
          "showAs": "Educational Disadvantage",
          "debateSectionId": "dbsect_412",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_412",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_412.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29",
          "memberCode": "Joanna-Byrne.D.2024-11-29"
        },
        "questionNumber": 433,
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 428, 431, 432 and 433 together.  Tackling educational disadvantage and helping students reach their full potential is a key priority for me as the Minister for Education and Youth and for Government. Currently, the DEIS programme supports almost 1,200 primary and post-primary schools, reaching approximately 260,000 students, with an annual investment of over €180 million. Budget 2026 allocates an additional €16 million in 2026, rising to €48 million in 2027, to support the implementation of the new DEIS Strategy and introduce the DEIS Plus scheme, which will commence in 2026.  A new DEIS Strategy, which will include a DEIS Plus scheme will be published in early 2026. This strategy will focus on improving the opportunities and achievement levels of children at risk of educational disadvantage, developing more innovative approaches to tackling education disadvantage, and working towards a more flexible system of supports to ensure that a school can receive the right support at the right time.  The DEIS Plus scheme will provide additional support to schools with the highest levels of need, in line with the Government’s commitment. It will target a cohort of schools with high concentrations of children and young people experiencing intergenerational disadvantage where there is a significant gap in outcomes and there are barriers to those children and young people achieving their potential.  The process to identify schools for inclusion in DEIS Plus will be evidence-informed, using available data be evidence-informed, using available data.  The details of the DEIS Plus scheme are currently being finalised within an overall programme of work to tackle educational disadvantage and will be outlined in the new DEIS Strategy. Future allocation of overall resources will be considered within the context of the new DEIS Strategy and the availability of resources. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_433",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 900. Deputy Joanna Byrne asked the Minister for Health to outline the specific measures being taken at Our Lady of Lourdes Hospital, Drogheda, in preparation for the winter 2025-2026 season; whether any additional acute and step-down bed capacity will be provided; whether any additional emergency department surge capacity will be provided; whether any additional staffing allocations are planned; and if she will make a statement on the matter. [65873/25] ",
        "debateSection": {
          "showAs": "Hospital Services",
          "debateSectionId": "dbsect_813",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_813",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_813.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29",
          "memberCode": "Joanna-Byrne.D.2024-11-29"
        },
        "questionNumber": 900,
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_900",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_64",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_64",
          "showAs": "Sports Organisations",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_64.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 26. Deputy Joanna Byrne asked the Minister for Culture, Communications and Sport to ensure that female sporting organisations receive appropriate attention, recognition and adequate funding from Sport Ireland (details supplied); and if he will make a statement on the matter. [64396/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_26",
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  The participation of women in sport is an important element of both the National Sports Policy 2018-2027 and represents a core priority for me and my Department.  This Government is committed to a \"Sport for All\" approach aimed at ensuring that all persons can partake equally in sport and physical activity. This commitment is reaffirmed in the Programme for Government and is also reflected in Sport Ireland's Women in Sport Policy.  The Women in Sport (WIS) funding programme, administered by Sport Ireland, was first established in 2005 and since then over €30 million has been invested through the National Governing Bodies of Sport (NGBs) and the Local Sports Partnership network.  This year Sport Ireland announced an investment of €4 million under the Women in Sport programme for 2025. This is vital funding to support sporting bodies, and my Department will continue to support programmes to increase women’s participation in all sports and to progress strategic objectives for women in sport across all areas including active participation, coaching, officiating, and leadership.  With regards to NGB recognition, Sport Ireland runs a formal process whereby NGBs can apply for recognition, and in turn receive funding and support. Decisions relating to recognition are entirely a matter for Sport Ireland and I have no role in the process.  As set out in its NGB Recognition Criteria, Sport Ireland recognises one governing body per sport. In the case of the sport referred to by the deputy, Snooker & Billiards Ireland (SBI) is the Sport Ireland recognised NGB for snooker and billiards in the State. Sport Ireland has never recognised the other bodies referred to by the deputy and has no formal relationship with them.  I understand that SBI has in the past redirected funding secured through the Sport Ireland WIS Programme towards one of the bodies referred to by the deputy but that it is now retaining this WIS funding to fund its own activities to support the development of women's snooker and billiards.  It is important to note that SBI, like all NGBs, is an independent autonomous organisation and, as such, is responsible for its own governance and membership structures.  As Minister for Sport, I will continue to tackle issues to ensure that women’s sport reaches parity with its male equivalent and that females do not drop out of sport due to a lack of adequate training facilities or access to opportunities. ",
        "questionNumber": 26,
        "by": {
          "memberCode": "Joanna-Byrne.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29",
          "showAs": "Joanna Byrne"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_98",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_98",
          "showAs": "Sports Organisations",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_98.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 67. Deputy Joanna Byrne asked the Minister for Culture, Communications and Sport if he will act on the call by an organisation (details supplied) for the removal of the Israeli Basketball Association from the FIBA; and if he will make a statement on the matter. [64397/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_67",
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  National governing bodies of sport (NGBs) and international sporting federations, the International Basketball Federation (FIBA) in the case of basketball, are independent, autonomous bodies responsible for the governance of their own sports, including the organisation of sporting fixtures. The Government has no role in determining who can participate in international competitions organised by international sporting federations. Such federations are responsible for determining the composition of their membership in line with their own internal rules.  NGBs and international sporting federations are independent, autonomous bodies responsible for the governance of their own sports, including the organisation of sporting fixtures. The Government and Sport Ireland have no role in determining or supporting the organisation of such fixtures.  On a wider note, I can say that Ireland welcomes the agreement on the first phase of the 20-point plan to end the war in Gaza. The first phase of the plan, the ceasefire and hostage release agreement, is an important step on a road to peace. Our immediate focus must be on ensuring humanitarian aid into and throughout Gaza at scale. Ireland stands ready to play our part in working towards a sustainable peace between Israel and Palestine through the implementation of the two-State solution. ",
        "questionNumber": 67,
        "by": {
          "memberCode": "Joanna-Byrne.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29",
          "showAs": "Joanna Byrne"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_351",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_351",
          "showAs": "Sports Funding",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_351.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 479. Deputy Joanna Byrne asked the Minister for Culture, Communications and Sport when the sports capital and equipment programme and large-scale sport infrastructure fund will open for new applications for much-needed funding; and if he will make a statement on the matter. [64399/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_479",
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  My Department operates two capital funding programmes for sport, namely the Community Sports Facilities Fund (CSFF) and the Large Scale Sport Infrastructure Fund (LSSIF).  Over a quarter of a billion euro was allocated to 3,048 community sports clubs and facilities in 2024 from the 2023 round of the CSFF, representing the largest-ever investment in sports facilities in communities across Ireland.  In line with previous rounds of the Fund, a review of the current funding round is being undertaken. I have asked my Department to prepare for a further round of the CSFF in 2026. It is anticipated that the next CSFF round will particularly target areas and sports that have been under-invested in over the years.  The Large Scale Sports Infrastructure Fund (LSSIF) was established under the National Sports Policy, published on 25 July 2018, to provide Exchequer support for larger sports facility projects, typically those requiring investments greater than the maximum available under the CSFF. To date €297.5 million in funding has been awarded under LSSIF 2018 and LSSIF 2024.  My current focus is on ensuring project delivery under the first two rounds of the LSSIF and this process will inform any decisions regarding the timing of a future round. No decisions have yet been made regarding the next round of LSSIF. ",
        "questionNumber": 479,
        "by": {
          "memberCode": "Joanna-Byrne.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29",
          "showAs": "Joanna Byrne"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_352",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_352",
          "showAs": "Legislative Measures",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_352.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 480. Deputy Joanna Byrne asked the Minister for Culture, Communications and Sport when he will publish the revised general scheme of the Broadcasting (Amendment) Bill 2023; if he will provide empirical data to back his statements that he will not be implementing all of the Joint Oireachtas Committee on Culture, Communications and Sports recommendations on the Bill; and if he will make a statement on the matter. [64400/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_480",
        "answerText": " Minister for Culture, Communications and Sport  As the Deputy will be aware, the revised General Scheme of the Broadcasting (Amendment) Bill was approved by Government on 8 April 2025 and subsequently published.  I would like to recognise the comprehensive pre-legislative scrutiny of the General Scheme of the Broadcasting (Amendment) Bill undertaken by the Joint Oireachtas Committee on Arts, Media, Communications, Culture and Sport and my Department is considering those recommendations.  The Committee recommended (Recommendation 79) that a content levy should be introduced in line with the provisions of the Online Safety and Media Regulation Act 2022. As I have previously indicated in response to Parliamentary Question 52538 of 25, I will not be accepting that recommendation. I consider that the introduction of a content levy risks placing an additional financial burden on Irish households already experiencing cost of living pressures, particularly in the context of recent international developments.  It is for that reason the revised General Scheme includes an added layer of protection for the Irish consumer by providing that Coimisiún na Meán may only impose a content production levy on broadcasters and video-on-demand providers following a direction of the Minister. I have no intention of issuing such a direction until I am satisfied that a content levy would not constitute an undue burden on Irish households.  The Bill will be published when the necessary detailed drafting is complete, including those drafting changes necessary to incorporate recommendations made by the Committee. ",
        "questionNumber": 480,
        "by": {
          "memberCode": "Joanna-Byrne.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29",
          "showAs": "Joanna Byrne"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 708,
        "showAs": " 708. Deputy Joanna Byrne asked the Minister for Social Protection the schools across County Louth that operated a breakfast club for the academic school year 2024-2025 ; and the number of children in each school who received meals through each breakfast club, in tabular form. [63041/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Social"
        },
        "by": {
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29",
          "memberCode": "Joanna-Byrne.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_708",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_557",
          "showAs": "Education Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_557",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_557.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 708 and 710 together.  The objective of the School Meals Programme is to provide regular, nutritious food to children to support them in taking full advantage of the education provided to them. The programme is an important component of policies to encourage school attendance and extra educational achievement.  Following the Budget 2025 announcement all primary schools are now eligible for the Hot School Meals Scheme, meaning that approximately 3,700 schools and organisations and 682,000 children are now be eligible for the School Meals Programme.  It is important to note that the 2025/2026 academic school year started a few weeks ago and applications continue to be received and processed. The table below gives the current position of the Louth schools for 2024/25 and 2025/26 to date.      School Year      2024/25      2025/26       Schools Receiving Breakfast Club    25    10      Pupils benefitting    7,918    2,783      Schools receiving School Meals    64    35      Pupils benefitting    17,562    8,358      SCHOOLS IN COUNTY LOUTH RECEIVING BREAKFAST CLUB AND THE NUMBER OF CHILDREN IN EACH SCHOOL FOR 2024/25      School    Breakfast Club      Ardee Community School    370      Bush Post Primary School    800      Castletown Rd Convent    188      Coláiste Chú Chulainn    830      De La Salle College    741      Gaelscoil Dhun Dealgan    212      Little Partners Creche    49      Ó Fiaich College    289      Our Lady'S College    200      Rathmullan N S    95      S N An Tslanaitheora B    153      S N An Tslanaitheora C    136      S N Naomh Lorcan    80      S N San Nioclas    159      Scoil Na Mbraithre Sn    316      Scoil Oilibhéir Naofa    365      Scoil Ui Mhuiri    661      St Brighids Special Sch    93      St Brigid'S And St Patrick'S National School    554      St Louis Secondary School    492      St Nicholas Monastery Ns    154      St Oliver'S Community College    600      St Pauls Senior Ns    330      Stepping Stones Community Creche    22      Togher Community Project Group Ltd    29       Grand Total      7918      I trust this clarifies the matter. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 709,
        "showAs": " 709. Deputy Joanna Byrne asked the Minister for Social Protection the schools who operated school meals scheme across County Louth for the academic school year 2024-2025; and the number of children in each school who received meals through the scheme, in tabular form. [63042/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Social"
        },
        "by": {
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29",
          "memberCode": "Joanna-Byrne.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_709",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_558",
          "showAs": "School Meals Programme",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_558",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_558.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Social Protection (Deputy Dara Calleary)  The objective of the School Meals Programme is to provide regular, nutritious food to children to support them in taking full advantage of the education provided to them. The programme is an important component of policies to encourage school attendance and extra educational achievement.  Following the Budget 2025 announcement all primary schools are now eligible for the Hot School Meals Scheme, meaning that approximately 3,700 schools and organisations and 682,000 children are now be eligible for the School Meals Programme.  There was a total of 64 schools in County Louth in receipt of the School Meals Programme in the 2024/25 academic school year. The table below provides a breakdown of the number of children in each school in receipt of the respective meal club under the programme.   children in receipt of the respective meal club   I trust this clarifies the matter. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 710,
        "showAs": " 710. Deputy Joanna Byrne asked the Minister for Social Protection the number of schools in County Louth that  have   applied for the school meals scheme to date  in the current academic school year 2025-2026. [63043/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Social"
        },
        "by": {
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29",
          "memberCode": "Joanna-Byrne.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_710",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_557",
          "showAs": "Education Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_557",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_557.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 708 and 710 together.  The objective of the School Meals Programme is to provide regular, nutritious food to children to support them in taking full advantage of the education provided to them. The programme is an important component of policies to encourage school attendance and extra educational achievement.  Following the Budget 2025 announcement all primary schools are now eligible for the Hot School Meals Scheme, meaning that approximately 3,700 schools and organisations and 682,000 children are now be eligible for the School Meals Programme.  It is important to note that the 2025/2026 academic school year started a few weeks ago and applications continue to be received and processed. The table below gives the current position of the Louth schools for 2024/25 and 2025/26 to date.      School Year      2024/25      2025/26       Schools Receiving Breakfast Club    25    10      Pupils benefitting    7,918    2,783      Schools receiving School Meals    64    35      Pupils benefitting    17,562    8,358      SCHOOLS IN COUNTY LOUTH RECEIVING BREAKFAST CLUB AND THE NUMBER OF CHILDREN IN EACH SCHOOL FOR 2024/25      School    Breakfast Club      Ardee Community School    370      Bush Post Primary School    800      Castletown Rd Convent    188      Coláiste Chú Chulainn    830      De La Salle College    741      Gaelscoil Dhun Dealgan    212      Little Partners Creche    49      Ó Fiaich College    289      Our Lady'S College    200      Rathmullan N S    95      S N An Tslanaitheora B    153      S N An Tslanaitheora C    136      S N Naomh Lorcan    80      S N San Nioclas    159      Scoil Na Mbraithre Sn    316      Scoil Oilibhéir Naofa    365      Scoil Ui Mhuiri    661      St Brighids Special Sch    93      St Brigid'S And St Patrick'S National School    554      St Louis Secondary School    492      St Nicholas Monastery Ns    154      St Oliver'S Community College    600      St Pauls Senior Ns    330      Stepping Stones Community Creche    22      Togher Community Project Group Ltd    29       Grand Total      7918      I trust this clarifies the matter. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 711,
        "showAs": " 711. Deputy Joanna Byrne asked the Minister for Social Protection if his Department intends to contact schools that  do not apply for the extended school meals scheme in the current academic school year to determine the reasons they have not applied. [63044/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Social"
        },
        "by": {
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29",
          "memberCode": "Joanna-Byrne.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_711",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_559",
          "showAs": "School Meals Programme",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_559",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_559.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Social Protection  The School Meals Programme is not mandatory for schools. The decision to apply lies with the school principal and board of management. There were some 300 schools who had not expressed an interest to join the programme at the end of the 2024/2025 academic year. My officials have engaged with these schools to ascertain the reasons why. The main reason given was due to a lack of demand from parents for the programme.  As this is the first academic year that all primary schools will be eligible for the Hot School Meals Programme, and applications continue to currently be received, a full analysis will be conducted in Q1 2026.  I trust this clarifies the matter. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1014,
        "showAs": " 1014. Deputy Joanna Byrne asked the Minister for Health for an update on the progress being made on the Government’s commitment to provide a “statutory homecare scheme to allow people to stay in their own home for as long as possible.\"; the work undertaken on regional projections to inform the levels of service and support needed in each integrated healthcare area; and the engagement that has taken place with the integrated healthcare area managers in the Louth/Meath area.  [63053/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29",
          "memberCode": "Joanna-Byrne.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1014",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_799",
          "showAs": "Departmental Policies",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_799",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_799.xml"
            },
            "pdf": null
          }
        },
        "answerText": "",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1015,
        "showAs": " 1015. Deputy Joanna Byrne asked the Minister for Health the breakdown of the allocation of home support service to persons living in County Louth for each of the years 2020 to 2025, in tabular form. [63054/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29",
          "memberCode": "Joanna-Byrne.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1015",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_800",
          "showAs": "Home Help Service",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_800",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_800.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Health  As this is an operational matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1016,
        "showAs": " 1016. Deputy Joanna Byrne asked the Minister for Health the breakdown of the funding allocated to home support service in County Louth for each of the years 2020 to 2025 respectively, in tabular form. [63055/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29",
          "memberCode": "Joanna-Byrne.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1016",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_801",
          "showAs": "Home Help Service",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_801",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_801.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Health  As this is an operational matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1017,
        "showAs": " 1017. Deputy Joanna Byrne asked the Minister for Health the number of persons that have applied for home support service in County Louth to date in 2025; the number of applications that were for an increase in a home support service that was already in place; and the number of these applications which were refused. [63056/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29",
          "memberCode": "Joanna-Byrne.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1017",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_802",
          "showAs": "Home Help Service",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_802",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_802.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Health  As this is an operational matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1018,
        "showAs": " 1018. Deputy Joanna Byrne asked the Minister for Health the number of persons currently approved for home support service in County Louth that are awaiting provision of same. [63057/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29",
          "memberCode": "Joanna-Byrne.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1018",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_803",
          "showAs": "Home Help Service",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_803",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_803.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Health  As this is an operational matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1019,
        "showAs": " 1019. Deputy Joanna Byrne asked the Minister for Health the number of persons currently in hospital in County Louth experiencing a delayed discharge while awaiting provision of home support service; and the length of time these discharges have been delayed by. [63058/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29",
          "memberCode": "Joanna-Byrne.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1019",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_804",
          "showAs": "Home Help Service",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_804",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_804.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Health  As this is an operational matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1020,
        "showAs": " 1020. Deputy Joanna Byrne asked the Minister for Health the average waiting time for home support service in County Louth from the initial application to provision of same. [63059/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29",
          "memberCode": "Joanna-Byrne.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1020",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_805",
          "showAs": "Home Help Service",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_805",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_805.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Health  As this is an operational matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Budget 2026",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_365.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_365",
          "debateSectionId": "dbsect_365"
        },
        "to": {
          "showAs": "Culture",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Culture, Communications and Sport  The detailed breakout of each of my Department's programme areas and subheads for 2026 will be made available as part of the Revised Estimates Volume to be published later this year. The allocation for my Department for 2026 published in Budget is €1,514.678m - €813.678m current and €701m capital. ",
        "questionType": "written",
        "showAs": " 449. Deputy Joanna Byrne asked the Minister for Culture, Communications and Sport to provide the Abridged Estimates Volume for Budget 2026 for Vote 33, including the provisional sub-head and programme level allocations; and if he will make a statement on the matter. [57013/25] ",
        "questionNumber": 449,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Joanna Byrne",
          "memberCode": "Joanna-Byrne.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_449"
      }
    },
    {
      "question": {
        "by": {
          "memberCode": "Joanna-Byrne.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29",
          "showAs": "Joanna Byrne"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-09/pq_75",
        "answerText": " Minister for Justice, Home Affairs and Migration  The International Protection Accommodation Service (IPAS) is currently accommodating almost 33,000 people in 319 IPAS centres around the country, 9,500 of whom are children.  Since 2024, once a centre is in operation, IPAS has not published details of the capacity or occupancy of our accommodation centres, to preserve the privacy and security of residents and staff.  In relation to the property mentioned, as is the case with many IPAS Accommodation Centres, the configuration of the premises referred to does not lend itself to a practical dual use of this property as suggested. This is related to legal duties to ensure privacy and anonymity of international protection applicants, and also to the fact that this is a family centre, meaning that all staff and the centre has to operate in accordance with Children First Guidelines on child safeguarding.  In terms of potential future use of the location, the State is working to develop more State-owned IP accommodation and reduce reliance on commercial providers over time.  Ireland has adopted and is now working to implement the EU Pact on Migration and Asylum in mid-2026. Reforming and speeding up processing of applications should also serve over time to reduce the scale of the demand for IP accommodation.  As developing more sustainable state-owned accommodation system options will take time, the commissioning of emergency commercial accommodation will continue to be a feature in the short to medium term. ",
        "date": "2025-10-09",
        "questionNumber": 75,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/writtens/dbsect_91",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/writtens/mul@/dbsect_91.xml"
            }
          },
          "debateSectionId": "dbsect_91",
          "showAs": "International Protection"
        },
        "showAs": " 75. Deputy Joanna Byrne asked the Minister for Justice, Home Affairs and Migration to provide details of the daily occupancy levels and the possibility of re-opening a hotel (details supplied) for tourists, as well as facilitating IPAS applicants; and if he will make a statement on the matter. [53439/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Justice",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-10-09"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Joanna-Byrne.D.2024-11-29",
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29"
        },
        "showAs": " 391. Deputy Joanna Byrne asked the Minister for Justice, Home Affairs and Migration for an update on a citizenship application submitted by a person (details supplied) in County Louth who is working as an anaesthesiologist since March 2023. [52986/25] ",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_370.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_370",
          "showAs": "Citizenship Applications",
          "debateSectionId": "dbsect_370"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_391",
        "answerText": " Minister for Justice, Home Affairs and Migration  I understand that the Deputy has been in contact with my Department's Immigration Oireachtas service regarding the person cited and a status update was recently provided. This application continues to be processed by the citizenship division of my Department.  I am aware that extended wait times can be frustrating for applicants, particularly considering the current processing times. I want to assure anyone who has an application for naturalisation submitted, that the Citizenship Division is doing everything possible to progress applications as quickly as possible.  I expect that going forward, the majority of applicants will continue to receive a decision within one year, however, it is important to note that no two naturalisation applications are the same and some take longer than others to process.  Given the importance of citizenship, robust and comprehensive checks must take place on each application. Unfortunately, some international checks can take a considerable amount of time and these are largely outside of the control of the Immigration Service.  Citizenship Division have also taken a significant number of steps to speed up the process for applicants. These included introducing an online digital application, online payments, and the introduction of eVetting. I am pleased to inform the Deputy that these changes are dramatically reducing processing times.  The length of time taken to process an application has dropped from 15 months in 2023, to 8 months in 2024.  The person concerned can now directly check the status of their immigration application on the Immigration Service’s new Customer Service Portal. They can register for, or log in to their existing account, at: portal.irishimmigration.ie/en/  As an Oireachtas member, you can also request the status of individual immigration cases by e-mail, using the Oireachtas Mail facility at: IMoireachtasmail@justice.ie, which has been specifically established for this purpose. This service enables up to date information on such cases to be obtained without the need to seek information by way of the Parliamentary Question process. ",
        "questionNumber": 391
      },
      "contextDate": "2025-10-07"
    },
    {
      "contextDate": "2025-10-02",
      "question": {
        "debateSection": {
          "debateSectionId": "dbsect_3",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/debate/dbsect_3",
          "showAs": "Sport and Recreational Development",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/debate/mul@/dbsect_3.xml"
            }
          }
        },
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "houseNo": "34",
          "chamberType": "house"
        },
        "showAs": " 1. Deputy Joanna Byrne asked the Minister for Culture, Communications and Sport in view of the global gindings report produced from the Double Pass audit into the League of Ireland academy system, which benchmarks Ireland significantly behind other nations, the plans he has initiated to support academy development; if he will commit to the significant funding increase in this area to allow our academies grow to meet the huge potential they hold; and if he will make a statement on the matter.  [52248/25] ",
        "answerText": " Minister for Culture, Communications and Sport (Deputy Patrick O'Donovan)  The operation of the League of Ireland and its academies is fundamentally a matter for the Football Association of Ireland, which, like all other NGBs of sport is an independent, autonomous organisation responsible for the organisation and development of its own sport.  The programme for Government commits to exploring new mechanisms for the creation of football academies and an additional finding grant of €1 million provided by my Department to the FAI enabled it to produce the report referred to by the Deputy. The funding also enabled the appointment by the FAI of an academies administrator to support the development of new academy programmes and track their impact.  The League of Ireland global findings report, produced by the Belgian company Double Pass, benchmarks Irish football academies against international standards based on an audit of existing academy structures and needs. My Department continues to engage with the FAI regarding this report, and a pre-budget submission focusing on academies has recently been submitted to me by the association. This will be given consideration, taking account of the range of request across the sports sector for additional support and, ultimately, the outcome of the current budgetary process.  While the FAI has sought significant State funding to support its academies, it is important to note the sizeable financial support directed to the FAI and to football more generally over the past few years. Over €75 million in State funding was allocated to the FAI between 2019 and 2024, including €30.2 million specifically to support football development and aimed at promoting participation in football by young people, with the balance in funding comprising Covid-specific and energy supports to the FAI and the wider football sector.  Furthermore, significant capital funding has been granted to football projects around the country in recent years, including the €48.9 million that has been allocated to FAI endorsed football stadium projects at Finn Harps, Dalymount Park, Sligo Rovers and Wexford FC under the 2024 round of the large scale sports infrastructure fund, LSSIF, and €76 million to support the development of grassroots club football facilities nationwide under the 2020 and 2023 rounds of the community sports facilities fund. \n Deputy Joanna Byrne  I cannot emphasise enough just how important academies are to the future of Irish football. At the very top of the scale, we just need to see where our national team is right now in the international rankings and look at recent defeats to so-called lesser teams. At grassroots level, the opportunities that were there before Brexit no longer exist. Irish players cannot go across the water to larger academies and learn their trades like how it used to be done. Those young academy players are here. They want to play; they want to learn. They want the opportunity to represent their club and, ultimately, their country to the very best of their abilities. Without football academies up and down this country being adequately resourced, however, they are never going to reach their full potential. Some of the significant moments of modern Irish history have been because of football. Let us think of Euro 88, Italia 90, USA 94; events that unified everybody in every part of this country and lifted the mood of the population and brought joy and belief in ourselves as a people. If we want to see moments like that again, we need to start the process and invest now. \n Deputy Patrick O'Donovan  The FAI already receives significant amounts of Government funding, which the Deputy did not reference, nor did she reference anything the Government has been doing for the FAI over the past number of years. The 2023 memorandum of understanding between the Government and the FAI provides €5.8 million per annum to the association via Sport Ireland. In addition, the Government pays the FAI's annual contribution to the Aviva management company for three years, which is €2.54 million, which is now repayable to the State at a rate of €1 million per annum. A new memorandum of understanding was signed on 17 December 2024, which increased the funding to €6 million. The bulk of this funding goes towards the FAI's youth field sports grants, which are aimed at developing the grassroots of the game. I know what the Deputy is saying, but it is a bit unfortunate that she did not reference the things we are doing. The FAI could not function at the moment if it were not for the Government. The Deputy might in her response at least acknowledge that. \n Deputy Joanna Byrne  The programme for Government stated that the Government will explore new mechanisms for the creation of football academies with the FAI and the League of Ireland, so I am not going to stand here and give the Minister plaudits for doing what he has committed to doing. The FAI pre-budget submission asks for support for League of Ireland academies, which is what my question this morning is about. This will create a total of 81 new jobs in clubs around the country before a jump to €8 million annually with the hope of creating 340 full-time and part-time jobs to kickstart an industry. If the Government makes the investment now, we could have the days like those I referenced earlier of Euro 88, Italia 90 and USA 94, but it has to make the investment now for Irish football to be self-financing in the future. We need to invest in our academies now. \n Deputy Patrick O'Donovan  I remind the Deputy that we actually have fulfilled our programme for Government commitment. We paid for the report and the Deputy did not acknowledge that either. Now we are considering it, and we will consider it in the round with every other field sport that is looking for money, including rugby, Gaelic games and everything else. We have a limited amount. If there are suggestions she has with regard to existing parts of the sports, culture and communications budget that I can cut, I would be delighted to hear them. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-02/pq_1",
        "questionNumber": 1,
        "questionType": "oral",
        "date": "2025-10-02",
        "to": {
          "roleType": null,
          "uri": null,
          "roleCode": null,
          "showAs": "Culture"
        },
        "by": {
          "memberCode": "Joanna-Byrne.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29",
          "showAs": "Joanna Byrne"
        }
      }
    },
    {
      "contextDate": "2025-10-02",
      "question": {
        "debateSection": {
          "debateSectionId": "dbsect_53",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/dbsect_53",
          "showAs": "Sports Facilities",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/mul@/dbsect_53.xml"
            }
          }
        },
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "houseNo": "34",
          "chamberType": "house"
        },
        "showAs": " 27. Deputy Joanna Byrne asked the Minister for Culture, Communications and Sport his plans to ensure the provision of playing pitches, courts and sports facilities in new residential or mixed-use developments; and if he will make a statement on the matter. [52249/25] ",
        "answerText": " Minister for Culture, Communications and Sport  Sport and physical activity are hugely important to our collective wellbeing and health, so it is in our national interest to promote increased participation in sport and activity at all levels, locally and nationally.  Availability and ease of access to sports facilities, whether in a club setting, on public lands or in other amenity areas, is a key factor in drawing more people to participation in sport. Planning for future facilities’ needs, locations and types is a particular focus of our current Sports Action Plan.  However, the use to which lands are put is ultimately a matter for the relevant local authority and my Department does not fund the acquisition of land for sport. However, where land is in use for sport, my Department operates two relevant capital funding programmes, namely the Community Sports Facilities Fund (CSFF) and the Large Scale Sport Infrastructure Fund (LSSIF).  In 2024 over a quarter of a billion euro was allocated to community sports clubs and facilities from the CSFF while grants totalling €173 million were awarded from the LSSIF. This is a an all-time record investment level in sport in Ireland.  Given the challenges of increased demand and a growing population, I consider that there is real merit in the development of municipally-backed shared facilities and I encourage sports' National Governing Bodies and local authorities to collaborate in this regard.  In line with previous rounds of the programme, a review of the current funding round will be undertaken and that review will inform the timing of the next round of the CSFF. However, I would anticipate that the next round should be announced in 2026.  My current focus is on ensuring project delivery under the first two rounds of the LSSIF and this process will inform any decisions regarding the timing of a future round. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-02/pq_27",
        "questionNumber": 27,
        "questionType": "written",
        "date": "2025-10-02",
        "to": {
          "roleType": null,
          "uri": null,
          "roleCode": null,
          "showAs": "Culture"
        },
        "by": {
          "memberCode": "Joanna-Byrne.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29",
          "showAs": "Joanna Byrne"
        }
      }
    },
    {
      "contextDate": "2025-10-02",
      "question": {
        "debateSection": {
          "debateSectionId": "dbsect_59",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/dbsect_59",
          "showAs": "Sports Facilities",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/mul@/dbsect_59.xml"
            }
          }
        },
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "houseNo": "34",
          "chamberType": "house"
        },
        "showAs": " 34. Deputy Joanna Byrne asked the Minister for Culture, Communications and Sport his plans to improve the condition of existing playing pitches, courts and sports facilities in community use; and if he will make a statement on the matter. [52250/25] ",
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  The Community Sport Facilities Fund (CSFF) is the primary means of providing Government funding to sport and community organisations at local, regional and national level throughout the country. The Fund aims to foster an integrated and planned approach to the development of sports and physical recreation facilities and assists the purchase of non- personal sports equipment.  Among the Fund's objectives is to assist voluntary and community organisations, national governing bodies (NGBs) of sport, local authorities and Education and Training Boards and schools to develop high quality, accessible, safe, well-designed, sustainable facilities in appropriate locations and to provide appropriate equipment to help maximise participation in sport and physical recreation.  Over €277 million was allocated to 3,048 community sports clubs and facilities in 2024 from the 2023 round of the CSFF, representing the largest-ever investment in sports facilities in communities across Ireland. This included funding to improve the condition of existing playing pitches, courts and sports facilities in community use.  In line with previous rounds of the Fund, a review of the current funding round will be undertaken and that review will inform the timing of the next round of the CSFF. However, I would anticipate that the next round should be announced in 2026. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-02/pq_34",
        "questionNumber": 34,
        "questionType": "written",
        "date": "2025-10-02",
        "to": {
          "roleType": null,
          "uri": null,
          "roleCode": null,
          "showAs": "Culture"
        },
        "by": {
          "memberCode": "Joanna-Byrne.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29",
          "showAs": "Joanna Byrne"
        }
      }
    },
    {
      "question": {
        "date": "2025-09-23",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Joanna-Byrne.D.2024-11-29",
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29"
        },
        "showAs": " 681. Deputy Joanna Byrne asked the Minister for Health the breakdown of the number of assaults reported/recorded against patients at Our Lady Of Lourdes Hospital, Drogheda, for each quarter for each of the years 2023 to 2025, inclusive, in tabular form; the number of these reported/recorded assaults that were investigated; and if she will make a statement on the matter. [50367/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/mul@/dbsect_634.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/dbsect_634",
          "showAs": "Departmental Data",
          "debateSectionId": "dbsect_634"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-23/pq_681",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 681
      },
      "contextDate": "2025-09-23"
    },
    {
      "question": {
        "date": "2025-09-23",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Joanna-Byrne.D.2024-11-29",
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29"
        },
        "showAs": " 682. Deputy Joanna Byrne asked the Minister for Health to provide a breakdown of the number of assaults reported/recorded against staff at Our Lady of Lourdes Hospital, Drogheda, for each quarter for each of the years 2023 to 2025, inclusive; the number of these reported/recorded assaults that were investigated; and if she will make a statement on the matter. [50368/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/mul@/dbsect_635.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/dbsect_635",
          "showAs": "Departmental Data",
          "debateSectionId": "dbsect_635"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-23/pq_682",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 682
      },
      "contextDate": "2025-09-23"
    },
    {
      "question": {
        "date": "2025-09-18",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Joanna-Byrne.D.2024-11-29",
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29"
        },
        "showAs": " 262. Deputy Joanna Byrne asked the Minister for Culture, Communications and Sport the estimated first- and full-year cost of abolishing the television licence and funding public service media from the central Exchequer, in line with the Report of the Future of Media Commission published in 2022; and if he will make a statement on the matter. [49485/25] ",
        "to": {
          "roleType": null,
          "showAs": "Culture",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-18/writtens/mul@/dbsect_233.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-18/writtens/dbsect_233",
          "showAs": "Television Licence Fee",
          "debateSectionId": "dbsect_233"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-18/pq_262",
        "answerText": " Minister for Culture, Communications and Sport (Deputy Patrick O'Donovan)  As has been stated before, there are no plans to abolish the TV licence.  As set out in the Revised Estimates 2025, funding for public service media providers in Ireland (RTÉ and TG4) will be €285m, €225m for RTÉ and €60m for TG4. TG4 is entirely funded by the Exchequer and RTÉ is funded from a combination of TV fee receipts and the Exchequer.  TV licence revenue comprises receipts from direct sales by An Post and an Exchequer contribution from the Department of Social Protection in respect of free licences awarded to recipients of the Household Benefits Package. TV licence revenues are distributed in accordance with the Broadcasting Act 2009, with 7% of net receipts allocated to the Broadcasting Fund, 93% of net receipts allocated to RTÉ, and a payment to An Post in respect of collection and compliance costs.  The quantity of TV licences issued in the period January-end July 2025 was 1.9% lower than the equivalent period in 2024. Should this 1.9% reduction apply for the full year 2025, licence fee income from direct sales will be €124.4m in a full year (net of the contribution received from the Department of Social Protection in respect of the Household Benefits Package). Accordingly, on a no-change scenario, the full-year cost of abolishing the television licence fee would be €124.4m.  As part of its decision last July on the funding of RTÉ and Public Service Media, Government decided that the TV licence system would be retained, while being underpinned by measures designed to improve collection and compliance in order to maximise revenue generation. To this end, Government reconvened the Interdepartmental Technical Working Group on the Reform and Enhancement of the Television Licence to examine potential enhancements to the television licence. I will give consideration to any recommendations arising from the Group once I receive its report. ",
        "questionNumber": 262
      },
      "contextDate": "2025-09-18"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Public Expenditure",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 628. Deputy Joanna Byrne asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation to detail all the OPW-owned sites in County Louth. [45498/25] ",
        "by": {
          "memberCode": "Joanna-Byrne.D.2024-11-29",
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_628",
        "questionNumber": 628,
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The table attached at Appendix 1 shows the properties / sites in the ownership of the Commissioners of Public Works (OPW) in County Louth.   OPW Owned sites in County Louth  ",
        "debateSection": {
          "showAs": "Office of Public Works",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_530",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_530.xml"
            }
          },
          "debateSectionId": "dbsect_530"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Social",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1360. Deputy Joanna Byrne asked the Minister for Social Protection the current processing times for disability allowance, carer's allowance and social welfare appeals; and if he will make a statement on the matter.  [45494/25] ",
        "by": {
          "memberCode": "Joanna-Byrne.D.2024-11-29",
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_1360",
        "questionNumber": 1360,
        "answerText": " Minister for Social Protection  The Department is committed to providing a quality service to all its customers. This includes ensuring that applications are processed and that decisions on entitlement are made as quickly as possible.  Processing times vary across schemes, depending on the differing eligibility criteria. Schemes that require a high level of documentary evidence from the customer, particularly in the case of illness-related schemes, can take longer to process. Similarly, means-tested schemes can also require more detailed investigations and interaction with the customer, thereby lengthening the decision-making process.  The average number of weeks to award a Disability Allowance claim and a Carer's Allowance claim at the end of July 2025 was 6 weeks.  The current average processing time is 24.9 weeks for Disability Allowance appeals and 19.7 weeks for Carer's Allowance appeals. The overall average processing time for all appeals to the end of second quarter 2025 is 21.9 weeks.  My Department understands the many pressures faced by people and always seeks to ensure that claims are processed quickly and efficiently. ",
        "debateSection": {
          "showAs": "Social Welfare Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_1135",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_1135.xml"
            }
          },
          "debateSectionId": "dbsect_1135"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Justice",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1561. Deputy Joanna Byrne asked the Minister for Justice, Home Affairs and Migration the number of Gardaí and their rank, in all stations in County Louth, in tabular form; and if he will make a statement on the matter. [45495/25] ",
        "by": {
          "memberCode": "Joanna-Byrne.D.2024-11-29",
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_1561",
        "questionNumber": 1561,
        "answerText": " Minister for Justice, Home Affairs and Migration  In the interest of transparency, information in relation to the allocation of Gardaí by Division, Station and rank, including for County Louth, is publicly available and can be found at the following link: www.garda.ie/garda/en/about-us/our-departments/human-resources-and-people-development/garda-hr-directorate/garda-strength-breakdown-2025/garda-strength-breakdown-2025.html.  The Deputy should select the Garda Workforce figures for July and access the file titled “Garda Members by Division District Station 2009 to 31 July 2025” for a breakdown of total Gardaí numbers by Garda station going back to 2009.  Published information is supplied by An Garda Síochána, is based upon operational data and may be subject to change.  The Garda Commissioner is responsible for the distribution and stationing of Garda personnel throughout the State under Section 33 of the Policing, Security and Community Safety Act 2024. As Minister, I have no role in these independent functions. ",
        "debateSection": {
          "showAs": "An Garda Síochána",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_1306",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_1306.xml"
            }
          },
          "debateSectionId": "dbsect_1306"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Justice",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1562. Deputy Joanna Byrne asked the Minister for Justice, Home Affairs and Migration the number of Gardaí currently detailed for community policing in Dundalk, Drogheda and Ardee stations, respectively. [45496/25] ",
        "by": {
          "memberCode": "Joanna-Byrne.D.2024-11-29",
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_1562",
        "questionNumber": 1562,
        "answerText": " Minister for Justice, Home Affairs and Migration  In the interest of transparency, An Garda Síochána publish information in relation to Community Policing by Division which is publicly available and can be found at the following link: www.garda.ie/garda/en/about-us/our-departments/human-resources-and-people-development/garda-hr-directorate/garda-strength-breakdown-2025/garda-strength-breakdown-2025.html.  The Deputy should select July 2025 (the latest date for when figures are available) and then select the report titled ‘Community Garda by Division 2009 to 31st of July 2025’  I can also advise the Deputy that the figures for Garda members assigned by Station are also publicly available. The Deputy should follow the link provided above and select July 2025 and then select the file titled 'Garda Members by Division District Station 2009 to 31st July 2025'. ",
        "debateSection": {
          "showAs": "An Garda Síochána",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_1307",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_1307.xml"
            }
          },
          "debateSectionId": "dbsect_1307"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 2295. Deputy Joanna Byrne asked the Minister for Health the funding provided to each regional and local drugs task force in each of the years 2020 to 2025, in tabular form; and if she will make a statement on the matter. [45492/25] ",
        "by": {
          "memberCode": "Joanna-Byrne.D.2024-11-29",
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_2295",
        "questionNumber": 2295,
        "answerText": " Minister of State at the Department of Health  I propose to take Questions Nos. 2295, 2296 and 2297 together.  I am committed to improve access and to increase capacity in drug treatment services, including community-based services, on an equitable basis across the HSE health regions.  Details of any additional funding for drug services will be announced, as usual, on Budget day. ",
        "debateSection": {
          "showAs": "Health Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_1991",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_1991.xml"
            }
          },
          "debateSectionId": "dbsect_1991"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 2296. Deputy Joanna Byrne asked the Minister for Health the funding provided to the north eastern regional drug and alcohol task force in each of the years 2016 to 2025, in tabular form. [45493/25] ",
        "by": {
          "memberCode": "Joanna-Byrne.D.2024-11-29",
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_2296",
        "questionNumber": 2296,
        "answerText": " Minister of State at the Department of Health  I propose to take Questions Nos. 2295, 2296 and 2297 together.  I am committed to improve access and to increase capacity in drug treatment services, including community-based services, on an equitable basis across the HSE health regions.  Details of any additional funding for drug services will be announced, as usual, on Budget day. ",
        "debateSection": {
          "showAs": "Health Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_1991",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_1991.xml"
            }
          },
          "debateSectionId": "dbsect_1991"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 2297. Deputy Joanna Byrne asked the Minister for Health if there are proposals in Budget 2026 for the provision of additional funding for addiction services provided through the north eastern regional drugs and alcohol task force. [45497/25] ",
        "by": {
          "memberCode": "Joanna-Byrne.D.2024-11-29",
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_2297",
        "questionNumber": 2297,
        "answerText": " Minister of State at the Department of Health  I propose to take Questions Nos. 2295, 2296 and 2297 together.  I am committed to improve access and to increase capacity in drug treatment services, including community-based services, on an equitable basis across the HSE health regions.  Details of any additional funding for drug services will be announced, as usual, on Budget day. ",
        "debateSection": {
          "showAs": "Health Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_1991",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_1991.xml"
            }
          },
          "debateSectionId": "dbsect_1991"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 2298. Deputy Joanna Byrne asked the Minister for Health to detail all the Department of Health and Health Service Executive owned sites in County Louth; the number of these sites currently in use; the purpose for which they are used; the number of these sites earmarked for proposed development; and if she will make a statement on the matter. [45499/25] ",
        "by": {
          "memberCode": "Joanna-Byrne.D.2024-11-29",
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_2298",
        "questionNumber": 2298,
        "answerText": " Minister for Health  As the Health Service Executive is responsible for the management of the public healthcare property estate, I have asked the HSE to respond directly to you in relation to this matter. ",
        "debateSection": {
          "showAs": "Departmental Data",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_1992",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_1992.xml"
            }
          },
          "debateSectionId": "dbsect_1992"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 2332. Deputy Joanna Byrne asked the Minister for Health the support and assistance available to a family based in County Louth (details supplied) who do not meet the criteria for the disabled drivers and disabled passengers scheme,; and if she will make a statement on the matter. [45621/25] ",
        "by": {
          "memberCode": "Joanna-Byrne.D.2024-11-29",
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_2332",
        "questionNumber": 2332,
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "debateSection": {
          "showAs": "Tax Reliefs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_2027",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_2027.xml"
            }
          },
          "debateSectionId": "dbsect_2027"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Joanna-Byrne.D.2024-11-29",
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29"
        },
        "showAs": " 803. Deputy Joanna Byrne asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation for an update on any works or proposals to open Saint Laurence's Gate, Drogheda to the public, and on improving the surrounding public realm and creating a civic space; and if he will make a statement on the matter. [41788/25] ",
        "to": {
          "roleType": null,
          "showAs": "Public Expenditure",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_661.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_661",
          "showAs": "Heritage Sites",
          "debateSectionId": "dbsect_661"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_803",
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  St. Laurence’s Gate, National Monument number 511, is a National Monument in State guardianship, under the care of the Office of Public Works (OPW). Legal ownership remains with Louth County Council.  As with all National Monuments in our care, access decisions are made with reference to site-specific risk assessments and conservation considerations. The OPW has supported limited, managed access to St. Laurence’s Gate in recent years, including during Fleadh Cheoil na hÉireann and Irish Walled Towns initiatives. These events were facilitated through a ticketed system to ensure public safety. The OPW continues to facilitate similar requests for access during heritage-related events where health and safety and conservation considerations can be appropriately managed.  A recent structural report commissioned by the OPW, and shared with local representatives, identified certain conservation concerns. Addressing these issues would require substantial specialist works. The confined internal layout of the National Monument makes it unsuitable for general public access and this would not change even if further works were undertaken.  Public realm enhancements fall primarily within the remit of the local authority. The OPW recognises the importance of the Gate within the broader urban fabric of Drogheda and is committed to working collaboratively to ensure that the monument remains an integral and visible part of any future civic or streetscape developments in the area.  The OPW will continue to monitor and maintain St. Laurence’s Gate in line with its legislative responsibilities, and remains committed to preserving and promoting this iconic medieval landmark in collaboration with local stakeholders. ",
        "questionNumber": 803
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Joanna-Byrne.D.2024-11-29",
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29"
        },
        "showAs": " 1484. Deputy Joanna Byrne asked the Minister for Housing, Local Government and Heritage the routine maintenance and conservation of structures (details supplied), as there is significant vegetation growing on them that may damage the structure of all of these historical structures; and if he will make a statement on the matter. [41789/25] ",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_1261.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_1261",
          "showAs": "Archaeological Sites",
          "debateSectionId": "dbsect_1261"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_1484",
        "answerText": " Minister for Housing, Local Government and Heritage  Archaeological sites in my ownership are presented and maintained by the Office of Public Works. The sites referred to are not in the my ownership and so are not maintained by the OPW.  The sites may meet the criteria for application for grants under the Community Monuments Fund which is administered through the Local Authorities by the National Monuments Service of my Department. The scheme for 2025 has closed but the scheme for 2026 is due to be announced in November.  The Community Monuments Fund provides funding for projects in relation to:  (i) Archaeological Monuments that are included in the Record of Monuments and Places (RMP) under the National Monuments Act 1930 (as amended);  (ii) Archaeological Monuments that are identified in the Sites and Monuments Record compiled by the National Monuments Service. ",
        "questionNumber": 1484
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Joanna-Byrne.D.2024-11-29",
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29"
        },
        "showAs": " 2500. Deputy Joanna Byrne asked the Minister for Children, Disability and Equality if she plans to provide a community neuro-rehabilitation team in the Dublin and north-east region noting that they do not currently have one. [43899/25] ",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_2132.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_2132",
          "showAs": "Disability Services",
          "debateSectionId": "dbsect_2132"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_2500",
        "answerText": " Minister of State at the Department of Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible.   ",
        "questionNumber": 2500
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Joanna-Byrne.D.2024-11-29",
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29"
        },
        "showAs": " 2518. Deputy Joanna Byrne asked the Minister for Children, Disability and Equality to provide an update on the progress being made on rolling out the national information management system for children's disability network teams; and if manual data collection is currently in place for the Dublin and North East Regional Healthcare Area. [44199/25] ",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_2149.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_2149",
          "showAs": "Disability Services",
          "debateSectionId": "dbsect_2149"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_2518",
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 2518
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Joanna-Byrne.D.2024-11-29",
          "showAs": "Joanna Byrne",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joanna-Byrne.D.2024-11-29"
        },
        "showAs": " 2519. Deputy Joanna Byrne asked the Minister for Children, Disability and Equality if there are any plans to collect data for individual disciplines such as SLT, OT, physiotherapy and so on, within the children's disability network teams in the Dublin and North East Regional Healthcare Area; and if she will make a statement on the matter. [44200/25] ",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_2150.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_2150",
          "showAs": "Disability Services",
          "debateSectionId": "dbsect_2150"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_2519",
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 2519
      },
      "contextDate": "2025-07-29"
    }
  ]
}