{
  "head": {
    "counts": {
      "questionCount": 3448,
      "resultCount": 3448
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 83. Deputy Seán Crowe asked the Minister for Children, Disability and Equality the reason that CDNT 8 of CHO 7 based in Chamber House, Tallaght, has not seen an increase in staffing or resources given the extremely high waiting list for both assessment of need and therapies; her views on whether that an almost five-year waiting list for therapies hinders a child’s participation in education and vital socialisation; the additional resources that will be put in place for a CDNT that has one of the lowest staffing levels in the area, but the highest waiting list; and if she will make a statement on the matter. [64094/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_127",
          "debateSectionId": "dbsect_127",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_127.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_83",
        "questionNumber": 83
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Defence  My Department signed a contract for the French made Dassault Falcon 6X in December 2024 with delivery expected in December 2025. The aircraft is expected to arrive in Casement Aerodrome today.  This strategic reach aircraft, with a range of over 5000 nautical miles provides the State with an independent and flexible air transport service, which is an increasingly essential requirement to assist the Government in meeting Ireland’s national and international obligations.  In addition, the aircraft will be used for a broad range of other taskings, including the evacuation of Irish citizens from critical situations, air-ambulance patient transfers, medical evacuation or repatriation of Irish Defence Forces personnel deployed on overseas missions, and logistics support for the transport of supplies to Irish Defence Forces overseas missions.  I am advised by the military authorities that the aircraft is presently expected to be operational by the end of quarter one (Q1) 2026.  The cost of the Falcon 6X aircraft was just below €53 million excluding VAT. The delivery of the Dassault Falcon 6X strategic reach aircraft represents a significant enhancement of the State’s transport, airlift and medical capabilities, and is further evidence of the Government’s ongoing commitment to enhance the capabilities of the Defence Forces. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 101. Deputy Seán Crowe asked the Minister for Defence if the Government is to take delivery of the Dassault Falcon 6X aircraft in December 2025; the final agreed cost; and the date by which the aircraft will enter operational service. [72029/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_42",
          "debateSectionId": "dbsect_42",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_42.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_101",
        "questionNumber": 101
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Culture, Communications and Sport  My Department in its current configuration was established in June 2025. Details in respect of Data Protection included any breaches are published in my Department's Annual Reports and the most recent report in respect of 2024 can be found at the link under  assets.gov.ie/static/documents/d0ac3582/DTCAGSM_Annual_Report_2024_EN.pdf  Details of any data breaches in agencies under my Department's remit are operational matters for those agencies. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 539. Deputy Seán Crowe asked the Minister for Culture, Communications and Sport the number of data breaches recorded by Government departments and State agencies, in each of the past five years, in tabular form. [72511/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_423",
          "debateSectionId": "dbsect_423",
          "showAs": "Data Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_423.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_539",
        "questionNumber": 539
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 657 and 658 together.  Domiciliary Care Allowance (DCA) is a monthly allowance payable to a parent / guardian in respect of a child aged under 16 who has a severe disability requiring continual or continuous care and attention substantially in excess of the care and attention normally required by a child of the same age and where the level of the child's disability is such that the child is likely to require this level of care and attention for at least 12 consecutive months. This level of care and attention must be required to allow the child to deal with activities of daily living in areas such as mobility, personal care, feeding/diet, communication, speech/language, sleeping, behaviour, safety, sensory, issues, including any other additional needs.  Eligibility for DCA is not based entirely on the type of disability or diagnosis but primarily on the impact of the child's disability, in terms of the associated overall level of care and attention required by the child compared to a child of a similar age who does not have such a disability. The decision process that applies in the consideration of whether a child meets the conditions for DCA includes the examination of all relevant factors identified as impacting on the child's additional care needs.  When reviewing an application for Domiciliary Care Allowance, the claim is first referred to one of the Department’s Medical Assessors for their opinion. Medical Assessors are fully qualified and experienced practitioners who provide a second opinion to that of the person's own doctor for the guidance of the Department's Deciding Officers.  The assessment of the substantial extra and continual care needs of children with childhood development and behavioral disorders is more challenging compared to other childhood conditions given the wide spectrum of manifestation of conditions and bearing in mind the age attainment of developmental milestones. In all cases, determinations on eligibility for DCA are based on all of the medical and care needs information provided with the application and while specialist reports and Assessment of Needs (AON) reports can be helpful in making quality and efficient decisions, they are not mandatory.  Applications are assessed based on the information which has been provided by the applicant. In cases where the supplied information does not prove satisfactorily that a child meets the eligibility criteria for DCA, any mention of further reports/assessments are intended as an aide to the applicant as to the type of medical evidence which may prove useful in the future, as decisions are appealable.  I hope this clarifies the position for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 657. Deputy Seán Crowe asked the Minister for Social Protection if an assessment of need will still be required for an application for domiciliary care allowance given the recent policy reform announcement by the Department of Children, Disability and Equality. [72237/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_518",
          "debateSectionId": "dbsect_518",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_518.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_657",
        "questionNumber": 657
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 657 and 658 together.  Domiciliary Care Allowance (DCA) is a monthly allowance payable to a parent / guardian in respect of a child aged under 16 who has a severe disability requiring continual or continuous care and attention substantially in excess of the care and attention normally required by a child of the same age and where the level of the child's disability is such that the child is likely to require this level of care and attention for at least 12 consecutive months. This level of care and attention must be required to allow the child to deal with activities of daily living in areas such as mobility, personal care, feeding/diet, communication, speech/language, sleeping, behaviour, safety, sensory, issues, including any other additional needs.  Eligibility for DCA is not based entirely on the type of disability or diagnosis but primarily on the impact of the child's disability, in terms of the associated overall level of care and attention required by the child compared to a child of a similar age who does not have such a disability. The decision process that applies in the consideration of whether a child meets the conditions for DCA includes the examination of all relevant factors identified as impacting on the child's additional care needs.  When reviewing an application for Domiciliary Care Allowance, the claim is first referred to one of the Department’s Medical Assessors for their opinion. Medical Assessors are fully qualified and experienced practitioners who provide a second opinion to that of the person's own doctor for the guidance of the Department's Deciding Officers.  The assessment of the substantial extra and continual care needs of children with childhood development and behavioral disorders is more challenging compared to other childhood conditions given the wide spectrum of manifestation of conditions and bearing in mind the age attainment of developmental milestones. In all cases, determinations on eligibility for DCA are based on all of the medical and care needs information provided with the application and while specialist reports and Assessment of Needs (AON) reports can be helpful in making quality and efficient decisions, they are not mandatory.  Applications are assessed based on the information which has been provided by the applicant. In cases where the supplied information does not prove satisfactorily that a child meets the eligibility criteria for DCA, any mention of further reports/assessments are intended as an aide to the applicant as to the type of medical evidence which may prove useful in the future, as decisions are appealable.  I hope this clarifies the position for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 658. Deputy Seán Crowe asked the Minister for Social Protection if the long waiting period for an assessment of need is taken into account during an application for domiciliary care allowance; and if it has been brought to his attention that applications have been refused due to the lack of an assessment though a child is on the waiting list for an assessment. [72238/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_518",
          "debateSectionId": "dbsect_518",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_518.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_658",
        "questionNumber": 658
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  Domiciliary Care Allowance (DCA) is a monthly allowance payable to a parent / guardian in respect of a child aged under 16 who has a severe disability requiring continual or continuous care and attention substantially in excess of the care and attention normally required by a child of the same age and where the level of the child's disability is such that the child is likely to require this level of care and attention for at least 12 consecutive months. This level of care and attention must be required to allow the child to deal with activities of daily living in areas such as mobility, personal care, feeding/diet, communication, speech/language, sleeping, behaviour, safety, sensory, issues, including any other additional needs.  Eligibility for DCA is not based entirely on the type of disability or diagnosis but primarily on the impact of the child's disability, in terms of the associated overall level of care and attention required by the child compared to a child of a similar age who does not have such a disability.  An application for DCA was received from the person concerned on 15 May 2025. The application was referred to one of the Department’s Medical Assessors for their opinion. Medical Assessors are fully qualified and experienced practitioners who provide an independent medical opinion on the eligibility of the child for DCA for the guidance of the Department's Deciding Officers.  A Deciding Officer disallowed the application for DCA as per decision letter dated 1 October 2025, on the grounds that the child was not considered to satisfy the above conditions for DCA based on the information provided with the application.  The assessment of the substantial extra and continual care needs of children with childhood development and behavioural disorders is more challenging compared to other childhood conditions given the wide spectrum of manifestation of conditions and bearing in mind the age attainment of developmental milestones. In all cases, determinations on eligibility for DCA are based on all of the medical and care needs information provided with the application and while specialist reports and Assessment of Needs reports can be helpful in making quality and efficient decisions, it is important to not that they are not mandatory.  In cases such as this one, where the supplied information does not prove satisfactorily that a child meets the eligibility criteria for DCA, any mention of further reports or assessments is intended as an aide to the applicant as to the type of medical evidence that may prove useful in the future.  An appeal of the disallow decision was registered by the Social Welfare Appeals Office (SWAO) on the 3 October 2025. As part of the appeal, the claim was first reviewed by a Deciding Officer and, following this review, the decision of 1 October 2025 remained unchanged. The person’s file was then forwarded to the SWAO for the consideration of an Appeals Officer.  An Appeals Officer disallowed the appeal for DCA in respect of the person concerned as per decision letter dated 10 December 2025 issued directly by the SWAO.  I hope this clarifies the position for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 659. Deputy Seán Crowe asked the Minister for Social Protection to examine the case of a person (details supplied) who has been denied domiciliary care allowance due to the lack of an assessment of need though they have been waiting for an appointment for some months. [72239/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_519",
          "debateSectionId": "dbsect_519",
          "showAs": "Care Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_519.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_659",
        "questionNumber": 659
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  Unfortunately, based on the information supplied, it has not been possible to locate the application in question.  If more information can be provided, officials can continue to search for the specific application.  Some information that may assist in the search is:  • Application type  • Application number  Officials will re-examine your request on receipt of the additional information.  As an Oireachtas member, you can also request the status of individual immigration cases by e-mail, using the Oireachtas Mail facility at: [ IMoireachtasmail@justice.ie ], which has been specifically established for this purpose. This service enables up to date information on such cases to be obtained without the need to seek information by way of the Parliamentary Question process. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 666. Deputy Seán Crowe asked the Minister for Justice, Home Affairs and Migration the reason a request to her Department by the HSE to provide clearance for a notification of a marriage interview involving a person in the IPAS system would result in a six-month delay. [71304/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_526",
          "debateSectionId": "dbsect_526",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_526.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_666",
        "questionNumber": 666
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 883. Deputy Seán Crowe asked the Minister for Health when a person (details supplied) will receive conformation of, and a date for a notification of marriage interview. [71305/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_700",
          "debateSectionId": "dbsect_700",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_700.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_883",
        "questionNumber": 883
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Deputy Seán Crowe  This question concerns St. Thomas National School in Jobstown. I do not know if the Minister of State is aware of the challenges it is facing. There are a lot of moving parts. The latest challenge is coming from the archdiocese in looking for clarification on an undertaking from the Department about it. It relates to Jobstown Celtic Football Club at St. Thomas National School and the building of a astro pitch. The money is sitting there in an account but we cannot get agreement from the archdiocese, which is looking for clarification from the Department. \n Deputy Michael Moynihan  The school campus referred to by the Deputy comprises a junior school and a senior school. The junior school has a major project with the Department for a new school building on the existing site, which is currently at construction stage. This project will provide modern facilities for the school community, including provision for children with special educational needs. As part of this project substantial external play facilities such as three ball courts, two junior play areas, one secure hard and soft play area and one sensory garden are being provided.  My Department understands that there are ongoing discussions between the board of management, the patron and the trustees of the school regarding an application for a sports capital grant for an astro pitch facility. The trustees have direct responsibility for property matters at the schools.  The Department supports and encourages the use of school buildings and school sports facilities outside of school hours for community and recreational purposes where feasible, including childcare and after school uses. Over the past number of years, we developed a project that was one of the first where schools collaborated with the Department of sport in terms of building facilities. It was one of the first projects because we were refused a number of times before we designed it in Charleville in County Cork. It involved a facility between the sporting organisation and the school that would be open for the school during school time and open for the community afterwards. That is the right thing to do.  I understand that there are ongoing issues regarding the patron and trustees. Unfortunately, I do not have the imprimatur to make a decision on this. I would appreciate if the Deputy could give me any correspondence between the trustees and the Department and I can see whether there is any guidance we can give or whether guidance has been sought from the Department. Our experience regarding a number of projects involves the challenge of getting the required documents to the Department before draw down.   Additional information not given on the floor of the House.   A set of revised procedures on the use of school buildings and school sports facilities outside of school hours was published in June 2024. The purpose of these procedures is to provide assistance to schools that wish to make their school buildings and school sports facilities available to community or sporting clubs or organisations outside of school hours. The procedures outline the various scenarios and informs where consent of the Department of Education and Youth is required. These procedures are an important resource for schools and their trustees, including in considering sports capital grant applications or other arrangements with community groups. The procedures have been brought to the attention of the trustee of the school in question. \n Deputy Seán Crowe  There are a lot of moving parts with regard to this. Everyone is in favour of it - the club, the school, the community, South Dublin County Council and political representatives. The challenge is that the archdiocese wants to know who will pay for the opening and closing of the premises after the school uses the facility and who will pay for insurance and cleaning. The club is going to do all that. I can get an affidavit. The archdiocese is saying the capitation grant does not cover it so it is looking for clarification from the Department regarding the archdiocese's demand for an increase in the capitation grant. Some of the things it is looking for are outside the scope of it. The ball is back in the court of the Department. The archdiocese is saying that it might look at it at a later stage and that when a sports capital grant is established to cover the running costs of the project, this proposal can be revisited. What it is looking for is madness. At the end of the day, common sense should apply. It is an area of high deprivation and this decision will hugely affect the children. An astro pitch is already there but it is safer to play on the road than it is on the actual pitch, given the state it is in. I am really frustrated about this. \n Deputy Darren O'Rourke  I fully support Deputy Crowe on this. A solution has to be found. The Department has a role to play here, as have the school, the patron body and the religious authorities, but a solution must be found. \n Deputy Michael Moynihan  I accept the genuine frustration of the Deputies on this. The Department of Education and Youth is very committed. Many facilities paid for by the State and built up over the years close on Friday evening and do not open again until Monday morning. We do want to make sure every facility, be it in Jobstown or anywhere else, is used. I have considerable experience as a public representative over a number of years in trying to unwind the challenges faced by local communities. Forgive me if I do not have the exact details because it is not in my Department but if I can help, I will. A sports capital grant has been secured. The community is engaging to get approval to draw down the funding. The archdiocese or the patron body is looking for clarifications that are not available for the club to give. It is important that we look clinically at this. If the Deputy can give me those details, I will follow up on them. If our Department has a role to play, I will certainly look at it as a matter of urgency. It is important that we break down barriers because this is a model of funding that is available to communities. \n Deputy Seán Crowe  It is a huge advantage to the area, the pupils in the school and the wider community. It is something that can be resolved. If an affidavit from the club stating that it would cover all the costs was given, that might be enough. The capitation grant is a problem but I might talk to the Minister of State afterwards. Perhaps we can put our heads together and, with the archdiocese, come up with a commonsense solution that will resolve this problem and provide an astro pitch for the kids in this area. \n Deputy Michael Moynihan  The capitation grant is specifically paid for costs relating to the running of the school, such as the cost of heating and lighting. We had debates earlier in the session regarding that. I do not think it should affect this issue. Is the archdiocese looking for some information? I find it difficult as well. We are dealing with a very protracted system across the patron bodies as well. I would have no difficulty in trying to bring clarity from our Department's point of view or maybe some advice I might have. ",
        "questionType": "oral",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 101. Deputy Seán Crowe asked the Minister for Education and Youth if she is aware of the ongoing challenges regarding a school (details supplied) accessing a sports capital grant due to concerns of the archdiocese relating to financial costs incurred by primary schools when undertaking such a grant, if her departmental officials would be asked to mediate between the two parties in order to achieve a resolution that would provide a sports amenity for a socio-economically deprived area and if she will provide clarity to both parties.  [70411/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/dbsect_31",
          "debateSectionId": "dbsect_31",
          "showAs": "School Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/mul@/dbsect_31.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_101",
        "questionNumber": 101
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  My department has not been formally notified of any difficulties between sports clubs and schools run by religious institutions for access to and use of a school's sporting facilities.  My department has published procedures on the use of school buildings and school sports facilities outside of school hours. The purpose of these procedures is to assist schools that wish to make their buildings and sports facilities available to community groups, sporting clubs, or other organisations outside normal school hours.  The procedures set out the requirement for,  • Clear legal agreement with termination clause between the club and the school management  • Consultation with Patrons, Trustees and land owners  • Agreement between the school and the club on costs  • Compliance with governance manuals for specific school types. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 150. Deputy Seán Crowe asked the Minister for Education and Youth if she is aware of any ongoing difficulties between sports clubs and schools run by religious institutions for access to and use of sporting facilities; if her Department is dealing with any such cases; and if there is a procedure for doing so. [70412/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_173",
          "debateSectionId": "dbsect_173",
          "showAs": "School Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_173.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_150",
        "questionNumber": 150
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  All applications for a certificate of naturalisation are assessed individually based on the provisions of the Irish Nationality and Citizenship Act 1956, as amended.  My Department has produced a comprehensive guidance document for all potential applicants which outlines all the documents required for an application. This document is published on my Department's Immigration website and is available here: www.irishimmigration.ie/wp-content/uploads/2024/04/Citizenship-Guidance-Document-April-2024.pdf.  In cases where incomplete applications are received, the applicant is notified, and the application is returned with a request to provide the missing documentation within 28 days. A reminder notification is issued after 18 days if the required documentation has still not been provided. If the requested documents are not supplied within the timeframe provided, the application will be deemed ineligible and closed.  Citizenship Division are aware that in some instances, applicants are uploading the documentation but failing to resubmit the application. It is essential that applicants complete the process to resubmit their application. The onus is on applicants to ensure that they provide all of the documents required.  Detailed information on how to apply for naturalisation and other resources is available here: www.irishimmigration.ie/how-to-become-a-citizen/.  If an applicant has any queries relating to their application, they can contact Citizenship division using my Departments Customer Service Portal. This can be accessed at the following link: portal.irishimmigration.ie/en/.  My Department continues to monitor customer experience and is committed to its continuous improvement. The functionality of all our online platforms is under constant review. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 194. Deputy Seán Crowe asked the Minister for Justice, Home Affairs and Migration if his attention has been drawn to complaints that the list of documentation required for a citizenship by naturalisation application on the immigration website and portal is not comprehensive and has resulted in applications being refused for the lack of said documentation; and if he will ensure that a complete list of all documentation accepted and required for a citizenship application is made easily and publicly available. [68298/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_171",
          "debateSectionId": "dbsect_171",
          "showAs": "Naturalisation Applications",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_171.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_194",
        "questionNumber": 194
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  This Government is fully committed to ensuring that every child has a positive school experience, with access to qualified and engaged teachers who are dedicated to supporting their learning.  The recruitment and appointment of teachers is managed by individual school authorities, of which there are over 3,700. While most teaching positions are filled, some schools face significant recruitment challenges. Payroll data from March 2025 shows the number of unfilled teaching posts remains low. Analysis of the teacher payroll shows 1.8% of allocations (621 posts) in post-primary were unutilised. This relatively low vacancy rate suggests that the vast majority of schools are well-staffed and able to meet the needs of their students.  Officials of my Department have contacted the school referred to in the Deputy’s question and have been informed the school has an adequate number of teachers to meet the demand for French.  My Department has introduced a range of measures to address teacher supply including in specific subject areas. Registered post-primary teachers, regardless of employment status, can avail of free upskilling programmes including French. These flexible programmes boost teachers’ employment opportunities while addressing subject-specific teacher shortages. The French Upskilling Programme commenced in Trinity College Dublin in September 2025 with 35 teachers.  Restrictions on jobsharers and those on a career break from working as substitutes in schools have been eased. Under the Teaching Hours Extension Scheme post-primary teachers can provide up to 35 additional hours of substitute cover per term including in science. All these substitution measures have been extended to the current school year.  The profession is attractive, with strong demand for teacher education programmes, almost 1,800 newly qualified post-primary teachers registered with the Teaching Council and over 127,000 teachers on the Teaching Council register in 2025. Salaries are competitive, starting at €46,448 for post-primary teachers and rising to €85,000 under the current pay deal.  Around 6% of first-choice CAO applications from 2017–2024 were for teaching, showing steady demand. In 2025, first preferences rose by 5% for post-primary teaching.? Over 75% of new post-primary teachers are employed full-time. 93% of teachers with 5+ years’ experience hold permanent full-time or pro-rata contracts.  My Department frequently consults and engages closely with stakeholders on teacher supply issues through industrial relations forums, sectoral meetings, and direct discussions. ?Further measures to strengthen the teaching workforce will be considered to ensure that schools have the support needed to provide an excellent education for every student. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 272. Deputy Seán Crowe asked the Minister for Education and Youth if her attention has been drawn to the difficulty faced by a school (details supplied) in securing an adequate number of French teachers permanently; if she agrees  that a frequent change of temporary teacher creates a chaotic learning environment; the assistance that her Department will provide to the school to secure the appropriate number of permanent staff; and if she will make a statement on the matter. [67756/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_250",
          "debateSectionId": "dbsect_250",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_250.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_272",
        "questionNumber": 272
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  The additional funding for current expenditure in Budget 2026 for the Health Vote is €1.5 billion, bringing the total current allocation to €25.8 billion. This includes funding to maintain existing levels of service and for new service developments, including funding for the recruitment of 3,300 additional whole time equivalent staff in 2026.  The HSE is in the process of preparing its National Service Plan for 2026, setting out how the HSE will operationalise the Department’s priorities funded in Budget 2026, including the key priorities of improved access, quality and safety for those who use our services and value for money for the public more broadly.  The National Service Plan will include HSE plans, targets and timelines for specific measures to be progressed in 2026. Further information on the specific measures to be progressed in 2026, along with the associated funding and staffing, will be available when the National Service Plan has been completed and approved.  Tuberculosis (TB) remains a significant public health concern both globally and in Ireland. While Ireland is a low-incidence country, recent figures show a rise in cases. My Department and the HSE continue to monitor the situation closely. The HSE works with partners and communities to raise awareness, especially among people at higher risk.  In 2024, the HSE published Striving to End Tuberculosis: A Strategy for Ireland 2024–2030. This five-year plan is Ireland’s first national TB strategy. It is aligned with WHO targets of reducing incidence by 80% and deaths by 90% by 2030. A detailed implementation plan, developed by the National TB Advisory Committee is guiding delivery.  The HSE is progressing implementation through existing services and resources. Work is underway to introduce a selective BCG vaccination programme next year. An updated TB Resources Report will align staffing and funding with current needs. New national TB guidelines are also being developed, with completion expected by end-2025.  People with TB are benefiting from shorter, more tolerable treatments. Multidisciplinary teams are expanding access to care and support. Enhanced surveillance, including genome sequencing, improves outbreak response and data quality. These actions demonstrate the progress made in delivering the national TB strategy. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 699. Deputy Seán Crowe asked the Minister for Health if she plans to provide specific funding for the delivery of the Collaborative Tuberculosis Strategy for Ireland: 2024–2030 to the HSE as the HSE’s current mandate in the matter is for the strategy to be ‘delivered within existing resources’ which is insufficient to the task. [68173/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_626",
          "debateSectionId": "dbsect_626",
          "showAs": "Health Strategies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_626.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_699",
        "questionNumber": 699
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Seán Crowe",
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_445.xml"
            }
          },
          "debateSectionId": "dbsect_445",
          "showAs": "Health Strategies",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_445"
        },
        "questionNumber": 518,
        "date": "2025-11-27",
        "showAs": " 518. Deputy Seán Crowe asked the Minister for Health further to Parliamentary Question No. 687 of 14 October 2025 stating that the organisation are 'not the appropriate responders' to the question; if she intends to fully fund the Collaborative Tuberculosis Strategy for Ireland: 2024–2030. [66944/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_518"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 574 and 575 together.  As Minister for Health, I am determined to support our screening programmes, which are a valuable part of our health service, enabling early treatment and care for many people, and improving the overall health of our population.  Currently, all babies (between 3 and 5 days old) are offered newborn bloodspot screening (generally known as the ‘heel prick’ test), which tests for nine rare but serious conditions that are treatable if detected early in life. The Programme for Government commits to continually reviewing the number of conditions babies are screened for.  Incremental progress continues to be made on the expansion of the National Newborn Bloodspot Screening Programme (NNBSP). In 2023, two recommendations from the National Screening Advisory Committee (NSAC) on the addition of Severe Combined Immunodeficiency (SCID) and Spinal Muscular Atrophy (SMA) to the NNBSP were approved.  In Budget 2024, an additional €1.4 million of new development funding was provided to support the SMA/SCID implementation process. Once both conditions have been fully implemented, the number of conditions screened for in Ireland will increase to 11.  In terms of the current implementation status, the HSE has advised that the equipment needed to enable the roll-out testing for SMA and SCID has been purchased, delivered and successfully installed at the newborn screening laboratory and significant progress continues with regards to the laboratory verification process. The recruitment process to hire the additional staff required to support the expansion of the NNBSP has been completed and work continues on developing screening pathways for both conditions.  In relation to concerns raised around the length of the implementation process, it should be emphasised that Ireland is not taking longer than other comparable countries to assess and implement additions to the NNBSP.  The Health Council of the Netherlands first recommended screening for SMA in 2019 and implementation was completed three years later in October 2022. In the United States of America, it took six years to fully implement SMA screening after it was added to the Recommended Uniform Screening Panel (RUSP) in 2018. In the United Kingdom, screening for SCID and SMA have been under consideration by the UK National Screening Committee since 2017 and 2018 respectively.  Nevertheless, I am acutely aware of how difficult it is for parents, families and children who have received a diagnosis of a rare disease, and how challenging daily life can be for them. This is why I remain committed to the further expansion of screening in Ireland in accordance with internationally accepted criteria and best practice. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Seán Crowe",
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_503.xml"
            }
          },
          "debateSectionId": "dbsect_503",
          "showAs": "Health Screening Programmes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_503"
        },
        "questionNumber": 574,
        "date": "2025-11-27",
        "showAs": " 574. Deputy Seán Crowe asked the Minister for Health the date by which spinal muscular atrophy will be included in the newborn heel prick test, given that her predecessor made a commitment to that effect two years ago. [67215/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_574"
      },
      "contextDate": "2025-11-27"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 184,
        "showAs": " 184. Deputy Seán Crowe asked the Minister for Foreign Affairs and Trade the average turnaround time for applications to the foreign birth register. [62953/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Foreign"
        },
        "by": {
          "showAs": "Seán Crowe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06",
          "memberCode": "Seán-Crowe.D.2002-06-06"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_184",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_142",
          "showAs": "Foreign Birth Registration",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_142",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_142.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Foreign Affairs and Trade (Deputy Simon Harris)  My Department is responsible for processing Foreign Birth Registration (FBR) applications for people who are born abroad and claim Irish citizenship through a grandparent born in Ireland or through a parent who has claimed citizenship also through FBR or Naturalisation.  Foreign Birth Registration, by its nature, is a detailed and complex process, often involving official documentation across several jurisdictions and three generations.  FBR applications are currently being processed at the advertised time of approximately nine months. The processing time begins when the physical application form and supporting documents are received in the FBR Unit of the Passport Service. Where additional supporting documentations are required, more time will be required to process the application. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 440,
        "showAs": " 440. Deputy Seán Crowe asked the Minister for Education and Youth to examine the case of a person (details supplied) who is due to start senior cycle in a special school but is due to turn 18 this year and will be unable to finish senior cycle in that school; if an allowance can be made for this student to remain in the school. [62964/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Education"
        },
        "by": {
          "showAs": "Seán Crowe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06",
          "memberCode": "Seán-Crowe.D.2002-06-06"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_440",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_370",
          "showAs": "Special Educational Needs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_370",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_370.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Education and Youth (Deputy Michael Moynihan)  Special schools funded by my Department are classified as primary national schools. They are intended, in accordance with the provisions of rule 64(1) of the Rules for National Schools, to provide an education to children and young people, with special educational needs, aged from 4 years to until the end of the school year in which they reach their 18th year.  Special schools may however seek approval from my Department for an exemption from rule 64(1) in respect of students over the age of 18 who are pursuing courses leading to accreditation on the National Qualifications Framework (e.g. Senior Cycle, Junior Cycle Level One and Level Two learning programmes (L1L2LPs)/Leaving Cert Applied/QQI Level 3).  A request for an exemption from rule 64(1) can only be made by a school where in addition to the above:  The student requires one additional year in order to complete their course  Retaining the student in the school for another school year will not prevent a younger student being enrolled there and  Plans are in place to transition the student to a post-school setting at the end of the school year.  Special schools are invited each year to make applications to my department for exemptions from rule 64(1) in respect of students who meet the above criteria. Where the criteria is met, my department will approve the exemptions.  My Department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 442,
        "showAs": " 442. Deputy Seán Crowe asked the Minister for Education and Youth if her Department will support the opening of an additional ASD class at a school (details supplied). [62999/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Education"
        },
        "by": {
          "showAs": "Seán Crowe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06",
          "memberCode": "Seán-Crowe.D.2002-06-06"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_442",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_372",
          "showAs": "School Accommodation",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_372",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_372.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Education and Youth (Deputy Michael Moynihan)  I propose to take Questions Nos. 442 and 460 together.  My Department and the National Council for Special Education (NCSE) have begun preparatory work in relation to planning for the provision of further new special class and special school places for the 2026/27 school year and beyond.  As you are aware parents were asked to notify the NCSE of their requirement for a special class for the 2026/27 school year by 1 October 2025. The NCSE is now collating and assessing the information gathered through this notification process. Once complete the NCSE will be in a position to engage with schools across the country to open new special classes.  In order to ensure new special classes can open as quickly as possible the NCSE prioritise working with medium and larger primary schools who do not already have a special class and have available accommodation to accommodate new special class. This approach maximises the use of existing space which can be reconfigured efficiently while also ensuring that new provision continues to be established. It also increases number of schools with special classes providing parents with greater choice and reducing the distances thatsome children are travelling to access a special class place.  However, as in other years where schools have no available accommodation, particularly at post-primary level and there is known demand in a local area, my department will continue to provide additional classroom accommodation to provide necessary places.  The NCSE will also have due regard to any vacant places in existing special classes in an area and any places that will be become available through the normal movement of children leaving primary or post-primary school.  The school referred to by the Deputy already has 3 special classes and any school willing to open further new special classes is to be commended.  The NCSE will assess what additional provision is required in local areas and what schools have capacity to accommodate required provision. My Department and the NCSE are committed to ensuring that sufficient special education placements remain available for children with special educational needs. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 496,
        "showAs": " 496. Deputy Seán Crowe asked the Minister for Education and Youth the number of post-primary school places in the Dublin south west area in the 2025-2026 academic year; the number of children who did not receive a place in this academic year; and the number of places her Department estimates will be required by 2030. [63673/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Education"
        },
        "by": {
          "showAs": "Seán Crowe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06",
          "memberCode": "Seán-Crowe.D.2002-06-06"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_496",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_416",
          "showAs": "Departmental Data",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_416",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_416.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Education and Youth  I can assure the Deputy that the provision of school places to meet the needs of children and young people at primary and post primary level, including children and young people with special educational needs is an absolute priority of mine.  As the Deputy may be aware, in order to plan for school provision and analyse the relevant demographic data, my department divides the country into 314 school planning areas and uses a geographical information system, using data from a range of sources, including CSO census data, child benefit and school enrolment data, to identify where the pressure for school places across the country will arise and where additional school accommodation is needed at primary and post-primary level.  The annual enrolment process for new Junior Infants at primary and new First Years at post-primary is a very large-scale operation that is transacted at close to 4,000 schools across the country, involving some 140,000 pupils. While my department is aware of enrolment pressures and demand for additional school places in some areas, it is important to note that enrolment pressures can be driven by duplications of applications, applications from outside an area, and school of choice factors. Notwithstanding the above, in some areas, demographic pressures and other factors are driving a requirement for additional school places.  Furthermore, the data sharing arrangements that were in place for the 2025/26 admissions process have been put in place again for the 2026/27 admissions process in school planning areas that are experiencing enrolment pressures, including particular school planning areas of Dublin south-west constituency. The admissions data provided by schools will allow the department to analyse duplicate applications as there can be significant overlap in areas.  As per my departments analysis of Dublin south-west, for the 2024/25 academic year there were more first year places available than 6th class children and 5.7% of first year places were unfilled.  The Deputy will appreciate that there can often be significant overlap across areas and schools, and the nature of the admissions processes is quite complex. As a result, there can be multiple iterations, where applicants may accept a place but subsequently be offered and accept a place at a second school, freeing up capacity at the first school accepted. In that context, is may take some time for my department to fully review the availability of post-primary school places in Dublin south-west constituency while the admissions process continues to progress.  The availability of places is a matter for each individual school in the context of their Admissions legislation. Enrolment data for previous school years is available on the Department website. Enrolment data for the 2024/25 school year is available of the Departments website at www.gov.ie. The specific information requested is not available at this time.  Parents have the right to choose which school to apply to and where the school has places available the pupil should be admitted. However, in schools where there are more applicants than places available a selection process may be necessary. This selection process and the enrolment policy on which it is based must be non-discriminatory and must be applied fairly in respect of all applicants. However, this may result in some pupils not obtaining a place in the school of their first choice.  I can assure the Deputy that my department will continue to keep the school place requirements in the Dublin south-west school planning areas, as with other areas across the country, under review. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 497,
        "showAs": " 497. Deputy Seán Crowe asked the Minister for Education and Youth to provide details of the 39 schools that are being built or expanded in the south Dublin area; and the number of additional school places that each will provide, in tabular form. [63674/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Education"
        },
        "by": {
          "showAs": "Seán Crowe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06",
          "memberCode": "Seán-Crowe.D.2002-06-06"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_497",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_417",
          "showAs": "Departmental Data",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_417",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_417.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Education and Youth  The table below lists the 39 school building projects which are in construction in Dublin South. These projects when completed will deliver in excess of 3,700 new and modernised school places across post primary, primary and special education schools.   School Building Projects In Construction in South Dublin      No.    Roll Number    School Name    Townland    School Level    Project Type      1    18585H    SN Banrion Na nAingeal 1    Ballyfermot    Primary    Extension      2    18817C    SN Brighde    Ranelagh    Primary    Extension      3    18843D    Bainríon na Aingeal 2    Ballyfermot    Primary    Extension      4    19319O    St. Olaf's NS    Dundrum    Primary    Extension      5    60041D    Coláiste Eoin    Stillorgan    Post Primary    Extension      6    60792C    Presentation College    Dublin 8    Post Primary    Extension      7    60841M    Rosary College    Crumlin    Post Primary    Extension      8    18647D    SN San Treasa    Mount Merrion    Primary    Extension & Refurbishment      9    19319O    St. Olaf's NS    Dundrum    Primary    Modular Project      10    19764M    Our Lady of Wayside NS    Bluebell    Primary    Modular Project      11    19837N    Drimnagh Castle CBS NS    Walkinstown    Primary    Modular Project      12    19878E    Holy Rosary Primary School    Tallaght    Primary    Modular Project      13    20543D    Sallynoggin ETNS    Sallynoggin    Primary    Modular Project      14    20563J    Libermann Spiritan School    Templeogue    Special Education    Modular Project      15    60261R    St. Benildus College    Stillorgan    Post Primary    Modular Project      16    19355S    Ballyowen Meadows    Dún Laoghaire    Special Education    New School Building      17    19702N    St. Thomas JNS    Tallaght    Primary    New School Building      18    20028K    Setanta Special School    Greenhills    Special Education    New School Building      19    20441S    Shellybanks ETNS    Sandymount    Primary    New School Building      20    20520O    Harold's Cross ETNS    Harolds Cross    Primary    New School Building      21    68305F    Sandymount Park ETSS    Sandymount    Post Primary    New School Building      22    68365A    Harolds Cross ETSS    Harolds Cross    Post Primary    New School Building      23    20103V    John Scottus NS    Ballsbridge    Primary    Refurbishment Only      24    19466E    St. Kevin's GNS    Kilnamanagh    Primary    SEN Repurposing      25    19613O    Scoil Cnoc Mhuire Senior School    Tallaght    Primary    SEN Repurposing      26    60070K    Dominican College    Blackrock    Post Primary    SEN Repurposing      27    91343T    St. Tiernan's Community School    Balally    Post Primary    SEN Repurposing      28    19446V    Scoil Mhuire Boys    Rathfarnham    Primary    SEN Repurposing      29    19463V    Scoil Maelruain SNS    Old Bawn    Primary    SEN Repurposing      30    19646G    Scoil Santain    Tamlacht    Primary    SEN Repurposing      31    19872P    Scoil Chaitlín Maude    Tallaght    Primary    SEN Repurposing      32    20103V    John Scottus NS    Ballsbridge    Primary    SEN Repurposing      33    20397S    St. Louise de Marillac PS    Ballyfermot    Primary    SEN Repurposing      34    20501K    Harcourt Terrace ETNS    Rathmines    Primary    SEN Repurposing      35    20545H    St. Christopher's NS    Ballsbridge    Primary    SEN Repurposing      36    20571I    St. Louis NS    Rathmines    Primary    SEN Repurposing      37    60562I    Templeogue College    Templeogue    Post Primary    SEN Repurposing      38    70140L    Firhouse Community College    Firhouse    Post Primary    SEN Repurposing      39    91337B    Killinarden Community School    Tallaght    Post Primary    SEN Repurposing      ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 559,
        "showAs": " 559. Deputy Seán Crowe asked the Minister for Housing, Local Government and Heritage if he intends to introduce legislation regarding planning permission for crematoria. [62940/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Housing"
        },
        "by": {
          "showAs": "Seán Crowe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06",
          "memberCode": "Seán-Crowe.D.2002-06-06"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_559",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_461",
          "showAs": "Planning Issues",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_461",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_461.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  Like all forms of development, unless they are specifically exempted, crematoria for human remains are required to obtain planning permission in the normal manner in accordance with section 34 of the Planning and Development Act 2000, as amended (the 2000 Act).  Where any party is unhappy with the decision of a planning authority in relation to an application for planning permission, such as a crematorium under section 34 of the Act, the decision may be appealed to An Coimisiún Pleanála within four weeks of the decision of the planning authority in accordance with section 37 of the Act of 2000.  It should be noted that under section 30 of the Act, I, in my role as Minister with responsibility for planning, am specifically precluded from exercising any power or control in relation to any particular case with which a planning authority or the Commission is or may be concerned. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 716,
        "showAs": " 716. Deputy Seán Crowe asked the Minister for Social Protection if his Department has prepared guidance for charities and non-profit organisations that are concerned their required contributions to autoenrollment pensions for their staff will place a financial burden that will lead to a reduction of services and staff layoffs; if specific guidance has been prepared; the advice he will offer to those organisations; and if he will make a statement on the matter. [63281/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Social"
        },
        "by": {
          "showAs": "Seán Crowe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06",
          "memberCode": "Seán-Crowe.D.2002-06-06"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_716",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_565",
          "showAs": "Social Welfare Code",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_565",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_565.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Social Protection  The Programme for Government contains a commitment to introduce the Automatic Enrolment (AE) Retirement Savings System. The aim of introducing AE is to address the pension coverage gap that exists in Ireland and to provide workers with greater comfort and security regarding their retirement income. The new system - to be known as My Future Fund - will commence from 1 January 2026. The implementation of My Future Fund will pave the way for around 750,000 workers to be brought into a retirement savings scheme for the first time and I look forward to its implementation.  My Department has been engaging with employers, including those in the community and voluntary sector, since the release of the AE 'strawman' public consultation in 2018. Its impending implementation has also been well-flagged since the enactment of the AE Act in 2024. Therefore, employers have been given a substantial lead-in period to budget appropriately for its introduction, including through budget negotiation with a sponsor where appropriate. Additionally, my Department has been proactive in advising other Departments, including the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation about this issue during 2025.  It is also worth mentioning that, in response to employer feedback, the design of the AE system provides for phasing in of the contribution rates over a decade. Employees will be required to make initial contributions of 1.5% of gross earnings, rising by 1.5 percentage points every three years until it reaches a maximum contribution rate of 6% in Year 10. These contributions will be matched on a ‘one-for-one’ basis by employer contributions, and 'topped-up' by the State at a rate of €1 for every €3 the employee contributes. This phased approach arose as a consequence of the consultation the Department undertook in the design of the system. For community and voluntary organisations (and employers more generally), this approach also gives very clear certainty as to the rates that will be applicable so as to facilitate the gradual absorption of these labour costs over time.  With regard to engagement with employers over the past 18 months, including those in the community and voluntary sector, we have hosted thousands of employers and related professionals through many webinars, conferences and in person stakeholder meetings, with more planned over the remainder of this year and into next. We are also implementing an extensive advertising campaign aimed specifically at employers and have made a wealth of information available through our AE hub at www.gov.ie/autoenrolment and brought this to the attention of all of the representative organisations.  I hope this clarifies matters for the Deputy. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1180,
        "showAs": " 1180. Deputy Seán Crowe asked the Minister for Rural and Community Development and the Gaeltacht if he intends to introduce legislation for increased regulation and oversight of crematoria. [62939/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Rural"
        },
        "by": {
          "showAs": "Seán Crowe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06",
          "memberCode": "Seán-Crowe.D.2002-06-06"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1180",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_960",
          "showAs": "Legislative Measures",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_960",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_960.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Rural and Community Development and the Gaeltacht  My Department has responsibility for policy and legislation in relation to local authority burial grounds while the actual operation of burial grounds is the responsibility of the local authority concerned.  Under the Local Government (Sanitary Services) Acts, 1878 to 2001, local authorities are deemed to be burial boards for their respective functional areas. Acting in their capacity as burial boards, local authorities are responsible for the management, regulation and control of burial grounds in their functional areas.  Regulations are currently in place regarding burials and burial grounds, namely Part III of the Public Health (Ireland) Act, 1878, as amended in Part VI of the Local Government (Sanitary Services) Act, 1948 and more recently, the Local Government Acts, 1994 and 2001, and also in the Rules and Regulations for the Regulation of Burial Grounds 1888 and amendments thereto. Local authorities also have powers to make bye-laws in relation to burial grounds.  In relation to the Deputy's specific query, there are currently no plans to introduce new regulations in this area.  In the context of Funeral Directors and Crematoria, I understand there are professional bodies for these activities with their own codes and standards, but my Department has no role in this regard.  In general, with regard to Crematoria, the establishment and operation of any such activity is subject, where applicable, to the provisions of legislation dealing with planning and development, environmental protection and air pollution. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Justice, Home Affairs and Migration  The safety and well-being of all residents in International Protection accommodation is the highest priority for the Department and fire safety is a critical requirement for all accommodation centres.  The Department does not routinely collate data in the manner requested in the question, but all international protection accommodation centres are subject to inspections each year through either Health Information and Quality Authority (HIQA) or IPAS-commissioned inspections.  The IPAS inspection regime is a key mechanism for ensuring that all providers adhere to their contractual obligations, which explicitly include full compliance with all statutory fire and building control regulations.  Correct fire safety certification, in line with relevant Local Authority requirements, is also a priority aspect of the appraisal process for all international protection accommodation centres.  It is a mandatory requirement for any new or renewed contract for accommodation for international protection applicants.  Reports from IPAS inspections are published on gov.ie:   www.gov.ie/en/international-protection-accommodation-services-ipas/publications/ipas-inspection-reports/   HIQA inspection reports can be found on the HIQA website:   www.hiqa.ie/reports-and-publications/inspection-reports   IPAS also carries out unannounced inspection compliance visits which ensure adherence to established IPAS policies, procedures, and standards, by the contracted service provider.  It is important to note that a published inspection report is a snapshot in time, reflecting the findings on the day of the inspection. The report itself is not updated with subsequent actions.  Therefore, while a report may highlight deficiencies, the formal follow-up actions, remedial works, or photographic proof of resolution provided by the contractor are handled after the report is issued, as part of the compliance process. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_379",
        "debateSection": {
          "debateSectionId": "dbsect_362",
          "showAs": "International Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_362",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_362.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Justice"
        },
        "questionNumber": 379,
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 379. Deputy Seán Crowe asked the Minister for Justice, Home Affairs and Migration if all IPAS centres in operation have a valid fire safety certificate; the number of centres found to have fire safety concerns during inspections in 2025; if any IPAS centres have been allowed to begin operations without a fire safety certificate; and if he will make a statement on the matter. [62578/25] "
      }
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  Cost Rental is a key element of the Housing For All strategy to improve affordability in the rental sector and to provide secure, long-term homes for moderate-income households. The core principle of Cost Rental is that the rents cover the development, management, and maintenance costs of the homes, so that the long-term future of the homes is financially secure, and that rents are not subject to the pressures of the open market.  The primary eligibility condition for accessing Cost Rental housing is a maximum net annual household income (less income tax, PRSI, USC and superannuation contributions) of €66,000 for Dublin and €59,000 elsewhere.  However, since rents must cover costs, a Cost Rental landlord must be confident that a prospective tenant can afford to pay the rent every month over the long term. Therefore, under the current legislation, a Cost Rental landlord has final discretion to consider the suitability of eligible applicants.  In line with the Programme for Government commitment, the parameters for Cost Rental eligibility are kept under review to ensure the scheme effectively targets the intended tenant cohort. ",
        "to": {
          "showAs": "Housing",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Seán Crowe",
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_521.xml"
            }
          },
          "debateSectionId": "dbsect_521",
          "showAs": "Housing Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_521"
        },
        "questionNumber": 602,
        "date": "2025-11-12",
        "showAs": " 602. Deputy Seán Crowe asked the Minister for Housing, Local Government and Heritage if he is aware of the large number of people who earn too much to qualify for social housing, but not enough to qualify for cost rental schemes; his plans to introduce more flexibility into the cost rental bands to allow for this; if he agrees that at present, this results in greater reliance on HAP where other options should be available; and if he will make a statement on the matter. [61246/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_602"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_3",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Seán Crowe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06",
          "memberCode": "Seán-Crowe.D.2002-06-06"
        },
        "debateSection": {
          "debateSectionId": "dbsect_5",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/debate/dbsect_5",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/debate/mul@/dbsect_5.xml"
            },
            "pdf": null
          }
        },
        "questionType": "oral",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 3. Deputy Seán Crowe asked the Tánaiste and Minister for Defence the current status of the procurement process for the military primary radar system; if rollout of the system will commence in 2026 and full operational status will be achieved by 2028; if there has been any change in the total cost of approximately €300 million for the programme; if the current training courses for such operations in the Defence Forces are compatible with the new system; and if he will make a statement on the matter. [60897/25] ",
        "questionNumber": 3,
        "answerText": " Deputy Donnchadh Ó Laoghaire  The Tánaiste's previous answer tailors well enough with this question. One of the key priorities in how we tailor investment in our Defence Forces is our naval capacity and our understanding of what is in Irish waters. That is probably the number one issue of concern for us and for our neighbours. The most important piece of infrastructure is ensuring that we have that full radar picture, which is something we have been missing for a very long time. Can we get an update for the rollout of that and a timeline for completion? \n Deputy Simon Harris  On this point we agree. A key priority for Ireland and our Defence Forces, our Naval Service and our country has to be to ensure we have as best an understanding as possible of what happens in our seas, below our waters. A key priority for me is to ensure the operational capacity of the Defence Forces is maintained and developed to get us to the level of ambition 2, LOA2, as defined by the Commission on the Defence Forces, CODF.  The CODF recommended the development of a primary radar capability to ensure that Ireland can maintain a complete \"recognised air picture\" and that this should be an immediate and top priority. There are three elements to the military radar programme: the land based long range primary radar; the ground based air defence, GBAD, systems, to include a counter-unmanned aerial systems, C-UAS; and the maritime ship-borne radar.  This programme of work is ongoing and I am pleased to tell the Deputy that good progress has been made. When fully delivered, the recognised air picture will incorporate this suite of military radar systems, which will have the capability to detect all aircraft traversing our airspace, including any that may be operating with their transponders turned off. Full delivery of the programme will be complex because it needs to be rolled out in a sequential area. This has been prioritised with a target date of 2028 identified in the detailed implementation plan. That being said - and this is an important message for everybody to know - elements of this capability will be rolled out in phases, starting in 2026. Our radar capacity will increase from 2026 and will be fully completed by 2028.  My Department has engaged with a number of countries, including all EU member states, to ascertain their interest in supporting Ireland to deliver this capability. Based on the responses received, earlier this year I directed my officials to commence bilateral discussions with a small number of countries, with a view to assessing options for delivery. These bilateral discussions have now concluded and technical assessments of the various options for delivery of the entire programme are very close to finalisation. I anticipate that this phase of the programme will conclude before the end of this year, with the Government decision before the end of this year as well. \n Deputy Donnchadh Ó Laoghaire  The primary radar system and the full radar picture is one of the cornerstones of the transformation of the Defence Forces and it is crucial we get it right, not least because it will cost a substantial sum of money. Can the Tánaiste give us a sense of what kind of sums we are talking about because it is important we apply lessons learned from other public contracts to this project? There was a discussion yesterday on the relationship between Britain and Ireland. There was a discussion about security. One of the points advanced was military expenditure. People talk about the amount spent but it can be spent well or can be spent badly. Obviously, it is essential we achieve value for money in delivering this.  The Tánaiste talked about the naval radar picture and the requirement that it would be ship-borne. Do we have the capacity, in terms of our current fleet, to deliver that? Similarly, do we have the capacity with the air picture? \n Deputy Simon Harris  Yes, we do. I take the point on the value for money or good value for the taxpayer. I will update the House once we get to the point where we place contracts and the like. Obviously, securing value for money is important. The only priority above that is securing this. That is why I think wise decisions were taken in years before my occupation of this office to put in place structures where we could engage with other governments in other countries, particularly, but not exclusively, in the European Union, which may have the ability to provide this equipment to us in a quicker manner. Speed and value are absolutely key priorities.  I expect to be in a position to update the Government on this very shortly and once I have done that, I will be very happy to update the Deputy, the House and the Oireachtas committee. All capital expenditure associated with the delivery of the programme will be met from within the capital allocations 2026 to 2030, which were recently agreed as part of the review of the national development plan. We are at a critical stage now in terms of this project and, pending a final decision on the options of delivery, it would be premature for me to make any further comment on likely costs. Training needs will be determined and delivered as part of the delivery of the programme also. \n Deputy Donnchadh Ó Laoghaire  The cost is a consideration. It is vitally important that value for money is achieved but also that it is of the highest standard and it is secure. We talked about whether the naval and the aircraft capacity existed. There is also the issue of personnel. Will there be a requirement for additional specialist personnel in order to operate this? The Minister talked about it being rolled out in parts. Can he give us a sense of the sequence of those? What are the most advanced parts or the earliest parts of that to be delivered? This is a vitally important piece of infrastructure. There are very real threats in our seas. How we address those when we know about them is a different and an important debate but first, we need to know. We need to have the picture but we do not currently have that. So, it is vitally important. Can the Minister give us a sense, from a personnel point of view, whether additional specialist personnel are required? \n Deputy Simon Harris  The information available to me is that the existing personnel's training needs will be the priority. Training needs will be determined and delivered as part of the delivery of the programme and will encompass equipment level training, including maintenance, as well operational and tactical level training. Training and upskilling our current personnel as opposed to additional specialist personnel is the information available to me. On sequencing, obviously I want to be transparent and helpful but also respect, as we all do, the security-sensitive deliberations in relation to the rollout of any programme being rolled out to increase our own national security. Planning and preparations for our Presidency of the European Union are well under way and the phased early delivery of elements of the military radar programme in 2026 may form part of these preparations. A key focus, and a key early focus of the programme, should be our counter unmanned aerial system capability. We have a structure in place to keep the Oireachtas committee up to date and we will do that in a sensitive and appropriate way. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 388. Deputy Seán Crowe asked the Minister for Transport the total service volume of each driving test centre, in tabular form. [59267/25] ",
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_388",
        "questionNumber": 388,
        "answerText": " Minister of State at the Department of Transport  Under the Road Safety Authority Act 2006, the Road Safety Authority (RSA) has statutory responsibility for the National Driver Testing Service. Neither I nor my officials are involved in the service at an operational level. Given the RSA's responsibility in this matter, I have referred the Deputy's question to the RSA for direct response. Please contact my office if a reply is not received within ten days.  The Deputy may wish to note that the RSA publish detailed monthly information on the driver testing service on the CSO website, including the breakdown of waiting times and distribution of testing capacity by test centre. This information is available at the following link: data.cso.ie/product/RSADTS. ",
        "debateSection": {
          "showAs": "Driver Test",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_360",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_360.xml"
            }
          },
          "debateSectionId": "dbsect_360"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 389. Deputy Seán Crowe asked the Minister for Transport the date by which the new driving test centre in South Dublin will be open; the centres specific location; and the number of permanent testers that will be based in the centre. [59268/25] ",
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_389",
        "questionNumber": 389,
        "answerText": " Minister of State at the Department of Transport  Under the Road Safety Authority Act 2006, the Road Safety Authority (RSA) has statutory responsibility for the National Driver Testing Service, including the provision of test centres. Neither I nor my officials are involved in the service at an operational level. Given the RSA's responsibility in this matter, I have referred the Deputy's question to the RSA for direct response. Please contact my office if a reply is not received within ten days.  Pending this more detailed response, I am informed by the RSA that a new test centre in Sandyford is in the final stages of preparation for opening. While the site is not yet operational, the assigned testers are already deployed to nearby centres in readiness for its opening ensuring testing volumes continue to be managed effectively. ",
        "debateSection": {
          "showAs": "Driver Test",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_361",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_361.xml"
            }
          },
          "debateSectionId": "dbsect_361"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Children",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1545. Deputy Seán Crowe asked the Minister for Children, Disability and Equality the timeframe mandated for responding to child protection notices; the number of child protection notices received in the first six months of 2025; and the number of those child protection notices responded to within the mandated timeframe. [59269/25] ",
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1545",
        "questionNumber": 1545,
        "answerText": " Minister for Children, Disability and Equality  Statutory and operational responsibility for the delivery of child protection and welfare services is a matter for Tusla, the Child and Family Agency. The Deputy is seeking information in relation to an operational matter for Tusla. Consequently, I have referred the matter to Tusla, and requested that a direct response be provided to the Deputy. ",
        "debateSection": {
          "showAs": "Child Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1325",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1325.xml"
            }
          },
          "debateSectionId": "dbsect_1325"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 2014. Deputy Seán Crowe asked the Minister for Health if there are plans to introduce a free shingles vaccination programme for older people given that many have difficulty with affordability; and if she will make a statement on the matter. [59658/25] ",
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_2014",
        "questionNumber": 2014,
        "answerText": " Minister for Health  The immunisation programme in Ireland is based on the advice of the National Immunisation Advisory Committee (NIAC). NIAC considers the prevalence of the relevant disease in Ireland as well as international best practice in relation to immunisation when developing its advice.  The current NIAC guidelines state that the shingles vaccine may be considered in those aged 65 years and older, due to the greater burden and severity of disease in this age group and in those aged 18 years and older at increased risk of shingles.  Shingles vaccination is not currently provided as part of the national immunisation programme.  The Health Information and Quality Authority (HIQA) has carried out a Health Technology Assessment (HTA) on the herpes zoster vaccine which protects against shingles. A HTA is a multidisciplinary research process that collects and summarises information about a health technology. The information can cover a range of fields, including clinical effectiveness and safety, cost-effectiveness and budget impact, organisational and social aspects, and ethical and legal issues. The information is collected and presented in a systematic, unbiased and transparent manner.  HIQA’s HTA examined the evidence on the clinical effectiveness and safety of shingles vaccines. The cost effectiveness and budget impact were also reviewed, along with the ethical, social and organisational implications of including the vaccine in the adult immunisation schedule.  HIQA published this HTA on 19 July 2024. The HTA found that adding the shingles vaccine to the routine immunisation schedule, at the vaccine price at the time, for all adults aged 65 years and over would not be cost effective and would be associated with a substantial budget impact.  Whilst the HTA found that the introduction of the shingles vaccine was not cost effective based on the cost of the vaccine, it found that it could be cost effective for vaccination of those at 75 years and 80 years if the cost of the vaccine was reduced by 80%.  Given that the healthcare budget is finite and decisions regarding increased spending relating to a change in one area could impact the provision of other health technologies and treatments within the healthcare system, the cost-effectiveness must be considered in any decision-making process.  My Department considered the findings of this HTA and determined that the introduction of the vaccine could be reconsidered when the cost effectiveness of the vaccine is confirmed as being more favourable. ",
        "debateSection": {
          "showAs": "Vaccination Programme",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1745",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1745.xml"
            }
          },
          "debateSectionId": "dbsect_1745"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 2084. Deputy Seán Crowe asked the Minister for Health if officials from her Department have been in contact with the Medical Council over the apparent bottleneck in the Pres 3 testing system; if there is any assistance that her Department can provide to the Medical Council to allow them to clear the backlog; and if she will make a statement on the matter. [60132/25] ",
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_2084",
        "questionNumber": 2084,
        "answerText": " Minister for Health  The PRES level 3 exams are facilitated and co-ordinated by the medical schools in Ireland on behalf of the Medical Council. The number of available places depends on the capacity and availability of the medical schools who run the exams.  While I understand that the Medical Council has added two additional PRES 3 sessions in 2025, I am aware that not all applicants have been offered a place. I have asked the Medical Council to revert to me with proposals to increase capacity and address the rising demand. I understand that the Council is actively exploring different avenues and options in this regard. Officials in my Department will continue to engage with the Council to progress this matter. ",
        "debateSection": {
          "showAs": "Health Services Waiting Lists",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1804",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1804.xml"
            }
          },
          "debateSectionId": "dbsect_1804"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Foreign Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_73.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_73",
          "debateSectionId": "dbsect_73"
        },
        "to": {
          "showAs": "Foreign",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  I have been closely following the situation in Serbia over the past year, after the horrific collapse of a train station canopy in Novi Sad on 1 November 2024. Freedom of assembly is a fundamental right and core value of our Union that must be respected. It must be exercised peacefully and in accordance with the law.  Ireland is a strong supporter of merit-based EU enlargement and believes that candidate and potential candidate countries must implement all necessary reforms, including adherence to the rule of law and EU fundamental values, to progress towards EU membership.  As outlined in the most recent Enlargement Package, notwithstanding Serbia progressing towards EU acquis in a range of areas, including economic integration with the EU, the Commission confirmed that civil society operates in a difficult environment and that Serbia needs to progress previous recommendations in relation to freedom of expression.  President Von der Leyen used her recent visit to Serbia to call for the implementation of necessary reforms, including on the rule of law, the electoral framework and media freedom. She stated categorically in her joint press conference with President Vucic that freedom of expression and assembly were fundamental values of the EU, and that adherence to these tenets are expected of all candidate countries. President Von der Leyen’s visit also included meetings with members of civil society in Serbia. The visit was also a timely reminder for Serbian citizens of the opportunities and benefits that can be offered by EU membership.  In September 2025, Ireland opened a resident Embassy in Belgrade. Ahead of Ireland’s EU Presidency next year, the Embassy will engage with the Serbian government and with Serbian civil society to support necessary reforms required for Serbia to progress on their EU path. Ireland will continue to encourage Serbia to implement the necessary reforms needed to align with EU acquis. ",
        "questionType": "written",
        "showAs": " 107. Deputy Seán Crowe asked the Tánaiste and Minister for Foreign Affairs and Trade if his attention has been drawn to the protests, often marred by police violence, that have been ongoing across Serbia for the past 11 months; his views on whether the European Commission President Ursula von der Leyen’s visit to Serbia could be seen as a statement of support for President Aleksandar Vučić amidst allegations of corruption; and if he will make a statement on the matter. [57023/25] ",
        "questionNumber": 107,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Seán Crowe",
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_107"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Middle East",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_72.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_72",
          "debateSectionId": "dbsect_72"
        },
        "to": {
          "showAs": "Foreign",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Foreign Affairs and Trade (Deputy Simon Harris)  In June, the Government approved the General Scheme of the Israeli Settlements in the Occupied Palestinian Territory (Prohibition of Importation of Goods) Bill. The main purpose of the Bill is to prohibit the importation of goods into the State from Israeli settlements in the occupied Palestinian territory, including East Jerusalem. The Joint Committee on Foreign Affairs and Trade has now published its report on the Bill. Work to analyse the report and its recommendations is well underway. The next steps in the process, including the timeline for the progress of the Bill, are currently being considered.  Regarding the wider issue of EU trade with Israel in the context of the EU-Israel Association Agreement, the European Commission put forward proposals in September which included the suspension of the trade elements of that Agreement. Notwithstanding the positive and welcome recent developments with regard to a ceasefire and hostage release deal in Gaza, Ireland has made clear its view that the EU must keep the package of measures proposed by the Commission in response to Israeli human rights and other breaches on the table. In her State of the Union address, the President of the European Commission was clear on the rationale for tabling the package of proposals, which remains valid.  At the Foreign Affairs Council, I welcomed the ceasefire and release of hostages and called for the EU to support efforts to flood Gaza with urgently needed humanitarian aid. Preserving the ceasefire and ensuring humanitarian access at scale is a priority. I also recalled the unacceptable nature of what has been happening in the West Bank and stressed the importance of ensuring that the concept of a two-State solution resulting in a viable, contiguous Palestinian State in the West Bank, Gaza and East Jerusalem, remains front and centre in the EU's approach, and that all future phases of the current agreement are conducive to its implementation. ",
        "questionType": "written",
        "showAs": " 108. Deputy Seán Crowe asked the Tánaiste and Minister for Foreign Affairs and Trade the date by which the Israeli Settlements in the Occupied Palestinian Territory (Prohibition of Importation of Goods) Bill 2025 will be introduced in Dáil Éireann; his views on whether there should be no delay in its progression amidst the lull in the conflict; his views on the fact that illegal settlements in the West Bank and East Jerusalem have only grown in number over the past two years; and if he will make a statement on the matter. [57022/25] ",
        "questionNumber": 108,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Seán Crowe",
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_108"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Housing Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_386.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_386",
          "debateSectionId": "dbsect_386"
        },
        "to": {
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Housing, Local Government and Heritage  Applications for social housing support are assessed by the relevant local authority, in accordance with the eligibility and need criteria set down in section 20 of the Housing (Miscellaneous Provisions) Act 2009 and the associated Social Housing Assessment Regulations 2011, as amended.  The requirements in relation to the documentation required to support an application is set out in the “Checklist for Applicants” on the prescribed social housing application form. This checklist sets out the documentary evidence required for proof of current address, which includes, utility bill, lease or rental statement, where applicable.  As specified on the application form, in cases where a particular document cannot be provided, the local authority may, at its discretion, request alternative documentation to satisfy itself in relation to the specific information being sought.  Ultimately, it is a matter for the local authority to determine what information is required in individual cases. My Department would expect that any information sought by a local authority in this regard would be appropriate, having regard to the circumstances of the household concerned.  Decisions on the qualification of households for social housing support, the most appropriate form of such support, and the allocation of that support are a matter solely for the local authority concerned. ",
        "questionType": "written",
        "showAs": " 469. Deputy Seán Crowe asked the Minister for Housing, Local Government and Heritage if he is aware that local authorities are stalling applications to the social housing list by homeless individuals if they cannot provide a utility bill in their name or a sworn affidavit by people who are allowing them to couch surf, though this might include tenants in social housing who may be reluctant to provide such an affidavit for fear of being found in breach of their own tenancy agreement; if he agrees that these are bureaucratic barriers unsuitable for homeless individuals; if a new, more suitable set of application criteria can be formulated; and if he will make a statement on the matter. [56822/25] ",
        "questionNumber": 469,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Seán Crowe",
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_469"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Health Strategies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_714.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_714",
          "debateSectionId": "dbsect_714"
        },
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "questionType": "written",
        "showAs": " 867. Deputy Seán Crowe asked the Minister for Health if she intends to fully fund the 2024–30 collaborative tuberculosis strategy for Ireland. [54966/25] ",
        "questionNumber": 867,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Seán Crowe",
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_867"
      }
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06"
        },
        "showAs": " 390. Deputy Seán Crowe asked the Minister for Justice, Home Affairs and Migration the date by which he will appoint the members of the new South Dublin Local Community Safety Partnership so they may meet and begin their work. [52941/25] ",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_369.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_369",
          "showAs": "Local Community Safety Partnerships",
          "debateSectionId": "dbsect_369"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_390",
        "answerText": " Minister for Justice, Home Affairs and Migration  The Policing, Security and Community Safety Act 2024, which I commenced on Wednesday 2 April 2025, provides for the establishment of Local Community Safety Partnerships (LCSP) within each local authority area.  The regulations for these Safety Partnerships came into operation on Monday 30 June. 36 Partnerships are in the process of being established in local authority areas across the country.  Members have now been appointed to 8 Local Community Safety Partnerships. Further members will be appointed in October and November with a view to establishing all Safety Partnerships by the end of the year.  The first meeting of a Local Community Safety Partnership took place in Wexford on 30 September when members elected their own chair and vice chair. It is anticipated that other partnerships will host their first meetings in the coming weeks.  LCSPs represent a significant step towards a more collaborative, responsive, and locally driven model of public safety and will play a major role in enhancing public safety alongside An Garda Síochána, residents, businesses and state agencies. ",
        "questionNumber": 390
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06"
        },
        "showAs": " 549. Deputy Seán Crowe asked the Minister for Health the date by which it is expected to publish the complaints and patient safety policy. [52940/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_507.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_507",
          "showAs": "Patient Safety",
          "debateSectionId": "dbsect_507"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_549",
        "answerText": " Minister for Health  The Department of Health has been engaged in the development of policy in relation to the areas of Patient Safety, Complaints and Advocacy.  A national patient complaints and patient safety incidents policy covering both public and private health services is in development through a number of work streams. A comprehensive stakeholder engagement process has been ongoing to gather information from health and social care services, advocacy groups, regulators as the department continues to collaborate closely with all relevant stakeholders.  The Department commissioned several independent research projects regarding clinical complaints and patient safety incidents, including looking at international comparisons. The latest completed evidence project is a stakeholder consultation on clinical complaints policy in Ireland by the RCSI. The Department is currently analysing all work previously undertaken.  While this policy work is being fully considered and progressed, it is not currently possible to provide an expected date of completion. ",
        "questionNumber": 549
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06"
        },
        "showAs": " 601. Deputy Seán Crowe asked the Minister for Health if her Department is concerned regarding the rise in tuberculosis cases in the State, particularly drug-resistant strains; if she will commit to public funding of the National TB Centre and Clinical Team at St James’s Hospital and allocating resources to the Irish Mycobacterial Reference Laboratory at St James’s Hospital, given that Ireland is not meeting WHO minimum diagnostic standards; to appoint a public health TB lead who will bring Ireland in line with international best practices and obligations; and if she will make a statement on the matter. [53138/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_555.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_555",
          "showAs": "Disease Management",
          "debateSectionId": "dbsect_555"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_601",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "questionNumber": 601
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The key factor for determining the level of staffing resources provided at individual school level is the staffing schedule for the relevant school year and pupil enrolments on the previous 30 September. The school referred to by the Deputy had its staffing reduced by one teacher in the current school year due to a drop in enrolments, whereby the school had 23 less pupils than the previous year.  Under the Programme for Government there is a commitment to aim to reduce the general pupil teacher ratio at primary level to 19:1 over the term of government and introduce targeted measures in schools with very large classes.  This will build on the progress which has been made by the previous Government. The general average of pupils to teachers in the Primary Staffing Schedule improved from 26 : 1 five years ago to 23 : 1 for the current school year, the lowest ever ratio at primary level. More favourable ratios are implemented for DEIS Urban Band 1 schools. Average class sizes in primary schools have improved from 24.1 to 22.2 through the investment we are making in schools.  I am considering how best to make further progress as part of the annual budgetary process in reducing the primary pupil teacher ratio in the context of Programme for Government implementation. ",
        "by": {
          "showAs": "Seán Crowe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06",
          "memberCode": "Seán-Crowe.D.2002-06-06"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "date": "2025-10-01",
        "questionNumber": 66,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-01/writtens/dbsect_89",
          "debateSectionId": "dbsect_89",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-01/writtens/mul@/dbsect_89.xml"
            }
          },
          "showAs": "Pupil-Teacher Ratio"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-01/pq_66",
        "showAs": " 66. Deputy Seán Crowe asked the Minister for Education and Youth to examine the case of a school (details supplied) who lost a teacher due to student numbers in 2024 and risk doing so again in 2026, if the current rules on student numbers to teacher places are applied; if she agrees that this runs contrary to government commitments to reduce the pupil teacher ratio and target large class sizes; her views that larger, multi-grade classrooms are not the most appropriate scenario for pupils; and if she will make a statement on the matter. [52277/25] "
      },
      "contextDate": "2025-10-01"
    },
    {
      "question": {
        "date": "2025-09-23",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06"
        },
        "showAs": " 527. Deputy Seán Crowe asked the Minister for Children, Disability and Equality the number of children waiting to access speech and language therapy in the CHO7 area, by CDNT, in tabular form; the number of those waiting more than one year; the number waiting more than four years; and the average waiting time to access those therapies.; and if she will make a statement on the matter. [49642/25] ",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/mul@/dbsect_483.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/dbsect_483",
          "showAs": "Health Services Waiting Lists",
          "debateSectionId": "dbsect_483"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-23/pq_527",
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 527
      },
      "contextDate": "2025-09-23"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06"
        },
        "showAs": " 1277. Deputy Seán Crowe asked the Minister for Health the reason that a medication (details supplied) for the treatment of diabetes insipidus has been removed from the long-term illness scheme; and her views on whether beneficiaries of the scheme should be informed of changes to approved medication rather than discovering this when renewing prescriptions. [48600/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_1086.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_1086",
          "showAs": "Medicinal Products",
          "debateSectionId": "dbsect_1086"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_1277",
        "answerText": " Minister for Health  Under the Health (Pricing and Supply of Medical Goods) Act 2013, the HSE has statutory responsibility for decisions on the pricing and reimbursement of medicines and medical devices; therefore, the matter has been referred to the HSE for attention and direct reply to the Deputy. ",
        "questionNumber": 1277
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1144. Deputy Seán Crowe asked the Minister for Housing, Local Government and Heritage further to Parliamentary Question No. 1482 of 29 July 2025, if he will clarify the reason for approval of Uisce Éireann’s Water Services Strategic Plan 2050 (WSSP 2050) on 1 August 2025 in view of the fact that his Department had no role in approving the body’s Strategic Funding Plan 2025-2029. [45109/25] ",
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_1144",
        "questionNumber": 1144,
        "answerText": " Minister for Housing, Local Government and Heritage  The Water Services Strategic Plan 2050 (WSSP 2050) is a long-term strategic plan that Uisce Éireann is required to prepare and submit to me as Minister under Section 33(1) of the Water Services (No.2) Act 2013 (the Act). I approved this plan on 1st August 2025.  Section 33(6) of the Act provides for the incumbent Minister to approve the Water Services Strategic Plan. In line with section 34A of the Water Services (No.2) Act 2013 (as inserted by section 19 of the Water Services Act 2017), the Uisce Éireann Strategic Funding Plan was approved by the previous Minister on 5th November 2024.   ",
        "debateSection": {
          "showAs": "Water Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_980",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_980.xml"
            }
          },
          "debateSectionId": "dbsect_980"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06"
        },
        "showAs": " 62. Deputy Seán Crowe asked the Tánaiste and Minister for Foreign Affairs and Trade the average waiting time for processing individuals on the foreign births register; and the number of cases currently being processed. [41829/25] ",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_50.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_50",
          "showAs": "Foreign Birth Registration",
          "debateSectionId": "dbsect_50"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_62",
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  My Department is responsible for processing Foreign Birth Registration (FBR) applications for people who are born abroad and claim Irish citizenship through a grandparent born in Ireland or through a parent who has claimed citizenship also through FBR or Naturalisation.  FBR, by its nature, is a detailed and complex process, often involving official documentation relating to three generations and issued by several jurisdictions. Such documents take considerable time to validate. FBR applications are currently being processed within the normal turnaround time of approximately 9 months from receipt of all required supporting documents. Applications that require further supporting documents will take longer to process.  There are 54,900 FBR applications currently in the system. The number of applications with the Passport Service (PPS) for processing is 46,400, and the number of applications currently with the applicant (i.e. the PPS is awaiting documentation) is 8,500.  The Passport Service Customer Service Hub has dedicated agents to deal with Foreign Birth Registration application queries. The contact number for urgent Foreign Birth Registration queries is +353 1 568 3331. ",
        "questionNumber": 62
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06"
        },
        "showAs": " 189. Deputy Seán Crowe asked the Minister for Climate, Energy and the Environment the current average waiting time for the home surveys that are required to access Sustainable Energy Authority of Ireland free energy upgrades. [41824/25] ",
        "to": {
          "roleType": null,
          "showAs": "Climate",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_151.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_151",
          "showAs": "Renewable Energy Generation",
          "debateSectionId": "dbsect_151"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_189",
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 187, 189, 191, 192, 193, 194, 195 and 197 together.  The Warmer Homes Scheme aims to improve the energy efficiency and warmth of homes owned by people at risk of energy poverty by providing fully funded retrofits. The scheme is operated by the Sustainable Energy Authority of Ireland (SEAI) on behalf of my Department and is funded through carbon tax receipts and the European Regional Development Fund.  Last year saw a record spend of almost €230 million under the scheme. As reported by the SEAI, this resulted in 7,743 upgrades being provided to low-income households. This year’s budget includes an allocation of €280 million for the Warmer Homes Scheme.  The information sought is an operational matter for the SEAI, an agency under the aegis of my Department. It is suggested that the Deputy contact the SEAI directly in relation to this matter. The SEAI has established a specific email address for queries from Oireachtas members so that such queries can be addressed promptly and in line with the SEAI’s objective to deliver services to the highest standards. The email address is oireachtas@seai.ie. ",
        "questionNumber": 189
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06"
        },
        "showAs": " 190. Deputy Seán Crowe asked the Minister for Climate, Energy and the Environment the amount in unclaimed deposits from the re-turn scheme in its first 12 months of operation; and the way in which this fund was dispersed. [41825/25] ",
        "to": {
          "roleType": null,
          "showAs": "Climate",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_134.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_134",
          "showAs": "Recycling Policy",
          "debateSectionId": "dbsect_134"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_190",
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  I propose to take Questions Nos. 166, 190 and 261 together.  The Deposit Return Scheme (DRS) has been introduced to encourage more people to recycle plastic bottles and cans and to deliver on our ambitious EU targets for the recycling of those products.  Re-turn always encourages consumers to redeem their deposits, and it is important that the public is aware that Re-turn retains an open-ended liability to refund deposits to consumers, regardless of when or where the product was purchased.  Re-turn published its 2024 annual report on 25 July 2025 and a link to the report can be found here: https://re-turn.ie/re-turn-2024-annual-report/. In the annual report, Re-turn outlines the income received from unredeemed deposits in 2024. Confirmed figures for 2025 are not yet available from the scheme however as the return rate improves, unredeemed deposits are reducing in parallel.  As with other DRS schemes, unredeemed deposits are retained by the operator (Re-turn) and are reinvested exclusively for the development of the Scheme. As a not-for-profit organisation, Re-turn will invest the funds in a range of measures to promote and improve collection rates including:  • Improving Reverse Vending Machine coverage and optimising convenience for consumers  • Enhancing accessibility to maximise the scheme for all users  • Introducing larger, bulk-fed machines enabling quicker, higher volume returns  • Communications and awareness, supporting the consumer’s understanding of DRS and the benefits of a separate collection for these materials  • Recycling infrastructure development  The Department works closely with Re-turn to ensure the scheme explores all options to meet those targets and to support Ireland's transition to a circular economy. ",
        "questionNumber": 190
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06"
        },
        "showAs": " 428. Deputy Seán Crowe asked the Minister for Transport the current total service volume of each driving test centre, in tabular form. [41740/25] ",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_338.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_338",
          "showAs": "Driver Test",
          "debateSectionId": "dbsect_338"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_428",
        "answerText": " Minister of State at the Department of Transport  Under the Road Safety Authority Act 2006, the Road Safety Authority (RSA) has statutory responsibility for the National Driver Testing Service. As such, the information requested is held by the RSA.  Given the RSA's responsibility in this matter, I have referred the Deputy's question to the RSA for direct response. Please contact my office if a reply is not received within ten days. ",
        "questionNumber": 428
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06"
        },
        "showAs": " 432. Deputy Seán Crowe asked the Minister for Transport the status of the proposed new driving test centre in south Dublin; if a site has been identified; and the date it is envisaged the new centre will open. [41823/25] ",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_342.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_342",
          "showAs": "Driver Test",
          "debateSectionId": "dbsect_342"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_432",
        "answerText": " Minister of State at the Department of Transport  Under the Road Safety Authority Act 2006, the Road Safety Authority (RSA) has statutory responsibility for the National Driver Testing Service. This includes the provision of test centres, though I understand that a site had been identified and that the RSA aims for it to be open and operational during September.  Given the RSA's responsibility in this matter, I have referred the Deputy's question to the RSA for direct, detailed response. Please contact my office if a reply is not received within ten days. ",
        "questionNumber": 432
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06"
        },
        "showAs": " 585. Deputy Seán Crowe asked the Minister for Transport the status of the Metro west plan; whether it remains under consideration; and if he will make a statement on the matter. [43786/25] ",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_488.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_488",
          "showAs": "Rail Network",
          "debateSectionId": "dbsect_488"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_585",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has statutory responsibility for the planning and development of public transport infrastructure in the Greater Dublin Area.  The Deputy will be aware that the Transport Strategy for the Greater Dublin Area 2022-2042  is the statutory transport strategy for the region and sets out a range of ambitious proposals for delivery over the period to 2042. In relation to metro, and as outlined in the strategy, the analysis conducted concluded that a metro line from Swords to Dublin City Centre via Dublin Airport would be the key area of focus for metro delivery out to 2042.  The NTA reviews and updates the Transport Strategy for the Greater Dublin Area every six years and so the issue of a western line extension of MetroLink may be reconsidered in future.  Noting the NTA’s responsibility in the matter, I have referred the Deputy's question to the NTA for a direct reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "questionNumber": 585
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06"
        },
        "showAs": " 1237. Deputy Seán Crowe asked the Minister for Education and Youth the number of ASD places that will be available in schools, both primary and post-primary, in the Dublin south-west area for the 2025-2026 academic year; and the number of these that are new places. [43700/25] ",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_1050.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_1050",
          "showAs": "Special Educational Needs",
          "debateSectionId": "dbsect_1050"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_1237",
        "answerText": " Minister of State at the Department of Education and Youth  I propose to take Questions Nos. 1237 and 1238 together.  This government is fully committed to supporting children with special educational needs to fulfil their full potential and the Programme for Government makes a number of commitments to deliver on this objective.  The National Council for Special Education (NCSE) is the national agency with responsibility for the provision of special education places. This year the NCSE has sanctioned 407 new special classes for the coming school year bringing to 3,742 the number of special classes in our schools. The NCSE has published a list of these classes, which is broken down by county, on their website .  Of the 407 new special classes 103 are in County Dublin, 81 at primary and 22 at post primary level. This brings to 705 the number of special classes currently in operation in the county. The vast majority of these classes are autism classes.  There are also 40 special schools in Dublin with approximately 2,600 students enrolled. Two of the five new special schools for the 2025/26 school year will open in Lucan and Belmayne also.  With the number of special classes doubling in the last five years, this now means that there are more classes than ever ensuring greater numbers of children can access places in their local school.  Furthermore the number of special class places in our schools will exceed demand. Combined with 300 new special school places this brings to 2,700 the number of new school places for children with special educational needs.  This year, the approach taken was to maximise the use of existing accommodation in schools to ensure new special classes could open as quickly as possible for the 2025/26 school year. The NCSE also prioritised schools which did not have an existing special class. ?This has ensured that 80% of the new classes sanctioned are in schools with available accommodation.  Where schools require modular accommodation for new special classes, these projects are being fast-tracked by my department  to deliver this accommodation as early as possible. In a small number of instances where a delay in new special class accommodation is expected such as where new modular classrooms are being provided, contingency arrangements are being made with the relevant schools with the support of the NCSE.  The NCSE has advised my department that the vast majority of children seeking a special school or special class place have now been assigned a school place. They are working very closely with the remaining families to ensure that they are being kept updated as the remaining special class and special school places are being finalised by a small number of schools.  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "questionNumber": 1237
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Seán-Crowe.D.2002-06-06",
          "showAs": "Seán Crowe",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Crowe.D.2002-06-06"
        },
        "showAs": " 1238. Deputy Seán Crowe asked the Minister for Education and Youth the number of SEN places that will be available in schools, both primary and post-primary, in the Dublin south-west area for the 2025-2026 academic year; and the number of these that are new places. [43701/25] ",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_1050.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_1050",
          "showAs": "Special Educational Needs",
          "debateSectionId": "dbsect_1050"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_1238",
        "answerText": " Minister of State at the Department of Education and Youth  I propose to take Questions Nos. 1237 and 1238 together.  This government is fully committed to supporting children with special educational needs to fulfil their full potential and the Programme for Government makes a number of commitments to deliver on this objective.  The National Council for Special Education (NCSE) is the national agency with responsibility for the provision of special education places. This year the NCSE has sanctioned 407 new special classes for the coming school year bringing to 3,742 the number of special classes in our schools. The NCSE has published a list of these classes, which is broken down by county, on their website .  Of the 407 new special classes 103 are in County Dublin, 81 at primary and 22 at post primary level. This brings to 705 the number of special classes currently in operation in the county. The vast majority of these classes are autism classes.  There are also 40 special schools in Dublin with approximately 2,600 students enrolled. Two of the five new special schools for the 2025/26 school year will open in Lucan and Belmayne also.  With the number of special classes doubling in the last five years, this now means that there are more classes than ever ensuring greater numbers of children can access places in their local school.  Furthermore the number of special class places in our schools will exceed demand. Combined with 300 new special school places this brings to 2,700 the number of new school places for children with special educational needs.  This year, the approach taken was to maximise the use of existing accommodation in schools to ensure new special classes could open as quickly as possible for the 2025/26 school year. The NCSE also prioritised schools which did not have an existing special class. ?This has ensured that 80% of the new classes sanctioned are in schools with available accommodation.  Where schools require modular accommodation for new special classes, these projects are being fast-tracked by my department  to deliver this accommodation as early as possible. In a small number of instances where a delay in new special class accommodation is expected such as where new modular classrooms are being provided, contingency arrangements are being made with the relevant schools with the support of the NCSE.  The NCSE has advised my department that the vast majority of children seeking a special school or special class place have now been assigned a school place. They are working very closely with the remaining families to ensure that they are being kept updated as the remaining special class and special school places are being finalised by a small number of schools.  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "questionNumber": 1238
      },
      "contextDate": "2025-07-29"
    }
  ]
}