{
  "head": {
    "counts": {
      "questionCount": 4869,
      "resultCount": 4869
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Deputy Mattie McGrath  My question is about the wind-up of NAMA, which will happen in the next ten days. Who will assume responsibility for ongoing issues, irregularities and other issues, such as court proceedings when NAMA has been wound up? It will happen by 31 December. That is only ten days away. Will the Tánaiste make a statement on the matter? \n Deputy Simon Harris  As the Deputy noted, NAMA is on track to substantively conclude its operational wind-down by the end of this year. NAMA completed its final surplus payment of €450 million to the Exchequer as recently as yesterday, 17 December 2025. In total, NAMA has now contributed €5.6 billion to the State. This contribution has included cash transfers, corporation tax payments as well as significant assets transferred to the Land Development Agency, LDA, earlier this year, comprising social housing and strategic lands with the potential to deliver up to 4,500 homes.  The conclusion of IBRC special liquidation and dissolution of NAMA Bill, when enacted, will finalise the phased and orderly wind-down of the agency. Priority drafting of the Bill was approved on 2 July 2024 and is currently at an advanced stage.  The experience of other workout vehicles internationally has shown that some residual activity, including litigation, would remain after NAMA's core work had concluded. The need to ensure that such residual activity is properly managed has been a priority of the Government and officials throughout the drafting of the Bill. Therefore the Bill will provide for a new unit to be established within the NTMA following NAMA's dissolution, to manage any remaining residual activity, including litigation, until ultimate completion.  This resolution unit will report to NTMA senior management and will operate within the agency's governance framework. The vesting of this residual activity in the NTMA will ensure that any active proceedings to which NAMA was a party before its dissolution will continue to be managed effectively.  As the Deputy will be aware, by virtue of sections 99 and 202 of the NAMA Act 2009, NAMA is legally precluded from disclosing confidential debtor information, including specific details relating to debtors, secured assets or related transactions. I remind the Deputy that NAMA was established as an independent commercial body and I have no role in its operations or decisions.  In relation to the matters raised by the Deputy, I am informed by NAMA that it is satisfied it has at all times acted appropriately and in accordance with its statutory remit. \n Deputy Mattie McGrath  I am worried that when there is alleged fraud taking place with the handling of money who will be responsible for the ongoing investigations into that fraud and irregularities and current cases; including two matters I have raised previously in this House, namely, the ongoing NAMA investigation into circumstances relating to Nemo Rangers lands in Cork, and the unlawful use by NAMA of the personal tax number of Mr. John Fraher, a businessman in Clonmel? He had gone out of business, was living in England and his tax number was used for a number of years, with the knowledge of NAMA and by people involved in NAMA. It was an abject crime.  What becomes of the cases when NAMA ceases operations? Who will take responsibility for these investigations? Who will be held to account for any irregularities or wrongdoing? Will the Minister make a statement on that? He said he is not responsible but somebody has to be accountable for what went on here. It was an awful vista. We had Project Eagle in Belfast and Project Jackdaw in Clonmel, on the Clonmel Arms site. We have the cases of Mr. John Fraher and Nolan Transport and other ongoing cases in Wexford and issues there as well. \n An Cathaoirleach Gníomhach (Deputy Jen Cummins)  There will be a supplementary question from Deputy Neville. \n Deputy Joe Neville  NAMA has been one of those interesting bodies in my lifetime. It came in during a significant economic crash and was seen almost a set-up of last resort. I wondered about the impact it would have. As we look back now we can see it has had a positive legacy. It has turned out positively for the Government, notwithstanding what has happened over the past few years and that is worth reflecting on. How do we take the learnings, and not just from NAMA itself? If something like this happens again, how do we ensure the knowledge we built up and the success, ultimately, of NAMA is replicated? It was one of the great benefits of the last 15 years considering the crash we had, to be able to put together a body like NAMA. The Opposition probably ultimately considered it would have been the worst thing in the world but it has worked out successfully. So much money has been repaid to the Exchequer, even though we took such a risk. How do we take the learnings from that and how does the Tánaiste see we will be able to put that in place for future generations? \n Deputy Simon Harris  I thank Deputy McGrath for his follow-up question. It is not a question of responsibility. I am precluded, as is NAMA, under sections 99 and 202 of the NAMA Act from disclosing confidential debtor information. Indeed, NAMA is legally precluded from disclosing that information, including specific details relating to debtors, secured assets or related transactions. The agency remains an independent commercial body. These queries the Deputy raised have been raised with NAMA and it has informed me it is satisfied it has at all times acted appropriately and in accordance with its statutory remit. If the Deputy has any further information to the contrary or concerns, I encourage him to make them available to NAMA or any other agency he feels is appropriate.  Deputy Neville asked an interesting question about learnings. One hopes we will never find ourselves as a country in this position ever again and that is why we have to continue to budget in such a manner. NAMA's lifetime contribution to the Exchequer has been €5.6 billion and that includes cash, corporation tax and significant assets. \n An Cathaoirleach Gníomhach (Deputy Jen Cummins)  Thank you, Tánaiste. \n Deputy Simon Harris  I will come back on the rest in a moment. \n Deputy Mattie McGrath  There are serious concerns about fraud in recent High Court proceedings about unusual ownership structures such as a case involving two identically named companies, Dildar Limited, one of which is registered offshore, which may indicate attempts to circumvent liabilities to NAMA, and the Tánaiste is saying that he does not have responsibility. \n Deputy Simon Harris  I never said \"responsibility\". \n Deputy Mattie McGrath  Somebody has to have responsibility when NAMA is wound up. We cannot just fold it up and put it on a shelf and say, \"Great job done\". NAMA did some good work but there was obvious wrongdoing and fraud in the cases I mentioned including the Nemo Rangers lands in Cork and worse in Clomnel town with the Clonmel Arms Hotel, which I have raised here, and now the Clonmel Park Hotel and Mr. John Fraher. The Tánaiste said NAMA is satisfied it acted appropriately. How could it have acted appropriately when he went out of business, ceased trading in Ireland, went bankrupt, was trading in England and his tax number was continually used to put funds through here by other directors of the company, with the knowledge of NAMA? I have named these cases in the Dáil. \n An Cathaoirleach Gníomhach (Deputy Jen Cummins)  Deputy, your time is up. \n Deputy Mattie McGrath  The Tánaiste said that NAMA is satisfied. Well I am not satisfied and I will not stop at this. I have gone to the Garda. They do not seem to be interested either so it is a funny situation. \n Deputy Simon Harris  I say this respectfully and I do not want to be overly argumentative on the final day of the Dáil before Christmas, but it is unfair to say the Garda is not interested. The Garda in this country take very seriously any issues brought to its attention and if the Deputy has an issue with the Garda, there is a structure there. I just do not like those blanket statements, \"The Garda is not interested\" and \"NAMA is not interested\". It is a very serious thing to come to the floor of the Dáil, reference individual citizens of our State's tax details and numbers - I am not sure that is in order - and then basically accuse people of fraud, including State agencies. Everyone has an entitlement to his or her good name. There are very robust procedures in place. If the Deputy believes any illegality has been committed, he should go to An Garda Síochána. The Garda is always interested in all matters related to that. I am satisfied, as Minister for Finance, that based on the information the Deputy has provided to the Department of Finance and to NAMA, that NAMA has acted at all times appropriately and in accordance with its statutory remit. That is what I am telling the Deputy here on the floor of the Dáil. I have also said, and reiterate, that in regard to any residual activity, including court cases - the Deputy referenced cases and I do not know whether they are live or not - responsibility for that will transfer to the NTMA. Perhaps that is another route through which the Deputy can raise his query. \n Deputy Pearse Doherty  Can I raise a point of order? I would like clarification because I was not aware of this. Are we allowed to ask supplementary questions on priority questions? \n Deputy Richard Boyd Barrett  I was wondering about that. \n Deputy Pearse Doherty  It was provided for there in the last question. Priority questions are protected, as far as I know today, from other Members interfering in them. \n Deputy Simon Harris  We are not. \n An Cathaoirleach Gníomhach (Deputy Jen Cummins)  We are not. Please forgive me. It is my first time doing this. \n Deputy Pearse Doherty  That is okay. I was not sure if it had changed or not, genuinely. \n An Cathaoirleach Gníomhach (Deputy Jen Cummins)  Apologies for that. \n Deputy Mattie McGrath  The spirit of Christmas. \n An Cathaoirleach Gníomhach (Deputy Jen Cummins)  The spirit of Christmas and forgiveness. \n Deputy Pearse Doherty  Exactly. \n An Cathaoirleach Gníomhach (Deputy Jen Cummins)  Deputy Boland's supplementary question will be allowed. Not Deputy Neville's, that is enough. He has gotten me into trouble once already. We will move to Question No. 174 which will be grouped with Question No. 184. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 173. Deputy Mattie McGrath asked the Tánaiste and Minister for Finance given that the National Asset Management Agency, NAMA, is due to conclude its affairs and wind down operations by the end of 2025, to outline the arrangements in place to ensure that any unresolved investigations or litigation, particularly those involving significant public funds, are fully pursued; the person or body that will be responsible for ongoing investigations into alleged fraud or irregularities in current cases where matters are still arising, in particular two cases (details supplied); the person or body which will take responsibility for these investigations; if he will commit to a full and thorough investigation into both matters; and if he will make a statement on the matter. [71751/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_38",
          "debateSectionId": "dbsect_38",
          "showAs": "National Asset Management Agency",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_38.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_173",
        "questionNumber": 173
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  On 2 December, the Taoiseach announced an additional €125 million in financial support for Ukraine as part of a new roadmap for partnership with Ireland to cover the next five years.  The allocation is made up of a €100 million allocation towards the procurement of non-lethal military support and a €25 million allocation to support the restoration and protection of Ukrainian energy infrastructure and the provision of essential energy supplies.  These measures build on supports that Ireland has provided to Ukraine since the full-scale invasion by Russia in 2022.  In terms of providing military support, Ireland has engaged in procurement partnerships with EU Member States. Working with trusted partners that have relevant experience ensures good governance and value for money.  The allocation of €25 million to support the restoration and protection of Ukrainian energy infrastructure and the provision of essential energy supplies will be provided in a manner that meets the most urgent needs of Ukraine.  Within the Department of Foreign Affairs and Trade, the independent Evaluation and Audit Unit supports and protects the Department’s expenditure by providing objective assessment, assurance, advice, and insight regarding corporate performance, governance, risk management, and internal control, including through evaluation. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 257. Deputy Mattie McGrath asked the Minister for Foreign Affairs and Trade in light of the Government’s recent commitment of an additional €125 million in financial support to Ukraine, the accountability mechanisms in place to ensure Irish taxpayers’ money is used for its intended purpose; the way in which she will verify that funds provided by Ireland are properly monitored and safeguarded (details supplied); the oversight arrangements that exist at EU and national levels; if Ireland has any direct auditing or reporting requirements for these funds; and if she will make a statement on the matter. [71752/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_267",
          "debateSectionId": "dbsect_267",
          "showAs": "Ukraine War",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_267.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_257",
        "questionNumber": 257
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  As the Deputy will appreciate, management of the Courts is the responsibility of the Courts Service, which is independent in the exercising of its functions under the Courts Service Act 1998 and the Constitution.  However, to be of assistance, my officials have made enquiries regarding the matters raised. In respect of the number of prosecutions for breach of the in-camera rule in family courts, the Courts Service have advised my Department that their record management system does not capture this information in a manner that would allow for the details sought by the Deputy to be provided. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 668. Deputy Mattie McGrath asked the Minister for Justice, Home Affairs and Migration the number people that have been prosecuted for breach of the in-camera rule in family courts; and if he will make a statement on the matter. [71327/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_529",
          "debateSectionId": "dbsect_529",
          "showAs": "Courts Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_529.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_668",
        "questionNumber": 668
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 805. Deputy Mattie McGrath asked the Minister for Children, Disability and Equality if the behaviour support service currently being delivered through the Children’s Disability Network Teams (CDNTs) in Cashel and Clonmel will continue; if funding has been secured for this service in 2026; if funding has not been committed; the reasons for this decision; if she will urgently review the matter given the significant shortage of services already affecting CDNT teams in south Tipperary; and if she will make a statement on the matter. [71308/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_630",
          "debateSectionId": "dbsect_630",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_630.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_805",
        "questionNumber": 805
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I wish to advise the Deputy that by virtue of Sections 99 and 202 of the NAMA Act 2009, NAMA is legally precluded from disclosing confidential debtor information, including specific details relating to debtors, secured assets or related transactions. I wish to remind the Deputy that NAMA was established as an independent commercial body and the Minister for Finance has no role in its operations or decisions. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 295. Deputy Mattie McGrath asked the Tánaiste and Minister for Finance if he will open a full investigation into the serious matters of fraud within NAMA outlined in Dáil Éireann by this Deputy on 25 November 2025 (details supplied); if he will engage with NAMA on the matter; and if he will make a statement on the matter. [69463/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_273",
          "debateSectionId": "dbsect_273",
          "showAs": "National Asset Management Agency",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_273.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_295",
        "questionNumber": 295
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  I propose to take Questions Nos. 354, 355, 356 and 357 together.  Under Section 10 of the Broadcasting and Other Media Regulation Acts 2009 and 2022, Coimisiún na Meán is established as an independent regulator. This statutory independence ensures that decisions relating to enforcement, compliance, and operational matters are taken without Ministerial direction or influence. This separation of powers is essential to maintain the integrity of the regulatory framework and to uphold Ireland’s obligations under EU law.  Article 50 of Regulation (EU) 2022/2065 (the Digital Services Act) explicitly requires that national Digital Services Coordinators, such as Coimisiún na Meán, act with complete independence and remain free from any external influence when carrying out their tasks and exercising their powers. This provision reflects a core principle of EU law, that regulatory authorities must operate autonomously to guarantee impartiality, legal certainty, and the effective application of the Regulation across Member States.  The questions raised, covering the issuance of orders to service providers, cooperation with other authorities, actions on election-related content, and the designation of trusted flaggers, fall squarely within the operational remit of An Coimisiún. These functions involve regulatory judgment and enforcement under the Digital Services Act, which are matters for the independent regulator.  Under Article 55 of the Digital Services Act, Coimisiún na Meán is required to publish an annual activity report detailing its activities under the Regulation. This report is publicly available and those seeking further information on these operational matters may consult the most recent report at: www.cnam.ie/app/uploads/2025/04/20250319_Art-55-DSA-report_VFinal.pdf. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 354. Deputy Mattie McGrath asked the Minister for Enterprise, Tourism and Employment to set out, in respect of Coimisiún na Meán in its role as Digital Services Coordinator under Regulation (EU) 2022/2065 (the Digital Services Act), the total number of formal orders issued since 17 February 2024 to providers of intermediary services requiring the removal or disabling of access to specific content, and the downranking, limitation of visibility or other forms of algorithmic suppression of content; the Member State of establishment or other country of origin of each provider concerned; the legal basis and nature of the alleged infringement in each case; if, and on what date, each order was implemented in full or in part by the provider; and the number of such orders which were issued following a request from another Digital Services Coordinator or the European Commission, and have been communicated to other Digital Services Coordinators or the European Commission; and if he will make a statement on the matter. [69009/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_319",
          "debateSectionId": "dbsect_319",
          "showAs": "EU Regulations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_319.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_354",
        "questionNumber": 354
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  I propose to take Questions Nos. 354, 355, 356 and 357 together.  Under Section 10 of the Broadcasting and Other Media Regulation Acts 2009 and 2022, Coimisiún na Meán is established as an independent regulator. This statutory independence ensures that decisions relating to enforcement, compliance, and operational matters are taken without Ministerial direction or influence. This separation of powers is essential to maintain the integrity of the regulatory framework and to uphold Ireland’s obligations under EU law.  Article 50 of Regulation (EU) 2022/2065 (the Digital Services Act) explicitly requires that national Digital Services Coordinators, such as Coimisiún na Meán, act with complete independence and remain free from any external influence when carrying out their tasks and exercising their powers. This provision reflects a core principle of EU law, that regulatory authorities must operate autonomously to guarantee impartiality, legal certainty, and the effective application of the Regulation across Member States.  The questions raised, covering the issuance of orders to service providers, cooperation with other authorities, actions on election-related content, and the designation of trusted flaggers, fall squarely within the operational remit of An Coimisiún. These functions involve regulatory judgment and enforcement under the Digital Services Act, which are matters for the independent regulator.  Under Article 55 of the Digital Services Act, Coimisiún na Meán is required to publish an annual activity report detailing its activities under the Regulation. This report is publicly available and those seeking further information on these operational matters may consult the most recent report at: www.cnam.ie/app/uploads/2025/04/20250319_Art-55-DSA-report_VFinal.pdf. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 355. Deputy Mattie McGrath asked the Minister for Enterprise, Tourism and Employment to state whether Coimisiún na Meán, in its capacity as Digital Services Coordinator under Regulation (EU) 2022/2065, has issued any orders, binding instructions, formal notices, or informal requests to intermediary service providers established in the State which resulted in the removal, restriction, downranking, or other limitation of access to content originating in the United States; to provide details of the number of such cases, the type of measure applied, the legal basis invoked, and whether the relevant action was initiated by Coimisiún na Meán, by another Member State's Digital Services Coordinator, or by the European Commission; and to outline whether any such measures were communicated to, or coordinated with U.S. authorities; and if he will make a statement on the matter. [69010/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_319",
          "debateSectionId": "dbsect_319",
          "showAs": "EU Regulations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_319.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_355",
        "questionNumber": 355
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  I propose to take Questions Nos. 354, 355, 356 and 357 together.  Under Section 10 of the Broadcasting and Other Media Regulation Acts 2009 and 2022, Coimisiún na Meán is established as an independent regulator. This statutory independence ensures that decisions relating to enforcement, compliance, and operational matters are taken without Ministerial direction or influence. This separation of powers is essential to maintain the integrity of the regulatory framework and to uphold Ireland’s obligations under EU law.  Article 50 of Regulation (EU) 2022/2065 (the Digital Services Act) explicitly requires that national Digital Services Coordinators, such as Coimisiún na Meán, act with complete independence and remain free from any external influence when carrying out their tasks and exercising their powers. This provision reflects a core principle of EU law, that regulatory authorities must operate autonomously to guarantee impartiality, legal certainty, and the effective application of the Regulation across Member States.  The questions raised, covering the issuance of orders to service providers, cooperation with other authorities, actions on election-related content, and the designation of trusted flaggers, fall squarely within the operational remit of An Coimisiún. These functions involve regulatory judgment and enforcement under the Digital Services Act, which are matters for the independent regulator.  Under Article 55 of the Digital Services Act, Coimisiún na Meán is required to publish an annual activity report detailing its activities under the Regulation. This report is publicly available and those seeking further information on these operational matters may consult the most recent report at: www.cnam.ie/app/uploads/2025/04/20250319_Art-55-DSA-report_VFinal.pdf. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 356. Deputy Mattie McGrath asked the Minister for Enterprise, Tourism and Employment if Coimisiún na Meán, in its role as Digital Services Coordinator under Regulation (EU) 2022/2065, received or acted upon any requests, alerts, or cooperation mechanisms from other Digital Services Coordinators or the European Commission in connection with the recent elections in Romania, the Czech Republic, or the Netherlands; the number and nature of any measures taken by Coimisiún na Meán or by service providers established in the State under the Digital Services Act in relation to election-related content, including takedown orders, visibility-limitation measures, or systemic risk mitigation actions; to indicate whether any such measures affected cross-border content flows or accounts accessible in Ireland; and if he will make a statement on the matter. [69011/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_319",
          "debateSectionId": "dbsect_319",
          "showAs": "EU Regulations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_319.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_356",
        "questionNumber": 356
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  I propose to take Questions Nos. 354, 355, 356 and 357 together.  Under Section 10 of the Broadcasting and Other Media Regulation Acts 2009 and 2022, Coimisiún na Meán is established as an independent regulator. This statutory independence ensures that decisions relating to enforcement, compliance, and operational matters are taken without Ministerial direction or influence. This separation of powers is essential to maintain the integrity of the regulatory framework and to uphold Ireland’s obligations under EU law.  Article 50 of Regulation (EU) 2022/2065 (the Digital Services Act) explicitly requires that national Digital Services Coordinators, such as Coimisiún na Meán, act with complete independence and remain free from any external influence when carrying out their tasks and exercising their powers. This provision reflects a core principle of EU law, that regulatory authorities must operate autonomously to guarantee impartiality, legal certainty, and the effective application of the Regulation across Member States.  The questions raised, covering the issuance of orders to service providers, cooperation with other authorities, actions on election-related content, and the designation of trusted flaggers, fall squarely within the operational remit of An Coimisiún. These functions involve regulatory judgment and enforcement under the Digital Services Act, which are matters for the independent regulator.  Under Article 55 of the Digital Services Act, Coimisiún na Meán is required to publish an annual activity report detailing its activities under the Regulation. This report is publicly available and those seeking further information on these operational matters may consult the most recent report at: www.cnam.ie/app/uploads/2025/04/20250319_Art-55-DSA-report_VFinal.pdf. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 357. Deputy Mattie McGrath asked the Minister for Enterprise, Tourism and Employment the current applicants for the trusted flagger system, and those already with the designation; to set out the steps Coimisiún na Meán takes to assess the funding sources, foreign ties, advocacy positions, or potential conflicts of interest of organisations applying for trusted flagger status; if any applicants have been rejected, suspended, or reviewed; and if he will make a statement on the matter. [69012/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_319",
          "debateSectionId": "dbsect_319",
          "showAs": "EU Regulations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_319.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_357",
        "questionNumber": 357
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for students with special educational needs.  In order to support the NCSE and forward planning my department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE through the Parent Notify process that they are seeking a special educational placement for their child.  The NCSE is currently undertaking an analysis of the information provided through the Parents Notify process which closed on 1 October to plot demand for specialist places for the 2026/27 school year.  The NCSE will have a clear picture of the local demand for special class places for the 2026/27 school year after they review and assess all of the information which has been provided through the parents' notification process which closed on 1 October.  It is the aim of the NCSE to sanction the majority of new special classes by 31 December 2025. This is four months earlier than last year and will bring clarity and certainty for both parents and schools as to where new classes will be located.  This new timeline was publicised widely and communicated with schools and special education advocacy groups and parent representative bodies. The NCSE also undertook a lot of work at local level to ensure that families were aware of the timeline and process.  The NCSE report a very significant level of engagement and contact from families before 1 October.  Once this analysis is complete, the NCSE will be equipped to engage with schools to open new special classes in relevant areas.  With any date for applications for supports, it is important that those who come forward after that date are assured that they are not forgotten or excluded from the system. I would like to stress that the NCSE will continue to support all children and young people made known to them after 1 October in their existing placement with appropriate supports, however, it is important for planning purposes that an earlier timeframe is worked to in which the NCSE has as much local knowledge and detail as possible in order to plan what new provision is required.  For the 2025/26 school year the NCSE advise that a small number of special class places remain in most counties for those still seeking placement. While these places may not be in a preferred school, vacancies do exist.  The NCSE remains available to provide advice and support to all families seeking specialist placement and will continue to examine where provision is required for the 2026/27 school year. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 383. Deputy Mattie McGrath asked the Minister for Education and Youth the number of children nationwide who sought a letter of eligibility for a place in a special class or special school through the parents notify portal, before the deadline of 1 October 2025, with a breakdown of each county; the number seeking a letter of eligibility for a place in a special class and special school in South Tipperary; the number of children who have been issued with a letter of eligibility in South Tipperary; and if she will make a statement on the matter. [69027/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_343",
          "debateSectionId": "dbsect_343",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_343.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_383",
        "questionNumber": 383
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I have requested the information sought by the Deputy from Fiosrú. Regrettably, this was not available in time and I will write to the Deputy once the information is to hand. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 652. Deputy Mattie McGrath asked the Minister for Justice, Home Affairs and Migration if Fiosrú is meeting its statutory obligations under the Policing, Security and Community Safety Act 2024 in relation to timely initial assessment of complaints; the average time taken by Fiosrú to complete initial screening and allocation decisions on complaints received since its establishment; the measures in place to ensure compliance with statutory timelines; and if he will make a statement on the matter. [69676/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_529",
          "debateSectionId": "dbsect_529",
          "showAs": "Legislative Process",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_529.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_652",
        "questionNumber": 652
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 182, 183, 184 and 185 together.  I have requested the information sought by the Deputy but it was not received in time. I will contact the Deputy directly once the information is to hand. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 182. Deputy Mattie McGrath asked the Minister for Justice, Home Affairs and Migration the protocols in place to ensure the immediate safeguarding of severely disabled, non-verbal, and medically vulnerable children when a safety order has been granted; and if he will make a statement on the matter. [68275/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_167",
          "debateSectionId": "dbsect_167",
          "showAs": "Child Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_167.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_182",
        "questionNumber": 182
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 182, 183, 184 and 185 together.  I have requested the information sought by the Deputy but it was not received in time. I will contact the Deputy directly once the information is to hand. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 183. Deputy Mattie McGrath asked the Minister for Justice, Home Affairs and Migration if protective services units have specific protocols for cases involving non-verbal and medically fragile children; and if additional resources will be allocated to strengthen these units. [68277/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_167",
          "debateSectionId": "dbsect_167",
          "showAs": "Child Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_167.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_183",
        "questionNumber": 183
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 182, 183, 184 and 185 together.  I have requested the information sought by the Deputy but it was not received in time. I will contact the Deputy directly once the information is to hand. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 184. Deputy Mattie McGrath asked the Minister for Justice, Home Affairs and Migration if he will consider appointing a dedicated liaison officer to provide regular updates to families in cases where a safety order is in place and the child is at elevated risk; and if he will make a statement on the matter. [68278/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_167",
          "debateSectionId": "dbsect_167",
          "showAs": "Child Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_167.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_184",
        "questionNumber": 184
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 182, 183, 184 and 185 together.  I have requested the information sought by the Deputy but it was not received in time. I will contact the Deputy directly once the information is to hand. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 185. Deputy Mattie McGrath asked the Minister for Justice, Home Affairs and Migration the disability specific victim supports which are currently available; if additional measures will be introduced; and if he will make a statement on the matter. [68279/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_167",
          "debateSectionId": "dbsect_167",
          "showAs": "Child Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_167.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_185",
        "questionNumber": 185
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 186, 187, 188, 190, 191, 192 and 193 together.  The accommodation centre at Dundrum House, Co Tipperary, has been providing accommodation under contract to the Department since 2022, for people fleeing the war in Ukraine and people applying for international protection.  I am advised that Dundrum House Hotel ceased operating as a hotel a decade ago, in 2015. The golf course and other businesses remained in operation over recent years during the use of the site for State accommodation. I understand that they have closed quite recently in connection with a commercial dispute to which my Department is not a party.  Some areas of this property have been contracted to provide State-supported accommodation for people from Ukraine since 2022 and to international protection applicants since 2024.  In relation to the most recent contract with the Department, while detailed contractual information is considered confidential and commercially sensitive, a lot of information has been shared with local elected representatives and stakeholders in relation to this process.  The contract was agreed in April 2025, following a detailed appraisal and due diligence process. This includes checks on the provider, and a review of the compliance with building and other regulatory matters overseen by the Local Authority. All matters relating to fire, building or planning regulations at an IPAS accommodation centre are between the Local Authority and the property owner or provider.  As part of all appraisals, the Department requires confirmation, issued by the Local Authority, that the property's use as international protection accommodation is covered by the conditions of the Planning and Development Act and relevant exemptions for this purpose.  Confirmation of this planning exemption was provided to this Department as part of its appraisal for this accommodation contract.  Tipperary County Council have acknowledged within court proceedings over recent months that the granting of a planning exemption to the property in January 2025 had an administrative flaw in the process. On 17 November 2025 the Court made final orders in this matter.  The accommodation provider at Dundrum House has made a new application to the local authority for confirmation of the planning exemption and this is currently with An Coimisiún Pleanála for review.  The Department is now actively reviewing the implication of these matters in the context of the existing contract, and the nearly 200 people and families who are accommodated at Dundrum House at this time.  I will ensure that the Deputy and all other local elected representatives are kept informed of any updates or developments in this matter. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 186. Deputy Mattie McGrath asked the Minister for Justice, Home Affairs and Migration the reason his Department continues to operate an International Protection Accommodation Service (IPAS) contract at a hotel (details supplied) despite the High Court quashing the section 5 planning exemption that underpinned its use; if his Department respects the role and decisions of the courts; the action he will take as a result of this court agreement to ensure that the State is not engaging with an unauthorised development; and if he will make a statement on the matter. [68283/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_168",
          "debateSectionId": "dbsect_168",
          "showAs": "International Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_168.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_186",
        "questionNumber": 186
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 186, 187, 188, 190, 191, 192 and 193 together.  The accommodation centre at Dundrum House, Co Tipperary, has been providing accommodation under contract to the Department since 2022, for people fleeing the war in Ukraine and people applying for international protection.  I am advised that Dundrum House Hotel ceased operating as a hotel a decade ago, in 2015. The golf course and other businesses remained in operation over recent years during the use of the site for State accommodation. I understand that they have closed quite recently in connection with a commercial dispute to which my Department is not a party.  Some areas of this property have been contracted to provide State-supported accommodation for people from Ukraine since 2022 and to international protection applicants since 2024.  In relation to the most recent contract with the Department, while detailed contractual information is considered confidential and commercially sensitive, a lot of information has been shared with local elected representatives and stakeholders in relation to this process.  The contract was agreed in April 2025, following a detailed appraisal and due diligence process. This includes checks on the provider, and a review of the compliance with building and other regulatory matters overseen by the Local Authority. All matters relating to fire, building or planning regulations at an IPAS accommodation centre are between the Local Authority and the property owner or provider.  As part of all appraisals, the Department requires confirmation, issued by the Local Authority, that the property's use as international protection accommodation is covered by the conditions of the Planning and Development Act and relevant exemptions for this purpose.  Confirmation of this planning exemption was provided to this Department as part of its appraisal for this accommodation contract.  Tipperary County Council have acknowledged within court proceedings over recent months that the granting of a planning exemption to the property in January 2025 had an administrative flaw in the process. On 17 November 2025 the Court made final orders in this matter.  The accommodation provider at Dundrum House has made a new application to the local authority for confirmation of the planning exemption and this is currently with An Coimisiún Pleanála for review.  The Department is now actively reviewing the implication of these matters in the context of the existing contract, and the nearly 200 people and families who are accommodated at Dundrum House at this time.  I will ensure that the Deputy and all other local elected representatives are kept informed of any updates or developments in this matter. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 187. Deputy Mattie McGrath asked the Minister for Justice, Home Affairs and Migration if a hotel (details supplied) has full insurance for IPAS accommodation given most commercial insurance policies have exclusions including unauthorised use and in view of the fact that this is now an unauthorised use of this hotel; if the hotel is fully insured and is not opening the State up to unnecessary risk; and if he will make a statement on the matter. [68284/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_168",
          "debateSectionId": "dbsect_168",
          "showAs": "International Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_168.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_187",
        "questionNumber": 187
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 186, 187, 188, 190, 191, 192 and 193 together.  The accommodation centre at Dundrum House, Co Tipperary, has been providing accommodation under contract to the Department since 2022, for people fleeing the war in Ukraine and people applying for international protection.  I am advised that Dundrum House Hotel ceased operating as a hotel a decade ago, in 2015. The golf course and other businesses remained in operation over recent years during the use of the site for State accommodation. I understand that they have closed quite recently in connection with a commercial dispute to which my Department is not a party.  Some areas of this property have been contracted to provide State-supported accommodation for people from Ukraine since 2022 and to international protection applicants since 2024.  In relation to the most recent contract with the Department, while detailed contractual information is considered confidential and commercially sensitive, a lot of information has been shared with local elected representatives and stakeholders in relation to this process.  The contract was agreed in April 2025, following a detailed appraisal and due diligence process. This includes checks on the provider, and a review of the compliance with building and other regulatory matters overseen by the Local Authority. All matters relating to fire, building or planning regulations at an IPAS accommodation centre are between the Local Authority and the property owner or provider.  As part of all appraisals, the Department requires confirmation, issued by the Local Authority, that the property's use as international protection accommodation is covered by the conditions of the Planning and Development Act and relevant exemptions for this purpose.  Confirmation of this planning exemption was provided to this Department as part of its appraisal for this accommodation contract.  Tipperary County Council have acknowledged within court proceedings over recent months that the granting of a planning exemption to the property in January 2025 had an administrative flaw in the process. On 17 November 2025 the Court made final orders in this matter.  The accommodation provider at Dundrum House has made a new application to the local authority for confirmation of the planning exemption and this is currently with An Coimisiún Pleanála for review.  The Department is now actively reviewing the implication of these matters in the context of the existing contract, and the nearly 200 people and families who are accommodated at Dundrum House at this time.  I will ensure that the Deputy and all other local elected representatives are kept informed of any updates or developments in this matter. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 188. Deputy Mattie McGrath asked the Minister for Justice, Home Affairs and Migration the legal advice his Department has received regarding the continuation of the IPAS contract (details supplied) in the absence of planning permission and the recent decision of the High Court quashing the section 5 in respect of the building; and if he will make a statement on the matter. [68285/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_168",
          "debateSectionId": "dbsect_168",
          "showAs": "International Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_168.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_188",
        "questionNumber": 188
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Department continues to take action across all aspects of the international protection accommodation system to improve value for money, strengthen governance and compliance, and renegotiate contracts with providers.  Applications for international protection this year have reduced, and this has supported our work to put in place greater controls over the IPAS accommodation portfolio.  A range of updated systems and procedures have already been put in place and are already having an impact. IPAS has put improved processes in place for appraisal, validation, contracting and payments.  A new rate-card pricing structure is being applied to all new or renewing contracts and has already provided savings of over €59m since May 2025.  The Department receives offers of international protection accommodation on an ongoing basis from external commercial providers. All offers are reviewed by the Department under a standardised appraisal procedure.  A dedicated team appraises each offer to accommodate people seeking international protection, and the Department carries out due diligence on the provider who is offering the accommodation service.  This includes checks on the provider offering the service to the Department via the Companies Registration Office (CRO) to ensure compliance with CRO requirements.  Providers must be registered in Ireland. Providers may be part of wider commercial groups and may also be operating in other EU member states, in line with EU principles of free movement of goods, services, and works.  Since 2024, each new or renewing provider of accommodation services must provide a declaration of their personal circumstances. This declaration, which must be notarised, confirms that they are tax compliant, free of any convictions for corruption, fraud or being a member of a criminal organisation. It also confirms that they are solvent and have no history of failing to meet terms of public service contracts, among other requirements.  In relation to contracts ending, IPAS regularly engages with centres to ensure compliance with contracts and standards, with a dual eye on safety and welfare of residents, while also ensuring value for money and compliance by providers. So far in 2025 there have been 22 notifications of terminations of contracts, and while the Department treats all contractual matters as confidential and commercially sensitive, reasons for termination would include value for money, or concerns about non-compliance.  There is full transparency from the Department in terms of providers receiving payments, with details of all payments over €20,000 and the recipients published quarterly online at Gov.ie here:  www.gov.ie/en/collection/dfdadb-department-of-children-and-youth-affairs-purchase-orders-for-20000-o/.  www.gov.ie/en/department-of-children-disability-and-equality/collections/department-of-children-equality-disability-integration-and-youth-purchase-orders-for-20000-or-above/.  This work forms part of an overall reform of the International Protection system that is already working to speed up processing of applications and to reduce reliance on commercial provision in favour of more State-owned accommodation. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 189. Deputy Mattie McGrath asked the Minister for Justice, Home Affairs and Migration if he will commit to an independent review of how IPAS contracts are awarded, including compliance checks on planning and environmental law; the number of contracts that have been rescinded by his Department; the details of the contacts; the reason for rescinding the contracts; and if he will make a statement on the matter. [68286/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_169",
          "debateSectionId": "dbsect_169",
          "showAs": "International Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_169.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_189",
        "questionNumber": 189
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 186, 187, 188, 190, 191, 192 and 193 together.  The accommodation centre at Dundrum House, Co Tipperary, has been providing accommodation under contract to the Department since 2022, for people fleeing the war in Ukraine and people applying for international protection.  I am advised that Dundrum House Hotel ceased operating as a hotel a decade ago, in 2015. The golf course and other businesses remained in operation over recent years during the use of the site for State accommodation. I understand that they have closed quite recently in connection with a commercial dispute to which my Department is not a party.  Some areas of this property have been contracted to provide State-supported accommodation for people from Ukraine since 2022 and to international protection applicants since 2024.  In relation to the most recent contract with the Department, while detailed contractual information is considered confidential and commercially sensitive, a lot of information has been shared with local elected representatives and stakeholders in relation to this process.  The contract was agreed in April 2025, following a detailed appraisal and due diligence process. This includes checks on the provider, and a review of the compliance with building and other regulatory matters overseen by the Local Authority. All matters relating to fire, building or planning regulations at an IPAS accommodation centre are between the Local Authority and the property owner or provider.  As part of all appraisals, the Department requires confirmation, issued by the Local Authority, that the property's use as international protection accommodation is covered by the conditions of the Planning and Development Act and relevant exemptions for this purpose.  Confirmation of this planning exemption was provided to this Department as part of its appraisal for this accommodation contract.  Tipperary County Council have acknowledged within court proceedings over recent months that the granting of a planning exemption to the property in January 2025 had an administrative flaw in the process. On 17 November 2025 the Court made final orders in this matter.  The accommodation provider at Dundrum House has made a new application to the local authority for confirmation of the planning exemption and this is currently with An Coimisiún Pleanála for review.  The Department is now actively reviewing the implication of these matters in the context of the existing contract, and the nearly 200 people and families who are accommodated at Dundrum House at this time.  I will ensure that the Deputy and all other local elected representatives are kept informed of any updates or developments in this matter. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 190. Deputy Mattie McGrath asked the Minister for Justice, Home Affairs and Migration if he has been informed of the unauthorised wastewater treatment systems operating at a hotel (details supplied) and the ongoing pollution of the Multeen river, a Natura 2000 special area of conservation; if he is satisfied that a State contract is leading to the pollution of a special area of conservation; and if he will make a statement on the matter. [68287/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_168",
          "debateSectionId": "dbsect_168",
          "showAs": "International Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_168.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_190",
        "questionNumber": 190
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 186, 187, 188, 190, 191, 192 and 193 together.  The accommodation centre at Dundrum House, Co Tipperary, has been providing accommodation under contract to the Department since 2022, for people fleeing the war in Ukraine and people applying for international protection.  I am advised that Dundrum House Hotel ceased operating as a hotel a decade ago, in 2015. The golf course and other businesses remained in operation over recent years during the use of the site for State accommodation. I understand that they have closed quite recently in connection with a commercial dispute to which my Department is not a party.  Some areas of this property have been contracted to provide State-supported accommodation for people from Ukraine since 2022 and to international protection applicants since 2024.  In relation to the most recent contract with the Department, while detailed contractual information is considered confidential and commercially sensitive, a lot of information has been shared with local elected representatives and stakeholders in relation to this process.  The contract was agreed in April 2025, following a detailed appraisal and due diligence process. This includes checks on the provider, and a review of the compliance with building and other regulatory matters overseen by the Local Authority. All matters relating to fire, building or planning regulations at an IPAS accommodation centre are between the Local Authority and the property owner or provider.  As part of all appraisals, the Department requires confirmation, issued by the Local Authority, that the property's use as international protection accommodation is covered by the conditions of the Planning and Development Act and relevant exemptions for this purpose.  Confirmation of this planning exemption was provided to this Department as part of its appraisal for this accommodation contract.  Tipperary County Council have acknowledged within court proceedings over recent months that the granting of a planning exemption to the property in January 2025 had an administrative flaw in the process. On 17 November 2025 the Court made final orders in this matter.  The accommodation provider at Dundrum House has made a new application to the local authority for confirmation of the planning exemption and this is currently with An Coimisiún Pleanála for review.  The Department is now actively reviewing the implication of these matters in the context of the existing contract, and the nearly 200 people and families who are accommodated at Dundrum House at this time.  I will ensure that the Deputy and all other local elected representatives are kept informed of any updates or developments in this matter. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 191. Deputy Mattie McGrath asked the Minister for Justice, Home Affairs and Migration if environmental compliance formed part of the due diligence process before awarding the IPAS contract for a hotel (details supplied); and if he will make a statement on the matter. [68288/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_168",
          "debateSectionId": "dbsect_168",
          "showAs": "International Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_168.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_191",
        "questionNumber": 191
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 186, 187, 188, 190, 191, 192 and 193 together.  The accommodation centre at Dundrum House, Co Tipperary, has been providing accommodation under contract to the Department since 2022, for people fleeing the war in Ukraine and people applying for international protection.  I am advised that Dundrum House Hotel ceased operating as a hotel a decade ago, in 2015. The golf course and other businesses remained in operation over recent years during the use of the site for State accommodation. I understand that they have closed quite recently in connection with a commercial dispute to which my Department is not a party.  Some areas of this property have been contracted to provide State-supported accommodation for people from Ukraine since 2022 and to international protection applicants since 2024.  In relation to the most recent contract with the Department, while detailed contractual information is considered confidential and commercially sensitive, a lot of information has been shared with local elected representatives and stakeholders in relation to this process.  The contract was agreed in April 2025, following a detailed appraisal and due diligence process. This includes checks on the provider, and a review of the compliance with building and other regulatory matters overseen by the Local Authority. All matters relating to fire, building or planning regulations at an IPAS accommodation centre are between the Local Authority and the property owner or provider.  As part of all appraisals, the Department requires confirmation, issued by the Local Authority, that the property's use as international protection accommodation is covered by the conditions of the Planning and Development Act and relevant exemptions for this purpose.  Confirmation of this planning exemption was provided to this Department as part of its appraisal for this accommodation contract.  Tipperary County Council have acknowledged within court proceedings over recent months that the granting of a planning exemption to the property in January 2025 had an administrative flaw in the process. On 17 November 2025 the Court made final orders in this matter.  The accommodation provider at Dundrum House has made a new application to the local authority for confirmation of the planning exemption and this is currently with An Coimisiún Pleanála for review.  The Department is now actively reviewing the implication of these matters in the context of the existing contract, and the nearly 200 people and families who are accommodated at Dundrum House at this time.  I will ensure that the Deputy and all other local elected representatives are kept informed of any updates or developments in this matter. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 192. Deputy Mattie McGrath asked the Minister for Justice, Home Affairs and Migration if he will make the fire safety certificates in respect of an IPAS centre (details supplied) available for viewing by Tipperary public representatives who have serious concerns regarding the absence of all required fire safety certificates in respect of a property (details supplied); and if he will make a statement on the matter. [68289/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_168",
          "debateSectionId": "dbsect_168",
          "showAs": "International Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_168.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_192",
        "questionNumber": 192
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 186, 187, 188, 190, 191, 192 and 193 together.  The accommodation centre at Dundrum House, Co Tipperary, has been providing accommodation under contract to the Department since 2022, for people fleeing the war in Ukraine and people applying for international protection.  I am advised that Dundrum House Hotel ceased operating as a hotel a decade ago, in 2015. The golf course and other businesses remained in operation over recent years during the use of the site for State accommodation. I understand that they have closed quite recently in connection with a commercial dispute to which my Department is not a party.  Some areas of this property have been contracted to provide State-supported accommodation for people from Ukraine since 2022 and to international protection applicants since 2024.  In relation to the most recent contract with the Department, while detailed contractual information is considered confidential and commercially sensitive, a lot of information has been shared with local elected representatives and stakeholders in relation to this process.  The contract was agreed in April 2025, following a detailed appraisal and due diligence process. This includes checks on the provider, and a review of the compliance with building and other regulatory matters overseen by the Local Authority. All matters relating to fire, building or planning regulations at an IPAS accommodation centre are between the Local Authority and the property owner or provider.  As part of all appraisals, the Department requires confirmation, issued by the Local Authority, that the property's use as international protection accommodation is covered by the conditions of the Planning and Development Act and relevant exemptions for this purpose.  Confirmation of this planning exemption was provided to this Department as part of its appraisal for this accommodation contract.  Tipperary County Council have acknowledged within court proceedings over recent months that the granting of a planning exemption to the property in January 2025 had an administrative flaw in the process. On 17 November 2025 the Court made final orders in this matter.  The accommodation provider at Dundrum House has made a new application to the local authority for confirmation of the planning exemption and this is currently with An Coimisiún Pleanála for review.  The Department is now actively reviewing the implication of these matters in the context of the existing contract, and the nearly 200 people and families who are accommodated at Dundrum House at this time.  I will ensure that the Deputy and all other local elected representatives are kept informed of any updates or developments in this matter. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 193. Deputy Mattie McGrath asked the Minister for Justice, Home Affairs and Migration is aware that no lease agreement exists between a company (details supplied) the property owner of a hotel and another company the operator contracted under the International Protection Accommodation Service (IPAS); the legal basis that exists for continuing to house IPAS residents at this property in circumstances where the operator has been described in High Court proceedings as “trespassing”; if he will confirm the presence of a lease agreement; and if he will make a statement on the matter. [68290/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_168",
          "debateSectionId": "dbsect_168",
          "showAs": "International Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_168.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_193",
        "questionNumber": 193
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  My Department records the number of cattle and sheep slaughtered without pre-stunning on a quarterly basis. Table 1 contains the total number of cattle and sheep slaughtered without pre-stunning from 2020 to end of Q3 2025.  My Department does not certify or licence meat slaughtered in approved establishments as halal. Food businesses may only apply a halal label to meat which has been certified as halal by a halal certifying body.  In regard to non-stun slaughter in meat establishments approved by my Department, Article 4(4) of Regulation (EC) No. 1099/2009 on the Protection of Animals at the Time of Killing provides for a derogation, in the case of slaughter prescribed by religious rites, from the usual requirement for animals to be stunned before slaughter. Statutory Instrument No. 292 of 2013 gives effect to the Regulation. In order to avail of this derogation, Food Business Operators are required to obtain approval and demonstrate compliance with Regulation (EC) No. 1099/2009.   Table 1  ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 210. Deputy Mattie McGrath asked the Minister for Agriculture, Food and the Marine the number of cattle and sheep slaughtered annually in Ireland under Halal certification without pre-stunning; the names of the companies licensed to carry out this practice; and if he will make a statement on the matter. [68190/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_181",
          "debateSectionId": "dbsect_181",
          "showAs": "Animal Slaughtering",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_181.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_210",
        "questionNumber": 210
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 211 and 215 together.  There is EU and Irish legislation in place for the protection of animals at the time of slaughter. The legislation requires animals to be stunned before they are slaughtered. However, slaughter of animals without prior stunning, as prescribed by religious rites, is also permitted under the EU legislation, under derogation.  My Department is responsible for implementation of the above legislation and animal welfare legislation generally. Policy on all animal welfare issues is subject to periodic review particularly in light of new information on the topic or developments at EU level and on foot of such a review policy changes may be implemented if deemed appropriate.  This type of slaughter is carried out in Ireland in a very limited number of slaughter plants and those plants must meet specific requirements in order to be approved to carry out slaughter without stunning; plant owners must apply to my Department and submit a Standard Operating Procedure for this type of slaughter, specific to their plant, for pre-approval, they must also meet requirements in relation to plant infrastructure and training and competence of staff carrying out the slaughter.  My Department is not involved in the Halal certification of meat and meat products arising from slaughter without prior stunning as this is an arrangement between food businesses and Halal Certifying Bodies and my Department does not have specific economic information in relation to halal markets. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 211. Deputy Mattie McGrath asked the Minister for Agriculture, Food and the Marine the animal welfare standards which are applied to non-stun slaughter in Ireland; if these standards meet EU animal welfare regulations; and if he will consider prohibiting non-stun slaughter on animal welfare grounds; and if he will make a statement on the matter. [68191/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_182",
          "debateSectionId": "dbsect_182",
          "showAs": "Animal Slaughtering",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_182.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_211",
        "questionNumber": 211
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  The choice of slaughter plants is a commercial decision for farmers. As such, my Department has no role or knowledge whether farmers are informed or consulted before their animals are slaughtered without stunning. There is no regulatory requirement for this to occur. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 212. Deputy Mattie McGrath asked the Minister for Agriculture, Food and the Marine if he will confirm whether Irish farmers are informed or consulted before their animals are slaughtered without stunning for Halal markets; and if he will make a statement on the matter. [68192/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_183",
          "debateSectionId": "dbsect_183",
          "showAs": "Animal Slaughtering",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_183.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_212",
        "questionNumber": 212
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  My Department maintains permanent presence in slaughterhouses engaged in non-stun slaughter. This is important for verifying their compliance with relevant EU and Irish regulations.  Policy on all animal welfare issues is subject to periodic review particularly in light of new information on the topic or developments at EU level and on foot of such a review, policy changes may be implemented if deemed appropriate. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 213. Deputy Mattie McGrath asked the Minister for Agriculture, Food and the Marine if he will review the licensing and oversight of slaughterhouses engaged in non-stun slaughter; and if he will consider introducing mandatory stunning for all animals slaughtered in Ireland; and if he will make a statement on the matter. [68193/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_185",
          "debateSectionId": "dbsect_185",
          "showAs": "Animal Slaughtering",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_185.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_213",
        "questionNumber": 213
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  My Department supervises slaughterhouses approved to carry out non-stun slaughter and monitor compliance using a variety of tools including inspections, audits, interviews with business operators and their staff and checks of operator instructions, including records.  Official Controls, while not specifically enumerated in such slaughter establishments, are generated by my Department for each establishment each week. In addition, my Department monitors the effectiveness of official controls. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 214. Deputy Mattie McGrath asked the Minister for Agriculture, Food and the Marine if he will provide details of audits or inspections carried out on slaughterhouses performing non-stun slaughter; the findings of these audits; and if he will make a statement on the matter. [68194/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_186",
          "debateSectionId": "dbsect_186",
          "showAs": "Animal Slaughtering",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_186.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_214",
        "questionNumber": 214
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 211 and 215 together.  There is EU and Irish legislation in place for the protection of animals at the time of slaughter. The legislation requires animals to be stunned before they are slaughtered. However, slaughter of animals without prior stunning, as prescribed by religious rites, is also permitted under the EU legislation, under derogation.  My Department is responsible for implementation of the above legislation and animal welfare legislation generally. Policy on all animal welfare issues is subject to periodic review particularly in light of new information on the topic or developments at EU level and on foot of such a review policy changes may be implemented if deemed appropriate.  This type of slaughter is carried out in Ireland in a very limited number of slaughter plants and those plants must meet specific requirements in order to be approved to carry out slaughter without stunning; plant owners must apply to my Department and submit a Standard Operating Procedure for this type of slaughter, specific to their plant, for pre-approval, they must also meet requirements in relation to plant infrastructure and training and competence of staff carrying out the slaughter.  My Department is not involved in the Halal certification of meat and meat products arising from slaughter without prior stunning as this is an arrangement between food businesses and Halal Certifying Bodies and my Department does not have specific economic information in relation to halal markets. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 215. Deputy Mattie McGrath asked the Minister for Agriculture, Food and the Marine the economic value of the Halal market to Irish meat exports; and if he will consider whether this market justifies the continuation of non-stun slaughter practices given animal welfare concerns; and if he will make a statement on the matter. [68195/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_182",
          "debateSectionId": "dbsect_182",
          "showAs": "Animal Slaughtering",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_182.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_215",
        "questionNumber": 215
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  I propose to take Questions Nos. 222 and 223 together.  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 222. Deputy Mattie McGrath asked the Minister for Children, Disability and Equality the number of children/parents who attended an individual or group intervention in Clonmel CDNT5 to date in 2025, by month, in tabular form; and if she will make a statement on the matter. [68257/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_192",
          "debateSectionId": "dbsect_192",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_192.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_222",
        "questionNumber": 222
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  I propose to take Questions Nos. 222 and 223 together.  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 223. Deputy Mattie McGrath asked the Minister for Children, Disability and Equality the total number of persons who did not attend an individual or group appointment in Clonmel CDNT5, by month in 2025, in tabular form; and if she will make a statement on the matter. [68258/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_192",
          "debateSectionId": "dbsect_192",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_192.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_223",
        "questionNumber": 223
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The Access and Inclusion Model (AIM) is a model of supports designed to ensure that children with additional needs or a disability can access the Early Childhood Care and Education (ECCE) Programme. Access to AIM is based on the needs of the individual child, in the context of the pre-school setting, and does not require a diagnosis.  Pobal, who are the administrators of the AIM scheme on behalf of the Department, have informed the Department that an AIM Level 4 application was submitted on the 25th of November 2025 for the child referenced and is currently being processed to completion.  AIM level 4 is delivered by Better Start Early Years Specialist Service (EYSS). They work collaboratively with parents, pre-school providers, and with other professionals to develop inclusive learning environments in pre-schools. The EYSS also provides coaching and mentoring to the pre-school staff on supporting children in the ECCE service. This includes the creation of an Access and Inclusion Plan for children, which can help identify additional support and resources required to meet the needs of the child in the pre-school room.  An AIM Level 7 application was submitted on the 1st of December. Applications under Aim Level 7 can take up to 12 weeks to be processed, but are currently taking on average 17 working days from being received to a decision being made in the programme year 2025/2026, this is decrease from the average of 28 working days for the programme year 2024/2025.  AIM Level 7 support enables providers to reduce the child-to-adult ratio in the pre-school room or to fund an extra staff member as a shared resource with other children in the ECCE setting. In recognition of best practice in this area, this support is designed to improve inclusion and ensure meaningful participation of all children in the room. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 224. Deputy Mattie McGrath asked the Minister for Children, Disability and Equality whether a child (details supplied) in south Tipperary will receive Access and Inclusion Model (AIM) funding; and if she will make a statement on the matter. [68296/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_193",
          "debateSectionId": "dbsect_193",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_193.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_224",
        "questionNumber": 224
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  The Wildlife Act 1976 is the principal national legislation providing for the protection of native wildlife and the control of some activities that may adversely affect wildlife. Restrictions on burning are mainly set out in section 39 and section 40 of the Act. There are also restrictions on burning associated with designated European sites.  Section 40 (1) of the Wildlife Act 1976 states:  (1) (a) It shall be an offence for a person to cut, grub, burn or otherwise destroy, during the period beginning on the 1st day of March and ending on the 31st day of August in any year, any vegetation growing on any land not then cultivated  (b) It shall be an offence for a person to cut, grub, burn or otherwise destroy any vegetation growing in any hedge or ditch during the period mentioned in paragraph (a) of this subsection.  There are no plans to introduce changes in respect of burning restrictions. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 342. Deputy Mattie McGrath asked the Minister for Housing, Local Government and Heritage if he will consider introducing a flexible controlled burning scheme for upland areas, allowing farmers to apply for permission to burn heather outside the current statutory window, in order to reduce fire risk and protect biodiversity; and if he will make a statement on the matter. [67703/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_306",
          "debateSectionId": "dbsect_306",
          "showAs": "Environmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_306.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_342",
        "questionNumber": 342
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  My Department provides advice and information to the forestry sector, landowners and relevant state agencies in relation to forest fire risk monitoring, prevention and management. This is available on my Department’s website.  My Department provides advance warnings regarding wildfire risk through the main fire risk period from March to September. During 2025 my Department issued nine Fire Danger Notices in response to periods of increased fire risk. These fire risk notices give landowners and managers time to prepare equipment and people, and to take steps to prevent and reduce losses from fire.  My Department also issues reminders to farmers that illegal burning of agricultural lands may result in the loss of agricultural payments and penalties.  In recent years we have seen a marked reduction in uncontrolled fires arising from agricultural burning.  The Comeragh Mountains SAC falls entirely within ACRES Leinster (East South East) Co-operation Zone. Within ACRES, bracken management falls into two actions; Bracken Strimming and Bracken Mechanical. These actions are both available under ACRES Co-operation Non-Productive Investments (NPIs) and Landscape Actions (LAs).  While my Department currently has no plans to develop a multiyear fire prevention plan specifically for the Comeragh Mountains, my Department, through the funding for European Innovation Partnerships (EIP) and ACRES have supported and are supporting landowners who have included fire risk reduction and fire prevention components into their scheme proposals. I am aware that landowners in the Comeragh Mountains have availed of both EIP and ACREs funding. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 459. Deputy Mattie McGrath asked the Minister for Agriculture, Food and the Marine if he will engage with stakeholders including NPWS, Teagasc, county councils, and the fire service to develop a multiyear fire prevention plan for the Comeragh Mountains, addressing the increased risk posed by heavy heather growth and rising tourist numbers; and if he will make a statement on the matter. [67704/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_403",
          "debateSectionId": "dbsect_403",
          "showAs": "Fire Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_403.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_459",
        "questionNumber": 459
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  Land eligibility under the Basic Income Support for Sustainability (BISS) and other area-based schemes, is governed by both EU Regulations and Ireland's CAP Strategic Plan. For a land parcel to be eligible under the BISS scheme, agricultural activity must be occurring on that parcel. Agricultural activity is the use of the parcel to produce agricultural products, such as livestock rearing and fattening, milk production, the growing of fodder crops (silage, hay), tillage and energy crops or involve the maintenance of the agricultural area.  The definition of agricultural activity considers the physical limitations that certain parcels can be constrained by, in particular hill and upland parcels. Acknowledging the limitations that parcels may be subject to, certain maintenance activities, if carried out correctly, will qualify as an agricultural activity. Controlled burning of land carried out at the correct time of the year is one such activity but should be seen as an activity of last resort, having exhausted all other alternatives.  In terms of controlled burning, lands will remain eligible where controlled burning has been carried out at the right time of the year (between 1st September and 28th February) in full compliance with all relevant environmental legislative requirements and any other lawful requirements, having first consulted with and notified An Garda Síochána and the local fire service. In the case of Natura lands (lands designated as SAC and/or SPA) or NHA lands, prior approval must be obtained through the Activities Requiring Consent (ARC) system as implemented by National Parks and Wildlife Services (NPWS), DAFM or Local Authority.  Land burned at the wrong time of the year or carried out in an uncontrolled manner is ineligible for payment.  Agricultural Activity, including controlled burning is governed by EU Regulations, Ireland’s CAP Strategic Plan and national legislation including the Wildlife Act 1976 and there are no plans foreseen to review the current land eligibility rules including controlled burning. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 460. Deputy Mattie McGrath asked the Minister for Agriculture, Food and the Marine if he will review the impact of current burning restrictions under the Wildlife Act 1976 on upland farmers, particularly in relation to CAP payment eligibility, and consider introducing a regulated application process similar to the EIA legislation for hedgerow removal; and if he will make a statement on the matter. [67705/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_404",
          "debateSectionId": "dbsect_404",
          "showAs": "Agriculture Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_404.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_460",
        "questionNumber": 460
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 461. Deputy Mattie McGrath asked the Minister for Agriculture, Food and the Marine the measures being taken to address the encroachment of bracken on upland areas (details supplied) which is reducing biodiversity and farming viability; and if he will make a statement on the matter. [67706/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_405",
          "debateSectionId": "dbsect_405",
          "showAs": "Land Issues",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_405.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_461",
        "questionNumber": 461
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 471. Deputy Mattie McGrath asked the Minister for Children, Disability and Equality her plans to provide the Clonmel Children's Disability Network Team with its own dedicated space as the service currently shares a building with CAMHS and primary care with insufficient therapy room space; if the lack of therapy space is contributing to the difficulties recruiting therapists; if a request for additional space has been sought from the CDNT manager over the past five years; the current status of this request; and if she will make a statement on the matter. [67360/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_415",
          "debateSectionId": "dbsect_415",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_415.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_471",
        "questionNumber": 471
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 472. Deputy Mattie McGrath asked the Minister for Children, Disability and Equality the children on the open case load of the Clonmel CDNT team with an age breakdown; the number of children on the open case load who have not received any therapies; the breakdown of children waiting for therapies by age; and if she will make a statement on the matter. [67362/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_416",
          "debateSectionId": "dbsect_416",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_416.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_472",
        "questionNumber": 472
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 473. Deputy Mattie McGrath asked the Minister for Children, Disability and Equality the number of children who had been referred to the Clonmel CDNT team by the primary care team and subsequently referred back to the primary care team; and if she will make a statement on the matter. [67363/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_417",
          "debateSectionId": "dbsect_417",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_417.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_473",
        "questionNumber": 473
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter I have asked the HSE to respond to the deputy as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 535. Deputy Mattie McGrath asked the Minister for Health the number of children on South Tipperary primary care waiting lists for OT, SLT, psychology and physiotherapy; the breakdown of therapists available on primary care teams across South Tipperary, by primary care team location; and if she will make a statement on the matter. [67361/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_472",
          "debateSectionId": "dbsect_472",
          "showAs": "Health Services Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_472.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_535",
        "questionNumber": 535
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 536. Deputy Mattie McGrath asked the Minister for Health the number of patients being seen by an organisation (details supplied) in Clonmel; the frequency of clinics in Clonmel; the numbers waiting for mental health supports in South Tipperary; the plans to increase the frequency of clinics in South Tipperary; and if she will make a statement on the matter. [67364/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_473",
          "debateSectionId": "dbsect_473",
          "showAs": "Mental Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_473.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_536",
        "questionNumber": 536
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  The Dental Treatment Services Scheme (DTSS) provides oral healthcare, free of charge, to medical card holders aged 16 and over. Services available annually and on demand include an examination including preventative elements, two fillings, extractions, and a scale and polish. More complex care, such as dentures, additional fillings and a broader range of treatments for patients with additional needs and high-risk patients, are available subject to the approval of the local HSE Principal Dental Surgeon.  A package of measures was introduced in 2022 to expand the care available under the Scheme and significantly increase the fees paid to contractors . These measures are having an impact, with access to care continuing to increase each year since they were introduced. In 2024, over 227,000 additional treatments were provided under the DTSS, supporting over 44,000 extra patients compared with 2022. Access to care has continued to improve this year, an additional 5,802 patients have been treated, and a further 14,640 treatments provided in the January-October 2025 period compared to the same period in 2024.  Fees paid to dentists for DTSS care are now aligned with other European countries which provide comparable public dental care, noting that many European countries, especially in the southern and eastern regions, don’t have any scheme in place for adults, which is free at point of access.  In the longer term, the Government is committed to reforming oral healthcare services, including the DTSS, through the implementation of the service reforms set out in the National Oral Health Policy (NOHP), Smile Agus Sláinte. The Policy also contains a range of strategic workforce planning actions to increase national workforce capacity, in support of improving patient access to care. The Programme for Government contains commitments to implement the National Oral Health Policy, reform oral healthcare services for medical card holders and address workforce capacity.  The implementation plan for the first phase of the Policy is currently being finalised by my Department and the HSE. The plan includes reform of services for adult medical card holders among the initial priorities. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 583. Deputy Mattie McGrath asked the Minister for Health if her Department recognises the severe consequences of maintaining the dental treatment services scheme at its current level which is clearly underfunded; the other area of healthcare that expects practitioners to deliver treatment at a loss; if she plans for dentists to continue participating under such conditions; and if she will make a statement on the matter. [67697/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_519",
          "debateSectionId": "dbsect_519",
          "showAs": "Dental Services ",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_519.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_583",
        "questionNumber": 583
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 584. Deputy Mattie McGrath asked the Minister for Health the reimbursement costs for all procedures under the dental treatment services scheme; the average actual costs of same treatments; if her Department has reviewed the average laboratory costs in relation to the payments made to dentists under the scheme; and if she will make a statement on the matter. [67698/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_520",
          "debateSectionId": "dbsect_520",
          "showAs": "Dental Services ",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_520.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_584",
        "questionNumber": 584
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 639. Deputy Mattie McGrath asked the Minister for Health the number of babies born alive after an abortion procedure at 24-weeks' gestation or later; the number of these cases which involved babies diagnosed with major congenital anomalies; the number of babies born alive after abortion earlier than 24-weeks' gestation; the number of them which had been diagnosed with major congenital anomalies, from 2022 to date in 2025, by year, in tabular form; and if she will make a statement on the matter. [68011/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_573",
          "debateSectionId": "dbsect_573",
          "showAs": "Abortion Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_573.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_639",
        "questionNumber": 639
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  As the Deputy's question relates to service matters, we have referred it to the HSE for direct reply. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 640. Deputy Mattie McGrath asked the Minister for Health the number of abortion cases in which feticide was carried out in each of the years from 2019, to date in 2025, in tabular form; and if she will make a statement on the matter. [68012/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_574",
          "debateSectionId": "dbsect_574",
          "showAs": "Abortion Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_574.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_640",
        "questionNumber": 640
      },
      "contextDate": "2025-12-02"
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 171. Deputy Mattie McGrath asked the Minister for Education and Youth when a school bus ticket will be awarded to a student (details supplied); and if she will make a statement on the matter. [66391/25] ",
        "answerText": " Minister of State at the Department of Education and Youth  The School Transport Scheme is a significant operation managed by Bus Éireann on behalf of the Department of Education and Youth.  Under the current terms of the School Transport Schemes, children are eligible for transport at post primary level where they reside not less than 4.8 kilometres from and are attending their nearest post primary school/education centre as determined by the department/Bus Éireann, having regard to ethos and language.  Eligible children who complete the application process and pay or enter their medical card details on time will get a seat on a school bus service, if a service is available.  Children who are not eligible for school transport but complete the application and pay or enter their medical card details on time will be considered for any spare seats available after eligible children have been accommodated. These spare seats are called concessionary seats.  Bus Éireann has advised that the pupil in question applied on time however, they entered their medical card details late on 7 October 2025. The bus is currently full to capacity and there are no seats available at present.  With regards to ticket usage, it is recognised that all pupils issued with tickets will not travel every morning and every evening. In addition, certain after school activities may also result in pupils not travelling on certain days. Bus Éireann organises for vehicles to be full to capacity with tickets based on applications received and based on the seating capacity of the vehicle. For safety reasons, it is not possible to issue additional tickets over and above the seating capacity of the vehicle which could result in a potential overload situation arising and all pupils not being carried on the service. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_171",
        "debateSection": {
          "showAs": "School Transport",
          "debateSectionId": "dbsect_160",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_160.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_160"
        },
        "date": "2025-11-26",
        "questionNumber": 171,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Mattie McGrath",
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14"
        },
        "questionType": "written",
        "to": {
          "showAs": "Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 173. Deputy Mattie McGrath asked the Minister for Education and Youth if the school transport scheme will be amended to support students who do not travel to their most local mixed post-primary school, but instead choose to attend a single-sex school, as is their right; and if she will make a statement on the matter. [66433/25] ",
        "answerText": " Minister of State at the Department of Education and Youth  The School Transport Scheme is a significant operation managed by Bus Éireann on behalf of the Department of Education and Youth  The scheme is made up of three separate schemes, the school transport scheme for primary, post primary and for children with special educational needs. Transport is also provided for children who have arrived in Ireland from Ukraine and those residing in IPAS/EROC centres.  Under the terms of the School Transport Scheme, children are eligible for transport at primary level where they reside not less than 3.2 kilometres from and are attending their nearest national school, and at post primary level where they reside not less than 4.8 kilometres from and are attending their nearest post primary school/education centre as determined by the Department/Bus Éireann, having regard to ethos and language.  With regard to ethos, the Department of Education and Youth classifies schools as being one of the following - of religious denomination, interdenominational or multidenominational.  At Post Primary level, eligibility for school transport is to the nearest post primary school/education centre subject to limited exceptions. The scheme has regard to ethos and language in that exceptions to eligibility for the scheme are considered in the case of minority religions and the Irish language. The scheme at Post Primary level provides transport for children of minority religion for whom there is less choice of school given the dispersed nature of these schools and also facilitates the viability of those minority religion schools.  The School Transport 2030 report was published in early 2024 following a comprehensive analysis and review of the scheme as it currently operates. The recommended changes to the future operation of the schemes include expansion of the current eligibility criteria, addressing current operational challenges and moving towards better integration with public transport to ensure the best value for money to the Exchequer. It is proposed to expand access to the scheme so that an additional 100,000 pupils can be carried by 2030.  A phased implementation of the review’s recommendations began at the start of the 2024/2025 school year where the Department began testing the feasibility of a number of approaches through a series of pilot programmes; these pilot programmes are held in conjunction with the National Transport Authority, the Department of Transport and Bus Éireann.  A total of 14 pilot projects are underway in the current school year. These pilots are being evaluated to provide valuable insights into the impact of increased demand on the scheme, the potential for integrating public transport with school transport services, and opportunities to promote more sustainable modes of transport.  Existing pilots are continuing for this school year. They are being monitored over the year and a further evaluation will take place at the end of the 2025/2026 school year. The findings from these evaluations will guide the planning and implementation needed for a national roll-out of a revised School Transport Scheme.  Work is also underway to identify where further pilot programmes may be conducted. A number of approaches are being examined including the use of a Geographic Information System (GIS) to identify how many additional children would become eligible and where they are located. A digital mapping project of all existing school bus routes has been developed and there is ongoing collaboration with the Department of Transport, Bus Éireann and the National Transport Authority in regard to planned expansion of public transport routes to explore where integration may be possible.  Implementation of the recommendations of the review will continue to be planned subject to resources being available to meet the increased demand. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_173",
        "debateSection": {
          "showAs": "School Transport",
          "debateSectionId": "dbsect_162",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_162.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_162"
        },
        "date": "2025-11-26",
        "questionNumber": 173,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Mattie McGrath",
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14"
        },
        "questionType": "written",
        "to": {
          "showAs": "Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14"
        },
        "showAs": " 142. Deputy Mattie McGrath asked the Minister for Education and Youth the details of the agreement made with the industrial school hunger strikers in recognition of the State’s responsibility for their treatment in residential institutions; and to provide the full extent of supports that will be made available to those who seek redress from same. [64173/25] ",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_115.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_115",
          "showAs": "Residential Institutions",
          "debateSectionId": "dbsect_115"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_142",
        "answerText": " Minister for Education and Youth  The Taoiseach and I met again with the group referred to by the Deputy on Monday 10 November. This followed on from previous meetings held and the mediation process that had been put in place. We further discussed the issues of concern to the survivors and noted progress that had been made in seeking a resolution. The group was provided with a letter from the Taoiseach which outlined the position.  Following this the group agreed to cease their hunger strike protest and to use the mediation process to work through the detail the various issues. The aim is to conclude that process as soon as possible. ",
        "questionNumber": 142
      },
      "contextDate": "2025-11-19"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Mattie-McGrath.D.2007-06-14",
          "showAs": "Mattie McGrath",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14"
        },
        "showAs": " 328. Deputy Mattie McGrath asked the Minister for Children, Disability and Equality her plans to ensure that the two SLT posts which will become vacant in Clonmel CDNT due to maternity leaves which will be filled as a matter of urgency as the vacancy rate for posts in this CDNT Team will fall to over 70% vacancy; if she is aware that there are already 11 vacancies within this CDNT team out of 18 WTE; the specific action she will take to address this huge level of vacancies; the recruitment campaigns carried out for each of the vacant posts and the effort put in to filling these posts; and if she will make a statement on the matter. [64207/25] ",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_209.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_209",
          "showAs": "Disability Services",
          "debateSectionId": "dbsect_209"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_328",
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 328
      },
      "contextDate": "2025-11-19"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 395,
        "showAs": " 395. Deputy Mattie McGrath asked the Minister for Enterprise, Tourism and Employment the assessment that has been carried out on the potential impact of the Short-Term Letting and Tourism Bill 2025 on small-scale rural tourism enterprises, particularly those operating as part of farm diversification strategies; and if he will make a statement on the matter. [62726/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Enterprise"
        },
        "by": {
          "showAs": "Mattie McGrath",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mattie-McGrath.D.2007-06-14",
          "memberCode": "Mattie-McGrath.D.2007-06-14"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_395",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_334",
          "showAs": "Tourism Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_334",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_334.xml"
            },
            "pdf": null
          }
        },
        "answerText": "",
        "date": "2025-11-18"
      }
    }
  ]
}