{
  "head": {
    "counts": {
      "questionCount": 226,
      "resultCount": 226
    }
  },
  "results": [
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_697.xml"
            }
          },
          "debateSectionId": "dbsect_697",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_697",
          "showAs": "Inland Fisheries"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_792",
        "to": {
          "roleType": null,
          "showAs": "Communications",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 792,
        "showAs": " 792. Deputy Hildegarde Naughton asked the Minister for Communications, Climate Action and Environment the reason the Weir and the High Bank Beat fisheries in Galway city remain closed when all other fisheries are open; and if he will make a statement on the matter. [10923/20] ",
        "answerText": " Minister of State at the Department of Communications, Climate Action and Environment  I am happy to confirm that the Galway fishery has reopened on a pilot basis.  The Deputy will appreciate that a small number of fisheries, including the High Bank Beat in Galway, remained closed when the angling guidelines were updated with effect from 6 May, as they presented a significant challenge in terms of appropriate social distancing in line with NPHET advice.  Inland Fisheries Ireland (IFI) have, however, been proactive in this regard and had made proposals for the re-opening of these fisheries, including Galway, based on protocols ensuring consistency with the Government's Roadmap for the Reopening of Society and Business, NPHET advice and National measures in relation to Covid-19.  My Department and IFI has recently received the appropriate advice to support reopening of these fisheries  I have already provided to the Deputy full details of the protocols which apply to these fisheries.  Matters will be reviewed further on 29 June. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_314.xml"
            }
          },
          "debateSectionId": "dbsect_314",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_314",
          "showAs": "Health Screening Programmes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_350",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 350,
        "showAs": " 350. Deputy Hildegarde Naughton asked the Minister for Health if his Department or the HSE has conducted a risk assessment in relation to the indefinite postponement of breast and cervical screening due to Covid-19; if such an assessment has been conducted; if so, if it will be published; and if he will make a statement on the matter. [9882/20] ",
        "answerText": " Minister for Health  As this is a service matter, it has been referred to the Health Service Executive for attention and direct reply to the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_736.xml"
            }
          },
          "debateSectionId": "dbsect_736",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_736",
          "showAs": "Communications Market Regulation"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_823",
        "to": {
          "roleType": null,
          "showAs": "Communications",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 823,
        "showAs": " 823. Deputy Hildegarde Naughton asked the Minister for Communications, Climate Action and Environment if his attention has been drawn to the volume of complaints about the customer service of a company (details supplied) during the Covid-19 crisis; if he has discussed the matter with the Commission for Communications Regulation; his views on whether prompt customer service regarding broadband is particularly important while persons are working from home; and if he will make a statement on the matter. [9056/20] ",
        "answerText": " Minister for Communications, Climate Action and Environment  Telecommunications service providers, are regulated by the Commission for Communications Regulation (ComReg), which operates independently of this Department.  The telecommunications regulatory framework, which ComReg implements, requires each telecommunications services provider to establish and operate a code of practice, including requirements for complaint handling.  Service Providers must implement these measures, at a minimum, to assist consumers (including businesses) when they need to contact them with a complaint. A copy of the code of practice, which includes the three ways in which consumers can contact service providers, can be accessed at https://www.comreg.ie/code-practice-handling-complaints/  Any operator failing to comply with any of these requirements is a matter to be pursued by ComReg.  I recognise how vital telecommunications services are to citizens for so many aspects of their daily lives, including for working and studying from home. Officials from my Department have been engaging intensively with ComReg and with the telecommunications industry in this regard.  As the Deputy may be aware, on 15 April 2020, I announced that all major telecommunications providers have committed to a number of measures to help people stay in touch and work from home during Covid-19, including: 1 - Any fixed broadband customers who do not have unlimited usage already as standard will  be given the opportunity, if they require, to upgrade their package (which may be on a temporary basis), with their current service provider; 2 -Any customer who does not have fixed broadband and who relies solely on mobile access to the Internet will have the opportunity to avail of affordable unlimited mobile data access/package from their service provider; 3 - Fair usage policies will not be automatically applied to unlimited fixed and mobile data packages; 4 - Service providers may implement appropriate permitted traffic management measures to avoid network congestion; 5 - Access to healthcare and educational resource websites identified by the Government will be zero-rated for all customers where technically feasible; 6 - So that customers can remain connected during the crisis, service providers will engage with any customer that contacts them who is in financial difficulty as a result of Covid-19 and has difficulty paying their bills to agree the best way of keeping them connected to voice and data; 7 - Service Providers will work with ComReg in the event of complaints raised to ComReg by consumers, who consider they are not being treated in accordance with these commitments.  The commitments will remain available to consumers until 30 June 2020 and will be reviewed in advance of that date, if needed.  As mentioned above, Service Providers have committed to working with ComReg in the event of complaints raised to ComReg by consumers, who consider they are not being treated in accordance with Covid-19 commitments. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_772.xml"
            }
          },
          "debateSectionId": "dbsect_772",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_772",
          "showAs": "Covid-19 Pandemic"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_894",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 894,
        "showAs": " 894. Deputy Hildegarde Naughton asked the Minister for Transport, Tourism and Sport if his attention has been drawn to the fact that some insurance companies consider the erection of Covid-19 protective screens in vehicles as vehicle modification thus warranting the loss of cover; if his attention has been further drawn to the fact that a directive from the National Transport Authority would negate this difficulty; if he will direct the NTA to issue directions to owners of small public service vehicles about making them Covid-19 safe; and if he will make a statement on the matter. [8660/20] ",
        "answerText": " Minister for Transport, Tourism and Sport (Shane Ross)  I propose to take Questions Nos. 864, 867, 894, 962, 974 and 976 together.  In recognition of the economic, social and logistical importance of the overall transport sector, Government designated it among the essential services to continue during the Covid-19 health emergency. Public transport, including the small public service vehicle (SPSV) industry, remains an important service for those it has continued to carry, including essential workers and those making necessary journeys, and it will continue to play an important role in supporting Government’s Roadmap to Reopening Society and Business in the weeks and months ahead.  That is why we have worked to introduce a wide programme of Government supports for impacted businesses. The range of supports available includes new schemes of wage subsidies, rates waivers, re-start grants, lending facilities, equity injection, and business advisory supports for example. I also note that self-employed owner-operators of SPSVs may avail of the COVID-19 Pandemic Unemployment Payment of €350 a week.  The day-to-day regulation of the small public service vehicle (SPSV) sector is, of course, a matter for the National Transport Authority (NTA) under the provisions of the Taxi Regulation Act 2013.  In its role as regulator, the NTA recognises the very difficult business environment that small public service vehicle (SPSV) operators are now dealing with and, as part of its response to this situation, has published information for the SPSV industry which includes guidelines, based on the latest available public health advice, on measures operators can take to reduce the spread of COVID-19. This document is available on the NTA's website.  The NTA has also taken a number of important actions to reduce the immediate financial burden on SPSV operators. It has extended licences expiring before 12 June 2020 by three months, waived late licence renewal fees, and temporarily relaxed rules around vehicle age limits. The need for further measures will continue to be reviewed in the context of the Government's Roadmap to Reopening Society and Business .  As industry regulator, issues relating to vehicle standards for SPSVs and insurance requirements for SPSVs come within the NTA’s area of responsibility and I have, therefore, forwarded your correspondence to the Authority for consideration and direct reply. Please advise this office if you do not receive a response within 10 working days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_799.xml"
            }
          },
          "debateSectionId": "dbsect_799",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_799",
          "showAs": "Tourism Policy"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_895",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 895,
        "showAs": " 895. Deputy Hildegarde Naughton asked the Minister for Transport, Tourism and Sport the reason no representative from the coach hire or chauffeur drive tourism industry was included in the recently announced Tourism Recovery Taskforce; and if he will make a statement on the matter. [8661/20] ",
        "answerText": " Minister for Transport, Tourism and Sport (Shane Ross)  I propose to take Questions Nos. 895 and 980 together.  The Tourism Recovery Taskforce was established by Minister of State Brendan Griffin and I on 20 May 2020. The purpose of the Taskforce is to prepare a Tourism Recovery Plan for submission to the Ministers which will include a set of recommendations on how best the Irish tourism sector can adapt and recover in the changed tourism environment as a result of the Covid-19 crisis. The plan will identify priority aims, key enablers and market opportunities for the sector for the period 2020-2023. The Taskforce may consult with stakeholders to inform its deliberations and will report back later this year.  The Taskforce is made up of an independent chairperson and 13 other members from a broad spectrum of backgrounds including tourism policy, tourism enterprise, international, private and public service. The Minister of State and I selected members on the basis of each person's capacity to bring his/her personal knowledge, skills, experience, competence, capability, strategic leadership and ideas to the work of the group. We have appointed individuals who, together, will work for the good of Irish Tourism as a whole. I can assure the Deputy that in the same manner that no sector was deliberately included, no sector was deliberately excluded.  It is envisaged that the Taskforce will establish working groups to carry out specific tasks and that the Taskforce will undertake a widespread stakeholder consultation process whereby all sectors and interested parties will have an opportunity to provide constructive inputs and innovative ideas on how this vital sector to our economy can adapt and recover in a meaningful and sustainable way. Representatives from the coach hire and chauffeur drive sector will have an opportunity to contribute to the work of the Taskforce in this way.  I should also point out that in addition to the Tourism Recovery Taskforce, there are other fora whereby tourism stakeholders, including representatives from the coach and chauffeur sector, can contribute. Representatives from the sector have been invited to participate in Fáilte Ireland’s Covid Advisory Group which meets on a weekly basis. Furthermore, officials on the Transport side in my Department are in regular contact with the representatives of the coach sector in the context of the difficulties its members are facing as a result of the Covid crisis. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_1072.xml"
            }
          },
          "debateSectionId": "dbsect_1072",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_1072",
          "showAs": "Rental Sector"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_1195",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1195,
        "showAs": " 1195. Deputy Hildegarde Naughton asked the Minister for Housing, Planning and Local Government if the temporary ban on evictions will be extended if deemed necessary; his plans to review a putative expansion to take account of individual situations (details supplied); and if he will make a statement on the matter. [8846/20] ",
        "answerText": " Minister for Housing, Planning and Local Government  With effect from 27 March 2020, new emergency measures were introduced into law to protect tenants during the COVID-19 emergency period. Rent increases are prohibited and tenants cannot be forced to leave their rental accommodation, other than in exceptional circumstances, during the COVID-19 emergency period. Initially, these emergency laws will last for a period of 3 months, but they may be extended if the Government considers it is necessary.  Under the legislation, the process for any extension of the 3 month period involves the Minister for Housing, Planning and Local Government requesting the Government to make an Order, having consulted with the Minister for Health and with the consent of the Minister for Public Expenditure and Reform.  The Government must consider it appropriate and be satisfied that it is in the public interest to extend the emergency period having regard to:  - the threat to public health;  - the highly contagious nature of COVID-19; and  - the need to restrict the movement of persons to prevent the spread of COVID-19.  The consideration of whether to request the Government to make an Order to extend the emergency period is ongoing and any request to Government will be made at the appropriate time and in accordance with the Emergency Measures in the Public Interest (Covid-19) Act 2020.  It is not possible to amend the provisions of the Act at this time. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2020-05-27",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/mul@/dbsect_241.xml"
            }
          },
          "debateSectionId": "dbsect_241",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/dbsect_241",
          "showAs": "Special Educational Needs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-27/pq_272",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 272,
        "showAs": " 272. Deputy Hildegarde Naughton asked the Minister for Education and Skills when he envisages the resumption of school based learning services for children and young adults with special needs. [8000/20] ",
        "answerText": " Minister for Education and Skills  On the 1st May 2020, the Taoiseach announced as part of the \"Roadmap for Reopening Society and Business\" that schools will commence opening on a phased basis at the beginning of the 2020/2021 academic year.  My Department is currently working with the Education Partners and relevant stakeholders in planning for this re-opening which will be based on public health advice. As part of this engagement, each of the education partners were given the opportunity to outline the key issues that they would like to have considered in the context of re-opening schools.  The issues raised by the education partners will now be worked through in detail as part of the development of the roadmap for reopening schools.  A core objective will be to ensure that schools and other education settings can re-open and operate in a safe manner that is consistent with public health advice.  In the interim, my Department has provided a range of support and guidance for schools on how to provide for the continuing education for pupils over the current school closure period.  Supports are provided to schools and teachers engaged in distance learning and these are available at https://www.education.ie/en/covid-19/#14   In addition to the general guidance that has been provided for schools, additional support material has also been provided specifically on how schools should provide for the continuity of education for children with special educational needs. This guidance is available at:   https://www.education.ie/en/Schools-Colleges/Information/National-Emergencies-Public-Health-Issues/guidance-continuity-of-schooling-supporting-pupils-with-sen-primary.pdf    https://www.education.ie/en/Schools-Colleges/Information/National-Emergencies-Public-Health-Issues/guidance-continuity-of-schooling-supporting-students-with-sen-post-primary.pdf   The guidance notes that there is a particular need for pupils with special educational needs (SEN) to have regular, ongoing schooling. While all pupils need to be supported to maintain their engagement in learning, those with SEN are among those who need most support at this time. Examples of strategies and measures to ensure that the needs of pupils with SEN are catered for, are provided in the guidance documents and a range of resources are also identified for parents.  It sets out the role of schools and teachers in engaging with pupils with SEN and the role of teachers and school leaders to support such pupils. It advises schools as to how best to keep in touch with parents and guardians and how to keep pupils with SEN safe and engaged in the distance learning environment.  The guidance sets out the role of the special education teacher to support children with special educational needs at this time. It notes that the special education teacher’s knowledge of their pupils’ priority learning needs and agreed targets, as outlined in the pupil support file, will enable them to work with parents and guardians to choose appropriate supports in a remote learning environment.  Special Education Teachers (SETs) are asked to carefully examine how progress on the existing learning targets in student support plans can be reasonably extended by home learning. They are asked to use this knowledge to communicate with the pupils and their parents and guardians and to establish what methods will work best to achieve continuity of learning for the pupils.  The National Council for Special Education (NCSE) is also providing a range of online resources for parents and teachers to support home learning for children with special educational needs during the Covid 19 restrictions.  In addition to the normal supports, the NCSE is providing online resources for children with Special Educational Needs who are at home as a result of the schools’ closure.  Supports provided include those relating to general learning and difficulties for pupils with SEN, Curriculum support, speech language and communication, occupational therapy support, guidance around behaviour, and learning and rresources on ‘Visiting Teachers Support’ for a teacher who teaches children with sensory impairment  Details of the full range of supports that the NCSE provides for teachers and parents is available at:   https://ncse.ie/online-resources   The Department of Education and Skills’ NEPS psychologists have also developed advice and resources for young people to manage and stay well when schools are closed. The NEPS advice & resources for keeping children and young people well during Covid-19 are available at https://www.education.ie/covid19/wellbeing/   Guidelines for continued provision of Guidance Counselling and resources available to support practice is available at https://www.education.ie/en/Schools-Colleges/Information/Post-Primary-School-Policies/Policies/Guidance-Plan.html   Guidance for parents of primary school pupils, which sets out what they should expect in relation to engagement in distance learning from schools, and how they can support their child in a home schooling environment is also available at:   https://www.education.ie/en/Schools-Colleges/Information/continuity-of-schooling/continuity-of-schooling.html   I also recently announced that a special €10 million fund is being made available to support the purchase of technology and devices for disadvantaged students, including students with special educational needs.  This is additional to the latest round of funding for ICT under the Digital Strategy for Schools whereby €40m grant funding will be distributed in the coming weeks to eligible. €10m additional funding is also now issuing to schools to support children and young people who are at risk of educational disadvantage during the period of school closures.  While recognising the difficulty that school closure has had for parents and pupils, particularly in relation to pupils with special educational needs, my Department will continue to support and encourage schools to provide as much continuity of education as possible for such pupils, while continuing to engage with public health officials and stakeholders in relation to when schools may re-open and operate in a safe manner that is consistent with public health advice. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-27",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2020-05-27",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/mul@/dbsect_432.xml"
            }
          },
          "debateSectionId": "dbsect_432",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/dbsect_432",
          "showAs": "Covid-19 Pandemic"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-27/pq_541",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 541,
        "showAs": " 541. Deputy Hildegarde Naughton asked the Minister for Health the number of persons that constitute a small wedding; the number of persons that constitute a large wedding under the Roadmap for Reopening Society and Business; the social distancing rules that apply to a large wedding in view of the uncertainty in relation to persons wishing to marry; and if he will make a statement on the matter. [7430/20] ",
        "answerText": " Minister for Health  I propose to take Questions Nos. 496, 498, 500, 539, 541 and 610 together.  The Government’s Roadmap for Reopening Society & Business, published on 1 May 2020, sets out an indicative path to the easing of COVID 19 restrictions and other actions in order to facilitate the reopening Ireland’s society and economy in a phased manner. The Roadmap specifies that decisions in relation to which actions will be taken and which public health measures might be lifted will be made in accordance with the Framework for Future Decision-Making which is as follows:  1. Before each Government consideration of the easing of restrictions, the Department of Health will provide a report to the Government regarding the following on/off trigger criteria:  a. The latest data regarding the progression of the disease,  b. The capacity and resilience of the health service in terms of hospital and ICU occupancy,  c. The capacity of the programme of sampling, testing and contact tracing,  d. The ability to shield and care for at risk groups,  e. An assessment of the risk of secondary morbidity and mortality as a consequence of the restrictions.  2. It will also provide risk-based public health advice on what measures could be modified in the next period.  3. The Government would then consider what restrictions could be lifted, having regard to the advice of the Department of Health as well as other social and economic considerations, e.g. the potential for increased employment, relative benefits for citizens and businesses, improving national morale and wellbeing etc.  4. It is acknowledged that there is also an ongoing possibility that restrictions could be re-imposed and this process will be carried out on an ongoing basis once every 3 weeks.  As is clear from the framework, it is the Government rather than I or my Department that will decide on any modifications to the current public health measures in place and those decisions will be informed by the status of the on/off trigger criteria and the public health advice received at the time that a decision is being made.  My Department will not be providing detailed guidance in relation to weddings.  Guidance in relation to events in specific sectors of the economy should in the first instance be sought from the Government Department with responsibility for that sector. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-27",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2020-05-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/mul@/dbsect_145.xml"
            }
          },
          "debateSectionId": "dbsect_145",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/dbsect_145",
          "showAs": "State Examinations"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-20/pq_226",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 226,
        "showAs": " 226. Deputy Hildegarde Naughton asked the Minister for Education and Skills the process that has been put in place to grade leaving certificate students that study subjects not on an individual school curriculum, that is, applied maths, that study subjects without being enrolled in a secondary school, or are mature students in view of the cancellation of the leaving certificate 2020; his views on whether they should not be disenfranchised; and if he will make a statement on the matter. [6104/20] ",
        "answerText": " Minister for Education and Skills  I propose to take Questions Nos. 159, 226, 240, 251, 253, 257, 268, 274, 282, 284, 298, 304, 311, 315, 328, 330, 355, 364 and 391 together.  Where a student is studying one or more subjects outside of a recognised school, my Department will be flexible in accepting estimated marks and rankings from other schools or colleges, and will look at this issue on a case-by-case basis. In general, I can say that, provided an estimated mark and ranking can be generated from a teacher in a way that is fair to all candidates, my Department will seek to provide a calculated grade. Students will be able to use this calculated grade in the same way as a Leaving Certificate grade to satisfy minimum entry requirements.  For students in receipt of home tuition with an association to a recognised school, the guidance will provide information for school authorities to engage with the home tutor in arriving at a decision. Whether a valid estimate of performance can be provided will depend on whether the home tutor is a registered teacher and where the school is satisfied with the evidence used to support the judgment.  If a student has moved school recently and the length of time is such that the teacher considers that do not have enough evidence to make a sound judgement, then the teacher should consult school management about acquiring additional information form the student’s previous school.  There are 2,858 external candidates entered to sit the Leaving Certificate exams for 2020.  A significant number of these candidates are studying in an alternative setting such as a private college. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-20",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2020-05-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/mul@/dbsect_354.xml"
            }
          },
          "debateSectionId": "dbsect_354",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/dbsect_354",
          "showAs": "Citizenship Ceremonies"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-20/pq_434",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 434,
        "showAs": " 434. Deputy Hildegarde Naughton asked the Minister for Justice and Equality if he will consider holding postponed citizenship ceremonies online in view of the restrictions due to Covid-19; and if he will make a statement on the matter. [5616/20] ",
        "answerText": " Minister for Justice and Equality  Due to the current Covid-19 pandemic, the next scheduled citizenship ceremonies for Friday 3 July 2020, at the INEC in Killarney have had to be postponed.  As the Deputy will be aware, citizenship ceremonies were first introduced in 2011 in order to mark such a significant and important event in a solemn, dignified and appropriate manner. Since then, 151 ceremonies have taken place at various venues throughout the country at which 100,000 applicants have received their certificates of naturalisation.  My officials are currently exploring alternative options to ensure these events are delivered in the dignified and solemn manner appropriate to such an important milestone. It is also essential that any arrangements put in place satisfy the relevant statutory requirements while ensuring the event is a meaningful experience for participants.  Apart from satisfying the relevant criteria under the Irish Nationality and Citizenship Act 1956, as amended, each applicant must also take an oath of fidelity to the State at the ceremony, administered by a Presiding Officer, normally a retired member of the Judiciary.  All options being considered to facilitate the delivery of citizenship ceremonies will be in a manner that protects public health, complies with current restrictions and guidelines including social distancing protocols and prioritise the safety and wellbeing of participants: applicants, their guests, my officials, the judge and venue staff.  Further updates will be provided by way of a ministerial statement and on the Immigration Service website when available, and I would encourage the Deputy to view our updates on the Immigration Service website at: http://www.inis.gov.ie/en/INIS/Pages/COVID-19-updates-and-announcements ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-20",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2020-05-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/mul@/dbsect_559.xml"
            }
          },
          "debateSectionId": "dbsect_559",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/dbsect_559",
          "showAs": "Dental Services "
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-20/pq_667",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 667,
        "showAs": " 667. Deputy Hildegarde Naughton asked the Minister for Health the provisions being made to provide dental surgeries with PPE; if consideration has been given to allowing dentists to buy PPE VAT free; and if he will make a statement on the matter. [5617/20] ",
        "answerText": " Minister for Health  A national approach to the supply of Personal Protective Equipment (PPE) for the Public Dental Service of the HSE has been initiated.  Dentists contracted by the HSE under the Dental Treatment Services Scheme can apply to the HSE for PPE. Additional PPE, above the normal PPE used in dentistry, may currently be required in certain instances depending on the occupational risk assessment of the dentist. However, the Dental Council is deliberating further on this and definitive clarification is awaited as to if and when such PPE may be required.  Matters concerning VAT rates are the responsibility of the Minister for Finance. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-20",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2020-05-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/mul@/dbsect_610.xml"
            }
          },
          "debateSectionId": "dbsect_610",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/dbsect_610",
          "showAs": "Maternity Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-20/pq_720",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 720,
        "showAs": " 720. Deputy Hildegarde Naughton asked the Minister for Health the reason women in the Saolta Hospital Group are being allegedly discriminated against in relation to being allowed a partner attend their c-section birth; if his attention has been drawn to the fact that no partner is allowed into theatre to attend a c-section birth in University Hospital Galway whereas they are in University Hospital Castlebar; his views on whether the practice is acceptable; and if he will make a statement on the matter. [6100/20] ",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to you directly as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-20",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2020-05-13",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-13/writtens/mul@/dbsect_1150.xml"
            }
          },
          "debateSectionId": "dbsect_1150",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-13/writtens/dbsect_1150",
          "showAs": "Local Authority Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-13/pq_1230",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1230,
        "showAs": " 1230. Deputy Hildegarde Naughton asked the Minister for Housing, Planning and Local Government if his attention has been drawn to the fact that the lighting on Inis Oírr pier, Aran Islands, County Galway has not been working for several weeks; if a request has been received from Galway County Council for funding in this regard; and if he will make a statement on the matter. [4121/20] ",
        "answerText": " Minister for Housing, Planning and Local Government  My Department does not allocate specific funding towards the management and maintenance of public lighting as this is a matter for each individual local authority. Galway County Council, being the Harbour Authority for Inis Oírr Harbour, is responsible for the maintenance of the lighting at the pier. I, as Minister, have no function in this regard. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-13",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-12-17",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-17/writtens/mul@/dbsect_542.xml"
            }
          },
          "debateSectionId": "dbsect_542",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-17/writtens/dbsect_542",
          "showAs": "Sports Capital Programme Data"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-17/pq_584",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 584,
        "showAs": " 584. Deputy Hildegarde Naughton asked the Minister for Transport, Tourism and Sport the allocations made to organisations in Oranmore, Maree, Claregalway and Clarinbridge, County Galway, under the sports capital programme since 2011; the allocations per organisation; and if he will make a statement on the matter. [52801/19] ",
        "answerText": " Minister of State at the Department of Transport, Tourism and Sport  Details of all allocations under the Sports Capital Programme since 2000 are published on my Department's website on a county basis at   https://www.gov.ie/en/collection/471ed5-sports-capital-allocations/ ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-17",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-12-12",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-12/writtens/mul@/dbsect_42.xml"
            }
          },
          "debateSectionId": "dbsect_42",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-12/writtens/dbsect_42",
          "showAs": "European Capital of Culture"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-12/pq_8",
        "to": {
          "roleType": null,
          "showAs": "Culture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 8,
        "showAs": " 8. Deputy Hildegarde Naughton asked the Minister for Culture, Heritage and the Gaeltacht the status of preparations for the launch of Galway 2020; the consideration given to the legacy of the project; and if she will make a statement on the matter. [51889/19] ",
        "answerText": " Minister for Culture, Heritage and the Gaeltacht  The Galway 2020 cultural programme was launched on 18 September last and I was delighted to officiate at the occasion. More recently, following the recent third and final review by the EU Expert Monitoring Panel, Galway 2020 was also recommended for the prestigious Melina Mercouri Prize of €1.5 million. The EU Commission will make an announcement on the award of the Prize early next year.  Under the terms of the Performance Delivery Agreement between my Department and Galway 2020, a quarterly financial and management report is received in advance of a formal monitoring meeting between the Department and senior management in Galway 2020. All aspects of Galway 2020 European Capital of Culture are discussed at both the monitoring meetings and in regular communication that takes place between my Department and Galway 2020.  The legacy of Galway 2020 it is considered a very important aspect by all the main funders. The legacy sub-committee of the board of Galway 2020 European Capital of Culture was proposed and set-up at a board meeting in July 2019. The terms of reference of the committee is to advise the board on the best model to deliver on legacy of Galway 2020. I have been advised that the legacy sub-committee of the Board of Galway 2020 has met once since being established and has reported back to the most recent meeting of the Board. No formal reports have been published as of yet.  On 11 September last, senior officials from my Department met with the Chair and Chief Executive of Galway 2020 for a general update on the project in advance of the launch of the Cultural Programme on 18 September, and to complete the quarter two monitoring meeting for this year. Legacy plans and the work of the legacy sub-committee was one of the items discussed at the meeting, and my Department and Galway 2020 agreed to engage further on the work of the legacy sub-committee as it progresses.  It should be noted that legacy plans have been, and will continue to be part of the normal quarterly monitoring meetings between the Department and Galway 2020, as well as an agenda item at regular meetings between the Department and the Chief Executives of Galway City Council and Galway County Council.  As we are now a little over 50 days out from the Opening Ceremony for Galway 2020, I am looking forward to a truly memorable, once in a lifetime year for all concerned. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-12",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-11-06",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-06/writtens/mul@/dbsect_52.xml"
            }
          },
          "debateSectionId": "dbsect_52",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-06/writtens/dbsect_52",
          "showAs": "Wildlife Protection"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-11-06/pq_38",
        "to": {
          "roleType": null,
          "showAs": "Culture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 38,
        "showAs": " 38. Deputy Hildegarde Naughton asked the Minister for Culture, Heritage and the Gaeltacht the activities of the National Parks and Wildlife Service in combatting wildlife crime; the successes in counties Galway and Mayo in respect of same; and if she will make a statement on the matter. [45444/19] ",
        "answerText": " Minister for Culture, Heritage and the Gaeltacht  The Wildlife Acts 1976 to 2018 are the primary statutes designed to afford protection to the various species in the State and which set out the framework for dealing with wildlife crime. In addition, the European Communities (Birds and Natural Habitats) Regulations 2011 include provisions affording strict protection to a number of species and habitats.  Wildlife crime takes many forms ranging from persecution of badgers, illegal hunting of deer species, illegal hunting of hares with packs of dogs generally known as lurchers, trapping of wild birds such as native finches for illegal trade, wilfully disturbing or destroying the eggs or nests of wild birds, poisoning of raptor species and the illegal cutting of hedges during the nesting season for birds.  While much wildlife crime is local we should not underestimate the dangers involved in investigating it as many perpetrators have links with other more serious crime.  Within my Department, the National Parks and Wildlife Service has responsibility for the protection and conservation of Ireland’s natural heritage, including species protection and biodiversity at national level. The NPWS is therefore dedicated to looking after our species and habitats and NPWS frontline conservation Rangers are deployed through a regional structure. Some of their work entails scientific research and survey work and the monitoring of compliance with national and European law in relation to nature conservation and wildlife crime across the country. The team also conduct patrols and site visits to enforce the various provisions of national and EU legislation and investigate reports of breaches of legislation including the various types of wildlife crime I have already described. My Department works closely with An Garda Síochána who are also specifically empowered under the Acts to investigate alleged wildlife crime offences and to prosecute as they see fit.  In the period 2013 to date in 2019 some 80 prosecutions were taken by my Department for breaches of the Wildlife Acts. As far as counties Galway and Mayo are concerned thirteen individuals have been convicted of breaches of the Wildlife Acts since 2013 in these two counties. In fact there were two recent successful prosecutions this year for illegal hare lurching by individuals in county Mayo. While bringing perpetrators of crime to justice is important, the success of dealing with wildlife crime cannot be judged on this alone, as ensuring compliance in the first instance is clearly of critical importance.  Given the concerns that I have surrounding the apparent widespread nature of wildlife crime, an internal Wildlife Crime Group staffed by field staff and senior Departmental officials which meets regularly most recently last week. The Wildlife Crime Group has pursued many important initiatives including the organisation of a major Wildlife Crime Conference last year which was attended by An Garda Síochána and representatives from organisations in Britain and Northern Ireland dealing with wildlife crime.  I am also committed to ensuring that we continue our covert actions with other agencies, including An Garda Síochána and the I.S.P.C.A to counteract these illegal activities. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-11-06",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-11-06",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-06/writtens/mul@/dbsect_62.xml"
            }
          },
          "debateSectionId": "dbsect_62",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-11-06/writtens/dbsect_62",
          "showAs": "City of Culture Initiative"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-11-06/pq_49",
        "to": {
          "roleType": null,
          "showAs": "Culture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 49,
        "showAs": " 49. Deputy Hildegarde Naughton asked the Minister for Culture, Heritage and the Gaeltacht the status of progress in respect of Galway 2020; and if she will make a statement on the matter. [45443/19] ",
        "answerText": " Minister for Culture, Heritage and the Gaeltacht  I was delighted to officiate at the launch of the Galway 2020 cultural programme on 18 September last. It was wonderful to see Eyre Square come to life with the large crowd in attendance and the breath-taking performance by composer and musician Anna Mullarkey and the French aerialists Gratte Ciella.  As the Deputy is aware, the cultural programme that was launched that evening is arranged according to the old Celtic calendar with over 1900 events spread over the course of the year, starting with the opening ceremony in the first week of February, which will travel over six days from towns across the county to culminate in the city on 8 February.  Following the recent third and final review by the EU Expert Monitoring Panel, Galway 2020 was also recommended for the prestigious Melina Mercouri Prize of €1.5 million. The EU Commission will make an announcement on the award of the Prize early next year.  Under the terms of the Performance Delivery Agreement between my Department and Galway 2020, a quarterly financial and management report is received in advance of a formal monitoring meeting between the Department and senior management in Galway 2020. All aspects of Galway 2020 European Capital of Culture are discussed at both the monitoring meetings and in regular communication that takes place between my Department and Galway 2020.  At the most recent meeting in September, my Department was advised that the cultural projects are proceeding according to target; the major sponsorship drive is continuing with over the 500 companies contacted and over 130 meetings held; the monitoring and evaluation programme is in place; the volunteer programme is gathering pace; and a sub-committee of the Board has been convened to address the legacy of Galway 2020.  As we are now a little over 100 days out from the Opening Ceremony for Galway 2020, I am looking forward to a truly memorable, once in a lifetime year for all concerned. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-11-06",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-10-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-23/writtens/mul@/dbsect_142.xml"
            }
          },
          "debateSectionId": "dbsect_142",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-23/writtens/dbsect_142",
          "showAs": "Vaccination Programme"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-10-23/pq_158",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 158,
        "showAs": " 158. Deputy Hildegarde Naughton asked the Minister for Health if a general practice which accepts medical card patients is allowed impose an administrative charge of €20 when administering the flu vaccine to a person over 65 years of age who is in possession of a medical card or general practitioner visit card; and if he will make a statement on the matter.  [43748/19] ",
        "answerText": " Minister for Health  The seasonal flu vaccine is recommended for adults in an at-risk group including pregnant women and children aged 10 years or older, who can get the flu vaccine either from a GP or pharmacist. Younger children in an at-risk group can get the flu vaccine from their GP.  The vaccine and consultation are free for those with a medical card or GP visit card, whether provided by a GP or a pharmacist. For those who do not have a medical card or GP visit card, the vaccine is free but they may be charged for a consultation fee. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-10-23",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-10-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/mul@/dbsect_152.xml"
            }
          },
          "debateSectionId": "dbsect_152",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-10-08/writtens/dbsect_152",
          "showAs": "Legislative Reviews"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-10-08/pq_139",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 139,
        "showAs": " 139. Deputy Hildegarde Naughton asked the Minister for Justice and Equality the status of the review his Department is conducting into the effectiveness of the Prohibition of Incitement to Hatred Act 1989; and if he will make a statement on the matter. [40543/19] ",
        "answerText": " Minister for Justice and Equality  My Department is currently reviewing the Prohibition of Incitement to Hatred Act 1989, to determine what amendments are required in order to ensure it is effective and fit for purpose in a modern democracy. The public consultation on the Act which the Deputy is referring to is due to commence shortly and details will be published on my Department's website.  Separately, my Department is undertaking research into hate crime (offences under the general criminal law, such as assault or criminal damage, that are committed with a hate or bias motivation), to learn from the experiences of other jurisdictions who have taken different legislative approaches . That separate research project is well underway. This research will be completed in Q4 of this year and the results will help develop new approaches to ensure hate crime is addressed effectively in Ireland.  Taken together, this work will significantly advance our understanding of what is needed to ensure that legislation in this important area protects and supports those who are targeted by expressions and acts of hatred.  There is widespread public interest in reforming our approach to hate crime in this jurisdiction and this is something I welcome. I will consider the outcomes of all of the exercises which are now taking place in my Department on this subject, and will draw on this evidence to bring forward the necessary proposals for change. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-10-08",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-09-26",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-09-26/writtens/mul@/dbsect_151.xml"
            }
          },
          "debateSectionId": "dbsect_151",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-09-26/writtens/dbsect_151",
          "showAs": "Oireachtas Joint Committee Recommendations"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-09-26/pq_123",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 123,
        "showAs": " 123. Deputy Hildegarde Naughton asked the Minister for Health the progress to date in implementing the recommendations of the Oireachtas Joint Committee on the Eighth Amendment of the Constitution, namely, the provision of exclusion zones and the availability of free contraception; and if he will make a statement on the matter. [39115/19] ",
        "answerText": " Minister for Health  As the Deputy may be aware exclusion zones were not part of the recommendations made by the Joint Committee on the Eighth Amendment of the Constitution, however, it is my intention that people can access termination of pregnancy services safely. I wish to assure women and healthcare staff that there is existing legislation in place to protect them and to protect patients.  My Department and An Garda Síochána have also been closely monitoring the situation since the service commenced in January. I recently met with Garda Commissioner Drew Harris to discuss the issues.  The result of the referendum last year gave the Government a strong mandate to introduce termination of pregnancy services and it remains my priority that the legislation is fully implemented so that all women in Ireland can access these services quickly and easily, without bias or judgment.  I established a Working Group to examine the various policy, regulatory and legislative issues arising in relation to improving access to contraception. The Group has recently held a public consultation exercise and has engaged directly with numerous stakeholders. It is currently preparing a report, which I understand will be submitted for my consideration shortly. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-09-26",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-09-19",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-09-19/writtens/mul@/dbsect_51.xml"
            }
          },
          "debateSectionId": "dbsect_51",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-09-19/writtens/dbsect_51",
          "showAs": "National Parks"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-09-19/pq_33",
        "to": {
          "roleType": null,
          "showAs": "Culture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 33,
        "showAs": " 33. Deputy Hildegarde Naughton asked the Minister for Culture, Heritage and the Gaeltacht the progress being achieved on the development of national parks and reserves, including Connemara National Park, and improving the visitor experience; and if she will make a statement on the matter. [37433/19] ",
        "answerText": " Minister for Culture, Heritage and the Gaeltacht  In January 2017, my Department entered into Strategic Investment Partnership with Fáílte Ireland, aimed at enhancing and promoting the tourism offering at Ireland’s National Parks and also conserving and protecting the natural environments of the National Parks for the enjoyment of future generations. In July of last year, as part of this partnership, we published Experiencing the Wild heart of Ireland – A Tourism Interpretative Masterplan for the National Parks and Nature Reserves.  The plan recommends a suite of capital projects of varying size (from smaller scale interventions such as installation of viewing platforms to larger projects such as the development of new boardwalks and trails, to the construction of new visitor centres). The first such project, a €2.1m investment in Wild Nephin- Ballycroy National Park was announced on the 31st of August, 2018 to develop a continuous 53km walking cycling trail from Newport to Ballycastle on the Wild Atlantic Way through the National Park. The outcome of this project will be an off road continuous cycling and walking trail in challenging terrain which will link the popular Great Western Greenway with the Wild Atlantic Way.  The second project, is an investment of some €1.9m in Connemara National Park. This project will also improve the visitor experience at the Park and focuses on the enhancement of the existing Recreational Trail Network as well as on infrastructure development at Mweelin, including the construction of a new car park, the provision of toilet facilities and the development of a new walking trail. The project includes the development of an additional 10.5 Km of new trails, a children’s natural play area, and a new Lime Kiln Trail to enhance access to more areas of the National Park. Development works have now begun on site. It is envisaged that the project will be completed by the end of 2020.  Under the Rural Regeneration Fund (RRF) 32 projects, dispersed nationally, are being resourced with the total investment relating to the projects at €7,175,000 (75% co-funding from the RRF, with my Department and Fáilte Ireland providing the remaining 25%). The projects are currently underway and funding will go towards the upgrading and development of trails across the Parks and Reserves network, increased visitor facilities and improved signage and branding. Hybrid buses in selected National Parks will be purchased to assist in lowering the carbon footprint of visitor activities. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-09-19",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-09-19",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-09-19/writtens/mul@/dbsect_54.xml"
            }
          },
          "debateSectionId": "dbsect_54",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-09-19/writtens/dbsect_54",
          "showAs": "Natural Heritage Areas"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-09-19/pq_36",
        "to": {
          "roleType": null,
          "showAs": "Culture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 36,
        "showAs": " 36. Deputy Hildegarde Naughton asked the Minister for Culture, Heritage and the Gaeltacht the details of the awarding of funding under the peatlands community engagement scheme 2019;  the number of recipients in counties Galway and Mayo; and if she will make a statement on the matter. [37434/19] ",
        "answerText": " Minister for Culture, Heritage and the Gaeltacht  The Peatlands Community Engagement Scheme aims to encourage local communities, groups, schools and interested parties to engage with my Department in relation to the conservation of raised bog special areas of conservation, natural heritage areas and other raised bog areas and to promote public engagement and awareness of our natural heritage.  On 24 April this year, I announced a call for applications for the 2019 peatlands community engagement scheme. The scheme provides for grant funding of 75% of the total cost of a project. This year, I introduced a phased payment option of the total grant. To facilitate start-up, 30% of the funding for a project may be payable on acceptance of the grant and meeting start up conditions.  Applications were accepted for the scheme up to the end of May 2019.  In July 2019, I approved grant funding of just under €131,000 to thirteen local community groups and organisations, with €16,245 to be provided to seven of these groups through the phased payment option.  Funding was awarded to three local groups in County Galway:  1. Galway Telework Co-op Society Ltd. , Mountbellew, County Galway was awarded funding of €12,500 for outdoor information panels, indoor display columns for its Visitor Centre, outdoor seating and to undertake a bird survey and report for Carrownagappul Bog special area of conservation.  2. Looscaun Shannonside Rural Development , County Galway was awarded funding of €25,000 to assist in the development of a national walking and cycling trail through Clonmoylan Bog/ Barroughter Bog special areas of conservation. Funding is being provided to engage the services of a project manager and carry out a number of environmental surveys.  3. Glenamaddy Tidy Towns, County Galway was awarded funding of €15,000 for the proposed upgrade of two walking trail loops around Frass Clooncon Bog, part of the Lisnageeragh Bog and Ballinstack Turlough special area of conservation, including the installation of interpretive signage, to establish a link return to the start point via a bog bridge ad improve/extend the current parking area.  No applications were received from local groups / organisations from County Mayo. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-09-19",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-09-19",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-09-19/writtens/mul@/dbsect_133.xml"
            }
          },
          "debateSectionId": "dbsect_133",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-09-19/writtens/dbsect_133",
          "showAs": "Hospital Waiting Lists Data"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-09-19/pq_128",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 128,
        "showAs": " 128. Deputy Hildegarde Naughton asked the Minister for Health the number of patients waiting for elective surgery within the Saolta Hospital Group by county; the category of surgery for which they are waiting, that is, orthopaedic, ophthalmic and so on; and if he will make a statement on the matter. [37984/19] ",
        "answerText": " Minister for Health  Reducing waiting time for patients for hospital operations and procedures is a key priority for Government. In this regard, the Government is committed to improving waiting times for hospital appointments and procedures.  Budget 2019 announced that the Government has further increased investment in tackling waiting lists, with funding to the National Treatment Purchase Fund (NTPF) increasing from €55 million in 2018 to €75 million in 2019. The joint Department of Health/HSE/NTPF Scheduled Care Access Plan 2019 was published in March and sets out measures to improve access for patients waiting for scheduled care this year. The plan places a strong focus on ten high-volume Inpatient/Day Case procedures.  The NTPF advise that over recent months they have placed a particular focus on engaging with hospital groups and individual hospitals to identify waiting list proposals. The NTPF welcomes proposals from all acute hospitals for initiatives to improve access for patients on waiting lists.  The data requested by the Deputy is outlined in the attached document contained in the link below.   Saolta IPDC  ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-09-19",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "question": {
        "date": "2019-09-06",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-09-06/writtens/dbsect_458",
          "showAs": "Citizenship Applications",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-09-06/writtens/mul@/dbsect_458.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_458"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "showAs": "Hildegarde Naughton"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Justice",
          "roleType": null
        },
        "showAs": " 554. Deputy Hildegarde Naughton asked the Minister for Justice and Equality the number of citizenship applications affected by a judgment (details supplied); if he will be applying the judgment retrospectively; and if he will make a statement on the matter. [34866/19] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-09-06/pq_554",
        "questionNumber": 554,
        "answerText": " Minister for Justice and Equality  I propose to take Questions Nos. 533, 554, 555, 558, 569, 571, 601 and 636 to 638, inclusive, together.  I am aware that the recent judgment of the High Court relating to continuous residency under Section 15(1)(c) of the Irish Nationality and Citizenship Act, 1956 (as amended) has given cause for concern. The matter remains before the courts with the lodgement of an appeal before the Court of Appeal and is therefore sub-judice. As of 3rd September there were 15,647 applications for citizenship on hand. The majority of such applicants are potentially affected by the ruling. To date this year a total of 2,981 adults and 849 minors have been naturalised. I am advised that this ruling is not considered to have consequences for anyone who has already obtained citizenship under the Act.  I can, however, assure the Deputy that my Department is continuing to work on finding solutions to the situation as quickly as possible. The best interests of both current and future applicants are foremost in these considerations and on 25 July 2019 I obtained Cabinet approval for the drafting of a Bill, which seeks to resolve the issue.  My officials are working with the Office of Parliamentary Counsel in the Attorney General’s Office to have a bill drafted on an urgent basis and be brought before the Houses of the Oireachtas as quickly as possible on resumption of business in mid-September. Further updates, as they become available, will be posted on the Immigration Service website.  Those who are planning to apply for citizenship should continue to collect all the necessary proofs that support their application and to submit a comprehensive application form. Once a solution is in place, if any additional information is required, applicants will be contacted as part of the processing of the application. "
      },
      "contextDate": "2019-09-06"
    },
    {
      "question": {
        "date": "2019-09-06",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-09-06/writtens/dbsect_458",
          "showAs": "Citizenship Applications",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-09-06/writtens/mul@/dbsect_458.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_458"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "showAs": "Hildegarde Naughton"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Justice",
          "roleType": null
        },
        "showAs": " 555. Deputy Hildegarde Naughton asked the Minister for Justice and Equality if he will be seeking emergency legislation to amend the Act to ensure the continuous residence criteria allows travel for a reasonable length of time, for example, the six weeks advised by his Department before a judgment (details supplied) was made; and if he will make a statement on the matter. [34867/19] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-09-06/pq_555",
        "questionNumber": 555,
        "answerText": " Minister for Justice and Equality  I propose to take Questions Nos. 533, 554, 555, 558, 569, 571, 601 and 636 to 638, inclusive, together.  I am aware that the recent judgment of the High Court relating to continuous residency under Section 15(1)(c) of the Irish Nationality and Citizenship Act, 1956 (as amended) has given cause for concern. The matter remains before the courts with the lodgement of an appeal before the Court of Appeal and is therefore sub-judice. As of 3rd September there were 15,647 applications for citizenship on hand. The majority of such applicants are potentially affected by the ruling. To date this year a total of 2,981 adults and 849 minors have been naturalised. I am advised that this ruling is not considered to have consequences for anyone who has already obtained citizenship under the Act.  I can, however, assure the Deputy that my Department is continuing to work on finding solutions to the situation as quickly as possible. The best interests of both current and future applicants are foremost in these considerations and on 25 July 2019 I obtained Cabinet approval for the drafting of a Bill, which seeks to resolve the issue.  My officials are working with the Office of Parliamentary Counsel in the Attorney General’s Office to have a bill drafted on an urgent basis and be brought before the Houses of the Oireachtas as quickly as possible on resumption of business in mid-September. Further updates, as they become available, will be posted on the Immigration Service website.  Those who are planning to apply for citizenship should continue to collect all the necessary proofs that support their application and to submit a comprehensive application form. Once a solution is in place, if any additional information is required, applicants will be contacted as part of the processing of the application. "
      },
      "contextDate": "2019-09-06"
    },
    {
      "contextDate": "2019-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-07-23/writtens/mul@/dbsect_493.xml"
            }
          },
          "debateSectionId": "dbsect_493",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-07-23/writtens/dbsect_493",
          "showAs": "Schools Building Projects Data"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-07-23/pq_555",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 555,
        "showAs": " 555. Deputy Hildegarde Naughton asked the Minister for Education and Skills the number of new school builds commenced, finished or announced in west County Galway since 2016; the location of same in tabular form; the amount of funding provided in each instance; and if he will make a statement on the matter. [33422/19] ",
        "answerText": " Minister for Education and Skills  I propose to take Questions Nos. 555, 556 and 609 together.  I wish to advise the Deputy that the current status of projects being delivered by my Department may be viewed on my Department's website, www.education.ie .  Large scale projects, including new schools, being delivered under the school building programme are listed by county along with school name and address. The current status of each school project is also provided.  In addition, a list of large-scale projects completed from 2010 to date, - again broken down by county -, along with school name and address may also be viewed on the website.  Regarding other types of projects, - for example additional accommodation, emergency works etc. - , information on these is also available on my Department’s website and includes the school details and the nature of the works.  The status of projects listed on my Department’s website is updated on a regular basis to reflect their progress through the various stages of design, tender and construction. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-07-23",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-07-23/writtens/mul@/dbsect_493.xml"
            }
          },
          "debateSectionId": "dbsect_493",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-07-23/writtens/dbsect_493",
          "showAs": "Schools Building Projects Data"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-07-23/pq_556",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 556,
        "showAs": " 556. Deputy Hildegarde Naughton asked the Minister for Education and Skills the number of additional schools, accommodation commenced, finished or announced in west County Galway since 2016; the school involved; the amount of funding provided in each instance; and if he will make a statement on the matter. [33423/19] ",
        "answerText": " Minister for Education and Skills  I propose to take Questions Nos. 555, 556 and 609 together.  I wish to advise the Deputy that the current status of projects being delivered by my Department may be viewed on my Department's website, www.education.ie .  Large scale projects, including new schools, being delivered under the school building programme are listed by county along with school name and address. The current status of each school project is also provided.  In addition, a list of large-scale projects completed from 2010 to date, - again broken down by county -, along with school name and address may also be viewed on the website.  Regarding other types of projects, - for example additional accommodation, emergency works etc. - , information on these is also available on my Department’s website and includes the school details and the nature of the works.  The status of projects listed on my Department’s website is updated on a regular basis to reflect their progress through the various stages of design, tender and construction. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-07-23",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-07-23/writtens/mul@/dbsect_584.xml"
            }
          },
          "debateSectionId": "dbsect_584",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-07-23/writtens/dbsect_584",
          "showAs": "Judicial Retirement Age"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-07-23/pq_655",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 655,
        "showAs": " 655. Deputy Hildegarde Naughton asked the Minister for Justice and Equality his plans to increase the retirement age for serving judges; the status of proposals; when considerations will be finalised; and if he will make a statement on the matter. [32988/19] ",
        "answerText": " Minister for Justice and Equality  The Association of Judges of Ireland has recently requested that my Department review the matter of retirement age for serving judges (currently age 70 years). This issue is currently under consideration by officials within my Department, and in consultation with officials of the Department of Public Expenditure and Reform who have policy responsibility for judicial pensions. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-07-23",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-07-23/writtens/mul@/dbsect_1710.xml"
            }
          },
          "debateSectionId": "dbsect_1710",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-07-23/writtens/dbsect_1710",
          "showAs": "Animal Welfare"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-07-23/pq_2031",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 2031,
        "showAs": " 2031. Deputy Hildegarde Naughton asked the Minister for Agriculture, Food and the Marine the number of successful prosecutions taken to date under the Animal Health and Welfare Act 2013; the number of cases awaiting determination; and if he will make a statement on the matter. [31518/19] ",
        "answerText": " Minister for Agriculture, Food and the Marine  The Animal Health and Welfare Act 2013 provides a modern framework for applying standards in the area of animal health and welfare and replaced a number of enactments dating back over a century. The Act was passed, after lengthy and constructive debate in both Houses of the Oireachtas and came into operation on 6 March 2014.  Offences under the Act may be prosecuted in the District Court by the Minister for Agriculture, Food and the Marine, local authorities and members of An Garda Síochána. Matters tried on indictment are the remit of the Director of Public Prosecutions in the normal manner. Accordingly, the statistics set down in this answer relate to cases prosecuted at the suit of the Minister for Agriculture, Food and the Marine.  Prosecutions under the Act have been pursued following investigations by authorised officers of my Department, An Garda Síochána and authorised officers of the Irish Society for the Prevention of Cruelty to Animals and the Dublin Society for the Prevention of Cruelty to Animals. These officers investigate matters relating to animal cruelty and neglect and, where the evidence supports such action, a file is prepared and the matter pursued through the Courts..  Since the Animal Health and Welfare Act 2013 came into operation in March 2014, 83 individuals have been successfully prosecuted. Fines in excess of €50,000 have been imposed. Six persons have been sentenced to a term of imprisonment which were suspended in 4 cases. The Probation Act was applied in 6 instances.  Eleven persons have been disqualified from keeping animals under section 58 of the Act.  Summonses have issued in 29 cases which remain before the Courts. A further six files have been sent to the Chief State Solicitor with a view to institute proceedings and a further five files are currently being examined in my Department with a view to pursuing a prosecution if the evidence so warrants. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-07-23",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-07-23/writtens/mul@/dbsect_1711.xml"
            }
          },
          "debateSectionId": "dbsect_1711",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-07-23/writtens/dbsect_1711",
          "showAs": "Animal Welfare Expenditure"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-07-23/pq_2032",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 2032,
        "showAs": " 2032. Deputy Hildegarde Naughton asked the Minister for Agriculture, Food and the Marine the support provided to urban horse welfare projects; and if he will make a statement on the matter. [31519/19] ",
        "answerText": " Minister for Agriculture, Food and the Marine  In November 2014, Local Authorities were informed of details of an initial fund of €1 million being made available by my Department to develop facilities for urban/traveller horse projects.  Expressions of interest were sought from those authorities who wished to initiate projects. While initial uptake was slow, several projects are currently being progressed by local authorities in conjunction with animal welfare organisations. The total draw down of funds since the fund’s inception is €1.2m.  The Department also supports education projects both in and outside the urban horse projects.  The projects are a positive and welcome development and assist urban/traveller horse owners in complying with equine-related legislation including identification and control of horses. Education courses provided within the framework of the projects give the horse owners an opportunity to acquire skills in relation to caring and managing horses alongside a broader education. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-07-23",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-07-23/writtens/mul@/dbsect_1712.xml"
            }
          },
          "debateSectionId": "dbsect_1712",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-07-23/writtens/dbsect_1712",
          "showAs": "Targeted Agricultural Modernisation Scheme"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-07-23/pq_2033",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 2033,
        "showAs": " 2033. Deputy Hildegarde Naughton asked the Minister for Agriculture, Food and the Marine the number of young farmers that received increased grant aid under the targeted agricultural modernisation scheme, TAMS, to date by county; the value of funding provided under the scheme; and if he will make a statement on the matter. [31520/19] ",
        "answerText": " Minister for Agriculture, Food and the Marine  To date, a total of €67m has been paid to farmers under the Young Farmers Capital Investment Scheme of TAMS II. The county breakdown, in terms of young farmers paid in each county, is shown in the table.     County    No. paid      Carlow    36      Cavan    67      Clare    85      Cork    287      Donegal    68      Dublin    6      Galway    148      Kerry    109      Kildare    30      Kilkenny    123      Laois    63      Leitrim    32      Limerick    108      Longford    30      Louth    21      Mayo    72      Meath    44      Monaghan    55      Offaly    69      Roscommon    68      Sligo    30      Tipperary    157      Waterford    90      Westmeath    30      Wexford    121      Wicklow    36      Total    1985    ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-07-23",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-07-23/writtens/mul@/dbsect_1713.xml"
            }
          },
          "debateSectionId": "dbsect_1713",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-07-23/writtens/dbsect_1713",
          "showAs": "Targeted Agricultural Modernisation Scheme"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-07-23/pq_2034",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 2034,
        "showAs": " 2034. Deputy Hildegarde Naughton asked the Minister for Agriculture, Food and the Marine the number of farmers grant aided to date to use low emissions slurry spreading equipment; the value of funding provided; and if he will make a statement on the matter. [31521/19] ",
        "answerText": " Minister for Agriculture, Food and the Marine  To date under the TAMS II Schemes, 1,175 farmers have received €15.7m in grant assistance to purchase Low Emission Slurry Spreading equipment.  The adoption of dribble bar, shallow injection and trailing shoe technology is making an important contribution in reducing greenhouse gas emissions from the Irish livestock sector. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-07-23",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-07-23/writtens/mul@/dbsect_1714.xml"
            }
          },
          "debateSectionId": "dbsect_1714",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-07-23/writtens/dbsect_1714",
          "showAs": "Targeted Agricultural Modernisation Scheme"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-07-23/pq_2035",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 2035,
        "showAs": " 2035. Deputy Hildegarde Naughton asked the Minister for Agriculture, Food and the Marine the number of farmers grant aided to date for renewable energy equipment under the TAMS scheme; and if he will make a statement on the matter. [31522/19] ",
        "answerText": " Minister for Agriculture, Food and the Marine  Grant aid under the Tams II Scheme is available for Renewable energy technology. The renewable energy eligible items are Solar Photovoltaic panels, Solar Thermal panels and Biomass Boilers. These eligible items are all available under the Pig and Poultry measure.  However, since the introduction of Tranche 14 on 6th April, Solar Photovoltaic is now available to all the farming sectors under Animal Welfare, Young Farmers and Organics measures. As this tranche has only recently closed, my Department is currently assessing the applications received. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-07-23",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-07-23/writtens/mul@/dbsect_1715.xml"
            }
          },
          "debateSectionId": "dbsect_1715",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-07-23/writtens/dbsect_1715",
          "showAs": "European Maritime and Fisheries Fund"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-07-23/pq_2036",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 2036,
        "showAs": " 2036. Deputy Hildegarde Naughton asked the Minister for Agriculture, Food and the Marine the funding announced under the fisheries local area group development programme; and if he will make a statement on the matter. [31530/19] ",
        "answerText": " Minister for Agriculture, Food and the Marine  My Department's €240 million European Maritime and Fisheries Fund (EMFF) Operational Programme is the vehicle for financial supports to the seafood sector for the period 2014 to 2020. The Programme delivers a wide range of supports for aquaculture, fisheries and seafood processing through a suite of 18 schemes. The Programme is co-funded by the Government of Ireland and the European Union.  The Fisheries Local Area Development Scheme is providing €12 million EMFF support to projects within coastal communities around Ireland. The Scheme aims to promote innovative approaches in coastal communities to create growth and jobs in those areas, in particular by adding value to fishery and aquaculture products and diversifying the local economy towards new economic activities, in particular those offered by blue growth and the broader maritime sectors.  There are seven Fisheries Local Action Groups (FLAG) established around our coast and each has developed its own Local Development Strategy, tailored to the respective FLAG's territory. The Boards of the seven FLAGs determine which projects are to be selected for EMFF funding from their allocated budget.  In 2018, the 7 FLAGs paid out grants of €1,948,444.72 to 209 local projects, while since its commencement in 2017, the scheme has paid out total grants of €3,723,007.69 to 342 projects.  In May of this year, I announced a tranche of 2019 EMFF FLAG grant awards as outlined in the table below. These will be drawn down by the applicants over the course of 2019 and, in some instances, in 2020.     FLAG    Number projects    Total Investment    Grant Awards      Northeast    36    €1,652,695    €973,221      Northwest    42    €589,471    €336,024      South    29    €551,236    €337,270      Southeast    41    €1,178,540    €757,817      Southwest    17    €238,597    €183,216      West    62    €1,306,294    €808,764      North    47    €852,891    €581,412      TOTAL    274    €6,369,724    €3,977,724    ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-07-23",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-07-23/writtens/mul@/dbsect_1716.xml"
            }
          },
          "debateSectionId": "dbsect_1716",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-07-23/writtens/dbsect_1716",
          "showAs": "Beef Environmental Efficiency Scheme Data"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-07-23/pq_2037",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 2037,
        "showAs": " 2037. Deputy Hildegarde Naughton asked the Minister for Agriculture, Food and the Marine the number of applicants that will benefit under the beef environmental efficiency pilot by county; and if he will make a statement on the matter. [31531/19] ",
        "answerText": " Minister for Agriculture, Food and the Marine  The Beef Environmental Efficiency Pilot (BEEP) is a one year pilot to further increase economic and environmental efficiency in the suckler herd through better quality data on herd performance, supporting decision making on farm.  There are currently 19,131 participants in BEEP, a breakdown of which is provided in the table below, by county.     No. of Applicants    County      269    CARLOW      923    CAVAN      1,483    CLARE      1,412    CORK      912    DONEGAL      55    DUBLIN      2,070    GALWAY      965    KERRY      217    KILDARE      526    KILKENNY      514    LAOIS      645    LEITRIM      610    LIMERICK      574    LONGFORD      182    LOUTH      1,762    MAYO      454    MEATH      648    MONAGHAN      477    OFFALY      1,119    ROSCOMMON      801    SLIGO      852    TIPPERARY      292    WATERFORD      591    WESTMEATH      462    WEXFORD      316    WICKLOW     Requirements of the Pilot include:  1 All Calves being submitted for weighing must be born between 01 July 2018 and 30 June 2019.  2 Unweaned Live Calf and Dam must be weighed on the applicant's holding on the same day.  3 Only scales registered and used in accordance with the requirements of Annex 1 of the Terms and Conditions of the Pilot may be employed for the purposes of this Pilot.  4 Weights must be submitted between 08 March 2019 and 01 November 2019 in accordance with Annex 1 of the Terms and Conditions of the Pilot. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-07-23",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-07-23/writtens/mul@/dbsect_1717.xml"
            }
          },
          "debateSectionId": "dbsect_1717",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-07-23/writtens/dbsect_1717",
          "showAs": "Young Farmers Scheme"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-07-23/pq_2038",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 2038,
        "showAs": " 2038. Deputy Hildegarde Naughton asked the Minister for Agriculture, Food and the Marine the number of young farmers who received support under the young farmers scheme since its introduction by county; the value of funding provided under the scheme; and if he will make a statement on the matter. [31532/19] ",
        "answerText": " Minister for Agriculture, Food and the Marine  The number of young farmers that received support under the Young Farmers Scheme since its introduction in 2015, by county, is set out in the following table.     County    2015    2016    2017    2018      CARLOW    134    133    134    111      CAVAN    334    353    372    369      CLARE    351    357    373    373      CORK    969    1,030    1,030    1,038      DONEGAL    378    388    377    342      DUBLIN    40    38    38    39      GALWAY    706    764    775    808      KERRY    449    493    493    475      KILDARE    130    134    134    129      KILKENNY    298    312    312    308      LAOIS    257    264    274    276      LEITRIM    235    234    241    223      LIMERICK    344    367    360    345      LONGFORD    139    148    151    154      LOUTH    92    91    92    90      MAYO    687    713    705    745      MEATH    258    252    250    258      MONAGHAN    207    228    224    213      OFFALY    233    259    251    263      ROSCOMMON    348    351    358    354      SLIGO    176    204    214    213      TIPPERARY    467    470    495    499      WATERFORD    229    236    237    231      WESTMEATH    164    173    184    181      WEXFORD    364    368    361    349      WICKLOW    158    153    158    153     The value of funding provided to successful applicants under the scheme by year is as follows:  2015 €18.5 million  2016 €19.5 million  2017 €19.7 million  2018 €19.8 million. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-07-23",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-07-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-07-09/writtens/mul@/dbsect_125.xml"
            }
          },
          "debateSectionId": "dbsect_125",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-07-09/writtens/dbsect_125",
          "showAs": "Passport Applications Administration"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-07-09/pq_141",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 141,
        "showAs": " 141. Deputy Hildegarde Naughton asked the Tánaiste and Minister for Foreign Affairs and Trade the status of the roll-out of online renewal for children’s passports since the project commenced in November 2018; the number of online child applications by county since then; and if he will make a statement on the matter. [29631/19] ",
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  The award-winning Online Passport Renewal Service was launched in March 2017 and offers the convenience of an online application system 24 hours a day, 7 days a week for Irish citizens anywhere in the world.  In November 2018, the Online Passport Renewal Service was expanded to include the online renewal of children’s passports, to introduce a passport card for children, and to expand the cohort of adults eligible to renew online.  Since the expansion of the service last year, 71,384 online passport applications for children have been submitted. The table below details the county of residence of the applicants for those same applications submitted who were resident on the island of Ireland at the time of application.     County    Applications      DUBLIN    17,602      CORK    5,852      KILDARE    3,444      MEATH    3,142      GALWAY    3,025      LIMERICK    2,117      WICKLOW    2,096      LOUTH    1,775      WEXFORD    1,663      DONEGAL    1,650      TIPPERARY    1,612      CLARE    1,427      ANTRIM    1,362      WATERFORD    1,337      MAYO    1,322      KERRY    1,225      DOWN    1,121      KILKENNY    1,090      WESTMEATH    960      DERRY    846      LAOIS    816      CAVAN    778      ROSCOMMON    714      OFFALY    664      SLIGO    657      CARLOW    600      MONAGHAN    593      TYRONE    545      ARMAGH    412      LEITRIM    377      LONGFORD    335      FERMANAGH    147      BELFAST    11      TOTAL    61,317             The online service brings significant benefits for citizens with faster turnaround times of 10 working days for all online applications, excluding postage. In addition, the cost of renewing a passport online is significantly cheaper than alternative methods, with fees for all online applications being reduced by €5 across all application types.  Public feedback with regard to the ease of use and accessibility of the website and with regard to the 10 day turnaround time has been hugely positive. Last month, the online child passport renewal website won a UX (User Experience design) Award for “Innovation in UX”. The awards celebrate achievement in the Irish user experience sector. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-07-09",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-07-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-07-09/writtens/mul@/dbsect_126.xml"
            }
          },
          "debateSectionId": "dbsect_126",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-07-09/writtens/dbsect_126",
          "showAs": "Brexit Preparations"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-07-09/pq_142",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 142,
        "showAs": " 142. Deputy Hildegarde Naughton asked the Tánaiste and Minister for Foreign Affairs and Trade the way in which the passport service is dealing with the increased demand for passports due to Brexit to date in 2019; the plans of the service to deal with the various Brexit scenarios over the coming months; and if he will make a statement on the matter. [29632/19] ",
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  The demand for Irish passports has grown significantly in recent years. The Passport Service issued over 780,000 passports in 2017, over 822,000 passports in 2018 and so far this year, over 490,000 passports have been issued.  The increase in demand for Irish passports is driven by a number of factors including a general increase in the number of Irish residents travelling abroad and a growing population. There has also been a significant increase in passport applications from applicants in Northern Ireland and in Britain since the UK Referendum on EU membership in June 2016.  A number of measures have been taken by the Passport Service to manage increases in demand in recent years including the recruitment of additional staff, the continuous implementation of technological and service improvements and the re-organisation of production processes and administrative arrangements.  My Department continues to closely monitor the level of passport demand to ensure that all resources, including staffing, are effectively deployed to meet the ongoing anticipated strong demand for Irish passports.  At the end of 2018, the Passport Service employed 363 Full Time Equivalent staff. This is an increase of over 40 staff since the same point in 2017. Already this year, over 90 additional Full Time Equivalent staff have taken up roles in the Passport Service. Targeted overtime has been sanctioned for both permanent and temporary staff when required. The Passport Service has received approval to recruit over 230 Temporary Clerical Officers (TCOs) in 2019 to assist in processing passport applications and to deal with queries from the general public.  A new Customer Service Hub was established in January 2019 to ensure that the Passport Service is equipped to deal with the large volume of queries received through its phone and webchat services. The Passport Service is currently handling approximately 5000 calls and 3800 webchats per week. Thanks to this dedicated customer service team, we are able to quickly resolve most queries at the first point of contact.  The Passport Reform Programme continues to deliver major upgrades to the Passport Service technology platforms and business processes as well as significant customer service improvements. The award winning Online Passport Renewal Service was introduced in March 2017 and expanded in November 2018 to allow for the renewal of children's passports and to expand the cohort of adults eligible to renew online.  The online service brings significant benefits to citizens with faster turnaround times at a lower cost. 45% of all applications received in 2019 have been online applications and over 60% of those eligible to use the online application channel have done so. The online service has been instrumental in the efficient management of overall passport operations and in allowing the Passport Service to allocate staff resources more efficiently to cope with unprecedented demand.  To assist with forecasting future demand for Irish passports, my Department has commissioned research to better understand the potential demand for passports from Irish citizens in the United Kingdom who have not yet applied for a passport. Interim reports have been provided and in 2019 an additional forecasting report was commissioned which sought to update and revise projected demand estimates up to mid-2023. This research will assist the Passport Service in formulating plans on resource requirements for the future. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-07-09",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-06-19",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-06-19/writtens/mul@/dbsect_167.xml"
            }
          },
          "debateSectionId": "dbsect_167",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-06-19/writtens/dbsect_167",
          "showAs": "Hospital Appointments Status"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-06-19/pq_176",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 176,
        "showAs": " 176. Deputy Hildegarde Naughton asked the Minister for Health when a person (details supplied) will be given a date for a hip replacement operation; and if he will make a statement on the matter. [25674/19] ",
        "answerText": " Minister for Health  Under the Health Act 2004, the Health Service Executive (HSE) is required to manage and deliver, or arrange to be delivered on its behalf, health and personal social services. Section 6 of the HSE Governance Act 2013 bars the Minister for Health from directing the HSE to provide a treatment or a personal service to any individual or to confer eligibility on any individual.  The National Waiting List Management Policy, a standardised approach to managing scheduled care treatment for in-patient, day case and planned procedures, since January 2014, has been developed to ensure that all administrative, managerial and clinical staff follow an agreed national minimum standard for the management and administration of waiting lists for scheduled care. This policy, which has been adopted by the HSE, sets out the processes that hospitals are to implement to manage waiting lists.  In relation to the particular query raised, as this is a service matter, I have asked the HSE to respond to the Deputy directly. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-06-19",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-06-12",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-06-12/writtens/mul@/dbsect_50.xml"
            }
          },
          "debateSectionId": "dbsect_50",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-06-12/writtens/dbsect_50",
          "showAs": "Irish Language"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-06-12/pq_32",
        "to": {
          "roleType": null,
          "showAs": "Culture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 32,
        "showAs": " 32. Deputy Hildegarde Naughton asked the Minister for Culture, Heritage and the Gaeltacht the support provided by her Department for a project (details supplied); and if she will make a statement on the matter. [24207/19] ",
        "answerText": " Minister of State at the Department of Culture, Heritage and the Gaeltacht  As the Deputy is aware, I had the honour of officially launching the new Maker Space in Áras na nGael on Monday 27 May last. Located in Conradh na Gaeilge’s office in Dominick Street, Galway, the new Maker Space is a one-year pilot project and a collaboration of the following stakeholders – Áras na nGael; Camara Education Ireland, An Clár Techspace, Conradh na Gaeilge, Foróige and Ógras. This space will be available to members of Líonra an Chláir TechSpace – or the Irish language TechSpace Network - in Galway and to the wider Irish speaking network across the west of Ireland. The Network members can avail of the space outside of office hours and under the supervision of a partner organisation.  I am delighted that the Department of Culture, Heritage and the Gaeltacht has provided current funding of €419,000 in 2019 to Camara Education Ireland to facilitate the national rollout of An Clar TechSpace. However, no direct funding – either capital or current - was provided by my Department for the establishment of the pilot Maker Space to be used by Network members. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-06-12",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-06-12",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-06-12/writtens/mul@/dbsect_55.xml"
            }
          },
          "debateSectionId": "dbsect_55",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-06-12/writtens/dbsect_55",
          "showAs": "Ministerial Appointments"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-06-12/pq_38",
        "to": {
          "roleType": null,
          "showAs": "Culture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 38,
        "showAs": " 38. Deputy Hildegarde Naughton asked the Minister for Culture, Heritage and the Gaeltacht the status of recent appointments to the board of Galway 2020 and the plan for events during 2019; and if she will make a statement on the matter. [24208/19] ",
        "answerText": " Minister for Culture, Heritage and the Gaeltacht  In 2020, Galway, on behalf of Ireland, will host the European Capital of Culture, one of the biggest cultural initiatives in the world. Galway's designation as European Capital of Culture 2020, is a great honour for Ireland and a wonderful opportunity to strengthen and promote our culture nationally and internationally.  The Board of Galway 2020 comprises 15 members, drawn from a range of expertise, including the cultural, governance, audit, business, legal, marketing and communications, digital and language sectors.  Last week, I appointed Dr Moling Ryan as my representative on the Board of Galway 2020. Dr Ryan has a proven track record in governance and public service, having lead and managed a number of public service organisations. He continues to chair and sit on a number of boards, as well as carrying out high-level reviews of various national and international organisations. Dr Ryan has replaced Mr Declan McGonagle who stood down recently for personal reasons.  The new Mayor of Galway City, Councillor Michael Cubbard, and the Cathaoirleach of Galway County, Councillor Jimmy McClearn, are also taking their seats on the Board following the recent local elections and their election last week to the positions in the City and County.  Having regard to events in 2019, this year is very much about getting a flavour of what is to come in 2020. These events include cultural projects such as Fresh Street #3, the international seminar for the development of street arts, which took place in Galway last month and included various street spectacles throughout the 3-day event.  Many other exciting events, along with workshops and launches, are also planned, an example is Galway Community Circus’ ‘Wires Crossed’ spectacular funambulism (high wire walking) project, which was launched last month and is holding workshops and training sessions over the summer in Galway, in preparation for their spectacular event next year.  Galway 2020’s community based programme, Small Towns Big Ideas comprises over 50 projects in round one, over 20 of which have already taken place and the remainder will follow throughout 2019. Applications for round two closed recently and successful projects will be announced in early July.  The cultural programme for Galway 2020 will be launched in September this year. Under the programme, we can look forward to a year-long celebration of street spectacle, exhibitions, readings, classical concerts, dance, schools’ projects, children’s events, the Irish language, musical performances, digital encounters, live art, theatre, circus, funambulism, public art, heritage, food, sports, sheep, folklore, our islands, our people, imagination and creativity. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-06-12",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-06-12",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-06-12/writtens/mul@/dbsect_246.xml"
            }
          },
          "debateSectionId": "dbsect_246",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-06-12/writtens/dbsect_246",
          "showAs": "Irish Language"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-06-12/pq_247",
        "to": {
          "roleType": null,
          "showAs": "Culture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 247,
        "showAs": " 247. Deputy Hildegarde Naughton asked the Minister for Culture, Heritage and the Gaeltacht the detail of the new scheme for funding third level students to visit the Gaeltacht to improve their Irish; and if she will make a statement on the matter. [24209/19] ",
        "answerText": " Minister of State at the Department of Culture, Heritage and the Gaeltacht  I am pleased to inform the Deputy that I recently announced the establishment of a new fund worth €250,000, by which third-level students will be provided with the opportunity to live with Gaeltacht families for three months while attending a recognised third- level course for the duration of an entire semester.  Under the new fund, a subsidy worth €17 per day will be payable to Gaeltacht households who are registered under my Department’s Irish Language Learner’s Scheme (Scéim na bhFoghlaimeoirí Gaeilge). This subvention equates to an overall subsidy of approximately €1,428 per student per semester.  This measure which is being introduced with effect immediately is expected to accommodate up to 175 students per annum initially and represents significant progress in the implementation of measures 2.13, 2.15 and 2.19 of the Government’s Action Plan 2018-2022  for the Irish Language, which was launched in June 2018.  The fund also represents a practical step forward in seeking to further build capacity within the public service insofar as the provision of services through Irish are concerned.  The three-month language immersion period will be directed towards third-level students:  - who have Irish as a core subject in their university student programme (for example B.A. in Irish or B. Comm with Irish) or:  - for whom Irish is not a core subject but who require a high level of competency in Irish in order to work in professions in the public service, in particular in which engagement with the Irish speaking community through Irish is required.  I should also point out that my Department intends to ensure, insofar as is possible and practical, and in collaboration with prospective third-level institutes, that courses are organised having regard to an appropriate geographic spread across Gaeltacht regions. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-06-12",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-05-28",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-05-28/writtens/mul@/dbsect_89.xml"
            }
          },
          "debateSectionId": "dbsect_89",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-05-28/writtens/dbsect_89",
          "showAs": "Public Sector Staff Retirements"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-05-28/pq_68",
        "to": {
          "roleType": null,
          "showAs": "Public",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 68,
        "showAs": " 68. Deputy Hildegarde Naughton asked the Minister for Public Expenditure and Reform when the report under section 3A(6) of the Public Service Superannuation (Age of Retirement) Act 2018 will be finalised and published; and if he will make a statement on the matter. [22772/19] ",
        "answerText": " Minister for Public Expenditure and Reform  I propose to take Questions Nos. 68 and 77 together.  On 5 December 2017, the Government made the decision to increase the compulsory retirement age to 70, for public servants recruited prior to 1 April 2004. Primary legislation was necessary in order to bring that change into effect. It was made clear at the time that until such legislation was enacted, the compulsory retirement age of 65, which applied to the vast majority of this cohort, remained in effect and pre-2004 public servants reaching that age would be required to retire.  Interim arrangements were provided for the cohort of public servants who reached their compulsory retirement age of 65 after the Government Decision because, while they would be aware of the Government’s decision, they would be unable to avail of it. Those arrangements permitted these individuals to be rehired post-retirement for a period of 1 year until they reached the age of eligibility for the State Pension (Contributory). Without that specific arrangement, they would have been required to cease working on reaching the age of 65.  The Public Service Superannuation (Age of Retirement) Act 2018 was enacted on 26 December 2018. Under the Act, any relevant public servant who had not already reached their compulsory retirement age of 65 before that date has a new compulsory retirement age of 70. Enactment of the legislation had no effect on those public servants who retired at 65 prior to the 26 December 2018 and who availed of a one year contract under the interim arrangements. The terms of their contracts continue to apply and they will cease working when they reach the age of 66.  Section 3 of the 2018 Act also provides that I, as Minister for Public Expenditure and Reform, within three months of the passing of the Act, would prepare and lay before the Oireachtas a report on the public servants who were forced to retire between 6 December 2017 and the commencement of the Act, due to reaching the age of 65 years, and on potential remedies to assist this cohort of worker. This Report was laid before the Oireachtas on 26 March 2019 and is publicly available on the www.gov.ie website and in the Oireachtas Library online catalogue.  Having considered all of the issues outlined in the Report, I am satisfied that the interim arrangements were an appropriate temporary policy response at the time of the Government Decision, pending enactment of the legislation. The terms of those arrangements were clear, unambiguous and made known to those who availed of them. Accordingly, for the reasons set out in the report, I do not propose to make any changes to those terms. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-05-28",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-05-22",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-05-22/writtens/mul@/dbsect_51.xml"
            }
          },
          "debateSectionId": "dbsect_51",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-05-22/writtens/dbsect_51",
          "showAs": "Rail Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-05-22/pq_65",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 65,
        "showAs": " 65. Deputy Hildegarde Naughton asked the Minister for Transport, Tourism and Sport the position regarding the lack of capacity, both carriage and service, on the Galway to Dublin rail line, particularly as it affects commuters on the Oranmore to Galway service; and if he will make a statement on the matter. [21727/19] ",
        "answerText": " Minister for Transport, Tourism and Sport  As Minister for Transport, Tourism and Sport, I have responsibility for policy and overall funding of public transport.  The operation of and provision of service on the rail network is a matter for Iarnród Éireann in the first instance who, in consultation with the National Transport Authority, are currently examining how best to source additional rolling stock as efficiently and effectively as possible and ensuring value for money for the taxpayer in that regard.  In view of Iarnród Éireann's responsibility in these matter, I have referred the Deputy's question to the company for direct reply.  Please contact my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-05-22",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-05-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-05-08/writtens/mul@/dbsect_870.xml"
            }
          },
          "debateSectionId": "dbsect_870",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-05-08/writtens/dbsect_870",
          "showAs": "Ambulance Service Data"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-05-08/pq_940",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 940,
        "showAs": " 940. Deputy Hildegarde Naughton asked the Minister for Health the cost to the HSE in 2018 and to date in 2019 for the use of private ambulance transport nationally; and if he will make a statement on the matter. [19621/19] ",
        "answerText": " Minister for Health  As this is a service issue, I have asked the HSE to reply to you directly. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-05-08",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-05-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-05-08/writtens/mul@/dbsect_871.xml"
            }
          },
          "debateSectionId": "dbsect_871",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-05-08/writtens/dbsect_871",
          "showAs": "Ambulance Service Data"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-05-08/pq_941",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 941,
        "showAs": " 941. Deputy Hildegarde Naughton asked the Minister for Health the cost to the HSE in 2018 and to date in 2019 of intermediate care operative overtime; and if he will make a statement on the matter. [19622/19] ",
        "answerText": " Minister for Health  I propose to take Questions Nos. 941 and 943 together.  I have asked the HSE to respond to the Deputy directly on this matter. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-05-08",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-05-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-05-08/writtens/mul@/dbsect_872.xml"
            }
          },
          "debateSectionId": "dbsect_872",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-05-08/writtens/dbsect_872",
          "showAs": "Ambulance Service Data"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-05-08/pq_942",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 942,
        "showAs": " 942. Deputy Hildegarde Naughton asked the Minister for Health the cost to the HSE in 2018 and to date in 2019 for the use of private ambulance transport of patients to and or from University Hospital Galway and Merlin Park University Hospital, Galway; and if he will make a statement on the matter. [19623/19] ",
        "answerText": " Minister for Health  As this is a service issue, I have asked the HSE to reply to you directly. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-05-08",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-05-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-05-08/writtens/mul@/dbsect_871.xml"
            }
          },
          "debateSectionId": "dbsect_871",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-05-08/writtens/dbsect_871",
          "showAs": "Ambulance Service Data"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-05-08/pq_943",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 943,
        "showAs": " 943. Deputy Hildegarde Naughton asked the Minister for Health the cost to the HSE in 2018 and to date in 2019 of intermediate care operative overtime of staff based in County Galway; and if he will make a statement on the matter. [19624/19] ",
        "answerText": " Minister for Health  I propose to take Questions Nos. 941 and 943 together.  I have asked the HSE to respond to the Deputy directly on this matter. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-05-08",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-05-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-05-08/writtens/mul@/dbsect_873.xml"
            }
          },
          "debateSectionId": "dbsect_873",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-05-08/writtens/dbsect_873",
          "showAs": "Ambulance Service Data"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-05-08/pq_944",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 944,
        "showAs": " 944. Deputy Hildegarde Naughton asked the Minister for Health the number of public patients transported by private ambulance nationally in each of the years 2013 to 2018 and to date in 2019; and if he will make a statement on the matter. [19625/19] ",
        "answerText": " Minister for Health  As this is a service issue, I have asked the HSE to reply to you directly. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-05-08",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    },
    {
      "contextDate": "2019-05-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-05-08/writtens/mul@/dbsect_874.xml"
            }
          },
          "debateSectionId": "dbsect_874",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-05-08/writtens/dbsect_874",
          "showAs": "Ambulance Service Data"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-05-08/pq_945",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 945,
        "showAs": " 945. Deputy Hildegarde Naughton asked the Minister for Health the number of public patients transported by private ambulance to and or from University Hospital Galway and Merlin Park University Hospital, Galway in each of the years 2013 to 2018 and to date in 2019; and if he will make a statement on the matter. [19626/19] ",
        "answerText": " Minister for Health  As this is a service issue, I have asked the HSE to reply to you directly. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-05-08",
        "by": {
          "showAs": "Hildegarde Naughton",
          "memberCode": "Hildegarde-Naughton.S.2013-07-19",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Hildegarde-Naughton.S.2013-07-19"
        }
      }
    }
  ]
}