{
  "head": {
    "counts": {
      "questionCount": 251,
      "resultCount": 251
    }
  },
  "results": [
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 76. Deputy Noel McCarthy asked the Minister for Children, Disability and Equality to provide an update on the measures being taken by her Department to increase the provision of childcare places in east Cork; and if she will make a statement on the matter. [73195/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "showAs": "Noel McCarthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_120",
          "debateSectionId": "dbsect_120",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_120.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_76",
        "questionNumber": 76
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 95. Deputy Noel McCarthy asked the Minister for Children, Disability and Equality the current average waiting times for early intervention autism assessments across the Cork region; the actions being taken by her Department to reduce delays for families seeking urgent supports; and if she will make a statement on the matter. [73259/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "showAs": "Noel McCarthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_139",
          "debateSectionId": "dbsect_139",
          "showAs": "Disabilities Assessments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_139.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_95",
        "questionNumber": 95
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  My Department chairs the Accelerating Renewable Electricity Taskforce (“ARE Taskforce”) which brings together officials from relevant Government Departments and agencies to identify the barriers to renewable growth and develop solutions to remove or minimise those barriers.  Under the aegis of the ARE Taskforce, work is underway on developing a supporting policy framework for Ireland’s electricity supply, one that will deliver a regional balance and distribution of renewable technologies, including solar PV and onshore wind, and enable Ireland’s electricity supply to keep pace with economic growth, protecting Irish homes and businesses from volatile fossil fuel prices through the deployment of indigenous wind and solar energy across our regions.  As part of this approach, Regional Renewable Electricity Capacity Allocations for solar and onshore wind were included in the First Revision of the National Planning Framework, published in April 2025. Further to the publication of the revised NPF, each Regional Assembly will be required to commence a revision of their Regional Spatial and Economic Strategies (RSES). As part of this RSES revision, each Regional Assembly will need to adopt a Regional Renewable Energy Strategy.  Officials from my Department are actively working with the three Regional Assemblies to support them in the integration of the capacity allocations as part of the development of these Regional Renewable Energy Strategies, which will translate the regional allocations into local authority-level targets and will inform City and County Development Plans, ensuring alignment between local plans and national policy. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 144. Deputy Noel McCarthy asked the Minister for Climate, Energy and the Environment to provide an update on his Department’s involvement in the Accelerating Renewable Electricity Taskforce and the development of an associated policy framework; and if he will make a statement on the matter. [73217/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "showAs": "Noel McCarthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_174",
          "debateSectionId": "dbsect_174",
          "showAs": "Renewable Energy Generation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_174.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_144",
        "questionNumber": 144
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  In May 2022, my department announced the publication of a report on the Review of Out-of-School Education Provision. This review focused on the education provision for learners under 16 years of age who have encountered difficulties staying in mainstream education.  Arising from that review, a number of recommendations were made to inform future policy and provide a sustainable option within the education system to further serve this group of learners.  In October 2022, an implementation group was established to progress the recommendations contained in that report and to develop a standardised framework of support for young people at risk of disengaging from education.  In addition to officials from my department, membership of the group included the National Council for Special Education (NCSE), National Association of Principals & Deputy Principals (NAPD), Children’s Rights Alliance (CRA), Tusla Education Support Services (TESS), Jigsaw, Department of Further and Higher Education Research Innovation and Science (DFHERIS), Education and Training Boards Ireland (ETBI), the National Parents Council (NPC), Department of Justice and the Irish Second Level Students Union (ISSU). The group was chaired by Dr Jacinta Stewart.  As the Implementation group consulted widely, taking on board the views of a range of stakeholders, agencies, and other interested parties including children and young people, parents, school leaders and practitioners from out-of-school education provision, it did not produce an interim or draft report.  The implementation group has now completed its work and I expect to receive a copy of the report very shortly. It is envisaged that the report will be published over the coming months. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 241. Deputy Noel McCarthy asked the Minister for Education and Youth the expected publication date of the implementation group’s updated progress report on Out of School Education Provision; if her Department is considering the publication of a draft or interim version of the progress report; the current work of the implementation group; and if she will make a statement on the matter. [72852/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "showAs": "Noel McCarthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_225",
          "debateSectionId": "dbsect_225",
          "showAs": "Departmental Reports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_225.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_241",
        "questionNumber": 241
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Defence  As Minister for Defence, I am deeply committed to the transformation of the Defence Forces into a modern fit for purpose organisation to defend the State and meet the challenges of today and the future.  In relation to air defence capability, the development of a new ground based air defence system, including Counter Unmanned Aircraft Systems (C-UAS) elements, is a key objective of the overall Military Radar Programme. In line with the Commission on the Defence Forces recommendations, this will be compatible with and integrated into the Recognised Air Picture (RAP). The required air defence capability will need to be deployable, scalable and fully interoperable to protect against any potential air threats.  Good progress is being made across all elements. I was pleased to recently welcome the approval by the Dáil of the Government’s proposal for a substantive capital supplementary estimate of €19 million on the Defence Vote. It is intended that the additional budget allocation will be used to procure, in an accelerated manner, Counter Unmanned Aerial System (C-UAS) capabilities for the Defence Forces, that will provide enhanced aerial protection..  It is anticipated that delivery of the C-UAS capability will be available for use by the Defence Forces, if needed, as part of the comprehensive security arrangements to be put in place during Ireland’s Presidency of the Council of the European Union in the second half of 2026.  In terms of the policy of my Department to pursue the establishment of an Irish Air Force, the Commission on the Defence Forces recommended in its 2022 report significant changes for the Defence Forces and Defence provision in Ireland. It covers high level Defence Forces structures, defence capabilities, organisation, culture and human resources, the Reserve Defence Force and funding.  In relation to the Air Corps and the Naval Service, the Commission on the Defence Forces stated \"Given the importance of service parity, the names of both should change to the Air Force and the Navy respectively.\" As part of the legislation on Command and Control (C2), it is proposed to change the name of the Air Corps to the Air Force.  The Commission on the Defence Forces also recommended \" The Chief of Defence to initiate an immediate force design process assisted by external experts with access to international military expertise, and to include a detailed force design process. \"  The Defence Forces have established three Force Design teams within the Army, Naval Service and Air Corps and an overarching strategic force design office has also been established to look at the design of a Strategic HQ.  On completion of the force design work by the Defence Forces, the Chief of Staff will submit a report on Force Design to me for review. This is complicated and challenging work which we need to get right to ensure that we design a modern force which is fit for purpose for future generations. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 139. Deputy Noel McCarthy asked the Minister for Defence to provide an update on Ireland’s air defence capability; if it remains the policy of her Department to pursue the establishment of an Irish Air Force; and if she will make a statement on the matter. [72037/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "showAs": "Noel McCarthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_77",
          "debateSectionId": "dbsect_77",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_77.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_139",
        "questionNumber": 139
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  The Defence Forces routinely carry out monitoring and surveillance of Ireland’s Exclusive Economic Zone (EEZ) using both Naval Service assets and Air Corps maritime patrol aircraft. In addition to at sea monitoring, the Naval Operations Command Centre in Haulbowline carries out remote monitoring twenty four hours a day, seven days a week.  It is clear that protecting critical undersea infrastructure requires collaboration within the State as well as collaboration with other European states to provide a broader understanding of what is occurring in the greater maritime space. This means that Government Departments and agencies, infrastructure operators, the Defence Forces, the private sector and academia all have a part to play. Safeguarding critical undersea infrastructure requires a multifaceted approach with a wide variation of parties involved.  To that end, my Department has taken the lead in the development of a National Maritime Security Strategy following identification of maritime security as a priority in last year’s Defence Policy Review. This strategy is being developed in consultation with national and international stakeholders. I anticipate that this new strategy will provide a roadmap over the next five years to safeguard Ireland’s sovereign maritime interests, ensure safe and secure seas and support international legal order in the maritime domain. I intend to bring this strategy to Government next year. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 141. Deputy Noel McCarthy asked the Minister for Defence the measures being taken by her Department to ensure the protection of critical subsea infrastructure such as the Celtic Interconnector; if she is satisfied that the current operational strength of the Naval Service is sufficient to deter or respond to such threats; and if she will make a statement on the matter. [72038/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "showAs": "Noel McCarthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_80",
          "debateSectionId": "dbsect_80",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_80.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_141",
        "questionNumber": 141
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  Under the Road Safety Authority Act 2006, RSA has statutory responsibility for the promotion of public awareness campaigns and for the advancement of education specific to the safe use of roads. There has been a significant increase in spending on public awareness, communications and education campaigns by the RSA in recent years. As in 2025, the RSA will again ringfence funding of €18 million for awareness, education and promotional campaigns in 2026. This will ensure a continued focus on campaigns that make our roads safer for all road users.  I am informed by the RSA that in January and December they ran a social media campaign to promote the correct use of lights for cars. The RSA also placed a print advert in the Farmers Journal in July to remind farmers of the rules around the use of works lights and reminding them to turn them off before going on the public road. They are promoting this message across Agriland in December.  In October this year the RSA developed new radio and social media assets advising people to make sure they do seasonal checks on their vehicle as we headed into winter. Checking that lights are working properly was included in that messaging.  The RSA have also just filmed a walkaround check for motorcycles and tractors that also highlights the need to check their lights are working before moving off.  Non functioning or defective headlights would also be an element of the National Car Test (NCT) for relevant vehicles. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 327. Deputy Noel McCarthy asked the Minister for Transport the driver information campaigns that currently exist or are planned for the purposes of informing drivers of the necessity of ensuring that both headlight bulbs are functional; and if he will make a statement on the matter. [72279/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "showAs": "Noel McCarthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_236",
          "debateSectionId": "dbsect_236",
          "showAs": "Road Safety",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_236.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_327",
        "questionNumber": 327
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The Vacant Property Refurbishment Grant, introduced in July 2022, provides a grant of up to €50,000 for the refurbishment of vacant properties for occupation as a principal private residence and for properties which will be made available for rent. A top-up grant of up to €20,000 is available where the property is confirmed to be derelict, bringing the total grant available for a derelict property up to a maximum of €70,000.  The objective of the grant is to support the refurbishment of vacant and derelict properties, bringing them back into use as homes. In order to qualify for the grant, the property must be vacant for two years or more at the time of application.  The grant is administered and managed by local authorities, who process and decide on applications in line with the scheme conditions and issue grant payments on completion of approved refurbishment works. In exceptional circumstances where a grant applicant has moved into a former vacant property in the weeks prior to making a grant application, this may be considered by the local authority. This will, however be a matter for them.  Where an application is not successful, the applicant can lodge an appeal with the local authority to whom the application was made. A senior local authority official who was not involved with the original decision will assess the appeal and contact the applicant with the outcome. If the applicant's appeal is unsuccessful they can lodge a complaint with the Ombudsman.  Information on the scheme and conditions is available for applicants on my Department's website at [ Vacant Property Refurbishment Grant ]. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 604. Deputy Noel McCarthy asked the Minister for Housing, Local Government and Heritage if there are instances whereby the Vacant Property Refurbishment Grant will be approved for an applicant who has sold their house, moved into a vacant property, and then applied for the grant for that property; and if he will make a statement on the matter. [72300/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "showAs": "Noel McCarthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_476",
          "debateSectionId": "dbsect_476",
          "showAs": "Vacant Properties",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_476.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_604",
        "questionNumber": 604
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  On 25 April 2023, the Government approved additional measures under the Housing for All Action Plan to incentivise the activation of increased housing supply and help reduce housing construction costs, including the introduction of temporary time-limited arrangements for the waiving of local authority “section 48” development contributions and the refunding of Uisce Éireann water and waste water connection charges.  The Government recognised that measures needed to be put in place to help address cost and viability with a view to incentivising the activation of a pipeline of new housing commencements, and assisting in the delivery of supply as quickly as possible. The waiver scheme applied to all permitted residential development including multi-unit developments, self-build houses and one-off houses, student accommodation and sheltered housing.  The schemes initially applied for one year to all permitted residential development that commenced on site between 25 April 2023 (the date of the Government Decision approving the measure) and 24 April 2024, and that are completed not later than 31 December 2025. On 23 April 2024, the Government approved an extension for the waiving of local authority “section 48” development contributions in respect of residential development commenced not later than 31 December 2024 and the refunding of Uisce Éireann water and waste water connection charges in respect of residential development commenced not later than 30 September 2024.  In April 2024, the final date for the completion of development works on qualifying houses under the schemes was extended from 31 December 2025 to 31 December 2026. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 613. Deputy Noel McCarthy asked the Minister for Housing, Local Government and Heritage the instances in which an application would be considered for the development contribution waiver scheme after the application deadline; and if he will make a statement on the matter. [72329/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "showAs": "Noel McCarthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_480",
          "debateSectionId": "dbsect_480",
          "showAs": "Development Contributions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_480.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_613",
        "questionNumber": 613
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  The Long-Term Illness (LTI) Scheme was established under Section 59(3) of the Health Act 1970 (as amended). Regulations were made in 1971, 1973 and 1975, prescribing 16 conditions to be covered by the Scheme. Further information, including the list of conditions, can be found at: www2.hse.ie/services/schemes-allowances/lti/about/  Under the LTI Scheme, patients receive drugs, medicines, and medical and surgical appliances directly related to the treatment of their illness, free of charge. While there are currently no plans to extend the list of conditions, it is important to remember that the LTI Scheme exists within a wider eligibility framework.  People who cannot, without undue hardship, arrange for the provision of medical services for themselves and their dependants may be eligible for a medical card under the General Medical Services (GMS) Scheme. In accordance with the provisions of the Health Act 1970 (as amended), eligibility for a medical card is determined by the HSE.  In certain circumstances the HSE may exercise discretion and grant a medical card, even though an applicant exceeds the income guidelines, where he or she faces difficult financial circumstances, such as extra costs arising from illness. The HSE afford applicants the opportunity to furnish supporting documentation to determine whether undue hardship exists and to fully take account of all relevant circumstances that may benefit them in assessment.  In circumstances where an applicant is still over the income limit for a medical card, they are then assessed for a GP visit card, which entitles the applicant to GP visits without charge.  The issue of granting medical card eligibility based on having a particular disability or illness was previously examined in 2014 by the HSE Expert Panel on Medical Need and Medical Card Eligibility. The Group concluded that it was not feasible, desirable, nor ethically justifiable to list medical conditions in priority order for medical card eligibility. In following the Expert Group’s advice, a person’s means remains the main qualifier for a medical card.  Under the Drugs Payment Scheme (DPS), no individual or family pays more than €80 a month towards the cost of approved prescribed medicines. The DPS is not means tested and is available to anyone ordinarily resident in Ireland. The DPS significantly reduces the cost burden for families and individuals with ongoing expenditure on medicines.  There has been a significant focus on improving access to and the affordability of healthcare services over the last few years. This includes reductions in the DPS threshold, expansion of access to free GP care, and the abolition of all public in-patient hospital charges for children and adults. These measures continue to create a health and social care service that offers affordable access to quality healthcare.  Individuals may also be entitled to claim tax relief on the cost of their medical expenses, including medicines prescribed by a doctor, dentist, or consultant. Relief is at the standard tax rate of 20%. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 956. Deputy Noel McCarthy asked the Minister for Health her plans to include Alzheimer’s disease as a qualifying medical condition under the long-term illness scheme; and if she will make a statement on the matter. [71717/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "showAs": "Noel McCarthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_769",
          "debateSectionId": "dbsect_769",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_769.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_956",
        "questionNumber": 956
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 1098 and 1099 together.  On the 18th of November 2025 the Government approved the addition of measures to the draft Public Heath (Tobacco Products and Nicotine Inhaling Products) (Amendment) Bill to regulate all non-medicinal nicotine products, such as pouches. These measures are a minimum legal age of sale, restrictions on point of sale display and a prohibition on advertising in retail outlets. These measures are currently being drafted with the Office of the Attorney General. Nicotine pouches are not currently subject to regulation under European Union tobacco control legislation. A harmonised EU-wide framework for regulating novel nicotine products would be more effective than individual Member State action, as it prevents regulatory circumvention through cross-border purchases. In this context and representing the views of Ireland and several other Member States, I have urged the European Commission to introduce new legislation at the earliest opportunity. Furthermore, I also have advocated for the inclusion of all novel nicotine products - such as nicotine pouches - within the scope of this proposal. I have also called for a prohibition on cross-border distance sales to ensure the integrity of national regulatory measures. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1098. Deputy Noel McCarthy asked the Minister for Health her plans to bring forward amendments to the Public Health (Tobacco Products and Nicotine Inhaling Products) Act 2023 to explicitly include nicotine pouches within its scope; whether all relevant provisions of the Act will apply to such products; and if she will make a statement on the matter. [72325/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "showAs": "Noel McCarthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_912",
          "debateSectionId": "dbsect_912",
          "showAs": "Legislative Measures",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_912.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1098",
        "questionNumber": 1098
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 1098 and 1099 together.  On the 18th of November 2025 the Government approved the addition of measures to the draft Public Heath (Tobacco Products and Nicotine Inhaling Products) (Amendment) Bill to regulate all non-medicinal nicotine products, such as pouches. These measures are a minimum legal age of sale, restrictions on point of sale display and a prohibition on advertising in retail outlets. These measures are currently being drafted with the Office of the Attorney General. Nicotine pouches are not currently subject to regulation under European Union tobacco control legislation. A harmonised EU-wide framework for regulating novel nicotine products would be more effective than individual Member State action, as it prevents regulatory circumvention through cross-border purchases. In this context and representing the views of Ireland and several other Member States, I have urged the European Commission to introduce new legislation at the earliest opportunity. Furthermore, I also have advocated for the inclusion of all novel nicotine products - such as nicotine pouches - within the scope of this proposal. I have also called for a prohibition on cross-border distance sales to ensure the integrity of national regulatory measures. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1099. Deputy Noel McCarthy asked the Minister for Health the specific regulatory measures she is preparing in relation to nicotine pouches as part of the forthcoming Public Health (Tobacco Products and Nicotine Inhaling Products) (Amendment) Bill 2025; including any proposed restrictions, controls, or enforcement mechanisms; and if she will make a statement on the matter. [72326/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "showAs": "Noel McCarthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_912",
          "debateSectionId": "dbsect_912",
          "showAs": "Legislative Measures",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_912.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1099",
        "questionNumber": 1099
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Deputy Noel McCarthy  I ask the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation what progress has been made to date with respect to the Midleton flood relief scheme and the introduction of flood protection measures in Rathcormac, Castlemartyr, Mogeely and Killeagh in east Cork, and if he will please make a statement on the matter. \n Deputy Kevin Boxer Moran  Across Cork, nine flood relief schemes are completed. The OPW is currently providing funding to Cork County Council for nine staff for the delivery of 15 additional flood relief schemes across the county, which are all funded by the Government’s commitment to support the delivery of flood relief schemes under the national development plan. Six of these are in tranche 1 schemes and are under way at this time, including Midleton.  The Midleton flood relief scheme is due to be submitted by Cork County Council to An Coimisiún Pleanála in quarter 3 of 2026 and be substantially complete by 2031, protecting up to 750 properties that flooded during Storm Babet. Cork County Council, in June 2025, submitted a marine area consent application to the Maritime Area Regulatory Authority.  Advance works of €5.8 million at Midleton were recently submitted for planning under Part 8 and a public information day was held on 23 October. Subject to planning consent, construction works to protect 135 properties are expected to commence in late summer or early autumn 2026. Castlemartyr, which includes Mogeely, Rathcormac and Youghal are not in the first tranche of schemes being designed at this time. The specialised nature of engineering required means having trebled the number of schemes at design and construction to 100, Ireland is constrained by availability of specialised resources to commence new schemes.  Cork County Council is rolling out a €5.8 million individual property protection scheme across Midleton and east Cork to some 725 homes and businesses affected by Storm Babet in October 2023. This forms part of the council’s emergency response to these areas.  The council and the OPW meet quarterly with the local elected representatives, businesses and the community to keep them updated on and provide input into the planned works on the Midleton flood relief scheme and other measures, including those across east Cork. The next meeting will be held on 22 January. Cork County Council, with funding from the OPW, is introducing localised flood mitigation measures for communities across east Cork. \n Deputy Noel McCarthy  I acknowledge the work the Minister of State has done so far and his visits to these areas already. I acknowledge that and thank him. On 18 October 2023, Storm Babet flooded roughly 600 homes and 300 businesses in east Cork, with damages estimated at almost €200 million. The storm on 9 December of this year showed again that people in east Cork feel genuine fear every time a severe weather warning is issued. These storms are not slowing down, yet the Midleton flood relief scheme is still not expected to reach planning until some point next year, as the Minister of State said. Completion is even further out. In the meantime, people's homes, livelihoods and local businesses remain at risk and the State is exposed to repeated multimillion euro damages and costs. Given the scale of impact on Midleton in particular, can the Minister of State commit to visiting the town and engaging directly with businesses and residents on this urgent matter? It would be a great relief and reassurance if he could visit again because of the fear they constantly have. \n Deputy Kevin Boxer Moran  If my wife hears I am going to Cork again, she will think I am either running for the election down there or I am having an affair. I will visit Midleton again because I am very keen to drive on the scheme. I have my Department working with the local authorities and the Deputies. As the Deputy knows, I have visited Midleton and nearly all the areas he mentioned. I have been down there twice and I am trying to drive on the scheme but the Midleton scheme is very complex. There are four different sources of flooding that happen in the one area. I understand and read what people are saying about the frustrations they are feeling. I understand it; no one knows this more than myself. It is about trying to deliver a scheme. We get one chance to get it right; if we do not, it will flood. This takes time and it is complex. When we go in and start the job, yes, we will leave Midleton in a much better place. People want to see that happening now but the interim measures, and the changes we have made to the minor works scheme, is a huge help to the local authorities. I will continue to engage with the Deputy, as I will with the people of Midleton, but, in particular, I will be driving on these schemes through the local authorities. I need more push from the Deputies to drive that as well. \n Deputy Noel McCarthy  I again thank the Minister of State for his response and the reassurance that he will visit Midleton in 2026. I think that is very important for the people of Midleton and the whole of east Cork affected by this.  While long-term schemes are being developed, the communities affected are looking for reassurance in the short term. These towns have already endured repeated flooding events and are facing another winter feeling unprotected. Could the Minister of State outline what interim measures are being put in place to support these communities until the Midleton flood relief scheme is delivered and whether additional resources can be made available to ensure local authorities are equipped to respond quickly to future storms? Rathcormac, Mogeely, Killeagh and Castlemartyr are disappointed they are not in tranche 1. Could they also be included? I thank the Minister of State for the money that was given to Rathcormac but what the people of Rathcormac want to see is work to be progressed there when money is available. I thank the Minister of State for the work he has done so far. \n Deputy Kevin Boxer Moran  Again, with regard to those areas mentioned, I changed the criteria in the minor works scheme, so it is up to the local authority now to look at interim measures. We have supplied it with nine staff so it is up to the local authority to look at those areas in question to see if we can help it to move on.  In regard to Midleton, as the Deputy knows, we have done individual property protections, IPPs, and business protection. I know it is low but it is the biggest scheme we have ever taken on with regard to how many houses are affected and need support. Putting in the floodgates at the homes and businesses has been rolled out, as the Deputy knows, and it is slow.  In fairness to it, the local authority has carried out other interim measures in Midleton and we are close to coming in with Part 8 planning in certain parts of the area. If we could get that over the line, it would be a huge plus for the local people in Midleton. I know it will not satisfy everyone because it is one section, but the changes I have made to the minor works scheme mean that Cork County Council, working with the Deputy and other public representatives, could move to drive more of the interim measures. I believe in interim measures. I believe that while we are waiting for a long-term solution, these are vital. That is why I made this choice. ",
        "questionType": "oral",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 7. Deputy Noel McCarthy asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the progress made to date with respect to the Midleton flood relief scheme, and the introduction of flood protection measures in Rathcormac, Castlemartyr, Mogeely and Killeagh in east Cork; and if he will make a statement on the matter.  [70396/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "showAs": "Noel McCarthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/dbsect_9",
          "debateSectionId": "dbsect_9",
          "showAs": "Flood Relief Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/mul@/dbsect_9.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_7",
        "questionNumber": 7
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Cork County Council is the owner of, and has responsibility for, the maintenance and repair of the weir in Fermoy.  This weir does not form part of the Fermoy Flood Relief Scheme works, which were implemented to protect the community of Fermoy from a 1-in-100 year fluvial flood event. The in-river works that were completed as part of the Scheme maintained a clearance between the works area and the weir, thus preventing Scheme works from impacting on the weir. Accordingly, the OPW has no statutory responsibility specifically in relation to the weir in Fermoy, its repair or its maintenance.  In February 2024, An Bord Pleanála approved Cork County Council’s application for the proposed Fermoy Weir Remedial Works and Fish Bypass project. In the intervening period, the Council has received the necessary consent from the OPW to undertake ground-investigation works to progress this project. The Council are currently sourcing funding to commence these works and to initiate the main project.  I understand that, in 2018, the then Minister of State at the Department of the Environment, Climate and Communications confirmed that his Department and Inland Fisheries Ireland would support an application by Cork County Council for central funding in the context of fisheries and habitat issues related to the weir remedial works and fish bypass project.  Once funding is in place and the ground investigations are complete, the OPW will continue to work with Cork County Council towards their progression of this project. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 68. Deputy Noel McCarthy asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation to provide an update on the progression of the proposed repair of Fermoy Weir; and if he will make a statement on the matter. [70425/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "showAs": "Noel McCarthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_107",
          "debateSectionId": "dbsect_107",
          "showAs": "Flood Risk Management",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_107.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_68",
        "questionNumber": 68
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school under reference in Fermoy was established in 2018 under the patronage divestment process.  Fermoy was one of a number of areas surveyed in 2012/13 under the patronage divesting process, where there was sufficient parental demand supporting changes in school patronage. The areas surveyed were areas where demographics were not growing and therefore it was unlikely that a new multi-denominational school would be established for demographic reasons.  The clear policy on patronage divesting was to use existing educational infrastructure to facilitate provision of diversity in areas where there was no demographic imperative to establish new schools.  The reason for this approach was the imperative – equally valid now as it was then - to focus the schools capital programme on the provision of additional mainstream and special education school places at both primary and post-primary levels to ensure that every pupil can access a school place.  As part of the process of identifying a suitable accommodation solution which would facilitate the establishment of the school in 2018, my department liaised with Cork Education and Training Board. In order to facilitate the establishment of the new school, Cork ETB agreed to the co-location of the Educate Together school at the former Technical School in Fermoy, together with some of the ETB’s Further Education and Training services.  Prior to the establishment of the new school in 2018 under the patronage divesting process, my Department and Educate Together, as school patron, agreed that given the accommodation available at the property and the need for Cork ETB to accommodate some Further Education and Training services from the property, the school would be established as a four-classroom school and that the school would maintain this configuration in the accommodation in the former Technical School unless an existing school building was freed up for use in the area.  My department is currently liaising with Cork ETB in relation to the accommodation available within the building. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 138. Deputy Noel McCarthy asked the Minister for Education and Youth to provide an update on the provision of increased accommodation for a school (details supplied); and if she will make a statement on the matter. [70410/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "showAs": "Noel McCarthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_160",
          "debateSectionId": "dbsect_160",
          "showAs": "School Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_160.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_138",
        "questionNumber": 138
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The campus referred to by the Deputy was completed in Q4 2023 and delivered a new 1,000 pupil post-primary school and two 24 classroom primary schools and accommodation, including 14 classrooms across the three projects, for children with special education needs. The campus project also delivered 3 GP areas, a PE Hall in the post-primary school and 13 ballcourts in total.  The lands to the south of the site have been designated as a flood retention area as required under the campus flood mitigation design. The area will be subject to ponding of water and potential flooding given that these lands are designed to retain overflow flood waters during periods of heavy rainfall.  A planning application was submitted to the local authority by the contractor to provide an access road and entrance to this area. A Notification of Decision to Grant Planning Permission was received from Cork County Council on 20th February 2025. The scope of works and associated costs are to be submitted to my department for review. Upon receipt, review and approval of scope and costs, and on completion of the works, the area will be made available and is to be managed by the post-primary school in terms of shared access for all three schools on the campus as a green area. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 151. Deputy Noel McCarthy asked the Minister for Education and Youth further to Parliamentary Question No. 138 of 17 July 2025, the progress made to date by her Department to ensure that a green area is made available for the use as a playing pitch by local schools (details supplied); and if she will make a statement on the matter. [70409/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "showAs": "Noel McCarthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_174",
          "debateSectionId": "dbsect_174",
          "showAs": "Sports Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_174.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_151",
        "questionNumber": 151
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Rural and Community Development and the Gaeltacht  The Local Enhancement Programme (LEP) is targeted towards supporting communities that are impacted by disadvantage, as identified in the Local Economic and Community Plan (LECP) of the relevant local authority. It provides small capital grants to community and voluntary groups for the improvement/refurbishment of their facilities and/or the purchase of equipment. It operates in a complementary manner to add value to other front-line schemes and programmes being operated in communities.  The fund is administered locally on behalf of my Department by Local Community Development Committees (LCDCs) across the country, with support from their local authority.  The Local Enhancement Programme for 2025 was announced in November 2024 and provided €6 million in capital supports to many small community groups and organisations, particularly those who serve disadvantaged communities in rural and urban areas. It also provided a further €1 million in current funding to community Groups, including Men’s Sheds and Women’s Sheds, to assist with their energy and running costs. The 2025 Programme is now closed for applications.  My Department is currently considering a Local Enhancement Programme for 2026 and I expect to announce details of the new programme shortly.  I would encourage all community and voluntary organisations to check their local council's website and to engage with their Local Community Development Committees (LCDCs) to ensure that they are aware of the application process for LEP 2026. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 21. Deputy Noel McCarthy asked the Minister for Rural and Community Development and the Gaeltacht when the next funding round of the Local Enhancement Programme will be open for applications; and if he will make a statement on the matter. [68387/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "showAs": "Noel McCarthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_58",
          "debateSectionId": "dbsect_58",
          "showAs": "Community Development Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_58.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_21",
        "questionNumber": 21
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Deputy Noel McCarthy  I thank the Minister, Ministers of State and their staff for their work so far and their responses. \n Minister of State at the Department of Justice, Home Affairs and Migration (Deputy Colm Brophy)  I thank the Deputy for his question and his remarks. Earlier this week I was delighted to attend the citizenship ceremonies held in Killarney along with the Ministers of State, Deputies Collins and Buttimer. It is a wonderful ceremony to go to. We had 5,200 new Irish citizens there.  Last year the number of naturalisation applications received by the Department was 27,032. Separately, the number of people who received a letter of approval was 29,868 and 187 were refused. Despite the substantial increase in applications received in recent years, the fact processing times have significantly reduced is a huge credit to the work of the Department and the staff in that particular area. The median processing time for a decision on an application in 2024 was eight months. This is a significant improvement from the median processing time of 15 months in 2023, 19 in 2022 and 24 in 2021. The Department has taken a significant number of steps to speed up the process for applicants. These included introducing an online digital application, online payments and the introduction of evetting. This digitisation has facilitated a record number of citizenship decisions made last year. In just over two years, my Department has gone from processing around 12,000 applications a year to processing over 20,000 applications in 2023, more than 31,000 decisions in 2024 and over 32,500 to end October 2025.  I assure everyone who has an application for naturalisation submitted to the citizenship division that the Department is doing everything to progress it. However, it is important to note that no two naturalisation applications are the same and some take longer than others to process. It is important the citizenship process be robust and comprehensive. Checks are carried out on each application. Unfortunately some of the international checks can take considerable time and this is largely outside of the control of the Department. I am sure the Deputy receives, as I and many others in this House do, receive representations on that. For that reason, while I expect going forward more applicants will receive a decision within one year, it cannot be guaranteed. \n Deputy Noel McCarthy  I thank the Minister of State for his response. I again thank his departmental staff. He mentioned Killarney last week and I know people who were there. Friends of mine got their citizenship and were very proud to do so. Again, I ask him pass on my thanks to all the staff.  It is important the Department continues to plan ahead as application numbers change. In that context, does he foresee an increase in naturalisation applications next year? Has the Department put in place the necessary planning to avoid any risk of new backlogs? \n Deputy Colm Brophy  The Department is always planning ahead and looking at that. We have put, as I said, additional resources in place. I do not believe additional backlogs will come in. Every effort is made. As I know people will listen to this, I reiterate that no two applications are the same. Some individual applications that come in take considerably longer, particularly in relation to checks that have to be done by An Garda Síochána, which are outside our direct control in terms of reply lines. That leads to a frustration where people ask why their application is taking X amount of time compared with those from others.  As a general rule, the Department is working towards a processing time of within 12 months for applications coming in. \n Deputy Noel McCarthy  I thank the Minister of State for his detailed response. With the ongoing modernisation of the immigration system, many applicants are keen to see how these changes are working. Will the Minister of State update the House on how the recent digitalisation measures have affected processing times so far, and whether further reforms or improvements are planned for 2026? \n Deputy Colm Brophy  As I indicated in my initial response, we have seen very significant reductions in processing times. The objective is to try to provide that service within as tight a 12-month timeframe as we can. We will continue to do that. As I mentioned, there will always be individual cases where that is not the case. In the context of a significant increase in the number making applications in recent years, we have seen the processing time decrease in the handling of that increased volume. I would like to put on record that this is a result of the excellent work being done by the staff in that area in the Department. They are based in Tipperary and do an excellent job in processing these applications. ",
        "questionType": "oral",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 82. Deputy Noel McCarthy asked the Minister for Justice, Home Affairs and Migration the number of naturalisation applications received, rejected, and approved from 2021 to 2024 inclusive, and to date in 2025, in tabular form; and if he will make a statement on the matter. [68265/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "showAs": "Noel McCarthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/dbsect_26",
          "debateSectionId": "dbsect_26",
          "showAs": "Naturalisation Applications",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/mul@/dbsect_26.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_82",
        "questionNumber": 82
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I can inform the Deputy that under section 72 of the International Protection Act, I, as Minister for Justice may make an order designating a country as a safe country of origin.  A country may only be designated as a safe country of origin where satisfied it can be shown that there:  * is generally and consistently no persecution;  * no torture or inhuman or degrading treatment or punishment; and  * no threat by reason of indiscriminate violence in situations of international or internal armed conflict.  Ireland currently has fifteen countries designated as safe countries of origin: Albania, Bosnia and Herzegovina, North Macedonia, Georgia, Montenegro, Kosovo, Serbia, South Africa, Botswana, Algeria, Brazil, Egypt, India, Malawi and Morocco.  I will continue to keep the list of safe countries under review.  As the Deputy will be aware, Ireland has opted in to the EU Migration and Asylum Pact , a new EU framework to manage migration and asylum for the long-term. The overall objective of the Pact is to provide a fair, sustainable and efficient asylum procedure. This will be done through convergence in asylum practices across the EU.  The Asylum Procedure Regulation (Regulation 2024/1348) makes provision for the designation of safe countries of origin at European Union level. Common designation of safe countries of origin at Union level should ensure that the safe country of origin concept is applied by all Member States in a uniform manner in relation to applicants whose countries of origin are designated as safe at Union level. The Proposal does not propose to amend Article 64 of the Asylum Procedure Regulation. Therefore, the right of Member States to designate additional countries outside the common list will continue. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 116. Deputy Noel McCarthy asked the Minister for Justice, Home Affairs and Migration his Department’s plans for the designation of further countries as safe countries of origin, for the purposes of international protection; and if he will make a statement on the matter. [68266/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "showAs": "Noel McCarthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_140",
          "debateSectionId": "dbsect_140",
          "showAs": "International Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_140.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_116",
        "questionNumber": 116
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  All passport applications are subject to the requirements of the Passports Act 2008, as amended ('2008 Act').  First time applications are too complex to process at a public counter as they are essentially verifications of Irish citizenship.  It is the responsibility of the Passport Service to protect the integrity of the Irish passport system. As such, a rigorous process is in place to validate the identity of applicants and to confirm their citizenship status.  In the case of first time passport applications for children, the consent of guardians must also be thoroughly validated. It is vitally important that the consent of a child's guardians is witnessed correctly in order to protect the integrity of the passport application process and the rights of the child and their guardians.  In order to comply with its obligations under data protection legislation, the Department holds data collected for the purposes of processing an application, only as long as there is a business need to do so, in line with the purposes for which the data was collected. The Passport Service's Data Privacy Notice provides for data to be held for 15 years after the date of issuance. After this time, the data is due for destruction and will be destroyed in line with internal guidelines and guidelines for destruction received from the National Archives. A minimum amount of data can be held beyond this period for the purpose of fraud prevention. Therefore, a renewal application made more than 15 years after the issuance of a passport, is treated as a first time application.  Due to the extra measures applied by highly trained and experienced staff, first time online passport applications take 20 working days to process.  The Travel Emergency service is available to all citizens in cases of medical emergency or death of a family member abroad. The Passport Service will expedite a first time passport application where the criteria for travel emergency has been met and where the applicant's entitlement to Irish citizenship and identity has been proven. For all children's applications, the Child Identity and Consent form must be correctly completed, witnessed and validated by the Passport Service. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Noel McCarthy",
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_77.xml"
            }
          },
          "debateSectionId": "dbsect_77",
          "showAs": "Passport Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_77"
        },
        "questionNumber": 46,
        "date": "2025-11-27",
        "showAs": " 46. Deputy Noel McCarthy asked the Minister for Foreign Affairs and Trade if her Department is considering the provision of emergency passport appointments for first-time applications for children, or for adult renewal applications where the applicant’s passport is over 15 years from the date of issue; and if she will make a statement on the matter. [66736/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_46"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  Maintaining and strengthening bilateral relations with the US and Canada is a top priority for this Government. This is reflected in our level of investment in the relationships.  In the US, Ireland has nine diplomatic missions, including our Embassy in Washington DC and eight Consulates General. This network of diplomatic missions has been expanded under the Global Ireland Strategy, with the opening of new Consulates General in Los Angeles and Miami. They complement the established network of Consulates General in Atlanta, Austin, Boston, Chicago, New York and San Francisco. In Canada, we have opened Consulates General in Vancouver and Toronto to support the work of our Embassy in Ottawa. In September, the Tánaiste opened our new Embassy building on Pennsylvania Avenue in Washington D.C. and the Taoiseach opened the new Embassy building in Ottawa.  This diplomatic network works in a highly collaborative way with the state agencies, as one Team Ireland, to advance Irish interests. Many of our missions operate in a Ireland House format, with the diplomatic and state agency teams working under one roof.  As well as expanding our mission network, we have deepened our expertise in the US and Canada with the presence of two Talent and Innovation Attachés, three Cultural Officers, and a dedicated Francophone Officer to advance Ireland's outreach and engagement to French speaking Canadians.  While there are no current plans to establish new diplomatic missions in the U.S. or Canada, the 2026 Budget included a new allocation of €2.5 million to reinforce Ireland’s Embassy and Consulates General across the U.S. and strengthen Ireland’s presence in key locations around the world as part of the Government’s Market Diversification Strategy. In the new year, I will bring forward a new strategy for our relations with the U.S. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Noel McCarthy",
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_88.xml"
            }
          },
          "debateSectionId": "dbsect_88",
          "showAs": "Diplomatic Representation",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_88"
        },
        "questionNumber": 62,
        "date": "2025-11-27",
        "showAs": " 62. Deputy Noel McCarthy asked the Minister for Foreign Affairs and Trade her Department’s plans to expand Ireland’s diplomatic presence across Canada and the United States; and if she will make a statement on the matter. [66710/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_62"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 112, 117, 133 and 144 together.  Since early November, there have been four outbreaks of highly pathogenic avian influenza (HPAI) caused by the H5N1 virus in turkey flocks in counties Carlow, Meath, Monaghan, and Laois.  My Department has been implementing disease control and eradication measures in line with the EU Animal Health Law provisions and national legislation. This includes the placing of 3km radius protection zones and 10km radius surveillance zones around each holding where an outbreak has occurred, and implementing surveillance and disease control measures within these zones.  Prior to this, an outbreak of HPAI occurred in a confined establishment in Cork in October, following which that establishment was closed while disease control measures were implemented in line with the legislation.  The H5N1 virus has been circulating in wild birds throughout the country during 2025, creating a serious and ongoing risk of infection to poultry and captive bird flocks.  I introduced mandatory biosecurity measures on 1st November and a housing order on 10th November for all poultry and captive bird owners, with similar measures being undertaken in Northern Ireland. My Department also meets regularly with poultry stakeholders to keep them appraised of this developing situation, with the most recent meeting taking place on 20th November.  The Animal Health and Welfare Act (2013) provides that compensation to owners of animals may be payable if a cull of those animals is directed by my Department in the event of a HPAI outbreak.  The compensation may relate to the animal that is culled, or to an animal product, animal feed or similar item that is destroyed in relation to the outbreak. The compensation may not exceed the open market value of the animal or item. Compensation is payable only to the owner of the animals or items affected.  Strong biosecurity remains our most effective tool for preventing the spread of this disease. All poultry and captive bird keepers should remain vigilant of any signs of the disease and to report any suspicion to their local Regional Veterinary Office without delay.  My Department issues regular updates on the avian influenza situation in Ireland and publishes guidance on the Government Website at www.gov.ie/birdflu ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Noel McCarthy",
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_111.xml"
            }
          },
          "debateSectionId": "dbsect_111",
          "showAs": "Animal Diseases",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_111"
        },
        "questionNumber": 133,
        "date": "2025-11-27",
        "showAs": " 133. Deputy Noel McCarthy asked the Minister for Agriculture, Food and the Marine the measures being taken by his Department to contain the spread of avian influenza; and if he will make a statement on the matter. [66729/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_133"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  My Department is fully committed to reforming the family justice system in Ireland through implementation of the Family Justice Strategy 2022-2025. This is an ambitious programme of reform which sets out a vision for a system refocused on the needs and rights of children, who are central to many family justice matters.  The Family Courts Act 2024 is a key component of my Department's Family Justice Strategy and contains a number of provisions designed to make the family court process more user-friendly and less costly. Commencing the Family Courts Act 2024 is a priority for Government and an implementation team has been established within my Department. As committed to in the Programme for Government, I intend to publish an implementation plan for a new Family Court System by the end of January 2026.  The Act provides for the establishment of family court divisions within the existing court structures, namely a Family High Court, a Family Circuit Court and a Family District Court, each dealing with family law matters as appropriate to its jurisdiction. Each of these Family Courts will have judges with appropriate specialist knowledge assigned to them on a full-time basis, and the Act also provides for ongoing professional training in the area of family law.  The Act includes a set of guiding principles for the family court system to make the best interests of the child a primary consideration in all family law proceedings, which all parties to proceedings will be required to have regard to. The principles include:  • In family proceedings in which the welfare of a child is involved or likely to be affected, ensuring that the best interests of the child are a primary consideration; the child is informed in an age-appropriate manner; and the views of the child are ascertained and taken into account.  • The court placing an emphasis to minimise risk to the safety of any party to family law proceedings in cases where this is a concern.  • Conducting proceedings in a manner which is user-friendly and accessible.  • Encouraging and facilitating the use of alternative dispute resolution methods, such as mediation, to resolve family law disputes without recourse to the courts, in so far as is possible and appropriate.  • Operating in an efficient manner which is likely to minimise the cost of the proceedings and encouraging active case management by the courts.  In line with these guiding principles, key changes being introduced by the Act will include an applicant or respondent being restricted from personally cross examining a child unless the Court considers it in the interests of justice to do so. Instead, provision is made for a legal representative to conduct the cross examination, and legal aid can be provided.  Many families make their own arrangements in relation to access or contact. Where support is needed, this can be accessed initially via the range of universal and targeted parenting supports provided by the Minister for Children, Disability and Equality, the Child and Family Agency Tusla, and the network of family resource centres and other voluntary and community family support services which it funds.  Where the support of the legal system is required, I am committed to facilitating the increased use of mediation, in line with the principles of the Family Courts Act 2024. Mediation offers people the opportunity to resolve their disputes without the adversarial strain of the courtroom. Goal 4 of the Family Justice Strategy aims to promote more co-operative, less adversarial ways for individuals, children and families to try to resolve disputes. This goal contains a number of actions relating to the role of mediation in family justice. ",
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Noel McCarthy",
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_354.xml"
            }
          },
          "debateSectionId": "dbsect_354",
          "showAs": "Family Law Cases",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_354"
        },
        "questionNumber": 417,
        "date": "2025-11-27",
        "showAs": " 417. Deputy Noel McCarthy asked the Minister for Justice, Home Affairs and Migration the measures his Department is taking with regard to the possible reform of the family court system; if his Department is considering measures to greatly reduce the time it takes for initial child contact cases to be taken, similar to reforms that have been implemented in other EU jurisdictions such as Denmark; if the establishment of a specialised children’s unit to provide child support independent to the judicial process is being considered; and if he will make a statement on the matter. [66829/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_417"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "showAs": " 81. Deputy Noel McCarthy asked the Minister for Housing, Local Government and Heritage the proposals being considered by his Department to increase the income threshold for applicants looking to access social housing through their local authority; the last date such an increase was made; and if he will make a statement on the matter. [65663/25] ",
        "debateSection": {
          "showAs": "Housing Schemes",
          "debateSectionId": "dbsect_69",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_69",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_69.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Noel McCarthy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "memberCode": "Noel-McCarthy.D.2024-11-29"
        },
        "questionNumber": 81,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 34, 81 and 113 together.  The baseline income thresholds increased by €5,000 for all local authorities with effect from 1 January 2023. The thresholds thus increased to €40,000, €35,000 and €30,000 for Bands 1, 2 and 3 respectively. These thresholds are net income thresholds, i.e. gross household income less income tax, PRSI, Universal Social Charge and Additional Superannuation Contribution. This €5,000 increase broadened the eligibility base, increasing the number of households eligible for support and lessening the impact on disadvantaged and vulnerable households of the significant increase in the cost of accommodation and cost of living generally in recent years.  Income is defined and assessed according to a standard Household Means Policy. The Policy provides for a range of income disregards and local authorities also have discretion to disregard income that is once-off, temporary or short-term in nature and which is outside the regular pattern of a person’s annual income.  My Department has been examining the existing income limits in the context of current market and household income conditions, including the suitability or otherwise of the current framework having regard to the significantly changed landscape since the standardised income limits were introduced. This includes examining the findings of research commissioned by my Department and this work is ongoing. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_81",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 92. Deputy Noel McCarthy asked the Minister for Housing, Local Government and Heritage the progress to date in establishing planning guidelines for solar energy developments; and if he will make a statement on the matter.  [65645/25] ",
        "debateSection": {
          "showAs": "Renewable Energy Generation",
          "debateSectionId": "dbsect_38",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/debate/dbsect_38",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/debate/mul@/dbsect_38.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Noel McCarthy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "memberCode": "Noel-McCarthy.D.2024-11-29"
        },
        "questionNumber": 92,
        "answerText": " Deputy James O'Connor  This is an important question. On behalf of the people of Cork East, I want to ask about the position regarding the publication of solar guidelines. There has been an explosion in the number of solar projects across Cork East as a constituency, as well as in Deputy O'Sullivan's constituency of Cork North-Central and other parts of the country where developments have occurred, often at very large scale from 500 to 600 acres up to 2,000 acres. Could the Minister please give my constituents some clarity on this urgent matter? \n Deputy James Browne  I propose to take Questions Nos. 10, 92 and 120 together.  I thank Deputy O'Connor for this important question on planning guidelines for solar farms for local authorities. The section of the programme for Government on securing Ireland's future reaffirms Ireland's ambitious targets of 8 GW of solar capacity connected to the grid by 2030, to assist with meeting the requirement of 80% of electricity demand supplied by renewables. Solar energy is a growing source of electricity, with approximately 2.1 GW of solar power capacity currently installed in Ireland. However, further solar capacity is required for Ireland to meet its domestic and international targets. For this reason, my Department is preparing a new national planning statement on solar energy under the new Planning and Development Act 2024. My Department has begun an initial scoping process to identify the component factors relevant to the preparation of the national planning statement for solar energy development, including any appropriate environmental assessment and public consultation requirements and other relevant European obligations such as the renewable energy directive, RED III, which will determine the timeframe for publication of said guidelines.  The scoping process remains at an early stage, but I am satisfied that the existing and evolving planning system, supported by Government policy more generally, provides a sufficiently robust policy and legislative framework to facilitate the roll-out of solar energy development in a sustainable manner and to assist with meeting our renewable electricity requirements while balancing the perspectives of local communities and their needs and allowing for public and stakeholder engagement. In the interim, there are currently no specific planning guidelines in place in respect of solar energy development. Proposals for individual solar energy developments are subject to the statutory requirements of the Planning and Development Act 2000, as amended, and the Planning and Development Act 2024, as amended, in the same manner as other proposed developments, with planning applications made to the relevant local planning authority or An Coimisiún Pleanála on appeal. \n Deputy James O'Connor  I thank the Minister. I acknowledge that he has provided a response. As a TD, I have no issue with the need for renewable energy and the decarbonisation of our economy but when it comes in the form of using thousands of acres of land in highly commercial agricultural areas - the Cork East constituency has some of the best land in the country - that represents one issue, and the second issue is the scale of these developments. Other countries have pursued very smart strategies such as using the top of commercial and school premises and factories or non-agricultural lands to pursue these developments, but Ireland has a mismatch in terms of policy.  Development is happening in areas where, ultimately, it is not the best use of that land or ground. Does the Minister see the point I am raising? In the east Cork area and other parts of the country, as other Deputies have raised, this is not happening in a prudent or productive way for the agricultural economy and n terms of the impact it is having on residents, given the size and scale of these developments. As I said, they potentially are upwards of 1,000 acres and in one case I am aware of, up to a maximum of 2,000 acres, which is larger than the Phoenix Park. \n Deputy James Browne  I certainly hear the Deputy's concerns. Any proposals forthcoming from the Government will be subject to public consultation and consultation with stakeholders, very much including the agricultural community and rural villages. However, in the absence of national planning statements, it falls back to the first principles of planning law, including the relevant Acts, but also the county development plans as set out by the 31 local authorities. At a local level, the city or county development plan sets out where solar energy development is accessible. The making of the city or county development plan is a reserved function of the local authority members. In terms of the setting out of the county development plan by Cork County Council, it is in the council's remit to assess, decide and set out where solar energy can go. Councillors being able to make that decision, effective at the closest point to local people, is an important power. \n Deputy Pádraig O'Sullivan  On the Minister's last point, we have approached Cork County Council collectively at a local level and it is saying that without national guidelines, it will not amend its development plan in terms of governing regulations around the erection of solar farms. There is a bit of a chicken-and-egg situation here. The council is saying it will not implement anything about solar development in its development plan. The Minister is saying this evening that it is up to the council to incorporate that into its development plan. The council has already told us locally it is not open to amending it without direction nationally.  I support the point made by Deputy O'Connor. On some of the land he is talking about, with which I share a border, somebody could build a solar farm 100, 200 or 300 acres in size but would struggle to get planning permission for a one-off house or agricultural shed. It is that stark in terms of the development that can and cannot happen there. At this stage, we need to be genuine with people. In the absence of regulation and guidelines, we must stop fooling people. I welcome that there will a scoping exercise but it sounds like it will take an awfully long time. We need to implement guidelines urgently. \n Deputy James O'Connor  It will take more to deter us than a few cheap shots in op-eds in the Irish Examiner criticising me and others for having the courage to come in here and raise these matters. Deputy O'Sullivan is right that we need the guidelines. Local authorities need those guidelines and they need leadership from the Government. A message must go back to the custodians of the status quo who have let this matter carry on for so long, despite its being raised at parliamentary party level and ministerial level before the general election and again now, that we need answers. It seems to me we have been left in the lurch, unable to give constituents answers because we do not have those guidelines. There is a game of pass the parcel between the Department and local government when both need to come together to understand that the scale of development happening in areas such as my own in the Cork East constituency, and the rapid nature of those developments, requires urgent attention for reasons ranging from flooding to the large-scale size of the developments. As Deputy O'Sullivan rightly said, if someone wants to build a house on those lands, the planning process is far more tedious than it is when seeking to swallow up hundreds of acres for the development of these facilities. \n Deputy James Browne  On the question of smaller extensions, etc., we are working on a very extensive suite of planning exemptions. I very much recognise that people should have more power to deliver and work on their own local property without having to seek planning permission. That is why we are introducing those exemptions. It is very much not a case of passing the parcel. The reality is that county development plans are decided at a local level. We must be very careful how we proceed in terms of any national planning statement. It cannot be one size fits all. Local authorities and local councillors know what is best for their local areas.  I very much believe in local government, which is why I set up the local government task force to give more power back to local councillors. Any national planning statement, when it is announced, cannot and will not take a one-size-fits-all approach. What is good for Cork East would be very different from what is good for north Wicklow and different again from what works for Donegal. No matter what the planning statement says, there will always be a significant amount of power left to the local authority to decide what to do with the land. There is no reason for any local authority to be waiting for a national planning statement. The law, as it is, says it is up to local authorities to decide what to do with their land in their own county areas under their own county development plans. That is their local power. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_92",
        "questionType": "oral",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 348. Deputy Noel McCarthy asked the Minister for Education and Youth for an update on proposed building works at a school (details supplied); when works will progress to the next stage; and if she will make a statement on the matter. [65204/25] ",
        "debateSection": {
          "showAs": "Schools Building Projects",
          "debateSectionId": "dbsect_342",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_342",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_342.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Noel McCarthy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "memberCode": "Noel-McCarthy.D.2024-11-29"
        },
        "questionNumber": 348,
        "answerText": " Minister for Education and Youth  The project referred to by the Deputy has been devolved to the Catholic Education an Irish Schools Trust (CEIST).  The project brief provides for a 600 pupil post primary school plus 3 Special Education Needs (SEN) classrooms.  In Quarter 1 2025, a Stage 1 meeting took place, and further information was requested to be submitted by the Design Team. This has been received and is currently undergoing review by the Department.  While at this early stage it is not possible to provide a timeline for completion of this project, CEIST will continue to engage directly with the school authorities to keep them fully informed of progress on this important project.  In July, the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my Department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  All Government Departments are expected to publish their sectoral NDP Implementation Plans in November. My Department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_348",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_143",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_143",
          "showAs": "Community Care",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_143.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 125. Deputy Noel McCarthy asked the Minister for Health to report on the progress of the development of the community nursing unit, Midleton Community Hospital, Midleton, County Cork; and if she will make a statement on the matter. [64356/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_125",
        "answerText": " Minister for Health  As the Health Service Executive is responsible for the delivery of public healthcare infrastructure projects, I have asked the HSE to respond to you directly in relation to this matter. ",
        "questionNumber": 125,
        "by": {
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "showAs": "Noel McCarthy"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_177",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_177",
          "showAs": "Voluntary Hospital Sector",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_177.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 157. Deputy Noel McCarthy asked the Minister for Health to provide an update on the operation of a community hospital Cobh Community Hospital, Aileen Terrace, Cobh, County Cork; the engagement she has had to date with hospital management regarding funding and service provision; and if she will make a statement on the matter. [64357/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_157",
        "answerText": " Minister of State at the Department of Health  Cobh Community Hospital is a voluntary organisation that provides invaluable services to older people in Cobh and surrounding areas.  An independent review of financial and operational service provision within Cobh Community Hospital was completed in June 2022. Following the review, the HSE met with the Board of Directors of Cobh Hospital to discuss the recommendations. The HSE set out to the board the limitations that exist around the funding allocation for the hospital and the Fair Deal Funding Scheme. The HSE engaged in very positive discussions around supporting Cobh Hospital to transition over a phased period of time to deliver much needed short-stay capacity within Cobh and the wider community health networks in East Cork.  The board of directors in Cobh Hospital agreed to progress a business proposal to transition from a 41 long-stay and 3 short-stay bed hospital to a 22 long-stay and 22 short-stay bed hospital. This business proposal was accepted by the HSE, and this transition has now successfully taken place.  Cobh Community Hospital currently has 44 beds in total comprising 22 long-stay beds and 22 short-stay beds. 16 of the short-stay beds are utilised for Respite and 6 are for Delayed Transfer of Care (DTOC) Support/Convalescence.  The 16 Respite beds are filled from requests to the Public Health Nursing service and occupancy is consistently high as the admissions are planned in advance to facilitate carers and families. The 6 beds for DTOC Support/Convalescence are used to support the discharge of patients who no longer require acute care from the hospitals in Cork city.  The 22-long stay beds in Cobh Community Hospital are funded under the Nursing Homes Support Scheme (NHSS), and the 22 short-stay beds are funded through by HSE Section 39 Service Level Agreements. From 1 st December 2024, the NTPF/Fair Deal rate for Cobh increased to €1,320 per week. The HSE are currently providing a total of €2.18m per annum (Section 39) based on 22 short-stay beds being fully available. ",
        "questionNumber": 157,
        "by": {
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "showAs": "Noel McCarthy"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 110,
        "showAs": " 110. Deputy Noel McCarthy asked the Minister for Transport if he will report on the progression of the proposed upgrade of the R624 access road to Cobh and the Great Island in east Cork; and if he will make a statement on the matter. [63176/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Noel McCarthy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "memberCode": "Noel-McCarthy.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_110",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_67",
          "showAs": "Road Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_67",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_67.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  I propose to take Questions Nos. 110 and 313 together.  In accordance with the provisions of Section 13 of the Roads Act 1993, each local authority has statutory responsibility for the improvement and maintenance of their regional and local roads. Works on those roads are funded from local authorities' own resources and are supplemented by State Road grants. Of these grants, the vast majority (approximately 90%) are targeted at the maintenance and renewal of the network with c. 10% of the remaining funding invested in new roads/bridges or for road realignments.  Any new road projects that seek State funding are assessed by the Department on a case-by-case basis. All projects proposed by local authorities for consideration must comply with the requirements of the Infrastructure Guidelines (formerly the Public Spending Code) and the Department's Transport Appraisal Framework. Given the limited funding available for regional and local road improvement works it is important for local authorities to prioritise projects within their overall area of responsibility with these requirements in mind.  In this regard, Cork County Council submitted an initial project appraisal to the Department in 2019 regarding the upgrade of the R624 Cobh Road. The project, as submitted, includes upgrading the existing N25-R624 interchange, the provision of a dual carriageway from the interchange to Marino Point, widening of Slatty Bridge, the provision of a new bridge crossing to Great Island at Belvelly and upgrading the existing R624 from Marino Point to Cobh.  The estimated cost of this scheme was more than €100 million, with possible staged implementation.  In line with Government requirements Cork County Council also produced a Strategic Assessment Report (SAR) for the Great Island Connectivity Scheme and a draft was forwarded to the Department in November 2022.  Since then, both the Public Spending Code and the Department’s Transport Appraisal Framework (TAF) guidance have been updated - the Department liaised with the Council regarding new requirements under the new infrastructure Guidelines and the TAF including the preparation of a Project Outline Document (POD) and business case incorporating the work already undertaken at the SAR stage.  The Council submitted the POD to the Department in March 2024. Following the submission of the POD, the Council commenced work on developing a brief for the appointment of consultants to deliver the scheme through options assessment, design and planning, starting with the commencement of a Preliminary Business Case. The Council submitted the brief for appointment of consultants in December 2024 to the Department for review. The Council hopes to appoint a consultant in late 2025 once the brief has been finalised.  An allocation of €350,000 was made to Cork County Council as part of the 2025 Regional and Local Roads Grants to assist in the development of the Preliminary Business Case. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 125,
        "showAs": " 125. Deputy Noel McCarthy asked the Minister for Transport if his Department will  consider  providing funding for the upgrade of the N25 route between Carrigtwohill, Midleton and Youghal in Cork east; and if he will make a statement on the matter. [63175/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Noel McCarthy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "memberCode": "Noel-McCarthy.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_125",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_82",
          "showAs": "Road Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_82",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_82.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the planning, design and construction of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals. In this context, TII is best placed to advise you in relation to the N25.  I can confirm that €700,000 has been allocated for the Midleton to Youghal Bypass scheme in 2025. While the N25 Carrigtwohill to Midleton project did not receive an allocation for 2025, it remains part of the NDP and the delivery of this project will be kept under review in the coming years and considered in terms of the overall funding envelope available to TII.  Noting the above position, I have referred your question to TII for a direct reply updating you as to the latest status of the projects on the N25 in east Cork. Please advise my private office if you do not receive a reply within 10 working days. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Enterprise, Tourism and Employment  Regional Development is a key focus of our Programme for Government and is central to the work of my Department and our enterprise development agencies. In this regard, Regional Development is one of four key strategic objectives of the IDA 2025–2029 strategy, \"Adapt Intelligently\" with a commitment to secure 550 foreign direct investment (FDI) projects outside Dublin - 55% of all planned investments. Additionally, the overarching goal is to create 75,000 new jobs nationwide and generate a projected €250 billion in economic impact with the IDA having set ambitious targets for every region in Ireland.  Furthermore, a robust property and infrastructure ecosystem can be the key differentiator in winning FDI projects. The availability of suitable property and strategic sites is a critical component of the regional value proposition and to the winning of investments into the regions from both new name clients and from the existing client base. In this regard, IDA Ireland’s property strategy aims to address regional market failure through investment in enterprise-focused property solutions that meet the needs of multinational companies and indigenous clients in support of winning investments.  IDA Ireland also partners with Local Authorities for the delivery of advance planning permits in regional locations as well as investing in significant infrastructure projects across its portfolio of Business and Technology Parks responding to evolving company needs. Furthermore, IDA Ireland maintains a focus on acquisition of new landbanks and strategic sites to future proof the ability of the property portfolio in regional locations to support the project pipeline.  This targeted forward-planning is vital to provide certainty and ensure Ireland has a competitive offering that meets the evolving needs of IDA Ireland and Enterprise Ireland clients.  Cork County is home to 76 IDA client companies, primarily manufacturing operations, employing 23,241 which accounts for 45% of total employment in the South West. Currently, these companies are located across twenty locations in Cork County, including Fermoy, highlighting the positive impact of FDI across the county.  The IDA has over 280 hectares of lands available for marketing to IDA and EI clients in Cork. The presence of strategic landbanks in several locations in Cork positions the greater Cork area for new Greenfield opportunities, which if successful will benefit Cork city and county and the wider South-West region. This is complemented by private sector activity in the development of manufacturing and office property solutions in the greater Cork are  The Fermoy Business Park is maintained as part of IDA Ireland’s property portfolio and is available to accommodate investment and development by IDA clients and clients of Enterprise Ireland and the Local Enterprise Offices. The vacant 8-hectare site in Fermoy is part of IDA’s overall strategic landbank portfolio in Cork offering greenfield sites of c. 6Ha to suit both manufacturing and international services clients, in a landscaped and serviced environment and is available to support IDA and Enterprise Ireland clients with appropriate services in place to accommodate same. In that regard, IDA continues to proactively market the site to suitable qualifying client companies. IDA Ireland is committed to the continued promotion of the lands at Fermoy for development for employment-generating uses consistent with its development brief. IDA Ireland continues to work with all relevant stakeholders to ensure that a supportive ecosystem is in place to assist IDA in winning investments into the Cork region. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_61",
        "debateSection": {
          "debateSectionId": "dbsect_94",
          "showAs": "Enterprise Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_94",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_94.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Enterprise"
        },
        "questionNumber": 61,
        "by": {
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "showAs": "Noel McCarthy"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 61. Deputy Noel McCarthy asked the Minister for Enterprise, Tourism and Employment the plans for development of the vacant IDA site in Fermoy, County Cork; and if he will make a statement on the matter. [62241/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Social Protection  The Government has agreed a number of commitments that are to be achieved over its lifetime.  One of the proposals in the Programme for Government is to extend the period of payment after death from 6 weeks to 12 weeks.  While in general, across Social Welfare schemes, payment continues for a period of 6 weeks after death, there are some exceptions, with some payments already paid for a period of 12 weeks after the death of the recipient.  In this regard, Carer’s Allowance continues to be paid for a period of 12 weeks after the death of the person being cared for, while in the case of Domiciliary Care Allowance, payment continues for a period of 3 months after the death of the recipient.  Consideration and decisions in relation to any social protection measures contained in the Programme for Government will be taken in the context of overall funding available, the economic context, and competing Government priorities. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_150",
        "debateSection": {
          "debateSectionId": "dbsect_171",
          "showAs": "Social Welfare Payments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_171",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_171.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 150,
        "by": {
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "showAs": "Noel McCarthy"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 150. Deputy Noel McCarthy asked the Minister for Social Protection to provide an update on the Programme for Government commitment to extend from six to 12 weeks the period of a social welfare payment following the death of a dependent; the social welfare payments that are being considered for such an extension; and if he will make a statement on the matter. [62260/25] "
      }
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  My Department funds a number of grant schemes, administered by the Sustainable Energy Authority of Ireland (SEAI), to support homeowners improve the energy efficiency of their buildings, and to promote the adoption of renewable energy systems. These schemes include grants for the fabric upgrade of buildings (e.g. insulation), as well as solar PV and heat pump installation.  It is important to note that the grants available through the SEAI aim to maximise emissions reductions and deliver energy savings for the widest range of homeowners possible. The grants which are available, and their respective eligibility criteria, were designed to deliver significant energy savings to homeowners at the best value for money for the Exchequer. Since the funds that are available for energy efficiency are limited, my Department must prioritise their use where they will have the most impact.  Therefore, regarding support for the installation of a heat pump, grants will only be paid in relation to homes where solid fuel, oil/gas boiler or electrical heating (other than a heat pump) is present, or where there is no heating in situ. There is currently no plan to amend these criteria.  My Department, in partnership with the SEAI, continues to ensure that grant schemes terms and conditions, eligibility criteria, and rates are kept under review, taking account of demand, research, innovation, evolving technology and other relevant factors. ",
        "to": {
          "showAs": "Climate",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Noel McCarthy",
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_201.xml"
            }
          },
          "debateSectionId": "dbsect_201",
          "showAs": "Grant Payments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_201"
        },
        "questionNumber": 254,
        "date": "2025-11-12",
        "showAs": " 254. Deputy Noel McCarthy asked the Minister for Climate, Energy and the Environment if he will allow grants to be paid under the SEAI heat pump system grant scheme to households (details supplied) in cases where the only other affordable option, without grant support, is to revert to heating their houses using fossil fuels; and if he will make a statement on the matter. [61954/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_254"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Transport  The regulation of the small public service vehicle (SPSV) industry, including the vehicle suitability test, is a matter for the independent transport regulator, the National Transport Authority (NTA), under the provisions of the Consolidated Taxi Regulation Acts 2013 and 2016. I have no role in the day-to-day operations of the SPSV sector.  Accordingly, I have referred your question to the NTA for further information. Please advise my private office if you have not received a response within 10 working days. ",
        "to": {
          "showAs": "Transport",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Noel McCarthy",
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_303.xml"
            }
          },
          "debateSectionId": "dbsect_303",
          "showAs": "Taxi Regulations",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_303"
        },
        "questionNumber": 357,
        "date": "2025-11-12",
        "showAs": " 357. Deputy Noel McCarthy asked the Minister for Transport his plans to facilitate the introduction of an online booking platform for vehicle suitability tests by the National Transport Authority; and if he will make a statement on the matter. [62035/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_357"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The purpose of the Climate Action Summer Works Scheme (CASWS) is to enable individual school authorities to undertake small-scale building works on a devolved basis and, ideally, can be carried out during the summer months or at other times that avoid disrupting the operation of the school. The CASWS operates on a multi-annual basis across a number of categories of works such as Climate Action and External works which could involve set down areas and carparking.  My department can confirm that an application under the CASWS has been received for the school in question. However, it should be noted that applications will be assessed in accordance with availability of funding.  It is envisaged that approvals in any given year will involve a spread of categories rather than the traditional single category at a time. This is aimed at managing market capacity and maximising value for money opportunities for school authorities.  The CASWS will operate on a multi-annual basis with the first tranche of projects being announced in Q4 2025 for commencement in summer 2026. Under this scheme, approved applications from schools that are not reached for funding or market prioritisation reasons (as above) in 2026 will qualify to be assessed for purposes of the funding available for climate action summer works in subsequent years.  Full details of the new CASWS, Circular (0029/2025) for the scheme and guidance documents for schools can be found at the below link: (www.gov.ie/en/department-of-education/services/summer-works-scheme/) .[ ] ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Noel McCarthy",
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_470.xml"
            }
          },
          "debateSectionId": "dbsect_470",
          "showAs": "Schools Building Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_470"
        },
        "questionNumber": 547,
        "date": "2025-11-12",
        "showAs": " 547. Deputy Noel McCarthy asked the Minister for Education and Youth further to Parliamentary Question No. 518 of 15 July 2025, when a decision is expected to be reached on a climate action summer works scheme application for a school (details supplied); and if she will make a statement on the matter. [61932/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_547"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 44. Deputy Noel McCarthy asked the Minister for Education and Youth the measures being taken by her Department to support both youth worker-led and volunteer-led youth services across the State; and if she will make a statement on the matter. [50187/25] ",
        "by": {
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "showAs": "Noel McCarthy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_44",
        "questionNumber": 44,
        "answerText": " Minister for Education and Youth  The department supports the delivery of youth services nationwide. Arising from Budget 2025, €84.9 million has been allocated for current and capital expenditure for the benefit of young people, representing an increase of €7 million, or almost 9%, on the 2024 budget. Between 2021 and 2025, current exchequer funding for youth services and programmes has increased by over 34%. This investment will support the implementation of Opportunities for Youth: The National Strategy for Youth Work and Related Services 2024–2028, which sets out strategic objectives and 18 priority actions to strengthen the role of youth work and related services in the lives of young people across Ireland.  Under the department’s largest youth funding scheme, UBU Your Place Your Space, €50.7 million has been allocated in 2025. Since its launch in 2020, significant additional funding has been directed to new services across the country, with over 90,000 young people participating in UBU Your Place Your Space in 2024. In 2025, a further €1.2 million was provided to establish 10 new UBU youth services, which will deliver targeted youth worker-led support to up to 1,000 disadvantaged young people in areas of greatest need. The successful education and training boards (ETBs) selected to host these new services are:  • Cavan and Monaghan ETB  • Donegal ETB  • Kerry ETB  • Kildare and Wicklow ETB  • Kilkenny and Carlow ETB  • Laois and Offaly ETB  • Longford and Westmeath ETB  • Louth and Meath ETB  • Mayo Sligo and Leitrim ETB  • Tipperary ETB  The selected ETBs are currently completing their call for service process, and it is anticipated that the first of the new UBU services are due to become operational by the end of 2025.  In 2025, the Targeted Youth Employability Support Initiative (TYESI) received €1.135 million in funding. This supports projects that engage young people who are not in education, employment, or training (NEET), helping them to build confidence, develop key skills, and progress toward further education or the workforce. There are currently 18 TYESI-funded services operating across the country, with every ETB receiving funding to support at least one initiative within its functional area.  The Local Youth Club Grant Scheme (LYCGS), funded by the department and administered by the ETBs, supports volunteer-led youth clubs nationwide. €2.7 million has been allocated for this scheme in 2025, an increase of 8% on the 2024 level. The scheme enables communities to access volunteer-led youth clubs and groups that foster personal development, inclusion, and well-being, with over 62,000 young people participating in 2024.  The Youth Services Grant Scheme (YSGS) provides funding to 35 National Youth Organisations to deliver universal youth services across Ireland. The department is providing €15.3 million under this scheme in 2025. Of these 35 Organisations, five are new entrants that joined the scheme as part of the YSGS reform process in 2024. The opening of the scheme to new entrants has enhanced diversity and choice within the YSGS, ensuring a broader range of national organisations can reflect and respond to the varied needs, identities, and interests of young people across the country. These Organisations play a vital role in supporting young people through clubs, activities, and services that promote engagement and growth. In addition, they contribute to the wider youth sector by offering training for volunteer youth workers, promoting evidence-based youth work, and advocating for the voluntary youth sector.  The department is very cognisant of the challenges still being experienced by some clubs in recruiting volunteers, particularly in the aftermath of the COVID-19 pandemic. In response, €650,000 was allocated in 2024 to the Volunteer Activation Fund, which continued into 2025, providing additional support to National Youth Organisations in recruiting, retaining, and supporting volunteers. Between 2024 and 2025, the fund supported 19,154 volunteers across 954 clubs, engaging over 25,000 young people nationwide.  The department is currently undertaking a comprehensive mapping exercise of the youth services sector, capturing both youth worker-led and volunteer-led provision. Significant progress has already been made, including the development of an internal dashboard that serves as a core building block for the final map. The aim is to produce a dynamic, user-friendly resource that will enhance awareness of and access to youth services nationwide - supporting young people, their families, and educators in identifying relevant supports within their communities.  Finally, arising from Budget 2026, an additional €8 million in current and capital funding has been allocated to support the sustainability and development of youth services. This investment strengthens the foundation for inclusive, high-quality provision — ensuring continuity, expanding reach, and enabling services to respond to the evolving needs of Ireland’s diverse youth population. The department remains committed to supporting youth work at both national and local levels, and recognises the importance of inclusive, community-based engagement in urban areas. The increased funding will enable both universal and targeted youth services to continue delivering tailored supports and safe, welcoming spaces for young people across the country. ",
        "debateSection": {
          "showAs": "Youth Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_64",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_64.xml"
            }
          },
          "debateSectionId": "dbsect_64"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-10-22",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 233. Deputy Noel McCarthy asked the Minister for Health if her Department is considering the inclusion of ozempic on the long-term illness and medical card schemes for purposes such as the maintenance of kidney function and not for the treatment of diabetes or weight management; and if she will make a statement on the matter. [57673/25] ",
        "by": {
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "showAs": "Noel McCarthy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-22/pq_233",
        "questionNumber": 233,
        "answerText": " Minister for Health  Under the Health (Pricing and Supply of Medical Goods) Act 2013, the HSE has statutory responsibility for decisions on the pricing and reimbursement of medicines and medical devices; therefore, the matter has been referred to the HSE for attention and direct reply to the Deputy. ",
        "debateSection": {
          "showAs": "Medicinal Products",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-22/writtens/dbsect_240",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-22/writtens/mul@/dbsect_240.xml"
            }
          },
          "debateSectionId": "dbsect_240"
        }
      },
      "contextDate": "2025-10-22"
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "School Costs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_300.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_300",
          "debateSectionId": "dbsect_300"
        },
        "to": {
          "showAs": "Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 381, 382 and 391 together.  The Education (Admission to Schools) Act 2018 (The Act) provides a framework for school enrolment that is designed to ensure that every child is treated fairly and that the way in which schools decide on applications for admission is structured, fair and transparent. The Act provides that in schools, where there are places available, the school must admit each student applying. The Act prohibits the use of religion as a selection criterion in primary school admissions.  The Act provides a protection to ensure that a child of a minority faith, can access a school of their faith. This provision allows schools of a minority faith ethos to admit as a priority a student from a minority religion. The priority can only be applied where a pupil is seeking admission to a school that provides religious instruction or religious education consistent with their minority religious beliefs or a religion similar to their religious beliefs.  The pupil teacher ratio in Ireland is currently 19:1 for schools in the free education system and 23:1 in the fee-charging system.   Capitation Grant  The Government is committed to increasing funding to support schools in the Free Education Scheme, and the Programme for Government commits to increasing capitation funding to schools of all types to ensure that schools can meet the elevated day-to-day running costs.  My Department is committed to providing funding to recognised primary and post-primary schools in the Free Education Scheme by way of per capita grants. The two main grants are the capitation grant to cater for day-to-day running costs such as heating, lighting, cleaning, insurance and general up-keep, and the ancillary grant to cater for the cost of employing ancillary services staff.  The commitment in the Programme for Government builds on the progress which has been made in recent years. As part of the capitation package in Budget 2026, I am pleased that a total of €39m was secured for a permanent increase in mainstream capitation grant funding for schools, increasing the mainstream rate of capitation to €274 per pupil in primary schools and to €406 in post-primary schools for the 2026/2027 school year. Over the last three Budgets this has resulted in an increase in the level of capitation rates of 49.7% (€91) paid to primary schools and 28.5% (€90) paid to post-primary schools. This will also allow for an increase of €20 in capitation rates for Urban Band One DEIS primary schools, increasing the mainstream pupil rate in these schools to €294. The increased capitation rates will also see special schools now receive the same rates of capitation for young people aged 12 and over, as their peers in mainstream post-primary schools.  The current standard rate of capitation grant is €224 per pupil in primary schools and €386 per student in post-primary schools. Primary schools with fewer than 60 pupils are paid the capitation and the ancillary grants on the basis of having 60 pupils. Enhanced rates are also paid in respect of pupils with special educational needs and Traveller pupils.  These supports are made available to all recognised primary and post-primary schools in the Free Education Scheme. Fee-charging schools do not receive capitation or ancillary grants from my Department. What differentiates fee-charging schools from all other post-primary schools is the capacity to raise funds through mandatory fees, while in receipt of exchequer funding. The fees charged are mandatory in that initial admission to the fee-charging school or ongoing participation is contingent on the payment of fees.   Schoolbooks Scheme  The funding provided under the schoolbooks schemes is specifically to provide free schoolbooks for some 940,000 children and young people in recognised primary and post-primary schools in the Free Education Scheme from the start of the 2025/26 school year.  Private fee-charging schools are not in the Free Education Scheme and are not included in the schoolbooks scheme.  ICT Grant  The Digital Strategy for Schools to 2027 was published in 2022 and is underpinned by funding of €200m over the course of the strategy to support its implementation, which was committed to under Ireland’s National Development Plan (NDP). The criteria applying to the ICT Infrastructure Grant will be detailed in the associated circular at the time of issue of the grant. A standard funding formula incorporating both a flat rate lump sum and a per capita amount for each pupil/student enrolled has been used to calculate the grant due to each school. An enhanced per capita rate applies to pupils/students enrolled in DEIS and Special schools and to pupils in mainstream special class primary settings.  All pupils/students following primary and post-primary programmes are included, for per capita purposes, in recognised primary, special and post-primary schools. Fee-charging post-primary schools receive funding at a 50% rate.  Capital funding  Since 2020, my Department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In July the Government announced a capital allocation of €7.55 billion for my Department of Education and Youth for the period 2026-2030 under the National Development Plan. My department is now preparing an NDP implementation plan which is due for publication later in the autumn. As part of this NDP allocation my Department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. My Department’s overall approach in relation to projects funded under the school building programme is to prioritise the needs of primary and post-primary schools in the Free Education Scheme.  The purpose of the Emergency Works Scheme (EWS) is to provide funding specifically for unforeseen emergencies, or to provide funding to facilitate inclusion and access for pupils with special needs. It does so by ensuring the availability of funding for urgent works to those schools that are in need of resources as a result of an emergency situation.  The purpose of the Summer Works Scheme (SWS) is to enable individual school authorities to undertake small-scale building works on a devolved basis and, ideally, can be carried out during the summer months or at other times that avoid disrupting the operation of the school. The SWS operates on a multi-annual basis for a number of categories which could include the provision or upgrade of science labs, for example.  The Climate Action Summer Works Scheme (CASWS) is open to all recognised schools that are participating in the Free Education Scheme. Earlier this year I announced details in respect of the CASWS 2026 onwards. The Summer Works Scheme was renamed to reflect the strong climate focus and is now called the Climate Action Summer Works Scheme. The CASWS has recently closed for applications and it is envisaged that approvals in any given year will involve a spread of categories rather than the traditional single category at a time.  The CASWS will operate on a multi-annual basis with the first tranche of projects being announced in Q4 2025 for commencement in summer 2026. Under this scheme, approved applications from schools that are not reached for funding or market prioritisation reasons (as above) in 2026 will qualify to be assessed for purposes of the funding available for climate action summer works in subsequent years.  Curriculum  In December 2024 my Department announced €12m in funding for a Science Implementation Support Grant to support schools with the rollout of the revised science subjects in the 2025/2026 school year. The grant was paid to all schools in the Free Education Scheme and this approach was communicated to schools from the outset in the Science Implementation Support Grant Guidelines for post-primary schools published on 3rd December 2024.  Separately, the new subjects of Drama, Film and Theatre Studies and Climate Action and Sustainable Development are now being taught in almost 100 schools. These schools were selected from those who expressed an interest in 2024 in offering the subjects. Whether a school was a fee-charging school or was in the Free Education Scheme was not a relevant criterion in their selection.  All Phase One Climate Action and Sustainable Development schools, not limited to those in the Free Education Scheme, received a once-off funding of €5,000 in September 2025 to establish a Climate Action and Sustainable Development subject department in their school.  All Phase One Drama, Film and Theatre Studies schools, not limited to those in the Free Education Scheme, have been provided with access to new streaming services, allowing registered teachers free access in the classroom to prescribed material and resources to support the new Leaving Certificate Drama, Film and Theatre Studies specification. In addition, all relevant Phase One schools are being provided with film production and audio equipment for the teaching of Leaving Certificate Drama, Film, and Theatre Studies. However, only those Phase One schools for both subjects in the free education scheme will be provided with an annual Implementation Support Grant of €50 per student in line with the general approach taken to per capita grant funding. ",
        "questionType": "written",
        "showAs": " 391. Deputy Noel McCarthy asked the Minister for Education and Youth if she is considering the inclusion of minority faith schools in initiatives such as the science implementation support grant, the free schoolbooks scheme and the climate action works scheme; if not, the reason such schools continue to be excluded from the schemes; the supports her Department is providing and is considering implementing for the sustainability and inclusivity of minority faith schools going forward; and if she will make a statement on the matter. [56777/25] ",
        "questionNumber": 391,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Noel McCarthy",
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_391"
      }
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  Supporting the participation and success of learners with disabilities is a key priority of mine, my Department and for Government.  Good progress is being made as part of the National Access Plan (NAP) to increase new entrants to higher education institutions with a disability. The latest figures available to the Department show this figure has increased to 14.7% for the 2023/2024 academic year up from 12.4% at the start of the NAP and, on this trend, we are on target to reach 16% over the lifetime of the plan.  There are a range of existing supports and programmes for learners with disabilities.  In Budget 2026 I have increased the Fund for Students with Disabilities by €1 million for higher education and €2 million for further education and training supporting over 22,000 learners. Included in the additional funding for further education and training is the provision to cover transport costs for learners with intellectual disabilities. I have also provided €1m to support student wellbeing and mental health initiatives.  This investment ensures that every learner, regardless of background or ability, can participate fully in education and training, and forms part of our wider commitment to building a more inclusive and accessible education system. Because opportunity must be open to all, not just to some.  The Programme for Access to Higher Education, or PATH 4 funding stream under the National Access Plan supports my Department's goals of enabling all learners with disabilities avail of higher education.  Since 2022, Phase 1 funding of €5.8 million was provided in 2022 for a range of projects to improve Universal Design for Learning in higher education institutions.  PATH 4 Phase 2 is the funding programme which has been made available by the Department for the provision of courses for Students with Intellectual Disabilities in HEIs. I am very pleased to report to the House that 195 students are currently enrolled in 11 HEIs across a wide geographic spread.  I recently approved funding to hire an expert to develop a common evaluation instrument for PATH 4 Phase 2. The evaluation of the PATH 4 Phase 2 pathfinding programme presents an invaluable opportunity to gather aggregated data at the national level on the outcomes and lessons emerging from the initiative. And also to build a robust evidence-base to inform and guide future policy development.  My Department has also initiated the Disabilities Demonstration Project aimed at identifying and developing the most effective supports for students with disabilities across the tertiary education system. The project will underpin the development of a comprehensive policy framework focused on delivering a more flexible, responsive, and tailored model of support to better meet the diverse needs of these students. ",
        "by": {
          "showAs": "Noel McCarthy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "memberCode": "Noel-McCarthy.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "date": "2025-10-16",
        "questionNumber": 29,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/dbsect_63",
          "debateSectionId": "dbsect_63",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/mul@/dbsect_63.xml"
            }
          },
          "showAs": "Further and Higher Education"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-16/pq_29",
        "showAs": " 29. Deputy Noel McCarthy asked the Minister for Further and Higher Education, Research, Innovation and Science the measures being taken by his Department to ensure ease of access to third level education for those with a disability and that the number of new entrants to higher education with a disability continues to increase; and if he will make a statement on the matter. [56004/25] "
      },
      "contextDate": "2025-10-16"
    },
    {
      "question": {
        "answerText": " Deputy Dara Calleary  I thank the Deputy for his question and his ongoing interest in this area. We launched the town centre first policy in 2022. It a major cross-Government policy to tackle vacancy and combat dereliction, and in doing so to breathe new life into town centres. Town centre first complements other policies, including Our Rural Future and Housing for All as well as the national planning framework, which also aims to tackle vacancy and dereliction.  Town centre first also seeks to achieve balanced regional development and support local communities. We have aligned major funding streams with town centre first, including the rural regeneration and development fund, the town and village renewal scheme, the urban regeneration and development fund and the THRIVE scheme. The rural regeneration and development scheme is a major capital investment programme supporting large-scale, ambitious projects delivering sustainable economic and social development in rural areas. The town and village renewal scheme, introduced by my Department in 2016, is designed to rejuvenate rural towns and villages throughout Ireland. A range of other support funding has also been put in place by Government. Town centre first was developed in conjunction with the Minister for Housing, Local Government and Heritage. Bringing Back Homes details over 20 incentives, funded measures and grants that seek to address vacancy and dereliction. Supports include the vacant property refurbishment grant under the croí cónaithe initiative, the repair and leasing scheme, the buy and renew scheme, and the living city initiative.  I am fully committed to the success of the town centre first policy and to working with our town teams across the country, with colleagues in the Oireachtas and with the local authorities. I would also encourage the local authorities to make greater use of the powers they have available to them to address dereliction in town and village centres and to address every building that can be addressed through existing powers. Any building that is taken out of dereliction rejuvenates a town and there needs to be a lot more proactivity on the part of local authorities in doing that. \n Deputy Noel McCarthy  I thank the Minister for his response. While I appreciate the great work of the Department in supporting rural communities and the great work that both the Minister and the Minister of State are doing, vacancy and dereliction in our towns and villages remains a real concern. I appreciate that the Department of housing is the main Department tasked with tackling this problem but it is important for Departments to continue to engage directly with each other on vacancy and dereliction in order to properly address it, to actively encourage footfall and to drive local economies. I acknowledge that the Department's rural regeneration and development fund plays a major role in this regard. It encourages the reuse of vacant, derelict and heritage buildings. Given its importance, is the Minister considering any expansion of the RRDF? \n Deputy Dara Calleary  As the Deputy knows, last week we announced €20 million in rural regeneration and development funding for 30 projects across Ireland, including in his home town. I thank Deputy McCarthy for his work in lobbying for that. Fermoy will see the €772,000 development of a derelict site. This is something that the Deputy and the Minister of State, Deputy Buttimer, worked closely with me on. That is the kind of project we need. It will allow Avondhu to promote and get ready for a major application. That is what our RRDF announcement last week was about. It will allow the preparatory work to be done for the submission of a major funding application, some in two years and others before then. The RRDF is beginning to have a major impact right around the country.  I mentioned earlier that I was in Athy on Friday visiting the Shackleton Experience which involved the refurbishment of a 300 year old historic building in the middle of the town. It is now a state-of-the-art, 21st century visitor experience that is driving development in Athy. A food hub is also being developed in Athy through the RRDF to support the promotion of local enterprise. Athy is a really good example of what is possible and I would encourage any community around the country to visit Athy to see the RRDF in action. \n Deputy Noel McCarthy  I thank the Minister for the rural regeneration and development funding for Fermoy. It was very welcome and I thank both the Minister and the Minister of State for their support on that. While several factors contribute to rural vacancy and dereliction, one important issue is the lack of community facilities which may discourage people from moving to a particular area. In this context, what work is the Department doing to encourage the establishment of rural community halls or facilities in existing vacant or derelict buildings? \n Deputy Dara Calleary  My Department has funded 26 town centre first plans which are focused on existing facilities and buildings within town centres. They are concerned with what we call the public realm and aim to enhance the town centre experience. I make the point regularly, and did so again when I spoke at a national conference in Leitrim on Monday, that we have to come up with new reasons for people to visit towns. As people move away from the traditional retail space and go online, we need to re-equip and refurbish our towns to make them even more attractive for leisure and recreation, as well as for commercial and retail purposes. If we improve leisure and recreation opportunities, that will support existing retail businesses.  In Cork under town centre first we have invested over €259,000 and right across the country there are 70 towns with town centre teams that are working with their local authorities to identify spaces such as those Deputy McCarthy has just identified. Then, through community centre investments, CLÁR or other programmes, my Department can fund specific adaptations of existing buildings for community spaces. ",
        "by": {
          "showAs": "Noel McCarthy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "memberCode": "Noel-McCarthy.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "date": "2025-10-16",
        "questionNumber": 86,
        "questionType": "oral",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/debate/dbsect_26",
          "debateSectionId": "dbsect_26",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/debate/mul@/dbsect_26.xml"
            }
          },
          "showAs": "Vacant Properties"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-16/pq_86",
        "showAs": " 86. Deputy Noel McCarthy asked the Minister for Rural and Community Development and the Gaeltacht the supports made available by his Department to address rural vacancy and dereliction; and if he will make a statement on the matter. [55943/25] "
      },
      "contextDate": "2025-10-16"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  The Community Centre Investment Fund (CCIF) has provided approximately €110 million since 2022 for the enhancement and refurbishment of existing community centres and the construction of new centres.  I am committed to delivering further iterations of the scheme in the coming years in line with the commitment in the Programme for Government for this to become a permanent rolling fund. Funding for community centre works is also available through LEADER and the CLÁR programme.  In terms of the purchase of land, the Town & Village Renewal Scheme (TVRS) Building or Land Acquisition Measure allows local authorities to purchase derelict or vacant buildings and/or land within eligible towns or villages. Buildings or land purchased under this measure must be for multi-purpose community future use. Local authorities have been informed of successful applications under this measure for 2025. The TVRS will be launched again next year.  Details of all schemes are available on my Department's website. ",
        "by": {
          "showAs": "Noel McCarthy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "memberCode": "Noel-McCarthy.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "date": "2025-10-16",
        "questionNumber": 119,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/dbsect_141",
          "debateSectionId": "dbsect_141",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/mul@/dbsect_141.xml"
            }
          },
          "showAs": "Community Development Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-16/pq_119",
        "showAs": " 119. Deputy Noel McCarthy asked the Minister for Rural and Community Development and the Gaeltacht the measures being taken by his Department to support rural town and village communities to establish community centres or hubs where no land is currently available to build such facilities; and if he will make a statement on the matter. [55942/25] "
      },
      "contextDate": "2025-10-16"
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Flood Relief Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_134.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_134",
          "debateSectionId": "dbsect_134"
        },
        "to": {
          "showAs": "Public Expenditure",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister of State at the Department of Public Expenditure, National Development Plan Delivery and Reform  The Minor Flood Mitigation Works and Coastal Protection Scheme (Minor Works Scheme) was introduced by the Office of Public Works (OPW) in 2009. The purpose of the scheme is to provide funding to local authorities to undertake minor flood mitigation works or studies to address localised flooding or coastal erosion problems within their administrative areas. The scheme generally applies where a solution can be readily identified and achieved in a short time frame.  Applications for funding from local authorities are assessed by the OPW having regard to the specific economic, technical, social and environmental criteria of the scheme, including a cost benefit ratio.  I recently announced that an increase in funding supports are to be made available to local authorities under the Minor Works Scheme, including an increase in the upper Minor Works threshold from €750,000 to €2,000,000. Details of these revisions to the Scheme are to be made available to local authorities over the coming weeks. ",
        "questionType": "written",
        "showAs": " 131. Deputy Noel McCarthy asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation to provide an update on plans by his Department to increase the upper funding threshold for flood prevention works under the OPW's minor works scheme; and if he will make a statement on the matter. [56032/25] ",
        "questionNumber": 131,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Noel McCarthy",
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_131"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Farm Safety",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/debate/mul@/dbsect_22.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/debate/dbsect_22",
          "debateSectionId": "dbsect_22"
        },
        "to": {
          "showAs": "Agriculture",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine (Deputy Michael Healy-Rae)  I thank Deputy McCarthy.  Farm safety, health and well-being is a priority for this Government. The Department is implementing a range of initiatives this year on farm safety, utilising dedicated funding of €2.5 million secured in budget 2025. I was pleased to secure an increase in this dedicated funding for farm safety, health and well-being to €3 million in budget 2026. In relation to 2025 funding, I have approved funding for 40 projects following an open call for farm safety, health and well-being projects earlier this year. More recently, we announced contracts for the delivery of children’s and young person’s farm safety awareness initiatives.  A number of key schemes under the CAP strategic plan also ensure a focus on farm safety. The TAMS 3 farm safety capital investment scheme continues to provide grant aid for a wide range of farm safety related investments. Health and safety guidelines are included in all building specifications for the construction of agricultural buildings and structures. All TAMS applicants are required to complete a half-day of farm safety training.  Farmer health and safety training is also included in other Department schemes, such as the suckler carbon efficiency programme, the ACRES training scheme and the knowledge transfer programme. The accelerated capital allowances scheme was expanded in budget 2025 to cover a broader range of farm safety investments in addition to the existing range of eligible farm safety equipment and adaptive equipment for farmers with disabilities. The additional farm safety investments are eligible for both TAMS and the accelerated capital allowances.  This year, my Department partnered with the Health and Safety Authority to deliver targeted media campaigns focusing on farm safety risks due to livestock and farmer fatigue. In addition, the HSA's guidance on managing fatigue with farm work was included in the 2025 BISS packs distributed to over 125,000 farmers.  The increased funding in 2026 will enable me to continue to deliver initiatives to support the safety, health and well-being of farmers, and everyone working and living on farms. \n Deputy Noel McCarthy  I thank the Minister of State for his response. We all agree that the health and well-being of our farmers are of vital importance. That is why I am pleased that the Minister of State and his Department are taking farm safety seriously. Nobody wants to hear of accidents or, heaven forbid, fatalities at work. Our farmers do an important job, sometimes in very dangerous circumstances. I, therefore, welcome the measures outlined by the Minister of State. I acknowledge that the farm safety capital investment scheme measure in TAMS 3 saw County Cork farmers receive the highest funding allocation of over €348,000 in 2024. This will allow farmers to improve their own safety and that of their farm. With that in mind, I ask the Minister of State if it is likely that this measure will continue next year. \n Deputy Michael Healy-Rae  As I said at the beginning, this Government considers farm safety of the utmost importance. I highlight that farm safety continues to be one of the most critical issues that need to be addressed on farms today. Statistics show that over the past decade, farm incidences account for almost 40% of all workplace fatalities, while accounting for only 6.1% of the working population. In addition, there are approximately 4,500 non-fatal incidents each year on Irish farms, some of which result in life-changing injuries. Very sadly, 16 farm fatalities have been confirmed this year. There has also been one in the marine and aquaculture sector. We are fighting a battle. The Deputy is right to raise the issue. Everyone, on all sides of the House, wants our farms to become what building sites became. We must remember that at one time, building sites were not safe places to work but that changed thanks to the work of the HSA and stricter regulations. We all might have given out about that at times when we were adapting, but we grew into it. Our building sites have become far safer places. We want to do the same for our farmyards, farm machinery and farms in general. If we can model our farms on the way building sites changed, we will reduce the deaths and the non-fatal accidents. \n Deputy Noel McCarthy  I acknowledge the work of the Minister of State and the Government on farm safety. I note that the Department has looked for proposals that focus on farm safety, health and well-being, and enhancing farmers' awareness, and that studies are being conducted. I also appreciate that a physical and mental health awareness programme is being funded, together with the Department of Health and the HSE, and that a media campaign focused on farmer fatigue has been run in partnership with the Health and Safety Authority. These are all important and welcome steps in ensuring farmer safety. Is the Department considering any other specific safety measures aimed, in particular, at younger farmers? Will the Minister of State please confirm the exact amount of dedicated funding for farm safety measures outlined in budget 2026? \n Deputy Michael Healy-Rae  I confirm that, as I said, there will be an increase in funding for safety this year to €3 million. I have been visiting schools. An agri-aware safety programme is running in our schools. It is excellent. This great work was started by our senior Minister, Deputy Heydon. He took it upon himself to focus on safety for young people, in particular. In the programme for Government, Securing Ireland's Future, the Government has set out its commitment to continuing to prioritise improvements in farm safety, health and well-being through strengthened supports. It places a specific focus on farmers' mental health and well-being, recognising the unique challenges faced by the sector. It also promotes positive mental health and well-being across the farming sector.  From the Taoiseach to the Tánaiste, our senior Minister and everyone else in the House, including the Opposition Deputies, every one of us wants to improve farm safety. If we all work together, we will, I hope, be able to reduce the number of deaths. ",
        "questionType": "oral",
        "showAs": " 94. Deputy Noel McCarthy asked the Minister for Agriculture, Food and the Marine the measures being taken by his Department to encourage farm safety; and if he will make a statement on the matter. [55024/25] ",
        "questionNumber": 94,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Noel McCarthy",
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_94"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Tillage Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_73.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_73",
          "debateSectionId": "dbsect_73"
        },
        "to": {
          "showAs": "Agriculture",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 130, 131 and 149 together.  I fully recognise the pressures facing the tillage sector, not least the very challenging market outlook and downward price pressure this season, and I have recently engaged directly with the farming organisations to hear their concerns.  This Government recognises the importance of the tillage sector and wants to grow the area under tillage crops.  In recognition of the sector’s importance, my Department will be supporting the tillage sector in 2026 with funding of at least €50m through the Protein Aid Scheme, the Straw Incorporation Measure and a Tillage Support Scheme. Having secured additional funding in Budget 2026 for a Tillage Support Scheme, I intend to consult with stakeholders on its design and operation in due course.  In addition to commitments made in Budget 2026, my Department has provided significant direct supports to tillage farmers in recent years. This year, the budget for the Protein Aid Scheme was €10m, having increased from €7m to €10m annually from last year. Applications for approximately 66,000 hectares of cereals and oilseed rape straw were submitted for chopping and incorporating under the Straw Incorporation Measure this year, and I made the decision to pay all applicants under the scheme.  In February this year, I announced €32.4 million of payments under the Tillage and Horticulture Support Scheme, which was Government’s response to the difficult position tillage and horticultural farmers found themselves in due to exceptionally poor weather and continued high input costs last Spring.  The Farming for Water EIP has a budget of €60m to support targeted on-farm additional measures to improve water quality, including establishment of cover crops. This year, over 1,400 tillage farmers have expressed an interest in establishing cover crops under the EIP. The tillage sector is also being supported under other schemes, including the Tillage Capital Investment Scheme, ACRES and the Organic Farming Scheme.  The Food Vision Tillage Group report identifies opportunities to grow the sector and to further improve its environmental footprint. My Department continues to engage with stakeholders to progress the actions in the report, and as it is an industry report, it will require collaboration and sustained effort from all stakeholders.  I will continue to work with the tillage sector and provide targeted support where possible given the strategic importance of the sector within the wider agricultural industry. ",
        "questionType": "written",
        "showAs": " 130. Deputy Noel McCarthy asked the Minister for Agriculture, Food and the Marine the targeted funding measures being considered by his Department to support the tillage sector; his engagement to date with the sector on such measures; and if he will make a statement on the matter. [55036/25] ",
        "questionNumber": 130,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Noel McCarthy",
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_130"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_261.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_261",
          "debateSectionId": "dbsect_261"
        },
        "to": {
          "showAs": "Finance",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Finance  I propose to take Questions Nos. 355, 357 and 359 together.  The Deputies' questions relate to the deemed disposal rules. These rules apply to investments in Irish domiciled investment funds and life assurance products, as well as equivalent offshore funds and certain foreign life assurance products. For Irish domiciled investment funds and life assurance products, the gross roll up regime applies and taxation occurs upon the occurrence of a chargeable event, including deemed disposal. Under the deemed disposal rules, and regardless of whether a disposal in fact occurs, tax is levied eight years after an investment is made, and every subsequent eight years. The tax is levied on any gain in the value of the investment from the date of acquisition to the date of the deemed disposal. On the ultimate disposal of the investment, any tax paid as a result of a deemed disposal is allowed as a credit against the final tax liability. Deemed disposal applies in the gross roll up regime, but also within the regime applying to equivalent offshore funds and certain foreign life assurance policies. Deemed disposal was introduced as an anti-avoidance measure.  As the Deputies may be aware, the final report of the Funds Review, ‘Funds Sector 2030: A Framework for Open, Resilient & Developing Markets’ was published in October 2024 and included recommendations to support and encourage retail investment, including the removal of deemed disposal. A focus on retail investment is also a key aspect of the European Union Savings and Investment Union.  I am committed to taking the necessary action to support retail investment in Ireland. Recognising the complexities of the current system, my officials are developing a roadmap for the taxation of retail investment, which will set out the intended approach to simplify and adapt the tax framework to encourage retail investment in future Finance Bills. The roadmap will also take account of developments at EU level in respect of the Savings and Investments Union and is expected to be published by early 2026.  While work on the roadmap is underway I have taken action in Budget 2026, announcing changes to the relevant applicable tax rates. Finance Bill 2025 will provide for a reduction in the rate of Investment Undertaking Tax (IUT), Life Assurance Exit Tax (LAET) and the rate of tax applicable to investments in equivalent offshore funds and certain foreign life assurance policies from 41% to 38% from 1 January 2026. ",
        "questionType": "written",
        "showAs": " 357. Deputy Noel McCarthy asked the Minister for Finance the current situation with respect to the eight-year deemed disposal rule; if any consideration was given to the abolition of this rule in the context of Budget 2026; his plans for the reform of this rule as recommended in the Funds Review Report; and if he will make a statement on the matter. [55115/25] ",
        "questionNumber": 357,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Noel McCarthy",
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_357"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_549.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_549",
          "debateSectionId": "dbsect_549"
        },
        "to": {
          "showAs": "Justice",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Justice, Home Affairs and Migration  I have requested the information sought by the Deputy from the Garda authorities. Regrettably, it has not been possible to compile the information in time and I will write to the Deputy once the information is available. ",
        "questionType": "written",
        "showAs": " 695. Deputy Noel McCarthy asked the Minister for Justice, Home Affairs and Migration the number of applicants who entered the Garda Síochána Foundation Training Programme in Templemore for each of the past ten programmes; the respective number who completed each of these training programmes; the number of these who were sworn in as Gardaí for each intake; and the number currently still serving in respect of each class, in tabular form; and if he will make a statement on the matter. [54847/25] ",
        "questionNumber": 695,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Noel McCarthy",
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_695"
      }
    },
    {
      "question": {
        "by": {
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "showAs": "Noel McCarthy"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-09/pq_80",
        "answerText": " Minister for Justice, Home Affairs and Migration  I am informed by the Garda authorities that the table below sets out the vehicles allocated to and removed from the Garda Fleet from 2021 to 2025 as of 30 September 2025.  All vehicles are operated up to the manufacturers durability limits or uneconomic repair, irrespective of age. A comprehensive service repair and maintenance programme is in place to ensure that all vehicles are operating to manufacturers specifications.  The responsibility for the efficient deployment of all official Garda vehicles in each Division is assigned to the Divisional Officer, who may allocate vehicles between stations as required by operational circumstances. The allocation of these vehicles is monitored and reviewed on a continual basis.     Year    Allocated    Removed      2021    369    241      2022    282    212      2023    271    163      2024    431    262      2025 *    323    234     * as of 30 September 2025.  An Garda Síochána publishes detailed information on the Garda fleet from 2008 to date. Information in relation to the number of Garda vehicles is publicly available and can be found at the following link:  [ https://www.garda.ie/en/about-us/our-departments/finance-services/finance-fleet-management.html ]  The Garda Commissioner is responsible under Section 33 of the Policing, Security and Community Safety Act 2024 for the management and administration of Garda business, including the purchase and allocation of Garda fleet resources. As Minister, I have no role in these independent functions. ",
        "date": "2025-10-09",
        "questionNumber": 80,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/writtens/dbsect_95",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/writtens/mul@/dbsect_95.xml"
            }
          },
          "debateSectionId": "dbsect_95",
          "showAs": "An Garda Síochána"
        },
        "showAs": " 80. Deputy Noel McCarthy asked the Minister for Justice, Home Affairs and Migration the number of An Garda Síochána vehicles taken out of service in each respective year from 2021 to 2024 inclusive, and to date in 2025; the reasons for their removal from service; the number of vehicles added in the same period; if there is a minimum number of Garda service vehicles required for each station; and if he will make a statement on the matter. [54235/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Justice",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-10-09"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy James Browne)  I propose to take Questions Nos. 119 and 130 together.  Addressing vacancy and dereliction is a key priority for Government.  The Vacant Homes Action Plan, published in January 2023, set out the various actions being pursued to return vacant properties back into use as homes. In March, I published the 2025 Progress Report which shows the significant progress that is being made and it is available on my Department's website at the following link: www.gov.ie/en/publication/df86c-vacant-homes-action-plan-2023-2026/ .  Data in relation to vacant properties is available from a number of sources such as the CSO, Census 2022 and GeoDirectory.  The Central Statistics Office (CSO) has recently developed a new statistical release on residential vacancy. The release, published on 24 September 2025, provides information on the extent of residential vacancy in 2022 and 2023, using ESB data on metered residential electricity consumption, with future regular publications planned.  In the release, the CSO note a national vacancy rate of 3.3% at the end of Q4 2023, down from 3.6% in Q4 2022. Data is provided at a national, local authority and local electoral level, including for Dún Laoghaire-Rathdown and Cork County. This release will further inform our understanding of vacancy and the development of policy and measures to address it.  In the latest GeoDirectory Residential Buildings Report for Q2 2025, the average vacancy rate across Ireland had dropped to 3.7%, the lowest rate recorded since 2013; a local authority breakdown is also provided.  My Department has also supported local authorities to collate data on vacant and derelict properties in their administrative areas. Almost all local authorities, including Cork County Council and Dún Laoghaire-Rathdown County Council, now have a database of vacant properties which they can update on an ongoing basis. The database is not intended to be a comprehensive count of every vacant and derelict property in their administrative area. It is used by the local authority to engage with property owners and work with them to bring those properties back into use.  Under section 8 of the Derelict Sites Act 1990, a local authority is obliged to maintain a Derelict Sites Register and shall enter on to the register the particulars of any land in their functional area which, in their opinion, is a derelict site. Under Section 23 of the Act, local authorities may apply a Derelict Sites Levy (DSL), on an annual basis, for sites entered on the derelict sites register on the 1 January of that year. Data is provided on the number of properties on Derelict Sites Registers in Cork County and Dun Laoghaire-Rathdown in 2022 and 2023. My Department is currently engaged with all local authorities in the process of collecting and collating the 2024 annual returns.      Local Authority      No. of Derelict Sites on Register at 31 December 2022      No. of Derelict Sites on Register at 31 December 2023       Cork County    59    71      Dun Laoghaire Rathdown    11    10     While varying levels and rates of vacancy are indicated in the different data sources, the overall trend is downwards and vacancy levels are declining. ",
        "by": {
          "showAs": "Noel McCarthy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "memberCode": "Noel-McCarthy.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "date": "2025-10-08",
        "questionNumber": 119,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/dbsect_109",
          "debateSectionId": "dbsect_109",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/mul@/dbsect_109.xml"
            }
          },
          "showAs": "Vacant Properties"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-08/pq_119",
        "showAs": " 119. Deputy Noel McCarthy asked the Minister for Housing, Local Government and Heritage the number of vacant or derelict properties registered in Cork county from 2022 to 2024 and to date in 2025; and if he will make a statement on the matter. [53282/25] "
      },
      "contextDate": "2025-10-08"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  I propose to take Questions Nos. 99 and 126 together.  My Department notes the commitment in the Programme for Government 2025 – Securing Ireland’s Future to introduce planning guidelines for solar energy developments.  In light of this commitment, my Department has begun an initial scoping process to identify the component factors relevant to the preparation of planning guidelines for solar energy development, including any appropriate environmental reporting and public consultation requirements, and the possible timeframe for publication of said guidelines.  Given this scoping process remains at an early stage, such guidelines, once completed, will issue as a National Planning Statement, following the commencement of the relevant provisions of the Planning and Development Act 2024.  In the interim, there are currently no specific planning guidelines in place in respect of solar energy development. Proposals for individual solar energy developments are subject to the statutory requirements of the Planning and Development Act 2000, as amended, in the same manner as other proposed developments, with planning applications made to the relevant local planning authority, or An Coimisiún Pleanála on appeal. ",
        "by": {
          "showAs": "Noel McCarthy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "memberCode": "Noel-McCarthy.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "date": "2025-10-08",
        "questionNumber": 126,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/dbsect_97",
          "debateSectionId": "dbsect_97",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/mul@/dbsect_97.xml"
            }
          },
          "showAs": "Solar Energy Guidelines"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-08/pq_126",
        "showAs": " 126. Deputy Noel McCarthy asked the Minister for Housing, Local Government and Heritage to provide an update on the work of his Department to progress the Programme for Government commitment to introduce planning guidelines for solar energy developments; and if he will make a statement on the matter. [53325/25] "
      },
      "contextDate": "2025-10-08"
    },
    {
      "contextDate": "2025-10-02",
      "question": {
        "debateSection": {
          "debateSectionId": "dbsect_86",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/dbsect_86",
          "showAs": "Swimming Pools",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/mul@/dbsect_86.xml"
            }
          }
        },
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "houseNo": "34",
          "chamberType": "house"
        },
        "showAs": " 62. Deputy Noel McCarthy asked the Minister for Culture, Communications and Sport the measures being taken by his Department to encourage the establishment of swimming pools in towns that currently have no such facilities; and if he will make a statement on the matter. [51927/25] ",
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  Ireland’s first National Swimming Strategy sets out a vision to provide everyone in our country with an opportunity to swim. It includes an Action Plan containing over 50 actions across five thematic strands, focusing on providing improved facilities, increasing access for people with disabilities, improving the culture of inclusion, better coaching supports, increasing safety awareness and providing a pathway that allows for the nurturing and development of potential high performers.  A key focus of the Strategy is on providing improved facilities and there is a specific action in the strategy to complete an in-depth analysis of swimming pool provision within Ireland with particular reference to identifying gaps in provision. Swim Ireland is currently undertaking an analysis of the type and nature of swimming pool ownership in the country and will publish a report in this regard in the coming period.  In support of the National Swimming Strategy, additional funding of €500,000 was provided to Swim Ireland in 2024 for the deployment of swimming activators to work within local authority areas, focusing on increasing participation amongst under-represented groups and improving coaching supports and facilities. This additional funding will also be provided in 2025 and 2026 – totalling €1.5 million over three years.  Responsibility for the delivery of the Strategy’s Action Plan is shared across Government Departments, State Agencies and other key stakeholders, including local authorities. Sport Ireland recently established an oversight group of key stakeholders to oversee the Strategy’s implementation.  Previously, Government support for new swimming pools or the refurbishment of existing pools was provided through the Local Authority Swimming Pool Programme (LASPP). 52 pools have been completed under the LASPP, with a Lucan project currently under construction.  Capital support for new swimming pools, and the refurbishment of existing pools, is also provided by my Department through the Large Scale Sport Infrastructure Fund (LSSIF). The LSSIF has allocated €28.9 million to 9 swimming pool projects over recent years.  In addition, under the 2023 round of the Community Sports Facilities Fund, a total of over €1.5 million was allocated to 40 swimming projects in 2024. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-02/pq_62",
        "questionNumber": 62,
        "questionType": "written",
        "date": "2025-10-02",
        "to": {
          "roleType": null,
          "uri": null,
          "roleCode": null,
          "showAs": "Culture"
        },
        "by": {
          "memberCode": "Noel-McCarthy.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Noel-McCarthy.D.2024-11-29",
          "showAs": "Noel McCarthy"
        }
      }
    }
  ]
}