{
  "head": {
    "counts": {
      "questionCount": 2591,
      "resultCount": 2591
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  The query raised by the Deputy is an operational matter for Dublin Bus. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 312. Deputy Mark Ward asked the Minister for Transport the number of electrified buses Dublin Bus has in service; the number not in service; the number of garages Dublin Bus operate; the number of these garages that have capacity to charge electric buses; the number of charging points Dublin Bus has in operation; and if he will make a statement on the matter. [73282/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Ward.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29",
          "showAs": "Mark Ward"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_316",
          "debateSectionId": "dbsect_316",
          "showAs": "Dublin Bus",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_316.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_312",
        "questionNumber": 312
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 31, 32 and 33 together.  The Cabinet Committee on Housing works to ensure a coordinated, cross Government, approach to the implementation of Programme for Government commitments regarding housing policy.  The Programme for Government sets out our ambition to accelerate housing supply, building on progress already achieved, recognising housing as a major social and economic challenge.  Last month, Government launched the new National Housing Plan, Delivering Homes, Building Communities 2025-2030,  which aims to speed up the delivery of new homes and tackle homelessness. The plan targets the construction of 300,000 homes, including 72,000 social homes and 90,000 affordable housing supports. Building on the progress of Housing for All, which saw 137,000 homes delivered since 2021, the new plan will enable the State, public bodies, and the private sector to further play a critical part in accelerating delivery.  The Cabinet Committee on Housing last met on Monday, 10th November, and is scheduled to meet again on Monday, 15th December. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 32. Deputy Mark Ward asked the Taoiseach when the next meeting of the Cabinet committee on housing will take place. [65417/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Ward.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29",
          "showAs": "Mark Ward"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_67",
          "debateSectionId": "dbsect_67",
          "showAs": "Cabinet Committees",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_67.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_32",
        "questionNumber": 32
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The major building project for the school referred to by the Deputy is a large scale capital project for the construction of a new extension and the refurbishment of existing facilities to accommodate 1,000 pupils, including provision for Special Educational Needs (SEN) classrooms.  More than four years has elapsed since the publication of the contract notice and more than two years since the tender submission deadline. Given the passage of time since tenders were returned and the unacceptably high risk that the contract may not successfully be delivered within budget, the ETB were instructed to collapse the tender procedure in July 2025.  My Department officials have engaged with the ETB and School Principal and have proposed to progress a phase 1 of this project through my Department’s timber modular framework which offers an extremely high quality finish and fast delivery.  The proposal relates to Phase 1 of the school extension, covering a gross internal floor area of 1,500 m² includes the superstructure and internal finishes containing additional accommodation for 204 pupils and 4 additional classrooms for pupils with Special Educational Needs with sufficient flexibility to cater for subsequent phases on the site.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 443. Deputy Mark Ward asked the Minister for Education and Youth if a building project for a school (details supplied) will be included on her Departments priority list for full completion across 2026 and 2027; and if she will make a statement on the matter. [70101/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Ward.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29",
          "showAs": "Mark Ward"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_397",
          "debateSectionId": "dbsect_397",
          "showAs": "School Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_397.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_443",
        "questionNumber": 443
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  As Minister of State for International & Road Transport, Logistics, Rail & Ports, I wish to advise that the minimum standards of driving fitness for all drivers, with which all member states must comply, are set at EU level. These standards cover medical conditions that affect driving and set out restrictions on the ability to hold a licence.  Member states may, if they choose, apply higher standards in their own jurisdictions. The minimum standards of physical and mental fitness required to drive in Ireland are set out in the Road Traffic (Licensing of Drivers) Regulations 2006 (SI 537 of 2006).  As a road safety measure, individuals with medical conditions that may affect their ability to drive must submit a medical report to the National Driver Licencing Service (NDLS) when applying for or renewing a driving licence or learner permit. This requirement includes people with conditions such as epilepsy.  The medical report is considered by the NDLS when determining if a licence or permit can be granted or renewed. Where a licence is issued, the length of its validity is determined by the medical assessment. Currently, there is no issuing fee for a one year licence on medical grounds.  ‘Sláinte agus Tiomáint Medical Fitness to Drive Guidelines’, have been developed to assist healthcare professionals to write medical reports and to provide guidance on reviewing the stability, progression or improvement in an individual’s medical condition. They are compiled by the Road Safety Authority, which has statutory responsibility for testing and licencing and for the NDLS, with the National Office for Traffic Medicine.  The Guidelines are updated regularly, to ensure compliance with emerging evidence in the medical literature and with harmonising standards set by EU Directives and adopted into Irish law. The most recent update, in April 2025, may be found at: www.rsa.ie/docs/default-source/road-safety/slainte-agus-tiomaint-medical-fitness-to-drive-guidelines-2025.pdf?sfvrsn=2855c887_3. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 96. Deputy Mark Ward asked the Minister for Transport the process by which drivers with epilepsy apply to renew their drivers licence; if the expiry date on their new licence will be based on when they applied or when their doctors assessment was carried out; if this will be reviewed; and if he will make a statement on the matter. [68291/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mark-Ward.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29",
          "showAs": "Mark Ward"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_90",
          "debateSectionId": "dbsect_90",
          "showAs": "Driver Licences",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_90.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_96",
        "questionNumber": 96
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection (Deputy Dara Calleary)  Carer's Allowance and Carer's Benefit are taxable sources of income.  Earlier this year, it was agreed between my Department and the Revenue Commissioners that, from 01 January 2026, information on these payments will be included in the Taxable Payments Report shared directly with Revenue. This equitable solution removes the onus on carers to contact Revenue themselves to inform them that they are in receipt of a Carer's Allowance or Carer's Benefit payment.  If Carer's Allowance or Carer's Benefit is a person's only source of income, they are unlikely to have to pay tax. This is because their tax liability may not exceed their tax credits.  ",
        "to": {
          "showAs": "Social",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Mark Ward",
          "memberCode": "Mark-Ward.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_335.xml"
            }
          },
          "debateSectionId": "dbsect_335",
          "showAs": "Care Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_335"
        },
        "questionNumber": 393,
        "date": "2025-11-27",
        "showAs": " 393. Deputy Mark Ward asked the Minister for Social Protection the rationale for his Department to share carers income with the Revenue Commissioners; when this was agreed; the changes to carers arising from this decision; and if he will make a statement on the matter. [66808/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_393"
      },
      "contextDate": "2025-11-27"
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 26. Deputy Mark Ward asked the Taoiseach if he will report on the programme plan for his Department’s new disability unit for 2025 to 2027. [65416/25] ",
        "answerText": " An Ceann Comhairle  We have 15 to 16 minutes left. There are 20 Deputies to speak on the next question. I propose to divide the time remaining after the Taoiseach's opening statement between a number of Deputies. \n The Taoiseach  It is a brilliant statement. \n An Ceann Comhairle  The Taoiseach will have to try to be brief. \n The Taoiseach  I jest. \n Deputy Peadar Tóibín  It is all in the delivery. \n The Taoiseach  I will try to cut it short to allow others to come in. I propose to take Questions Nos. 14 to 35, inclusive, together.  I established the disability unit in the Department to bring about a renewed focus and urgency and out of a desire to drive progress on disability issues. The unit's first programme plan, published in September, outlines how the unit will drive the delivery of the Government's new national disability strategy, working across government to make the ambitions a reality. In particular, the unit will look to drive innovation, to get things done, to bring momentum to policy implementation, to troubleshoot, where appropriate, to improve the delivery of services, and to get strategic thinking on future challenges. The unit will also support the Cabinet committee on disability.  The first programme plan for the unit outlines ten priority areas for the period from 2025 to 2027 across five workstreams. The first workstream relates to transforming children's disability services, early years education and health. The second is about increasing system capacity and the third is about opening doors and addressing barriers to employment pathways and supports. The fourth relates to implementing the national disability strategy and the fifth is on planning and designing for the future. The programme plan allows for further workstreams to be assigned to the unit as may be needed.  We do not want to duplicate the work of Ministers or Departments but to support them in improving services and getting things done. It is already up and running. The Cabinet committee on disability has met five times to date. With the support of the unit, we have looked at the new national disability strategy. As the House will know, that has gone through and has now been published. The provision of therapists in special schools is up and running. Some €16 million has been allocated for that this year. There have also been improvements to the delivery of services and the assessment of need process is being reformed, which includes legislative reform.  The budget was impacted by the unit and the Cabinet subcommittee and there was a significant focus on disability, particularly the income disregards for carer's allowance, among other initiatives and payments. The budget also provided a record €3.8 billion allocation towards specialist disability services. This represents a 20% increase year on year. That is to provide permanent dedicated funding for essential disability services. The investment in children's disability services will provide therapy services and strengthen the children's disability network teams through the provision of additional staff and so forth. Some €20 million was targeted at the assessment of need waitlist initiative, providing up to 6,500 clinical assessments. We are developing our budget spotlight on disability. That will be published in due course. It relates to the last budget but will also provide further thinking with regard to future budgets. We are also looking at developments in the area of transport and mobility. We are awaiting proposals from the Departments of Transport and Finance in that regard. \n An Ceann Comhairle  I propose to take the first six Deputies and to allow the Taoiseach six minutes to respond. \n Deputy Pádraig O'Sullivan  This is a topic the Taoiseach is very familiar with. He has visited the Rainbow Club on dozens of occasions at this stage and knows the great work that Jon, Karen and the board do. When Senator Rabbitte was the Minister of State, she was the first to allocate funding to the Rainbow Club under a service level agreement to provide respite care for children. As the Taoiseach will know, every week, over 1,200 children avail of this service, which is provided on a shoestring budget. The Taoiseach will be very familiar with the difficulties the club had in acquiring a nearby site, the former HSE ambulance building. It now has that building and has been lucky enough to engage an architect who is a professional in this field pro bono to design a bespoke building that is fit for the club's purposes. We need to move this project on. We need the HSE and the Government to support it financially to deliver it. It is going to be a massive undertaking for the charity. What is the Taoiseach's office going to do to advance the project? \n Deputy Ruairí Ó Murchú  The National Human Rights Strategy for Disabled People 2025-2030 was launched with great fanfare but we await the action plan. There is much talk of accountability. Will the Taoiseach give me a timeline for the introduction of that action plan? Who will be taking the lead, particularly with regard to oversight and accountability? Will it be the unit, the Cabinet committee or the Department of Children, Disability and Equality? How exactly will it work? How will we see improvements, whether in relation to assessments and therapies or the low level of disabled people who are involved in employment and the need for schemes that actually work? A lot of work is needed to make schemes such as the wage subsidy scheme and the work and access programme fit for purpose. \n Deputy Cian O'Callaghan  The level of unemployment among disabled people in Ireland is among the worst in Europe. I recently met with a number of disabled people in my constituency who have excellent qualifications and skills and who are willing and eager to work but who are stuck in unemployment. There are a number of barriers to employment that need to be removed. We are far behind other European countries in this regard. In 2021, the OECD released a report that made a number of recommendations as to how to tackle this. Those recommendations have still not been implemented. When will they be implemented in full?  What is the Government doing to tackle the scandalously high unemployment levels for disabled people in Ireland? \n Deputy Barry Heneghan  Bhí mé ag caint faoi seo dhá sheachtain ó shin agus an tseachtain seo caite. An rud atá i gceist ná Stapolin Educate Together National School in Baldoyle, which has a petition. Children from the school were in the Dáil last week. It needs two autism classrooms to be sanctioned by the Minister. There are eight children in mainstream classes with eligibility letters and a further 30 in the catchment area who are on waiting lists. This is a huge priority for me and I would love it to be addressed. \n Deputy Richard Boyd Barrett  David and Nicole have a five-year-old son with autism, and an older son. They live in a maisonette, which is 29 sq. m. It is absolutely tiny and rank with damp. Because of his autism, their son has serious sensory processing issues. He is a flight risk. I know these flats well. They have very dangerous concrete steps, which are a serious risk to him. Occupational therapists, medical professionals and people in school have said that he has to be got out of there as he cannot develop or do his occupational therapy if he is living in these conditions. Dún Laoghaire-Rathdown County Council says autism is too prevalent in the community to give it medical priority. That is outrageous. The prevalence of a condition is not a reason to say it is not a priority if the child is in danger. If a child is in danger, it is a priority to get the child out of danger. \n An Ceann Comhairle  I appreciate that. The Taoiseach has the message. \n Deputy Richard Boyd Barrett  I would like there to be an intervention on that. \n Deputy Paul Murphy  The budget was a savage attack on disabled people. It took over €1,000 out of the pockets of disabled people and betrayed the promise in the programme for Government to introduce a permanent annual cost-of-disability support payment. The last time I asked about this, the Taoiseach claimed the cost of disability would be looked at in the next budget. The cost-of-living crisis is now. The cost-of-disability crisis is now. Some 70,000 people who are disabled or have a long-term illness are living in poverty. That is one in three. I have been inundated with emails from disabled people asking for winter cost-of-living and cost-of-disability payment. Many will be forced to choose between heating and eating this Christmas. They also want a permanent cost-of-disability payment without further delay. The Taoiseach has billions of euro in surplus. Do not be a Scrooge this Christmas. Please act on it. \n Deputy Peadar Tóibín  The children's disability network team, CDNT, in Meath is not fully staffed. According to statistics I received today, there are 20 vacant posts across disability teams in Kells, Dunshaughlin, Navan, Slane and Trim. Separate data received by Aontú today show that the Government is actually reducing the number of college places for speech and language therapists, from 370 in the year before Covid to 355 last year. The Government is reducing the number of students filling the necessary college places on an annual basis. What is the Taoiseach saying to parents whose children have been waiting for 14 months to see the CDNT in County Meath and to the children who are being bounced around endlessly from CAMHS, the CDNTs and other services? \n An Ceann Comhairle  Before the Taoiseach replies, could he maybe answer the other Deputies in writing?  Sixteen Deputies did not get to ask questions. They might get some form of response from the Taoiseach. \n The Taoiseach  You can bring some more of them in if you want, a Cheann Comhairle. \n An Ceann Comhairle  Only if the Taoiseach needs less time. We cannot go over the 45 minutes provided. \n The Taoiseach  I am not going to write replies to oral questions. I have given an overall response to everybody. \n An Ceann Comhairle  I am bound by the timelines set down. \n The Taoiseach  Do I have six minutes remaining? \n An Ceann Comhairle  Yes. \n The Taoiseach  I will get around to everybody who has asked a question. \n An Ceann Comhairle  I am talking about the Deputies who have not have not got in. \n Deputy Richard Boyd Barrett  The Taoiseach cannot really answer questions that have not been asked. \n An Ceann Comhairle  I know, but that is it. \n The Taoiseach  It is a new departure if I am going to do a written reply to every oral question. That is not on either. \n An Ceann Comhairle  The Taoiseach should go ahead. I suppose it is just a casualty of how interruptions affect the course of questions. To be fair, the Taoiseach cannot answer a question that has not been asked. We are delaying the answering process. \n Deputy Jennifer Whitmore  Could we even have 30 seconds to ask a question and then maybe the Taoiseach could respond? \n An Ceann Comhairle  No. We cannot go over time. I do not set the time. I do not have that discretion. \n Deputy Jennifer Whitmore  No, but we could stay within the time. \n An Ceann Comhairle  There are 15 Deputies left. \n The Taoiseach  Deputy Pádraig O'Sullivan raised the Rainbow Club, which is doing exceptional work. Jon and Karen O'Mahony have been exceptional leaders in that regard. The former Minister of State, now Senator Rabbitte, did good work on a service level agreement. I was involved in advocating for that building, which was a HSE building, to be allocated to the Rainbow Club. I will certainly continue to work with them and to support them with capital. What is important is that we get a timeline and some idea of how we can progress that as quickly as we possibly can. It is a very good, practical example of how a parent-led, community-based approach can develop services for autism in a nimble and flexible way that has helped so many families.  Deputy Ó Murchú asked about the action plan. That will come.  I do not have an exact date but it is on target. It is fairly imminent. \n Deputy Ruairí Ó Murchú  Who will lead on it? \n An Ceann Comhairle  Please, Deputy Ó Murchú. \n The Taoiseach  The Minister, Deputy Foley, will lead, with the support of the unit in my office, but she will also report to the Cabinet subcommittee, which will then make recommendations to the Cabinet. That is how this will work. The Cabinet subcommittee is very important because all the key Ministers have to be there.  I agree with Deputy Cian O'Callaghan that the unemployment levels among the disability community is too high, and the barriers are too much. Part of the strategy in terms of what I am trying to do with the Minister, Deputy Calleary, is to remove some of those barriers and to create additional supports to make sure that employers are even more incentivised to recruit people. The intention is also to give supports to those who employ people with disabilities on a more sustainable basis. I do not disagree with the Deputy. The historic underemployment of people with disabilities in society is something that is exercising me.  I will pursue the issue raised by Deputy Heneghan about the two autism classes in the Educate Together school in Baldoyle.  I agree with Deputy Boyd Barrett. That is a very strange response from the council referring to the prevalence of autism. Autism is a spectrum, a continuum. There is high-functioning autism, people in the middle and those with autism which is very severe and profound. The council should be able to use the general guidelines in respect of health needs more generally. I am at a loss as to why the council cannot say in this case that the child needs prioritisation and a proper house to facilitate the treatment and life of the child. That is something on which I will go back to the Minister for housing in respect of guidelines to be sent to councils in that respect. I would not have thought it necessary. I thought councils would have enough flexibility to do this.  I disagree with Deputy Paul Murphy's description of the budget as a savage attack, but €3 billion has been invested in special education as an outcome of the budget, as well as €130 million for grants to adapt the houses of older people and disabled people. There was a €10 increase per week in the disability allowance, an expansion of the wage subsidy scheme, an increase of €375 in the income limit for carer's benefit, and a €20 increase in the monthly domiciliary care allowance. That is not a savage attack on disability. We have to pursue the cost of disability and the Minister will bring plans in the next budget in respect of that.  In response to Deputy Tóibín, the vacancy rate nationally has come down for CDNTs. We have increased the allocation of therapy places in third level colleges. \n An Ceann Comhairle  I thank the Taoiseach. Even though there is time left, the point is that this format is not working. The place to discuss that is at the Business Committee on Thursday. I ask Members to bring it up and we can sort out something else. Certainly, where there is a grouping of 19 Members, it is not possible to give the Taoiseach time to answer in the remaining time. I am sorry for those who did not get in but there is just nothing we can do, other than discuss it at the Business Committee and change the format. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_26",
        "debateSection": {
          "showAs": "Departmental Programmes",
          "debateSectionId": "dbsect_17",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/debate/mul@/dbsect_17.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/debate/dbsect_17"
        },
        "date": "2025-11-26",
        "questionNumber": 26,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Mark Ward",
          "memberCode": "Mark-Ward.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29"
        },
        "questionType": "oral",
        "to": {
          "showAs": "Taoiseach",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "question": {
        "showAs": " 13. Deputy Mark Ward asked the Minister for Housing, Local Government and Heritage the funding allocated to local authorities to bring vacant properties back into public use for social housing; and if he will make a statement on the matter.  [65437/25] ",
        "debateSection": {
          "showAs": "Vacant Properties",
          "debateSectionId": "dbsect_40",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/debate/dbsect_40",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/debate/mul@/dbsect_40.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Mark Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29",
          "memberCode": "Mark-Ward.D.2019-11-29"
        },
        "questionNumber": 13,
        "answerText": " Deputy Thomas Gould  Will the Minister update the Dáil on the funding allocated to local authorities to bring the thousands of vacant properties back into public use for social housing, and will he make a statement on the matter? \n Deputy Kieran O'Donnell  The management and maintenance of local authority social homes, including pre-letting repairs to vacant properties, implementing a planned maintenance programme and carrying out responsive repairs are matters for each individual local authority under section 58 of the Housing Act 1966. Local authorities are also statutorily required to ensure all their tenanted homes comply with the Housing (Standards for Rented Houses) Regulations 2019. Notwithstanding these obligations, my Department provides annual funding under the planned maintenance and voids programme to support local authority management and maintenance programmes.  Since 2014 to the end of 2024, over 25,600 vacant social homes were brought back into productive use through an investment of more than €361 million. Some €31 million will be provided in 2025, supporting the refurbishment and re-letting of a minimum of 1,900 social homes, facilitating the quick turnaround of vacant homes and continuing the transition from a reactive voids approach to a planned maintenance approach. Funding will further increase in 2026 and, under a revised voids programme, will focus on the prompt turnaround of casual vacancies and reductions in the level of overall vacancy in the local authority housing stock, while also contributing to stock conditions surveys and supporting works arising from these surveys. This funding should complement local authorities' own resources, and should not be viewed as a substitute for local authority funding or for the requirement for adequate budgeting for housing management and maintenance by local authority officials and elected members as part of their annual budgetary process.  Data on delivery under the 2025 planned maintenance and voids programme, and local authority allocations for 2026, will be available early next year. It is my intention to introduce a new voids programme with a renewed focus on prompt turnaround and re-letting of vacant units by focusing only on those works necessary to ensure compliance with the Housing (Standards for Rented Houses) Regulations 2019. \n Deputy Thomas Gould  Can I give the Minister of State a bit of advice and provide him with a solution? I sincerely want the Government to take this on board. He has just said the voids programme will be open in the new year. Why is it not open today? Why is the voids programme not open 365 days a year so that when a house comes back, the local authority can fix it up and allocate it out? Opening it just once or twice a year does not make sense. I am trying to be constructive but the Government always criticises us and says there is nothing coming from the Opposition. This is a simple fix here: keep the void programme open for 365 days a year so that houses are not left to rot.  Can I give the Minister of State one statistic? Data I received earlier this year from local authorities showed that one in four vacant houses is idle longer than 12 months. If we open the voids programme all year long, that will stop. We could get a fix here today. We could agree on this. We are trying to be cross-party constructive and that is something we could do together that would make a real difference to social housing and people on the housing list. \n Deputy Kieran O'Donnell  I thank the Deputy. I can see his passion. The Minister and the Department want to move to a planned maintenance programme, away from legacy. We want to bring all those units and homes up to a state of repair. The focus from now on will be about a model for planned maintenance such that houses can be re-let promptly, but ongoing works are being done to homes in order that when they become vacant, they are then in a reasonably good state and only a modest amount of work has to be done to re-let them. The Deputy will accept that one of the key problems is the length of time it takes local authorities to turn around voids to re-let them.  The model is moving and I think the Deputy and I are on the same page on that. I expect it is something he would support. It is towards a planned maintenance model rather than a model that is just reactive when properties become vacant. We want to move to planned maintenance. The local authorities are doing surveys of all their stock to get to that point and that is a key body of work the local authorities are returning to the Department. \n Deputy Thomas Gould  I am not sure if the Minister of State knows this, but he should. If someone is not telling him this, he should get into the Department tomorrow and ask the question. He talks about preventative maintenance. At the current rate of preventative maintenance, it will take 78 years to do the stock survey of all local authority housing. That is the figure the Government provided to me - 78 years - and he comes in here to answer the question saying this is what the Government has planned. There are people who are living in mouldy, damp houses with leaks in the roof and windows and front doors that are unfit. People have heating systems that are not up to standard and the Minister of State comes in here talking about preventative maintenance. The Department cannot even do the audit. If it cannot do the audit and does not have the information, how is it going to do the maintenance?  Does the Minister of State know how much was allocated for preventative maintenance? It was €67 per house for each local authority. Each local authority is to have €67 to calculate what preventative maintenance needs to be done. Does the Minister of State really think that is going to do the job? I am asking him a straight yes-no question. I am telling him it will not. \n Deputy Kieran O'Donnell  I have a couple of figures for the Deputy. A sum of €31 million is being given in 2025 towards voids and planned maintenance. It will be €40 million for next year, 2026. Furthermore, the intention is that local authorities will have these stock surveys done over the next four to five years. \n Deputy Thomas Gould  I got the figures from the Department. \n Deputy Kieran O'Donnell  We have to be ambitious about getting these surveys completed. \n Deputy Thomas Gould  These are the facts. \n Deputy Kieran O'Donnell  Ultimately, the key point is that there are two areas here. Number one, the local authority itself has rental income coming in, which is ring-fenced in terms of maintenance for its housing stock. Furthermore, the Department gives additional funding in that regard as well. But we have to move. Everyone talks about future-proofing and coming up with a model that will work into the future. I think the Deputy would accept that we need to get to a space where we have a plan maintenance rolling model rather than a model on voids alone. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_13",
        "questionType": "oral",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 31. Deputy Mark Ward asked the Minister for Housing, Local Government and Heritage for an update on the tenant-in-situ scheme; the amount of funding which has been allocated to South Dublin county council for the scheme in 2026; and if he will make a statement on the matter. [65436/25] ",
        "debateSection": {
          "showAs": "Housing Schemes",
          "debateSectionId": "dbsect_66",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_66",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_66.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Mark Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29",
          "memberCode": "Mark-Ward.D.2019-11-29"
        },
        "questionNumber": 31,
        "answerText": " Minister for Housing, Local Government and Heritage  Tenancy sustainment, or tenant-in-situ, is a priority category under my Department's Second Hand Acquisitions Programme. It is not a scheme, but a policy tool available to local authorities to prevent social housing supported households in the private rented sector from falling into homelessness. It should only be used as a last resort by local authorities when all other options have been exhausted.  Some €25 million has been allocated to South Dublin County Council (SDCC) under Second Hand Acquisitions Programme this year. To date, and with just weeks left to year-end, only €11.6 million has been drawn down by SDCC. The programme has supported 71 acquisitions by SDCC so far this year as follows:  • 67 acquisitions for tenancy sustainment (tenant in situ)  • 4 acquisition for exits from homelessness,  • no acquisition for housing suitable for persons with a disability or the elderly, and  • no acquisitions for buy and renew to tackle vacancy.  I expect the 2026 Second Hand Acquisitions Programme to maintain support for the tenancy sustainment in 2026. Funding allocations will be agreed and notified to local authorities as early as possible next year.  In the meantime, local authorities have been authorised to enter into commitments for 2026 to a value of up to 30% of their original 2025 acquisitions budget. This allows them commit, pending an agreed programme budget for next year, some €95 million extra in 2025 for acquisitions that will complete and draw down in 2026. This flexibility effectively provides for a multi-annual approach to programme delivery, facilitating local authorities to plan and progress acquisitions from one year to the next with a higher level of certainty vis-à-vis future funding availability.  For SDCC, it provides scope to commit €7.5 million for acquisitions that are likely to only complete and drawdown in 2026. This includes acquisitions to support exits from homelessness, tenancy sustainment via tenant in situ, and other priority cohorts such as older persons, persons with disabilities, care leavers, etc.  An additional €5 million was also allocated in September to support acquisitions by SDCC for households, particularly larger families with children, to exit emergency homeless accommodation into housing. While the council has not drawn down any monies from this allocation to date, any funding not drawn down this year will be carried into 2026 and will remain ringfenced from SDCC's broader 2026 Second-Hand Acquisitions Programme allocation. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_31",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 334. Deputy Mark Ward asked the Minister for Education and Youth her plans to allow people who are contracted by Bus Éireann to drive buses for children with additional needs to continue to do so after they reach 70 years-of-age; her views on the current policy; the engagement her Department has had with Bus Éireann on this matter; and if she will make a statement on the matter. [65498/25] ",
        "debateSection": {
          "showAs": "Bus Services",
          "debateSectionId": "dbsect_329",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_329",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_329.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Mark Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29",
          "memberCode": "Mark-Ward.D.2019-11-29"
        },
        "questionNumber": 334,
        "answerText": " Minister of State at the Department of Education and Youth  The School Transport Scheme is a substantial national operation managed by Bus Éireann on behalf of the Department of Education and Youth.  The  retirement age for school bus drivers has been set by Bus Éireann at 70 years of age, which also applies to all Bus Éireann road passenger services.  The policy and criteria also apply to drivers nominated by private operators who operate services as part of the School Transport Scheme, provided they hold the requisite license and satisfy an annual medical examination until they retire at age 70.  Under the new Programme for Government, a commitment has been made to \"Carry out an independent assessment on the feasibility of removing the exclusion of drivers aged over 70 from the School Transport Scheme\".   There is ongoing engagement between the Department and Bus Éireann to advance this commitment as quickly as possible, while also being cognisant of available evidence regarding any safety risks in the context of any change in policy. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_334",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 385. Deputy Mark Ward asked the Minister for Education and Youth if there are plans to allow people who are contracted by Bus Éireann to drive buses for children with additional needs to continue to do so after they reach 70 years-of-age; her views on the current policy; the engagement her Department has had with Bus Éireann on this matter; and if she will make a statement on the matter. [65491/25] ",
        "debateSection": {
          "showAs": "School Transport",
          "debateSectionId": "dbsect_376",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_376",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_376.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Mark Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29",
          "memberCode": "Mark-Ward.D.2019-11-29"
        },
        "questionNumber": 385,
        "answerText": " Minister of State at the Department of Education and Youth  The School Transport Scheme is a substantial national operation managed by Bus Éireann on behalf of the Department of Education and Youth.  The  retirement age for school bus drivers has been set by Bus Éireann at 70 years of age, which also applies to all Bus Éireann road passenger services.  The policy and criteria also apply to drivers nominated by private operators who operate services as part of the School Transport Scheme, provided they hold the requisite license and satisfy an annual medical examination until they retire at age 70.  Under the new Programme for Government, a commitment has been made to \"Carry out an independent assessment on the feasibility of removing the exclusion of drivers aged over 70 from the School Transport Scheme\".   There is ongoing engagement between the Department and Bus Éireann to advance this commitment as quickly as possible, while also being cognisant of available evidence regarding any safety risks in the context of any change in policy. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_385",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 748. Deputy Mark Ward asked the Minister for Children, Disability and Equality if her Department will review the AIM funding for a person (details supplied); the options available to the family in order that their child can remain in pre-school for a full day; the steps her Department is taking to address situations where a child’s right to equal participation is compromised due to funding or staffing limitations; and if she will make a statement on the matter. [66061/25] ",
        "debateSection": {
          "showAs": "Disability Services",
          "debateSectionId": "dbsect_664",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_664",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_664.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Mark Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29",
          "memberCode": "Mark-Ward.D.2019-11-29"
        },
        "questionNumber": 748,
        "answerText": " Minister for Children, Disability and Equality  I propose to take Questions Nos. 748 and 764 together.  The Access and Inclusion Model (AIM) is a model of supports designed to ensure that children with additional needs or a disability can access the Early Childhood Care and Education (ECCE) Programme. Access to AIM is based on the needs of the individual child, in the context of the pre-school setting, and does not require a diagnosis.  AIM Level 7 support enables providers to reduce the child-to-adult ratio in the pre-school room or to fund an extra staff member as a shared resource with other children in the ECCE setting. In recognition of best practice in this area, this support is designed to improve inclusion and ensure meaningful participation of all children in the room.  The ‘First 5’ whole-of-government strategy (2019) committed to the phased extension of AIM, a commitment reaffirmed by the findings of an independent end-of-year-three evaluation. Participants in the evaluation supported proposals that AIM be scaled up and were keen to see the extension of AIM support to hours outside the ECCE entitlement. Based on the evaluation AIM is now being extended on a phased basis as funding becomes available.  As a first step in this extension, all AIM targeted supports have, since September 2024, been available to ECCE children beyond the time that they spend in the ECCE programme, all year round. Children can now access these supports for up to an additional 3 hours per day during the ECCE term and up to 6 hours per day outside of the ECCE term (in holiday periods).  It is intended that over time, all children with additional needs in early learning and childcare services will have access to AIM supports. The next phase of expansion focuses on a redesign of AIM for children under three, to meet the specific needs of this younger cohort. Consideration will then be given to an extension of AIM for children attending school-age childcare.  An action plan has been developed to respond to other areas for improvement including increasing awareness of AIM, streamlining the application process and strengthening support for autistic children. A key step taken in this regard is the 2024 publication of Introductory Guidelines to Support the Inclusion of Autistic Children in Early Learning and Care, School-Age Childcare and Childminding Settings, with the support of ASIAM.  While the Department oversees AIM, early learning and childcare providers are private entities and responsible for their own admissions policies, which are outside the Department’s remit. Parents and carers experiencing challenges in accessing early learning and childcare supports are encouraged to contact their local City or County Childcare Committee, who can provide advice and guidance on available options in their area. Contact details are available at: www.gov.ie/childcarecommittees. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Children",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_748",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 775. Deputy Mark Ward asked the Minister for Children, Disability and Equality the additional funding that has been allocated towards the assessment of needs for children since the 3 April 2025 in order that no child has to wait over three years for an assessment; and if she will make a statement on the matter. [65951/25] ",
        "debateSection": {
          "showAs": "Departmental Funding",
          "debateSectionId": "dbsect_690",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_690",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_690.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Mark Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29",
          "memberCode": "Mark-Ward.D.2019-11-29"
        },
        "questionNumber": 775,
        "answerText": " Minister for Children, Disability and Equality  The Government recognises that there are unacceptable delays in accessing Assessments of Need. This Department and the HSE are committed to addressing these delays.  It is important to note that children do not require an Assessment of Need to access health services, including Primary Care, Children’s Disability Network Teams, or Mental Health Services. However, demand for Assessments of Need has increased significantly in recent years, a reflection of both the increase in population and the number of families exploring all options for accessing services for their child.  Over the past 2 years, there has been a noted improvement in the number of completed Assessments with over 4,100 completed in 2024, an increase of 30% compared to 2023. HSE data shows this trend is continuing with a 57% year-on-year increase in completed assessments in the first nine months of 2025.  This has been achieved by a number of measures, including the Assessment of Need Targeted Waitlist Initiative. This Initiative targets those families waiting longest for Assessments of Need, with the HSE reimbursing clinicians directly through the procurement of capacity from approved private providers. Budget 2026 provides for an additional €20m for the delivery of approximately 6,000 further clinical assessments. This will be in addition to over 6,300 clinical assessments commissioned since the initiative started in June 2024. Recent data provided by the HSE shows that 2,742 of these were commissioned in the period April to September 2025 at a cost of €11.7m.  While it is important to use private capacity to support the completion of Assessments of Need into 2026, we must ensure that the public system can meet the clearly growing demand. This Department is working with the HSE to ensure the delivery of actions to support the efficient delivery of Assessments of Need within the public system with funding of €0.5m allocated this year to support this work. This includes improved training for staff involved in the delivery of AONs, additional administrative supports, and changes to processes where necessary to ensure an efficient and effective system.  Work is also underway to identify relevant legislative changes relating to Part 2 of the Disability Act 2005, which addresses Assessment of Need. This aims to support the effective and efficient delivery of Assessments of Need.  It is intended to bring forward this legislation before the year end. It will not affect the statutory right of any individual to access an Assessment of Need or the statutory timeframes set out in the Act.  The provision of an effective and efficient Assessment of Need system continues to be a priority for the Government ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Children",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_775",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 788. Deputy Mark Ward asked the Minister for Children, Disability and Equality the number of legal cases parents have taken against the HSE due to assessment of needs not being delivered within the statutory six months, in each of the years 2020 to 2025; the legal costs for the HSE associated with this, in tabular form; and if she will make a statement on the matter. [66230/25] ",
        "debateSection": {
          "showAs": "Health Service Executive",
          "debateSectionId": "dbsect_702",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_702",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_702.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Mark Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29",
          "memberCode": "Mark-Ward.D.2019-11-29"
        },
        "questionNumber": 788,
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Children",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_788",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 792. Deputy Mark Ward asked the Minister for Health the age intervals at which developmental checks of newborns and infants should be offered by public health nurses; the examinations done at each of these intervals; the intervals which are P1, P2 and P3 checks; if services up to P3 checks are being offered to children in Adamstown, Clondalkin, Palmerstown, Lucan, Rowlagh, Rathcoole, Newcastle, Saggart, Citywest, Brittas, Fettercairn, in tabular form; and if she will make a statement on the matter. [66264/25] ",
        "debateSection": {
          "showAs": "Departmental Data",
          "debateSectionId": "dbsect_706",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_706",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_706.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Mark Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29",
          "memberCode": "Mark-Ward.D.2019-11-29"
        },
        "questionNumber": 792,
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_792",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 793. Deputy Mark Ward asked the Minister for Health the percentage of children who received developmental checks carried out within 72 hours, at three months, at six months, at 12 months, at 24 months, at 48 months, across the state, in the Dublin midwest, by year from 2020 to 2025, in tabular form; and if she will make a statement on the matter. [66265/25] ",
        "debateSection": {
          "showAs": "Departmental Data",
          "debateSectionId": "dbsect_707",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_707",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_707.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Mark Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29",
          "memberCode": "Mark-Ward.D.2019-11-29"
        },
        "questionNumber": 793,
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_793",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 948. Deputy Mark Ward asked the Minister for Health the vacancy in clinical posts in Cherry Orchard primary care centre, in tabular form; and if she will make a statement on the matter. [66223/25] ",
        "debateSection": {
          "showAs": "Primary Care Centres",
          "debateSectionId": "dbsect_852",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_852",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_852.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Mark Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29",
          "memberCode": "Mark-Ward.D.2019-11-29"
        },
        "questionNumber": 948,
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_948",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 949. Deputy Mark Ward asked the Minister for Health if she will report on the HSE delays in ophthalmology routine surgical waitlists at Royal Victoria Eye and Ear Hospital; the number of vacant consultant ophthalmologist posts in St. James’s Hospital and the Royal Victoria Eye and Ear Hospital; if blepharoplasty surgery is eligible for NTPF; and if she will make a statement on the matter. [66260/25] ",
        "debateSection": {
          "showAs": "Hospital Waiting Lists",
          "debateSectionId": "dbsect_853",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_853",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_853.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Mark Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29",
          "memberCode": "Mark-Ward.D.2019-11-29"
        },
        "questionNumber": 949,
        "answerText": " Minister for Health  It is acknowledged that many patients are still waiting too long for hospital appointments and treatments. I am conscious of the burden that this places on patients and their families.  I published the Waiting List Action Plan (WLAP) for 2025 in February, representing this Government’s continued commitment to reducing waiting times for patients and improving access to hospital care.  With the multi annual action plan approach, we are progressing towards the ultimate vision of a public healthcare service in which everyone has timely access to high-quality scheduled care, where and when they need it.  My Department is engaging with the HSE and National Treatment Purchase Fund to develop the action plan for 2026, building on the progress delivered to date, renewing the focus on improving waiting times for patients, and considering the learning from the challenges that arose in 2025.  In relation to the queries raised concerning ophthalmology at the Royal Victoria Eye and Ear Hospital and St. James's Hospital, as these are a service matters, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible.  In respect of blepharoplasty surgery, the National Treatment Purchase Fund (NTPF) has advised my Department that it does not have any tenders in place for this procedure. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_949",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_189",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_189",
          "showAs": "Public Inquiries",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_189.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 170. Deputy Mark Ward asked the Minister for Health if her Department will hold a statutory public inquiry into issues relating to the healthcare of a child (details supplied); the timeline for this inquiry; and if she will make a statement on the matter. [64559/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_170",
        "answerText": " Minister for Health  The Tánaiste and I have met the parents of Harvey Morrison Sherratt twice (29th September and 12th November). Those discussions have been constructive.  These meetings have also been attended by some other advocacy groups and their legal representatives who have been calling for a public statutory inquiry into the spina bifida and complex scoliosis services at Children’s Health Ireland (CHI).  Arising from those discussions, on Tuesday 18th November I brought a Memo to Government, and it was agreed to proceed with a statutory public inquiry into spina bifida and complex scoliosis services.  As an initial step, the Government agreed that a facilitator will be appointed to consult with stakeholders on scoping the content of potential terms of reference for an inquiry. My Department will consult closely with the Office of the Attorney General on progressing this exercise.  This will be a time-bound exercise, but there is a considerable body of work to be undertaken to ensure that we ultimately have the clearest possible terms of reference for a statutory inquiry. It is important that the many issues raised are carefully considered as to what may be the best way to achieve the outcomes sought by families and other stakeholders.  Once this scoping exercise is complete, further Government approval will be sought for the final terms of reference. ",
        "questionNumber": 170,
        "by": {
          "memberCode": "Mark-Ward.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29",
          "showAs": "Mark Ward"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_210",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_210",
          "showAs": "Health Services Staff",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_210.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 191. Deputy Mark Ward asked the Minister for Health the number of public health nurses in the Dublin mid-west area; the number of vacant positions for public health nurses in the area; when P2 and P3 developmental checks will be provided throughout the consistency; and if she will make a statement on the matter. [64560/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_191",
        "answerText": " Minister for Health  As this is a service matter I have asked the HSE to respond to the deputy as soon as possible. ",
        "questionNumber": 191,
        "by": {
          "memberCode": "Mark-Ward.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29",
          "showAs": "Mark Ward"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Mark-Ward.D.2019-11-29",
          "showAs": "Mark Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29"
        },
        "showAs": " 144. Deputy Mark Ward asked the Minister for Education and Youth for an update on the application from a school to replace their 50-year-old prefabs (details supplied); and if she will make a statement on the matter. [64214/25] ",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_117.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_117",
          "showAs": "Schools Building Projects",
          "debateSectionId": "dbsect_117"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_144",
        "answerText": " Minister for Education and Youth  I wish to advise the Deputy, that my department is in receipt of an application for capital funding under the Additional School Accommodation (ASA) scheme, from the school in question. The application seeks the replacement of some prefabricated accommodation at the school.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026 - 2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special education needs, with a particular focus on meeting annual school place needs. In relation to project rollout for large-scale projects and ASA scheme projects, the approach will be to maximise the capacity of the existing school estate so as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2 year rolling programme.  All Government departments are expected to publish their sectoral NDP Implementation Plans in November. My department's plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  The application from the school in question will be considered in this context and the school authorities will be contacted directly with a decision in due course. ",
        "questionNumber": 144
      },
      "contextDate": "2025-11-19"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 99,
        "showAs": " 99. Deputy Mark Ward asked the Minister for Transport the amount in fines issued to a bus company (details supplied) and Dublin Bus in 20224 and 2025; the consequences of these fines on route allocation; and if he will make a statement on the matter. [63458/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Mark Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29",
          "memberCode": "Mark-Ward.D.2019-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_99",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_56",
          "showAs": "Bus Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_56",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_56.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators, in this case, GoAhead.  The National Transport Authority monitors the performance of all public transport operators. Under existing contractual arrangements, financial penalties apply where performance falls below agreed standards, and they are also investing in a new vehicle location system for the fleet which will improve the reliability of the real time passenger information system. They continue to engage with Go-Ahead to enhance service reliability and ensure continuous improvement.  In light of the NTA’s responsibility in this area, I have forwarded the Deputy's question to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 120,
        "showAs": " 120. Deputy Mark Ward asked the Minister for Transport his views on the number of cancellations by  a bus company (details supplied) and Dublin Bus buses in the Dublin mid-west constituency; the efforts his Department is taking to address this level of cancelation; and if he will make a statement on the matter. [63457/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Mark Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29",
          "memberCode": "Mark-Ward.D.2019-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_120",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_78",
          "showAs": "Bus Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_78",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_78.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators, in this case Go Ahead and Dublin Bus.  Under existing contractual arrangements, financial penalties are applied by NTA where performance falls below agreed standards, and they are also investing in a new vehicle location system for the fleet which will improve the reliability of the real time passenger information system. They continue to engage with Go-Ahead to enhance service reliability and ensure continuous improvement.  In light of their responsibility in this area, I have forwarded the Deputy's question to the NTA, Go Ahead and Dublin Bus for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 358,
        "showAs": " 358. Deputy Mark Ward asked the Minister for Finance if insurance companies are allowed to charge more for a product if the customer opts to pay monthly versus one upfront payment; if there are regulations to restrict the additional amount that can be charged; and if he will make a statement on the matter. [63231/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Finance"
        },
        "by": {
          "showAs": "Mark Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29",
          "memberCode": "Mark-Ward.D.2019-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_358",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_299",
          "showAs": "Insurance Industry",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_299",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_299.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Finance (Deputy Paschal Donohoe)  As Minister for Finance, I have policy responsibility for the development of the legal framework governing financial services regulation, including for the insurance sector. However, neither I nor the Central Bank of Ireland can intervene in the provision or pricing of insurance, or direct as to what cover is provided, as is reinforced by the EU framework for insurance (Solvency II Directive).  Transparency in the insurance sector is a key priority for Government and the latest Action Plan for Insurance Reform, published in July 2025, commits to expanding transparency in the insurance sector through faster release of NCID data, the development of a transparency code and a review of the price-walking ban.  The Consumer Protection Code 2012 requires insurance firms to act honestly, fairly, and professionally in the best interests of its customers and the integrity of the market and make full disclosure of all relevant material information, including all charges, in a way that seeks to inform the customer.  In 2023, the Central Bank of Ireland completed a review that examined a number of pricing and claims practices adopted by domestic motor insurance providers. This review included the impact that the method of payment, as chosen by a policyholder, can have on the premium calculation, and whether or not it was sufficiently clear to consumers. The Central Bank’s review identified that while details on charges and conditions associated with payment options were included by insurers in various formats such as the policy documentation, terms of business, policy booklets, and the online quotation journey, the information provided was not always clear, or upfront.  Following the Central Bank’s review, guidance was issued to the insurance industry requesting that, where necessary, insurers should take action(s) to ensure full transparency in relation to the impact of the payment method chosen, this includes clearly presenting cost comparisons for full payment versus instalments, and disclosing when payment method is used as a risk rating factor. Regulation 338 of the revised Consumer Protection Code 2025, which will be effective from March 2026, also specifically requires insurance undertakings and intermediaries to provide an explanation and the monetary value of any difference in cost between paying the premium by way of a lump sum or in instalments.  If a consumer has any concerns or questions in relation to their insurance product, on instalments, or any other matter, or wishes to make a complaint, they can contact their insurer or broker that sold them the product. If a consumer is not satisfied with how their complaint is dealt with by a regulated entity, they can make a complaint to the Financial Services and Pensions Ombudsman (FSPO). The FSPO acts as an independent arbiter of disputes that consumers may have with their insurance company or other financial service provider. The FSPO can be contacted either by email at info@fspo.ie or by telephone at 01-567-7000. Investigations by the FSPO are free of charge to the complainant. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 437,
        "showAs": " 437. Deputy Mark Ward asked the Minister for Education and Youth further to Parliamentary Question No. 626 of 14 November 2025, the correspondence her Department has had with DDLETB on the best way to support the young people in the Citywest and Saggart area; if the youth affairs unit has met with DDLETB on same; and if she will make a statement on the matter. [62954/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Education"
        },
        "by": {
          "showAs": "Mark Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29",
          "memberCode": "Mark-Ward.D.2019-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_437",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_368",
          "showAs": "Youth Work Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_368",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_368.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Education and Youth (Deputy Helen McEntee)  I propose to take Questions Nos. 437 and 438 together.  The Department is dedicated to enhancing the delivery and development of youth work services and opportunities for young people across the country, including in the Citywest, Saggart and Rathcoole area.  As the Deputy is aware, €1.2 million was provided to establish ten new UBU youth services in Budget 2025, which will deliver targeted youth worker-led support to up to an additional 1,000 young people in the selected areas.  The ten new UBU services were selected based on a competitive assessment process. The successful education and training boards (ETBs) have now completed their call for service and have provided the department with confirmation of the youth organisations selected to establish and deliver these new?services?in the selected areas. Whilst the need for UBU youth services was demonstrated in all submissions, funding was allocated based on the results of the assessment process.  Following this process, the ten ETBs awarded funding for a new UBU service are as follows:  • Cavan and Monaghan ETB  • Donegal ETB  • Kerry ETB  • Kildare and Wicklow ETB  • Kilkenny and Carlow ETB  • Laois and Offaly ETB  • Longford and Westmeath ETB  • Louth and Meath ETB  • Mayo, Sligo and Leitrim ETB  • Tipperary ETB  The Department met with Dublin and Dún Laoghaire ETB on 12 November 2025 to discuss the current youth work provision in the Citywest, Saggart and Rathcoole area and are continuing discussions on how best to support the young people in this area. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 438,
        "showAs": " 438. Deputy Mark Ward asked the Minister for Education and Youth further to Parliamentary Question No. 626 of 14 November 2025, if she will reconsider the UBU application that has been resubmitted to her officials in respect of the proposal for a new service in the Citywest, Saggart and Rathcoole area in light of the recent events; if Budget 2026 will ensure this service is delivered; and if she will make a statement on the matter. [62955/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Education"
        },
        "by": {
          "showAs": "Mark Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29",
          "memberCode": "Mark-Ward.D.2019-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_438",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_368",
          "showAs": "Youth Work Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_368",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_368.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Education and Youth (Deputy Helen McEntee)  I propose to take Questions Nos. 437 and 438 together.  The Department is dedicated to enhancing the delivery and development of youth work services and opportunities for young people across the country, including in the Citywest, Saggart and Rathcoole area.  As the Deputy is aware, €1.2 million was provided to establish ten new UBU youth services in Budget 2025, which will deliver targeted youth worker-led support to up to an additional 1,000 young people in the selected areas.  The ten new UBU services were selected based on a competitive assessment process. The successful education and training boards (ETBs) have now completed their call for service and have provided the department with confirmation of the youth organisations selected to establish and deliver these new?services?in the selected areas. Whilst the need for UBU youth services was demonstrated in all submissions, funding was allocated based on the results of the assessment process.  Following this process, the ten ETBs awarded funding for a new UBU service are as follows:  • Cavan and Monaghan ETB  • Donegal ETB  • Kerry ETB  • Kildare and Wicklow ETB  • Kilkenny and Carlow ETB  • Laois and Offaly ETB  • Longford and Westmeath ETB  • Louth and Meath ETB  • Mayo, Sligo and Leitrim ETB  • Tipperary ETB  The Department met with Dublin and Dún Laoghaire ETB on 12 November 2025 to discuss the current youth work provision in the Citywest, Saggart and Rathcoole area and are continuing discussions on how best to support the young people in this area. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 549,
        "showAs": " 549. Deputy Mark Ward asked the Minister for Housing, Local Government and Heritage the status of the rollout of a social housing passport to allow persons on social housing waiting lists to change local authority without losing time on the list; and if he will make a statement on the matter. [62732/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Housing"
        },
        "by": {
          "showAs": "Mark Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29",
          "memberCode": "Mark-Ward.D.2019-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_549",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_451",
          "showAs": "Social Welfare Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_451",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_451.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Housing, Local Government and Heritage  The concept of a Housing Passport, intended to facilitate eligible social housing applicants to access social housing in any local authority of their preference has been considered by my Department in consultation with local authorities.  An initial scoping exercise was carried out by my Department which identified a range of practical and administrative issues, including those related to the income eligibility differences across local authority areas, maintenance of seniority on housing waiting lists, local connection requirements, the efficient allocation of existing housing stock, and resource implications for local authorities including the absence of a technology to support such an approach. Due to the complexity of the range of issues identified and the difficulties inherent in the practical application of such a scheme, further work in this area is not being considered at the present time.  It should be noted however, there is already a degree of flexibility regarding housing waiting lists. The four Dublin local authorities have arrangements allowing social housing applicants apply for housing in up to two of the other Dublin authorities simultaneously. Similar arrangements apply in the two Cork and two Galway local authorities. Households may also move and relocate between housing authority areas under the Housing Assistance Payment (HAP) scheme where the household income is within the relevant income limits.   ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Children, Disability and Equality  The Department is currently collating the information requested and a reply will issue directly to the Deputy on this matter as soon as possible. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_414",
        "debateSection": {
          "debateSectionId": "dbsect_396",
          "showAs": "Childcare Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_396",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_396.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Children"
        },
        "questionNumber": 414,
        "by": {
          "memberCode": "Mark-Ward.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29",
          "showAs": "Mark Ward"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 414. Deputy Mark Ward asked the Minister for Children, Disability and Equality the schemes available to an organisation (details supplied) to fund the building of their early childhood and family centre; how they can apply for this; if she will engage with the project; and if she will make a statement on the matter. [62356/25] "
      }
    },
    {
      "question": {
        "answerText": " An Leas-Cheann Comhairle  I remind Members that we are due to conclude at 4.18 p.m. \n The Taoiseach  I propose to take questions Nos. 18 to 36, inclusive, together.  The Cabinet committee on disability has been established to oversee the implementation of the programme for Government commitments in the area of disability, with specific focus on children's disability services as well as disability more generally under the Government's new National Human Rights Strategy for Disabled People 2025-2030.  Under the programme for Government, we are committed to delivering a step change in disability services and to advancing the rights and improving the lives of people with disabilities. To deliver on this, I established the stand-alone Cabinet committee on disability. This committee has met five times to date, most recently on 16 October, and it is due to meet again on 27 November. To date, the committee has considered issues including the new national disability strategy, the provision of therapists in special schools, improving the delivery of services and reform of the assessment of need process.  Despite the committed efforts of so many working to provide services and significant increases in funding and resources in recent years, I acknowledge that we can and must do more and do better. I am determined that this will be a Government that moves forward with purpose in improving the level, scale and quality of support for disabled people and their families.  The Government's new National Human Rights Strategy for Disabled People 2025-2030, published in September, is the framework for our whole-of-government approach to addressing disability and advancing the implementation of the United Nations Convention on the Rights of Persons with Disabilities. It represents our commitment and ambition that all disabled people in Ireland can live the life of their choosing and participate in their communities and our society to the fullest extent possible.  In budget 2026, we took initial steps to deliver on this commitment through record allocations for disabilities services and special education. Reflecting the importance of disability issues, I have established a dedicated disability unit in my Department.  An initial programme planned for the unit has been published, outlining how the unit will work to achieve this. The unit is already up and running, supporting the work of the Cabinet committee on disability and ensuring a truly all-of-government approach to disability. \n Deputy Aisling Dempsey  I want to raise the urgent issue of the transition from child disability services to adult disability services. A constituent has told me that her child was not seen by child disability services until he was almost 18 and that was eight years post her first contact. The family had no clarity on what supports they were entitled to when he was a child, let alone what they were facing into from adult disability services. Another constituent - another mother - has told me some therapies her child receives now are not going to be available in adult disability services. Somehow, her adult child will not have the same needs any more. In this case, respite will also be withdrawn when her child ages out of child disability services. This is leaving families feeling anxious, unsupported and fearful for their family's future. Will the Taoiseach and the committee urgently examine the transition process between child and adult disability services to ensure continuity of care and no loss of essential supports for young people and their families? \n Deputy Catherine Ardagh  One of the greatest fears facing parents of children with disabilities and parents of adult children with disabilities is what will happen when we are no longer here. Who will care for my son? Who will care for all of these children, including adult children? It is a question that causes sleepless nights for so many people. Ultimately, we need a clear, compassionate pathway for lifelong housing and care in the community for adults with disabilities, so families can have certainty and peace of mind.  Will the Government commit to developing a national plan to ensure that every person with a disability has a safe, permanent home and the supports they need, not just for today but for the future? All of us have been in many houses in our constituencies and we have met elderly parents caring for middle-aged children with disabilities. It is heartbreaking that they are in their senior years and they do not know what is going to happen to their son or daughter when they pass. We have all dealt with these types of queries. It is something that lies ahead for me and my family also. We need to start discussing housing and care in the community for people with disabilities. \n Deputy Martin Daly  I am following on from what my colleague Deputies have already said about the care of the offspring of people who are getting older and have no certainty around what is going to happen when they are not here any more. It is a major challenge within the community. It seems like a cliff edge. When you die, you get a residency. That is not good enough. There has got to be planning around that, and it should be seamless.  A lot of work has been done on the provision of special education classes, and special school place provision. We have done stuff around increasing the income disregard for the carer's allowance and we are getting to an abolishment of the means test but also I think we need to address flexible arrangements around getting more people who live with disability into work and out of poverty without losing their benefits. The cost of disability payment should be considered also. There is a lot of work to be done. The direction is right but we do need a huge focus on it. \n Deputy Peadar Tóibín  It is 420 days since I asked the Tánaiste, Deputy Simon Harris, about why Harvey Morrison Sherratt was taken off the waiting list. The Tánaiste has not been able to answer that question in those 420 days. That is an incredible indictment in relation to it. He said in the Dáil that he would immediately ask the HSE and that he would ask the Minister for Health, yet no question has been answered.  We saw in The Sunday Times this weekend that a protected disclosure was submitted to the Department of Health. The information in this protected disclosure is catastrophic. The implication is that someone, or a group, took a decision that was not medically based and may have led to the death of Harvey. That is a catastrophic question. The import of that on a government is absolutely enormous. What the Government is asking us to believe is that on one level, the Tánaiste has spent 420 days asking questions in relation to why Harvey was taken off the waiting list and he still did not get an answer and, at the same time, a protected disclosure was given to the Department of Health with the answer. That is an incredible thing.  Does the Government understand the import of what has just happened? Why has it taken 420 days for the Tánaiste to answer a question? Have the staff or the management involved actually been asked what has happened? \n An Leas-Cheann Comhairle  I thank the Deputy. \n Deputy Peadar Tóibín  Are they refusing to answer what has happened? Why is it that the family only found out through The Sunday Times what happened in relation to their child? \n An Leas-Cheann Comhairle  I am sorry that I overlooked Deputy Coppinger. \n Deputy Ruth Coppinger  That is no problem.  Governments have fallen over less than what has happened in relation to Harvey Morrison Sherratt. We found out over the weekend through a protected disclosure that a worker heard or became aware that Harvey had been taken off the waiting list because he was mistakenly, or for whatever reason, considered \"palliative\" - in itself a horrible phrase. First, his parents were not told and, second, no care plan or treatment plan was drawn up if he was \"palliative\". This just defies belief. Aside from the fact that he may have ended up dying because of this error, perhaps if he had received the surgery, he would not be dead. The fact is that we have surgeons who would not tell parents about this and who would not organise a care plan for a \"palliative\" child. Every week, we come in here and ask the Taoiseach to have a statutory public inquiry. The Government's stance has been to have a scoping inquiry here and a scoping inquiry there. We need a full statutory inquiry into all of the issues surrounding Harvey, CHI and spinal surgery. The Taoiseach should have asked questions since this broke on Sunday, given how important this issue is in Ireland for so many people. \n An Leas-Cheann Comhairle  I thank the Deputy. \n Deputy Ruth Coppinger  He should have asked CHI directly about this particular issue, so I hope he has answers for us today. \n Deputy Mark Ward  I was at a public meeting last Monday in Neilstown hosted by parents of children with disabilities. They raised a multitude of areas and how their children are being failed. There are long waiting lists for assessment of need, speech and language therapy and occupational therapy. There is no access to appropriate school places. There are limited SNA allocations. They also talked about not even getting appropriate places for school transport and arbitrary timeframes for filling out forms. If they do not fill out the forms within the timeframe, there are consequences for their children.  I got a response this morning saying the average wait time for an assessment of need in my area of Dublin Mid-West is three and a half years, even though the statutory timeframe is six months. Children are being denied the right to reach their full potential. How is the Government going to address the failures children are experiencing? \n Deputy Paul Murphy  The budget reneged on a key commitment in the programme for Government to introduce a permanent annual cost of disability support payment and then to incrementally increase it. We know that it costs a lot of money to be disabled in this country. A few years ago, the Department of Finance estimated it at around €10,000. It has obviously gone up substantially since then. Last year's €400 lump sum disability payment was a drop in the ocean but far from increasing it, as promised, the Government abolished it completely. It slashed other payments that disabled people rely on, like the living alone allowance lump sum and the electricity credit. Even taking into account small increases to the disability allowance, the Government still took well over €1,000 out of the pockets of disabled people. It is shocking in one of the richest countries in the world, with a budget surplus and with the cost-of-living crisis ongoing, that the Government made disabled people poor. That is not just in real inflationary terms but even in nominal terms. \n An Leas-Cheann Comhairle  I thank the Deputy. \n Deputy Paul Murphy  The Government made them poorer, and took over €1,000 from them. Will it recognise this as a major mistake? Will it bring back an emergency lump sum cost-of-living payment for disabled people before Christmas? \n Deputy Ruairí Ó Murchú  I want to bring up the attempt by Darver National School in County Louth to have two autism classes sanctioned. The initial engagement between the principal, the SENO and the NCSE took place in June 2025. This was followed up throughout September and October, with no word back. It is absolutely supported by the patrons and the board of management and all have tried to make contact. We need to ensure that this happens but we also need to ensure that the school is contacted.  I do not think this is okay. I am just giving the timeframe on this.  I also need someone to light a fire under the Department of education in relation to Ardee Educate Together National School. Louth County Council is the agent but the Department ----- \n An Leas-Cheann Comhairle  Thank you Deputy. \n Deputy Ruairí Ó Murchú  This relates to parking spaces and planning. It should be a very small piece of work to get this changed to account for the 45 staff and also enough bays for the minibuses. At this point, there is not space. It would be very cheap to get it changed at this point. A contractor is on for this. If not at this point, then we could be talking about something that could cost €100,000-plus. \n Deputy Barry Heneghan  Is there an update or timeline from the Cabinet committee on disability on assessments of need?  In my own constituency, Stapolin Educate Together primary school is looking for two additional autism classes. It has a very powerful image of 12 chairs outside that school representing children locked out. I would urge the Taoiseach push----- \n The Taoiseach  Which school? \n Deputy Barry Heneghan  Stapolin in Dublin Bay North. I can send details to the Taoiseach’s office. These children are locked out. I urge that the NCSE look at this school. It has brilliant staff who are really hard working.  Gabhaim míle buíochas leis an Aire, Deputy McEntee, i dtaobh Ghaelcholáiste Reachrann. Tá sé iontach go bhfuil rudaí ag bogadh ar aghaidh air sin. \n Deputy Conor D. McGuinness  The Government is failing children in Waterford with additional needs over the stagnation in early intervention classes. Five years ago, there were two early intervention classes across Waterford city and county. This year, there are still two. That is despite an increasing need and a demand that is there but unmet. These early interventions are critical for children’s educational and social outcomes. It is something that the Taoiseach’s Government needs to grapple with. Over the last nine or ten months, we have seen issues around special education spaces and classes in schools. While the Government did belatedly do some work to fill some of those gaps in service provision, there is a lot more to do. That situation is still there and I think there will be problems next year. We need to get to grips with the early intervention classes and increase them dramatically so that there is availability for parents to get their children that much-needed timely intervention. \n Deputy Liam Quaide  The plight of ageing parents of adult children with intellectual disabilities is an area of abject neglect on the part of the Government. Many of these parents are being deprived of peace of mind in their later years because they remain the primary carers of their children. They are less physically able to carry out this role as time goes on. They are living with a constant background worry of not knowing where their children will live after they die and how their need for belonging and community will be met.  The Government’s privatisation of services means that both young people and adults who require 24-hour staffed residential support are increasingly living far from home, in some cases hundreds of kilometres away, not connected to wrap-around services, detached from their communities and families. What is the Taoiseach’s plan to address this particular crisis in residential services for people with intellectual disabilities? Why are these services being privatised and fragmented to such an extent when the outcomes in many cases are so poor for our disabled citizens and when the cost to the State is so enormous? \n Deputy Rose Conway-Walsh  It is an absolute disgrace that even today we still do not know which children were wrongly removed from the scoliosis waiting list or why it happened. Families have been left in the dark while children suffer in pain. There is a clear culture of secrecy, concealment and unaccountability at the heart of children’s healthcare and an utter lack of transparency. I want to talk to the Taoiseach again, after many other times I have done so, about Mikey Henry Benson from Mayo, who is still waiting for the procedures he needs. I want to ask the Taoiseach to ask the Minister for Health when she is in Mayo on Monday to meet the family of Mikey Henry Benson to go through the episodes and the pain they have gone through and to find a way forward so that we can ensure that Mikey Henry Benson stays alive? \n Deputy Cian O'Callaghan  The Government has said time and again that there should be an appropriate school place for every child. I am contacted constantly by parents who are desperately trying to get a place for their child in an autism class. The same as any other parent, they just want their child to be able to thrive. Stapolin Educate Together National School in Baldoyle has asked to open two additional new autism classes. The school has the space for the modular units required. It also has experienced staff who can support the opening of these two additional classes. All that is required is for approval to be granted. Is the Minister for education going to meet the school principal about this and when is approval going be granted for these two much-needed classes? \n Deputy Richard Boyd Barrett  While I was getting my treatment in St. Luke's, I met a very nice woman called Shirley who brought up her daughter Lauren's case with me. Lauren subsequently wrote to me. Lauren lives with her and has a life-long disability condition that means she is unfit for work. She had previously been on domiciliary care allowance, then on disability allowance, but she then got married. She lives at home with her mum still, being cared for by her mum, but because she got married and went over the threshold, her disability payment has been cut. It really highlights the massive problem and injustice of having means testing of disability payments. What does the Taoiseach have to say to Lauren and many others like her who lose all support for their disability on the basis that their partner’s income has gone over a very arbitrary threshold? \n An Leas-Cheann Comhairle  We are gone way over time, so I would ask the Taoiseach to consider that. \n The Taoiseach  We are about seven minutes over time, is it? \n An Leas-Cheann Comhairle  Yes. \n The Taoiseach  I will try to do what I can as quickly as I can. \n An Leas-Cheann Comhairle  No, you are okay. Just ----- \n The Taoiseach  No, I am conscious of others.  Deputy Dempsey raised the issue of transition from child services to adult services and that there was an absence of early planning for that. She also made the comment that parents were told that therapies would not be available in transition. That is not acceptable and respite should not be withdrawn. In the disability unit that I have established, a key workstream will be planning and designing for the future. There should be proper data and proper early analysis of expected need for services from primary to post-primary, from post-primary to adult or, indeed, continuing education or other aspects. That is where I want to get to and that is where we want to get to as a Government because there is no doubt - Deputy Ardagh has raised this as well, as have others - that the insecurity is shocking. It is very sad that so many parents – I have met them – have no certainty. Deputy Daly said it was a cliff edge, and it is for many. If one talks to some of the providers in the sections 38 and 39 organisations, they are all dealing with emergency cases. That is not satisfactory, so we have got to get a more planned approach to this transition. I think there are also issues in terms of the interaction between the sections 38 and 39 organisations and the Government and Government services and how that works. Many of those are under pressure as well, I have to acknowledge, but equally we have to work out the models and so forth. There should be proper databases outlining how many people are in a given service at a given time and what will the requirements be at a later date. There is that issue of creating a secure transition and that older parents in particular, senior citizens now, have a certain sense of security and knowledge well in advance that their children will be looked after in case anything happens to themselves. That is a very understandable human concern, which is not being met at the moment but that needs to be met. I am very determined that we would put services in place to enable that to happen. There is a fear there, as Deputy Ardagh said. She called for a national plan for this and that is something I am going to work on so that people will have that security. Other Deputies have raised that issue. We should be looking at a seamless transition, ideally.  There is a link into housing as well in that respect, different solutions at different times in the journey of life that people can move to better accommodation, more suitable accommodation. We should have greater flexibility around that provision. There can be too many silos between different Government Departments in respect of that but we are working on it. That is what the Cabinet subcommittee is for, to do a cross-government, whole-of-government approach.  Deputy Daly and others raised the income disregard and the cost of disability. The cost of disability will be looked at in the next budget and there is a working group established in relation to that. On the relationship between work and disability payments, there are some supports there for transitioning from disability, from the social protection system, into work in terms of the medical card and others. I think that can be strengthened and that those moving into work can be given greater certainty, more long-term certainty, that they will retain their benefits or whatever entitlements they have as they go into work. There have been improvements on the employer grant and so on but there is further work to be done in terms of giving greater security around that transition and encouraging people to go into work without fear of losing their health entitlements or the various other entitlements they have.  Earlier during Leaders' Questions, we dealt with questions in respect of Harvey Morrison Sherratt. I would say to the Deputy the Minister is this afternoon meeting with the parents. The Minister did look for a chronology from the HSE. The Minister has that. The CEO of the HSE shared that with the family. It is a draft because the HSE wanted the family's input into that. I dealt with the protected disclosure earlier on Leaders' Questions. The Minister did not see that. All protected disclosures do not go to the Ministers per se . The Minister has an obligation to establish a system by which it goes to the protected disclosure commissioner. That commissioner has the specific protected disclosure and is now going to deal with that. Without question, there is a meeting on between the Minister, the Tánaiste and the parents of Harvey, with a view to an inquiry. The precise format is to be determined.  Deputy Coppinger had a similar question in relation to this. It is a fundamental question as to why Harvey was taken off a waiting list. There are clinical decisions clearly involved here that have to be examined and will be examined. Likewise, there are other, broader investigations and examinations of issues pertaining to CHI, as the Deputy knows. Some of them have come in and some have not. Overall, again, terms of reference have to be specific here. We can have statutory inquiries that can go on too long and do not give closure to families. I think there is a bit of work to be done yet and the Minister is meeting with the family in that regard.  Deputy Murphy raised the issue of the cost of disability programme. I dealt with that earlier insofar as the next budget will be dealing with that. Once-off payments were two years. What we were determined to do in this budget was to increase the permanent payments within the social protection system, which we did, for example, and to enhance them as well and also, in terms of the carer's allowance threshold and income disregard, to increase that and we will eliminate that over the lifetime of this Government. We increased the domiciliary care allowance significantly.  In terms of education, there are now about 46,500 teachers and SNAs working in our education system, committed to supporting and nurturing children with special educational needs. Huge numbers of special needs assistants have been appointed over the past number of years. There are about 400 new special classes in the budget of 2025, and about 2,700 new places for the 2025-2026 school year. Some of those school places are under construction and being put in place. A number of specifics have been asked. I will check those out with the Minister. I am not in a position to have knowledge of every single application from individual schools in respect of autism classes and so forth but I will follow those up with the Minister. I presume the Deputies are also engaging with the Departments in respect of that.  On the assessment of need, the Cabinet subcommittee on disability did approve outline proposals for a change in legislation which will have to happen to prioritise the provision of services. Therapy services to children has been the number one priority in terms of the legislative objective of that. The access and inclusion model, AIM, is a critical intervention for early years in terms of disability, in response to Deputy McGuinness's question. I would make that point and that has been enhanced and improved and will be improved as a result of the recent budget. Deputies Quaide, Dempsey and Ardagh raised the issue of insecurity and worry for ageing parents of children with disabilities. I am very conscious of that and we will work to see if we can improve on that.  I have dealt with the issue raised by Deputy Conway-Walsh. I response to Deputy Cian O'Callaghan, I will check in respect of the school in Baldoyle. I do not have awareness of that. In response to Deputy Boyd Barrett, again, I do not know the specific issue but I think it is an income threshold issue in terms of people marrying. \n Deputy Richard Boyd Barrett  It is, yes, the means test. \n The Taoiseach  I will have that examined. That is something that we can certainly look at. I will talk to the Minister for Social Protection in relation to that. \n Deputy Rose Conway-Walsh  Sorry, I think the Taoiseach was referring to the previous question. It was the one on Mikey Henry-Benson I had asked. \n The Taoiseach  Sorry. Again, I will talk to the Minister in respect of it. To be fair, this should be done at hospital level. It should be done properly through the clinicians properly engaging with the family and with the parents. There are liaison officers in CHI as well who should be----- \n Deputy Rose Conway-Walsh  I know it should but it was not and it is not. \n The Taoiseach  I will make the Minister aware of the case. \n Deputy Rose Conway-Walsh  Thank you. \n Deputy Ruairí Ó Murchú  On the two issues, if I could write to the Taoiseach and if his good offices would be able to put some pressure on----- \n The Taoiseach  There are about ten projects now that you have all mentioned. I am good but----- \n Deputy Ruairí Ó Murchú  In fairness these are critical time-wise. ",
        "to": {
          "showAs": "Taoiseach",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Mark Ward",
          "memberCode": "Mark-Ward.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29"
        },
        "questionType": "oral",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/debate/mul@/dbsect_13.xml"
            }
          },
          "debateSectionId": "dbsect_13",
          "showAs": "Cabinet Committees",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/debate/dbsect_13"
        },
        "questionNumber": 25,
        "date": "2025-11-12",
        "showAs": " 25. Deputy Mark Ward asked the Taoiseach when the Cabinet committee on disability will next meet.  [56980/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_25"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Children, Disability and Equality  The delivery of an effective and efficient Assessment of Need system is a priority for the Government. There has been intensive work by this Department and the HSE to deliver actions to achieve this.  It is important to note that children do not require an Assessment of Need to access health services, including Primary Care, Children’s Disability Network Teams or Mental Health Services.  However, demand for Assessments of Need has increased significantly in recent years.  This reflects both the increase in population and the number of families exploring all options to access services for their child.  The HSE reports that in Quarter 3 of 2025, the national average time needed to complete the assessment process was 27.15 months.  As this is a national figure, there will be regional variations with some AONs being delivered within a shorter timeframe.  Over the past 2 years, there has been a noted improvement in the number of completed Assessments. Over 4,100 were completed in 2024 , an increase of 30% compared to 2023 .  HSE data shows this trend is continuing with a 57% year-on-year increase in completed assessments in the first nine months of this year.  In Dublin North West, the Local Health Area covering the majority of the Dublin Mid-West Constituency, 393 Assessments were completed in the first 9 months of this year.  This is over twice as many as the 186 completed assessments for the same period of 2024.  These improvements have been achieved by a number of measures, including the Assessment of Need Targeted Waitlist Initiative. This focuses on those families waiting longest for Assessments of Need.  Under this Initiative, the HSE procures clinical assessments from approved private providers. Over 6,300 clinical assessments have been commissioned from private providers since the Initiative started in June 2024.  Budget 2026 provides for the continuation of this Initiative next year with €20 million provided for the delivery of some 6,000 clinical assessments .  However, we must also ensure that the public system can meet the clearly growing demand.  My Department is working with the HSE to ensure the delivery of actions to support the efficient delivery of Assessments of Need within the public system. This includes:  • improved training for staff involved in the delivery of AONs,  • additional administrative supports, and  • changes to processes where necessary to ensure an efficient and effective system.  Work is also underway to identify relevant legislative changes relating to Part 2 of the Disability Act 2005, which addresses Assessment of Need. This aims to support the effective and efficient delivery of Assessments of Need.  It is intended to bring forward this legislation before the end of this year. It will not affect the statutory right of any individual to access an Assessment of Need or the statutory timeframes set out in the Act.  The provision of an effective and efficient Assessment of Need system is a priority for the Government. ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Mark Ward",
          "memberCode": "Mark-Ward.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_51.xml"
            }
          },
          "debateSectionId": "dbsect_51",
          "showAs": "Disabilities Assessments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_51"
        },
        "questionNumber": 94,
        "date": "2025-11-12",
        "showAs": " 94. Deputy Mark Ward asked the Minister for Children, Disability and Equality the average waiting time for assessment of needs in the Dublin Midwest constituency; the steps which are being taken to reduce waiting times in the Dublin Midwest area; and if she will make a statement on the matter. [61910/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_94"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Mark Ward",
          "memberCode": "Mark-Ward.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_93.xml"
            }
          },
          "debateSectionId": "dbsect_93",
          "showAs": "Disability Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_93"
        },
        "questionNumber": 134,
        "date": "2025-11-12",
        "showAs": " 134. Deputy Mark Ward asked the Minister for Children, Disability and Equality when the Clondalkin CDNT will move to the new primary health care centre on the Boot Road, from a location (details supplied); the reasons for the delay; when she expects it to be operational; to provide a breakdown of the staff that will be in the new location; and if she will make a statement on the matter. [61909/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_134"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  This Government is fully committed to supporting children with special educational needs to fulfil their full potential and the Programme for Government makes a number of commitments to deliver on this objective.  A taskforce to support the forward planning of special education provision in the Dublin 15 area was established to support planning for the 2025/26 school year. The Dublin 15 area has experienced significant increases in population growth in recent years, with high levels of migration into the area and includes areas with social disadvantage.  The taskforce also considered the development of a common application system for admission to primary special classes. The voice of parents has been a key component of the taskforce. Parent representation on the taskforce includes representatives from the Autism School Dublin 15 (ASD15) group, the National Parents Council and parents from the local area.  The taskforce to support forward planning of special education provision in the Dublin 15 area submitted its report to the Minister in June 2025. The taskforce’s recommendations are currently being examined.  The NCSE is leading work at a local level with school principals on running the admissions trial for another year. The key focus of my Department remains working with the NCSE and school patron bodies to secure additional special classes.  My Department is progressing a larger common application trial which is running concurrently for admission to post-primary schools and special classes in Athenry, Celbridge, Clonakilty, Greystones, and Tullamore. These pilots form an important step towards delivering a more efficient, transparent and equitable school application process. It will reduce stress for parents and children, ease administrative burdens on schools, while also supporting better planning for school places.  The Department and the NCSE are committed to ensuring that sufficient special education placements remain available for children with special educational needs. We will continue to review and monitor the situation in the D15 area and, indeed, nationwide as to where new special classes and schools are required. ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Mark Ward",
          "memberCode": "Mark-Ward.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_425.xml"
            }
          },
          "debateSectionId": "dbsect_425",
          "showAs": "School Enrolments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_425"
        },
        "questionNumber": 494,
        "date": "2025-11-12",
        "showAs": " 494. Deputy Mark Ward asked the Minister for Education and Youth for an update on the D15 pilot scheme for common enrolment; if there are plans to roll this out in other areas; and if she will make a statement on the matter. [61240/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_494"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  I propose to take Questions Nos. 489, 495 and 517 together.  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for children with special educational needs.  In order to support the NCSE and forward planning my Department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE that they are seeking a special educational placement for their child. An earlier date of 1 October was set for parents to do so.  This notification process will provide the NCSE with valuable information as to which children will continue to require a special class as they progress to post-primary level and details on students who require a place for the first time.  The earlier date will allow for earlier sanctioning of classes for the 2026/27 school year, and it is the aim of the NCSE to sanction the majority of new special classes by 31 December 2025.  The NCSE will have a clear picture of the local demand for special class places for the 2026/27 school year after they review and assess all of the information which has been provided through the parents' notification process.  Once the NCSE has fully collated and assessed this information, the NCSE will be in a position to engage with schools across the country to open new special classes. The NCSE will also have due regard to any vacant places in existing special classes in an area and any places that will become available through the normal movement of children leaving primary or post-primary school.  It is important that an earlier date was introduced to ensure the NCSE can provide clarity and certainty for families much earlier than in previous years. It will also enable schools to plan more efficiently and will see classes needing significant building works open in time for September's intake of students. The 1 October timeline is in keeping with when admission processes for mainstream primary and post-primary schools can commence.  The NCSE report a significant level of response by families by the 1 October timeline. ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Mark Ward",
          "memberCode": "Mark-Ward.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_422.xml"
            }
          },
          "debateSectionId": "dbsect_422",
          "showAs": "Special Educational Needs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_422"
        },
        "questionNumber": 495,
        "date": "2025-11-12",
        "showAs": " 495. Deputy Mark Ward asked the Minister for Education and Youth if she plans to change the arbitrary deadline of 1 October for parents or guardians to submit a letter of eligibility for the admission of students with a disability or special educational needs; and if she will make a statement on the matter. [61241/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_495"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) issues guidance each year to schools regarding special need assistant (SNA) post allocation reviews and the guidance for 2025/26 school year issued on the 12 September 2025.  It is important to clarify some of the concerns raised since publication of the guidelines.  The process for allocating SNAs has been in place since 2014 and is not changing this year. There has been no freeze on SNAs, in fact the number of SNAs in our schools has increased by 43% in the last 5 years alone.  Schools were issued with their allocations for the 2025/26 school year in June and the SNA review window from 15 September to 7 November relates to schools who believe they do not have sufficient SNAs to support their care needs at present.  A school can apply to the NCSE at any time during the school year, as in previous years, for a review where emerging or new care needs arise.  The NCSE has written to all schools since the publication of the guidelines to clarify that a school can request a review during the school year and not just in the review period set out in the guidelines.  The following are the reasons for the timeline of reviews contained in the guidance:  Supports the earlier announcement of allocations for the 2026/27 school year to align with the release of the annual staffing schedule.  Management bodies, staff representative bodies, schools and SNA’s have all requested the Department to ensure that SNA allocations issue earlier each year and ideally should align with the general staffing allocation in February each year.  Supports the SNA workforce by giving them early clarity on their roles.  Facilitates the SNA Redeployment Scheme.  Importantly, the role and responsibilities of SNAs has not changed. SNAs remain responsible for meeting the primary care needs of students with special educational needs. Principals/board of managements remain able to deploy this school-based resource to meet the care support requirements of the students enrolled whom SNA support has been allocated. This ensures schools remain able to provide flexible arrangements in how the SNA support is utilised on a day-to-day basis.  New special classes continue to be supported with additional SNAs each time a new class opens, this has not changed. The NCSE guidelines set out the number of SNAs per each category of special class and there is no change to those baseline allocations.  Any school who has concerns about the level of their SNA allocation should contact their local special education needs organiser. This has always been the case and remains today.  The NCSE assesses the level of need within the school as a whole and this is critical to ensure that the care needs of the entire school are identified and that the school is resourced to meet this identified need. There continues to be separate allocations for mainstream and special classes in individual schools.  When the NCSE completes the SNA review and if additional SNA support is identified as being required it will be provided. This has always been the case.  The NCSE carried out a record number of reviews in 2025 to ensure that children who most needed SNA support could access it. This will continue for 2025/26 school year.  I want to assure you that the Department and the NCSE, through all of our policy and guidance such as resource allocations, take a child centred focus and approach to ensure that all children in our schools with special education care needs are provided with a supportive environment and the resources needed to help them develop and be prepared for life after school.  The NCSE has written to all schools since the publication of the guidelines to clarify these and other concerns. ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Mark Ward",
          "memberCode": "Mark-Ward.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_426.xml"
            }
          },
          "debateSectionId": "dbsect_426",
          "showAs": "Special Educational Needs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_426"
        },
        "questionNumber": 496,
        "date": "2025-11-12",
        "showAs": " 496. Deputy Mark Ward asked the Minister for Education and Youth to urgently intervene to resolve the issues arising from the NCSE’s SNA Review Guidelines 30214, to protect the essential work of SNAs in schools; and if she will make a statement on the matter. [61242/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_496"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Providing inclusive education to children with special educational needs is a fundamental principle of my Department’s education and training system. This principle is put into practice through the policies of my Department and the Teaching Council and the supports provided to schools, for example through the National Council for Special Education (NCSE) and Oide.  Inclusive education (including Special Education) is a core element of all Initial Teacher Education (ITE) programmes. Inclusive education, as defined in the Céim standards for Initial Teacher Education, refers to any aspect of teachers’ learning which aims to:  Improve their capacity to address and respond to the diversity of learners’ needs – which specifically includes the needs of children with autism;  Remove barriers to education through the accommodation and provision of appropriate structures and arrangements; and  Enable each learner to achieve the maximum benefit from his/her attendance at school.  By including these as core elements, the Council has taken a high-level approach to ensuring that they inform every aspect of ITE programme design.  In addition, on an annual basis, the Department of Education and Youth provides funding for two distinct categories of post-graduate programmes for Special Education Teachers:  Post-Graduate Diploma Programme of Teacher Professional Learning for Special Education Teachers and  Graduate Certificate in Autism Education for teachers working with Autistic Pupils in Special Schools, Special Classes or as Special Education Teachers in mainstream Primary and Post-Primary Schools.  The aim is to provide substantial theoretical and practical continuing professional development for teachers working with students with special educational needs, contributing to the school’s overall capacity to meet the needs of pupils with special education needs, including autism. In 2025 circa €1.25 million was provided for these programmes to provide for over 300 places.  Through its everyday work, the NCSE aligns its teacher professional learning (TPL) with the Teaching Council’s national framework for teacher professional learning. One of the main aims of the NCSE is to support teachers and schools in a way that builds capacity, supports the inclusion of all children, including students with special educational needs, at a whole school level. NCSE employs a number of specialist roles to support schools and build teacher capacity in areas of concern. These roles include autism advisors and behaviour advisors, who are assigned across regional support teams to provide advice, support and resources to schools.  The NCSE offers bespoke in-school support for either whole school staff, small groups, or individual teachers. The support can be tailored to specific TPL needs within a school, such as, in the areas of differentiation, planning, autism and behaviour.  Also, Oide is currently supporting the implementation of new and revised curricula at both primary and post primary. The professional learning frameworks developed by Oide to support these new curricula are underpinned by Universal Design for Learning (UDL) and place the learner at the centre of the learning experience. The move towards learning outcomes based curricula supports teachers to plan for all learners through adaptable and flexible provision, which accommodates the learner’s voice and choice. Oide recognises that students are diverse and through the provision of a range of supports they invite teachers to examine and alter teaching and learning approaches that meet the needs of all learners.  All professional learning experiences provided by Oide, support teachers in planning for all students in their classrooms.  Oide works closely with colleagues in the NCSE to ensure it can support schools in planning for inclusive education. Oide provide bespoke onsite school-based support which allows teachers and school leaders to respond directly to the needs of learners in their own unique context.  I am committed to ensuring that all teachers, at primary and post-primary level, have the skills they need to support the diverse needs of all our children and young people in our schools. It is critical that our teachers are equipped with the knowledge and skills needed to continue to deliver high quality and inclusive education. To that end, I wrote to the Teaching Council in March to initiate a process to move towards a mandatory assessed placement period in a special education need (SEN) setting for all student teachers, supported by appropriate modules. In addition, my Department will continue to work with partners in education to provide a comprehensive range of in-service TPL opportunities that allows those working at all levels of education, to access supports which will benefit all learners. ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Mark Ward",
          "memberCode": "Mark-Ward.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_427.xml"
            }
          },
          "debateSectionId": "dbsect_427",
          "showAs": "Special Educational Needs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_427"
        },
        "questionNumber": 497,
        "date": "2025-11-12",
        "showAs": " 497. Deputy Mark Ward asked the Minister for Education and Youth the supports provided to teachers to upskill to meet the special educational needs in schools; and if she will make a statement on the matter. [61243/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_497"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I thank the Deputy for his question regarding my Department's National Educational Psychological Service (NEPS).  I would like to take this opportunity to outline the work of NEPS.  All schools have access to:  General support and advice from a NEPS psychologist, either through the school’s assigned psychologist or through the NEPS Advisory Support Line. The NEPS Advisory Support line provides access for schools to support and advice from a Senior Educational Psychologist in NEPS via a designated phone line available from Monday to Friday;  Support from a NEPS psychologist in the event of a Critical Incident;  National and Regional Support and Development service for school staff, which is advertised through the Education Support Centres of Ireland and covers areas such as trauma informed practice, cluster group support for post-primary special education teachers and special class teachers, training for Student Support Teams and supporting reluctant school attendance/school avoidance behaviour; and  Access to either a NEPS psychologist or a SCPA psychologist for individual pupil casework where a priority need is established. SCPA (the Scheme for Commissioning Psychological Assessments) is operated through the use of a panel of psychologists who must meet qualification criteria set by the Department. It is an interim measure intended to supplement the NEPS service and meet current urgent needs for psychological assessment of children and young people.  Assessments are only one aspect of the NEPS service. Children and young people do not require a psychological assessment or a diagnosis in order to access additional support at school. The school-based problem-solving process involving assessment, intervention and review is recorded in the school Student Support File along with the child’s Student Support Plan. This process begins prior to any request for formal involvement of the NEPS psychologist. The psychologist may work directly with the child/young person, known as direct casework and this may includes assessment, or the psychologist may work through teachers or teachers/parents to provide a psychological service for a child/young person, known as indirect casework.  Another important aspect of the work of NEPS psychologists is Support and Development Service. The aim of this work is to help enhance school systems, to maximise a whole-school approach to creating school environments that are inclusive, flexible and responsive to the needs of all, and to build school capability to provide evidence-informed prevention and early intervention support as part of the Continuum of Support framework.  NEPS also leads on the counselling in primary schools pilot. The pilot consists of two strands. Strand 1 is the provision of one-to-one counselling to support small numbers of children in schools in counties Cavan, Laois, Leitrim, Longford, Mayo, Monaghan and Tipperary. In October 2024, my Department announced the extension of Strand 1 of the Counselling in Primary Schools Pilot to 61 urban DEIS primary schools. These schools, in Dublin North City and Dublin South-West, have been identified by the Department as supporting children from areas with some of the highest levels of disadvantage in the State. In the 2024/2025 school year, over 400 counselling sessions have taken place and at least 56 children have availed of counselling provision in these areas.  Strand 2 of the pilot is the establishment of Education Wellbeing Teams to support 78 schools in cluster areas in Cork, Carlow, Dublin 7 and Dublin 16. To date, 20 Education Wellbeing Practitioners have been recruited. The focus of the support provided is on strengthening whole-school preventative approaches. This includes the provision of psycho-educational support for parents and teachers and the provision of early intervention on an individual and group basis to children with mild to emerging need using low-level therapeutically informed approaches.  The pilot is currently being externally evaluated by the Centre for Effective Services. It is anticipated that an evaluation report will be completed by Q4 2025. Through this evaluation the Department are confident that valuable learning will be gathered that will inform future policy and provision in this area.  In addition to the Counselling and Mental Health supports for primary schools, the Department of Education and Youth in partnership with Jigsaw have launched Neart, a national programme of mental health and wellbeing resources and training for post-primary schools. The programme complements the supports in schools such as the provision of guidance counselling and the work of NEPS, as well as other wellbeing programmes and initiatives including Student Support Team training.  On the Deputy's query about increased capacity in NEPS, my Department is making every effort to recruit additional educational psychologists. Since January 2023, NEPS has supported bursaries for trainee educational psychologists who are enrolled in the University College Dublin Professional Doctorate in Educational Psychology and Mary Immaculate College Limerick’s Professional Doctorate in Educational and Child Psychology. This has also been extended to students enrolled in the new professional doctorate in educational psychology in Maynooth University. Those in receipt of a bursary commit to joining NEPS upon graduation. There are over 80 Trainee educational psychologists in receipt of a bursary who are expected to join NEPS upon graduation.  The Public Appointments Service recently concluded a recruitment campaign for educational psychologists and successful candidates will shortly be appointed. ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Mark Ward",
          "memberCode": "Mark-Ward.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_428.xml"
            }
          },
          "debateSectionId": "dbsect_428",
          "showAs": "National Educational Psychological Service",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_428"
        },
        "questionNumber": 498,
        "date": "2025-11-12",
        "showAs": " 498. Deputy Mark Ward asked the Minister for Education and Youth the number of NEPS assessments that have been provided in schools to date in 2025; the locations of each; her plans to increase NEPS assessments; and if she will make a statement on the matter. [61244/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_498"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  I propose to take Questions Nos. 499 and 522 together.  Through the accelerated provision of additional special class and special school places over recent years, there are now over 30,000 students enrolled in special classes and special schools. 2,700 new places were created for the 2025/26 school year and these, together with the over 1,200 existing places due to students moving on from primary schools and post-primary schools, has meant that close to 4,000 specialist places were made available for the 2025/26 school year.  In total 407 new special classes were sanctioned for the 2025/26 school year. Of these 103 are in County Dublin, 81 at primary and 22 at post-primary level. This brings to 705 the number of special classes currently in operation in the county. There are also 42 special schools in County Dublin with approximately 2,740 students enrolled. Two of the five new special schools established for this school year, are located in the county and are situated in Belmayne and Lucan.  Each new class within these special schools have been staffed with a dedicated teacher, two special needs assistants and further staffing has been allocated based on the individual needs of the students enrolled.  For the 2025/26 school year 30 students have enrolled in the school referred to by the Deputy. These students started attending the school earlier this month in accordance with their individual student transition plans which parents and families of students were advised of in advance of the school opening. To date 27 applications for transport have been received to the school and these applications are being currently being processed by Bus Éireann.  The National Council for Special Education (NCSE) as the statutory body responsible for the provision of special education and allocating supports for children with special educational needs remains available to offer advice and support to families as required. Parents and schools can contact the NCSE directly using the details available on the NCSE's website: ncse.ie/seno-contact-information. ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Mark Ward",
          "memberCode": "Mark-Ward.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_429.xml"
            }
          },
          "debateSectionId": "dbsect_429",
          "showAs": "School Enrolments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_429"
        },
        "questionNumber": 499,
        "date": "2025-11-12",
        "showAs": " 499. Deputy Mark Ward asked the Minister for Education and Youth when a school (details supplied) will be fully open; the current opening hours; the number of pupils; and if she will make a statement on the matter. [61245/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_499"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  My Department is aware that the leisure centre at the Citywest Hotel and Convention centre complex is a valued local amenity with approximately 3,000 members.  Following the purchase of the complex, the Department contracted the current provider to oversee the management and provision of service for the gym and the existing workforce was maintained under the transitional agreement.  Due to the public disorder outside the Citywest Hotel and Convention Centre campus some weeks ago, access was restricted to the campus for residents, staff, and members of the public accessing services including the leisure centre and restaurant. This measure was taken to protect the safety of all people who may be on the campus.  Members of the leisure centre were informed about the access restrictions.  An Garda Síochána is working closely with the Department regarding security arrangements at the campus and this is being kept under regular review.  Community members and representatives were informed on Friday November 7 that it is planned to facilitate access to the Leisure Centre for members from Tuesday November 11. A number of measures have been put in place to facilitate initial reopening and correspondence is being issued to all members to inform them of the reopening of the gym and the new measures in place to facilitate this.  Public access to the campus, including the leisure centre, remains restricted at this time and there will be ongoing communication including with local public representatives in respect of any update to this. ",
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Mark Ward",
          "memberCode": "Mark-Ward.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_624.xml"
            }
          },
          "debateSectionId": "dbsect_624",
          "showAs": "International Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_624"
        },
        "questionNumber": 712,
        "date": "2025-11-12",
        "showAs": " 712. Deputy Mark Ward asked the Minister for Justice, Home Affairs and Migration for an update on the gym and leisure facilities at a location (details supplied); when services will be reopened to members of the local community; if he will guarantee that these services will remain open to the public; and if he will make a statement on the matter. [61070/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_712"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Community Safety Fund re-directs the proceeds of crime, seized by the Criminal Assets Bureau (CAB) and An Garda Síochána, back into communities in order to fund innovative local projects aimed at building stronger, safer communities.  Initially called the Community Safety Innovation Fund and launched in 2022, it has supported 127 community safety projects to date all across Ireland.  The fund is managed by the National Office for Community Safety.  On 30 October I announced the allocation of €4.4 million from the fund to support 42 community safety projects nationwide. This year’s allocation represents a 33% increase on the €3 million awarded in 2024.  Information on the 2025 allocations is available from my Department’s website at the link below.  This contains a list of the projects, and the amount awarded to each project.  There were 165 applications to the fund.[ ]  www.gov.ie/en/department-of-justice-home-affairs-and-migration/press-releases/minister-jim-ocallaghan-announces-allocation-of-over-4-million-from-proceeds-of-crime-to-42-community-projects-across-the-country/ ",
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Mark Ward",
          "memberCode": "Mark-Ward.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_652.xml"
            }
          },
          "debateSectionId": "dbsect_652",
          "showAs": "Departmental Funding",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_652"
        },
        "questionNumber": 750,
        "date": "2025-11-12",
        "showAs": " 750. Deputy Mark Ward asked the Minister for Justice, Home Affairs and Migration the list of successful applicants of the Community Safety Fund; the funding each project received; the total number of applicants; and if he will make a statement on the matter. [61416/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_750"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  As the Deputy is aware, the State purchase of the Citywest Hotel and Convention Centre in August 2025 is an important part of the Comprehensive Accommodation Strategy for a more sustainable International Protection Accommodation Service system.  Due to the public disorder outside of the Citywest Hotel and Convention Centre campus, access had to be restricted to the campus for residents, staff, and members of the public accessing services including the leisure centre. This measure was taken to protect the safety of all people who may be on the campus.  On the wider campus, there is a restaurant which was not part of the purchase by the State. The buildings that incorporate this business remain in the ownership of the vendor and responsibility for engaging with this business on its operations is a matter for the property owner. The Department's Community Engagement Team has met with the restaurant proprietor as part of our ongoing engagement in the area.  An Garda Síochána is working closely with the Department regarding security arrangements at the campus and this is being kept under regular review.  Public access to the campus remains restricted at this time and there will be ongoing communication including with local community members and elected representatives in respect of any update to this. ",
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Mark Ward",
          "memberCode": "Mark-Ward.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_672.xml"
            }
          },
          "debateSectionId": "dbsect_672",
          "showAs": "International Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_672"
        },
        "questionNumber": 775,
        "date": "2025-11-12",
        "showAs": " 775. Deputy Mark Ward asked the Minister for Justice, Home Affairs and Migration if he will ensure that the normal operation of a local restaurant (details supplied) can resume; if his Department has had any engagement with the business; and if he will make a statement on the matter. [61753/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_775"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Mark Ward",
          "memberCode": "Mark-Ward.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_727.xml"
            }
          },
          "debateSectionId": "dbsect_727",
          "showAs": "Disability Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_727"
        },
        "questionNumber": 852,
        "date": "2025-11-12",
        "showAs": " 852. Deputy Mark Ward asked the Minister for Children, Disability and Equality when Clondalkin CDNT will move from Scoil Mochua to the new primary health care centre on the Boot Road; the reasons for the delay; and if she will make a statement on the matter. [61234/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_852"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the HSE to reply to the Deputy directly as soon as possible. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Mark Ward",
          "memberCode": "Mark-Ward.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_844.xml"
            }
          },
          "debateSectionId": "dbsect_844",
          "showAs": "Primary Care Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_844"
        },
        "questionNumber": 986,
        "date": "2025-11-12",
        "showAs": " 986. Deputy Mark Ward asked the Minister for Health if a GP service will operate in the new Adamstown primary care centre; when these services will be operational; how local residents can apply to be patients of the GP service; and if she will make a statement on the matter. [61327/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_986"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_189",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Mark Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29",
          "memberCode": "Mark-Ward.D.2019-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_176",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_176",
          "showAs": "Transport Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_176.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Transport",
          "roleCode": null
        },
        "showAs": " 189. Deputy Mark Ward asked the Minister for Transport for an update on the roll out of transport police; the details of the way in which they will operate; and if he will make a statement on the matter. [60789/25] ",
        "questionNumber": 189,
        "answerText": " Minister for Transport  As Minister or Transport, I can assure you that my Department is actively progressing the legislative proposals required to deliver on the Government’s commitment to establish a Transport Security Force and is working closely with the National Transport Authority (NTA) in this regard. This work involves careful and informed consideration of the most appropriate model for the force, with all key stakeholders fully engaged – the NTA, operators, trade unions, passenger groups, An Garda Síochána and the Department of Justice. Since assuming office I have met with these stakeholders as a collective twice and we will continue to work together to deliver on this commitment.  The Programme for Government sets out a clear commitment: the Transport Security Force will operate under the NTA with powers similar to those held by Airport Police and Customs Officers. The introduction of such a force will require new legislation and this issue is a priority for my Department, and we are determined to advance it as swiftly as possible.  In parallel, the Government continues to invest heavily in public transport safety. Twenty rapid response hubs have now been established across the Iarnród Éireann intercity network, enhancing their ability to respond quickly to incidents and support frontline staff. In the Dublin region, the Dublin Bus Safer Journeys Team has dedicated units covering North, South, and Central Dublin as of February 2025. All buses are also now equipped with eleven internal CCTV cameras, and the modern fleet includes three external cameras on each bus to further strengthen surveillance and deterrence. On the Luas, Transdev has a full time dedicated security staff patrolling both Red & Green lines from early morning to last tram.  While these measures mark significant progress, antisocial behaviour on public transport remains a serious concern. It is those who use and work within the network who are most directly affected, and the establishment of the Transport Security Force will be key in addressing this issue.  The establishment of this Transport Security Force is a key priority for Government, and as the Minister for Transport I fully support all the ongoing positive work to progress towards creating a safer public transport network for staff and passengers.  In the meantime, we are committed to delivering a safe and secure public transport system, and we will maintain momentum on all fronts until the Transport Security Force is in place. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_190",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Mark Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29",
          "memberCode": "Mark-Ward.D.2019-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_177",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_177",
          "showAs": "Bus Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_177.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Transport",
          "roleCode": null
        },
        "showAs": " 190. Deputy Mark Ward asked the Minister for Transport the number of cancellations of the G2 bus route; his views on the reason for the number of high cancellations; the regularity of the service for this route; the options which are in place when a service is cancelled; and if he will make a statement on the matter. [60790/25] ",
        "questionNumber": 190,
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators, in this case Dublin Bus.  In light of the above, I have forwarded the Deputy's question to the NTA and Dublin Bus for direct reply. Please advise my private office if you do not receive a response within ten working days. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_243",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Mark Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29",
          "memberCode": "Mark-Ward.D.2019-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_226",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_226",
          "showAs": "School Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_226.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "showAs": " 243. Deputy Mark Ward asked the Minister for Education and Youth if funds will be released to a school (details supplied) to complete the construction of their carpark; to detail the process to be granted funding from her Department; and if she will make a statement on the matter. [60791/25] ",
        "questionNumber": 243,
        "answerText": " Minister for Education and Youth  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In addition, repurposing and optimisation of existing accommodation capacity across the school estate has been a key enabler of timely, local provision of special class capacity in a way that supports best practice in inclusion and integration. Circa 80% of new special classes in 2025/26 are being facilitated in repurposed classroom accommodation.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  All Government departments are expected to publish their sectoral NDP Implementation Plans in November. My department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. The matter referred to by the Deputy will be reviewed in the context of this process and the school will be advised of the outcome. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 626. Deputy Mark Ward asked the Minister for Education and Youth the reason that despite clear local need, a recent application for a new UBU funded youth project was rejected for the CityWest/Saggart area; and if there will be new UBU funding going forward for this area giving its unique challenges. [60164/25] ",
        "by": {
          "memberCode": "Mark-Ward.D.2019-11-29",
          "showAs": "Mark Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_626",
        "questionNumber": 626,
        "answerText": " Minister for Education and Youth  The department is dedicated to enhancing the delivery and development of youth work services and opportunities for young people across the country, including in the Citywest and Saggart area.  In Budget 2025, €756,956 was allocated to Dublin and Dun Laoghaire Education and Training Board (DDLETB) under the ETB Youth Grant, to support the ETB in carrying out its functions relating to the administration of the department's funding, and its role in co-ordinating and supporting youth services.  In 2025, €9,274,411 was allocated to DDLETB under the UBU Your Place Your Space (UBU) scheme. This represented an increase of 4.5% on funding levels from 2024, which supported 32 youth services. Additional funding of €84,420 has been allocated to the ETB under the Resilience and Effectiveness Scheme in 2025 to further support UBU-funded organisations to develop capacity and respond to emerging needs.  In 2025, DDLETB received €65,000 under the Targeted Youth Employability Support Initiative (TYESI). This funding supports projects that engage young people who are not in education, employment, or training (NEET), helping them to build confidence, develop key skills, and progress toward further education or the workforce.  In addition to core youth service funding, €298,889 was allocated to DDLETB under the Local Youth Club Grant Scheme (LYCGS). This annual scheme is specifically designed to support volunteer-led youth work activities at a local level, helping to sustain and enhance the vital work carried out by youth clubs and groups in communities across the region.  In Budget 2025, €1.2 million was secured to provide for the establishment of ten new UBU services across the country which will provide targeted youth worker-led support for up to 1,000 young people.??  Each ETB was invited to make a?submission for a new UBU service in their functional area utilising available demographic data. As part of this process Dublin and Dun Laoghaire ETB submitted a proposal for a new service in the Citywest, Saggart and Rathcoole area.  Whilst the need for UBU youth services was demonstrated in all submissions, funding was allocated based on the results of the assessment process.  Following this process, the ten ETBs awarded funding for a new?UBU?service are as follows:  • Cavan and Monaghan ETB  • Donegal ETB  • Kerry ETB  • Kildare and Wicklow ETB  • Kilkenny and Carlow ETB  • Laois and Offaly ETB  • Longford and Westmeath ETB  • Louth and Meath ETB  • Mayo, Sligo and Leitrim ETB  • Tipperary ETB  The ETBs awarded funding have issued calls for youth organisations to apply to establish and deliver these new?services?in the selected areas.  Budget 2026 has secured an additional €8 million in current and capital funding to support the sustainability and development of youth services. This investment strengthens the foundation for inclusive, high-quality provision — ensuring continuity, expanding reach, and enabling services to respond to the evolving needs of Ireland’s diverse youth population.?  The Budget documentation published sets out funding for key measures and actions agreed for the coming year. As the Deputy may be aware, in line with standard practice, the final allocation of funding for the department for 2026 will be set out in the 2026 Revised Estimates Volume (REV) which is due to be published later this year. Further details on the 2026 allocations for the department will be available after the 2026 REV process is complete.?  The department is currently engaging with DDLETB on how best to support the young people in the Citywest and Saggart area.   ",
        "debateSection": {
          "showAs": "Youth Work Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_574",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_574.xml"
            }
          },
          "debateSectionId": "dbsect_574"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 667. Deputy Mark Ward asked the Minister for Education and Youth his views on the review of the allocation of special needs assistants for a school (details supplied); the reason the school was not successful in getting a higher SNA allocation; the options open to the school; and if she will make a statement on the matter. [58029/25] ",
        "by": {
          "memberCode": "Mark-Ward.D.2019-11-29",
          "showAs": "Mark Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_667",
        "questionNumber": 667,
        "answerText": " Minister of State at the Department of Education and Youth  This government is fully committed to supporting children with special educational needs to fulfil their full potential and the Programme for Government makes a number of commitments to deliver on this objective.  Special needs assistants (SNAs) play a central role in the successful inclusion of students with additional and significant care needs in schools. They help ensure that these students can access an education to enable them to achieve their best outcomes and reach their full potential.  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for children with special educational needs.  It is open to any school who feels it has insufficient SNA resources to request a review by the NCSE. Each case is individually assessed and is based on the student profile of each school. The NCSE has advised that this school recently received the outcome of their review which did not warrant an increase at this time.  Schools can appeal this decision to the Appeals Advisory Committee (ACC) if they feel the review process was not followed correctly or a substantial error was made. This committee comprises of an independent chairperson, a representative of school management bodies and a parent representative. The decision of the AAC is final, however, it is important to note that a school may request a further review at any stage should care needs of the students enrolled change.  The NCSE can also make a local special educational needs organiser (SENO) available to the school to discuss their deployment of SNA supports in the school and to put these supports to the best advantage of the students. The NCSE in-school support service is also available to schools to offer further guidance and support. ",
        "debateSection": {
          "showAs": "Special Educational Needs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_615",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_615.xml"
            }
          },
          "debateSectionId": "dbsect_615"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1141. Deputy Mark Ward asked the Minister for Housing, Local Government and Heritage for an update on the general scheme for redress for Celtic Tiger-era building defects; the means by which apartment owners will apply for this scheme; and if he will make a statement on the matter. [60148/25] ",
        "by": {
          "memberCode": "Mark-Ward.D.2019-11-29",
          "showAs": "Mark Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1141",
        "questionNumber": 1141,
        "answerText": " Minister for Housing, Local Government and Heritage  The Apartments and Duplex Defects Remediation Scheme is expected to be established shortly after the passage of the legislation, the timeline for which is subject to Oireachtas process. The General Scheme of the Bill will be made available to undergo pre-legislative scrutiny and I anticipate this happening in the Dáil autumn term.  The Scheme will provide supports for the remediation of relevant fire safety, structural safety and water ingress defects in purpose-built apartment buildings, including duplexes, constructed between 1991 and 2013. It is envisaged that 100% of eligible remediation costs will be funded.  The Housing Agency will administer and implement the scheme. The legislation will provide for applications to be made by Owners Management Companies and will outline the details required for assessment of eligibility, the application process, and the supporting documentation required. ",
        "debateSection": {
          "showAs": "Defective Building Materials",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_989",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_989.xml"
            }
          },
          "debateSectionId": "dbsect_989"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Justice",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1291. Deputy Mark Ward asked the Minister for Justice, Home Affairs and Migration the plans to purchase a facility (details supplied) for use as IPAS accommodation; the number that may be accommodated if the complex is purchased; and if he plans to engage with the local community about future plans for this facility. [58830/25] ",
        "by": {
          "memberCode": "Mark-Ward.D.2019-11-29",
          "showAs": "Mark Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1291",
        "questionNumber": 1291,
        "answerText": " Minister for Justice, Home Affairs and Migration  The Department has not received an offer of international protection accommodation at this location and is not considering this property for purchase. ",
        "debateSection": {
          "showAs": "International Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1110",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1110.xml"
            }
          },
          "debateSectionId": "dbsect_1110"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Justice",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1390. Deputy Mark Ward asked the Minister for Justice, Home Affairs and Migration that youth organisations (details supplied) are involved as part of any community engagement with stakeholders in the Citywest and Saggart areas; and if he will make a statement on the matter. [60165/25] ",
        "by": {
          "memberCode": "Mark-Ward.D.2019-11-29",
          "showAs": "Mark Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1390",
        "questionNumber": 1390,
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  The purchase of the Citywest site had been progressed with a strong commitment to engagement with the local community and the Department's Community Engagement team is working closely with local community leaders, community groups and stakeholders.  Between 01 July – 28 October 2025, 15 meetings have been attended by the Community Engagement Team with community stakeholders. This excludes ongoing engagement planning meetings with representatives of the Local Authority and the Local Development Company, in line with the commitment to co-design the engagement plan.  46 community-based organisations, including residents’ associations, sporting organisations and NGOs have been invited to attend meetings between the Community Engagement Team and community stakeholders.  These organisations were identified to the Community Engagement Team by local elected representatives, the Local Authority, through the Public Participation Network or made direct contact with the Community Engagement Team.  Our engagement is focused on local and community stakeholders.  Department officials and the Community Engagement Team have remained in touch with all key local stakeholders throughout the last weeks, and will continue to assist and work with local representatives and community groups to help bring stability to the area and progress a way forward. ",
        "debateSection": {
          "showAs": "International Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1183",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1183.xml"
            }
          },
          "debateSectionId": "dbsect_1183"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Children",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1464. Deputy Mark Ward asked the Minister for Children, Disability and Equality to outline, under S.I. No. 704/2021, the number of 16A applications have been made and granted since 2021; the national guidance in relation to this section; if oversight or risk management exits in relation to these applications; and if she will make a statement on the matter. [57704/25] ",
        "by": {
          "memberCode": "Mark-Ward.D.2019-11-29",
          "showAs": "Mark Ward",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mark-Ward.D.2019-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1464",
        "questionNumber": 1464,
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "debateSection": {
          "showAs": "Disability Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1251",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1251.xml"
            }
          },
          "debateSectionId": "dbsect_1251"
        }
      },
      "contextDate": "2025-11-04"
    }
  ]
}