{
  "head": {
    "counts": {
      "questionCount": 1628,
      "resultCount": 1628
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  I wish to advise the Deputy that motorcycles must adhere to the posted speed limits and do not have a separate speed limits.  Motorists who speed currently face 3 penalty points and a fixed charge notice (FCN) of €160, rising to €240 if not paid within 28 days. If, after 56 days, the motorist has not paid the FCN, the offence is referred to the courts, where the motorist may choose to accept the penalty points and pay a €320 FCN up to seven days before the court date. If the motorist chooses to go to court and is convicted of a speeding offence, they could be fined up to €1000 and receive 5 penalty points.  The penalty points issued for speeding in 2023 and 2024 are provided in the table below.     Year    3 Penalty Points    5 Penalty Points    Total      2023    128,589    5,598    134,187      2024    115,059    4,847    119,906     This Department does not hold data relating to the number of FCNs issued. I suggest the Deputy contact An Garda Síochána directly for this information. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 204. Deputy Jennifer Murnane O'Connor asked the Minister for Transport the current speed restrictions that apply to motorbikes on national roads; the penalties for speeding; and the number of speeding fines and penalty points issued in 2023 and 2024. [69452/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_194",
          "debateSectionId": "dbsect_194",
          "showAs": "Road Traffic Offences",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_194.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_204",
        "questionNumber": 204
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the operation and management of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals. In this context, TII is best placed to advise you in relation to the restoration of lighting at Exit 4 on the M9.  Noting the above position, I have referred your question to TII for a direct reply. Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 213. Deputy Jennifer Murnane O'Connor asked the Minister for Transport to restore lighting at the Exit 4 M9 junction (Carlow Town/Tullow) on the border Carlow/Kildare (details supplied); and the reason the limited lighting provided at exit 4 differs significantly to lighting provided at other exits on the M9. [69480/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_200",
          "debateSectionId": "dbsect_200",
          "showAs": "Road Safety",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_200.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_213",
        "questionNumber": 213
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "showAs": " 670. Deputy Jennifer Murnane O'Connor asked the Minister for Justice, Home Affairs and Migration the reason the citizenship application system is structured in such a way (details supplied); and if improvements can be made to ensure greater fairness and that applicants are not repeatedly placed at the back of the queue due to administrative delays outside their control. [65886/25] ",
        "debateSection": {
          "showAs": "Citizenship Applications",
          "debateSectionId": "dbsect_599",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_599",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_599.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Jennifer Murnane O'Connor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25"
        },
        "questionNumber": 670,
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  As part of my Department’s continued commitment to improving its services, an online citizenship application portal was made available in October 2023. This has made the application process easier for applicants, allowing them to easily fill in relevant forms and submit their application online.  These improvements, along with the introduction of online payments and eVetting, are having a positive impact on naturalisation processing times. The length of time taken to process an application has dropped from 15 months in 2023, to 8 months in 2024.  In just over two years, the Citizenship Division of my Department has gone from processing around 12,000 applications a year, to processing over 20,000 applications in 2023, and made more than 31,000 decisions in 2024.  In cases where incomplete naturalisation applications are received, the application is returned to the applicant with a request to provide the missing documentation within 28 days. A reminder is issued after 18 days if the required documentation has still not been provided.  Where an application is returned, it is taken out of the queue for processing. The citizenship application portal does not distinguish whether an application that is submitted is a new application, or a resubmitted one. Therefore, when an application is returned to an applicant and subsequently resubmitted, it will rejoin the queue on the date that it is resubmitted, not the date of the original application.  If the requested documents are not supplied within the timeframe provided, the application will be deemed ineligible and closed. Applicants are advised that it is their responsibility to ensure that all the required documents are submitted as part of their naturalisation application.  Citizenship Division have produced a guidance document for all potential applicants which outlines which documents are required for the application. This document is published on my Department's Irish Immigration website and is available here: https://www.irishimmigration.ie/wp-content/uploads/2024/04/Citizenship-Guidance-Document-April-2024.pdf  As an Oireachtas member, you can also request the status of individual immigration cases by e-mail, using the Oireachtas Mail facility at: IMoireachtasmail@justice.ie, which has been specifically established for this purpose. This service enables up to date information on such cases to be obtained without the need to seek information by way of the Parliamentary Question process. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Justice",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_670",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25"
        },
        "showAs": " 130. Deputy Jennifer Murnane O'Connor asked the Minister for Enterprise, Tourism and Employment for a full update on the IDA business building, Dublin Road, Carlow; the number of site visits that have taken place in the past 12 months; and the efforts made by the IDA to secure a permanent tenant at the site. [64125/25] ",
        "to": {
          "roleType": null,
          "showAs": "Enterprise",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_104.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_104",
          "showAs": "Industrial Development",
          "debateSectionId": "dbsect_104"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_130",
        "answerText": " Minister for Enterprise, Tourism and Employment  Regional Development is a key focus of our Programme for Government and is central to the work of my Department and our enterprise development agencies. In this regard, IDA Ireland’s strategy ‘Adapt Intelligently, 2025 – 2029’ seeks to build on IDA’s successes to date and to support continued long-term investment through the transformation of the existing client base across Ireland and leveraging new opportunities and sectors.  Over the current strategy period, IDA is aiming to secure 550 of a total 1000 foreign direct investment (FDI) projects outside Dublin - 55% of all planned investments, with ambitious targets for the investments every region in Ireland, including 60 in the South-East region.  The South-East has a significant ecosystem of well-established companies across Technology, Life Sciences, International Financial Services, Engineering & Industrial Technologies, which are complemented by research centres that help win new business and assist existing client companies with transformation. The FDI performance in the region has been strong over the past five years with employment among IDA clients increasing by 15%.  IDA’s continued positive intervention in terms of delivering and maintaining a portfolio of advanced property solutions, to complement private sector provision, to support investments on a regional basis is paramount. A robust property and infrastructure ecosystem can be the key differentiator in winning FDI projects. In that regard, IDA continues to actively manage its property portfolio to ensure the availability of suitable sites for enterprise development. The IDA Regional Property Programme ensures the supply of land, buildings and essential infrastructure in regional locations as required by current and prospective clients of IDA as well as those of Enterprise Ireland and the Local Enterprise Offices.  IDA Ireland continually engages with key stakeholders such as infrastructure, service providers and Local Authorities, including Carlow County Council and other regional stakeholders to ensure the identification of lands that are suitable for client investment in the long term. IDA also works closely with the private sector in the South East region in marketing of appropriate and cost-effective property solutions that meet the needs of its client companies.  The IDA made a significant investment in Carlow during their last strategy, 2021-2024, with the completion of an Advanced Business Solution (ABS) on the IDA Carlow Business Park which is actively being marketed as a property solution to FDI and EI clients. While there was one site visit to the Carlow ABS by a client company in the last twelve months, there have been numerous enquiries made, and several visits to the building have taken place as part of marketing efforts. Full details of the Carlow ABS are included in IDA’s digital marketing materials shared with IDA’s overseas colleagues and client companies.  There continues to be good interest in companies visiting Carlow. There has been a consistent increase in visits since 2022. Details of site visits to Carlow up to the end of September 2025 are shown in the table below:     Carlow    To end Q3 2025    2024    2023    2022      Site Visits    3    6    5    3       I should point out that site visits are one measure only of a company’s interest in a particular location and may not necessarily be a true measure of the overall level of foreign direct investment (FDI) activity in a region or county. For example, almost 70% of FDI won by IDA Ireland comes from its existing client base, rather than new companies and potential clients usually visit more than one county and may return to a location more than once.  With a clear focus on regional development, a strong pipeline of investment, and collaborative local partnerships, IDA Ireland is positioning Carlow and the wider the South-East Region as a competitive and attractive destination for global investors, however, ultimately, individual companies determine where to locate their investments rather than the IDA. ",
        "questionNumber": 130
      },
      "contextDate": "2025-11-19"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25"
        },
        "showAs": " 178. Deputy Jennifer Murnane O'Connor asked the Minister for Social Protection to clarify his Department's understanding on the position of charities who previously gave funding to support individuals struggling to pay electricity bills (details supplied). [64142/25] ",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_151.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_151",
          "showAs": "Fuel Poverty",
          "debateSectionId": "dbsect_151"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_178",
        "answerText": " Minister for Social Protection  While I am aware of the support that ALONE provides to older people to allow them to age at home , my Department has no role in the funding position of the charity concerned.  My Department does provide direct support towards energy costs to qualifying low-income households, through schemes such as the Fuel Allowance Scheme, the Household Benefits Package as wells as through Additional Needs Payments.  The Fuel Allowance Scheme is means tested and assists pensioners and other welfare dependent householders with meeting the cost of their heating needs during the winter season. The Fuel Allowance is a payment of €33 per week for 28 weeks giving a total per recipient of €924 each year from October to April at an estimated cost of €400 million in 2025. As part of Budget 2026 I was delighted to announced that the weekly rate of Fuel Allowance will increase by €5 to €38 a week from January 2026. This equates to €1,064 in a fuel season.  The Household Benefits Package is universally available to those aged 70 and older, and those between 66 and 70, must meet certain qualifying criteria. The Household Benefits comprises the Electricity/Gas Allowance of €35 per month and the Free Television Licence Scheme which is worth €160 per year with a total value per year of €580. Over 532,000 households are in receipt of the Electricity/Gas element of the Household Benefits package at an estimated cost of €224 million in 2025.  Additional Needs Payments as part of the Supplementary Welfare Allowance scheme, are provided to people who have essential expenses, which they cannot meet from their own resources, including people who face difficulties in meeting fuel bills.  Any person who considers that they may have an entitlement to an Additional Needs Payment is encouraged to contact their local community welfare service. There is a National Community Welfare Contact Centre in place - 0818-607080 - which will direct callers to the appropriate office. In addition, applications can be made online via www.mywelfare.ie.  I trust this clarifies the matter for the Deputy. ",
        "questionNumber": 178
      },
      "contextDate": "2025-11-19"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 768,
        "showAs": " 768. Deputy Jennifer Murnane O'Connor asked the Minister for Justice, Home Affairs and Migration for the update position on a new build for a school (details supplied), funded by the Immigrant Investor Programme, handled by the Department of Justice, Home Affairs and Migration. [63311/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Justice"
        },
        "by": {
          "showAs": "Jennifer Murnane O'Connor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_768",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_611",
          "showAs": "Schools Building Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_611",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_611.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Justice, Home Affairs and Migration  At the outset, it is important to note that, as Minister, I do not comment on individual Immigrant Investor Programme (IIP) applications.  I can advise you that further details concerning the processing of outstanding IIP applications is published on the Immigration Service website of my Department, including an FAQ document. Both can be accessed at the following link: www.irishimmigration.ie/processing-of-iip-applications-on-hand-following-the-closure-of-the-programme/  If a project owner has any queries, they can contact the IIP Unit directly. ",
        "date": "2025-11-18"
      }
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 414. Deputy Jennifer Murnane O'Connor asked the Minister for Transport the current speed restrictions that apply to motorbikes on national roads; and the penalties for speeding and the number of speeding fines and penalty points issued in 2023 and 2024. [59768/25] ",
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_414",
        "questionNumber": 414,
        "answerText": " Minister of State at the Department of Transport  As Minister of State for International & Road Transport, Logistics, Rail & Ports, I wish to advise that motorcycles must adhere to the posted speed limits; they do not have a separate, special speed limit.  Motorists who speed currently face 3 penalty points and a fixed charge notice (FCN) of €160, rising to €240 if not paid within 28 days. If after 56 days the motorist has not paid the FCN, the offence is referred to the courts, where the motorist may choose to accept the penalty points and pay a €320 FCN up to seven days before the court date. If the motorist chooses to go to court and is convicted of a speeding offence, they could be fined up to €1000 and receive 5 penalty points.  The penalty points issued for speeding in 2023 and 2024 are provided in tabular form below.      Year      3 Penalty Points      5 Penalty Points      Total       2023    128,589    5,598     134,187       2024    115,059    4,847     119,906      This Department does not hold data relating to the number of FCNs issued. I suggest the Deputy contact An Garda Síochána directly for this information. ",
        "debateSection": {
          "showAs": "Road Network",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_387",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_387.xml"
            }
          },
          "debateSectionId": "dbsect_387"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1016. Deputy Jennifer Murnane O'Connor asked the Minister for Housing, Local Government and Heritage when the figures in respect of the housing sector by local authority for 2016 to 2024 will be published (details supplied), either by the CSO or his Department. [58167/25] ",
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1016",
        "questionNumber": 1016,
        "answerText": " Minister for Housing, Local Government and Heritage  My Department publishes comprehensive programme-level statistics on a quarterly basis on social and affordable housing delivery activity by local authorities and Approved Housing Bodies in each local authority. Approved housing bodies (AHBs) are independent, not-for-profit organisations. AHBs are also known as voluntary housing associations and include housing co-operatives.  This data is available to the end of Q2 2025 and is published on the statistics page of my Department’s website at the following link: www.gov.ie/en/collection/6060e-overall-social-housing-provision/  My Department also publishes the Social Housing Construction Status Report (CSR), which provides details of social housing developments, their location and their funding programme that have been completed, are under construction or are progressing through the various stages of the design and tender processes. The most recent publication was for Quarter 2 2025. The Q2 2025 CSR and all previous versions of the CSR are available on the Department’s website at the following link: www.gov.ie/en/department-of-housing-local-government-and-heritage/collections/social-housing-construction-projects-status-reports/  A version of the CSR file can also be downloaded for analysis by local authority, Approved Housing Body etc. at this link: www.opendata.housing.gov.ie/dataset/social-housing-construction-status-report-q2-2025  Data on all new dwelling completions is published by the Central Statistics Office (CSO) on a quarterly basis and is available on the CSO website at www.data.cso.ie/product/NDC ",
        "debateSection": {
          "showAs": "Local Authorities",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_890",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_890.xml"
            }
          },
          "debateSectionId": "dbsect_890"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_180.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_180",
          "debateSectionId": "dbsect_180"
        },
        "to": {
          "showAs": "Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Education and Youth  The school to which the Deputy refers submitted an application for funding under the Emergency Works Scheme (EWS) for roof works.  The application in question is currently being reviewed by the technical area within the EWS. Once a technical recommendation has been received back from the technical team, the EWS team will engage further with the school as appropriate. The EWS team is aware of the urgent nature of the works required and will keep the school informed throughout the process. ",
        "questionType": "written",
        "showAs": " 181. Deputy Jennifer Murnane O'Connor asked the Minister for Education and Youth for an update on an application for emergency works to address structural problems with a roof (details supplied). [55988/25] ",
        "questionNumber": 181,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Jennifer Murnane O'Connor",
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_181"
      }
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_181.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_181",
          "debateSectionId": "dbsect_181"
        },
        "to": {
          "showAs": "Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Education and Youth  The school to which the Deputy refers was granted capital funding for the provision of two Special Educational Needs (SEN) classrooms under my Department’s Devolved SEN Reconfiguration and Modular Accommodation programme in December 2024.  This programme involves the use of Project Management supports which is designed to enable the accommodation to be provided as quickly as possible and help ease the administrative workload for school authorities in relation to the management and delivery of projects. Kerrigan Sheanon Newman Project Management (KSN) has been appointed, from the Department’s Framework, to design and tender the project and oversee all elements of construction.  The school authority received their second tranche of funding in May 2025, which included the standard Furniture and Equipment and Information and Communications Technology grants as part of this funding. This project is now complete and it is expected that the accommodation will be handed over for occupation in the coming weeks.  My Department is fully aware of the urgency in respect of this accommodation and will be working closely with the project managers and the school authority to keep it updated on overall project delivery and timelines.  In addition to the above, SEN start up grants to this school in July 2025 from the furniture and equipment (F&E) area. The F&E area has also engaged with the school in respect of a query about replacement furniture and is awaiting a response from the school in this regard. ",
        "questionType": "written",
        "showAs": " 182. Deputy Jennifer Murnane O'Connor asked the Minister for Education and Youth for an update on a request for funding to equip two modular SEN classrooms, as currently, the school cannot fully equip the classroom for full operation (details supplied). [55989/25] ",
        "questionNumber": 182,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Jennifer Murnane O'Connor",
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_182"
      }
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Schools Refurbishment",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_182.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_182",
          "debateSectionId": "dbsect_182"
        },
        "to": {
          "showAs": "Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Education and Youth  The school to which the Deputy refers submitted an application on 10th October 2025 for funding under the Emergency Works Scheme (EWS) for a collapsed ceiling within a classroom due to a failure in the plumbing network.  The application in question is currently being reviewed by the technical area within the EWS. Once a technical recommendation has been received back from the technical team, the EWS team will engage further with the school as appropriate. The EWS team is aware of the urgent nature of the works required and will keep the school informed throughout the process. ",
        "questionType": "written",
        "showAs": " 183. Deputy Jennifer Murnane O'Connor asked the Minister for Education and Youth for an update on an application for emergency works funding to repair a collapsed roof that contains asbestos (details supplied). [55990/25] ",
        "questionNumber": 183,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Jennifer Murnane O'Connor",
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_183"
      }
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_183.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_183",
          "debateSectionId": "dbsect_183"
        },
        "to": {
          "showAs": "Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Education and Youth  The project referred to by the deputy has been devolved to the National Development Finance Agency (NDFA) for delivery as part of a programme of school building projects.  The project consists of the construction of a new school next to the existing Presentation De La Salle School to facilitate an increase in capacity to an LPTE of 750 pupils and 5 special education classrooms.  The project received full grant of planning permission and is currently at Stage 3 of the architectural planning design process - Tender stage.  When this stage is concluded, the project will progress to construction in due course. The length of time a project takes to go through each stage varies and depends on a number of factors, including scale and complexity.  The NDP Review process for the 2026 to 2030 period has recently concluded and involves an allocation of €7.55 billion for the Department of Education and Youth (DEY).  All government departments are now tasked to develop implementation plans based on their NDP Allocations. The DEY target will be to have this done and published in the Autumn. This will involve the department’s Planning & Building Unit undertaking a review and analysis to determine the optimum outputs to be achieved from the €7.55 billion allocation with a strong emphasis on maximising existing capacity and in relation to project delivery ensuring a continued focus on affordability, value for money and functionality.  In relation to project rollout for Large-Scale projects and Additional Accommodation Scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. This will be the context for assessing all project rollout for the 2026 to 2030 period including in relation to Presentation De La Salle, Bagenalstown.  The current status of all projects is listed on a county-by-county basis at www.gov.ie. and this is updated on a regular basis to reflect project progress through the various stages of capital appraisal, site acquisition, design, tender and construction . ",
        "questionType": "written",
        "showAs": " 184. Deputy Jennifer Murnane O'Connor asked the Minister for Education and Youth when a new build for a school will proceed (details supplied). [55991/25] ",
        "questionNumber": 184,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Jennifer Murnane O'Connor",
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_184"
      }
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_184.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_184",
          "debateSectionId": "dbsect_184"
        },
        "to": {
          "showAs": "Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Education and Youth  I can confirm that my department is in receipt of an application for funding under the Additional Schools Accommodation (ASA) scheme from the school in question.  The purpose of the ASA Scheme is to ensure that essential mainstream and special education classroom accommodation is available to cater for pupils enrolled each year and where the need cannot be met by the school’s existing accommodation or by available accommodation at other schools in the area.  In general, demographics have been falling at primary level and are due to continue to decrease. Therefore, my department considers it prudent to maximise the use of existing spare accommodation capacity at primary level in the first instance, before considering any applications for further accommodation needs. This is in line with public spending requirements.  The school in question submitted an application for repurposing of existing space to accommodate two special classes. Further documentation was received recently from the school in support of the significant works involved to facilitate the classes. This information is currently under consideration by the Department and the school will be contacted with a decision as soon as possible. ",
        "questionType": "written",
        "showAs": " 185. Deputy Jennifer Murnane O'Connor asked the Minister for Education and Youth for an update on an application by a school (details supplied) for repurposing of existing space to accommodate two special classes. [55992/25] ",
        "questionNumber": 185,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Jennifer Murnane O'Connor",
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_185"
      }
    },
    {
      "question": {
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-30/pq_410",
        "answerText": " Minister for Education and Youth  The school referred to by the Deputy was approved funding under the Additional School Accommodation scheme to provide four mainstream classrooms (2 prefab replacements), a two classroom special educational needs base and ancillary accommodation.  The Stage 2b (detailed design) report was received by the Department in August 2024. Following a thorough review by Department officials, further information was requested prior to authorising progression to Stage 3 (tender). A response from the school was received in April 2025.  The latest information is being reviewed from both a technical and cost perspective in accordance with the requirements of the Public Spending Code. All projects, including this one, are subjected to the required due diligence as specified in the Department's infrastructure guidelines. All projects, including this one, will undergo the necessary due diligence outlined in the public Infrastructure Guidelines.  Furthermore, as part of the National Development Plan (NDP) allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large Scale and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  My department is now preparing an NDP implementation plan which is due for publication later in the Autumn. This plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  The NDP implementation plan will be considered as part of the ongoing review of this school building project. Once the NDP implementation plan is finalised my Department will be in a position to inform the school of the outcome regarding the progression of this project. ",
        "date": "2025-09-30",
        "questionNumber": 410,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/dbsect_337",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/mul@/dbsect_337.xml"
            }
          },
          "debateSectionId": "dbsect_337",
          "showAs": "Schools Building Projects"
        },
        "showAs": " 410. Deputy Jennifer Murnane O'Connor asked the Minister for Education and Youth the reason a school building project (details supplied) for four classrooms and an SEN base is stalled at Stage 2B since January 2025 and awaiting approval to put the project out to tender. [51137/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Education",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-30"
    },
    {
      "question": {
        "date": "2025-09-23",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25"
        },
        "showAs": " 403. Deputy Jennifer Murnane O'Connor asked the Minister for Social Protection the number of people for whom an applicant can seek carer's support; and if a maximum carer's grant allowance applies. [49585/25] ",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/mul@/dbsect_382.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/dbsect_382",
          "showAs": "Social Welfare Schemes",
          "debateSectionId": "dbsect_382"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-23/pq_403",
        "answerText": " Minister for Social Protection  The key role of the Department of Social Protection is that of income support for people experiencing specific contingencies that limit their ability to earn an income. These contingencies include unemployment, illness/disability and caring responsibilities.  The main income supports provided by my department to family carers include Carer's Benefit, Carer's Allowance, the Carer's Support Grant and Domiciliary Care Allowance. These income supports are available to all family carers where they meet the eligibility conditions.  Only one Carer's Allowance can be paid in respect of a carer. The payment is made up of a personal rate for the carer and extra amounts for child dependents. If, however, the carer is providing full-time care and attention to more than one person, the rate of Carer's Allowance payable is increased by 50% of the standard personal rate. Similarly, the weekly non-means tested, social insurance based Carer's Benefit payment has an increased personal rate where care is provided to more than one person.  The non-means-tested annual Carer's Support Grant is available for all full-time carers whether or not they are in receipt of a weekly carers’ payment from my department. A grant is paid for each person being cared for. The grant increased by €150 this year to €2,000 - its highest ever level.  Domiciliary Care Allowance is payable to a parent/guardian in respect of a child aged under 16 who has a severe disability and requires continual or continuous care and attention substantially over and above the care and attention usually required by a child of the same age. The child must be likely to require this level of care and attention for at least 12 consecutive months.  Where a person is caring for more than one child who qualifies for Domiciliary Care Allowance, they may claim the monthly allowance of €360 for each child. There is no restriction on the number of children for whom a person may claim Domiciliary Care Allowance.  The Programme for Government contains a number of commitments to improve the supports available to family carers. These include a commitment to continue to increase the Carer’s Support Grant and to progressively increase weekly carer support payments. In addition, the Government has committed to examining how carers who are providing full-time care and attention to more than one person can be better supported. These commitments will be advanced over the lifetime of the Government and in light of available resources.  I trust that this clarifies the issue for the Deputy. ",
        "questionNumber": 403
      },
      "contextDate": "2025-09-23"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1198. Deputy Jennifer Murnane O'Connor asked the Minister for Housing, Local Government and Heritage the homeless figures both nationally and in county Carlow; and the number of homeless persons accessing services both nationally and in county Carlow. [45774/25] ",
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_1198",
        "questionNumber": 1198,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 1198 and 1267 together.  My Department’s role in relation to homelessness involves the provision of a national framework of policy, legislation and funding to underpin the role of local authorities in addressing homelessness at local level. Statutory responsibility in relation to the provision of accommodation and related services for homeless persons rests with individual local authorities.  While responsibility for the provision of homeless accommodation and related services rests with individual housing authorities, the administration of homeless services is organised on a regional basis with a lead authority in place for each region. The South West region includes Cork City Council, Cork and Kerry County Councils, for the purposes of homeless administration, with Cork City Council as lead authority. The South East region includes Carlow, Kilkenny, Tipperary, Waterford City and Wexford County Councils, with Waterford City & County Council as lead authority.  My Department currently gathers and publishes data on a monthly basis on the number of homeless persons accommodated in emergency accommodation funded and overseen by local authorities. These reports are based on data provided by local authorities, produced through the Pathway Accommodation & Support System (PASS).  The monthly homelessness report includes details of individuals, families and the dependants of these families who accessed emergency accommodation during the relevant count week of the month in question. The most recently published data is in respect of July 2025. The reports are collated on a regional basis and are available on my Department's website at the following link: www.gov.ie/en/department-of-housing-local-government-and-heritage/collections/homelessness-data/ and are also published to the Department of Public Expenditure, Infrastructure, Public Service Reform & Digitisation open data portal data.gov.ie/ . ",
        "debateSection": {
          "showAs": "Homeless Accommodation",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_1020",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_1020.xml"
            }
          },
          "debateSectionId": "dbsect_1020"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Children",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1952. Deputy Jennifer Murnane O'Connor asked the Minister for Children, Disability and Equality the number of persons with a disability both nationally and in county Carlow registered and the number accessing services both nationally and in county Carlow to date in 2025. [45775/25] ",
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_1952",
        "questionNumber": 1952,
        "answerText": " Minister of State at the Department of Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "debateSection": {
          "showAs": "Departmental Data",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_1655",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_1655.xml"
            }
          },
          "debateSectionId": "dbsect_1655"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25"
        },
        "showAs": " 1026. Deputy Jennifer Murnane O'Connor asked the Minister for Education and Youth for an update on the timeframe for commencement of a new school building (details supplied). [41076/25] ",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_866.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_866",
          "showAs": "Schools Building Projects",
          "debateSectionId": "dbsect_866"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_1026",
        "answerText": " Minister for Education and Youth  Since 2020, this Department has invested over €6 billion in our schools throughout the country under the National Development Plan (NDP), involving the completion of over 1,400 school building projects. Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. €210m supplementary capital funding for my department was approved which brought the total capital allocation for 2025 for the Department to €1.6 billion.  As the deputy may be aware, after the NDP Review process, my department has secured funding of €7.55 billion. My department will prioritise investment in special education and school places as part of this funding for 2026-2030. The investment of €7.55 billion in capital funding will ensure that my department can deliver new special schools and upgrade existing schools. We will provide a record 14,000 school places in special classes and special schools. We will continue to provide the delivery of extra spaces in our mainstream schools through construction of new schools and extensions. Maintenance of the existing school estates is also an essential element. My department will develop an implementation plan which will be published in the Autumn.  Maximising existing capacity in schools to meet needs is also very important. The progression of prioritised individual projects to meet the most urgent needs in the 2026 to 2030 period that cannot be met through existing capacity across schools in the local area will be considered on a rolling basis from Autumn onwards.  My Department will engage directly with the school authority referred to by the deputy in this context. ",
        "questionNumber": 1026
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25"
        },
        "showAs": " 2267. Deputy Jennifer Murnane O'Connor asked the Minister for Children, Disability and Equality when funding from TUSLA of €28,000 will be provided to an organisation (details supplied). [40977/25] ",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_1919.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_1919",
          "showAs": "Childcare Services",
          "debateSectionId": "dbsect_1919"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_2267",
        "answerText": " Minister for Children, Disability and Equality  The Deputy is seeking information in relation to an operational matter for Tusla, the Child and Family Agency. Consequently, I have referred the matter to Tusla, and requested that a direct response be provided to the Deputy. ",
        "questionNumber": 2267
      },
      "contextDate": "2025-07-29"
    },
    {
      "contextDate": "2025-07-15",
      "question": {
        "questionNumber": 816,
        "date": "2025-07-15",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-15/writtens/dbsect_720",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-15/writtens/mul@/dbsect_720.xml"
            }
          },
          "showAs": "Early Childhood Care and Education",
          "debateSectionId": "dbsect_720"
        },
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "showAs": " 816. Deputy Jennifer Murnane O'Connor asked the Minister for Children, Disability and Equality the reason an early learning centre in Tullow County Carlow (details supplied) was declined for a fee increase. [39073/25] ",
        "answerText": " Minister for Children, Disability and Equality  In 2024, Core Funding services were allowed to apply for a fee increase. In this Fee Increase Assessment process, Core Funding Partner Services who were charging fees below the county average were eligible to apply to be assessed for a fee increase.  This Fee Increase Assessment process balanced the need of parents for stability with their early learning and childcare costs and the need for providers to operate viable businesses in order to continue providing this Public Good service for their community.  In order to determine a services viability their expenditure must be taken into account, and this expenditure varies from service to service.  My Department officials made a number of key adjustments to the expenditure data in calculating the Full Time Equivalent Fee for a child. A time related adjustment of 5.67% was made, reflecting that the expenditure data available to my Department, related to the 2022/2023 programme year and an adjustment of 9% was made, reflecting a surplus was needed to ensure service viability.  If a service has fees that support their expenditure +15.18%, they were not granted permission to increase. This process is about supporting viability.  However, the outcome of the process was determined by analysis of a service’s financial data, projected enrolments for Year 3 and their existing fee levels. As such, results varied by the individual circumstances of services. Following the conclusion of the process, any increase was certified by the Department in the form of a written decision letter confirming approval.  The process sought to begin addressing disparity within the sector, with some services having been frozen at much lower rates than others following the introduction of the fee freeze in 2021. The county thresholds served to identify these services that may have been frozen at particularly low levels.  The county thresholds were published on announcement of the Fee Increase Assessment process in July 2024, and were based on the average fee being charged at each Fee Band level in each county. To be eligible for assessment, the applicant service had to list at least one fee below their county threshold on their 2024/2025 Fee Table.  Once accepted into the process, the applicant service still needed to demonstrate an objective need to increase their fees through the aforementioned calculation, with only those fees which fell below the thresholds being assessed for an increase.  Please see the County thresholds for Carlow and Fee Bands below.     County Division     Band A Less than 10 hours a week    Band B Between 10hours and 19 hours 59 minutes a week    Band C Between 20hours and 29 hours 59 minutes a week    Band D Between 30hours and 39 hours 59 minutes a week    Band E Between 40hours and 49 hours 59 minutes a week    Band F 50 or morehours a week      Carlow    € 31.52    € 63.04    € 94.57    € 126.09    € 157.61    € 189.13     There are wider financial supports available from my Department where a service is experiencing financial difficulty or has concerns about their viability, which can be accessed through their local City/County Childcare Committee while remaining within Core Funding, accessed through local City or County Childcare Committee (CCC). ",
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Children",
          "roleType": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-15/pq_816",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2025-07-08",
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-08/pq_366",
        "house": {
          "chamberType": "house",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "showAs": "34th Dáil"
        },
        "questionNumber": 366,
        "date": "2025-07-08",
        "answerText": " Minister for Enterprise, Tourism and Employment  On 15 April, Government approved the General Scheme for the Short Term Letting and Tourism (STLT) Bill. The General Scheme was submitted to the Office of Parliamentary Counsel on 16 April for drafting and this work is currently underway. It is expected that the STLT Bill will go through the full legislative process in the Oireachtas later this year.  This Bill when enacted will provide the statutory basis for the introduction of new regulatory controls for the Short Term Letting (STL) sector in Ireland, including the introduction of a STL register which will be implemented and managed by Fáilte Ireland from 20 May 2026, ensuring compliance with the new EU Short Term Rental Regulation, which was adopted on 11 April 2024. The decision to introduce a STL register has been broadly welcomed by the tourism sector.  The new STL register will be available online and will provide a full picture of the stock of registered tourist accommodation across the state. STL hosts (including self-catering and B&Bs) offering accommodation for periods up to and including 21 nights will be obliged to register with Fáilte Ireland, confirm their compliance with planning requirements and hold a valid registration number that must be displayed when advertising their STL property on online platforms.  The establishment of the register will assist local authorities with the enforcement of planning requirements for Short Term Lets.  Fáilte Ireland has estimated that, based on data for April 2025 which has been screen scraped from publicly available STL listings across four major booking platforms, there are in the region of 33,000 STL properties in the State currently being advertised online and up to approximately 64% of these properties are advertised as “entire” houses and apartments. In the absence of a register there is no way of knowing whether these are principal private residences or otherwise. The research also points to an ongoing annual 10% increase in the size of the STL sector, year on year.  It is important that in such a fast-growing area, we have data on where this growth is happening.  The new Housing policy, proposed by the Minister for Housing, Local Government and Heritage, James Browne T.D., and approved by Government on 15 April is to generally preclude new planning permissions for STLs in cities and towns with a Census population in excess of 10,000 persons and to enable local authorities have discretion to develop policies for other locations having regard to relevant local criteria to be set out in the planning guidance. Minister Browne will set out the planning guidance for STLs in a National Planning Statement on short term letting and will progress any necessary legislative changes to implement the new Planning requirements. The National Planning Statement will be published in advance of the final enactment of the STLT Bill to provide clarity for the tourism sector.  At present, all STL properties with the exception of your principal private residence (PPR) based in rent pressure zones are required to have planning permission. If you rent out a room in your PPR, planning permission is generally not required, however if you rent out the entire PPR property for more than 90 days planning permission is necessary.  Tourism is of significant importance to the Irish economy, providing 227,000 jobs and €6 billion income to our economy in 2024.  Bed and breakfasts have played a key role in welcoming visitors from around the world to Ireland for more than 50 years and this accommodation type is a unique part of the Irish tourism offering and an important part of the overall tourism accommodation ecosystem.  I am aware of the genuine concerns regarding the impacts on rural tourism and local economies, and on traditional bed and breakfasts specifically, of removing a significant cohort of properties from the STL market. However, meeting local housing need across Ireland is a critically important consideration and Government must use every lever available to assist in providing homes for our people, including returning properties to the long-term residential market.  My Department will consider the full implications for the Tourism sector as we await the publication of the National Planning Statement for STL by the Minister for Housing, Local Government and Heritage. ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "debateSection": {
          "showAs": "Legislative Measures",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-08/writtens/dbsect_274",
          "debateSectionId": "dbsect_274",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-08/writtens/mul@/dbsect_274.xml"
            },
            "pdf": null
          }
        },
        "showAs": " 366. Deputy Jennifer Murnane O'Connor asked the Minister for Enterprise, Tourism and Employment the protections that will be in place for family home bed and breakfasts as part of the short-term letting legislation currently being considered (details supplied); and if he will make a statement on the matter. [37430/25] ",
        "questionType": "written",
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        }
      }
    },
    {
      "question": {
        "house": {
          "houseNo": "34",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil"
        },
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "questionNumber": 69,
        "showAs": " 69. Deputy Jennifer Murnane O'Connor asked the Minister for Education and Youth for an update on the application for a new school building (details supplied). [32878/25] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-18/pq_69",
        "debateSection": {
          "debateSectionId": "dbsect_112",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-18/writtens/dbsect_112",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-18/writtens/mul@/dbsect_112.xml"
            },
            "pdf": null
          },
          "showAs": "Departmental Inquiries"
        },
        "answerText": " Minister for Education and Youth  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan (NDP), involving the completion of over 1,375 school building projects. Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. A recent Government decision has approved €210m supplementary capital funding for my department to support the provision of special education accommodation and meet school place needs. This brings the total capital allocation for 2025 for my department to €1.6bn.As part of the NDP Review process, all departments, including my department, are currently engaging with the Department of Public Expenditure, NDP Delivery and Reform with respect to NDP allocations for the period 2026-2030. It is expected that there will be clarity on these allocations over the course of the summer period, and this will allow my department to plan its capital investment programme for the 2026 to 2030 period in line with prioritised needs and reflecting, as appropriate, wider Government priorities. Maximising existing capacity in schools to meet needs is very important. The progression of prioritised individual projects to meet the most urgent needs in the 2026 to 2030 period that cannot be met through existing capacity across schools in the local area will be considered on a rolling basis from Autumn onwards after the NDP allocations are finalised. My Department will engage directly with the school authority in this context. ",
        "date": "2025-06-18"
      },
      "contextDate": "2025-06-18"
    },
    {
      "question": {
        "house": {
          "houseNo": "34",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil"
        },
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "questionNumber": 71,
        "showAs": " 71. Deputy Jennifer Murnane O'Connor asked the Minister for Education and Youth for an update on the installation of additional accommodation at a school (details supplied). [32909/25] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-18/pq_71",
        "debateSection": {
          "debateSectionId": "dbsect_114",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-18/writtens/dbsect_114",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-18/writtens/mul@/dbsect_114.xml"
            },
            "pdf": null
          },
          "showAs": "School Accommodation"
        },
        "answerText": " Minister for Education and Youth  The school to which the deputy refers has been granted capital funding under my Department’s SEN Reconfiguration and Modular Accommodation programme for the provision of the Reconfiguration of existing accommodation for two special educational needs classrooms and Reconfiguration works of a protected structure to provide two mainstream classrooms.  This programme involves the use of Project Management supports which is designed to enable the accommodation to be provided as quickly as possible and help ease the administrative workload for school authorities in relation to the management and delivery of projects.  Kerrigan Sheanon Newman Project Management (KSN) has been appointed, from my Department’s Framework, to design and tender the project and oversee all elements of construction. The first tranche of funding (45%) was released to the school authority in May 2024. A contractor has been assigned from the Department's framework and enabling works are due to commence on-site shortly.  My Department is fully aware of the urgency in respect of this accommodation and will be working closely with the project managers and the school authority to keep it updated on overall project delivery and timelines ",
        "date": "2025-06-18"
      },
      "contextDate": "2025-06-18"
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_10",
        "answerText": " The Taoiseach  I propose to take Questions Nos. 10 and 11 together.  The Department of the Taoiseach is supportive of staff availing of special leave or career breaks to take up roles within the European Institutions. Circular 04/2013 sets out the career break scheme for the civil service and is available to all eligible staff in the Department and in the National Economic and Social Development Office (NESDO), the only body under the aegis of the Department.  Several opportunities are available for staff at the Department of the Taoiseach, including the Seconded National Expert (SNE) vacancies for positions in the European Commission which are administered by the Department of Foreign Affairs. Notices of these vacancies are posted on the Department’s intranet site monthly. The National Experts in Professional Training (NEPT) programme is a bi-annual training scheme where serving civil and public servants have an opportunity to work in the European Commission for a period of three to five months. This programme is also administered by the Department of Foreign Affairs and circulated to staff working in the Department of the Taoiseach and NESDO. These programmes provide officials with a first-hand experience of working in the European Commission. The Department has one staff member currently seconded to the European Commission. The National Economic and Social Development Office has no staff on special leave/career break during the period in question.  The Department is currently awaiting the publication of the first of two action plans for the National Plan for Irish Language Public Services which it will engage with fully. The Department will continue to fulfil its obligations under the Official Languages Act following the final provisions of the Official Languages (Amendment) Act 2021 which came into effect on 21 December 2024. ",
        "to": {
          "uri": null,
          "showAs": "Taoiseach",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 10. Deputy Jennifer Murnane O'Connor asked the Taoiseach the measures his Department is taking to encourage civil servants in his Department to take or avail of special leave or career breaks or other forms of leave to encourage and facilitate Ireland's 2026 EU Presidency, the Government \"Career for EU\" jobs strategy, and the Department's Gaeilge-Irish language policy and promotion; and if he will make a statement on the matter. [2498/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_31",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_31.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_31",
          "showAs": "Departmental Staff"
        },
        "questionNumber": 10,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_11",
        "answerText": " The Taoiseach  I propose to take Questions Nos. 10 and 11 together.  The Department of the Taoiseach is supportive of staff availing of special leave or career breaks to take up roles within the European Institutions. Circular 04/2013 sets out the career break scheme for the civil service and is available to all eligible staff in the Department and in the National Economic and Social Development Office (NESDO), the only body under the aegis of the Department.  Several opportunities are available for staff at the Department of the Taoiseach, including the Seconded National Expert (SNE) vacancies for positions in the European Commission which are administered by the Department of Foreign Affairs. Notices of these vacancies are posted on the Department’s intranet site monthly. The National Experts in Professional Training (NEPT) programme is a bi-annual training scheme where serving civil and public servants have an opportunity to work in the European Commission for a period of three to five months. This programme is also administered by the Department of Foreign Affairs and circulated to staff working in the Department of the Taoiseach and NESDO. These programmes provide officials with a first-hand experience of working in the European Commission. The Department has one staff member currently seconded to the European Commission. The National Economic and Social Development Office has no staff on special leave/career break during the period in question.  The Department is currently awaiting the publication of the first of two action plans for the National Plan for Irish Language Public Services which it will engage with fully. The Department will continue to fulfil its obligations under the Official Languages Act following the final provisions of the Official Languages (Amendment) Act 2021 which came into effect on 21 December 2024. ",
        "to": {
          "uri": null,
          "showAs": "Taoiseach",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 11. Deputy Jennifer Murnane O'Connor asked the Taoiseach the number of requests to his Department, including the Office of the Attorney General and Government agencies, that have granted requests for various matters (details supplied); the number of such requests that have been refused; and the grounds on which they have been refused. [2499/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_31",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_31.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_31",
          "showAs": "Departmental Staff"
        },
        "questionNumber": 11,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_23",
        "answerText": " Minister for Foreign Affairs (Deputy Simon Harris)  I propose to take Questions Nos. 23 and 55 together.  Secondments within the civil service are subject to the principles outlined in the Civil Service Secondments Policy and ‘Circular 27/2021: Secondment Policy for the Civil Service’. Moreover, in 2022, the Department of Foreign Affairs adopted a ‘Secondments Policy’ which maintains the Department’s commitment to supporting strategically targeted secondments and other temporary reassignment opportunities outside the Department. The Policy recognises the value these opportunities offer to build the Department’s capacity to deliver its objectives.  There are currently seven officers from my Department on special leave to work at EU institutions. These officers are availing of special leave arrangements as outlined in ‘Circular 33/1991: Special leave without pay to take up an appointment with institution of the European Communities or other international organisation of which Ireland is a member’.  In addition, six officers from the Department of Foreign Affairs are currently Seconded National Experts (SNEs) at EU Institutions, including in posts that are of strategic value for Ireland’s upcoming Presidency of the Council of the European Union. Seconded National Experts (SNEs) provide EU and international institutions with specialised expertise from Member States' administrations, while fostering knowledge exchange with national authorities. SNEs must come from Government Departments or public sector bodies. These Secondments are typically two years, and can be extended for up to four years.  Furthermore, as part of the Department’s planning for Ireland’s Presidency of the Council of the European Union in 2026 there is currently one officer seconded to the Federal Foreign Office of Germany in Berlin, and one officer seconded to the Ministry for Europe and Foreign Affairs of France in Paris. The Department is continuing to identify and prioritise secondment opportunities for officers in the Department of Foreign Affairs both in EU institutions, and other international organisations of importance to Ireland in advance of Ireland’s Presidency of the Council of the European Union in 2026.  Under the \"A Career for EU\" strategy, the Government increased funding for the Centrally Funded Scheme to support 50 Irish civil servants annually in EU Institutions, up from 24 in May 2021. Administered by the Department of Foreign Affairs, this scheme allows Departments to recoup costs for strategically seconded officers and hence backfill positions vacated at home. Funding was €3.5 million for 2023 and €4 million for 2024. In the course of 2024, 47 SNEs were supported under the Centrally Funded Scheme, with 39 of these in place in December 2024. The objective under the strategy is to support 50 SNEs annually and we will continue to work towards this goal. The scheme does not replace individual Departments’ own funding of SNEs but rather adds to Ireland’s existing efforts to strategically place people in EU and other international organisations.  I am not aware of any Department of Foreign Affairs officials who are availing of career breaks or special leave in order to promote the Irish language. The Department does support a number of officers to undertake Irish language classes each year. Currently 14 officers are enrolled in Irish language training classes. More generally, officials of my Department are engaged in a wide range of activities across the world that promote the Irish language. ",
        "to": {
          "uri": null,
          "showAs": "Foreign",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 23. Deputy Jennifer Murnane O'Connor asked the Tánaiste and Minister for Foreign Affairs the number of requests to his Department that were granted for various matters (details supplied); the number of such requests that have been refused; and the grounds on which they were refused. [2499/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_38",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_38.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_38",
          "showAs": "Departmental Staff"
        },
        "questionNumber": 23,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_55",
        "answerText": " Minister for Foreign Affairs (Deputy Simon Harris)  I propose to take Questions Nos. 23 and 55 together.  Secondments within the civil service are subject to the principles outlined in the Civil Service Secondments Policy and ‘Circular 27/2021: Secondment Policy for the Civil Service’. Moreover, in 2022, the Department of Foreign Affairs adopted a ‘Secondments Policy’ which maintains the Department’s commitment to supporting strategically targeted secondments and other temporary reassignment opportunities outside the Department. The Policy recognises the value these opportunities offer to build the Department’s capacity to deliver its objectives.  There are currently seven officers from my Department on special leave to work at EU institutions. These officers are availing of special leave arrangements as outlined in ‘Circular 33/1991: Special leave without pay to take up an appointment with institution of the European Communities or other international organisation of which Ireland is a member’.  In addition, six officers from the Department of Foreign Affairs are currently Seconded National Experts (SNEs) at EU Institutions, including in posts that are of strategic value for Ireland’s upcoming Presidency of the Council of the European Union. Seconded National Experts (SNEs) provide EU and international institutions with specialised expertise from Member States' administrations, while fostering knowledge exchange with national authorities. SNEs must come from Government Departments or public sector bodies. These Secondments are typically two years, and can be extended for up to four years.  Furthermore, as part of the Department’s planning for Ireland’s Presidency of the Council of the European Union in 2026 there is currently one officer seconded to the Federal Foreign Office of Germany in Berlin, and one officer seconded to the Ministry for Europe and Foreign Affairs of France in Paris. The Department is continuing to identify and prioritise secondment opportunities for officers in the Department of Foreign Affairs both in EU institutions, and other international organisations of importance to Ireland in advance of Ireland’s Presidency of the Council of the European Union in 2026.  Under the \"A Career for EU\" strategy, the Government increased funding for the Centrally Funded Scheme to support 50 Irish civil servants annually in EU Institutions, up from 24 in May 2021. Administered by the Department of Foreign Affairs, this scheme allows Departments to recoup costs for strategically seconded officers and hence backfill positions vacated at home. Funding was €3.5 million for 2023 and €4 million for 2024. In the course of 2024, 47 SNEs were supported under the Centrally Funded Scheme, with 39 of these in place in December 2024. The objective under the strategy is to support 50 SNEs annually and we will continue to work towards this goal. The scheme does not replace individual Departments’ own funding of SNEs but rather adds to Ireland’s existing efforts to strategically place people in EU and other international organisations.  I am not aware of any Department of Foreign Affairs officials who are availing of career breaks or special leave in order to promote the Irish language. The Department does support a number of officers to undertake Irish language classes each year. Currently 14 officers are enrolled in Irish language training classes. More generally, officials of my Department are engaged in a wide range of activities across the world that promote the Irish language. ",
        "to": {
          "uri": null,
          "showAs": "Foreign",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 55. Deputy Jennifer Murnane O'Connor asked the Tánaiste and Minister for Foreign Affairs the measures his Department is taking to encourage civil servants in his Department to take or avail of special leave or career breaks or other forms of leave to encourage and facilitate Ireland's 2026 EU Presidency, the Government \"Career for EU\" jobs strategy, and the Department's Gaeilge-Irish language policy and promotion; and if he will make a statement on the matter. [3935/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_38",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_38.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_38",
          "showAs": "Departmental Staff"
        },
        "questionNumber": 55,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_56",
        "answerText": " Minister for the Environment, Climate and Communications (Deputy Darragh O'Brien)  I can confirm to the Deputy that my Department has approved Special Leave for one civil servant to avail of an appointment to an EU or International Organisation. The approval was granted in 2022 and will cover 2024.  My Department has no record of approving a career break for any civil servant to take up an EU post in 2024.  My Department has no record of refusing a request from an civil servant to take up an EU post via special leave/career break in 2024. ",
        "to": {
          "uri": null,
          "showAs": "Environment",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 56. Deputy Jennifer Murnane O'Connor asked the Minister for the Environment, Climate and Communications the number of requests to his Department that have been granted for various matters (details supplied); the number of such requests that were refused; and the grounds on which they were refused.  [2499/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_69",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_69.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_69",
          "showAs": "Departmental Data"
        },
        "questionNumber": 56,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_104",
        "answerText": " Minister for the Environment, Climate and Communications (Deputy Darragh O'Brien)  I can confirm to the Deputy that my Department has no special initiatives relating to leave of the type outlined in the Question at present but my Department continues to prepare for the upcoming Presidency. The available types of leave are mandated by circulars issued by the Department for Public Expenditure, NDP Delivery and Reform. ",
        "to": {
          "uri": null,
          "showAs": "Environment",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 104. Deputy Jennifer Murnane O'Connor asked the Minister for the Environment, Climate and Communications the measures his Department is taking to encourage civil servants in his Department to take or avail of special leave or career breaks, or other forms of leave to encourage and facilitate Ireland's 2026 EU Presidency, the Government \"Career for EU\" jobs strategy, and the Department's Gaeilge-Irish language policy and promotion; and if he will make a statement on the matter. [3940/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_109",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_109.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_109",
          "showAs": "Departmental Staff"
        },
        "questionNumber": 104,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_105",
        "answerText": "",
        "to": {
          "uri": null,
          "showAs": "Defence",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 105. Deputy Jennifer Murnane O'Connor asked the Tánaiste and Minister for Defence the number of requests to his Department that have been granted for various matters (details supplied); the number of such requests that were refused; and the grounds on which they have were refused. [2499/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_110",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_110.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_110",
          "showAs": "Departmental Data"
        },
        "questionNumber": 105,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_133",
        "answerText": " Tánaiste and Minister for Defence  Preparations in my Department for the 2026 EU Presidency have already begun. My Department will be leading on matters related to the Defence sector and this will involve significant work both for those based in the Permanent Representation of Ireland to the EU in Brussels and for those based in Ireland. As part of workforce planning, my Department has sought initial expressions of interest from all grades across the Department who would be interested in being involved in work related to the EU Presidency.  In relation to facilitating civil servants in my Department to take or avail of special leave or career breaks, to encourage and facilitate Ireland's 2026 EU Presidency, special unpaid leave may be availed of under the provisions of Circular 33/1991 in order to serve with the EU and up to five years unpaid leave to serve with an international organisation of which Ireland is a member. Special leave to serve with the EU may be granted for a maximum of ten years or up to the minimum retiring age, whichever is the shorter.  Ireland's 'A Career for EU' strategy sets out a series of measures that aim to significantly increase the number of Irish officials in both permanent and temporary positions within the EU Institutions. My Department currently provides a number of staff that are based and working in the Permanent Representation in Brussels to support Ireland's engagement in the EU's Common Security and Defence Policy and the related EU institutions, including the European External Action Security, the European Defence Agency and the European Commission. To this end, officials from the Department are assigned to the Political and Security Committee (PSC) delegation within the Permanent Representation of Ireland to the European Union. A number of the staff also, as part of their role, support Ireland's engagement in NATO Partnership for Peace through the PfP Liaison Office in Brussels.  The National Experts in Professional Training (NEPT) programme is a bi-annual training scheme and provides officials with a first-hand experience of working in the European Commission. The skills and experiences acquired by Irish officials during their traineeship also have the potential to benefit Departments and facilitate greater understanding about the functioning of the European institutions. Participation in the programme is also in line with the Government’s overall EU engagement strategy including that of raising the numbers of Irish officials serving in the EU Institutions, and this Department regularly encourages officials to apply for placement when the opportunity arises. My Department also facilitates secondments under the Seconded National Expert (SNE) programme when vacancies for positions in the European Commission arise.  The Department of Defence is committed to fulfilling the obligations set out in the Official Languages Act, 2003 and the Official Languages (Amendment) Act, 2021, with regard to the level of service provided through Irish. In 2023, the Department appointed a member of staff from senior management to oversee the performance of, and report to the Head of the Department in relation to, its obligations under the Official Languages (Amendment) Act, 2021. In addition to meeting the Department’s commitments, staff received training at various skills levels to improve the provision of public services through the medium of Irish. The Department will continue to ensure that these provisions are met. ",
        "to": {
          "uri": null,
          "showAs": "Defence",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 133. Deputy Jennifer Murnane O'Connor asked the Tánaiste and Minister for Defence the measures his Department is taking to encourage civil servants in his Department to take or avail of special leave or career breaks, or other forms of leave to encourage and facilitate Ireland's 2026 EU Presidency, the Government \"Career for EU\" jobs strategy, and the Department's Gaeilge-Irish language policy and promotion; and if he will make a statement on the matter. [3943/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_134",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_134.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_134",
          "showAs": "Departmental Staff"
        },
        "questionNumber": 133,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_134",
        "answerText": " Minister for Transport (Deputy Darragh O'Brien)  My Department granted one request in 2024 to take up a temporary post in an EU Institution. My Department has not refused any such requests in 2024. ",
        "to": {
          "uri": null,
          "showAs": "Transport",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 134. Deputy Jennifer Murnane O'Connor asked the Minister for Transport the number of requests to his Department that were granted for various matters (details supplied); the number of such requests that have been refused; and the grounds on which they have were refused. [2499/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_136",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_136.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_136",
          "showAs": "Departmental Staff"
        },
        "questionNumber": 134,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_246",
        "answerText": " Minister for Transport  My Department regularly promotes roles for staff that are available in EU Institutions which will help facilitate Ireland's 2026 EU presidency, by advertising relevant roles internally. Currently there are 10 Department of Transport staff seconded to the Permanent Representation and to the EU institutions. Staff are encouraged to apply for positions in the EU Institutions and have been granted leave to take such roles.  In 2024 the Department's Human Resources Division in conjunction with the Department's EU & International Division launched an EU Orientation Programme. This programme provides attendees with a deeper understanding of the workings of the European Council, European Commission and European Parliament as well as Ireland’s Permanent Representation to the EU. It will also provide an insight as to what the upcoming 2026 Irish EU Presidency will entail.  Members of our HR team also attend Inter-Departmental meetings on Staffing in EU and International Organisations (IDC) on a quarterly basis to network and connect on postings in the EU. ",
        "to": {
          "uri": null,
          "showAs": "Transport",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 246. Deputy Jennifer Murnane O'Connor asked the Minister for Transport the measures his Department is taking to encourage civil servants in his Department to take or avail of special leave or career breaks, or other forms of leave to encourage and facilitate Ireland's 2026 EU presidency, the Government \"Career for EU\" jobs strategy, and the Department's Gaeilge/Irish-language policy and promotion; and if he will make a statement on the matter. [3945/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_244",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_244.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_244",
          "showAs": "Departmental Staff"
        },
        "questionNumber": 246,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_310",
        "answerText": " Minister for Public Expenditure, National Development Plan Delivery and Reform  I wish to advise the Deputy that my Department has not granted or refused any requests of the nature specified in the details supplied with the Question. ",
        "to": {
          "uri": null,
          "showAs": "Public Expenditure",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 310. Deputy Jennifer Murnane O'Connor asked the Minister for Public Expenditure, National Development Plan Delivery and Reform the number of requests to his Department that have granted for various matters (details supplied); the number of such requests that have been refused; and the grounds on which they have been refused. [2499/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_301",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_301.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_301",
          "showAs": "Departmental Data"
        },
        "questionNumber": 310,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_360",
        "answerText": " Minister for Public Expenditure, National Development Plan Delivery and Reform  My Department is supporting the whole of Government approach, led by the Department of Foreign Affairs and Trade (DFAT), to planning for Ireland’s Presidency of the EU in 2026.  The Department supported the negotiations and agreement with the Commission last year on Ireland’s Action Plan on Geographical Balance to encourage more entrants at entry grades and increase the number of candidates from under-represented States. The actions in Ireland’s plan will be carried out by DFAT as part of the implementation of their EU Careers Strategy, A Career for EU.  The Deputy may wish to be aware that an EU Network was established in the Department last year promote a greater understanding of the growing EU footprint and highlight the Department’s work in these areas.  The opportunities for staff in the EU Institutions and the OECD has been raised in this context.  The Department will also continue to circulate all opportunities advertised to staff for EU and other relevant postings. This will ensure that all staff have the opportunity to apply for such postings, thereby encouraging and facilitating Ireland's 2026 EU presidency, the Career for EU jobs strategy and Irish-language policy and promotion. ",
        "to": {
          "uri": null,
          "showAs": "Public Expenditure",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 360. Deputy Jennifer Murnane O'Connor asked the Minister for Public Expenditure, National Development Plan Delivery and Reform the measures his Department is taking to encourage civil servants in his Department to take or avail of special leave or career breaks, or other forms of leave to encourage and facilitate Ireland's 2026 EU presidency, the Government \"Career for EU\" jobs strategy, and the Department's Gaeilge/Irish-language policy and promotion; and if he will make a statement on the matter. [3954/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_342",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_342.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_342",
          "showAs": "Departmental Staff"
        },
        "questionNumber": 360,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_361",
        "answerText": " Minister for Enterprise, Trade and Employment (Deputy Peter Burke)  The policy in my Department, is to release staff on secondment to work in the EU institutions to facilitate Ireland’s 2026 EU Presidency. We do not regard this as special leave or career break and we have not refused any requests in this regard in 2024. 1 officer requested and was granted a career break to support their partner in taking up a post in the EU.  My department actively encourages staff to apply for posts in the EU and in 2024, 3 officers joined the EU Affairs and Presidency Planning Unit in my Department. Also in 2024, 2 officers were seconded to the Permanent Representation of Ireland to the EU in Brussels and 2 officers were seconded to the Permanent Mission of Ireland to The United Nations, Geneva.  In 2024, my Department ran two internal competitions at Assistant Principal and Higher Executive Officer/Administrative Officer grade to increase the Departments presence in the Permanent Representation of Ireland to the EU in Brussels (PRB) in the lead up to the 2026 presidency where two panels were established at the respective grades. 4 senior positions have already been filled with the deployment of 4 Assistant Principal Officers on the 27th of Jan. The remaining panellists (3 Assistant Principals, 1 Higher Executive Officer & 2 Administrative Officers) are to be assigned to their new posts in the PRB in the Summer of 2025.  In regards to the Government \"Career for EU\" jobs strategy and in line with the strategies aim to increase the number of Irish officials in both permanent and temporary positions within the EU Institutions, my Department have ensured that all departmental staff are made aware of the career opportunities available to them via the Seconded National Experts (SNE) vacancies, where these vacancies closely align with the strategic relevance of my departments remit. In 2024, 1 officer in my department was seconded to an SNE post in the EU Commission. ",
        "to": {
          "uri": null,
          "showAs": "Enterprise",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 361. Deputy Jennifer Murnane O'Connor asked the Minister for Enterprise, Trade and Employment the number of requests to his Department that were granted for various matters (details supplied); the number of such requests that have been refused; and the grounds on which they have were refused. [2499/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_344",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_344.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_344",
          "showAs": "Departmental Staff"
        },
        "questionNumber": 361,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_403",
        "answerText": " Minister for Enterprise, Trade and Employment  The policy in my Department, is to release staff on secondment to work in the EU institutions to facilitate Ireland’s 2026 EU Presidency. We do not regard this as special leave or career break.  In 2024, my Department ran two internal competitions at Assistant Principal and Higher Executive Officer/Administrative Officer grade to increase the Departments presence in the Permanent Representation of Ireland to the EU in Brussels (PRB) in the lead up to the 2026 presidency where two panels were established at the respective grades. 4 senior positions have already been filled with the deployment of 4 Assistant Principal Officers on the 27th of Jan. The remaining panellists (3 Assistant Principals, 1 Higher Executive Officer & 2 Administrative Officers) are to be assigned to their new posts in the PRB in the Summer of 2025.  In regards to the Government \"Career for EU\" jobs strategy and in line with the strategies aim to increase the number of Irish officials in both permanent and temporary positions within the EU Institutions, my Department have ensured that all departmental staff are made aware of the career opportunities available to them via the Seconded National Experts (SNE) vacancies, where these vacancies closely align with the strategic relevance of my departments remit.  The final provisions of the Official Languages (Amendment) Act 2021 came into effect on 21 December 2024. My Department is fully committed to the Official Languages (Amendment) Act 2021. A member of Senior Management at Principal Officer level has been appointed to oversee performance and report on the Department’s obligations under the Official Languages Acts and will continue to keep staff informed as new provisions are implemented.  My Department is currently preparing a statutory return in line with the new obligations under section 10A (Advertising by Public Bodies) requiring a minimum of 20% of all advertising undertaken to be in the Irish language and that 5% of annual advertising spend on Irish language.  In order to ensure that my Department is accessible and capable of engaging with all customers proficiently, Irish Language Training is provided by the Learning and Development Unit through OneLearning, the Civil Service Language and Development Centre. This training is being delivered to ensure that my Department has a cohort of staff who can assist business units to respond to clients who may wish to communicate through the medium of Irish.  The Gaeilge Section is continuously looking at ways in which my Department can promote the Irish language across my Department informally and we reach out to our colleagues for new suggestions/feedback.   Promoting the use of the Irish language in DETE   • DETE staff volunteer their Irish language services to assist my Department conduct its business through Irish by translating short documents/letters and accepting telephone calls in Irish. There are currently eight such volunteers.  • DETE have contracted a reputable outside provider for Irish language translations ensuring a quality translation service is readily available.  • To coincide with the Seachtain na Gaeilge festival week, DETE promotes the calendar of events and also runs a number of social events in DETE through the Irish language.  • DETE’s Learning and Development Unit offers accredited Irish language training to all staff.  • DETE’s informal social events include virtual tea breaks and an annual Christmas table quiz run through Irish. The objective is to provide staff with an opportunity to enhance their Irish language skills in an informal, non-classroom, environment.  My Department is a client of Gaelchultúr; the largest provider of Irish language courses worldwide. Gaelchultúr is committed to promoting the use of Irish and to the development of improved language services while offering several training courses designed specifically for Public Sector bodies. My Department’s Learning and Career Development Unit works closely with Gaelchultúr to ensure timely promotion of courses and highly encourages participation among staff members. The Learning and Career Development Unit also promotes extra-curricular activities such as Gaeltacht attendance, as appropriate.  My Department continues to be committed to providing a quality service to the public through the medium of the Irish language having regard to the demand for services in Irish. My Department’s internal Customer Service Unit has responsibility for promotion of the Official Languages Act and regularly holds information sessions to raise awareness and compliance with same. The Customer Service Unit also regularly holds informal events for staff who wish to converse via the Irish Language. ",
        "to": {
          "uri": null,
          "showAs": "Enterprise",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 403. Deputy Jennifer Murnane O'Connor asked the Minister for Enterprise, Trade and Employment the measures his Department is taking to encourage civil servants in his Department to take or avail of special leave or career breaks, or other forms of leave to encourage and facilitate Ireland's 2026 EU presidency, the Government \"Career for EU\" jobs strategy, and the Department's Gaeilge/Irish-language policy and promotion; and if he will make a statement on the matter. [3934/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_381",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_381.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_381",
          "showAs": "Departmental Staff"
        },
        "questionNumber": 403,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_404",
        "answerText": " Minister for Education  I propose to take Questions Nos. 404 and 527 together.  Delivering a successful Presidency of the Council of the European Union (EU) from July to December 2026 requires extensive preparatory work and significant resources. An important element of this is to ensure that there are sufficient staffing resources in place, both in Dublin and in Brussels at the Permanent Representation to the EU, to enable us to prepare and deliver a high-quality Education Presidency together and to manage its implementation.  The Department of Education is currently establishing the resource requirements, including our staffing needs arising from the EU Presidency role. The Presidency team in the Department of Education is being led by the International Unit along with the Education Attaché in the Permanent Representation of Ireland to the EU. This team has been engaged with the EU Presidency central planning process that is being coordinated by the Department of Foreign Affairs which includes discussion on staffing requirements. In addition, discussions are ongoing between the Presidency team and the Human Resources (HR) Unit of this department on the resourcing requirements associated with the EU Presidency.  Since 2024, no applications have been made for special leave or career breaks to facilitate Ireland's 2026 EU presidency, the Career for EU jobs strategy, the Gaeilge/Irish-language policy or to accompany a spouse to take up a temporary post in an EU institution. Where such applications are made, these will be given favourable consideration in line with central policies on special leave/career breaks for civil servants, the business needs of the department, career development opportunities for staff members and of course wider Government priorities. ",
        "to": {
          "uri": null,
          "showAs": "Education",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 404. Deputy Jennifer Murnane O'Connor asked the Minister for Education the number of requests to her Department that were granted for various matters (details supplied); the number of such requests that have been refused; and the grounds on which they have were refused. [2499/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_382",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_382.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_382",
          "showAs": "Departmental Staff"
        },
        "questionNumber": 404,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_527",
        "answerText": " Minister for Education  I propose to take Questions Nos. 404 and 527 together.  Delivering a successful Presidency of the Council of the European Union (EU) from July to December 2026 requires extensive preparatory work and significant resources. An important element of this is to ensure that there are sufficient staffing resources in place, both in Dublin and in Brussels at the Permanent Representation to the EU, to enable us to prepare and deliver a high-quality Education Presidency together and to manage its implementation.  The Department of Education is currently establishing the resource requirements, including our staffing needs arising from the EU Presidency role. The Presidency team in the Department of Education is being led by the International Unit along with the Education Attaché in the Permanent Representation of Ireland to the EU. This team has been engaged with the EU Presidency central planning process that is being coordinated by the Department of Foreign Affairs which includes discussion on staffing requirements. In addition, discussions are ongoing between the Presidency team and the Human Resources (HR) Unit of this department on the resourcing requirements associated with the EU Presidency.  Since 2024, no applications have been made for special leave or career breaks to facilitate Ireland's 2026 EU presidency, the Career for EU jobs strategy, the Gaeilge/Irish-language policy or to accompany a spouse to take up a temporary post in an EU institution. Where such applications are made, these will be given favourable consideration in line with central policies on special leave/career breaks for civil servants, the business needs of the department, career development opportunities for staff members and of course wider Government priorities. ",
        "to": {
          "uri": null,
          "showAs": "Education",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 527. Deputy Jennifer Murnane O'Connor asked the Minister for Education the measures her Department is taking to encourage civil servants in her Department to take or avail of special leave or career breaks, or other forms of leave to encourage and facilitate Ireland's 2026 EU Presidency, the Government \"Career for EU\" jobs strategy, and the Department's Gaeilge-Irish language policy and promotion; and if she will make a statement on the matter. [3953/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_382",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_382.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_382",
          "showAs": "Departmental Staff"
        },
        "questionNumber": 527,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_528",
        "answerText": " Minister for Tourism, Culture, Arts, Gaeltacht, Sport and Media  In 2024, the Department approved one application to extend an officer's special leave to work in translation services in the EU.  No applications from officers were refused in respect special leave, careers breaks to civil servants and/or their spouses to take up temporary posts in EU institutions during 2024.  My Department supports the Government initiative \"A Career for EU”, Ireland’s strategy to increase Irish representation in the European Union's Institutions and Agencies. In doing so, my Department continues to promote and advertise opportunities to staff to Seconded National Expert positions and National Expert in Professional Training scheme opportunities.  During 2024, 11 interns were in positions under the Internship Scheme in European Union Institutions administered by the Department in co-operation with the European Commission, the European Parliament, the European Council, the Committee of the Regions and the Publications Office. The scheme is focused on the provision of opportunities for graduates to acquire work placements in the special subject field of translation and proof-reading. ",
        "to": {
          "uri": null,
          "showAs": "Tourism",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 528. Deputy Jennifer Murnane O'Connor asked the Minister for Tourism, Culture, Arts, Gaeltacht, Sport and Media the number of requests to his Department that were granted for various matters (details supplied); the number of such requests that have been refused; and the grounds on which they were been refused.  [2499/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_494",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_494.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_494",
          "showAs": "Departmental Staff"
        },
        "questionNumber": 528,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_554",
        "answerText": " Minister for Tourism, Culture, Arts, Gaeltacht, Sport and Media  Preparations for Ireland’s Presidency have commenced in this Department with officials from the Department attending Inter-Departmental Groups on Presidency Policy Planning and Operational Presidency Planning.  This Department supports the Government initiative \"A Career for EU”, Ireland’s strategy to increase Irish representation in the European Union's Institutions and Agencies. The Department currently has two officers in EU Attaché roles seconded to the Department of Foreign Affairs who are serving in the Permanent Representative, Brussels. Additionally, the Department has a Seconded National Expert currently serving in DG Cultural Policy Unit in European Commission and one officer is availing of special leave to work in EU translation services.  Officials from my Department regularly attend the Inter-Departmental Committee on Staffing in EU and International Organisations and continue to promote and advertise opportunities across the Department for Seconded National Expert positions and the National Expert in Professional Training scheme.  In support of the objectives outlined in the overarching 20 Year Strategy for the Irish Language 2010-2030, various national language strategies and initiatives have been developed and initiated to promote and encourage the use of the Irish language, in the European context. The Digital Plan for the Irish Language 2023-2027 aligns with the priorities of the European Union in terms of the digital transition and provides an overview of the research required to make Irish-language linguistic resources available in the coming years.  The Department supports funding for Irish language courses in third-level institutions in Ireland and a dedicated fund to support the development of Irish language courses in third-level institutions overseas.  Additionally, the Department provides funding for terminology and technology initiatives operated by Fiontar and Scoil na Gaeilge, DCU.  The Internship Scheme in European Union Institutions is administered by the Department in co-operation with the European Commission, the European Parliament, the European Council, the Committee of the Regions and the Publications Office. The scheme is focused on the provision of opportunities for graduates to acquire work placements in the special subject field of translation and proof-reading.  The National Centre of Excellence for Careers in the EU plays a key role in having a coordinated approach to the education of students wishing to work in the EU institutions. The Centre, with the support of the Department, has translated the EPSO (European Personnel Selection Office) manual entitled ‘The Ultimate EU Test Book Administrators 2020’ into Irish. This handbook is particularly useful for candidates who wish to apply for future EPSO competitions. The Department has provided €32,790 for this project.  The ‘Aistritheoirí Óga' (Young Translators) translation competition is organised jointly by the Department and the European Commission each year. The competition has three goals: to promote a high standard of Irish, to encourage multilingualism among secondary school students and to encourage their interest in careers with Irish. The 2025 competition will take place on the 6th March 2025.  In conjunction with DG Translation of the EU Commission, the Department holds an annual seminar focusing on employment opportunities with the Irish language in the EU institutions. This event is held as part of the Oireachtas na Samhna cultural festival each year at the beginning of November and includes hands-on training from experts in fields such as translation and conference interpreting as well as presentations on aspects of the professions concerned and on life for Irish people who live and work in Brussels and Luxembourg. ",
        "to": {
          "uri": null,
          "showAs": "Tourism",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 554. Deputy Jennifer Murnane O'Connor asked the Minister for Tourism, Culture, Arts, Gaeltacht, Sport and Media the measures his Department is taking to encourage civil servants in his Department to take or avail of special leave or career breaks, or other forms of leave, to encourage and facilitate Ireland's 2026 EU presidency, the Government \"Career for EU\" jobs strategy, and the Department's Gaeilge/Irish-language policy and promotion; and if he will make a statement on the matter. [3941/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_520",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_520.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_520",
          "showAs": "Departmental Staff"
        },
        "questionNumber": 554,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_555",
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy James Browne)  I propose to take Questions Nos. 555 and 632 together.  My Department is committed to staff development and promotes several EU related programmes each year. Staff are encouraged to apply for opportunities in the EU through the National Experts in Professional Training (NEPT) and Seconded National Experts (SNE) programmes as well as the shorter Erasmus for Officials programme. These roles are generally facilitated through special paid leave as the EU experience gained by officials is invaluable to my Department, particularly as Ireland's EU Presidency draws closer. My Department currently has two participants working in the European Commission under the SNE programme and one more staff member who is availing of special leave as their partner is working on an overseas DFA posting. A staff member who was on Special Leave while working in the European Commission's translation directorate took up a permanent role there in late 2024.  My Department has not refused any requests for special leave for these purposes.  My Department has a wide range of EU related policy areas and we look forward to playing a full and active role in the 2026 EU Presidency. Staff will be given every opportunity to get involved in the appropriate ways in the run up to and the duration of the Presidency.  My Department's training unit, through the One-Learning portal, offers training classes in professional Irish to staff during working hours. In addition my Department has assigned an Irish Language Officer and a single point of contact to conduct awareness campaigns to help staff understand their obligations under the Official Languages Act, and to encourage staff to speak the language through comhrá Gaeilge groups and cultural events. ",
        "to": {
          "uri": null,
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 555. Deputy Jennifer Murnane O'Connor asked the Minister for Housing, Local Government and Heritage the number of requests to his Department that have been granted for various matters (details supplied); the number of such requests that have been refused; and the grounds on which they have been refused. [2499/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_521",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_521.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_521",
          "showAs": "Departmental Staff"
        },
        "questionNumber": 555,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_632",
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy James Browne)  I propose to take Questions Nos. 555 and 632 together.  My Department is committed to staff development and promotes several EU related programmes each year. Staff are encouraged to apply for opportunities in the EU through the National Experts in Professional Training (NEPT) and Seconded National Experts (SNE) programmes as well as the shorter Erasmus for Officials programme. These roles are generally facilitated through special paid leave as the EU experience gained by officials is invaluable to my Department, particularly as Ireland's EU Presidency draws closer. My Department currently has two participants working in the European Commission under the SNE programme and one more staff member who is availing of special leave as their partner is working on an overseas DFA posting. A staff member who was on Special Leave while working in the European Commission's translation directorate took up a permanent role there in late 2024.  My Department has not refused any requests for special leave for these purposes.  My Department has a wide range of EU related policy areas and we look forward to playing a full and active role in the 2026 EU Presidency. Staff will be given every opportunity to get involved in the appropriate ways in the run up to and the duration of the Presidency.  My Department's training unit, through the One-Learning portal, offers training classes in professional Irish to staff during working hours. In addition my Department has assigned an Irish Language Officer and a single point of contact to conduct awareness campaigns to help staff understand their obligations under the Official Languages Act, and to encourage staff to speak the language through comhrá Gaeilge groups and cultural events. ",
        "to": {
          "uri": null,
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 632. Deputy Jennifer Murnane O'Connor asked the Minister for Housing, Local Government and Heritage the measures his Department is taking to encourage civil servants in his Department to take or avail of special leave or career breaks, or other forms of leave to encourage and facilitate Ireland's 2026 EU presidency, the Government \"Career for EU\" jobs strategy, and the Department's Gaeilge/Irish-language policy and promotion; and if he will make a statement on the matter. [3937/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_521",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_521.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_521",
          "showAs": "Departmental Staff"
        },
        "questionNumber": 632,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_633",
        "answerText": " Minister for Social Protection (Deputy Dara Calleary)  In 2024, my Department approved 2,061 applications for career breaks and special leave, both paid and unpaid. This includes Force Majeure, attendance at a court case as a witness or as a member of a jury. Within this figure, five applications were specifically related to civil servants and/or their spouses undertaking temporary roles within EU institutions. Due to the limited number of cases, and to maintain confidentiality and prevent potential identification of individuals, I have refrained from providing a breakdown of figures for each subcategory.  16 applications for special leave were not approved during this period. None of these declined applications pertained to civil servants and/or their spouses seeking temporary positions within EU institutions. ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 633. Deputy Jennifer Murnane O'Connor asked the Minister for Social Protection the number of requests to his Department that have granted for various matters (details supplied); the number of such requests that have been refused; and the grounds on which they have been refused. [2499/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_589",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_589.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_589",
          "showAs": "Departmental Staff"
        },
        "questionNumber": 633,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_767",
        "answerText": " Minister for Social Protection  Special leave for civil servants is a policy matter for my colleague, Jack Chambers TD, Minister for Public Expenditure, Infrastructure, Public Services Reform and Digitalisation.  The Department of Social Protection is actively preparing for Ireland's Presidency of the EU next year and has a long tradition of supporting the secondments of 'national experts' to the EU institutions as well as ensuring Departmental representation in Ireland's Permanent Representation in Brussels.  The Department of Social Protection takes its responsibilities under the Official Languages Act seriously.  It has a dedicated unit staffed by Gaeilgeoirí, that seeks to promote and support the use of Gaeilge in the Department in accordance with the Department's responsibilities.  This unit supports over 290 staff in the Department of Social Protection who are willing and able to conduct business through Irish.  Last year an Oireachtas na Roinne was organised to acknowledge and thank these staff for their service.  The Department encourages staff to undertake Gaelchultúr courses, there is a ciorcal comhrá within the Department as well as various events to promote Gaeilge around Seachtain na Gaeilge. ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 767. Deputy Jennifer Murnane O'Connor asked the Minister for Social Protection the measures his Department is taking to encourage civil servants in his Department to take or avail of special leave or career breaks, or other forms of leave to encourage and facilitate Ireland's 2026 EU Presidency, the Government \"Career for EU\" jobs strategy, and the Department's Gaeilge-Irish language policy and promotion; and if he will make a statement on the matter.  [3946/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_681",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_681.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_681",
          "showAs": "Departmental Staff"
        },
        "questionNumber": 767,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_768",
        "answerText": " Minister for Justice  I propose to take Questions Nos. 768 and 851 together.  I can inform the Deputy that my Department deploys a range of measures to encourage suitably qualified and experienced staff to take up roles in the EU institutions. In line with the Career for EU Strategy, my Department regularly circulates vacancy notices for Seconded National Expert (SNE) posts with a strategic relevance to the Department of Justice and encourages the ongoing placement of such Experts in the Institutions through both the Centrally Funded and Commission Funded Schemes. My Department currently has four  Experts posted to various EU Institutions.  can also inform the Deputy that my Department currently has seven civil servants seconded to the Permanent Representation of Ireland to the EU in Brussels, and one civil servant seconded to the Permanent Representation of Ireland to the Council of Europe in Strasbourg.  My Department is committed to ensuring a successful Irish Presidency of the Council of the European Union in the second half of 2026. To assist with that, a significant number of additional civil servants will be seconded from my Department to the Permanent Representation of Ireland to the EU, beginning from August 2025. Any civil servant in my Department who requires Special Leave to accompany a spouse to take up a role for the Presidency will be supported to do so.  I can further inform the Deputy that while no requests for Special EU Leave or Accompany Spouse Abroad leave were submitted in 2024, there are currently two civil servants in my Department on EU Special Leave and there are three civil servants on leave to accompany their spouse to serve in roles in the Permanent Representation to the EU. There have been no refusals of EU special leave, Accompany Spouse Abroad leave or a career break to facilitate a civil servant, or their spouse, taking up a role in the EU.  I am pleased to inform the Deputy that since 2006, with the commencement of its inaugural Irish Language Scheme, my Department has run 23 in-house Irish courses, both written and oral, tailored for members of staff of the Department. Those courses were run, concurrently in some cases, by Gaeleagras, Gaelchultúr and the Institute of Public Administration, in the Department’s offices in both Dublin and Killarney.  Furthermore, my Department has supported members of staff who wished to do Irish courses outside of the Department, and officials who participated in on-line written Irish courses with Gaelchultúr. Officials who attended courses outside of the Department have achieved qualifications ranging from the Irish European Certificate (TEG) to Master’s Degree qualifications. In 2023 and 2024, 48 members of staff have been supported to complete Irish language training.  My Department actively fosters a positive attitude to the Irish language among its staff, in particular through a ciorcal comhrá / Irish language conversation group, a piece each week in its in-house newsletter and a major event each year during Seachtain na Gaeilge which is always well attended, with participation from both members of staff and guest speakers.  In addition to having the benefit of a full time Irish language translator, there is a cohort of officers on a list of staff from various areas of my Department who are available to provide services in Irish. ",
        "to": {
          "uri": null,
          "showAs": "Justice",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 768. Deputy Jennifer Murnane O'Connor asked the Minister for Justice the number of requests to his Department that have granted for various matters (details supplied); the number of such requests that have been refused; and the grounds on which they have been refused. [2499/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_682",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_682.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_682",
          "showAs": "Departmental Staff"
        },
        "questionNumber": 768,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_851",
        "answerText": " Minister for Justice  I propose to take Questions Nos. 768 and 851 together.  I can inform the Deputy that my Department deploys a range of measures to encourage suitably qualified and experienced staff to take up roles in the EU institutions. In line with the Career for EU Strategy, my Department regularly circulates vacancy notices for Seconded National Expert (SNE) posts with a strategic relevance to the Department of Justice and encourages the ongoing placement of such Experts in the Institutions through both the Centrally Funded and Commission Funded Schemes. My Department currently has four  Experts posted to various EU Institutions.  can also inform the Deputy that my Department currently has seven civil servants seconded to the Permanent Representation of Ireland to the EU in Brussels, and one civil servant seconded to the Permanent Representation of Ireland to the Council of Europe in Strasbourg.  My Department is committed to ensuring a successful Irish Presidency of the Council of the European Union in the second half of 2026. To assist with that, a significant number of additional civil servants will be seconded from my Department to the Permanent Representation of Ireland to the EU, beginning from August 2025. Any civil servant in my Department who requires Special Leave to accompany a spouse to take up a role for the Presidency will be supported to do so.  I can further inform the Deputy that while no requests for Special EU Leave or Accompany Spouse Abroad leave were submitted in 2024, there are currently two civil servants in my Department on EU Special Leave and there are three civil servants on leave to accompany their spouse to serve in roles in the Permanent Representation to the EU. There have been no refusals of EU special leave, Accompany Spouse Abroad leave or a career break to facilitate a civil servant, or their spouse, taking up a role in the EU.  I am pleased to inform the Deputy that since 2006, with the commencement of its inaugural Irish Language Scheme, my Department has run 23 in-house Irish courses, both written and oral, tailored for members of staff of the Department. Those courses were run, concurrently in some cases, by Gaeleagras, Gaelchultúr and the Institute of Public Administration, in the Department’s offices in both Dublin and Killarney.  Furthermore, my Department has supported members of staff who wished to do Irish courses outside of the Department, and officials who participated in on-line written Irish courses with Gaelchultúr. Officials who attended courses outside of the Department have achieved qualifications ranging from the Irish European Certificate (TEG) to Master’s Degree qualifications. In 2023 and 2024, 48 members of staff have been supported to complete Irish language training.  My Department actively fosters a positive attitude to the Irish language among its staff, in particular through a ciorcal comhrá / Irish language conversation group, a piece each week in its in-house newsletter and a major event each year during Seachtain na Gaeilge which is always well attended, with participation from both members of staff and guest speakers.  In addition to having the benefit of a full time Irish language translator, there is a cohort of officers on a list of staff from various areas of my Department who are available to provide services in Irish. ",
        "to": {
          "uri": null,
          "showAs": "Justice",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 851. Deputy Jennifer Murnane O'Connor asked the Minister for Justice the measures his Department is taking to encourage civil servants in his Department to take or avail of special leave or career breaks, or other forms of leave to encourage and facilitate Ireland's 2026 EU presidency, the Government \"Career for EU\" jobs strategy, and the Department's Gaeilge/Irish-language policy and promotion; and if she will make a statement on the matter. [3938/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_682",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_682.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_682",
          "showAs": "Departmental Staff"
        },
        "questionNumber": 851,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_852",
        "answerText": " Minister for Agriculture, Food and the Marine (Deputy Martin Heydon)  I recognise the importance of Irish nationals on the staff of EU Institutions, and my Department is supportive of encouraging its staff in seeking opportunities which will improve Ireland’s representation among EU staff.  In this context my Department seconded National Experts to Directorates General across the EU Commission. There are 8 people in such positions at present. In relation to special leave, one application was sought and granted in 2024.  There were no refusals. ",
        "to": {
          "uri": null,
          "showAs": "Agriculture",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 852. Deputy Jennifer Murnane O'Connor asked the Minister for Agriculture, Food and the Marine the number of requests to his Department that have been granted for various matters (details supplied); the number of such requests that were refused; and the grounds on which they were refused.  [2499/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_755",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_755.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_755",
          "showAs": "Departmental Data"
        },
        "questionNumber": 852,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_889",
        "answerText": " Minister for Agriculture, Food and the Marine  I recognise the importance of Irish nationals on the staff of EU Institutions, and my Department encourages people to seek opportunities which will improve Ireland’s representation among EU staff.  Implementation of the strategy is ongoing and includes a strong focus on raising awareness of EU careers paths for graduates, support opportunities for SNEs and provision of training for candidates applying for EU roles.  My Department is monitoring opportunities as they arise in order to promote them with its staff and encourage applications. At the moment, we are planning to advertise appropriate SNE posts to the European Commission in the coming weeks, and we commit to support any successful candidates from that process with the appropriate leave arrangements. ",
        "to": {
          "uri": null,
          "showAs": "Agriculture",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 889. Deputy Jennifer Murnane O'Connor asked the Minister for Agriculture, Food and the Marine the measures his Department is taking to encourage civil servants in his Department to take or avail of special leave or career breaks, or other forms of leave to encourage and facilitate Ireland's 2026 EU presidency, the Government \"Career for EU\" jobs strategy, and the Department's Gaeilge/Irish-language policy and promotion; and if he will make a statement on the matter. [3942/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_791",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_791.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_791",
          "showAs": "Departmental Staff"
        },
        "questionNumber": 889,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Jennifer-Murnane-O'Connor.S.2016-04-25",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jennifer-Murnane-O'Connor.S.2016-04-25",
          "showAs": "Jennifer Murnane O'Connor"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_890",
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth (Deputy Norma Foley)  This Department has received no requests as outlined in the details supplied by the Deputy. ",
        "to": {
          "uri": null,
          "showAs": "Children",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 890. Deputy Jennifer Murnane O'Connor asked the Minister for Children, Equality, Disability, Integration and Youth the number of requests to her Department that have granted for various matters (details supplied); the number of such requests that have been refused; and the grounds on which they have been refused. [2499/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_793",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_793.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_793",
          "showAs": "Departmental Data"
        },
        "questionNumber": 890,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    }
  ]
}