{
  "head": {
    "counts": {
      "questionCount": 1621,
      "resultCount": 1621
    }
  },
  "results": [
    {
      "contextDate": "2025-04-08",
      "question": {
        "by": {
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "showAs": "Marian Harkin"
        },
        "date": "2025-04-08",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-04-08/pq_695",
        "answerText": " Minister for Justice  The visa application referred to by the Deputy was refused by the Visa Office in Dublin on 05 September 2023. The reasons for this decision were set out in the refusal letter sent to the applicant at that time. An appeal of this decision was launched on 15 January 2024.  While I acknowledge the personal difficulties an applicant might be experiencing, it is not possible to give a definitive date as to when this appeal will be finalised. All applications are processed in chronological order, based on date order of receipt.  While every effort is made to process applications as soon as possible, processing times will vary having regard to the volume and complexity of applications, the possible need for the Immigration Service Delivery (ISD) function of the Department to investigate, inquire into, or seek further information, and the resources available.  Processing times and decisions at the Dublin Visa Office can be checked at the following link which is updated each Tuesday: www.irishimmigration.ie/visa-decisions/ .  The date published on the website is the oldest date of application currently being processed under a given category. However, it should be noted that the Visa team continue to process and make decisions on applications received after the published processing date. If a particular application takes longer to consider this may result in the published processing date remaining unchanged. I can assure you that this does not indicate the processing of these applications has halted overall.  I am acutely aware that join family applications are very important for the persons impacted. I understand that people are eager to have their families join them in Ireland and I am committed to improving the service my Department provides.  To provide greater clarity, officials in my Department are currently in the process of updating the Immigration Service website to provide processing times for decisions on visa applications at the Dublin visa office.  The person concerned can now directly check the status of their immigration application on the Immigration Service’s new Digital Contact Centre (DCC). They can register for, or log in to their existing account, at:  https://portal.irishimmigration.ie/en/ .  As an Oireachtas member, you can also request the status of individual immigration cases by e-mail, using the Oireachtas Mail facility at: IMoireachtasmail@justice.ie, which has been specifically established for this purpose. This service enables up to date information on such cases to be obtained without the need to seek information by way of the Parliamentary Question process. ",
        "to": {
          "uri": null,
          "showAs": "Justice",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 695. Deputy Marian Harkin asked the Minister for Justice further to Parliamentary Question No. 1576 of 23 July 2024, the status of an appeal for a visa for reunification; the timeline for a decision on same (details supplied); and if he will make a statement on the matter. [16675/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_586",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-08/writtens/mul@/dbsect_586.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-08/writtens/dbsect_586",
          "showAs": "Visa Applications"
        },
        "questionNumber": 695,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "question": {
        "questionNumber": 415,
        "showAs": " 415. Deputy Marian Harkin asked the Minister for Education if a school place will be provided for a person (details supplied); and if she will make a statement on the matter. [15559/25] ",
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-01/writtens/mul@/dbsect_313.xml"
            },
            "pdf": null
          },
          "showAs": "School Admissions",
          "debateSectionId": "dbsect_313",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-01/writtens/dbsect_313"
        },
        "to": {
          "showAs": "Education",
          "uri": null,
          "roleType": null,
          "roleCode": null
        },
        "date": "2025-04-01",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-04-01/pq_415",
        "by": {
          "showAs": "Marian Harkin",
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06"
        },
        "questionType": "written",
        "answerText": " Minister of State at the Department of Education  This government is fully committed to supporting children with special educational needs to fulfil their full potential and the Programme for Government makes a number of commitments to deliver on this objective. The National Council for Special Education (NCSE) has responsibility for coordinating and advising on the education provision for children with special educational needs.  The NCSE has advised that the local special educational needs organiser is working closely with the student’s family regarding options for school placements and other special education supports for the coming academic year.  Through the accelerated provision of additional special class and special school places over recent years, there are now just over 28,000 students enrolled in special classes and special schools. Budget 2025 provides for an additional 2,700 specialist places, made up of 400 new special class and 300 additional special school places. On top of this, there will be over 1,000 places available through the normal annual movement of students progressing from primary to post-primary and students graduating from post-primary or special schools. There also remains special class vacancies in some areas of the country.  Of the 400 new special classes places provided for in Budget 2025, the NCSE has advised that 352 of these classes have already been sanctioned for the 2025/26 school year. Of these 4 are in Sligo, 3 at primary and 1 at post primary level.  This will add to the 32 special classes currently in operation in the county. There are also 2 special schools in Sligo with approximately 130 students enrolled.  In Sligo and indeed nationwide, the NCSE continue to engage intensely with schools and school patron bodies to confirm further classes. As the NCSE progress the sanctioning of the remaining special classes they will inform parents.  Where new special classes have been sanctioned, I would urge schools to progress the admission of students as soon as possible to ensure that the NCSE can continue to evaluate demand in local areas, sanction classes as required and assist parents in securing a school place.  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        }
      },
      "contextDate": "2025-04-01"
    },
    {
      "question": {
        "questionNumber": 419,
        "showAs": " 419. Deputy Marian Harkin asked the Minister for Education to confirm the continuation of the speech and language class at a school (details supplied); and if she will make a statement on the matter. [15572/25] ",
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-01/writtens/mul@/dbsect_290.xml"
            },
            "pdf": null
          },
          "showAs": "Special Educational Needs",
          "debateSectionId": "dbsect_290",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-01/writtens/dbsect_290"
        },
        "to": {
          "showAs": "Education",
          "uri": null,
          "roleType": null,
          "roleCode": null
        },
        "date": "2025-04-01",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-04-01/pq_419",
        "by": {
          "showAs": "Marian Harkin",
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06"
        },
        "questionType": "written",
        "answerText": " Minister of State at the Department of Education  I propose to take Questions Nos. 383 and 419 together.  This government is fully committed to supporting children with special educational needs to fulfil their full potential and the Programme for Government makes a number of commitments to deliver on this objective. The National Council for Special Education (NCSE) has responsibility for coordinating and advising on the education provision for children with special educational needs.  Through the accelerated provision of additional special class and special school places over recent years, there are now just over 28,000 students enrolled in special classes and special schools. Budget 2025 provides for an additional 2,700 specialist places, made up of 400 new special class and 300 additional special school places.  Students with Developmental Language Disorder (DLD) or Speech Sound Disorder (SSD) have access to speech therapy services either through the speech and language therapy services provided in special class settings by the Health Service Executive (HSE), or through the HSE’s primary care service. There are currently 63 special classes nationwide for children with a DLD or SSD. The provision of therapy services for the classes referred to by the Deputy is a matter primarily for the HSE.  As the HSE provide speech and language therapy to students in these classes the opening and retention of such classes is contingent on the availability of HSE resources. For this reason close engagement and coordination occurs among stakeholders at a local level. I have asked the NCSE to liaise with the school and provide support and advice in this regard.  Importantly, students with specific speech and language difficulties that are not enrolled in a special class may qualify for additional teaching support under the school's special education teaching support provision. 15,000 special education teachers have been provided to enable schools to achieve this. In practical terms, this means schools get a substantial additional teaching allocation to support children with special education needs who are in mainstream classes.  I recognise the importance of building the capacity of teachers in mainstream schools to meet the needs of all students. To support this, 338 places are funded each year to teachers to attend post-graduate special education needs programmes. The NCSE also offer dedicated professional learning opportunities for teachers supporting students with additional needs.  It is important to me and this Government that we build on the initiatives recently introduced to ensure that no matter where a child is enrolled they have access to the required supports to enable them to achieve their educational goals. An example of this is the Educational Therapy Support Service (ETSS) which sees 39 occupational and speech and language therapy posts embedded within the NCSE. The service is designed to build the capacity of teachers (and other school personnel as relevant) to provide as effectively as possible for the needs of all students.  While the provision of clinical therapy supports to children is the responsibility of the HSE, my department is working with the Department of Health, the Department of Children, Disability and Equality and the HSE to develop and strengthen more coherent structures to enable children and young people to access therapeutic supports across both health and education. ",
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        }
      },
      "contextDate": "2025-04-01"
    },
    {
      "question": {
        "questionNumber": 445,
        "showAs": " 445. Deputy Marian Harkin asked the Minister for Tourism, Culture, Arts, Gaeltacht, Sport and Media whether he intends to continue the basic income for artists when the pilot programme comes to an end in August 2025; and if he will make a statement on the matter. [15558/25] ",
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-01/writtens/mul@/dbsect_340.xml"
            },
            "pdf": null
          },
          "showAs": "Artists' Remuneration",
          "debateSectionId": "dbsect_340",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-01/writtens/dbsect_340"
        },
        "to": {
          "showAs": "Tourism",
          "uri": null,
          "roleType": null,
          "roleCode": null
        },
        "date": "2025-04-01",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-04-01/pq_445",
        "by": {
          "showAs": "Marian Harkin",
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06"
        },
        "questionType": "written",
        "answerText": " Minister for Tourism, Culture, Arts, Gaeltacht, Sport and Media  The Programme for Government commits to assessing the Basic Income for Artists pilot research scheme to maximise its impact. The Basic Income for the Arts pilot research scheme will conclude in August 2025 and the data from the pilot will feed into Government consideration of the next steps. Recipients have been receiving payment and responding to surveys under the scheme since August 2022.  In Budget 2025, Government made an allocation of €35 million for the Basic Income for the Arts in 2025. It is important to note that the pilot is a research programme and that no decision has been taken as to the continuation of BIA, and that the research evaluating the impact of the pilot scheme is ongoing.  While the research phase of the pilot scheme is still ongoing, it is clear from evidence collected to date under the scheme that it is having a positive impact on participants. The latest data is available through published reports on the Basic Income for the Arts website on Gov.ie.  This data shows that the BIA payment is having a consistent, positive impact across almost all indicators - affecting practice development, sectoral retention, well-being, and deprivation. Artists in receipt of the support are typically able to devote more time to their art, experience a boost to their wellbeing through greater life satisfaction and reduced anxiety, and are protected from the precariousness of incomes in the sector to a greater degree than those who are not receiving the support.  A Government decision will be required on a successor scheme to the pilot, and the future of the BIA will be decided when the final results of the research are available which will provide the Government with the evidence base upon which to base future policy decisions about the Basic Income for the Arts. ",
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        }
      },
      "contextDate": "2025-04-01"
    },
    {
      "question": {
        "questionNumber": 653,
        "showAs": " 653. Deputy Marian Harkin asked the Minister for Children, Equality, Disability, Integration and Youth if she can confirm the continuation of the accommodation recognition payment to Ukrainian refugees; and if she will make a statement on the matter. [15556/25] ",
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-01/writtens/mul@/dbsect_528.xml"
            },
            "pdf": null
          },
          "showAs": "Ukraine War",
          "debateSectionId": "dbsect_528",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-01/writtens/dbsect_528"
        },
        "to": {
          "showAs": "Children",
          "uri": null,
          "roleType": null,
          "roleCode": null
        },
        "date": "2025-04-01",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-04-01/pq_653",
        "by": {
          "showAs": "Marian Harkin",
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06"
        },
        "questionType": "written",
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  The Accommodation Recognition Payment (ARP) was introduced to recognise the generosity of people who have opened their homes to provide accommodation to Beneficiaries of Temporary Protection (BOTPs).  I have recently made an order to extend the scheme for a further year to March 2026 to mirror the extension of the Temporary Protection Directive. This extension provides certainty to Ukrainian people and their hosts that this measure will remain in place until March 2026. ",
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        }
      },
      "contextDate": "2025-04-01"
    },
    {
      "question": {
        "questionNumber": 776,
        "showAs": " 776. Deputy Marian Harkin asked the Minister for Health the plans in place to address the severe shortage of GPs in Donegal (details supplied); and if she will make a statement on the matter. [15557/25] ",
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-01/writtens/mul@/dbsect_644.xml"
            },
            "pdf": null
          },
          "showAs": "General Practitioner Services",
          "debateSectionId": "dbsect_644",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-01/writtens/dbsect_644"
        },
        "to": {
          "showAs": "Health",
          "uri": null,
          "roleType": null,
          "roleCode": null
        },
        "date": "2025-04-01",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-04-01/pq_776",
        "by": {
          "showAs": "Marian Harkin",
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06"
        },
        "questionType": "written",
        "answerText": " Minister for Health  GPs are self-employed practitioners and therefore may establish practices at a place of their own choosing. There is no prescribed ratio of GPs to patients and the State does not regulate the number of GPs that can set up in a town or community.  Under the GMS scheme, the HSE contracts GPs to provide medical services without charge to medical card and GP visit card holders. As of the 1st of March, there are 2,553 GPs contracted to provide services under the GMS Scheme, and a further 621 GPs that do not hold a GMS contract but hold at least one other contract with the HSE for the provision of health services.  Where a person that holds a medical card or GP visit card, experiences difficulty in finding a GP to accept them as a patient, the person concerned having unsuccessfully applied to at least three GPs in the area (or fewer if there are fewer GPs in the area) can apply to the HSE Eligibility Unit which has the power to assign a GMS patient to a GP's GMS patient list in accordance with the GMS contract. All persons aged 70 years and older and all children under 8 years of age are eligible for a GP visit card.  Persons who do not hold a medical card or GP visit card access GP services on a private basis and can make enquiries directly to any GP practice they wish to register with. As private practitioners, it is a matter for each individual GP to decide whether to accept additional private patients. Where a GP practice has a full list of patients and cannot take on new patients, patients should contact other practices in the surrounding areas. The HSE website provides a \"Find a GP\" facility which can assist in finding nearby GP practices.  A number of measures have been taken in recent years to increase the number of GPs practicing in the State and thereby improve access to GP services for all patients across the country.  Significant increases in investment in general practice has been provided under the 2019 and 2023 GP Agreements. The Agreements provide for increased GPs fees, new fees for additional services, and increased practice supports. These measures make general practice in Ireland a more attractive career choice for doctors.  Annual intake to the GP training scheme has been increased by approximately 80% from 2019 to 2024, with 350 new entrant training places made available from 2024. 346 new entrants commenced training last year, a 21% increase on the previous year’s intake of 286. Furthermore, recruitment of GPs from abroad is ongoing under the International Medical Graduate (IMG) Rural GP Programme. 119 IMG GPs were in practice as of November last and funding has been provided to recruit up to 250 more GPs from outside Ireland to the country this year. ",
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        }
      },
      "contextDate": "2025-04-01"
    },
    {
      "contextDate": "2025-03-25",
      "question": {
        "by": {
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "showAs": "Marian Harkin"
        },
        "date": "2025-03-25",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-25/pq_679",
        "answerText": " Minister for Health  The conditions for eligibility for GP services paid for by the State are set out in the Health Act 1970.  The Chronic Disease Management Programme, which has been rolled out progressively since 2000 and will see a further expansion to the conditions covered from July this year, covers a very large patient population. To date, over 470,000 patients have been registered on the programme, and this year’s expansion is estimated to bring in an additional 33,000 patients.  The delivery of healthcare programmes on such as large scale as this requires a measured approach to ensure that the capacity to deliver the programme is not exceeded. The Chronic Disease Management Programme was established following the 2019 GP Agreement which sets out the specific patient groups to be covered, the phasing of the Programme’s introduction, and the resources to be provided to GPs to deliver the programme.  The Programme as foreseen in the 2019 Agreement is now fully operational, and the expansions of 2024 and 2025 have been planned with General Practice to ensure that capacity to deliver them is in place. I and the HSE are continuously monitoring healthcare programmes with a view to ensuring appropriate access for patients in circumstances of appropriate capacity. In this context, I note that the Programme for Government includes a commitment to ‘examine the possibility of expanding the Structured Chronic Disease Management Programme to include more conditions and seek to provide access to more adults with these conditions’.  With regard to the specific person referred to in the question, I would note that all patients who had been on the Heartwatch programme when the CDM Programme was introduced were granted access to the CDM Programme, regardless of eligibility status. The patient or his GP may wish to contact the HSE directly to clarify their situation. ",
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 679. Deputy Marian Harkin asked the Minister for Health further to Parliamentary Question No. 752 of 4 March 2025, and subsequent reply in relation to the heartwatch scheme; the reason the new CDM Programme is only open to medical card patients (details supplied); and if she will make a statement on the matter. [13311/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_466",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-25/writtens/mul@/dbsect_466.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-25/writtens/dbsect_466",
          "showAs": "Disease Management"
        },
        "questionNumber": 679,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-03-19",
      "question": {
        "by": {
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "showAs": "Marian Harkin"
        },
        "date": "2025-03-19",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-19/pq_515",
        "answerText": " Minister of State at the Department of Enterprise, Trade and Employment  Ireland operates a managed employment system, which seeks to maximise the benefits of economic migration and minimise the risk of disrupting Ireland’s labour market. The system is designed to facilitate the entry of appropriately skilled non-European Economic Area nationals to fill skills and/or labour shortages in the State required to develop and support enterprise. The employment permits system is vacancy led and driven by the changing needs of the labour market. It is managed through the operation of the Critical Skills and Ineligible Occupations Lists. These lists determine employments that are either in high demand or are ineligible for consideration for an employment permit and are subject to periodic evidenced-based review to ensure the system is functioning as required  The Employment Permits Section of the Department informs me that the role of Early Years Practitioner would fall under soc code 3233 which is on the ineligible list of occupations. Therefore, it is not currently possible to be granted an Employment in respect of this role. ",
        "to": {
          "uri": null,
          "showAs": "Enterprise",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 515. Deputy Marian Harkin asked the Minister for Enterprise, Trade and Employment to clarify a matter regarding work permits (details supplied). [10878/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_386",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/mul@/dbsect_386.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/dbsect_386",
          "showAs": "Work Permits"
        },
        "questionNumber": 515,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-03-19",
      "question": {
        "by": {
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "showAs": "Marian Harkin"
        },
        "date": "2025-03-19",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-19/pq_516",
        "answerText": " Minister of State at the Department of Enterprise, Trade and Employment  The Employment Permits section of my Department informs me that as of 12th March, the current processing dates in respect of non-critical skills employment permit applications from standard employers is 27th February. For trusted partners (who make up approximately 90% of applications), the processing date is 11th March. ",
        "to": {
          "uri": null,
          "showAs": "Enterprise",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 516. Deputy Marian Harkin asked the Minister for Enterprise, Trade and Employment the timeframe for the processing of work permit applications for non-critical skills occupations. [10879/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_387",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/mul@/dbsect_387.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/dbsect_387",
          "showAs": "Work Permits"
        },
        "questionNumber": 516,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-03-19",
      "question": {
        "by": {
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "showAs": "Marian Harkin"
        },
        "date": "2025-03-19",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-19/pq_618",
        "answerText": " Minister for Education  The School Transport Scheme is a significant operation managed by Bus Éireann on behalf of the Department of Education. In the current school year, over 172,500 children, are transported daily in approximately 7,900 vehicles across 10,300 routes daily to primary and post-primary schools throughout the country. These daily trips cover over 100 million kilometres. This figure includes over 143,800 pupils travelling on primary and post primary services, 21,700 pupils with special educational needs, and 6,800 pupils who have arrived in Ireland from Ukraine.  The scheme is made up of three separate schemes, the school transport scheme for primary, post primary and for children with special educational needs. Transport is also provided for children who have arrived in Ireland from Ukraine and those residing in IPAS/EROC centres.  The total expenditure on the scheme in 2024 was €512m.  Under the current terms of the School Transport Schemes, children are eligible for transport at primary level where they reside not less than 3.2 km from and are attending their nearest national school. At post primary level, they are eligible where they reside not less than 4.8 km from and are attending their nearest post primary school/education centre. Distance is determined by the Department/Bus Éireann and rules have regard to ethos and language.  Children who are eligible for school transport and who complete the application process on time (apply on time and pay on time) are accommodated on school transport services where such services are in operation and where there is capacity to do so.  Children who are not eligible but who apply for school transport are considered for spare seats that may exist after eligible children have been facilitated; such seats are referred to as concessionary seats.  Because of the nature of concessionary transport for non-eligible children and the priority of providing places for eligible children, there may be an excess of demand over supply for concessionary places. In these cases Bus Éireann will allocate tickets for spare seats using an agreed selection process.  Bus Éireann who operate the school transport section on behalf of the Department of Education have advised that the pupils to whom the Deputy refers are not eligible for transport as they are attending their third nearest Post Primary Centre.  Bus Éireann have further advised that there are currently no school transport services operating from the areas to the school referred to by the Deputy under the school transport scheme. The pupils residing in these areas are considered concessionary to the school. Depending on where the pupils reside in the areas, the nearest pick-up point is 5.1 km to 10 km away.  The School Transport 2030 report, which was published in early 2024 marks the largest review of the School Transport Scheme since it was established in 1967. The Government is committed to working to achieve the report’s recommendation of expanding access to the scheme so that an additional 100,000 pupils can be carried by 2030. The recommended changes to the future operation of the schemes include expansion of the current eligibility criteria, addressing current operational challenges and moving towards better integration with public transport to ensure the best value for money to the Exchequer. A phased implementation of the review’s recommendations began at the start of the 2024/2025 school year.  As indicated at the time of the launch of the review, a number of pilots were being considered by my Department in conjunction with the Department of Transport and Bus Éireann. As also indicated at the time of the launch of the review, it was intended that following closure of the application process for the 2024/2025 school year, consideration would be given to further potential pilots.  A total of 14 pilot projects are underway this school year. These pilots are currently being evaluated and they will provide valuable insights into the impact of increased demand on the scheme, the potential for integrating public transport with school transport services, and opportunities to promote more sustainable modes of transport. The findings from the evaluation will guide the planning and implementation needed for a national rollout of a revised School Transport Scheme.  Further information on plans for the 2025/2026 school year will be available shortly. ",
        "to": {
          "uri": null,
          "showAs": "Education",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 618. Deputy Marian Harkin asked the Minister for Education further to Parliamentary Question No. 66 of 6 November 2024, if an application by a group (details supplied) for school transport will be reviewed; and if she will make a statement on the matter. [11270/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_483",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/mul@/dbsect_483.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/dbsect_483",
          "showAs": "School Transport"
        },
        "questionNumber": 618,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-03-19",
      "question": {
        "by": {
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "showAs": "Marian Harkin"
        },
        "date": "2025-03-19",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-19/pq_828",
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 818, 828 to 830, inclusive, 855, 856, 874, 875, 920 and 931 together.  Tenant in Situ Acquisitions were introduced by way of Government decision in 2023 as a short term response to the reported uplift in sales by landlords of homes which were within the HAP and RAS schemes in order to prevent potential homelessness where other solutions could not be found for the affected tenants.  A further Government decision extended such acquisitions into 2024 with approval granted for 1,300 Tenant in Situ acquisitions in addition to the 200 priority acquisitions target for 2024 contained in Housing for All.  Tenant in Situ acquisitions have been an important measure in the prevention of homelessness since their introduction in 2023. Government has therefore agreed to continue such acquisitions in 2025. My Department has notified local authorities on the extension of the programme and a circular setting out the arrangements will issue shortly.  Under revised arrangements for second hand acquisitions in 2025 local authorities will receive a capital funding allocation for the acquisition of homes for the following priority categories; tenant in situ, elderly and disabled persons, exits from homelessness and Buy and Renew acquisitions which tackle vacancy. The provision of a capital funding allocation will help promote best practice in obtaining value for money and provide local authorities with the flexibility to respond to needs and priorities locally within the categories of need being prioritised.  Tenant in situ acquisitions continue to be supported and prioritised where other solutions cannot be found for the affected tenants. It is a matter for local authorities to assess the circumstances of each case and decide the appropriate action. The arrangements for 2025 will ensure a more targeted and focussed acquisitions programme. My Department is finalising a circular setting out the arrangements and this will be issued to the sector shortly.  Regarding the details supplied relating to properties that have been rejected by Limerick County Council, it should be noted that it is a matter for individual local authorities to identify suitable acquisitions in line with local circumstances and their social housing allocations policy. My Department does not hold data, therefore, on the number of social housing acquisitions applications that have been withdrawn or rejected, nor on the reasons for such withdrawals or rejections. Further information may be available from individual local authorities.  Local authorities take appropriate steps to ensure that their first response will be to support households to prevent homelessness in cases where tenants have been served with a notice of termination by their landlord. A local authority will assess the options available in each case and decide the appropriate action.  My Department publishes comprehensive programme-level statistics on a quarterly basis on social housing delivery activity by local authorities and Approved Housing Bodies (AHBs) in each local authority. Comprehensive data on social and affordable housing is published on my Department's website up to Quarter 3 2024, including completed acquisitions: www.gov.ie/en/collection/6060e-overall-social-housing-provision/  Data for all of these schemes up to Q4 2024 is being collected and collated. ",
        "to": {
          "uri": null,
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 828. Deputy Marian Harkin asked the Minister for Housing, Local Government and Heritage for an update on an extension of the tenant-in-situ scheme for 2025; and if he will make a statement on the matter. [10876/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_662",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/mul@/dbsect_662.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-19/writtens/dbsect_662",
          "showAs": "Housing Schemes"
        },
        "questionNumber": 828,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "question": {
        "questionNumber": 751,
        "debateSection": {
          "showAs": "Departmental Funding",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-04/writtens/mul@/dbsect_538.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-04/writtens/dbsect_538",
          "debateSectionId": "dbsect_538"
        },
        "to": {
          "showAs": "Health",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  I propose to take Questions Nos. 637, 751 and 771 together.  Menopause is an important health and wellbeing issue which has been prioritised as part of the Government’s commitment to improved women’s health outcomes. Much important work has been done in this area, driven by the Women’s Health Taskforce and the Women’s Health Action Plans.  Budget 2025 announced the intention to fund the cost of HRT products prescribed to women to help manage the symptoms associated with all stages of menopause. This new HRT measure represents another step to widen access to and reduce costs associated with menopause related treatments and services and follows on from all the other developments that have taken place over several years.  The new Programme for Government: Securing Ireland’s Future continues to emphasise this important commitment to improving women’s health outcomes and experiences. It also commits to make HRT medicines available at no cost for the drug/product.  Legislation has been passed that means where a woman has been prescribed a HRT product by her healthcare provider to alleviate the symptoms associated with all stages of menopause, the cost of the HRT medications or products will be met by the State.  For the purpose of this measure, menopause means, in relation to a woman, the various stages for the treatment of menopause symptoms and includes perimenopause, post menopause, early menopause, premature menopause and medically induced menopause.  This measure will cover any HRT medications and products which are reimbursable by the HSE, which have been prescribed for the purposes of alleviating the symptoms of menopause. The cost of GP consultation fees and pharmacy dispensing fees are not included in the measure.  My Department has engaged with both the Health Service Executive and the Irish Pharmacy Union (IPU) in relation to the practical rollout of this measure.  I met with the IPU on 11 February 2025 to discuss her objectives for expanding and reforming community pharmacy and to progressing the Budget 2025 HRT initiative. This was a constructive engagement, and I listened to issues raised by the IPU. The IPU committed to coming to back to me regarding the introduction of the HRT measure. The IPU have now responded with further information, and this is being considered by my Department.  The goal is to introduce this measure as soon as possible and reimbursement support will be available to participating pharmacies from the date that this measure commences. ",
        "showAs": " 751. Deputy Marian Harkin asked the Minister for Health if she will provide a timeline for the rollout of free hormone replacement therapy for women, as announced in Budget 2025; and if she will make a statement on the matter. [9640/25] ",
        "questionType": "written",
        "house": {
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-04/pq_751",
        "by": {
          "showAs": "Marian Harkin",
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06"
        },
        "date": "2025-03-04"
      },
      "contextDate": "2025-03-04"
    },
    {
      "question": {
        "questionNumber": 752,
        "debateSection": {
          "showAs": "Disease Management",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-04/writtens/mul@/dbsect_645.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-04/writtens/dbsect_645",
          "debateSectionId": "dbsect_645"
        },
        "to": {
          "showAs": "Health",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  The Chronic Disease Management (CDM) Programme has been implemented in phases since 2020.  This innovative Programme establishes a structured engagement process between GPs and their GMS patients living with four conditions: Asthma; COPD; Type 2 Diabetes; and chronic heart diseases.  The CDM Programme has been very successful in aiding patients living with these conditions to improve how they manage their healthcare needs, with significant reductions in ED and other urgent care services, and significant reductions in hospital admissions among those registered on the programme.  All patients registered on the Heartwatch programme at the time of the introduction of the CDM Programme were transferred to the CDM Programme, regardless of eligibility status.  While the Government constantly reviews the range of programmes it implements, I would draw the Deputy's attention to the commitment in the Programme for Government 'to build on the existing National Cardiovascular Policy, …. develop a new and more ambitious plan enhancing patient care and timely access across all regions.' Future policy will consider primary and secondary prevention in addition to acute care and rehabilitation including cardiovascular services in primary care. ",
        "showAs": " 752. Deputy Marian Harkin asked the Minister for Health if the discontinuation of the Heartwatch scheme will be reviewed as soon as possible (details supplied). [9641/25] ",
        "questionType": "written",
        "house": {
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-04/pq_752",
        "by": {
          "showAs": "Marian Harkin",
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06"
        },
        "date": "2025-03-04"
      },
      "contextDate": "2025-03-04"
    },
    {
      "contextDate": "2025-02-27",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-27/writtens/mul@/dbsect_223.xml"
            }
          },
          "debateSectionId": "dbsect_223",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-27/writtens/dbsect_223",
          "showAs": "Revenue Commissioners"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-27/pq_209",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 209,
        "showAs": " 209. Deputy Marian Harkin asked the Minister for Finance if urgent consideration will be given to the re-opening of the office of the Revenue Commissioners, Cranmore, Sligo (details supplied); and if he will make a statement on the matter. [8738/25] ",
        "answerText": " Minister for Finance  I am advised by Revenue that while it previously provided a traditional over-the-counter service in a number of its offices, the changing demands of taxpayers and the need to provide an efficient and cost-effective service has resulted in service channels evolving. I can confirm that the Sligo Office has been closed for a number of years and Revenue do not currently have plans to reopen it.  To ensure optimum support to taxpayers, Revenue continuously reviews its service channels and deploys its resources on an agile basis, to meet demand while also ensuring that services are available for those taxpayers in vulnerable or sensitive circumstances.  For taxpayers who, for a variety of reasons, may not have access to the online services, Revenue offers extensive support across its various telephone helplines, a full service for queries being received through the postal system and an appointments service which allows taxpayers to schedule either a virtual or in-person appointment at a time that suits them.  Virtual appointments are provided nationally which allow taxpayers, accompanied by a trusted friend or family member if they so wish, to speak to a Revenue officer via a video call. Virtual appointments can be conducted from the taxpayer’s home, removing the need for them to attend a Revenue office, and can be arranged by calling Revenue’s dedicated appointments phoneline.  Additionally, Revenue is currently rolling out a service in a number of locations, to assist taxpayers without access to an internet connection or a smart device, where a virtual appointment (Revconnect) can be facilitated in a Revenue office. It is anticipated that this service will be available in Sligo in due course.  Further details on the appointment service are available on Revenue’s website at the following link: www.revenue.ie/en/contact-us/customer-service-contact/paye-jobs-and-pensions-helpline.aspx?gcd=0050.  To further assist customers who cannot use Revenue’s online services, an Access Supports Marker is available to customers on an “opt-in” basis. This marker will be applied where customers advise that they have a need for additional supports and assistance in managing their tax affairs, allowing Revenue’s customer service staff to quickly and easily identify customers who cannot use Revenue’s online service. The marker ensures that customers are not diverted to online channels and correspondence issues in hard-copy, paper format.  Separately, for persons with a disability or requiring additional assistance, Revenue has appointed Access Officers across its main Divisions. Access Officers are a point of contact with responsibility for providing or arranging for assistance and guidance to customers requiring additional assistance. Access Officers also assist customers by arranging services such as appointments; Irish Sign Language translations; braille documentation and other services provided by Revenue. Further details on Revenue’s Access Officer service is available at Revenue's website: www.revenue.ie/en/contact-us/head-office-functions/access-officer.aspx.  Finally, it should be noted that Revenue provides a full range of online services for taxpayers to manage their tax affairs, to complement its extensive telephone and postal service, which for the most part removes any requirement to attend public offices. Revenue’s online communication channel, the MyEnquiries system, is available 24/7, is easy to use and is fully secure. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail"
        },
        "date": "2025-02-27",
        "by": {
          "showAs": "Marian Harkin",
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06"
        }
      }
    },
    {
      "contextDate": "2025-02-27",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-27/writtens/mul@/dbsect_315.xml"
            }
          },
          "debateSectionId": "dbsect_315",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-27/writtens/dbsect_315",
          "showAs": "Departmental Offices"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-27/pq_303",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 303,
        "showAs": " 303. Deputy Marian Harkin asked the Minister for Social Protection for an update on a matter (details supplied); and if he will make a statement on the matter. [8739/25] ",
        "answerText": " Minister for Social Protection (Deputy Dara Calleary)  The toilet facilities in the Sligo Intreo building are for staff use and are located behind security doors.  In exceptional circumstances, access can be arranged for customers. Requests from customers to use the toilet facilities are not a regular occurrence.  The OPW is undertaking a refurbishment and accessibility survey of the complex and consideration will be given to the provision of public toilet facilities as part of that review. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail"
        },
        "date": "2025-02-27",
        "by": {
          "showAs": "Marian Harkin",
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06"
        }
      }
    },
    {
      "contextDate": "2025-02-25",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-25/writtens/mul@/dbsect_793.xml"
            }
          },
          "debateSectionId": "dbsect_793",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-25/writtens/dbsect_793",
          "showAs": "Health Services Staff"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-25/pq_944",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 944,
        "showAs": " 944. Deputy Marian Harkin asked the Minister for Health for an update on the review of the physician associate role; and if she will make a statement on the matter. [7957/25] ",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail"
        },
        "date": "2025-02-25",
        "by": {
          "showAs": "Marian Harkin",
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06"
        }
      }
    },
    {
      "contextDate": "2025-02-18",
      "question": {
        "by": {
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "showAs": "Marian Harkin"
        },
        "date": "2025-02-18",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-18/pq_331",
        "answerText": " Minister for Education  The Social Personal and Health Education (SPHE) curriculum, which is currently mandatory for primary and Junior Cycle students, is focused on promoting the health and well-being of children. Teachers can include CPR/first-aid in their SPHE programme. Personal safety is currently addressed in a variety of ways in the primary and post primary curricula; for example, SPHE aims to develop student’s skills for keeping safe and to make students aware of appropriate responses to various threats to personal safety. This provides schools with opportunities to prioritise first aid and/or cardiac pulmonary resuscitation (CPR) if they consider this appropriate for their students.  At Junior Cycle, the curriculum is made up of a combination of full subjects and short courses. Short courses are designed for 100 hours of engagement over the three years of Junior Cycle. Some short courses will be designed centrally by the National Council for Curriculum and Assessment (NCCA) and others by schools themselves or other bodies, using the template provided by the NCCA. It is open to a school or other body to develop a short course in first aid training, for use in schools.  There are also opportunities within Transition Year in which a flexible menu of learning modules can be provided by schools within the context of a framework for the programme set out by the Department.  Schools are encouraged to engage with community groups and a wide range of stakeholders to provide for extra-curricular learning opportunities such as first-aid training and/or CPR or to give talks to students. ",
        "to": {
          "uri": null,
          "showAs": "Education",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 331. Deputy Marian Harkin asked the Minister for Education if she will consider making cardiac pulmonary resuscitation a compulsory subject in secondary schools; and if she will make a statement on the matter. [5694/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_237",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-18/writtens/mul@/dbsect_237.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-18/writtens/dbsect_237",
          "showAs": "Departmental Policies"
        },
        "questionNumber": 331,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "showAs": "Marian Harkin"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_634",
        "answerText": " Minister for Education  The Public Service Sick Leave Scheme, which applies to teachers, is regulated by the Public Service Management (Sick Leave) Regulations 2014, SI 124 of 2014, as amended by the Public Service Management (Sick Leave) (Amendment) Regulations 2015, SI 384 of 2015 and the Public Service Management (Sick Leave) (Amendment) Regulations 2023, SI No. 407/2023. The Sick Leave Scheme for teachers is contained in my Department’s Circular Letter 13/2024.  Leave entitlements for public servants are determined by the Department of Public Expenditure, National Delivery and Reform (DPENDR). Under Section 24 of the Education Act 1998, the Minister for Education, with the concurrence of the Minister for Public Expenditure, National Delivery & Reform, is authorised to determine the terms and conditions of employment for teachers employed in approved teaching posts funded by monies provided by the Oireachtas.  A teacher who has applied for and been granted a career break, and is working in a substitute capacity, shall be regarded as working on a casual basis i.e. a non-contractual position. As there is no contract in place for casual substitute work between the employer and the substitute, there is no entitlement to access to the Public Service Sick Leave Scheme.  In this case, the permanent role of the employee takes precedence with regards to adhering to the terms and conditions of the Sick Leave Scheme, including application of the look-back extension rules. ",
        "to": {
          "uri": null,
          "showAs": "Education",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 634. Deputy Marian Harkin asked the Minister for Education if an issue with regard to sick leave will be reviewed (details supplied); and if she will make a statement on the matter. [1707/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_610",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_610.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_610",
          "showAs": "School Staff"
        },
        "questionNumber": 634,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "showAs": "Marian Harkin"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_1118",
        "answerText": " Minister for Agriculture, Food and the Marine  My Department will finalise this requested information and send it directly to the Deputy within 10 working days. This entails reviewing each of the 792 applications that had licences approved for the single consent system. ",
        "to": {
          "uri": null,
          "showAs": "Agriculture",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 1118. Deputy Marian Harkin asked the Minister for Agriculture, Food and the Marine further to Parliamentary Question No. 1252 of 9 September 2024, if a further update will be provided on the matter (details supplied). [1890/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_1050",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_1050.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_1050",
          "showAs": "Forestry Sector"
        },
        "questionNumber": 1118,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "showAs": "Marian Harkin"
        },
        "questionNumber": 55,
        "questionType": "written",
        "showAs": " 55. Deputy Marian Harkin asked the Minister for Enterprise, Trade and Employment if the second increased cost of business application by a business (details supplied) will be reviewed in order to avail of the Power Up grant. [45311/24] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Enterprise",
          "roleCode": null
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-06/writtens/dbsect_79",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-06/writtens/mul@/dbsect_79.xml"
            },
            "pdf": null
          },
          "showAs": "Business Supports",
          "debateSectionId": "dbsect_79"
        },
        "date": "2024-11-06",
        "house": {
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-06/pq_55",
        "answerText": " Minister for Enterprise, Trade and Employment  The ICOB registration process was a self-declaration process whereby a business supplied information in order to register for the ICOB scheme. The second ICOB grant was for businesses in the retail, hospitality and beauty sectors.  In order to be eligible for the Power Up grant, a business in the hospitality, retail and beauty sectors must have received the second ICOB grant.  If a business did not receive a second ICOB grant payment then they are not eligible to receive the power up grant.  The ICOB scheme is now closed and it is not possible to reopen that scheme to reclassify a business. "
      },
      "contextDate": "2024-11-06"
    },
    {
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "showAs": "Marian Harkin"
        },
        "questionNumber": 66,
        "questionType": "written",
        "showAs": " 66. Deputy Marian Harkin asked the Minister for Education if her Department will provide school transport for a number of students to attend a school (details supplied). [45360/24] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Education",
          "roleCode": null
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-06/writtens/dbsect_89",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-06/writtens/mul@/dbsect_89.xml"
            },
            "pdf": null
          },
          "showAs": "School Transport",
          "debateSectionId": "dbsect_89"
        },
        "date": "2024-11-06",
        "house": {
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-06/pq_66",
        "answerText": " Minister for Education  The School Transport Scheme is a significant operation managed by Bus Éireann on behalf of the Department of Education.  In the 2023/24 school year over 163,800 children, including over 136,000 pupils travelling on primary and post primary services, 20,200 pupils with special educational needs, and 7,400 pupils who have arrived to Ireland from Ukraine were transported on a daily basis to primary and post-primary schools throughout the country.  The total cost of the scheme in 2023 was €382.02m.  Over 140,000 mainstream tickets have issued for the 2024/2025 school year, which is already 3% more than the total tickets issued for the full 2023/2024 school year.  The purpose of my Department's School Transport Scheme is, having regard to available resources, to support the transport to and from school of children who reside remote from their nearest school.  Bus Éireann who operate the school transport section on behalf of the Department of Section have advised that the pupil of whom the Deputy refers is not eligible for transport as they are attending their third nearest Post Primary Centre.  Under the terms of the School Transport Schemes, children are eligible for transport at primary level where they reside not less than 3.2 km from and are attending their nearest national school. At post primary level, they are eligible where they reside not less than 4.8 km from and are attending their nearest post primary school/education centre.  Distance is determined by the Department/Bus Éireann and rules have regard to ethos and language.  Children who are eligible for school transport and who complete the application process on time (apply on time and pay on time) are accommodated on school transport services where such services are in operation and where there is capacity to do so.  Children who are not eligible but who apply for school transport are considered for spare seats that may exist after eligible children have been facilitated; such seats are referred to as concessionary seats.  Because of the nature of concessionary transport for non-eligible children and the priority of providing places for eligible children, there may be an excess of demand over supply for concessionary places.  In these cases Bus Éireann will allocate tickets for spare seats using an agreed selection process.  Temporary Alleviation Measures (TAMS) at post primary level are continued for the current school year. Under these measures, transport will be provided where there is a route in operation and where capacity exists for concessionary post primary pupils who are eligible for transport to their nearest school, are attending their second nearest school and who applied and paid on time.  Bus Éireann have advised that there are currently no school transport services operating from the areas to the school referred to by the Deputy under the school transport scheme. The pupils residing in these areas are considered concessionary to the school.  Depending on where the pupils reside in the areas, the nearest pick-up point is 5.1 km to 10 km away.  At present there does not warrant the extension of an existing service or establishment of a new service. "
      },
      "contextDate": "2024-11-06"
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 896,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_896",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_849",
          "showAs": "Disability Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_849",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_849.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister of State at the Department of Children, Equality, Disability, Integration and Youth  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "showAs": " 896. Deputy Marian Harkin asked the Minister for Children, Equality, Disability, Integration and Youth the reason there is no HSE hydrotherapy pool in the north west region that can cater for wheelchair users, which is clear discrimination against people with disabilities (details supplied); and if he will make a statement on the matter. [44166/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Marian Harkin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "memberCode": "Marian-Harkin.D.2002-06-06"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 904,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_904",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_858",
          "showAs": "Disability Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_858",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_858.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister of State at the Department of Children, Equality, Disability, Integration and Youth  As this question refers to service/operational matters, I have asked the Health Service Executive (HSE) to respond to the deputy directly, as soon as possible. ",
        "showAs": " 904. Deputy Marian Harkin asked the Minister for Children, Equality, Disability, Integration and Youth when a person will receive CDNT services (details supplied), which they have not received since April 2024; and if he will make a statement on the matter.  [44260/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Marian Harkin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "memberCode": "Marian-Harkin.D.2002-06-06"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 929,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_929",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_883",
          "showAs": "Disability Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_883",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_883.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister of State at the Department of Children, Equality, Disability, Integration and Youth  Government acknowledge the essential role that Occupational Therapists play in their communities, as well as the importance of a continuation and stability of disability services over time, in order to ensure access to vital healthcare for service users.  The following table provides an overview of the number of Occupational Therapists in place across the HSE and section 38 agencies, by CHO, specifically related to disability services. This data has been taken from September 2024 employment level reports, provided by the HSE.  Figures provided include the following grades; Occupational Therapist, Occupational Therapist Manager, Occupational Therapist Clinical Specialist, Occupational Therapist Senior as well as Occupational Therapist-in-charge III.     CHO    Whole Time Equivalent (WTE)    Headcount      CHO 1    21.49    26      CHO 2    29.24    34      CHO 3    21.28    24      CHO 4    48.98    57      CHO 5    24    27      CHO 6    8.37    10      CHO 7    63.94    70      CHO 8    38.55    45      CHO 9    84.59    92      Grand Total    340.44    385     Regarding the 'details supplied', in respect of Occupational Therapist posts in Longford, I have asked the HSE to reply directly to the Deputy on this matter as soon as possible. ",
        "showAs": " 929. Deputy Marian Harkin asked the Minister for Children, Equality, Disability, Integration and Youth the number of occupational therapists in place across all CHO areas, specifically related to disability services, in tabular form (details supplied); and if he will make a statement on the matter. [44528/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Marian Harkin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "memberCode": "Marian-Harkin.D.2002-06-06"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 113,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_113",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_89",
          "showAs": "Pension Provisions",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_89",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_89.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Environment",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for the Environment, Climate and Communications  Under section 46 of the Postal and Telecommunications Services Act 1983, the Minister for the Environment, Climate and Communications ('MECC'), with the concurrence of the Minister for Public Expenditure, NDP Delivery and Reform ('MPENDR'), approves any superannuation schemes submitted by An Post.  In accordance with the act and the relevant Code of Practice for the Governance of State Bodies, An Post must seek Ministerial approval from both MECC and MPENDR to increase pensions and deferred pensions for members of the An Post superannuation scheme (\"the scheme\"). On June 21st 2024 An Post wrote to my Department seeking consent for amendments to the scheme, namely a 2% increase for pensions in payment and deferred pensions with effect from January 2024.  In line with both the Code of Practice for State Bodies and transfer of powers from Min/Finance to MPENDR which are contained in the Postal and Telecommunications Act 1983, Ministerial consent was granted and has been conveyed to An Post on 21 of October 2024. ",
        "showAs": " 113. Deputy Marian Harkin asked the Minister for the Environment, Climate and Communications when retired An Post workers will receive the 2% pay increase due to them ten months ago; and if he will make a statement on the matter. [43104/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Marian Harkin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "memberCode": "Marian-Harkin.D.2002-06-06"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 342,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_342",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_309",
          "showAs": "Schools Building Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_309",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_309.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Education  I can confirm to the Deputy, that provisional approval has been given under the Additional School Accommodation (ASA) scheme for 8 modular mainstream classrooms and 1 modular special education classroom. This project has been assigned to the Project Management Framework for delivery and is currently in the final stages of the process. My officials will be in contact with the school authorities shortly in relation to the next steps and remain available to assist them at all stages during the process.  The Deputy will be aware that my Department has broadened its delivery streams and is utilising Modern Methods of Construction, including Modular Accommodation, as well as traditional construction delivery methods. Modular accommodation has particular advantages in terms of overall timelines and also climate impact in that they generally use decarbonised heating sources.  In overall terms, it is important to have a range of delivery mechanisms for delivering school accommodation to support the current very strong and ambitious roll out of school building projects. This is particular relevant given the overall challenging construction sector market.  The Department has a significant modular accommodation programme in place to assist schools in the provision of additional capacity, including in respect of facilitating the establishment of special classes.  This programme involves the use of Project Management supports which is designed to enable the accommodation to be provided as quickly as possible and help ease the administrative workload for school authorities in relation to the management and delivery of projects.  The use of the Department’s Modular Accommodation Framework also assists in ensuring lead in periods for procurement of modular accommodation are minimised to the greatest extent possible.  The Department is working closely with the Project Management teams and the modular accommodation suppliers to ensure additional capacity for the schools sector is delivered as quickly as possible.  Since 2020, my Department has invested over €5 billion in our schools throughout the country, involving the completion of over 950 school building projects and with construction currently underway at approximately 350 other projects, which includes 37 new school buildings. These 350 projects currently at construction involve a total State investment of over €1.5bn.  The Department announced earlier in the year that close to 90 projects, including 28 new school buildings, would be authorised to proceed from tender stage to construction over the course of 2024 and early 2025. In total, around €800 million will be invested in these projects under the department’s Large Scale Capital Programme and Additional Accommodation Scheme for essential classroom accommodation.  Between projects currently under construction and projects moving to construction in this latest phase, investments by the Department of Education are adding over 550,000 square metres of new and modernised capacity to our school estate.  This is a record level of investment in school buildings. It will expand the number of school places, significantly increase provision for special education and upgrade and modernise our school infrastructure. The impact of this will be felt in communities right around the country.  I can assure the Deputy that the accommodation approved for the school in question will be progressed as soon as possible. ",
        "showAs": " 342. Deputy Marian Harkin asked the Minister for Education when a modular building will be delivered to a school (details supplied); and if she will make a statement on the matter. [42695/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Marian Harkin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "memberCode": "Marian-Harkin.D.2002-06-06"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 354,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_354",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_322",
          "showAs": "School Accommodation",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_322",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_322.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Education  I can confirm to the Deputy, that my Department has an application for capital funding, under the Additional School Accommodation (ASA) scheme, from the school authority in question.  The purpose of my Department’s Additional School Accommodation (or ASA) scheme is to ensure that essential mainstream classroom accommodation and accommodation for pupils with special education needs is available to cater for pupils enrolled each year, where the need cannot be met by the school’s existing accommodation.  Since 2020, the department has invested over €5 billion in our schools throughout the country, involving the completion of over 950 school building projects and with construction currently underway at approximately 350 other projects, which includes 37 new school buildings. These 350 projects currently at construction involve a total State investment of over €1.5bn.  I can confirm that my officials have been engaging with the school authorities in relation to progressing their application as a permanent build project. I am pleased to confirm that a brief letter of offer has issued to the school authorities and they have accepted same. The project is now ready to progress to the final stage of the assessment process. ",
        "showAs": " 354. Deputy Marian Harkin asked the Minister for Education for an update on an application for additional school accommodation; the stage of the process the application is at (details supplied); and if she will make a statement on the matter. [42770/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Marian Harkin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "memberCode": "Marian-Harkin.D.2002-06-06"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 355,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_355",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_323",
          "showAs": "Schools Refurbishment",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_323",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_323.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Education  The school to which the Deputy refers submitted an application for funding under the Emergency Works Scheme (EWS) for Universal Access works in September 2024.  The application in question is currently being reviewed by a member of the technical team within the EWS and once the technical recommendation has been received, the EWS team will engage further with the school as appropriate.  The EWS team is aware of the urgent nature of the works required and will keep the school informed throughout the process. ",
        "showAs": " 355. Deputy Marian Harkin asked the Minister for Education for an update on an application for funding for emergency works for a school (details supplied); and if she will make a statement on the matter. [42771/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Marian Harkin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "memberCode": "Marian-Harkin.D.2002-06-06"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 386,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_386",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_351",
          "showAs": "Schools Building Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_351",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_351.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Education  I can confirm to the Deputy, that the Department currently has an application for capital funding for additional accommodation from the school in question.  Since 2020, the department has invested over €5 billion in our schools throughout the country, involving the completion of over 950 school building projects and with construction currently underway at approximately 350 other projects, which includes 37 new school buildings. These 350 projects currently at construction involve a total State investment of over €1.5bn.  The Department announced earlier in the year that close to 90 projects, including 28 new school buildings, would be authorised to proceed from tender stage to construction over the course of 2024 and early 2025. In total, around €800 million will be invested in these projects under the department’s Large Scale Capital Programme and Additional Accommodation Scheme for essential classroom accommodation.  Between projects currently under construction and projects moving to construction in this latest phase, investments by the Department of Education are adding over 550,000 square metres of new and modernised capacity to our school estate.  This is a record level of investment in school buildings. It will expand the number of school places, significantly increase provision for special education and upgrade and modernise our school infrastructure. The impact of this will be felt in communities right around the country.  The application is currently being assessed by officials in the Department and the school will be contacted directly when a decision has been made. ",
        "showAs": " 386. Deputy Marian Harkin asked the Minister for Education to provide an update on the provision of a new building for a school (details supplied); and if she will make a statement on the matter. [43165/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Marian Harkin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "memberCode": "Marian-Harkin.D.2002-06-06"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 476,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_476",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_433",
          "showAs": "Disability Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_433",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_433.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister of State at the Department of Social Protection (Deputy Joe O'Brien)  Tús is a community work placement initiative which aims to provide short-term work opportunities for those who are unemployed for more than a year. The Department is very conscious of the need to support Tús and continues to meet regularly with representatives of these programmes.  The focus of Tús is on jobseekers that are unemployed for twelve months or more, and the targeted activation of this cohort aims to provide additional assistance and a renewed impetus to these jobseekers who could otherwise be in danger of falling into persistent long-term unemployment.  The duration of each Tús contract is for a maximum of 12 months; a time limit set to ensure that the available placements are open to as many people as possible who are long-term unemployed and to ensure that Tús complements the objectives set out in the Government’s activation policies in Pathways to Work.  The existing 12 months duration on the scheme is deemed to be adequate to meet the programme's objectives and to prepare participants for a return to the open labour market. Where a participant requires further support or training on completion of a Tús placement, there is an option of transferring to a CE placement. The CE programme also provides a possibility to engage in QQI accredited training and development.  The Department keeps all aspects of its employment and activation programmes under review to ensure that they benefit all participants, and in acknowledgement of the valuable contribution being made to local communities through the provision of services. However, there are currently no plans to extend the duration of Tús placements beyond twelve months.  I trust that this clarifies the position for the Deputy. ",
        "showAs": " 476. Deputy Marian Harkin asked the Minister for Social Protection if she will consider extending the duration of the Tús programme for people with disabilities (details supplied). [40502/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Marian Harkin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "memberCode": "Marian-Harkin.D.2002-06-06"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 533,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_533",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_488",
          "showAs": "Social Welfare Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_488",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_488.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Social Protection  Illness benefit is the primary short term income support provided by my Department to those who are unable to work due to illness of any type and who are covered by social insurance.  Eligibility for illness benefit depends on the person’s PRSI record and class. The person must have made the required number of contributions under class A, E, H or P to qualify. In general, self-employed people make PRSI contributions at Class S which does not provide entitlement to illness benefit.  Self-employed people pay contributions to the Social Insurance Fund at a lower rate of 4.1%. This is 11.15 percentage points lower than the combined employer and employee contribution of 15.25% made in respect of employed contributors. However, self-employed contributors do have access to over 90% of benefits available to employed contributors including;  • Adoptive Benefit;  • Guardian's Payment (Contributory);  • Invalidity Pension;  • Jobseeker's Benefit (Self-Employed);  • Maternity Benefit;  • Parent's Benefit;  • Partial Capacity Benefit (where in receipt of Invalidity Pension);  • Paternity Benefit;  • State Pension (Contributory);  • Treatment Benefit; and  • Widows, Widower's or Surviving Civil Partner's (Contributory) Pension.  In addition, I was pleased to announce in the Budget that entitlement to carer's benefit will be extended to Class S contributors from the beginning of 2025.  As a result, the only benefits that class S PRSI will not provide access to are health and safety benefit, illness benefit and occupational injuries benefits.  In circumstances where people are ill but do not qualify for illness benefit or invalidity pension, my Department provides means tested supports under the disability allowance scheme and the supplementary welfare allowance scheme. An additional needs payment may also be available to people who have expenses that they cannot pay from their weekly income.  My Department will continue to keep its range of supports under review to ensure that they meet their overall objectives. Any changes to the current system would need to be considered in an overall policy and budgetary context, and in the context of social insurance contribution rates for self-employed contributors.  I trust this clarifies the matter for the Deputy. ",
        "showAs": " 533. Deputy Marian Harkin asked the Minister for Social Protection if urgent consideration will be given to extending illness benefit to self-employed people; and if she will make a statement on the matter. [43103/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Marian Harkin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "memberCode": "Marian-Harkin.D.2002-06-06"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 541,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_541",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_497",
          "showAs": "Grant Payments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_497",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_497.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Social Protection  As per the definition of a social enterprise in the Department of Rural and Community Development’s publication Trading for Impact, the National Social Enterprise Strategy 2024 - 2027 - 'a social enterprise is defined as an enterprise whose objective is to achieve a social or environmental impact, rather than maximising profit for its owners or shareholders. It pursues its objectives by trading on an ongoing basis through the provision of goods and/or services, and by reinvesting surpluses fully or primarily into achieving social objectives. It is governed in a fully accountable and transparent manner and is independent of the public sector. If dissolved, it should transfer its assets to another organisation with a similar mission.'  Details of payments made by my Department to the following bodies from 2023 to date is outlined in tabular format below:       YEAR    Name Of Organisation    Amount Allocated in Funding      2023    Young Social Innovators  Rehab - ( for a Forms Distribution Service)  Vincentian MESL Research Centre    €36,500  €112,710  €170,000      2024 – To Date    Young Social Innovators  Rehab - ( for a Forms Distribution Service)  Vincentian MESL Research Centre    €32,850  €80,422  €85,000         As part of the annual UN International Day for the Eradication of Poverty (17th October), my Department made payments to the following bodies in 2023 and 2024:     2023          Irish 17th October Committee    €3,000.00      Age Action Ireland    €2,800.00      All Together in Dignity (ATD) Ireland    €2,950.00      Athlone Family Resource Centre (FRC)    €3,000.00      Barnardo's    €2,975.30      Blanchardstown Centre for Independent Living    €1,878.03      Citywise Education    €3,000.00      Connect/Footsteps    €2,669.80      Dillon's Cross Project/Cork Educational Training Board    €1,765.50      Doras Buí    €2,969.52      Kid's Own Publishing    €3,000.00      Lus na Gréine Family Resource Centre    €3,000.00      Offaly Traveller Movement    €3,000.00      South Inner City Community Development Association (SICCDA)    €1,982.23      Tullamore FRC    €2,900.00      Women's Community Projects Mullingar    €3,000.00      2024          Aster Family Support    €1,237.23      All Together in Dignity Ireland    €2,340.00      Blanchardstown Centre for Independent Living    €1,422.70      Citywise Education    €2,700.00      Clara Family Resource Centre (FRC)    €2,700.00      Foodcloud    €2,700.00      Irish 17th October Committee    €2,700.00      Lus na Gréine Family Resource Centre    €2,700.00      National Women's Council of Ireland    €2,700.00      Tullamore FRC    €1,604.70      Women's Community Projects Mullingar    €2,700.00        ",
        "showAs": " 541. Deputy Marian Harkin asked the Minister for Social Protection the grants her Department has provided to social enterprise representative bodies since October 2023, in tabular form; and if she will make a statement on the matter. [43274/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Marian Harkin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "memberCode": "Marian-Harkin.D.2002-06-06"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 546,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_546",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_502",
          "showAs": "Citizenship Applications",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_502",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_502.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Justice  I am pleased to advise the Deputy that the naturalisation application from the person referred to has been approved by my Department.  A request for final documentation and a Certificate fee will issue directly to the person concerned.  Last year, Citizenship Division more than doubled the number of ceremonies available to applicants with 15 held over the course of 2023. This was a significant increase on 6 Citizenship Ceremonies held in 2022. To date in 2024, my Department has hosted 17 ceremonies with over 14,000 attendees, with further ceremonies planned for later in the year.  No date is published for the next Ceremony, however, I can advise the Deputy that it will be in December of this year.  As the Deputy will appreciate, these events require considerable planning and Citizenship Division issues invitations to successful applicants at the earliest possible opportunity. As plans for further ceremonies are confirmed this information will be put into the public domain.  Further information on Citizenship Ceremonies is available on my Department’s website here: www.irishimmigration.ie/how-to-become-a-citizen/citizenship-ceremonies/.  Queries in relation to the status of individual immigration cases may be made directly to my Department by e-mail using the Oireachtas Mail facility at: IMoireachtasmail@justice.ie, which has been specifically established for this purpose. This service enables up to date information on such cases to be obtained without the need to seek information by way of the Parliamentary Question process. The Deputy may consider using the e-mail service except in the cases where the response is, in the Deputy's view, inadequate or too long awaited. ",
        "showAs": " 546. Deputy Marian Harkin asked the Minister for Justice for an update on an application for citizenship for a person (details supplied); and if she will make a statement on the matter. [42477/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Marian Harkin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "memberCode": "Marian-Harkin.D.2002-06-06"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 713,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_713",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_662",
          "showAs": "Hospital Complaints Procedures",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_662",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_662.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  The Medical Council has seen a rise in the number of serious cases it is dealing with in recent years.  This in turn has resulted in an increase in the number of referrals to Fitness to Practise, as well as an increase in the number of cases considered pursuant to section 60 of the Medical Practitioners Act 2007, (i.e. cases where the Council must consider whether to make an application to the High Court to suspend a doctor’s registration if there is an immediate risk to the public).  Serious cases are by their nature more complex which require extensive investigation and may have concurrent criminal proceedings in some instances. The nature of serious cases adds to the number of investigative steps required, and in turn the time required to investigate.  In order to deal with this increase in cases the Medical Council has added additional resources to its Complaints and Investigations Directorate in 2023 and 2024.  Please see Table 1 and Table 2 set out below for the respective timelines for the Preliminary Proceedings Committee (PPC) and Fitness to Practise (FTP) stages.    Table 1 – PPC Stage    Average and median times (in months) for the making of an initial determination by the Preliminary Proceedings Committee (PPC)     Year    Average time that elapses between the receipt of a complaint by the Medical Council and the making of an initial determination by the PPC or CEO    Median time that elapses between the receipt of a complaint by the Medical Council and the making of an initial determination by the PPC or CEO      2022 (279 cases were determined)    12 months    16 months      2023(265 cases were determined)    13 months    10 months      2024(312 cases were determined)    13 months    9 months       Table 2 – FTP Stage    Average and median times (in months) at the Fitness to Practise (FTP) stage.        Year    Average length of time that the FTPC stage takes    Median length of time that the FTPC stage takes         2022    23.5 months    20 months         2023    29 months    21 months         2024    22 months    24 months    ",
        "showAs": " 713. Deputy Marian Harkin asked the Minister for Health if he will outline the average and median time that elapses between the receipt of a complaint by the Medical Council and the making of an initial determination by the PPC or CEO, respectively; following such initial determination, the average and median length of time that the FTPC stage takes; if he will provide such figures for 2022, 2023 and 2024; and if he will make a statement on the matter. [42655/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Marian Harkin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "memberCode": "Marian-Harkin.D.2002-06-06"
        }
      }
    },
    {
      "contextDate": "2024-10-17",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 82,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-17/pq_82",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_94",
          "showAs": "Public Transport",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-17/writtens/dbsect_94",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-17/writtens/mul@/dbsect_94.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy, overall funding in relation to public transport, and corporate governance of transport operators including Irish Rail.  The issue raised by the Deputy is a matter for Irish Rail. Therefore, I have referred the Deputy's question to Irish Rail for direct response to the Deputy.  Please advise my private office if you do not receive a reply within ten working days. ",
        "showAs": " 82. Deputy Marian Harkin asked the Minister for Transport if consideration will be given to the addition of an early morning train service between Longford and Sligo that would allow arrival in Sligo for workers, students and people with early medical appointments, before the current first train which arrives from Dublin at 10.17 am. [41698/24] ",
        "date": "2024-10-17",
        "by": {
          "showAs": "Marian Harkin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "memberCode": "Marian-Harkin.D.2002-06-06"
        }
      }
    },
    {
      "contextDate": "2024-10-17",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 302,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-17/pq_302",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_311",
          "showAs": "Health Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-17/writtens/dbsect_311",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-17/writtens/mul@/dbsect_311.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "showAs": " 302. Deputy Marian Harkin asked the Minister for Health if there are plans in place for the provision of a community paramedic team for County Sligo; and if he will make a statement on the matter. [42159/24] ",
        "date": "2024-10-17",
        "by": {
          "showAs": "Marian Harkin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "memberCode": "Marian-Harkin.D.2002-06-06"
        }
      }
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "showAs": "Marian Harkin"
        },
        "questionNumber": 55,
        "showAs": " 55. Deputy Marian Harkin asked the Minister for the Environment, Climate and Communications to clarify his policy position ahead of a planning application decision by An Bord Pleanála, given his recent comments about the fact that a liquified natural gas, LNG, storage facility may no longer be needed as back-up in a natural energy crisis, and given that An Bord Pleanála's decision on a current planning application for an LNG terminal must have regard to current Government policy; and if he will make a statement on the matter. [41333/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Environment"
        },
        "questionType": "oral",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_55",
        "debateSection": {
          "debateSectionId": "dbsect_29",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/debate/dbsect_29",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/debate/mul@/dbsect_29.xml"
            },
            "pdf": null
          },
          "showAs": "Energy Infrastructure"
        },
        "answerText": " Deputy Thomas Pringle  I am taking this question on behalf of Deputy Harkin. This question relates to the two previous priority questions on LNG facilities and the recent planning Act that just went through. What are the implications of the amendments made in the planning Act for the upcoming An Bord Pleanála decision on the LNG facility? \n Deputy Eamon Ryan  I will not read the prepared written response because it is similar to the answer I gave to the first question. All these questions relate to a similar issue.  I do not see any implications other than for a potential project. In Ireland's case a non-commercial temporary strategic storage facility would go through the strategic infrastructure process rather than to the local authority. That is a fairly standard process and procedure. The only reason for the amendment is to make sure that it is legally sound in any such development. There is nothing more to it than that. Particularly with a facility that is both offshore and onshore, we needed to regulate the broad planning Act system we have to reflect that and make sure there were no inconsistencies that would cause confusion or legal doubt.  I do not see any implications. I know that may have been read differently by others, but that is the absolute reality. It is reality because our strategy, as set out in the energy security paper, was published in November of last year. It was agreed, debated, discussed and I think voted on by the House. It sets out in real detail exactly what we are doing and nothing has changed in that. The amendment does not in any way change the strategic direction. The only thing that may change is, as I said, even in the past year the advance of this renewable, interconnection and battery-storage revolution has happened faster than people might have thought. The whole thing with a terminal is to cover gas insecurity for a short number of years before the arrival of renewables and other efficiency technologies, which really kill our use of gas. Gas use will dramatically fall; it has to dramatically fall. The only question is whether in the intervening period we need a gas storage facility or if, through the use of new interconnectors, better battery storage and anaerobic digestion giving us some gas supply as well as Corrib and power generation stations using backup strategic distillate facilities, which they can use, we could cover the gas. That is the question we need to answer. \n Deputy Thomas Pringle  I take what the Minister has said that that is the question that needs to be answered. In reality these amendments came forward on Report Stage in the Seanad and came back to the Dáil. We did not even get to debate them because the time ran out. If that clarity needed to be given in respect of planning applications or the planning Act, surely it was known about a year ago or six months ago. It could have been in the Bill that was put before the House here rather than being lumped in as a Government amendment in the Seanad, meaning that no debate took place on it in here.  That is the first question.  The Minister said in response to a previous question that he did not want to import fracked gas but he will now allow for an application to go through the process. That is what this is about. It is about making that process work but surely it is disingenuous to allow an application to go through the process, and to give somebody the indication that this is going to happen and is going to go ahead. They have to go through the whole planning process and through An Bord Pleanála when the Minister has no intention of allowing this happening at any stage. That seems to me to be a wee bit disingenuous and goes against the intention of what the Minister is saying. \n Deputy Eamon Ryan  On the amendments, this is a very extensive Bill. It was 900 pages in the end and there were 150-odd amendments on the last Stage in the Seanad. My sense from officials is that issue was about making sure the law was not contradictory in some sense. There were changes because we only established MARA last year and made the switch from the foreshore licensing system to this new marine planning system. That accounts for why an amendment may have come in late but I do not think we should read any more into it.  We have to be careful here. We have an independent legal system and people have a right to put in planning applications. It is important that An Bord Pleanála is independent, and any judicial decisions regarding that. We do not get into the legal arguments.  An Bord Pleanála also has to consider Government policy. We have to remember that the previous application, which was subject to that recent judgment, would have been made in September 2023 before the security paper, which is the key document in my mind setting out Government policy, was published. Obviously, An Bord Pleanála could not take it into account in any previous decision but in any revised one - and it has to be very careful as we have to be very careful not to interfere in the legal system in that way - it would obviously take into account what Government is saying. We maintain an independence but Government is clear in its position. \n Deputy Thomas Pringle  Just to get clarity from the Minister on it, these amendments he put forward make it easier for a developer to know and have clarity with regard to putting in an application to An Bord Pleanála, while knowing that it will not be passed at all. They would go to the expense of preparing the application, go through the whole process and go to An Bord Pleanála, knowing that it would not be passed. That is what the Minister is saying the purpose of these amendments is. \n Deputy Eamon Ryan  No. The amendment, from my perspective, is around us requiring a gas storage facility, which has both onshore and offshore components. With regard to those two systems, offshore planning is different from onshore planning, and by the very nature of such a storage facility, it might be both so we have to make sure that if there was a future application for such a facility, there would not be an incongruity. It was not in any way drafted with a view for any other planning application in mind. We are not going to draft legislation for the specifics of any other application. That is a matter for An Bord Pleanála and the courts to decide, not Government. The amendment was not related to that at all. ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "showAs": "Marian Harkin"
        },
        "questionNumber": 622,
        "showAs": " 622. Deputy Marian Harkin asked the Minister for Health further to Parliamentary Question No. 175 of 29 May 2024, the reason for the delay in appointing a temporary consultant for the pain clinic at SUH (details supplied); when in 2025 the consultants will be appointed; and if he will make a statement on the matter. [41221/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_622",
        "debateSection": {
          "debateSectionId": "dbsect_567",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_567",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_567.xml"
            },
            "pdf": null
          },
          "showAs": "Hospital Staff"
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "showAs": "Marian Harkin"
        },
        "questionNumber": 623,
        "showAs": " 623. Deputy Marian Harkin asked the Minister for Health if it is envisaged to reopen the pain clinic at Sligo University Hospital when the temporary consultant is appointed in early 2025; and if he will make a statement on the matter. [41222/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_623",
        "debateSection": {
          "debateSectionId": "dbsect_568",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_568",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_568.xml"
            },
            "pdf": null
          },
          "showAs": "Hospital Facilities"
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "showAs": "Marian Harkin"
        },
        "questionNumber": 624,
        "showAs": " 624. Deputy Marian Harkin asked the Minister for Health the timeline to fill the two vacant consultant anaesthetist posts in the pain clinic at Sligo University Hospital; and if he will make a statement on the matter. [41223/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_624",
        "debateSection": {
          "debateSectionId": "dbsect_570",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_570",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_570.xml"
            },
            "pdf": null
          },
          "showAs": "Hospital Staff"
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "showAs": "Marian Harkin"
        },
        "questionNumber": 627,
        "showAs": " 627. Deputy Marian Harkin asked the Minister for Health further to Parliamentary Question No. 175 of 29 May 2024, the number of patients referred to the pain relief insourcing initiatives (details supplied) to the pain clinic in Sligo; the number on the waiting list that have been referred to the three-pain relief insourcing initiatives since the pain clinic closed in June 2024; the total number on the waiting list on the date of closure of 28 June 2024; the total number on the waiting list on 1 October 2024; and if he will make a statement on the matter. [41228/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_627",
        "debateSection": {
          "debateSectionId": "dbsect_573",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_573",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_573.xml"
            },
            "pdf": null
          },
          "showAs": "Hospital Staff"
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "contextDate": "2024-10-10",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-10/writtens/mul@/dbsect_102.xml"
            }
          },
          "debateSectionId": "dbsect_102",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-10/writtens/dbsect_102",
          "showAs": "Rural Recreation Policy"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-10/pq_100",
        "to": {
          "roleType": null,
          "showAs": "Rural",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 100,
        "showAs": " 100. Deputy Marian Harkin asked the Minister for Rural and Community Development if, given the current LEADER programme is worth €70 million less than the last programme, excluding the transition programme, there are plans to increase funding to the current LEADER programme. [40501/24] ",
        "answerText": " Minister for Rural and Community Development  The LEADER Programme is a key intervention of Our Rural Future, the Government’s Policy for rural development which aims to deliver a range of actions to rural communities over the lifetime of the policy. It supports a broad range of activities which aim to respond to the diversity of the local needs of our rural areas.  It is delivered through Local Action Groups (LAGs) across rural Ireland. A feature of the LEADER programme is that it is based on a community-led, bottom-up approach to rural development.  Funding is allocated to the LEADER programme through the Common Agricultural Policy (CAP). The CAP programming periods correspond to the EU's budgetary cycle. Under the current budgetary cycle which runs from 2021-2027 a total of €250 million has been made available for the LEADER programme.  This funding is made up of €70 million for the Transitional LEADER programme for the years 2021 and 2022 with the remaining €180 million allocated for the period 2023-2027, thus maintaining the level of funding for the programme in line with the corresponding 7 year cycle for the 2014-2020 LEADER programme.  I am confident that the level of funding allocated for the 2021-2027 programming period is sufficient to meet the demand for grant funding from rural communities and businesses and to continue the effective operation of the LEADER programme.  In addition to the LEADER programme there are a range of schemes, funded outside of the CAP, that have been implemented in recent years, such as the Rural Regeneration and Development Fund, the Town and Village Renewal Scheme, the Walks Scheme, and the Outdoor Recreation Infrastructure Scheme all of which contribute to enhancing our rural areas. The range of rural development schemes have seen unprecedented levels of investment in recent years. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-10-10",
        "by": {
          "showAs": "Marian Harkin",
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06"
        }
      }
    },
    {
      "contextDate": "2024-10-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-08/writtens/mul@/dbsect_438.xml"
            }
          },
          "debateSectionId": "dbsect_438",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-08/writtens/dbsect_438",
          "showAs": "Disability Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-08/pq_428",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 428,
        "showAs": " 428. Deputy Marian Harkin asked the Minister for Children, Equality, Disability, Integration and Youth the numbers of speech and language therapists employed in counties Sligo, Leitrim and Donegal for the years 2020 to 2024 inclusive, in tabular form; and if he will make a statement on the matter. [39773/24] ",
        "answerText": " Minister of State at the Department of Children, Equality, Disability, Integration and Youth  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-10-08",
        "by": {
          "showAs": "Marian Harkin",
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06"
        }
      }
    },
    {
      "contextDate": "2024-10-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-08/writtens/mul@/dbsect_654.xml"
            }
          },
          "debateSectionId": "dbsect_654",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-08/writtens/dbsect_654",
          "showAs": "Departmental Funding"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-08/pq_654",
        "to": {
          "roleType": null,
          "showAs": "Rural",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 654,
        "showAs": " 654. Deputy Marian Harkin asked the Minister for Rural and Community Development when the next community support fund will open for applications; the costs this funding will support; if other funds due to open or are currently open for applications by community groups that will support running costs such as energy costs, rent, lease and insurance costs; and if she will make a statement on the matter. [40092/24] ",
        "answerText": " Minister of State at the Department of Rural and Community Development  In November 2022, I announced the Community Support Fund (CSF), with funding of €10 million. The once-off fund was allocated under my Department’s Community Enhancement Programme (CEP), designed to assist community groups across the country, in light of rising energy costs at the time.  In December 2023, I was delighted to launch the Local Enhancement Programme (LEP) which replaced my Department’s Community Enhancement Programme, with capital funding of €6 million to assist thousands of community groups across the country. The overall €6 million LEP included a special ring-fenced capital fund of €1 million to provide support for Women’s Groups.  There was a particular focus on small capital works/improvements, and the purchase of equipment for community use. The funding could be used, but was not limited to improving energy efficiency of community facilities to reduce ongoing costs.  The LEP was administered on behalf of my Department locally by Local Community Development Committees (LCDCs) across the country, with support from their Local Authority. The LEP 2024 is now closed to applicants and details of successful groups are available at www.gov.ie/DRCD.  Details of any future iterations of the Local Enhancement Programme, including the allocations available have not yet been confirmed. I would encourage all groups to check my department’s website www.gov.ie/drcd, and to engage with their Local Community Development Committees (LCDCs), Local Development Companies and Public Participation Networks (PPN) to ensure they are aware of funding opportunities as they become available.  I look forward to continuing to deliver meaningful supports like the LEP to local communities as we support them to respond to the challenges they face. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-10-08",
        "by": {
          "showAs": "Marian Harkin",
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06"
        }
      }
    },
    {
      "contextDate": "2024-10-03",
      "question": {
        "by": {
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "showAs": "Marian Harkin"
        },
        "questionNumber": 4,
        "questionType": "oral",
        "answerText": " Deputy Marian Harkin  Will the Minister act on the urgent need to upgrade and extend the building from which the Gurteen family practice in County Sligo operates? I visited the practice two weeks ago. It is run by Dr. Helen Fitzsimons and was named rural practice of the year for 2024. I saw first hand the urgent need to upgrade the building.  Sadly, I wish to extend my most sincere sympathy to Dr. Fitzsimons and her children on the sudden death last week of their beloved husband and father, Tom Bradley. May he rest in peace. \n Deputy Stephen Donnelly  I join the Deputy in offering my sincere condolences to Dr. Fitzsimons, her children and the entire family on their recent bereavement.  The Gurteen health centre is located in south Sligo. The centre houses a public health nursing service, a day centre for older persons and the local GP practice. Local HSE primary care management has advised that it is aware of the issue of restricted space within the building for the GP practice. While it is not possible to extend the building, the HSE is conducting an options appraisal process to scope out options for the reconfiguration and refurbishment of the building. It is intended that this process will be completed in the coming weeks and, following appropriate discussions with stakeholders, a priority submission for capital funding is to be put forward. This is a long, official way of saying that the HSE is aware of the problem and is looking to solve it. The HSE will finalise some options in a matter of weeks, which is welcome to hear, and will prioritise whatever the preferred option is.  I thank the Deputy for raising this matter. I will ask my officials in the HSE to keep her updated on progress. \n Deputy Marian Harkin  I am pleased to hear that the process will be completed in the coming weeks and a priority application for capital funding will be put forward.  When I visited the practice two weeks ago, I could see for myself the urgent need to upgrade the building. The reception area is tiny and cramped. There are three receptionists. There are wires trailing over sinks. It doubles as a kitchenette and a storage area. There are holes in the floor. The building is unsafe. That practice sees between 4,000 and 5,000 patients; it is a huge practice. The most crucial issue, which is pretty disgusting, is the fact that the wastewater system is malfunctioning. I am told staff have to come in nearly an hour before the practice opens in the morning, run the taps and flush the toilets continuously, and open the windows so that people can come in an hour later. The Minister will hear from what I am saying the urgency in this matter. \n Deputy Stephen Donnelly  It is clear that urgent remediation is required. It is welcome that the HSE intends to conduct the assessments and will be back within a couple of weeks. There is important additional good news for the area. The planned primary care centre in nearby Tubbercurry is due to commence building early next year, which is welcome. The existing primary and mental health care centre in Ballymote is to provide the majority of HSE primary services in the area. It is intended that this will allow for the reconfiguration and refurbishment of the Gurteen health centre for all of the very pressing reasons the Deputy has articulated today. \n Deputy Marian Harkin  I thank the Minister. The people in Tubbercurry and Ballymote will be very pleased with that. What is at issue here is the Gurteen health centre. They told me the HSE maintenance manager has been as helpful as he can. He has done everything he can but the problem is a severe one and it is just papering over the cracks.  I know the Minister is really interested in women's health. Dr. Fitzsimons runs a women's health clinic two days a month in Manorhamilton and many patients come to her clinic for women's health issues specifically in Gurteen. That is one of the reasons she and her brilliant staff are so busy. It is a really important service and we must ensure the building in which it is being provided is up to standard. I am pleased with the Minister's response and look forward to working with him and his officials to progress this matter. \n Deputy Stephen Donnelly  I thank the Deputy. I acknowledge the work of Dr. Fitzsimons on women's health. I was delighted earlier this week to be able to expand that. This will be our fifth budget in a row where we really do prioritise women's healthcare. There have been a few important additions which Dr. Fitzsimons and all the other GPs will be aware of and will be part of. One is the expansion of IVF eligibility, which will make a big difference to a lot of couples. The first step on that fertility journey is with the GP. It is they who refer into the six regional centres, who then refer on for IVF. HRT is being made free. This has been welcomed around the country. The medical professionals and GPs are saying it is great because it removes barriers. I was talking to one lady in Wicklow yesterday who said she was spending €1,000 a year on HRT. I commend Dr. Fitzsimons and all of our GPs around the country on their championing of the women's health priorities over the last years. ",
        "showAs": " 4. Deputy Marian Harkin asked the Minister for Health if he will act on the urgent need to upgrade and extend the HSE-owned building from which the Gurteen family practice operates; and if he will make a statement on the matter. [39546/24] ",
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "date": "2024-10-03",
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-03/debate/mul@/dbsect_6.xml"
            },
            "pdf": null
          },
          "showAs": "Primary Care Centres",
          "debateSectionId": "dbsect_6",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-03/debate/dbsect_6"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-03/pq_4"
      }
    },
    {
      "contextDate": "2024-10-03",
      "question": {
        "by": {
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "showAs": "Marian Harkin"
        },
        "questionNumber": 20,
        "questionType": "written",
        "answerText": " Minister for Health  I am advised that the reason for the temporary cessation of this service is that the two consultant doctors providing the chronic pain service in Sligo University Hospital have both moved to new roles.  The HSE advises that recruitment to fill these two vacant consultant anaesthetist posts in the pain service is actively ongoing. Advertisements are active in all appropriate websites and agencies for temporary posts, while the process for permanent filling of posts is undertaken. As a result, two Consultants have been recommended for temporary appointment and are currently going through pre-employment procedures. These vacant posts are expected to be filled on a temporary basis in early 2025, while permanent recruitment is ongoing.  A temporary consultant was put into post in early July 2024 to oversee the governance of the Pain Management and Education clinic, a psychologically based rehabilitative treatment for people with persistent pain.  In relation to existing patients on the day case list and outpatient review lists, the HSE advises that alternative arrangements are being made for these patients. Patients are being contacted directly by the hospital when arrangements are in place for their follow up treatments. I am advised that three pain relief insourcing initiatives have been approved for the region through the NTPF which will facilitate treatment for 580 patients on pain relief waiting lists. ",
        "showAs": " 20. Deputy Marian Harkin asked the Minister for Health the timeframe for the reopening of the pain clinic at Sligo University Hospital; and if he will make a statement on the matter. [38825/24] ",
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "date": "2024-10-03",
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-03/writtens/mul@/dbsect_37.xml"
            },
            "pdf": null
          },
          "showAs": "Hospital Services",
          "debateSectionId": "dbsect_37",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-03/writtens/dbsect_37"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-03/pq_20"
      }
    },
    {
      "contextDate": "2024-10-03",
      "question": {
        "by": {
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "showAs": "Marian Harkin"
        },
        "questionNumber": 36,
        "questionType": "written",
        "answerText": " Minister of State at the Department of Health  As this is an operational matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "showAs": " 36. Deputy Marian Harkin asked the Minister for Health if a decision has been made not to fund additional hours for home care for service users in Sligo, Leitrim and Donegal; if overtime hours of caregivers are being cut back; and if he will make a statement on the matter. [38826/24] ",
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "date": "2024-10-03",
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-03/writtens/mul@/dbsect_53.xml"
            },
            "pdf": null
          },
          "showAs": "Home Care Packages",
          "debateSectionId": "dbsect_53",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-03/writtens/dbsect_53"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-03/pq_36"
      }
    },
    {
      "contextDate": "2024-10-03",
      "question": {
        "by": {
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "showAs": "Marian Harkin"
        },
        "questionNumber": 37,
        "questionType": "written",
        "answerText": " Minister for Health  As this is a service matter, it has been referred to the Health Service Executive for attention and direct reply to the Deputy. ",
        "showAs": " 37. Deputy Marian Harkin asked the Minister for Health when a person will receive surgery (details supplied). [39354/24] ",
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "date": "2024-10-03",
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-03/writtens/mul@/dbsect_54.xml"
            },
            "pdf": null
          },
          "showAs": "Hospital Appointments Status",
          "debateSectionId": "dbsect_54",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-03/writtens/dbsect_54"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-03/pq_37"
      }
    },
    {
      "contextDate": "2024-10-03",
      "question": {
        "by": {
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06",
          "showAs": "Marian Harkin"
        },
        "questionNumber": 163,
        "questionType": "written",
        "answerText": " Minister of State at the Department of Children, Equality, Disability, Integration and Youth  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "showAs": " 163. Deputy Marian Harkin asked the Minister for Children, Equality, Disability, Integration and Youth to provide an update on the progress made on the reopening of a hydrotherapy pool (details supplied); and if he will make a statement on the matter. [38685/24] ",
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Children",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "date": "2024-10-03",
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-03/writtens/mul@/dbsect_170.xml"
            },
            "pdf": null
          },
          "showAs": "Disability Services",
          "debateSectionId": "dbsect_170",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-03/writtens/dbsect_170"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-03/pq_163"
      }
    },
    {
      "contextDate": "2024-10-02",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-02/writtens/mul@/dbsect_144.xml"
            }
          },
          "debateSectionId": "dbsect_144",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-02/writtens/dbsect_144",
          "showAs": "Defective Building Materials"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-02/pq_137",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 137,
        "showAs": " 137. Deputy Marian Harkin asked the Minister for Housing, Local Government and Heritage further to this Deputy’s previous correspondence on the inclusion of Sligo in the defective concrete blocks grant scheme and the reply received (details supplied), if he can outline the timeline for bringing a motion for resolution to each House of the Oireachtas and, subject to the passing of a resolution, bringing a second memorandum to Government requesting that the order be made; and if he will make a statement on the matter. [39336/24] ",
        "answerText": " Minister for Housing, Local Government and Heritage  I commenced the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 ('the 2022 Act') on 22 June 2023, which contains the enhanced grant scheme and adopted the related Regulations on 29 June 2023.  The Housing Agency wrote to me and recommended that an order under Section 5(9) of the Act designating Sligo County Council in respect of the whole of its administrative area be made and I accepted this recommendation.  An order for the inclusion of a local authority in the enhanced DCB Grant Scheme may only be made by an Order of the Government. I have received Government approval for the designation of Sligo County Council under the scheme. I am now in the process of arranging for the moving of a motion for a Resolution in each House of the Oireachtas and subject to the passing of such a Resolution I will then request the Government to make the Order.  I expect that the designation process to allow for the inclusion of Sligo County Council in the scheme will be finalised shortly. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-10-02",
        "by": {
          "showAs": "Marian Harkin",
          "memberCode": "Marian-Harkin.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Marian-Harkin.D.2002-06-06"
        }
      }
    }
  ]
}