{
  "head": {
    "counts": {
      "questionCount": 3280,
      "resultCount": 3280
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Education and Youth  I can assure the Deputy that the provision of school places to meet the needs of children and young people at primary and post primary level, including children and young people with special educational needs is an absolute priority of mine.  Since 2020, my department has invested over €1.6 billion in school infrastructure across Co. Dublin and the Department is continually planning for and investing in existing and new schools to ensure that every child in the State has access to a school place.  In order to plan for school provision and analyse the relevant demographic data, my department divides the country into 314 school planning areas and uses a geographical information system, using data from a range of sources, including CSO census data, child benefit and school enrolment data, to identify where the pressure for school places across the country will arise and where additional school accommodation is needed at primary and post-primary level.  The annual enrolment process for new Junior Infants at primary and new First Years at post-primary is a very large-scale operation that is transacted at close to 4,000 schools across the country, involving some 140,000 pupils. While my department is aware of enrolment pressures and demand for additional school places in some areas, it is important to note that enrolment pressures can be driven by duplications of applications, applications from outside an area, and school of choice factors. Notwithstanding the above, in some areas, demographic pressures and other factors are driving a requirement for additional school places.  Data available to my department highlights there are more first year places available than 6th class children in the Rathfarnham school planning area. In 2024/25 academic year, 4.39% of first year places were unfilled. In addition, previous capacity data submitted by schools to the department identified that 4 out of 5 post-primary schools had capacity for places across various year groups.  With regards to projects in train that will increase post-primary capacity in Rathfarnham school planning area, there is a capital project currently at Stage 2b for Sancta Maria College which when complete will increase capacity to 750 pupils.  My Department's main responsibility is to ensure that schools in an area can, between them, cater for all pupils seeking school places in the area. In relation to school admissions, it is the responsibility of the managerial authorities of all schools to implement an enrolment policy in accordance with the Education Act, 1998.  Parents have the right to choose which school to apply to and where the school has places available the pupil should be admitted. However, in schools where there are more applicants than places available a selection process may be necessary. This selection process and the enrolment policy on which it is based must be non-discriminatory and must be applied fairly in respect of all applicants. However, this may result in some pupils not obtaining a place in the school of their first choice.  I can assure the Deputy that my department will continue to keep the school place requirements in the Rathfarnham school planning area as with other areas across the country, under review. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 527. Deputy John Lahart asked the Minister for Education and Youth her Department’s plans to address the shortage of post-primary school places in the Knocklyon/Rathfarnham area; if capacity will be expanded in existing schools or if a new school is planned; and to provide the expected timeline for these measures. [72563/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03",
          "showAs": "John Lahart"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_410",
          "debateSectionId": "dbsect_410",
          "showAs": "School Enrolments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_410.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_527",
        "questionNumber": 527
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  Last month Minister O’Callaghan and I secured Government approval to introduce new policies and legislative changes to strengthen Ireland’s migration and asylum system to ensure it is rules-based, efficient and more aligned with EU Member States.  As part of this, there are plans to make a number of changes to the rules on the granting of citizenship, one of which relates to the residency requirements of a person granted international protection to be granted citizenship, which came into effect on 8 December 2025.  Previously, individuals granted international protection status could apply for citizenship after a time period of three years. Effective from 8 December 2025 people granted international protection will generally be required to have five years of reckonable residence in the State before they can apply for citizenship.  Applications for citizenship received before 8 December 2025 will continue to be processed under the previous three year rule, while applications submitted on or after that date will be assessed in line with the new five year residency requirement. This change brings citizenship applicants with international protection status in line with most other citizenship applicants.  It is important to note that applications for naturalisation are not prioritised on the basis of an applicant's length of residence in the State. Rather, applications are processed in the order in which they are received.  All applications for a certificate of naturalisation are assessed individually based on the provisions of the Irish Nationality and Citizenship Act 1956, as amended.  Detailed information on how to apply for naturalisation and other resources is available on my Department’s Immigration website here: www.irishimmigration.ie/how-to-become-a-citizen/ .  I want to clarify for the Deputy that International Protection applicants are not eligible to apply for naturalisation. Only individuals who have been granted an International Protection declaration and who have accrued the required period of reckonable residence in the State can be considered for Irish citizenship. I would further note that there has been no change in this regard. The recent policy change relates solely to the length of reckonable residence time. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 754. Deputy John Lahart asked the Minister for Justice, Home Affairs and Migration her views on a case (details supplied) regarding citizenship applications; and if he will make a statement on the matter. [72432/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03",
          "showAs": "John Lahart"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_600",
          "debateSectionId": "dbsect_600",
          "showAs": "Citizenship Applications",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_600.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_754",
        "questionNumber": 754
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  Eligibility for a Medical Card or GP Visit Card is primarily based on a financial assessment which is conducted by the HSE in accordance with the Health Act 1970 (as amended). The HSE assesses each medical or GP visit card application on a qualifying financial threshold. This is the amount of money that an individual can earn a week and still qualify for a card. It is specific to the individual’s own financial circumstances.  Persons aged 69 and under are assessed under the general means tested medical card or GP visit card thresholds which are based on an applicant’s household income after tax and the deduction of PRSI and the Universal Social Charge. Certain expenses are also taken into account. Examples of allowable expenses include rent, mortgage, certain insurance costs, childcare, maintenance, nursing home net costs  which help to increase the amount a person can earn and still qualify for a medical or GP visit card. Detailed guidelines are available at: Assessment for a medical card - HSE.ie. www2.hse.ie/services/schemes-allowances/medical-cards/applying/assessment/. Eligibility for a medical card is not granted on the basis of an individual's profession or employment.  Every effort is made by the HSE, within the framework of the legislation, to support applicants in applying for a medical card - in particular, to take full account of difficult circumstances in the case of applicants who may be in excess of the income guidelines. The HSE may exercise discretion and grant a medical card, even though an applicant exceeds the income threshold where they face difficult financial circumstances, such as extra costs arising from an illness. Social and medical issues are also considered when determining whether undue hardship exists for an individual accessing general practitioner or other medical services. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 906. Deputy John Lahart asked the Minister for Health if she will give consideration to providing greater flexibility within the medical card means test so that experienced professionals in essential services such as mental health and child welfare can take on occasional additional hours without losing their medical card; the way in which this could support workforce capacity in sectors experiencing significant staffing pressures; and if she will make a statement on the matter. [71410/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03",
          "showAs": "John Lahart"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_722",
          "debateSectionId": "dbsect_722",
          "showAs": "Medical Cards",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_722.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_906",
        "questionNumber": 906
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 18 and 24 together.  As the Deputies are aware, Capital Acquisitions Tax (CAT) is a tax which applies to both gifts and inheritances. For CAT purposes, the relationship between the person giving a gift or inheritance (i.e. the disponer) and the person who receives it (i.e. the beneficiary) determines the maximum amount, known as the “Group threshold”, below which CAT does not arise.  My officials have examined CAT as part of the annual Tax Strategy Group exercise. The resultant papers outlined the tax policy considerations for the Government and the options available to it in forming this year’s Budget. They were published in advance of the Budget and are the best means of considering issues such as inheritance tax in an analytical and transparent way. The Tax Strategy Group is not a decision-making body and the papers produced by my Department are simply a list of options and issues to be considered in the Budgetary process. The Tax Strategy Group paper relating to CAT also examined a number of cost modelling exercises, including proposals to amend the Group B threshold parameters which I am aware a number of Deputies have raised in the past year.  The Group A threshold increased to €400,000 in Budget 2025. This threshold applies where the beneficiary is a child of the disponer. This includes adopted children, stepchildren and some foster children. Parents may, in certain circumstances, also fall within this threshold where they take an inheritance from a child.  The Group B threshold increased to €40,000 in Budget 2025. This threshold applies where the beneficiary is a brother, sister, niece, nephew, or lineal ancestor or lineal descendant of the disponer. Following recent changes made to Capital Acquisitions Tax legislation, the Group B threshold also applies to persons who receive gifts and inheritances from the wider family of their foster parents, for example, from their foster siblings, uncles, aunts and grandparents.  The Group C threshold increased to €20,000 in Budget 2025. This threshold applies in all other cases.  Capital Acquisition Tax along with all tax heads is kept under review on an ongoing basis. It should be noted that there would be a significant cost in making changes to CAT, as demonstrated by the Tax Strategy Group papers, but I recognise the burden of capital taxation. In this regard, the options available for setting the CAT rate and group thresholds must be balanced against competing demands.  Furthermore, I am advised by Revenue that provisional CAT receipts to the end of November 2025 are €1.075 billion. For comparison, the receipts for the calendar years 2024 and 2023 were €854m and €634m respectively. The bulk of receipts in those years stemmed from inheritances. Receipts from beneficiaries within the Group B threshold in particular represented approximately 42% of CAT receipts in 2024, while receipts from beneficiaries within the Group A threshold represented approximately 46% of CAT receipts in the same year.  Further statistics on CAT receipts are available on the Revenue website. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 24. Deputy John Lahart asked the Tánaiste and Minister for Finance the annual revenue generated for the Exchequer from inheritance tax; and if he will make a statement on the matter. [64359/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03",
          "showAs": "John Lahart"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_38",
          "debateSectionId": "dbsect_38",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_38.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_24",
        "questionNumber": 24
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 36 and 41 together.  Capital Acquisitions Tax (CAT) is a beneficiary-based tax on gifts and inheritances that is payable on the value of the property received. For CAT purposes, the relationship between the person giving a gift or inheritance (i.e. the disponer) and the person who receives it (i.e. the beneficiary) determines the maximum amount, known as the “Group threshold”, below which CAT does not arise. CAT is charged at a rate of 33% above each Group threshold.  There are three Group thresholds:  • the Group A threshold (currently €400,000) applies where the beneficiary is a child of the person giving the gift or inheritance  • the Group B threshold (currently €40,000) applies where the beneficiary is a brother, sister, nephew, niece, lineal ancestor or lineal descendant of the person giving the gift or inheritance  • the Group C threshold (currently €20,000) applies in all other cases.  In light of this issue being raised, my officials examined Capital Acquisitions Tax as part of the annual Tax Strategy Group exercise. The resultant papers outlined the tax policy considerations for the Government and the options available to it in forming this year’s Budget. They were published in advance of the Budget and are the best means of considering issues such as inheritance tax in an analytical and transparent way. The Tax Strategy Group is not a decision-making body and the papers produced by my Department are simply a list of options and issues to be considered in the Budgetary process.  Revenue have indicated that it is very difficult to cost the measure indicated by the Deputy, and have estimated that uplifting Group B to €400,000 would cost approximately €305 million. This cost is estimated on the basis that there would be two separate €400,000 thresholds. In reality however, if this measure were to be implemented, there would be just the one Group A threshold for beneficiaries from parents, aunts, uncles and brothers and sisters which may lower this cost. However, this cannot be accurately costed at this time.  A link to this year’s paper on Capital Taxes which includes some cost modelling can be found here: www.gov.ie/en/department-of-finance/collections/budget-2026-tax-strategy-group-papers/.  There is a significant cost in making changes to CAT. As such the options available for setting CAT thresholds must be balanced against competing demands, but I recognise the burden of capital taxation and will, like all taxation measures, continue to keep it under review.  In addition, I am advised by Revenue that provisional CAT receipts to the end of November 2025 are €1.076 billion.  I am further advised that statistics on CAT receipts are available on the Revenue website at: www.revenue.ie/en/corporate/information-about-revenue/statistics/capital-taxes/cat/receipts-breakdown.aspx. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 36. Deputy John Lahart asked the Tánaiste and Minister for Finance if he has considered the estimated revenue that would be foregone by the Exchequer in the event of changes to inheritance tax rules relating to childless couples and single individuals; and if he will make a statement on the matter. [64360/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03",
          "showAs": "John Lahart"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_56",
          "debateSectionId": "dbsect_56",
          "showAs": "Tax Yield",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_56.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_36",
        "questionNumber": 36
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Government is determined to stamp out hate-motivated crimes and to protect vulnerable communities.  The Criminal Justice (Hate Offences) Act 2024 came into effect at the start of this year. The new legislation provides for increased prison sentences for certain crimes, where they are proven to be motivated by hatred, or where hatred is demonstrated based on the identity of the victims.  I can assure the Deputy that An Garda Síochána takes hate crime very seriously. Every hate crime reported to An Garda Síochána is professionally investigated and victims supported during the criminal justice process.  In relation to the Deputy's question about an IPAS centre and residents, the Department cannot comment on a matter that is part of a current criminal investigation.  However, I can advise the Deputy that concerns about resident safety and welfare are treated as a priority. IPAS has a dedicated Resident Welfare Team who can provide supports to residents, and refer and connect them to specialist services as needed. They also have discretion to recommend a transfer of residents to alternative accommodation, where this is considered necessary and where accommodation is available.  Without breaching confidentiality of any resident, I confirm that my officials are aware of this case and are giving it attention. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 696. Deputy John Lahart asked the Minister for Justice, Home Affairs and Migration with regard to the Kilbride Army camp which is being used as an IPAS centre, if he is aware that enhanced safety measures are required as a result of recent attacks on men; if he will consider transferring them to a safe place; if swift action will be taken to ensure their continued protection; if an investigation will be carried out into the threats and harassment they are facing when they leave the camp; and if he will make a statement on the matter. [70034/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03",
          "showAs": "John Lahart"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_556",
          "debateSectionId": "dbsect_556",
          "showAs": "International Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_556.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_696",
        "questionNumber": 696
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice  I can advise the Deputy that on 26 November government approval was secured to introduce new policies and legislative changes to strengthen Ireland’s migration and asylum system to ensure it is rules-based, efficient and more aligned with EU Member States.  I intend to make a number of changes to the rules on the granting of citizenship.  The former policy of granting citizenship to all beneficiaries of international protection after a time period of three years will no longer apply. In general, the time a successful international protection applicant must wait to apply for citizenship will be extended from 3 to 5 years in line with most other citizenship applications, and came into effect from Monday, 8 December 2025. Applications received before 8 December 2025 will continue to be processed under the previous requirements.  I can inform the Deputy that the new changes will not affect applicants who are spouses of Irish nationals where the requirement is 3 years.  A determination on whether an applicant satisfies the statutory criteria for naturalisation can only be made after an application is received. In all cases, the final 12 months must be continuous residence in the State with up to 70 days allowed to facilitate foreign travel for business family or holiday purposes.  These new policies and legislative changes are designed to strengthen the system integrity, enhance clarity for applicants, and ensure that migration pathways remain fair, transparent and sustainable.  It is open to the person concerned to submit an application for a certificate of naturalisation if they satisfy the relevant criteria.  Detailed information on how to apply for naturalisation and other resources is available on my Department’s Immigration website here: https://www.irishimmigration.ie/how-to-become-a-citizen/ ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 727. Deputy John Lahart asked the Minister for Justice, Home Affairs and Migration to provide details of new migration arrangements (details supplied); and if he will make a statement on the matter. [70353/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03",
          "showAs": "John Lahart"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_582",
          "debateSectionId": "dbsect_582",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_582.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_727",
        "questionNumber": 727
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As the Deputy may be aware, the National Transport Authority (NTA) has responsibility for the planning and development of public transport infrastructure in the Greater Dublin Area (GDA) including, in consultation with Iarnród Éireann, the DART+ programme.  DART+ South West, which is part of the DART+ programme, involves the extension of DART services from the City Centre to Hazelhatch and Celbridge, increasing train capacity from 12 to 23 trains per hour per direction and increasing passenger capacity from the current peak capacity of circa 5,000 to 20,000 passengers per hour per direction. An Coimisiún Pleanála granted planning permission for DART+ South West in November 2024. Procurement for DART+ South West and West is progressing with pre-qualification questionnaires notices for Design and Build works advertised in May 2025.  In October 2024, the Government gave its consent to the Luas Finglas project at Approval Gate 1 in line with the Infrastructure Guidelines. This has allowed the project to enter the statutory planning process. TII submitted a Railway Order Application to An Coimisiún Pleanála in November 2024. Public submissions closed on 20 January 2025. An Coimisiún Pleanála published its decision to grant the Luas Finglas Railway Order in October 2025. The project will now move toward procurement, assuming there are no successful legal challenges to An Coimisiún Pleanála’s decision.  As noted in the recent National Development Plan Transport Sectoral Plan for 2026 to 2030, construction is currently scheduled to commence in 2029. However, officials in my Department will keep this under constant review and accelerate project timelines where operating readiness and funding allows.  The Sectoral Plan sees the allocation of €22.3 billion in Exchequer resources to Transport, along with an additional allocation of €2 billion from the country's Infrastructure, Climate and Nature Fund to support the development of MetroLink.  Of this total allocation, funding of circa €10 billion for public transport infrastructure is earmarked from 2026 to 2030, in addition to the €2 billion for MetroLink, primarily in line with the Department’s NIFTI intervention hierarchy of Maintain, Optimise, Improve, and New. This approach involves prioritising investment in the protection and renewal of existing assets before investing in new ones, on economic and environmental grounds.  This funding will see significant advancements made in a number of public transport projects, including commencing construction on DART+ Programme and Luas Finglas.  The Department of Transport will continue to explore opportunities for additional funding, including through funding streams such as the European Union Connecting Europe Facility (CEF), to compliment national Exchequer funding which may allow some projects to proceed to construction earlier than currently anticipated.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 224. Deputy John Lahart asked the Minister for Transport the reason crucial Luas Finglas and DART South-West projects have been delayed in favour of funding roads; and if he will make a statement on the matter. [68883/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03",
          "showAs": "John Lahart"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_227",
          "debateSectionId": "dbsect_227",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_227.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_224",
        "questionNumber": 224
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  I wish to advise that all enquiries relating to driver licensing are handled by the National Driver Licence Service, the provision of which I have delegated under national legislation to the Road Safety Authority. Neither I nor my Department may become involved in any individual application.  I have referred this matter to the Authority for direct reply. Please contact my office if you have not received a reply within 10 days. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 225. Deputy John Lahart asked the Minister for Transport his views on a matter (details supplied); and if he will make a statement on the matter. [68884/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03",
          "showAs": "John Lahart"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_228",
          "debateSectionId": "dbsect_228",
          "showAs": "Driver Licences",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_228.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_225",
        "questionNumber": 225
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 195, 196, 197, 198, 199 and 226 together.  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. As a commercial semi-state body, Córas Iompair Éireann (CIÉ) are responsible for the provision of pension schemes for their employees. Any correspondence received by my Department in relation to CIÉ Pension Schemes will be processed via the Department's central eCorrespondence system, with replies issued by officials in due course.  Regarding the recent engagement between CIÉ and the Trade Union Group (TUG) on the matter of the CIÉ Pension Schemes, the Department acknowledges the longstanding tradition within CIÉ of ensuring that terms and conditions of employees, which include pension provision, are negotiated collectively with recognised Trade Unions.  I welcome the constructive and collaborative approach of the Trade Union Group and CIÉ management in reaching agreement on a pathway forward, which is aimed at balancing the objectives of supporting the future sustainability of the schemes, protecting existing benefits for members of the scheme (including pensioners), and contributing to the overall financial stability of the CIÉ Group.  I acknowledge the positive outcome from the ballot held on the CIÉ Pension Proposal for both Schemes, which was agreed by CIÉ and the TUG in May of this year.  In line with the appropriate processes and compliance with all applicable requirements, my Department will continue to engage with CIÉ as well as financial advisors at NewERA, the Pensions Authority and the Department of Public Expenditure, Infrastructure, Public Services, Reform and Digitalisation on the next steps in progressing the agreement and bringing CIÉ pensions onto a more stable footing for the benefit of active, and retired scheme members.  Decisions regarding pension increases are ultimately a matter for the CIÉ Board as informed by actuarial advice and is subject to requirements imposed by statute and scheme rules. Accordingly, I have referred this aspect of the Deputy's question to CIÉ for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 226. Deputy John Lahart asked the Minister for Transport for a progress report on matters pertaining to the pension entitlements and arrangements for retired CIÉ workers; and if he will make a statement on the matter. [68885/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03",
          "showAs": "John Lahart"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_206",
          "debateSectionId": "dbsect_206",
          "showAs": "Pension Provisions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_206.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_226",
        "questionNumber": 226
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 21, 23, 41 and 50 together.  At this critical juncture for Ukraine, after almost 4 years of brutal Russian aggression, I want to emphasise Ireland’s unequivocal support and solidarity.  I attended the meeting of the Foreign Affairs Council on 20 November where Ukraine’s Foreign Minister Sybiha spoke about recent Russian attacks against Ukraine. I also participated in a meeting of the Foreign Affairs Council on 26 November, also addressed by Foreign Minister Sybiha.  I welcome the ongoing efforts of President Trump and the United States to end Russia’s war of aggression against Ukraine and achieving a just and lasting peace and security for Ukraine.  It is more important than ever that Europe and the United States continue to work together to achieve this.  The emerging US proposals, as well as plans for further negotiations, represent a step forward. I welcome the progress made at Sunday’s meetings between US and Ukraine in Geneva. We look forward to these talks continuing in a positive manner and to further progress being achieved.  Ukraine is engaging positively and constructively in these discussions despite the ongoing Russian military assault on its towns and cities, ports and critical energy infrastructure.  It is crucial that any agreement upholds Ukraine’s sovereignty and independence based on respect for the principles of the UN Charter. The fundamental principle that borders cannot be changed by force must be upheld.  Any agreement must also protect Ukraine and Europe’s vital security. That means strong, credible guarantees that ensure Ukraine can defend its sovereignty and to avoid a repetition of the past.  This is not just vital for Ukraine - it is also vital for the European Union and all its Member States, including Ireland.  The Taoiseach and I remain in close contact with our European partners to achieve this. The Taoiseach took part in a meeting the European Council on 24 November and a meeting of the leaders of the “Coalition of the Willing” on 25 November.  The threat posed by Russia extends beyond Ukraine. We have recently seen the airspace of our EU partners violated by drones and planes and other hybrid activities within the EU. The Government has strongly condemned these hybrid activities.  The Government takes the risks posed by these activities and the transformed security landscape in Europe very seriously.  We are actively and constructively engaging in the development of EU policies aimed at combatting hybrid threats and in particular Russia’s campaign of hybrid activity against the EU and its Member States.  We will continue to work with our EU partners to strengthen our collective resilience. Domestically, the Government is implementing a range of relevant measures at national level to combat hybrid threats from state and non-state actors. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "John Lahart",
          "memberCode": "John-Lahart.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_56.xml"
            }
          },
          "debateSectionId": "dbsect_56",
          "showAs": "Ukraine War",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_56"
        },
        "questionNumber": 41,
        "date": "2025-11-27",
        "showAs": " 41. Deputy John Lahart asked the Minister for Foreign Affairs and Trade her response to the US-Russia agreement on Ukraine, which appears to propose rewarding Russian aggression with territorial gains; and if she will make a statement on the matter. [66693/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_41"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Foreign Affairs and Trade  The Government remains committed to supporting democratisation, human rights, and the rule of law, as a key element of our foreign policy. Support to election observation is central to this commitment and Ireland has contributed observers to international election observation missions since the 1990s.  The Department of Foreign Affairs and Trade maintains and administers a roster enabling Ireland to respond to calls to participate in election observation missions coordinated by the OSCE and the EU. The current five-year Roster commenced on 1 January 2024 and has 170 members.  Since the start of 2024, 111 members of the Roster, including 77 this year, have participated in 26 election observation missions across five continents. Roster members have represented Ireland on OSCE missions to Albania, Azerbaijan (twice), Bosnia & Herzegovina, Georgia, Kyrgyzstan, Moldova (twice), Mongolia, North Macedonia (twice), Romania, Serbia, the United States, and Uzbekistan. Members have also participated on EU Missions to Bolivia, Ecuador, Guyana, Honduras, Jordan, Kosovo, Malawi, Mozambique, Philippines, Senegal, and Sri Lanka.  The budget for Ireland’s Roster has increased by 50%, from €200,000 in 2024, to €300,000 in 2025. This budget is limited to supporting nominations to missions in countries eligible to receive Official Development Assistance (ODA), as classified by the OECD. Where missions take place in countries which are not eligible for ODA, financial support may be provided from other budget lines to allow for participation, as was the case for the US Elections in 2024 and Romanian Elections in 2025. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "John Lahart",
          "memberCode": "John-Lahart.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_83.xml"
            }
          },
          "debateSectionId": "dbsect_83",
          "showAs": "Human Rights",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_83"
        },
        "questionNumber": 56,
        "date": "2025-11-27",
        "showAs": " 56. Deputy John Lahart asked the Minister for Foreign Affairs and Trade in view of Ireland's commitment to supporting democratisation, human rights and the rule of law as a key element of foreign policy, the extent to which Ireland is currently contributing observers to international election observation missions; and if she will make a statement on the matter. [66692/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_56"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Transport  Under European Union Regulation 1008/2008 on common rules for the operation of air services in the Community, airlines have full pricing freedom in relation to setting air fares for intra-Community air services and other related services such as baggage.  The Regulation requires that air fares be transparent i.e. that passengers booking a flight must be aware of the final price of a flight including any supplemental elements selected by the passenger, at all times during the booking process.  Within this framework airlines regularly take into account various operational realities in setting these fares and charges over time, for example flights at peak times or with short advance bookings may attract higher prices which is an industry norm. ",
        "to": {
          "showAs": "Transport",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "John Lahart",
          "memberCode": "John-Lahart.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_222.xml"
            }
          },
          "debateSectionId": "dbsect_222",
          "showAs": "Transport Infrastructure Ireland",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_222"
        },
        "questionNumber": 261,
        "date": "2025-11-27",
        "showAs": " 261. Deputy John Lahart asked the Minister for Transport if he has engaged with airlines in relation to the sharp increases in flight prices coinciding with major events such as football matches, music concerts, and other large-scale gatherings; and the measures his Department is taking to protect consumers from excessive or opportunistic pricing during such periods. [67207/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_261"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "showAs": " 51. Deputy John Lahart asked the Minister for Housing, Local Government and Heritage if his Department is reviewing the approval and handover process involving local authorities and approved housing bodies, with a view to expediting occupancy of completed social housing units; and the specific steps which are now being implemented to accelerate the allocation of homes such as those at a location (details supplied). [65837/25] ",
        "debateSection": {
          "showAs": "Housing Schemes",
          "debateSectionId": "dbsect_84",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_84",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_84.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "John Lahart",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03",
          "memberCode": "John-Lahart.D.2016-10-03"
        },
        "questionNumber": 51,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 51 and 67 together.  My Department operates a number of funding programmes that assist Local Authorities to work in partnership with Approved Housing Bodies (AHBs) to construct and purchase homes and make them available for Social Housing.  The Capital Advance Leasing Facility (CALF) is a funding stream exclusively provided to AHBs by local authorities to facilitate the funding of construction or purchase of new social housing units. This loan facility is a contract between the local authority and the AHB, which supports between 25% and 30% of the eligible capital cost of the housing project, with the remaining finance sourced by the AHBs from private lenders (usually the HFA). The housing units are provided to local authorities for social housing use under long-term lease arrangements known as Payment and Availability Agreements (P&A).  Applications for P&A-CALF funding are made by AHBs directly to my Department. This is done following a consultation period with the Local Authority. During this period the Local Authority confirms their support for the proposed homes and agrees the need and the terms and conditions of the availability agreement around the homes.  As with all Exchequer-supported projects, my Department as sanctioning authority, assesses each project proposal for suitability as determined by the Local Authority, value for money and compliance with the various requirements of the funding programme.  With regard to the specific project referred to in the question, an application for CALF funding was submitted to my Department by Oaklee Housing for the provision of 37 social housing properties.  My Department has met with Oaklee Housing on a number of occasions to discuss the particulars of this project and funding was approved for the 37 properties on 31 July 2025.  However, the allocation of social housing to tenants and matters arising, including the length of time it takes for this to happen upon completion of a project, is a matter for the Local Authority and accordingly such information sought is not available in my Department.  Section 63(3) of the Local Government Act 2001 provides that, subject to law, a local authority is independent in the performance of its functions. Section 6 of the Housing (Miscellaneous Provisions) Act 2009 specifically provides that the Minister’s power to issue policy directions and guidelines to housing authorities in relation to their housing functions shall not be construed as enabling the Minister to exercise any power or control in relation to any individual case with which a housing authority is or may be concerned.  As Minister, therefore, I am precluded by law from intervening in any decisions made by housing authorities in their management of particular dwellings. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_51",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 67. Deputy John Lahart asked the Minister for Housing, Local Government and Heritage the reasons the completed social housing units at a location (details supplied) remained vacant for close to a year before tenants were allocated homes; and the measures which are being taken to ensure that newly completed units are not subject to similar delays in future, particularly where demand is high. [65836/25] ",
        "debateSection": {
          "showAs": "Housing Schemes",
          "debateSectionId": "dbsect_84",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_84",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_84.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "John Lahart",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03",
          "memberCode": "John-Lahart.D.2016-10-03"
        },
        "questionNumber": 67,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 51 and 67 together.  My Department operates a number of funding programmes that assist Local Authorities to work in partnership with Approved Housing Bodies (AHBs) to construct and purchase homes and make them available for Social Housing.  The Capital Advance Leasing Facility (CALF) is a funding stream exclusively provided to AHBs by local authorities to facilitate the funding of construction or purchase of new social housing units. This loan facility is a contract between the local authority and the AHB, which supports between 25% and 30% of the eligible capital cost of the housing project, with the remaining finance sourced by the AHBs from private lenders (usually the HFA). The housing units are provided to local authorities for social housing use under long-term lease arrangements known as Payment and Availability Agreements (P&A).  Applications for P&A-CALF funding are made by AHBs directly to my Department. This is done following a consultation period with the Local Authority. During this period the Local Authority confirms their support for the proposed homes and agrees the need and the terms and conditions of the availability agreement around the homes.  As with all Exchequer-supported projects, my Department as sanctioning authority, assesses each project proposal for suitability as determined by the Local Authority, value for money and compliance with the various requirements of the funding programme.  With regard to the specific project referred to in the question, an application for CALF funding was submitted to my Department by Oaklee Housing for the provision of 37 social housing properties.  My Department has met with Oaklee Housing on a number of occasions to discuss the particulars of this project and funding was approved for the 37 properties on 31 July 2025.  However, the allocation of social housing to tenants and matters arising, including the length of time it takes for this to happen upon completion of a project, is a matter for the Local Authority and accordingly such information sought is not available in my Department.  Section 63(3) of the Local Government Act 2001 provides that, subject to law, a local authority is independent in the performance of its functions. Section 6 of the Housing (Miscellaneous Provisions) Act 2009 specifically provides that the Minister’s power to issue policy directions and guidelines to housing authorities in relation to their housing functions shall not be construed as enabling the Minister to exercise any power or control in relation to any individual case with which a housing authority is or may be concerned.  As Minister, therefore, I am precluded by law from intervening in any decisions made by housing authorities in their management of particular dwellings. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_67",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 151. Deputy John Lahart asked the Minister for Foreign Affairs and Trade if she has plans to examine a shorter-term, more affordable passport renewal option for seniors (details supplied); and if she will make a statement on the matter. [65359/25] ",
        "debateSection": {
          "showAs": "Passport Services",
          "debateSectionId": "dbsect_165",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_165",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_165.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "John Lahart",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03",
          "memberCode": "John-Lahart.D.2016-10-03"
        },
        "questionNumber": 151,
        "answerText": " Minister for Foreign Affairs and Trade  The standard Irish passport issued to adults is valid for 10 years, which is a common validity period for adult passports worldwide. Passport fees were last updated in June 2019 and set out in Statutory Instrument No. 259/2019 - Diplomatic and Consular Fees. At that time, the fee for adult passports applied for through the Passport Online service was reduced from €80 to €75.  Given that the production cost of a passport is the same, irrespective of validity, and that any shortfall in revenue or additional costs would have to be met by the taxpayer, there are currently no plans to offer the option of a passport with a shorter period of validity at a reduced cost.  I am satisfied that, at a cost of €75 for an online application, which breaks down to €7.50 per year, the Irish passport fee compares favourably with the services offered elsewhere. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Foreign",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_151",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 256. Deputy John Lahart asked the Tánaiste and Minister for Finance to examine the recommendation of the Oireachtas Public Accounts Committee (details supplied) as they relate to the Taxes Consolidation (Rights of Performers and Film Workers) (Amendment) Bill 2025. [65235/25] ",
        "debateSection": {
          "showAs": "Tax Reliefs",
          "debateSectionId": "dbsect_262",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_262",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_262.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "John Lahart",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03",
          "memberCode": "John-Lahart.D.2016-10-03"
        },
        "questionNumber": 256,
        "answerText": " Tánaiste and Minister for Finance  Section 481 TCA 1997 provides relief in the form of a corporation tax credit related to the cost of production of certain films. The scheme is intended to act as a stimulus to the creation of an indigenous film industry in the State, creating quality employment opportunities and supporting the expression of Irish culture. The credit is granted at a rate of 32% of up to €125 million.  I am aware of the review published by the Oireachtas Committee on Budgetary Oversight following its examination of the section 481 film tax credit, and of the recommendations made therein. In relation to Recommendation 7 regarding intellectual property rights and Recommendation 8 regarding compliance with relevant copyright legislation, I would note that copyright law falls within the remit of the Department of Enterprise, Tourism and Employment. Copyright is relevant for many workers in the film sector, including authors, producers and broadcasters in addition to performers and there are complex legal issues involved.  Although compliance with copyright law is not a specific criterion as part of the application process for section 481, it is important to remember that section 481 is a tax credit and that copyright legislation applies regardless of whether it is referenced as part of a formal process associated with obtaining the credit.  Notwithstanding this, my officials have engaged in detail with relevant stakeholders in the sector, including representative bodies, to gain an understanding of the issues raised over the last number of years.  In order to identify a pathway forward, an independent facilitator was retained by Screen Ireland in 2023 to meet with a group of key stakeholders, to identify and understand issues relevant to the Digital Single Market Directive (referred to as the Copyright Directive). As a result of this process, industry stakeholders have agreed interim best practice industry guidelines while they pursue a path towards a collective bargaining agreement.  It is my view that direct engagement between industry bodies is the most effective pathway to resolving any remaining issues in respect of copyright. Should any issues with Copyright legislation as it currently stands be identified as part of this process, this will be a matter for the Minister of Enterprise, Tourism and Employment. However, my officials will continue to monitor progress in this area. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Finance",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_256",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 345. Deputy John Lahart asked the Minister for Education and Youth is she aware of a spike in reported stress issues for post-primary school children, in terms of examination anxiety and so on; the way in which this is being addressed and the plans she has; and if she will make a statement on the matter. [65189/25] ",
        "debateSection": {
          "showAs": "Education Policy",
          "debateSectionId": "dbsect_339",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_339",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_339.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "John Lahart",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03",
          "memberCode": "John-Lahart.D.2016-10-03"
        },
        "questionNumber": 345,
        "answerText": " Minister for Education and Youth  The Department acknowledges that the months leading up to, and during the State Certificate examinations, can be a difficult time for students. My department is addressing these stresses both through the curriculum as well as the enhanced wellbeing supports available in our post-primary schools.  Through the curriculum the Deputy will be aware Classroom-Based Assessments (CBAs) are a component of assessment introduced under the Junior Cycle Framework (2015). They are designed to spread assessment activity over the second and third years of Junior Cycle to increase the interest, engagement and motivation of students and to reduce the emphasis on a final examination that ‘counts for everything’. They are meant to reflect what students would be learning and doing in everyday classrooms – speaking in languages, investigating in science, doing project work in business, producing artefacts in practical subjects etc. They are designed to be closely associated with, and to mirror, everyday normal classroom learning and assessment activity, even if they take place over particular timeframes.  Efforts have been made to prevent overassessment and to reduce workload. Schools are advised of the need to consider the cumulative burden on students and teachers of multiple assessments across the full range of subjects. For example, as laid out in the most recent Junior Cycle implementation circular, CL 28/2023, schools are advised that CBAs will substitute for other assessments currently undertaken in the school such as in-house examinations. This can be accessed online at assets.gov.ie/static/documents/5f9befcf-00282023-.pdf. Further reading for this can be found in the accompanying Information Note TC 0004/2025, published in May for the 2025/2026 school year, which can be viewed on assets.gov.ie/static/documents/Junior_Cycle_Information_Note_May_2025.pdf. The Department has also issued advice to schools to assist them in the scheduling of CBAs: assets.gov.ie/static/documents/advice-in-relation-to-scheduling-of-classroom-based-assessments-in-junior-cycle.pdf. This document provides guidance in areas such as linking CBAs to ongoing assessment and routine classroom practice, and how to avoid over assessment  My Department is continuing to implement an ambitious programme of Senior Cycle Redevelopment that delivers “equity and excellence for all”.  Under the Redevelopment programme, the specifications for all current Leaving Certificate curricular subjects are scheduled to be redeveloped by 2029.  Each new and revised Leaving Certificate subject will incorporate an Additional Assessment Component (AAC) worth at least 40% of the overall available marks. These will be externally assessed by the State Examinations Commission.  The introduction of additional assessment components other than traditional examinations in each subject will enable the assessment load experienced by Senior Cycle students to be spread more evenly, with a reduced emphasis on the final examinations in June of Sixth Year.  This will contribute to alleviating one of the key sources of stress cited by students and parents in their Senior Cycle experience.  9 new and revised specifications were introduced into the national curriculum in September, with current fifth years studying these subjects in classrooms today.  Additionally, The Department of Education and Youth’s approach to supporting wellbeing and mental health is set out in its Wellbeing Policy Statement and Framework for Practice, published since 2018. The approach is founded on research and best international practice of how schools can best support the wellbeing and mental health of children and young people. The approach is a whole school and preventative approach which has multiple components that include:  - Providing children and young people with opportunities to build core social and emotional skills and competencies  - Providing children and young people with opportunities to experience supportive relationships within the school setting and to learn through those relationships  - Providing children and young people with opportunities to be part of a school environment and culture that feels both physically and psychologically safe  - Schools are encouraged to develop policies that create an environment in which children and young people feel a sense of belonging and connectedness, in which they feel their voice is heard, and they feel supported.  - Schools are encouraged to use a reflective, school self-evaluation approach to identify and prioritise the needs of its own school community in relation to the promotion of wellbeing and mental health, and to respond to meeting those needs.  Policy implementation responsibility is coordinated by the Department’s Wellbeing Office which is situated within the National Educational Psychological Service (NEPS).  A dedicated wellbeing portal can be accessed via ‘Wellbeing in Education’ on gov.ie bringing together all the wellbeing and mental health supports and resources that have been developed by the Department and the Department’s support services. There is a dedicated page on the portal where students, parents and school staff can access wellbeing advice related to exam stress www.gov.ie/en/department-of-education/publications/wellbeing-support-for-exam-students-parents-and-school-staff/.  The Department of Education National Educational Psychological Service (NEPS) provides a school-based, consultative, psychological service through the provision of an individual casework service for students and a support and development service for school staff. The NEPS Support and Development service for school staff helps them build their capability to respond to the wellbeing, academic, social and emotional needs of all students, and particularly those who are experiencing barriers to their wellbeing, learning, inclusion and participation.  At post primary level, a Student Support Team is a student-focused mechanism put in place by a school in order to co-ordinate the support available for students in the school and to facilitate links to the community and other non-school support services. NEPS provides support to post primary schools in the setting up or review of Student Support Teams.  Also at post primary level, counselling is a key part of the role of the Guidance Counsellor, offered on an individual or group basis as part of a developmental learning process, at moments of personal crisis but also at key transition points.  Neart – the Irish word for strength - is a first of its kind collaboration, being delivered in a partnership model between NEPS and Jigsaw - The National Centre for Youth Mental Health that runs until the end of the 2026-2027 academic year designed to complement with additional supports existing systems and structures for wellbeing and mental health in post-primary schools. Information is available at jigsaw.ie/neart/.  The Department of Health leads on mental health policy in Ireland. They have responsibility for the provision of counselling services in Ireland, and through HSE Primary Care Psychology and Child and Adolescent Mental Health Services (CAMHS) provides clinical support to children and young people with mental health needs. In addition, the HSE and its funded providers, provide e-mental health services that offer online text and telephone supports to people seeking mental health information and advice.  These include services provided by the Samaritans, Pieta House, MyMind, Turn2Me, Aware, Crisis Text Ireland, Shine, BeLongTo, LGBT Ireland, Jigsaw, Spunout, Bodywhys and Childline. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_345",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 346. Deputy John Lahart asked the Minister for Education and Youth her plans for a survey on parents of post-primary school students in view of the survey of primary school parents; and if she will make a statement on the matter. [65190/25] ",
        "debateSection": {
          "showAs": "Education Policy",
          "debateSectionId": "dbsect_340",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_340",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_340.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "John Lahart",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03",
          "memberCode": "John-Lahart.D.2016-10-03"
        },
        "questionNumber": 346,
        "answerText": " Minister for Education and Youth  On 4 November, my department announced the launch of an online, school-specific survey of parents and guardians, and primary school communities in line with the department’s Education Plan 2025 which commits to seeking to increase choice for parents by ensuring that families can access both multi/non-denominational and faith-based education.  The survey is for:  • Parents and guardians of children who have not yet started primary school  • Parents and guardians of children currently attending primary school  • Primary school staff and Board of Management members.  This is the first time that a national survey of this scale is being undertaken. Parents and guardians of children who are either in, or have yet to start primary school, are being asked their preference on important aspects of school provision and choice in respect of the school that their children attend now or will attend in the future.  This is the first survey of its type and involves significant logistical arrangements. The learnings from the process can be useful in respect of any future survey requirement.  Nationally, at post-primary level, 48.6% of students are enrolled in multi-denominational or inter-denominational schools, 47.8% are enrolled in schools with a Catholic ethos and 2.9% are enrolled in schools with a Church of Ireland ethos. (The remaining 0.7% is accounted for by post-primary schools with an ethos other than Catholic, Church of Ireland, inter-denominational or multi-denominational). ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_346",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_108",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_108",
          "showAs": "Health Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_108.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 91. Deputy John Lahart asked the Minister for Health if she will address the recent reduction in funding for an organisation (details supplied); if she is aware that discontinuing the twelve-week introductory programme for new members has significantly reduced accessibility; if she will consider restoring funding to ensure affordability for older participants, given that current costs are prohibitive for many; if private health insurance typically covers the organisations programmes, given many members report they are not reimbursed; and if she will make a statement on the matter. [64353/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_91",
        "answerText": " Minister of State at the Department of Health  The services referred to by the Deputy are provided by the HSE through its Community-Based Physical Activity Programmes for Chronic Disease, Tier 2. I have been advised by the HSE that funding to access this programme in the Dublin and Midlands Health Region has not been reduced in 2025.  The HSE operates a ranked drawdown mechanism for each physical activity programme following a tendering process. The provision of exercise programmes is delivered by the top-ranked service provider, based on service requirements, from this tendering process. Accordingly, these services may be delivered by the organisation referred to by the Deputy, or by other service providers, depending on the specific service to be provided.  The HSE works in partnership with a range of organisations to promote and provide a tailored suite of opportunities for physical activity for different population cohorts. In line with the key goals of Healthy Ireland, the promotion of physical activity supports our efforts to increase the proportion of people who are healthy at all stages of life and to reduce health inequalities.  These programmes are informed by Every Move Counts, our national physical activity and sedentary behaviour guidelines, which were published in 2024 and provide specific recommendations for each population cohort. ",
        "questionNumber": 91,
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03",
          "showAs": "John Lahart"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_148",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_148",
          "showAs": "Health Services Waiting Lists",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_148.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 130. Deputy John Lahart asked the Minister for Health the policy measures in place to ensure timely assignment of case managers or social workers for adults with complex needs who are identified as high clinical risk; if she will review current waiting list management for disability services to prevent prolonged delays; the safeguarding protocols which apply in cases where individuals live in non-sheltered settings without support; and if she will make a statement on the matter. [64354/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_130",
        "answerText": " Minister for Health (Deputy Jennifer Carroll MacNeill)  This is a matter for the Department of Disabilities, Children and Equality and should be redirected to that Department. ",
        "questionNumber": 130,
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03",
          "showAs": "John Lahart"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_225",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_225",
          "showAs": "Departmental Inquiries",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_225.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 206. Deputy John Lahart asked the Minister for Foreign Affairs and Trade the details of Irelands contribution to the OSCE; the details of some of its functions; the details of Ireland's role within it as a member and its growing importance in the present turbulent global context. [65025/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_206",
        "answerText": " Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 206 and 207 together.  Ireland has been a very active OSCE participating State since the Helsinki Summit in 1975. The vision of the Organisation aligns with what has been a long-standing focus of Irish foreign policy: the promotion of peace and security through multilateral cooperation and respect for human rights and the rule of law.  The OSCE embraces a comprehensive concept of security spanning three ‘dimensions’; Politico-military; Economic and Environmental; and Human.  Ireland has played a consistently active role in OSCE’s Human Dimension fora (Human Dimension Committee, Warsaw Human Dimension Conference) over the years.  As chair of the Human Dimension Committee in 2023 and 2024, Ireland ensured that the human rights situation in Ukraine arising from Russia’s war of aggression remained a key focus of the Committee’s work, while also addressing other important and topical human dimension issues across the region.  From September to December of 2027, Ireland will chair the Forum for Security Co-operation (FSC). The FSC is an autonomous decision-making body of the OSCE, dealing with political and military dimensions of security. The Chairperson manages and chairs formal FSC meetings, which take place at least once per week with the participation of all 57 participating States.  The OSCE remains an important multilateral forum for dialogue on issues of security and human rights. Ireland will continue to play an active role across the various dimensions of the organisation’s work, including holding Russia to account for its illegal war of aggression in Ukraine.  Since 2022, Ireland has significantly stepped up extra-budgetary funding to ensure the functioning of the OSCE. The passage of a unified budget remains high on Ireland’s list of priorities. Ireland has allocated €1.75 million in funding to support the OSCE in 2025. This comprises our mandatory contribution and a supplementary funding package to cover costs in the absence of agreement on a unified budget. ",
        "questionNumber": 206,
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03",
          "showAs": "John Lahart"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_225",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_225",
          "showAs": "Departmental Inquiries",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_225.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 207. Deputy John Lahart asked the Minister for Foreign Affairs and Trade if he will report on Ireland's financial contribution to the OSCE; and if he will make a statement on the matter. [65026/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_207",
        "answerText": " Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 206 and 207 together.  Ireland has been a very active OSCE participating State since the Helsinki Summit in 1975. The vision of the Organisation aligns with what has been a long-standing focus of Irish foreign policy: the promotion of peace and security through multilateral cooperation and respect for human rights and the rule of law.  The OSCE embraces a comprehensive concept of security spanning three ‘dimensions’; Politico-military; Economic and Environmental; and Human.  Ireland has played a consistently active role in OSCE’s Human Dimension fora (Human Dimension Committee, Warsaw Human Dimension Conference) over the years.  As chair of the Human Dimension Committee in 2023 and 2024, Ireland ensured that the human rights situation in Ukraine arising from Russia’s war of aggression remained a key focus of the Committee’s work, while also addressing other important and topical human dimension issues across the region.  From September to December of 2027, Ireland will chair the Forum for Security Co-operation (FSC). The FSC is an autonomous decision-making body of the OSCE, dealing with political and military dimensions of security. The Chairperson manages and chairs formal FSC meetings, which take place at least once per week with the participation of all 57 participating States.  The OSCE remains an important multilateral forum for dialogue on issues of security and human rights. Ireland will continue to play an active role across the various dimensions of the organisation’s work, including holding Russia to account for its illegal war of aggression in Ukraine.  Since 2022, Ireland has significantly stepped up extra-budgetary funding to ensure the functioning of the OSCE. The passage of a unified budget remains high on Ireland’s list of priorities. Ireland has allocated €1.75 million in funding to support the OSCE in 2025. This comprises our mandatory contribution and a supplementary funding package to cover costs in the absence of agreement on a unified budget. ",
        "questionNumber": 207,
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03",
          "showAs": "John Lahart"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_226",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_226",
          "showAs": "Departmental Inquiries",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_226.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 208. Deputy John Lahart asked the Minister for Foreign Affairs and Trade his views on increasing funding to the OSCE for election observation on the basis that investment in such processes protects and strengthens democratic processes and institutions (details supplied) [65027/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_208",
        "answerText": " Minister of State at the Department of Foreign Affairs and Trade  The Government is committed to supporting democratisation, human rights, and the rule of law, as a key element of our foreign policy. Support to election observation is central to this commitment and Ireland has contributed observers to international election observation missions since the 1990s.  The Department of Foreign Affairs and Trade maintains and administers a roster enabling Ireland to respond to calls to participate in election observation missions coordinated by the OSCE and the EU. The current five-year Roster commenced on 1 January 2024 and has 170 members.  Since the start of 2024, 111 members of the Roster, including 77 this year, have participated in 26 election observation missions across five continents. Roster members have represented Ireland on OSCE missions to Albania, Azerbaijan (twice), Bosnia & Herzegovina, Georgia, Kyrgyzstan, Moldova (twice), Mongolia, North Macedonia (twice), Romania, Serbia, the United States, and Uzbekistan. Members have also participated on EU Missions to Bolivia, Ecuador, Guyana, Honduras, Jordan, Kosovo, Malawi, Mozambique, Philippines, Senegal, and Sri Lanka.  The budget for Ireland’s Roster has increased by 50%, from €200,000 in 2024, to €300,000 in 2025. This budget is limited to supporting nominations to missions in countries eligible to receive Official Development Assistance (ODA), as classified by the OECD. Where missions arise in countries which are not eligible for ODA, financial support may be provided from other budget lines to allow for participation, as was the case for the US Elections in 2024 and Romanian Elections in 2025.  We have a very constructive relationship with the OSCE, and Ireland is consistently very well represented on OSCE election monitoring missions. ",
        "questionNumber": 208,
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03",
          "showAs": "John Lahart"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_524",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_524",
          "showAs": "Departmental Properties",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_524.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 655. Deputy John Lahart asked the Minister for Health her views on the proposed sale of the Baggot Street Hospital.; and if she will make a statement on the matter. [65028/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_655",
        "answerText": " Minister for Health (Deputy Jennifer Carroll MacNeill)  Following extensive review, the former Baggot Street Hospital was identified by the HSE a number of years ago as surplus to health service requirements, and it decided to dispose of the property. The disposal of Baggot Street Hospital has been carried out in line with Department of Public Expenditure and Reform Circular 11/2015, Protocols for the Transfer and Sharing of State Property Assets (the “Protocol”).  The Protocol requires all State bodies to update the State Property Register with details of all properties which are surplus to requirements and available for occupation or disposal.  A portion of the property adjoining Haddington Road is being retained by the HSE for redevelopment as a new primary care centre for this area. Planning permission for this new primary care centre was applied for in April 2024 and the HSE is engaging with Dublin City Council on this.  The remainder of the property was offered by the HSE to all State bodies, including Department of Housing, via the State Property Register on 10 April 2024. Under the Protocol, properties owned by State Bodies may not be sold on the open market unless there is no timely expression of interest received from another State Body.  The HSE engaged with all expressions of interest from State Bodies in relation to the property. However, after this engagement process, no other State Body chose to acquire Baggot Street Hospital from the HSE. Following this engagement process, the HSE proceeded to prepare Baggot Street Hospital for disposal on the open market, with the property being advertised for sale in October 2025.  A formal Section 53 Notice was submitted to LDA as of 15th October 2025. On 12th November 2025, the LDA formally notified the HSE of their decision to not acquire the former Baggot Street Hospital.  The HSE continue to have regular engagements with the LDA on other surplus relevant properties nationwide. ",
        "questionNumber": 655,
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03",
          "showAs": "John Lahart"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "showAs": "John Lahart",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03"
        },
        "showAs": " 104. Deputy John Lahart asked the Minister for Transport to address the criticism of some taxi drivers of his recent response regarding the introduction of fixed fares by a taxi company (details supplied); and if he will make a statement on the matter. [64070/25] ",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_81.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_81",
          "showAs": "Taxi Regulations",
          "debateSectionId": "dbsect_81"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_104",
        "answerText": " Minister for Transport  The regulation of the small public service vehicle (SPSV) industry, including the setting of fares, is a matter for the independent transport regulator, the National Transport Authority (NTA), under the provisions of the Consolidated Taxi Regulation Acts 2013 and 2016. I have no role in the day-to-day operations of the SPSV sector.  Section 24 of the Consolidated Taxi Regulation Acts 2013 and 2016 empowers the NTA Board to make a 'Maximum Fares Order' fixing the maximum fare that may be charged by the driver of a taxi for any journey and ensuring the protection of passengers. The current maximum fares order took effect in December 2024 and a maximum fare review is carried our approximately every two years. The NTA has conducted these reviews since 2011. It should be noted that hackneys and limousines agree their fares in advance and do not use a meter.  As set out in the legislation, charging in excess of this maximum fare can lead to a prosecution however, charging below the maximum fare is permitted. SPSV operators are self-employed and can decide whether (or not) to sign-up with a licensed dispatch operator, such as Uber. They are not obliged to be affiliated with a dispatch operator in Ireland. Where they choose to do so, taxi drivers are free to contract with any dispatch operator of their choice. I intend to ask the NTA as regulator to formally clarify the position on this matter.  Neither I, my Department nor the NTA are parties to the commercial or contractual arrangements in place between SPSV drivers and dispatch operator(s). ",
        "questionNumber": 104
      },
      "contextDate": "2025-11-19"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "showAs": "John Lahart",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03"
        },
        "showAs": " 349. Deputy John Lahart asked the Minister for Health her views on the recent reduction in funding for a company (details supplied); if she is aware that discontinuing the twelve-week introductory programme for new members has significantly reduced accessibility; if she will give consideration to restoring funding to ensure affordability for older participants, given that current costs are prohibitive; if private health insurance typically covers the programmes, given members report they are not reimbursed; and her views that the company provides an important social outlet for participants, helping to combat isolation among those living with chronic illness; and if she will make a statement on the matter. [64141/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_229.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_229",
          "showAs": "Health Services",
          "debateSectionId": "dbsect_229"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_349",
        "answerText": " Minister of State at the Department of Health  As this is a service matter I have referred the Deputy's question to the Health Service Executive for attention and direct reply to him. ",
        "questionNumber": 349
      },
      "contextDate": "2025-11-19"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 273,
        "showAs": " 273. Deputy John Lahart asked the Minister for Transport if he will consider funding for a feasibility study into the Metro South West project; the estimated cost  of such a study; the practical steps to be undertaken in such a study; the timeframe from initiation to completion of such a study based on previous practice; if he will confirm whether he favours and supports such a study; and if he will make a statement on the matter. [63047/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "John Lahart",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03",
          "memberCode": "John-Lahart.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_273",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_220",
          "showAs": "Public Transport",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_220",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_220.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has the statutory responsibility for the planning and development of public transport infrastructure in the Greater Dublin Area (GDA), which includes MetroLink.  The NTA published the Transport Strategy for the GDA 2022-2042 in January 2023. This strategy sets out a statutory framework for transport investment across the region over a 20-year period and provides a clear statement of transport planning policy for the GDA.  As the Deputy notes, the Programme for Government commits to commissioning an independent feasibility study continuing MetroLink from the city to South West Dublin.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a direct reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Justice, Home Affairs and Migration  Between 2021 and 2024, Ireland welcomed over 700 people who were refugees from Afghanistan through the Irish Refugee Protection Programme's (IRPP) Afghan Programme.  Within the remit of IRPP, a Humanitarian Admissions Programme prioritises at-risk individuals such as human rights defenders, women’s rights activists, LGBTQ+ individuals, judiciary and journalists. The Humanitarian Admissions Programme has been in place since 2021.  For 2025, a designated partner organisation, was appointed by the Department to support the admission of 50 individuals under the Humanitarian Admissions programme, using a community sponsorship framework.  While the number of admissions available under the 2025 Humanitarian Admissions Programme is limited to 50, the number of applications received far exceeded that and accordingly not all applications were successful.  While I appreciate that this will have caused disappointment to those who were unsuccessful or their families, all applications submitted to my Department for consideration by our designated partner organisation under the programme were subject to review by my officials to ensure a fair process.  The 2025 Humanitarian Admissions Programme was divided into two phases and Phase 1 has been completed. It is planned to complete the balance of the 50 pledged arrivals before the end of 2025.  At this time there are no plans in place to increase the number of spaces available under this programme. It is intended to facilitate the arrival of 50 Refugees from Afghanistan in 2026 under this programme. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_361",
        "debateSection": {
          "debateSectionId": "dbsect_350",
          "showAs": "Immigration Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_350",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_350.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Justice"
        },
        "questionNumber": 361,
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03",
          "showAs": "John Lahart"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 361. Deputy John Lahart asked the Minister for Justice, Home Affairs and Migration to continue to expand or extend the Humanitarian Admissions Programme; his views in relation to the history of the operation of the programme; and if he will make a statement on the matter. [62415/25] "
      }
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade (Deputy Simon Harris)  Human rights are universal. Every person, regardless of sexual orientation, gender identity, or any other characteristic, is entitled to equality, dignity and the full enjoyment of their human rights. The universal nature of human rights cannot be fulfilled without respecting the rights of LGBTQI+ persons. The promotion and protection of the rights of LGBTQI+ persons is a domestic and foreign policy priority for Ireland and this is reflected in our Campaign for the Human Rights Council where defending the rights of LGBTQI+ persons is one of our five thematic priorities.  Globally, LGBTQI+ persons continue to face disproportionate levels of violence and systemic discrimination in many countries. It is unacceptable that LGBTQI+ people continue to face discrimination, harassment, violence – including death – for being who they are.  We are deeply concerned the global pushback on LGBTQI+ rights that has evolved in recent years, including in Europe. In this context, it is more important than ever to reaffirm our commitment to the rights of LGBTQI+ persons.  Ireland, through our mission network and our Development Cooperation programme continues to support civil society and human rights defenders including to support their work on LGBTQI+ rights and support for LGBTQI+ human rights defenders. Our Mission network is fully engaged and in many places, our diplomats march in Pride parades and our Embassies proudly fly rainbow flag.  Ireland regularly intervenes at multilateral forums, including the EU and UN to speak up for the rights of LGBTQI+ people. As recently as November 3rd at the UN General Assembly Third Committee, during the Interactive Dialogue with the Independent Expert on Discrimination based on Sexual Orientation or Gender Identity, Ireland reiterated the importance of the full enjoyment of all people of their human rights, in this case with a particular focus on right to education for LGBTQI+ people. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "John Lahart",
          "memberCode": "John-Lahart.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_149.xml"
            }
          },
          "debateSectionId": "dbsect_149",
          "showAs": "Foreign Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_149"
        },
        "questionNumber": 190,
        "date": "2025-11-12",
        "showAs": " 190. Deputy John Lahart asked the Tánaiste and Minister for Foreign Affairs and Trade the efforts being made to support LGBTQI+ communities at EU and international level.  [60929/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_190"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Community Engagement Team (CET) was established in late 2023 to engage directly with elected representatives, local authorities, NGOs, Community Fora, local services, An Garda Síochána and others, in advance of the opening of new IPAS accommodation centres and Ukraine accommodation.  In relation to elected representatives, both national representatives TDs and Senators, and local representatives, are all included in all CET communications in relation to a new accommodation centre in a given area.  The purpose of the Community Engagement Team is to improve the flow of information about new and existing accommodation centres into communities, to assist with integration for the people joining our communities.  The team has supported communities around the opening of over 130 centres around the country since it was set up. Extra resources were added to the CET during 2024 to extend its reach and impact.  The Department is committed to ensuring that local communities have access to accurate information and that structures are in place to plan for provision of essential and supports services, such as healthcare and education, to assist with the integration process. ",
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "John Lahart",
          "memberCode": "John-Lahart.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_635.xml"
            }
          },
          "debateSectionId": "dbsect_635",
          "showAs": "International Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_635"
        },
        "questionNumber": 727,
        "date": "2025-11-12",
        "showAs": " 727. Deputy John Lahart asked the Minister for Justice, Home Affairs and Migration if he will ensure that once IPAS centres are established that Deputies will be included in community engagement; the reason this is not standard practice at the moment (details supplied). [61183/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_727"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  In all IPAS accommodation centres, whether they are commercially provided or State-owned, the accommodation service provider is contractually obliged to ensure all activities at the property are within agreed standards and legal limits.  Centre management and providers are responsible for day-to-day operational arrangements on the site, including staffing, catering, health and safety, utilities, security arrangements, and other requirements.  Centres are subject to oversight arrangements through the Department's compliance team, with independent inspection and quality control through either Health Information and Quality Authority (HIQA) or IPAS-commissioned inspections.  IPAS has a dedicated Training Unit that develops training sessions for centres in line with general IPAS Policies and Procedures.  The IPAS Training Unit conducts overview sessions with new and existing accommodation providers both online and in person. The overview sessions include, but are not limited to:  • House Rules and Procedures  • Critical Incidents  • Suicide Awareness  • Child Protection and Welfare  • GDPR  These overview sessions allow providers to ask questions or seek advice from IPAS staff.  My Department can confirm that these training sessions have been provided at the centre in question.  IPAS works in collaboration with other Government bodies, such as the HSE and Tusla, as well as NGOs and other approved service providers in the development of its training.  In addition to this training, accommodation centre staff are supported by a dedicated Centre Management and Compliance Team within IPAS. This team provides advice to accommodation centres on the implementation of IPAS policies and procedures, and also conduct unannounced site visits to ensure compliance with same. ",
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "John Lahart",
          "memberCode": "John-Lahart.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_636.xml"
            }
          },
          "debateSectionId": "dbsect_636",
          "showAs": "International Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_636"
        },
        "questionNumber": 728,
        "date": "2025-11-12",
        "showAs": " 728. Deputy John Lahart asked the Minister for Justice, Home Affairs and Migration if he is satisfied with the level of training of the IPAS staff and refugee staff employed by a company (details supplied); and to outline the standards, qualifications and employment headings under which staff are employed. [61194/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_728"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 729, 731, 732 and 736 together.  The purchase of the Citywest Hotel and Convention centre is a key part of the Government’s strategy to develop a stable and sustainable accommodation system for people seeking international protection.  State-owned centres are part of the Government’s long-term plan to reduce the reliance on private accommodation providers resulting in better value for money of public funds and a more efficient international protection system.  The Citywest Hotel and Convention Centre has successfully supported accommodation and decision-processing by the State for a number of years, and currently provides capacity for 2,300 people, with both international protection applicants and people from Ukraine resident in the Hotel and Convention Centre.  A 12-month transitional service agreement has been put in place with the current provider to oversee the management and provision of accommodation services for both the main hotel and the convention centre. The existing workforce has been maintained under the transitional agreement. Over the coming 12 months a process to tender for a provider to run the Citywest complex will be completed. ",
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "John Lahart",
          "memberCode": "John-Lahart.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_637.xml"
            }
          },
          "debateSectionId": "dbsect_637",
          "showAs": "International Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_637"
        },
        "questionNumber": 729,
        "date": "2025-11-12",
        "showAs": " 729. Deputy John Lahart asked the Minister for Justice, Home Affairs and Migration the number of Ukrainian refugees and the number of IPAS applicants resident at a centre (details supplied); and if he will make a statement on the matter. [61195/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_729"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Department, An Garda Síochána, and a range of local partners and stakeholders have been working hard to respond to the ongoing very difficult events of recent weeks in the vicinity of Citywest Hotel and Convention Centre.  In relation to security arrangements on the site, my officials are working closely with An Garda Síochána at this time, and keeping such arrangements under careful review in order to protect all people living and working in the vicinity. It is not appropriate for the Department to disclose detailed information about security arrangements in this context.  The Health Service Executive is responsible for providing health services in all communities, including people resident in International Protection Accommodation Service (IPAS) accommodation.  People seeking international protection access health services through mainstream HSE services, including primary care and GP services, referral to specialist services, and urgent or emergency healthcare services.  Some accommodation centres also have in-house medical services, and in the case of Citywest, the HSE has provided services on site since 2022, including health assessment, screening, vaccination and other services.  Any person applying for international protection residing in IPAS accommodation is entitled to apply for a medical card and IPAS Resident Welfare Services, along with NGO advocates, can support people to access health and social care services as needed. ",
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "John Lahart",
          "memberCode": "John-Lahart.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_638.xml"
            }
          },
          "debateSectionId": "dbsect_638",
          "showAs": "International Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_638"
        },
        "questionNumber": 730,
        "date": "2025-11-12",
        "showAs": " 730. Deputy John Lahart asked the Minister for Justice, Home Affairs and Migration the medical and security facilities on site at a centre (details supplied); and if he will make a statement on the matter. [61196/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_730"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 729, 731, 732 and 736 together.  The purchase of the Citywest Hotel and Convention centre is a key part of the Government’s strategy to develop a stable and sustainable accommodation system for people seeking international protection.  State-owned centres are part of the Government’s long-term plan to reduce the reliance on private accommodation providers resulting in better value for money of public funds and a more efficient international protection system.  The Citywest Hotel and Convention Centre has successfully supported accommodation and decision-processing by the State for a number of years, and currently provides capacity for 2,300 people, with both international protection applicants and people from Ukraine resident in the Hotel and Convention Centre.  A 12-month transitional service agreement has been put in place with the current provider to oversee the management and provision of accommodation services for both the main hotel and the convention centre. The existing workforce has been maintained under the transitional agreement. Over the coming 12 months a process to tender for a provider to run the Citywest complex will be completed. ",
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "John Lahart",
          "memberCode": "John-Lahart.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_637.xml"
            }
          },
          "debateSectionId": "dbsect_637",
          "showAs": "International Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_637"
        },
        "questionNumber": 731,
        "date": "2025-11-12",
        "showAs": " 731. Deputy John Lahart asked the Minister for Justice, Home Affairs and Migration the plans he or the Government have to ameliorate the loss of facilities (details supplied); the way in which the Government proposes to invest in the locality in a substantial way that attempts to mitigate the substantial loss to the community. [61197/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_731"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 729, 731, 732 and 736 together.  The purchase of the Citywest Hotel and Convention centre is a key part of the Government’s strategy to develop a stable and sustainable accommodation system for people seeking international protection.  State-owned centres are part of the Government’s long-term plan to reduce the reliance on private accommodation providers resulting in better value for money of public funds and a more efficient international protection system.  The Citywest Hotel and Convention Centre has successfully supported accommodation and decision-processing by the State for a number of years, and currently provides capacity for 2,300 people, with both international protection applicants and people from Ukraine resident in the Hotel and Convention Centre.  A 12-month transitional service agreement has been put in place with the current provider to oversee the management and provision of accommodation services for both the main hotel and the convention centre. The existing workforce has been maintained under the transitional agreement. Over the coming 12 months a process to tender for a provider to run the Citywest complex will be completed. ",
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "John Lahart",
          "memberCode": "John-Lahart.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_637.xml"
            }
          },
          "debateSectionId": "dbsect_637",
          "showAs": "International Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_637"
        },
        "questionNumber": 732,
        "date": "2025-11-12",
        "showAs": " 732. Deputy John Lahart asked the Minister for Justice, Home Affairs and Migration the reason the State purchased facilities but has not purchased a smaller hotel (details supplied); and if he will make a statement on the matter. [61198/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_732"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 729, 731, 732 and 736 together.  The purchase of the Citywest Hotel and Convention centre is a key part of the Government’s strategy to develop a stable and sustainable accommodation system for people seeking international protection.  State-owned centres are part of the Government’s long-term plan to reduce the reliance on private accommodation providers resulting in better value for money of public funds and a more efficient international protection system.  The Citywest Hotel and Convention Centre has successfully supported accommodation and decision-processing by the State for a number of years, and currently provides capacity for 2,300 people, with both international protection applicants and people from Ukraine resident in the Hotel and Convention Centre.  A 12-month transitional service agreement has been put in place with the current provider to oversee the management and provision of accommodation services for both the main hotel and the convention centre. The existing workforce has been maintained under the transitional agreement. Over the coming 12 months a process to tender for a provider to run the Citywest complex will be completed. ",
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "John Lahart",
          "memberCode": "John-Lahart.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_637.xml"
            }
          },
          "debateSectionId": "dbsect_637",
          "showAs": "International Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_637"
        },
        "questionNumber": 736,
        "date": "2025-11-12",
        "showAs": " 736. Deputy John Lahart asked the Minister for Justice, Home Affairs and Migration when a contract for the management of facility for refugees and IPAS residents will expire (details supplied); and if he will make a statement on the matter. [61269/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_736"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 336. Deputy John Lahart asked the Minister for Transport if he is satisfied with the operation of laws introduced by the previous Minister with regard to e-Scooters; his plans to review the matter; and if he will make a statement on the matter. [58916/25] ",
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "showAs": "John Lahart",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_336",
        "questionNumber": 336,
        "answerText": " Minister of State at the Department of Transport  As Minister of State for International & Road Transport, Logistics, Rail & Ports, I wish to advise that regulations providing for and governing the legal use of e-scooters on Irish roads were introduced in 2024.  These regulations cover a wide range of requirements, both usage and technical, including for speed, weight, capacity and power, as well as prohibitions on, among other things, carrying more than one person, the carriage of goods and use on footpaths. The full list of regulations can be found on the gov.ie website (E-Scooters - www.gov.ie/en/department-of-transport/publications/e-scooters/).  Both I and my Department are satisfied with the current regulations in place. However, operation of the legislation, through enforcement, is, as for all road traffic law, under the remit of An Garda Síochána. My officials meet regularly with An Garda Siochana to discuss matters related to road traffic legislation. As with any legislation, I will consider feedback on its operation from An Garda Siochana and other stakeholders and I will act if it is clear that improvements can be made. ",
        "debateSection": {
          "showAs": "Legislative Reviews",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_311",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_311.xml"
            }
          },
          "debateSectionId": "dbsect_311"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 637. Deputy John Lahart asked the Minister for Education and Youth the status of the new school project for a school (detail supplied); and if she will make a statement on the matter. [57827/25] ",
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "showAs": "John Lahart",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_637",
        "questionNumber": 637,
        "answerText": " Minister for Education and Youth  The major building project referred to by the Deputy will deliver a new 1,000 pupil post primary school with 6 classrooms for children with special education needs.  The project will be delivered under my Department's ADAPT 4 programme – Programme Innovate. This programme is being led by Integrated Project Teams consisting of highly skilled and experienced design professionals, architects, engineers, project managers, quantity surveyors and various other consultants to deliver the projects.  This project is currently at the initial stage of architectural planning – Pre-Stage 1 where the Integrated Project Team carry out a site and current building assessment and initial design sketch schemes are created.  It will not be possible to estimate the date of commencement of works until the project has secured all essential statutory approvals.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs.  In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  My department is now preparing an NDP implementation plan which is due for publication later in the year. This plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  My Department will continue to keep the school and its patron body updated on progress and next steps. ",
        "debateSection": {
          "showAs": "Schools Building Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_583",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_583.xml"
            }
          },
          "debateSectionId": "dbsect_583"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 638. Deputy John Lahart asked the Minister for Education and Youth the status of the completion of contracted works and planned works at a school (details supplied). [57828/25] ",
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "showAs": "John Lahart",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_638",
        "questionNumber": 638,
        "answerText": " Minister for Education and Youth  The school to which the Deputy refers is currently at Stage 2b - Advanced Architectural Planning. The project is a completion project, which includes a Sports Hall that was to be completed as part of the original phased project.  The Design Team have prepared a pre-tender estimate which is under review within my Department.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In addition, repurposing and optimisation of existing accommodation capacity across the school estate has been a key enabler of timely, local provision of special class capacity in a way that supports best practice in inclusion and integration. Circa 80% of new special classes in 2025/26 are being facilitated in repurposed classroom accommodation.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  All Government departments are expected to publish their sectoral NDP Implementation Plans in November. My department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "debateSection": {
          "showAs": "Schools Building Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_584",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_584.xml"
            }
          },
          "debateSectionId": "dbsect_584"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 639. Deputy John Lahart asked the Minister for Education and Youth her plans for schools in the south suburbs of Dublin including areas such as Rathfarnham and Templeogue, where single sex post-primary schools are the only option available to parents; and if she will provide co-education options in existing schools. [57829/25] ",
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "showAs": "John Lahart",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_639",
        "questionNumber": 639,
        "answerText": " Minister for Education and Youth  I wish to advise the Deputy that the decision-making authority for any change of status is the patron/trustees of the schools concerned and it is open to any patron to submit proposals to the Department for consideration.  Any proposed change involves extensive consultation at local level and must be well planned and managed in a manner that accommodates the interests of students, parents, teachers, local communities and contributes to an inclusive education system.  The Patron and relevant stakeholders are also advised to consider the implications that any change of status proposal may have on factors such as school accommodation, funding, staffing and school transport so that an informed decision can be made.  As the Deputy may be aware, in order to plan for school provision and analyse the relevant demographic data, my department divides the country into 314 school planning areas and uses a geographical information system, using data from a range of sources, including CSO census data, child benefit and school enrolment data, to identify where the pressure for school places across the country will arise and where additional school accommodation is needed at primary and post-primary level.  Major new residential developments have the potential to alter the demand for school places at a local level. In that regard, as part of the demographic demand analysis, the department monitors planning and construction activity in the residential sector. This involves the analysis of data sources from local authorities and the CSO along with the engagement with local authorities and the construction sector. In this way, up-to-date information on significant new residential developments is obtained and factored into the demographic analysis exercise. This is necessary to ensure that schools infrastructure planning is keeping pace with demographic changes, at a local level, where there is a constantly evolving picture with planned new residential development.  Where demographic data indicates that additional provision is required, the delivery of such additional provision is dependent on the circumstances of each case and may, be provided through:  • Utilising existing unused capacity within a school or schools,  • Extending the capacity of a school or schools,  • Provision of a new school or schools.  If additional accommodation is required, the aim to try and facilitate this, as much as possible, by way of expansion of existing schools rather than establishing new schools. The expansion of existing schools is consistent with wider Government objectives under Project Ireland 2040 for an increased emphasis on compact growth. In respect of post primary schools, new post primary schools must have a student enrolment capacity of 600-1,000 students and must be co-educational. A lower threshold of 400 students may apply to gaelcholáistí, having regard to the alternative of establishing an Irish-medium unit (aonad) in an English-medium school.  New schools are only established in areas of demographic growth as the resources available for school infrastructure must be prioritised to meet the needs of areas of significant population increase so as to ensure that every child has a school place.  The Capital Programme details the school projects that are being progressed under Project Ireland 2040. The current status of large-scale projects being delivered under Project Ireland 2040, may be viewed on the Department's website at, www.gov.ie and this information is updated regularly. In addition, a list of large-scale projects completed from 2010 to date may also be viewed on the website.  The pace of delivery of additional residential development in the south suburbs area of Dublin including Rathfarnham and Templeogue, along with updated enrolment data and demographic data will be kept under review and this will inform the timing of school requirements in the area. ",
        "debateSection": {
          "showAs": "Education Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_585",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_585.xml"
            }
          },
          "debateSectionId": "dbsect_585"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 838. Deputy John Lahart asked the Minister for Education and Youth the number of new primary school projects commenced and completed between 2016 and 2020; between 2020 and 2024; the number which have been granted planning permission and are ready to commence in 2025, in tabular form; and if she will make a statement on the matter. [59415/25] ",
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "showAs": "John Lahart",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_838",
        "questionNumber": 838,
        "answerText": " Minister for Education and Youth  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In addition, repurposing and optimisation of existing accommodation capacity across the school estate has been a key enabler of timely, local provision of special class capacity in a way that supports best practice in inclusion and integration. Circa 80% of new special classes in 2025/26 are being facilitated in repurposed classroom accommodation.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  All Government departments are expected to publish their sectoral NDP Implementation Plans in November. My department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. To date, circa 20 primary school projects have planning permission granted between 2020 and 2024.  The current status of all projects is set out under item number ten at the following link (www.gov.ie). This is updated on a regular basis to reflect project progress through the various stages of capital appraisal, site acquisition, design, tender and construction. ",
        "debateSection": {
          "showAs": "Schools Building Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_764",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_764.xml"
            }
          },
          "debateSectionId": "dbsect_764"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1062. Deputy John Lahart asked the Minister for Housing, Local Government and Heritage when he proposes to prioritise and bring into effect a rental deposit protection scheme in Ireland, as was set forward in 2015 legislation. [58915/25] ",
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "showAs": "John Lahart",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1062",
        "questionNumber": 1062,
        "answerText": " Minister for Housing, Local Government and Heritage  The Residential Tenancies (Amendment) Act 2015 provides for the development of a deposit protection scheme to be operated by the Residential Tenancies Board (RTB). However, significant changes have taken place in the rental market since this legislation was passed. It should be noted that, unlike many other jurisdictions examined, Ireland already has a well-established quasi-judicial dispute resolution process in place whereby, the RTB offers a dispute resolution process to landlords and tenants and any deposit protection scheme will continue to require access to such a resolution process.  Section 12(1)(d) of the Residential Tenancies Acts 2004 to 2025 (the RTA) provides that, subject to certain conditions, a landlord shall return or repay promptly any deposit paid by the tenant to the landlord on entering into the agreement for the tenancy or lease.  Section 19B of the RTA provides that the total amount that a tenant is required to pay to a landlord by way of a deposit or an advance rent payment to secure a tenancy is restricted to no more than the equivalent of two months’ rent (i.e. any deposit cannot exceed one month’s rent and any advance rent payment cannot exceed one month’s rent).  Where there is a dispute regarding the retention or refund of a deposit, the tenant may bring a dispute to the RTB for resolution. www.rtb.ie/dispute-resolution-services/submitting-a-complaint-vs-submitting-a-dispute  The Housing for All Action Plan Update published in November 2022, included an action to examine the creation of a system of holding rental deposits, informed by best international experience. The primary aim of this examination was to provide an international comparison of different models of deposit protection, with a view to drawing lessons prior to the possible implementation of a deposit protection scheme in Ireland.  The Housing Agency has completed an examination in line with the Housing for All action and I am considering its contents and the options the Agency has outlined. It is important that any new measures introduced in the rental sector are done so in a fair, measured and balanced manner. ",
        "debateSection": {
          "showAs": "Rental Sector",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_925",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_925.xml"
            }
          },
          "debateSectionId": "dbsect_925"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Social",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1223. Deputy John Lahart asked the Minister for Social Protection whether it is Government policy to support a balanced approach between small-scale pension investors, including self-directed PRSA holders investing in individual properties, and large institutional investors (vulture funds); whether he has concerns that the investment restrictions under consideration by the pensions authority could be disproportionate; and if he will make a statement on the matter. [59565/25] ",
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "showAs": "John Lahart",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1223",
        "questionNumber": 1223,
        "answerText": " Minister for Social Protection  Section 10(1) of the Pensions Act 1990 sets out that the functions of the Pensions Authority include advising me on all matters in relation to pensions generally.  The Pensions Authority informed the Department that it intended, from 30 September 2025, to commence a consultation seeking views on the regulation of Personal Retirement Savings Account (PRSA) investments. In its consultation, the Authority sets out its concerns about the difference between the investment rules of PRSAs and occupational pension schemes and believes that these rules should be more aligned. In particular, the rules for occupational pension schemes require that pension saving investments are invested in prudent manner and predominately in regulated markets.  Following the transposition of the IORP II Directive, other than a derogation for pre-existing one member arrangements (schemes established solely for one member, who has discretion over how the assets are invested), investment rules apply to all pension schemes regardless of size. In the Authority’s view, it is difficult to justify not extending such safeguarding measures to contributors of all pension saving products, including PRSAs.  The Authority is running a public consultation from 30 September 2025 to 17 November 2025. A consultation paper and submission form are available on: pensionsauthority.ie/policy-publications/consultation_papers/open_consultation_papers/  I will await the outcome of the Authority's consultation and any advice that may be provided to me for consideration on the investment rules applicable to PRSAs.  I trust this clarifies the matter for the Deputy. ",
        "debateSection": {
          "showAs": "Pension Provisions",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1052",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1052.xml"
            }
          },
          "debateSectionId": "dbsect_1052"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Social",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1233. Deputy John Lahart asked the Minister for Social Protection to clarify the precise timing at which an individual’s participation in a private pension scheme is recognised for the purposes of exemption from automatic enrolment; the date by which a first contribution must be made, through company payroll, in order for that individual to be excluded from automatic enrolment; and if he will make a statement on the matter. [59980/25] ",
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "showAs": "John Lahart",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1233",
        "questionNumber": 1233,
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 1233 and 1234 together.  The introduction of a pensions auto-enrolment system is a Programme for Government commitment, and one of my key priorities. The aim of introducing an AE system is to address the pension coverage gap that exists in Ireland, and to help provide for better retirement incomes for workers. The new system - to be known as My Future Fund - will commence from 1st January 2026.  From that date, current and new employees aged between 23 and 60 years of age and earning €20,000 or above per annum (across all employments) who are not already in an approved supplementary pension scheme will be automatically enrolled into My Future Fund. Those who fall outside the age and earnings threshold, so those aged between 18 and 23 or between 60 and 66, and/or earn below €20,000, will be able to join the new retirement savings system voluntarily by opting in.  In order to ensure prospective participants are enrolled on the 1st of January and contribution collection can commence from that date onwards, enrolment instructions will be sent in December. To this end eligibility testing of the earnings and pension coverage tests will take into account a 13-week look-back period of Revenue payroll data, meaning that payslips from the months of September, October and November will be processed to determine initial eligibility and exemption. Once a pension contribution exists on a payslip, then that employment will be exempt from My Future Fund. Therefore, the first contribution into a company pension scheme will need to be made by late November in order to be marked as an exempt employment for My Future Fund during the initial eligibility testing period. However, it is important to note that an employee will continue to be checked as part of the 13-week rolling look-back. Where another employment is identified without pension contributions, the employee will be enrolled for that new employment. Similarly, where an employment had pension contributions being paid and those have ceased for a period of 12 months, the employee will be enrolled/re-enrolled for that employment.  It is worth noting that there is no downside for an employee being auto-enrolled in My Future Fund. If an employee joins an occupational pension scheme subsequent to auto-enrolment in My Future Fund, contributions to My Future Fund will automatically cease once contributions are made to the occupational scheme. If an employee doesn't join an occupational pension scheme and would also prefer not to participate in My Future Fund, then they will be able to opt-out after 6 months and get a refund of their personal contributions to that date.  Where an employer and employee are already making contributions into an occupational pension scheme but the employee is nonetheless automatically enrolled, there will be a facility to refund the contributions made into My Future Fund back to the employer and employee on the basis that the employee should not have been enrolled. The requirements and process for refunds will be set out in regulations, which are currently being prepared. Further details on how and when to apply for refunds will be made available on the website of the National Automatic Enrolment Retirement Savings Authority.  I hope this clarifies matters for the Deputy. ",
        "debateSection": {
          "showAs": "Pension Provisions",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1062",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1062.xml"
            }
          },
          "debateSectionId": "dbsect_1062"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Social",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1234. Deputy John Lahart asked the Minister for Social Protection the procedures that will apply in cases where an employee and employer have already made contributions to a private pension scheme, but the employee is nonetheless automatically enrolled; the way in which contributions made under automatic enrolment will be treated; if refunds will be issued to the employee and employer; if so, the how and when; and if he will make a statement on the matter. [59981/25] ",
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "showAs": "John Lahart",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1234",
        "questionNumber": 1234,
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 1233 and 1234 together.  The introduction of a pensions auto-enrolment system is a Programme for Government commitment, and one of my key priorities. The aim of introducing an AE system is to address the pension coverage gap that exists in Ireland, and to help provide for better retirement incomes for workers. The new system - to be known as My Future Fund - will commence from 1st January 2026.  From that date, current and new employees aged between 23 and 60 years of age and earning €20,000 or above per annum (across all employments) who are not already in an approved supplementary pension scheme will be automatically enrolled into My Future Fund. Those who fall outside the age and earnings threshold, so those aged between 18 and 23 or between 60 and 66, and/or earn below €20,000, will be able to join the new retirement savings system voluntarily by opting in.  In order to ensure prospective participants are enrolled on the 1st of January and contribution collection can commence from that date onwards, enrolment instructions will be sent in December. To this end eligibility testing of the earnings and pension coverage tests will take into account a 13-week look-back period of Revenue payroll data, meaning that payslips from the months of September, October and November will be processed to determine initial eligibility and exemption. Once a pension contribution exists on a payslip, then that employment will be exempt from My Future Fund. Therefore, the first contribution into a company pension scheme will need to be made by late November in order to be marked as an exempt employment for My Future Fund during the initial eligibility testing period. However, it is important to note that an employee will continue to be checked as part of the 13-week rolling look-back. Where another employment is identified without pension contributions, the employee will be enrolled for that new employment. Similarly, where an employment had pension contributions being paid and those have ceased for a period of 12 months, the employee will be enrolled/re-enrolled for that employment.  It is worth noting that there is no downside for an employee being auto-enrolled in My Future Fund. If an employee joins an occupational pension scheme subsequent to auto-enrolment in My Future Fund, contributions to My Future Fund will automatically cease once contributions are made to the occupational scheme. If an employee doesn't join an occupational pension scheme and would also prefer not to participate in My Future Fund, then they will be able to opt-out after 6 months and get a refund of their personal contributions to that date.  Where an employer and employee are already making contributions into an occupational pension scheme but the employee is nonetheless automatically enrolled, there will be a facility to refund the contributions made into My Future Fund back to the employer and employee on the basis that the employee should not have been enrolled. The requirements and process for refunds will be set out in regulations, which are currently being prepared. Further details on how and when to apply for refunds will be made available on the website of the National Automatic Enrolment Retirement Savings Authority.  I hope this clarifies matters for the Deputy. ",
        "debateSection": {
          "showAs": "Pension Provisions",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1062",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1062.xml"
            }
          },
          "debateSectionId": "dbsect_1062"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Justice",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1293. Deputy John Lahart asked the Minister for Justice, Home Affairs and Migration the level, occurrence and frequency of engagement with listed stakeholders regarding a facility (details supplied) [58854/25] ",
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "showAs": "John Lahart",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1293",
        "questionNumber": 1293,
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I propose to take Questions Nos. 1293 and 1302 together.  The purchase of the Citywest site had been progressed with a strong commitment to engagement with the local community and the Department's Community Engagement team is working closely with local community leaders, community groups and stakeholders.  Between 01 July – 28 October 2025, 15 meetings have been attended by the Community Engagement Team with community stakeholders. This excludes ongoing engagement planning meetings with representatives of the Local Authority and the Local Development Company, in line with the commitment to co-design the engagement plan.  46 community-based organisations, including residents’ associations, sporting organisations and NGOs have been invited to attend meetings between the Community Engagement Team and community stakeholders.  These organisations were identified to the Community Engagement Team by local elected representatives, the Local Authority, through the Public Participation Network or made direct contact with the Community Engagement Team.  The Department is committed to ensuring that the local community has access to accurate information. To date, the Community Engagement Team has issued a total of 10 information notes – eight to local elected representatives and two to community stakeholders – providing information about the development. In addition, the department published and maintains the dedicated webpage at www.gov.ie/citywest. ",
        "debateSection": {
          "showAs": "International Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1112",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1112.xml"
            }
          },
          "debateSectionId": "dbsect_1112"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Justice",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1301. Deputy John Lahart asked the Minister for Justice, Home Affairs and Migration to provide for the inclusion of local TDs in the community-engagement process regarding the establishment of IPAS and Refugee/Asylum Centres, close to their constituencies; and if he will make a statement on the matter. [58890/25] ",
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "showAs": "John Lahart",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1301",
        "questionNumber": 1301,
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  The Department receives regular offers of accommodation from external providers and does not predetermine their geographical location. All offers of accommodation are reviewed by the Department under a standard appraisal procedure.  Factors in the appraisal include the site and its potential, the value for money it offers, planning matters and any works required to meet the required standards. Consideration is also given to the location and locality, access to services, resident welfare, health and wellbeing, and the current level of need in the sector.  The Community Engagement Team (CET) was established to engage directly with elected representatives, local authorities, community members and service providers, in advance of a new centre opening. The approach has been to engage with elected representatives in the relevant area, be that constituency in the case of TDs, and municipal district or area committee in the case of city and county councillors.  As such, IPAS and the CET are in regular contact elected representatives in the relevant area and with NGOs, Community Fora, local services, the HSE, Education services, An Garda Síochána and others, to help prepare for a new centre and new arrivals.  The team also supports information sharing through a dedicated email service for queries from local groups about new and existing centres. The CET is happy to take enquiries and share information and updates with elected representatives from neighbouring constituencies for their information.  Since its establishment, the CET has worked through the openings of over 140 IPAS and Ukraine accommodation centres. Some of these have involved a simple sharing of information through the relevant channels, while others have involved more detailed meetings with local community groups, local officials, public representatives and other key stakeholders.  There have been many consistent examples of meaningful and productive engagement, and service providers and elected representatives around the country demonstrate ongoing support for our work and for our residents.  In relation to larger State-owned sites, the model of engagement has been developed to plan for more meaningful dialogue to support these larger centres, particularly those on state-owned lands being developed under Government policy to move away from dependence on commercial providers.  As part of the Programme for Government 2025, Securing Ireland’s Future, there is a commitment to expand the work of the CET to provide for detailed discussions with communities and to plan more effectively for delivery of increased public services.  As part of wider commitments within the Programme for Government, the overall goal is to reform and improve the overall international protection process, to ensure that we can curtail the need for ongoing growth in the accommodation system. ",
        "debateSection": {
          "showAs": "International Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1119",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1119.xml"
            }
          },
          "debateSectionId": "dbsect_1119"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Justice",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1302. Deputy John Lahart asked the Minister for Justice, Home Affairs and Migration the community organisations which have been engaged with by the community engagement team in respect of a facility (details supplied). [58891/25] ",
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "showAs": "John Lahart",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1302",
        "questionNumber": 1302,
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I propose to take Questions Nos. 1293 and 1302 together.  The purchase of the Citywest site had been progressed with a strong commitment to engagement with the local community and the Department's Community Engagement team is working closely with local community leaders, community groups and stakeholders.  Between 01 July – 28 October 2025, 15 meetings have been attended by the Community Engagement Team with community stakeholders. This excludes ongoing engagement planning meetings with representatives of the Local Authority and the Local Development Company, in line with the commitment to co-design the engagement plan.  46 community-based organisations, including residents’ associations, sporting organisations and NGOs have been invited to attend meetings between the Community Engagement Team and community stakeholders.  These organisations were identified to the Community Engagement Team by local elected representatives, the Local Authority, through the Public Participation Network or made direct contact with the Community Engagement Team.  The Department is committed to ensuring that the local community has access to accurate information. To date, the Community Engagement Team has issued a total of 10 information notes – eight to local elected representatives and two to community stakeholders – providing information about the development. In addition, the department published and maintains the dedicated webpage at www.gov.ie/citywest. ",
        "debateSection": {
          "showAs": "International Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1112",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1112.xml"
            }
          },
          "debateSectionId": "dbsect_1112"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Justice",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1303. Deputy John Lahart asked the Minister for Justice, Home Affairs and Migration the steps which are being taken to provide ongoing security at a facility (details supplied); and if he will make a statement on the matter. [58892/25] ",
        "by": {
          "memberCode": "John-Lahart.D.2016-10-03",
          "showAs": "John Lahart",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Lahart.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1303",
        "questionNumber": 1303,
        "answerText": " Minister for Justice, Home Affairs and Migration  My Department along with, An Garda Síochána, and a range of local partners and stakeholders have been working hard to respond to the ongoing very difficult events of recent weeks in the vicinity of Citywest Hotel and Convention Centre.  The serious incident alleged to have occurred in the locality, and the violent protests that took place have raised significant concerns, particularly for people and local representatives in the area.  Firstly, in relation to the alleged crime, a person has been arrested and charged in relation to this incident and is now before the Courts.  In the circumstances, I am precluded from commenting or providing detailed information, as this may prejudice any consequent investigations or court cases.  It is important to note, notwithstanding this alleged crime, An Garda Síochána has clearly stated that there is no correlation between an increase in crime rates and the location of international protection accommodation.  In relation to the disorder seen in the area following this alleged crime, while people are entitled to peaceful protest, what occurred on the evenings of 21 and 22 October was not a peaceful protest.  A large Garda operation was in place with nearly 300 members of An Garda Síochána on duty. There were sustained attacks on gardaí, including physical violence, bricks thrown, fireworks discharged and the arson of a Garda van.  The Garda Public Order unit were deployed in full protective equipment. An Garda Síochána adopted a graduated approach and acted quickly to restore order in challenging circumstances.  A number of arrests were made for public order offences and a full criminal investigation has commenced.  In relation to security arrangements on the site, my officials are working closely with An Garda Síochána at this time, and keeping such arrangements under careful review in order to protect all people living and working in the vicinity. It is not appropriate for the Department to disclose detailed information about security arrangements in this context.  My officials and the Department’s Community Engagement Team has remained in touch with all key local stakeholders throughout the last weeks, and will continue to assist and work with local representatives and community groups in the area. ",
        "debateSection": {
          "showAs": "International Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1120",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1120.xml"
            }
          },
          "debateSectionId": "dbsect_1120"
        }
      },
      "contextDate": "2025-11-04"
    }
  ]
}