{
  "head": {
    "counts": {
      "questionCount": 1290,
      "resultCount": 1290
    }
  },
  "results": [
    {
      "question": {
        "date": "2014-07-15",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-07-15/writtens/dbsect_270",
          "showAs": "Office of Public Works Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-07-15/writtens/mul@/dbsect_270.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_270"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Public",
          "roleType": null
        },
        "showAs": " 339. Deputy Simon Harris asked the Minister for Public Expenditure and Reform if the Office of Public Works is considering an application for a location (details supplied) in County Wicklow; and if he will make a statement on the matter. [31200/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-07-15/pq_339",
        "questionNumber": 339,
        "answerText": " Minister for Public Expenditure and Reform  I am advised by the Commissioners of Public Works that tearooms are being provided at Kilmacurragh National Botanic Gardens, Co Wicklow. Planning permission for 'change of use' has been received from Wicklow County Council. A Contractor was appointed earlier this year following a competitive tender process for construction of the facility. However certain contractual issues have arisen with the Contractor which have interrupted completion of the work. "
      },
      "contextDate": "2014-07-15"
    },
    {
      "contextDate": "2014-07-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-07-08/writtens/mul@/dbsect_412.xml"
            }
          },
          "debateSectionId": "dbsect_412",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-07-08/writtens/dbsect_412",
          "showAs": "Septic Tank Registration Scheme"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-07-08/pq_489",
        "to": {
          "roleType": null,
          "showAs": "Environment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 489,
        "showAs": " 489. Deputy Simon Harris asked the Minister for the Environment, Community and Local Government if a person who has not yet registered their septic tank owing to a specific medical situation can now register their tank and still have the option to apply for a grant for remediation-upgrade works; and if he will make a statement on the matter. [29030/14] ",
        "answerText": " Minister for the Environment, Community and Local Government  The Domestic Waste Water Treatment Systems (Registration) Regulations 2012 prescribed 1 February 2013 as the date by which householders must register their domestic wastewater treatment systems. The only exception to this is where construction or installation of a treatment system takes place after that date. In such cases, the owner of the premises connected to the treatment system is obliged to register within 90 days of the connection of the premises to the treatment system.  Registration facilities have been available since 26 June 2012 and have been comprehensively publicised. Owners of domestic wastewater systems who have not yet registered may still do so and there are no late payment fees payable (but the discount for early registration no longer applies). Registration can be completed via the website www.protectourwater.ie or in any local authority office.  The Domestic Waste Water Treatment Systems (Financial Assistance) Regulations 2013, a copy of which is available in the Oireachtas library, introduced a grants scheme for householders whose treatment systems require remediation or upgrading following an inspection carried out under the Water Services (Amendment) Act 2012 and the subsequent issue of an advisory notice under that legislation. A number of qualification criteria are set out in the regulations, all of which must be met in order for a grant to be paid. One of those criteria is that only householders who complied with the legal obligation to register their treatment systems by 1 February 2013 will be eligible to apply for grant aid. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2014-07-08",
        "by": {
          "showAs": "Simon Harris",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09"
        }
      }
    },
    {
      "question": {
        "date": "2014-07-03",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-07-03/writtens/dbsect_199",
          "showAs": "Cancer Screening Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-07-03/writtens/mul@/dbsect_199.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_199"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Health",
          "roleType": null
        },
        "showAs": " 183. Deputy Simon Harris asked the Minister for Health his plans to extend BreastCheck to women aged between 65 and 69 years as per the commitment in the programme for Government; and if he will make a statement on the matter. [28763/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-07-03/pq_183",
        "questionNumber": 183,
        "answerText": " Minister for Health  I propose to take Questions Nos. 183, 205, 208 and 212 together.  The BreastCheck Programme provides free mammograms to all women aged 50-64. A priority of the BreastCheck Programme at present is to maximise national uptake in the 50-64 year age cohort.  It is my intention to extend the upper age range to include the 65-69 age cohort as soon as possible in line with available resources. "
      },
      "contextDate": "2014-07-03"
    },
    {
      "contextDate": "2014-07-01",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-07-01/writtens/mul@/dbsect_105.xml"
            }
          },
          "debateSectionId": "dbsect_105",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-07-01/writtens/dbsect_105",
          "showAs": "Motor Tax Exemptions"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-07-01/pq_141",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 141,
        "showAs": " 141. Deputy Simon Harris asked the Minister for Finance whether there is any relief available on vehicle registration tax for wheelchair-adapted vehicles; and if he will make a statement on the matter. [28297/14] ",
        "answerText": " Minister for Finance  I am informed by the Revenue Commissioners that relief in respect of Vehicle Registration Tax (VRT) and Value Added Tax (VAT) on the purchase of a vehicle is provided for in the Disabled Drivers and Disabled Passengers (Tax Concessions) Regulations, 1994 (Statutory Instrument No. 353 of 1994). Relief from VRT and VAT may be obtained subject to a maximum of €9,525 under the driver scheme, and €15,875 under the passenger scheme.  The scheme is available to persons who are severely and permanently disabled, who meet specified medical criteria and who have obtained a Primary Medical Certificate.  In respect of the vehicle, in order to qualify under the scheme a vehicle must be specially constructed or adapted to take account of the person's disability or, in the case of organisations, be specially constructed or adapted for the transport of disabled persons.  I am informed by the Revenue Commissioners that more detailed information is available on the Revenue website at the following link: http://www.revenue.ie/en/tax/vrt/leaflets/drivers-passengers-with-disabilities-tax-relief-scheme.pdf . ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2014-07-01",
        "by": {
          "showAs": "Simon Harris",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2014-07-01",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-07-01/writtens/mul@/dbsect_202.xml"
            }
          },
          "debateSectionId": "dbsect_202",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-07-01/writtens/dbsect_202",
          "showAs": "Carer's Allowance Appeals"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-07-01/pq_244",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 244,
        "showAs": " 244. Deputy Simon Harris asked the Minister for Social Protection when a person (details supplied) may expect a decision on their carer's allowance appeal; and if she will make a statement on the matter. [28313/14] ",
        "answerText": " Minister for Social Protection  The Social Welfare Appeals Office has advised me that the appeal from the person concerned was referred to an Appeals Officer who has decided to hold an oral hearing in this case on 17 July 2014. The person concerned will shortly be notified of the arrangements for the hearing. The Social Welfare Appeals Office functions independently of the Minister for Social Protection and of the Department and is responsible for determining appeals against decisions in relation to social welfare entitlements. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2014-07-01",
        "by": {
          "showAs": "Simon Harris",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2014-07-01",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-07-01/writtens/mul@/dbsect_290.xml"
            }
          },
          "debateSectionId": "dbsect_290",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-07-01/writtens/dbsect_290",
          "showAs": "Election Management System"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-07-01/pq_344",
        "to": {
          "roleType": null,
          "showAs": "Environment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 344,
        "showAs": " 344. Deputy Simon Harris asked the Minister for the Environment, Community and Local Government if any consideration has been given to locating polling stations in public buildings and council buildings; and if he will make a statement on the matter. [28496/14] ",
        "answerText": " Minister for the Environment, Community and Local Government  Section 93 of the Electoral Act 1992 provides for the use of schools and public premises for taking the poll and the counting of votes at Dáil elections. Section 94 of the Act provides that a returning officer shall provide a sufficient number of polling stations for the accommodation of Dáil electors. The returning officer may use, free of charge, any school or premises owned or occupied by a local authority for these purposes. Similar provisions apply under the electoral Acts in relation to other elections and referendums. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2014-07-01",
        "by": {
          "showAs": "Simon Harris",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2014-07-01",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-07-01/writtens/mul@/dbsect_394.xml"
            }
          },
          "debateSectionId": "dbsect_394",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-07-01/writtens/dbsect_394",
          "showAs": "Medical Research Regulation"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-07-01/pq_465",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 465,
        "showAs": " 465. Deputy Simon Harris asked the Minister for Health if he will provide an update on the current status in the programme for Government to legislate for stem cell research here; and if he will make a statement on the matter. [27920/14] ",
        "answerText": " Minister for Health  In relation to your query re a legislative framework for Assisted Human Reproduction (AHR), I am examining proposals to regulate AHR and related matters including stem cell research. I will make a decision on these matters in due course in the context of on-going legislative priorities. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2014-07-01",
        "by": {
          "showAs": "Simon Harris",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09"
        }
      }
    },
    {
      "question": {
        "date": "2014-06-24",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-06-24/writtens/dbsect_395",
          "showAs": "Irish Sign Language",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-06-24/writtens/mul@/dbsect_395.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_395"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Justice",
          "roleType": null
        },
        "showAs": " 481. Deputy Simon Harris asked the Minister for Justice and Equality the actions that have been taken to advance the recognition of Irish Sign Language as per the commitment in the programme for Government; and if she will make a statement on the matter.  [27211/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-06-24/pq_481",
        "questionNumber": 481,
        "answerText": " Minister of State at the Department of Justice and Equality  The Programme for Government includes a commitment to \"examine different mechanisms to promote the recognition of Irish Sign Language\". The process of examining issues and options has already commenced. The National Disability Authority (NDA) facilitated consultations with the Deaf Community in Ireland in 2012 at my request in relation to actions that could make improvements in the lives of deaf people and submissions received from them were considered for inclusion where possible and appropriate in the National Disability Strategy Implementation Plan (NDSIP) which was published in July 2013.  As part of the follow-up to that initiative, I chaired the first special themed meeting of the National Disability Strategy Implementation Group (NDSIG) on the issue of Irish Sign Language on November 28, 2013. This meeting brought together representatives of relevant Departments, the NDA, the Deaf Community and other relevant stakeholders with a view to further progressing the implementation of the NDSIP in this regard. The meeting reviewed the current situation across Government Departments and their Agencies with regard to promoting recognition of Irish Sign Language including in-service provision and provided the Deaf Community with the opportunity of presenting their experience of interaction with the Public Sector. It also provided a useful opportunity to examine mechanisms which could promote the further use and recognition of Irish Sign Language and understand practical implications for service users. Further to this meeting, the Deaf Community prepared a report to reflect their views on key actions and priorities.  This report was submitted for my consideration last month. The intention is that the recommendations from this report will be reflected in the NDSIP where practicable, through the incorporation of new actions and related performance indicators and timelines as appropriate. Progress on all relevant actions will then be monitored as part of the Implementation Plan monitoring process. The focus is on the identification of mechanisms for the further promotion and recognition of Irish Sign Language with a view to promoting and supporting its use, so as to improve service delivery on the ground. I might add that the existing supports for use of Irish Sign Language in Ireland give a level of recognition and practical measures equal to, or above that, in countries which have formally recognised sign language. "
      },
      "contextDate": "2014-06-24"
    },
    {
      "question": {
        "date": "2014-06-24",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-06-24/writtens/dbsect_451",
          "showAs": "Mental Health Services Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-06-24/writtens/mul@/dbsect_451.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_451"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Health",
          "roleType": null
        },
        "showAs": " 536. Deputy Simon Harris asked the Minister for Health the number of emergency adolescent beds that are available in the Irish mental health services; where these beds are located; and if he will make a statement on the matter. [26656/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-06-24/pq_536",
        "questionNumber": 536,
        "answerText": " Minister of State at the Department of Health  As this is a service matter this question has been referred to the HSE for direct reply. "
      },
      "contextDate": "2014-06-24"
    },
    {
      "question": {
        "date": "2014-06-24",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-06-24/writtens/dbsect_452",
          "showAs": "Mental Health Services Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-06-24/writtens/mul@/dbsect_452.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_452"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Health",
          "roleType": null
        },
        "showAs": " 537. Deputy Simon Harris asked the Minister for Health the reason dialectical behaviour therapy is not provided by the Irish health services for adolescents despite the fact that this is a recommended treatment for borderline personality disorder and the fact that this treatment is available in other countries, including the UK; and if he will make a statement on the matter. [26657/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-06-24/pq_537",
        "questionNumber": 537,
        "answerText": " Minister of State at the Department of Health  The core aim of the HSE National Office for Suicide Prevention is to oversee the implementation, monitoring and evaluation of Reach Out , the National Strategy for Action on Suicide Prevention 2005 – 2014. Action Areas 12 and 13 in Reach Out which specifically relate to Deliberate Self-Harm and Mental Health Services aim to:  - Develop and resource an effective response in the health services for people who present to services having engaged in deliberate self-harm and design ways to reach out to those who self-harm, but are reluctant to access traditional services and supports.  - Improve mental health service provision, especially in the areas of community mental health, pre-discharge assessment from in-patient services, and follow-up support.  Dialectical Behaviour Therapy (DBT) helps reduce self-harm and self-destructive behaviours, using a combination of group skills training, individual therapy and phone coaching. DBT is delivered by a team of mental health professionals including psychiatrists, psychologists, social workers, occupational therapists, and nurses. It comprises individual therapy sessions for each participant, group skills training sessions delivered by two clinicians, crisis phone support and consultation meetings for clinicians each week.  Foundation and Intensive DBT training has been made available to all Integrated Service Areas through HSE National Office for Suicide Prevention funding in 2013/2014. Decisions on how, and if, DBT is provided are a matter for local HSE management. DBT training is not mandatory, and is very resource-intensive both in terms of preparing for, and committing to, training and subsequent service delivery. As such, it may not be suitable to all areas, and is only one of a broad range of service interventions.  By the end of 2013, 19 Community Mental Health Teams were trained in DBT. This includes 5 Child and Adolescent Mental Health Service (CAMHS) teams based in Donegal, Sligo, Cork (North Cork and North Lee area), and Linn Dara in Dublin. The HSE indicate that three more CAMHS teams will begin training in September 2014 - Cork South Lee, Galway and the Lucena clinic. All area teams were offered the opportunity to apply for this initiative, and all CAMHS teams that applied were accepted.  In 2014, the Department of Health and the HSE have committed to developing a new strategic framework for suicide prevention, building on the comprehensive work delivered under Reach Out. One of the core areas of practice for review and development is DBT. The framework, which is expected to be completed by the end of the year, will provide for improved coordination and integration of services to ensure that pathways of care for persons at risk of suicide or in suicidal crisis can be accessible, acceptable and available. "
      },
      "contextDate": "2014-06-24"
    },
    {
      "contextDate": "2014-06-19",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-06-19/writtens/mul@/dbsect_178.xml"
            }
          },
          "debateSectionId": "dbsect_178",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-06-19/writtens/dbsect_178",
          "showAs": "National Disability Strategy Implementation Plan"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-06-19/pq_143",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 143,
        "showAs": " 143. Deputy Simon Harris asked the Minister for Justice and Equality if she will provide an update on the implementation of the national disability strategy; and if she will make a statement on the matter. [26447/14] ",
        "answerText": " Minister of State at the Department of Justice and Equality (Deputy Kathleen Lynch)  In line with the Programme for Government commitment a National Disability Strategy Implementation Plan (NDSIP) was published in July 2013 following significant consultation and consideration between relevant Government Departments and representatives of a broad range of disability organisations. This Plan sets out the practical measures that will be taken to advance the National Disability Strategy over the period 2013 to 2015.  Progress on the Implementation Plan is reviewed by the National Disability Strategy Implementation Group (NDSIG) through thematic meetings which deal with specific issues. Such meetings are attended by all relevant bodies to ensure cross-sectoral input and review. All actions in the Plan relevant to the chosen issue are discussed and the progress made is mapped against commitments in the Plan. Two such thematic meetings were held in quarter 4 of 2013 and focussed on the themes of Irish Sign Language and Housing. The next themed meeting in quarter 3 of 2014 will focus on employment. In addition to the ongoing implementation of the actions being undertaken by the relevant Government Departments two new initiatives are currently being progressed. These are the drafting of a comprehensive employment strategy for people with disabilities and a review of the Implementation Plan with respect to how it addresses the needs of people with autism.  At my request, the National Disability Authority (NDA) and Mr. Christy Lynch (founder member of the Irish Association of Supported Employment) have initiated the drafting of a comprehensive employment strategy. A draft framework for the Strategy was agreed by the Senior Official's Group on Disability on 30 July 2013 and subsequently issued for consultation with all relevant stakeholders in August. Work is ongoing to finalise this Strategy.  I have also requested the NDA to examine how the Implementation Plan reflects the needs of people with autism. The NDA, as part of that examination, engaged in a consultation exercise with autism stakeholders and examined existing service provision across relevant departments for people with disabilities. The outcome of this process is under review by the NDSIG before further consideration of the issue will be under taken by the Cabinet Committee on Social Policy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2014-06-19",
        "by": {
          "showAs": "Simon Harris",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2014-06-19",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-06-19/writtens/mul@/dbsect_223.xml"
            }
          },
          "debateSectionId": "dbsect_223",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-06-19/writtens/dbsect_223",
          "showAs": "Services for People with Disabilities"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-06-19/pq_186",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 186,
        "showAs": " 186. Deputy Simon Harris asked the Minister for Health if he will provide an update on the inspections of residential homes for persons with disabilities and the implementation of the national standards for such residential homes; when inspections commenced; the number that have been carried out to date; and if he will make a statement on the matter. [26445/14] ",
        "answerText": " Minister of State at the Department of Health  As the Deputy is aware, the Programme for Government committed to putting 'National Standards for Residential Services for People with Disabilities' on a statutory footing to ensure that services could be inspected by the Health Information and Quality Authority (HIQA). This commitment was fulfilled when two regulations, one relating to care and support and the second relating to registration issues, were approved and signed by the Minister for Health, with the scheme commencing on 1st November 2013. The introduction of registration and inspection represents a significant advance in terms of delivering consistent and high quality services for people with disabilities in residential services.  I am informed by HIQA that it carried out 149 inspections of designated disability centres or disability units in the period between 1 November 2013 and mid-May 2014.  All residential services for people with disabilities have to be registered with HIQA, and assessed against the Health Act 2007, regulations and national standards. I understand that HIQA is currently compiling information and details of all residential centres for people with disabilities and is also developing a programme of registration activity for these centres to the end of the year.  In April 2014, HIQA completed the first formal registration of a designated centre for persons with disabilities in line with the provisions of the Health Act, 2007. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2014-06-19",
        "by": {
          "showAs": "Simon Harris",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2014-06-19",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-06-19/writtens/mul@/dbsect_224.xml"
            }
          },
          "debateSectionId": "dbsect_224",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-06-19/writtens/dbsect_224",
          "showAs": "Disability Services Funding"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-06-19/pq_187",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 187,
        "showAs": " 187. Deputy Simon Harris asked the Minister for Health the progress that has been made in fulfilling the commitment in the programme for Government to move some funding in the disability sector towards the area of personal budgets in order that persons with disabilities have greater flexibility in terms of the services they obtain and require and so they are empowered to make decisions appropriate to their own individual life; and if he will make a statement on the matter.  [26446/14] ",
        "answerText": " Minister of State at the Department of Health  The Department of Health and the Health Service Executive are pursuing the issue of individualised budgeting in the context of implementing the recommendations in the Value for Money (VFM) and Policy Review of Disability Services in Ireland. The move towards individualised budgeting will also mirror the wider changes in the health sector described in Future Health: A Strategic Framework for Reform of the Health Service 2012 – 2015, which envisages a migration towards a more person-centred service and a closer alignment between funding and the outcomes.  Individualised budgeting may take many forms, ranging from a method of determining resource allocation to agencies based on assessed client need and actual costs, to a money follows the person model, a brokerage system or a personal budget model administered by the individual service user. Further work is necessary before decisions can be taken on the form or forms which individualised budgeting will take, but the essence of it will be that the individual is given more choice and control over how the money allocated to meet their needs is utilised.  The move towards an individualised budgeting framework raises legal and practical issues, and will require careful consideration and planning. Future Health explains that central to the introduction of individualised budgeting will be suitable financial systems; transparent and comprehensive governance arrangements; a National Standard Needs Assessment framework; underpinning legislation and the introduction of a regulatory system for providers to ensure quality and safety for the recipients of social services.  Demonstration projects are already underway to examine the practical aspects of introducing this major change in the disability sector and to establish the costs and benefits. An analysis of the projects will commence towards the end of 2014 to determine their wider applicability, clarify the issues which must be resolved before the projects can be scaled up, and identify the best way forward. The completion of this analysis is a primary recommendation in the VFM Review and is required for all significant public service expenditure proposals. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2014-06-19",
        "by": {
          "showAs": "Simon Harris",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09"
        }
      }
    },
    {
      "question": {
        "date": "2014-06-17",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-06-17/writtens/dbsect_104",
          "showAs": "Pensions Levy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-06-17/writtens/mul@/dbsect_104.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_104"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Finance",
          "roleType": null
        },
        "showAs": " 146. Deputy Simon Harris asked the Minister for Finance the rationale behind the pension levy; the purpose for which the levy will be utilised; if he will consider information (details supplied); and if he will make a statement on the matter. [25263/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-06-17/pq_146",
        "questionNumber": 146,
        "answerText": " Minister for Finance  I announced in my Budget 2014 speech that the 0.6% Pension Fund Levy introduced to fund the Jobs Initiative in 2011 will be abolished from the 31st of December 2014. I have, however, introduced an additional levy on pension funds at 0.15% for 2014 and 2015. I am doing this to, among other things, continue to help fund the Jobs Initiative.  The reduced VAT rate of 9% on tourism and certain other services was one of the very significant and successful measures introduced by the Jobs Initiative. It was due to end in 2013. In my Budget 2014 speech I announced the continuation of the reduced 9% VAT rate. I also announced that the Air Travel Tax is being reduced to zero with effect from 1 April 2014. The 9% VAT rate has helped to create 15,000 new jobs as well as protecting existing jobs. Since the Budget announcement about the reduction in the Air Travel Tax, airlines have announced the opening up of new routes resulting in significant increases in passenger numbers with the associated increase in tourism activity and employment.  The additional 0.15% levy for 2014 and 2015 will also be used to help make provision for potential State liabilities which may emerge from pre-existing or future pension fund difficulties although funds from the levy will not be hypothecated or specifically set aside for this purpose. The Government has decided that such liabilities will be met by the Exchequer as they arise.  The chargeable persons for the pension fund levy are the trustees or other persons (including insurance companies) with responsibility for the management of the assets of the pension schemes or plans. The payment of the levy is treated as a necessary expense of a pension scheme and the trustees or insurer, as appropriate, are entitled, where they decide to do so, to adjust current or prospective benefits payable under a scheme to take account of the levy. It is up to the trustees to decide whether and how the levy should be passed on and who should be impacted and to what extent, given the particular circumstances of the pension schemes for which they are responsible.  However, should the option of reducing scheme benefits be taken, in no case may the reduction in an individual member's or class of member's benefits exceed the member's or class of member's share of the levy.  I am conscious of the significant contribution of taxpayers, generally, to the rebalancing of the public finances and the measures introduced to support and develop the economy. There has been progress in these areas. These efforts are ongoing, including the continuation of measures in the Jobs Initiative, designed to improve the economic environment by providing the means to encourage job creation in areas of our economy most likely to deliver that employment in the shortest timeframe possible. "
      },
      "contextDate": "2014-06-17"
    },
    {
      "question": {
        "date": "2014-06-17",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-06-17/writtens/dbsect_164",
          "showAs": "Emergency Works Scheme Applications",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-06-17/writtens/mul@/dbsect_164.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_164"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Education",
          "roleType": null
        },
        "showAs": " 216. Deputy Simon Harris asked the Minister for Education and Skills the position regarding an application for emergency funding in respect of a school (details supplied) in County Wicklow; and if he will make a statement on the matter. [25294/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-06-17/pq_216",
        "questionNumber": 216,
        "answerText": " Minister for Education and Skills  I can confirm that the school to which the Deputy refers has made an application to my Department for large scale capital funding to provide improved accommodation. The application will be considered and a decision will be conveyed to the school authority as soon as this process has been completed. "
      },
      "contextDate": "2014-06-17"
    },
    {
      "question": {
        "date": "2014-06-17",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-06-17/writtens/dbsect_622",
          "showAs": "Tourism Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-06-17/writtens/mul@/dbsect_622.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_622"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Transport",
          "roleType": null
        },
        "showAs": " 748. Deputy Simon Harris asked the Minister for Transport, Tourism and Sport if an application was received by Fáilte Ireland for a festival (details supplied) in County Wicklow; if it was successful; the application procedure; and if he will make a statement on the matter. [25247/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-06-17/pq_748",
        "questionNumber": 748,
        "answerText": " Minister of State at the Department of Transport, Tourism and Sport  I have no direct role in relation to the allocation of tourism funding for festivals as this is a matter for the board and management of Fáilte Ireland.  Accordingly, I have referred the question to the agency for direct reply.  The Deputy should contact my private office if he does not receive a reply within ten working days. "
      },
      "contextDate": "2014-06-17"
    },
    {
      "question": {
        "date": "2014-06-11",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-06-11/writtens/dbsect_81",
          "showAs": "Mental Health Awareness",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-06-11/writtens/mul@/dbsect_81.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_81"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Education",
          "roleType": null
        },
        "showAs": " 49. Deputy Simon Harris asked the Minister for Education and Skills the way schools are implementing well-being in post-primary schools; if an audit-evaluation has been undertaken on this; and if he will make a statement on the matter. [24843/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-06-11/pq_49",
        "questionNumber": 49,
        "answerText": " Minister for Education and Skills  My Department, along with the Department of Health and the HSE, jointly published 'Well-Being in Post- Primary Schools: Guidelines for Mental Health Promotion and Suicide Prevention' in 2013. The guidelines provide practical advice to post-primary schools on how they can promote mental health and well-being in an integrated manner within the school environment.  These guidelines complement a number of other measures which support positive well-being among post primary students. These encompass, inter alia, the inclusion of 'Well Being' as one of the eight key principles in the new Junior Cycle Framework, and the development of a new short course in Social Personal and Health Education (SPHE). The new short course will be available to post primary schools from September, to implement, should they wish to do so, as part of their Junior Cycle Framework.Post primary schools are also encouraged to participate in the 'Health Promoting Schools' initiative, which is supported by the Department of Health. This European-wide programme aims to strengthen schools' capacity to be a healthy setting for learning and working by focusing at whole-school level on all the conditions that affect health and well-being.  The results from our second Lifeskills survey which were published by my Department this January indicate that approximately 37% of respondent post primary schools are currently in the Health Promoting Schools initiative or are in the process of joining. My Department is working with the Department of Health to increase participation among post primary schools in this initiative.  As part of its ongoing programme of thematic evaluation into aspects of school quality, my Department's Inspectorate is currently developing an inspection model to evaluate primary and post primary schools' provision for students' well-being. "
      },
      "contextDate": "2014-06-11"
    },
    {
      "question": {
        "date": "2014-06-11",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-06-11/writtens/dbsect_123",
          "showAs": "Housing Issues",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-06-11/writtens/mul@/dbsect_123.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_123"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Environment",
          "roleType": null
        },
        "showAs": " 104. Deputy Simon Harris asked the Minister for the Environment, Community and Local Government his plans to amend the Planning and Development Act 2000; if consideration will be given to assisting families who need to sell their houses through the affordable housing scheme (details supplied); and if he will make a statement on the matter. [24831/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-06-11/pq_104",
        "questionNumber": 104,
        "answerText": " Minister of State at the Department of the Environment, Community and Local Government  The Government’s 2011 Housing Policy Statement announced the standing down of all affordable housing schemes in the context of a full review of Part V of the Planning and Development Acts 2000-2013. Details regarding the review are available on my Department’s website: http://www.environ.ie/en/DevelopmentHousing/Housing/PublicConsultations/.  Action 9 of the recently published Construction 2020 – A Strategy for a Renewed Construction Sector provides that the review of Part V will be completed in Q2 of 2014. It is anticipated that any legislative changes required on foot of the review will be incorporated into the General Scheme of a Planning Bill, which is currently in preparation.  The claw-back provision under section 99 of the Planning and Development Act 2000, as amended, is intended to prevent short-term profit taking on the resale of the house to the detriment of the objectives of the scheme. However, where a person is selling and the clawback amount payable would reduce the proceeds of resale below the initial price actually paid, the legislation provides for the amount of the clawback payable to be reduced to the extent necessary to avoid that result. Legal and auctioneering fees are costs which vendors bear separately, as do all other owner-occupiers who choose to sell their home. "
      },
      "contextDate": "2014-06-11"
    },
    {
      "question": {
        "date": "2014-06-11",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-06-11/writtens/dbsect_153",
          "showAs": "HSE Reports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-06-11/writtens/mul@/dbsect_153.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_153"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Health",
          "roleType": null
        },
        "showAs": " 136. Deputy Simon Harris asked the Minister for Health if the Health Service Executive has received internal audits into two section 39 organisations (details supplied); and if he will make a statement on the matter. [24810/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-06-11/pq_136",
        "questionNumber": 136,
        "answerText": " Minister of State at the Department of Health  As this is a service matter it has been referred to the Health Service Executive for direct reply. "
      },
      "contextDate": "2014-06-11"
    },
    {
      "contextDate": "2014-06-10",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-06-10/writtens/mul@/dbsect_307.xml"
            }
          },
          "debateSectionId": "dbsect_307",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-06-10/writtens/dbsect_307",
          "showAs": "Agriculture Scheme Payments"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-06-10/pq_413",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 413,
        "showAs": " 413. Deputy Simon Harris asked the Minister for Agriculture, Food and the Marine the amount of an allocation that will be in place for the grassland sheep payment; if he will provide details of his proposals in relation to this issue; and if he will make a statement on the matter. [24261/14] ",
        "answerText": " Minister for Agriculture, Food and the Marine  The Grassland Sheep Scheme is based on Article 68 of the current EU Regulation 73/2009 which governs direct payments in the form of the Single Payment Scheme. As of 1 January 2015 that Regulation is superseded by EU Regulation 1307/2013 and consequently there is no longer any legal basis for the continuation of the Grassland Sheep Scheme in its present form.  In developing the shape of the new system of Direct Payments in Ireland, I have been very conscious of the needs of sheep farmers, in particular those who farm on hill and commonage land. In general, sheep farmers hold low value entitlements under the current Single Payment Scheme and will benefit significantly from the model of convergence that is to be applied in Ireland where those with a low Initial Unit Value will see the value of their entitlements increase over the period of the scheme.  When determining the Initial Unit Value of a farmer’s entitlements under the Basic Payment Scheme in 2015, Regulation 1307/2013 gives Member States the option to take into account any payment the farmer received in 2014 under Article 68 schemes such as the Grassland Sheep Scheme. This option is only available where the Member State is not applying voluntary coupled support to the sector concerned under the new CAP.  I have decided to apply this provision in Ireland as a means of safeguarding the value of the payments received under the Grassland Sheep Scheme for those farmers concerned. The Grassland Sheep Scheme is the only Article 68 scheme that is being incorporated into the calculation of entitlements under the new Basic Payment Scheme. If such incorporation does not take place the value of such payments would simply remain in the national fund and would be redistributed generally among all farmers who establish entitlements.  The incorporation of the Grassland Sheep Scheme payment into the calculation of a farmer’s Initial Unit Value in 2015 will obviously result in a higher entitlement value for the farmers concerned from the start of the Scheme rather than relying solely on the gradual process of convergence to increase the unit value over the five year period up to 2019. Our analysis confirms that as a result of this provision the group of farmers who receive the Grassland Sheep Scheme will have an immediate financial benefit in 2015 as part of their payment under the Basic Payment Scheme. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2014-06-10",
        "by": {
          "showAs": "Simon Harris",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09"
        }
      }
    },
    {
      "question": {
        "date": "2014-06-05",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-06-05/writtens/dbsect_119",
          "showAs": "Symphysiotomy Reports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-06-05/writtens/mul@/dbsect_119.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_119"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Health",
          "roleType": null
        },
        "showAs": " 107. Deputy Simon Harris asked the Minister for Health if he will provide an update on the action being taken to provide support and redress to survivors of symphysiotomy; and if he will make a statement on the matter. [24016/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-06-05/pq_107",
        "questionNumber": 107,
        "answerText": " Minister for Health  My priority continues to be to ensure that the women who have undergone surgical symphysiotomy continue to have their health needs comprehensively and professionally met. The HSE provides a range of services to women who may be experiencing any adverse effects as a result of undergoing this procedure. These services include the provision of medical cards, the availability of independent clinical advice and the organisation of individual pathways of care and the arrangement of appropriate follow-up. All of these services are available on request by the women from the HSE nominated Symphysiotomy Liaison Officers.  Since coming into office, I have endeavoured to satisfactorily facilitate closure for around 250-350 women affected by symphysiotomy.  On 26 November 2013, Government approved the appointment of retired Circuit Court Judge Yvonne Murphy to assist in setting out a possible course of action in relation to women who have undergone surgical symphysiotomies. Judge Murphy commenced her review of issues relating to Symphysiotomy in December and submitted her report to me in mid-March.  I am closely examining the report and its recommendations. I will bring a Memorandum to Government in the coming weeks, so that a decision can be taken as early as possible regarding next steps.  Any proposals brought to Government will also take into account the findings of the independent research report on Symphysiotomy in Ireland 1944-1984, which was commissioned by my Department (the Walsh Report), along with any other relevant information. It is intended that the Walsh Report will be published once the Government has decided on its response to this complex and sensitive issue. "
      },
      "contextDate": "2014-06-05"
    },
    {
      "question": {
        "date": "2014-06-04",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-06-04/writtens/dbsect_73",
          "showAs": "School Textbooks Rental Scheme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-06-04/writtens/mul@/dbsect_73.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_73"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Education",
          "roleType": null
        },
        "showAs": " 49. Deputy Simon Harris asked the Minister for Education and Skills if a school (details supplied) in County Wicklow which does not currently operate a book rental scheme will receive funding for the establishment of such under the book rental scheme 2014; and if he will make a statement on the matter. [23679/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-06-04/pq_49",
        "questionNumber": 49,
        "answerText": " Minister for Education and Skills  In Budget 2013 funding of €5million for three years was provided to support the establishment of book rental schemes in primary schools that did not operate such schemes. DEIS schools will receive €150 per child and non-DEIS schools will receive €100 per child in seed capital over the next two years to establish book rental schemes. This will cost approximately €6.7m. The school referred to by the Deputy operates a book rental/loan scheme and therefore did not qualify for this funding under the initial scheme.  I indicated that following allocation of the initial round of funding, I would re-examine the scheme to see if I could allocate funding to primary schools that already had such schemes. I am pleased to advise the Deputy that the balance of the funding, some €8.3m, will be divided among all primary schools that currently operate book rental schemes in 2015 and 2016. These schools are expected to receive €18 per pupil or €20 per pupil in DEIS schools over those two years. Every primary schools, including the school referred to by the Deputy, will now benefit from the School Book Rental Scheme. "
      },
      "contextDate": "2014-06-04"
    },
    {
      "question": {
        "date": "2014-05-27",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-05-27/writtens/dbsect_240",
          "showAs": "School Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-05-27/writtens/mul@/dbsect_240.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_240"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Education",
          "roleType": null
        },
        "showAs": " 236. Deputy Simon Harris asked the Minister for Education and Skills the action his Department has taken to date to ensure that all children in an area (details supplied) have a school place for the school year 2014-15; when a review of accommodation needs in this area will be complete; how soon following this review he expects to make a decision regarding additional classes for the schools in the area; and if he will make a statement on the matter. [22538/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-05-27/pq_236",
        "questionNumber": 236,
        "answerText": " Minister for Education and Skills  The Deputy will be aware that 15 additional classrooms were put in place in the area to which he refers for the 2013/2014 school year onward following the completion of two new 16 classroom school buildings for a Gaelscoil and an Educate Together school. Devolved funding has also been made available for the provision of a further 5 mainstream classrooms to cater for accommodation needs in the area in 2013, 2014 and onwards. The breakdown of this accommodation provision is:  - St. Laurence's N.S. - 2 classrooms  - St. Patrick's N.S. - 2 classrooms  - St. Kevin's N.S. - 1 classroom  I am aware that the schools in the area are engaging with each other in the context of addressing enrolment demand for September 2014. My Department will continue to keep the matter under review. "
      },
      "contextDate": "2014-05-27"
    },
    {
      "question": {
        "date": "2014-05-08",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-05-08/writtens/dbsect_153",
          "showAs": "Water Quality",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-05-08/writtens/mul@/dbsect_153.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_153"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Environment",
          "roleType": null
        },
        "showAs": " 143. Deputy Simon Harris asked the Minister for the Environment, Community and Local Government the action being taken to address the now annual issues which Wicklow residents are experiencing with the contamination of Vartry water supply with algae; and if he will make a statement on the matter. [20686/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-05-08/pq_143",
        "questionNumber": 143,
        "answerText": " Minister for the Environment, Community and Local Government  I have no responsibility for, or role in relation to, the day to day management, maintenance or operation of water supplies. Since 1 January 2014 , Irish Water has statutory responsibility for all aspects of water services planning, delivery and operation at national, regional and local levels. Irish Water has confirmed to my Department that it has established a dedicated team to deal with representations and queries from public representatives. The team can be contacted via email at oireachtasmembers@water.ie or by telephone on 1890 278 278. "
      },
      "contextDate": "2014-05-08"
    },
    {
      "question": {
        "date": "2014-05-07",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-05-07/writtens/dbsect_123",
          "showAs": "School Enrolments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-05-07/writtens/mul@/dbsect_123.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_123"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Education",
          "roleType": null
        },
        "showAs": " 96. Deputy Simon Harris asked the Minister for Education and Skills the action his Department has taken to date to ensure that all children in an area (details supplied) have a school place for September 2014; if additional classes have been allocated to the primary schools in the area and, if so, which schools; when this matter will be concluded as it is causing significant stress and worry for many parents; and if he will make a statement on the matter.  [20611/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-05-07/pq_96",
        "questionNumber": 96,
        "answerText": " Minister for Education and Skills  15 additional classrooms were put in place in the area to which the Deputy refers for the 2013/2014 school year following the completion of two new school buildings for a Gaelscoil and an Educate Together school. Devolved funding has been made available for the provision of a further 5 mainstream classrooms to cater for accommodation needs in the area in 2013 and 2014. The breakdown of this accommodation provision is: St. Laurences N.S. - 2 classrooms; St. Patrick's N.S. - 2 classrooms; St. Kevin's N.S. - 1 classroom. My Department will keep the area under review to ensure that any further accommodation needs are met in a timely manner. "
      },
      "contextDate": "2014-05-07"
    },
    {
      "question": {
        "date": "2014-04-30",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-04-30/writtens/dbsect_162",
          "showAs": "Health Promotion",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-04-30/writtens/mul@/dbsect_162.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_162"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Education",
          "roleType": null
        },
        "showAs": " 149. Deputy Simon Harris asked the Minister for Education and Skills if he will provide an update on the implementation of guidelines in promoting mental health in primary schools; and if he will make a statement on the matter. [18905/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-04-30/pq_149",
        "questionNumber": 149,
        "answerText": " Minister for Education and Skills  Guidelines for primary schools on promoting well-being and mental health are currently being developed by my Department. It is expected that the guidelines will be available to primary schools in the autumn. These guidelines will complement 'Well-Being in Post- Primary Schools: Guidelines for Mental Health Promotion and Suicide Prevention' which was published jointly by my Department, the Department of Health and the HSE in 2013.  The primary school guidelines will complement existing measures to promote positive mental health at primary level. Such measures include the Social Personal and Health Education (SPHE) programme which is mandatory at primary level. The SPHE programme contains a number of specific aims that are relevant to positive mental health and well-being. These include promoting all aspects of the child's health, fostering in the child a sense of care and respect for himself/herself, and enabling the child to make informed decisions and choices about all aspects of life including health.  Primary schools are also encouraged to participate in the 'Health Promoting Schools' initiative, which is supported by the Department of Health. This European-wide programme aims to strengthen schools' capacity be a healthy setting for learning and working by focusing at whole-school level on all the conditions that affect health and well-being. The results from the second Lifeskills survey which were published by my Department in January of this year indicate that approximately 40% of respondent primary schools are currently in the Health Promoting Schools initiative or are in the process of joining. My Department is working with the Department of Health to increase participation among primary schools in this initiative. "
      },
      "contextDate": "2014-04-30"
    },
    {
      "question": {
        "date": "2014-04-30",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-04-30/writtens/dbsect_716",
          "showAs": "HSE Staffing",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-04-30/writtens/mul@/dbsect_716.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_716"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Health",
          "roleType": null
        },
        "showAs": " 785. Deputy Simon Harris asked the Minister for Health if a position (details supplied) within the Health Service Executive in County Wicklow has been filled and the timeframe within which the position has been advertised; and if he will make a statement on the matter.  [18906/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-04-30/pq_785",
        "questionNumber": 785,
        "answerText": " Minister for Health  As this is an operational matter it has been referred to the Health Service Executive for direct reply. "
      },
      "contextDate": "2014-04-30"
    },
    {
      "question": {
        "date": "2014-04-30",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-04-30/writtens/dbsect_717",
          "showAs": "Health Promotion",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-04-30/writtens/mul@/dbsect_717.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_717"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Health",
          "roleType": null
        },
        "showAs": " 786. Deputy Simon Harris asked the Minister for Health if he will provide an update on the implementation of Schools for Health in Europe; and if he will make a statement on the matter. [18907/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-04-30/pq_786",
        "questionNumber": 786,
        "answerText": " Minister for Health  As the implementation of Schools for Health in Europe is part of the Executive Function of the HSE I have referred the matter to the HSE for direct reply to the Deputy. "
      },
      "contextDate": "2014-04-30"
    },
    {
      "question": {
        "date": "2014-04-10",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-04-10/writtens/dbsect_72",
          "showAs": "School Transport Administration",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-04-10/writtens/mul@/dbsect_72.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_72"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Education",
          "roleType": null
        },
        "showAs": " 57. Deputy Simon Harris asked the Minister for Education and Skills if his attention has been drawn to the fact that the EU Commission on 21 March 2014 indicated in answer number E-000830/2014 that it has not seen the Farrell Grant Sparks report on the review of overhead and indirect costs for the administration of the school transport scheme, completed in October 2009, and that it will request a copy of the report from the Irish authorities; the action he will take regarding same; and if he will make a statement on the matter.  [17155/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-04-10/pq_57",
        "questionNumber": 57,
        "answerText": " Minister of State at the Department of Education and Skills  I am not aware of the answer referred to by the Deputy. My Department will fully consider any request for information from the EU Commission upon receipt of a request. "
      },
      "contextDate": "2014-04-10"
    },
    {
      "question": {
        "date": "2014-04-10",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-04-10/writtens/dbsect_73",
          "showAs": "School Transport Administration",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-04-10/writtens/mul@/dbsect_73.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_73"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Education",
          "roleType": null
        },
        "showAs": " 58. Deputy Simon Harris asked the Minister for Education and Skills the reason his Department did not give the Farrell Grant Sparks report on the review of the overhead and indirect costs for the administration of the school transport scheme completed in October 2009 to the EU Commission state aid investigation C31/07; and if he will make a statement on the matter.  [17156/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-04-10/pq_58",
        "questionNumber": 58,
        "answerText": " Minister of State at the Department of Education and Skills  The European Commission commenced an investigation with regard to State aid to Bus Éireann and Dublin Bus in 2007. The State's response was coordinated by the Department of Transport, Tourism and Sport and my Department supplied any information to that Department as required by the Commission. Neither the FGS report, nor information relating to, or contained in the report, was sought as part of the investigation. "
      },
      "contextDate": "2014-04-10"
    },
    {
      "question": {
        "date": "2014-04-10",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-04-10/writtens/dbsect_75",
          "showAs": "School Transport Administration",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-04-10/writtens/mul@/dbsect_75.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_75"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Education",
          "roleType": null
        },
        "showAs": " 59. Deputy Simon Harris asked the Minister for Education and Skills if he will confirm that on the date that the FGS report was sent to the Department of Finance that it was not advised of any agreement in place to keep the contents of the report confidential; if he will provide the date it was sent and confirm whether or not the confidential agreement was put in place for any reason convenient to his Department; and if he will make a statement on the matter.  [17157/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-04-10/pq_59",
        "questionNumber": 59,
        "answerText": " Minister of State at the Department of Education and Skills  The report was made available to the Department of Finance on 16th October 2009. The specific confidentiality agreement was not referred to, but the Department of Finance was advised that the report contained commercially sensitive material and was being made available solely for the use of that Department. The confidentiality agreement referred to by the Deputy was put in place prior to the commencement of the review, between Bus Éireann and FGS, to address concerns of commercial sensitivity and not for any reason convenient to the Department. It is my intention, my Department having concluded discussions with Bus Éireann in relation to issues which may be commercially sensitive, that the FGS report will be published shortly and available to the Deputy. "
      },
      "contextDate": "2014-04-10"
    },
    {
      "question": {
        "date": "2014-04-09",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-04-09/writtens/dbsect_147",
          "showAs": "Motor Tax Collection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-04-09/writtens/mul@/dbsect_147.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_147"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Environment",
          "roleType": null
        },
        "showAs": " 121. Deputy Simon Harris asked the Minister for the Environment, Community and Local Government if he will consider rectifying the substantial additional cost which motorists who tax their vehicles on a quarterly or biannual basis must pay as opposed to those who tax their car annually in view of the fact that many people find that they are not in a position to pay the full amount in one lump sum and the fact that administrative costs for motor taxation are lessened in view of the fact that motorists now apply for their tax disc online; and if he will make a statement on the matter. [16984/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-04-09/pq_121",
        "questionNumber": 121,
        "answerText": " Minister for the Environment, Community and Local Government  Motor tax is payable on an annual, half-yearly or quarterly basis. The Finance (Excise Duties) (Vehicles) Act 1952 provides that the rate of duty for a quarterly tax disc must not exceed 30% of the annual duty applicable and sets no upper limit for a half-yearly disc. The rates of duty currently applicable to the quarterly and half-yearly discs are 28.25% and 55.5% of the annual rate, respectively. These relativities have remained generally constant since the 1960s.  Non-annual transactions make up over two-thirds of all motor transactions processed. Tax rates for these vehicles take account of the extra workload for the National Vehicle and Driver File (NVDF) and motor tax offices, and the resultant higher administrative and printing costs. In addition, reminders are issued on each renewal. While costs may have reduced in respect of those paying on-line, they are not negligible.  The estimated annual income from the increased charges for half-yearly and quarterly vehicle licences is in the region of €50m. A loss in income from this source would have a negative impact on the Local Government Fund and consequently on grant allocations to local authorities from the Fund, and would have to be borne elsewhere in the motor tax system, or through the taxation system generally.  I have no plans to adjust the basis for paying motor tax on a half-yearly or quarterly basis. "
      },
      "contextDate": "2014-04-09"
    },
    {
      "question": {
        "date": "2014-04-08",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-04-08/writtens/dbsect_175",
          "showAs": "Summer Works Scheme Applications",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-04-08/writtens/mul@/dbsect_175.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_175"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Education",
          "roleType": null
        },
        "showAs": " 181. Deputy Simon Harris asked the Minister for Education and Skills if consideration will be given to make funding available for specific works in a school (details supplied) in County Wicklow; and if he will make a statement on the matter. [16014/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-04-08/pq_181",
        "questionNumber": 181,
        "answerText": " Minister for Education and Skills  The Deputy will be aware that on 20th March last I announced that 386 schools have been approved funding under the Summer Works Scheme to undertake school improvement works. This first round of funding will allow schools to carry out small and medium scale building works across three categories of projects - Gas, Electrical and Mechanical. The assessment of applications, under further categories (Categories 5 to 10) on a top down basis in accordance with the prioritisation criteria outlined in the governing Circular Letter for the Scheme, including the application in question, is continuing. It is my intention to publish a list of successful applicants under a second round of the Scheme in the coming weeks. "
      },
      "contextDate": "2014-04-08"
    },
    {
      "question": {
        "date": "2014-04-08",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-04-08/writtens/dbsect_190",
          "showAs": "Summer Works Scheme Expenditure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-04-08/writtens/mul@/dbsect_190.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_190"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Education",
          "roleType": null
        },
        "showAs": " 197. Deputy Simon Harris asked the Minister for Education and Skills if consideration will be given to make funding available for works in a school (details supplied) in County Wicklow; and if he will make a statement on the matter. [16287/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-04-08/pq_197",
        "questionNumber": 197,
        "answerText": " Minister for Education and Skills  The Deputy will be aware that on 20th March last, I announced that 386 schools have been approved funding under the Summer Works Scheme to undertake school improvement works. This first round of funding will allow schools to carry out small and medium scale building works across three categories of projects - Gas, Electrical and Mechanical. A second round of the scheme is expected to be announced in the coming weeks within the context of available funding and in accordance with the prioritisation criteria outlined in the governing Circular Letter for the Scheme. This Circular Letter (59/2013) is available on my Department's website www.education.ie. This round will cover applications for improvement works yet to be assessed, including the application from the school to which the Deputy refers. "
      },
      "contextDate": "2014-04-08"
    },
    {
      "question": {
        "date": "2014-04-01",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-04-01/writtens/dbsect_129",
          "showAs": "Special Educational Needs Service Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-04-01/writtens/mul@/dbsect_129.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_129"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Education",
          "roleType": null
        },
        "showAs": " 202. Deputy Simon Harris asked the Minister for Education and Skills if an ASD facility will be supplied in a school (details supplied) in County Wicklow; and if he will make a statement on the matter. [14938/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-04-01/pq_202",
        "questionNumber": 202,
        "answerText": " Minister for Education and Skills  The Deputy will be aware that the establishment of a network of autism-specific special classes in schools across the country to cater for children with autism has been a key educational priority in recent years.  The National Council for Special Education (NCSE), through its network of local Special Educational Needs Organisers (SENOs), is responsible for processing applications from primary and post primary schools for special educational needs supports, including the establishment of special classes in various geographical areas as required. The NCSE operates within my Department's criteria in allocating such support.  I have therefore arranged for the Deputy's question relating to provision at post primary level to be forwarded to the NCSE for their attention and direct reply. "
      },
      "contextDate": "2014-04-01"
    },
    {
      "question": {
        "date": "2014-04-01",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-04-01/writtens/dbsect_197",
          "showAs": "Disability Allowance Applications Waiting Times",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-04-01/writtens/mul@/dbsect_197.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_197"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Social",
          "roleType": null
        },
        "showAs": " 279. Deputy Simon Harris asked the Minister for Social Protection the number of disability allowance applications waiting to be processed by her Department; the average length of time it takes to process new disability allowance applications and reviews of additional medical evidence; her views on whether this length of time is fair and equitable; and if she will make a statement on the matter. [15025/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-04-01/pq_279",
        "questionNumber": 279,
        "answerText": " Minister for Social Protection  Processing time for individual disability allowance claims can vary depending on the complexity of the claimant's circumstances and the information they provide. Approximately 430 new applications for disability allowance are received each week and are actioned immediately. At present, the average number of weeks to make a decision on a new disability allowance application is just over 11 weeks.  There are approximately 4,100 new applications for disability allowance awaiting decision – down from over 6,800 cases this time last year and continuing to reduce. Of this 4,100, approximately 1,400 have been actioned and are awaiting further information from the claimant or a report from a social welfare investigator before a decision can be made.  The Department is committed to delivering the best possible service to its customers. Operational processes and procedures and the organisation of work are continually reviewed in all areas of the Department, including disability allowance section, to ensure that claims are processed and decided in the most efficient and expeditious way possible, having regard to the eligibility conditions that apply to each scheme.  There are approximately 540 applications awaiting review of a decision to disallow a new application. Approximately 525 of these have sent in additional medical evidence which is waiting to be assessed by a medical assessor prior to the deciding officer review.  People who have urgent income support needs and are awaiting a decision on their application may apply for a means tested supplementary welfare allowance from their local community welfare service. "
      },
      "contextDate": "2014-04-01"
    },
    {
      "question": {
        "date": "2014-03-26",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-03-26/writtens/dbsect_219",
          "showAs": "Vehicle Clamping",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-03-26/writtens/mul@/dbsect_219.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_219"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Transport",
          "roleType": null
        },
        "showAs": " 227. Deputy Simon Harris asked the Minister for Transport, Tourism and Sport his plans to regulate the clamping industry; and if he will make a statement on the matter. [14255/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-03-26/pq_227",
        "questionNumber": 227,
        "answerText": " Minister for Transport, Tourism and Sport  The Programme for Government contains a commitment “to legislate to regulate the vehicle clamping industry”. Therefore, in late 2011 I asked the then Joint Committee on Environment, Transport, Culture and Gaeltacht to provide views on the initial draft of the legislation. The Committee carried out a number of hearings on the matter and published detailed recommendations on the issues that should be included. In March 2013, the Government approved the drafting of a Regulation of Vehicle Immobilisation Bill. The Bill is currently being drafted by the Office of the Parliamentary Counsel and I expect to publish it this year. "
      },
      "contextDate": "2014-03-26"
    },
    {
      "question": {
        "date": "2014-03-25",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-03-25/debate/dbsect_20",
          "showAs": "European Council Meetings",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-03-25/debate/mul@/dbsect_20.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_20"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "oral",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Taoiseach",
          "roleType": null
        },
        "showAs": " 14. Deputy Simon Harris asked the Taoiseach if discussions have taken place at a European Council level on addressing the problem of youth unemployment across Europe; and if he will make a statement on the matter. [2193/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-03-25/pq_14",
        "questionNumber": 14,
        "answerText": " The Taoiseach  I propose to take Questions Nos. 1 to 35, inclusive, together.  I participated in the European Council on 19 and 20 December last. As Members will be aware, however, since then I have also participated in an extraordinary meeting of Heads of State and Government on Ukraine on 6 March, as well as the spring European Council on 20 and 21 March, where the deeply disturbing situation in Ukraine was again the dominant issue. I will start with our most recent meeting before I go back to the December Council. The extraordinary meeting of European Union leaders in Brussels on 6 March condemned the unprovoked violation of Ukrainian sovereignty and territorial integrity and called on the Russian Federation to withdraw immediately its armed forces. We agreed on a three-phase roadmap of measures that would be taken against the Russian Federation, depending on its actions. The deteriorating situation and the Russian annexation of Crimea was, of course, a central focus at the spring European Council last week. In the absence of any steps towards de-escalation by Russia, the European Council took additional measures against Moscow. We decided to cancel the next EU-Russia summit and agreed to expand to 33 the number of listed individuals to be subject to a visa ban and asset freezes. In addition the European Commission was asked to evaluate the legal consequences of the annexation and to prepare possible targeted measures. The question of the nature and scope of measures is always a complex and difficult issue and, as I stated in Brussels, inevitably will have negative economic consequences for the EU, including Ireland, as well as for Russia. It is only right, therefore, that we prepare such decisions carefully. The political elements of the EU's association agreement with Ukraine were also signed at last week's meeting. We welcomed, in addition, the Ukrainian Government's commitment to ensuring that governmental structures are inclusive and reflect regional diversity and to ensure full protection of the rights of persons belonging to national minorities.  Of course, the agenda for last week's meeting was wider than Ukraine alone. It had an economic focus and covered the European semester, Europe 2020, industrial competitiveness, banking union, taxation, climate change and energy and external relations.  Banking union remains a clear priority for the Government. My colleagues and I were particularly pleased last week to welcome the agreement reached with the European Parliament on the single resolution mechanism, which will be a cornerstone of that banking union. We now must see the formal adoption of the mechanism before the European Parliament rises for elections. The European Council held useful discussions on the European semester, the planned review of the Europe 2020 strategy and industrial competitiveness. We agreed on the importance of ensuring the right overall framework to promote a strong and competitive industrial base to drive economic growth and jobs.  Leaders also held a first policy debate on the framework for climate and energy to 2030. We agreed on the urgent need to further analyse the implications for member states of proposals for emissions reductions and renewable energy. I made clear that for Ireland, account must be taken of the particular role of agriculture, and the President of the Council was reassuring on this aspect. The European Council will take stock of progress on these issues at its June meeting with a view to taking a final decision by October 2014.  The Council also tackled the issue of EU energy security, which has an added urgency in view of the Ukraine crisis. The Commission has been asked by June 2014 to prepare a detailed analysis of this as well as a comprehensive plan to reduce the EU's energy dependence. I will report to the House on the European Council tomorrow and I look forward to addressing the situation in Ukraine, as well as some other agenda items, in more detail.  I will return for a moment to the December European Council, the subject of a question here, which had a lengthy agenda. It covered Common Security and Defence Policy, CSDP, economic and social policy, economic and monetary union, migration, enlargement and energy. For the first time since the entry into force of the Lisbon treaty, the European Council held a thematic debate on defence. Extensive conclusions were reached, identifying priority actions for stronger co-operation. I reported in detail to the House on January 21 on the outcome of this debate, as well as the broader discussions among leaders. I do not propose to repeat this in detail here. The December European Council reviewed the economic situation and progress on banking union, as well as in implementing the compact for growth, jobs and competitiveness.  The meeting identified the main features of the partnerships for growth, jobs and competitiveness to support structural reform, with a view to concluding discussions by October next year.  The Council also addressed some of the main foreign policy issues, including the situation in Syria and the Central African Republic, as well as the Eastern Partnership, the situation in Ukraine and the WTO. The allegations of US National Security Agency surveillance were also discussed.  There was no discussion at the December European Council of Typhoon Haiyan which had struck the Philippines in November 2013. However, the European Commission and EU member states have allocated more than €178 million in humanitarian and early recovery assistance to the survivors of Typhoon Haiyan. Ireland was one of the first countries to respond to the natural disaster. Following an initial allocation of €4 million, the Government last week, through the Minister of State at the Department of Foreign Affairs and Trade, Deputy Joe Costello, announced a further contribution of €3 million. The additional funding will support local efforts to build shelters and re-establish people's livelihoods, particularly in fishing and agriculture, and protection activities for those traumatised by the disaster.  While at the European Council meeting in December, I also had informal contacts with a number of colleagues. The House will be aware that I participated in a remembrance event in Messines on the morning of 19 December with Prime Minister Cameron. Again, I have reported separately to the House on this event.  Many of my colleagues on the European Council and from the Commission were in Dublin from 5 to 7 March for the European People's Party meeting. I had informal contacts with them at this event, as well as at the 6 March meeting on the situation in Ukraine and at last week's European Council. I was due to hold a working breakfast with President Barroso on the morning of 6 March, but it had to be postponed owing to the meeting on the situation in Ukraine and it was not possible to find an alternative time.  I had a meeting with Prime Minister Rajoy of Spain on the evening of 6 March which, again owing to the meeting on the situation in Ukraine, was postponed from earlier in the day. We discussed the economic situation in Europe, especially the challenge of youth unemployment, as well as SME financing, banking union, the Single Market, trade and energy. The Basque country was not discussed at the meeting and, as the Government has stated on many occasions, we continue to follow the situation closely, including the recent statement by the international verification body. We have repeatedly said we support any development that can lead to definitive peace in the Basque country and welcomed the declaration by ETA in that context. We continue to hope for further progress.  As Deputies will be aware, I also held bilateral consultations with German Chancellor Merkel in Government Buildings on 7 March. Over a working lunch, I updated the Chancellor on the economy and we took stock of progress on banking union and the issue of legacy bank debt. We also discussed preparations for the March European Council and the wider jobs and growth agenda, including the transatlantic trade and investment partnership. \n An Ceann Comhairle  I ask for Deputies' co-operation because a number of issues have been raised in this group of questions. I suggest the first supplementary questions relate to the December Council meeting. If we get that issue out of the way, we can come back to it again. Is that agreeable to Deputies? \n Deputy Gerry Adams  I was going to limit myself in this round to two supplementary questions. If I get a chance, I will come back in and ask another one. \n An Ceann Comhairle  Members would prefer to take everything together. \n Deputy Micheál Martin  Yes. \n An Ceann Comhairle  All right, if that is the way it is to be. \n Deputy Richard Boyd Barrett  What numbers have been grouped? \n An Ceann Comhairle  Nothing has been grouped. The Taoiseach has answered Questions Nos. 1 to 35, inclusive, which are all related to European issues. The first few were about the December Council meeting. I am open to the House deciding on the matter. \n Deputy Gerry Adams  I would like to ask supplementary questions on the situations in Ukraine and Crimea and in the Basque country. In regard to the situation in Ukraine, the Taoiseach has outlined the sanctions imposed, how these matters were discussed and how he is going to continue to work with his colleagues. The sanctions will have a very limited impact on the Russian state because of the extent to which the European Union is dependent on gas and oil supplies from Russia, as I think the Taoiseach acknowledged in his response, and that has its own economic dynamic. The Taoiseach will recall that the Russian ambassador pointed this out when he warned about the economic consequences for the State if it supported further EU sanctions against Russia. Perhaps the Taoiseach might give us his view of what the Russian ambassador said.  It is also very clear that the future of Ukraine is a matter for its people there, yet there is significant support in Crimea for unity with Russia. This concerns the issue of the application of the principle of self-determination which in the particular region has had some difficulties historically. Does the Taoiseach accept that the principle of self-determination and democratic choice must be at the heart of any solution - we cannot impose solutions, settlements or arrangements - and that dialogue is key in that regard?  That brings me to the recent development in the the Basque country. It is very disappointing and beyond me why the Taoiseach did not refer to it, given the success of the peace process here, even though there is still work to be done, as he has acknowledged. Ireland is in a position to speak with some authority on the business of making peace and not raising the issue with the Spanish Prime Minister was a missed opportunity. Again, dialogue is required. The Spanish state has not been as supportive of peace efforts as it should be. In February an international verification committee confirmed that ETA had taken the first steps towards complete disarmament, but members of the committee were then arrested and brought before a court to be integrated about what had occurred. That is because the law which is draconian and a product of the conflict in the country - it is a bad and an emergency law - was brought into focus. As we know from our own situation, that is no way to make democratic advances. There are the issues of prisoners, prisoners' families, the dispersal of prisoners in prisons across a very wide area and the imprisonment of Arnaldo Otegi, one of the leaders of the peace process in the Spanish state and the Basque country. What I am arguing for is for the Taoiseach to use his good offices, our international reputation and the experience we have gained to persuade, encourage and request the Spanish state and the Spanish Prime Minister to embrace the process in a positive way. I welcome the Taoiseach's welcome for the announcement that ETA has begun a process of disarmament, but I ask him again to use his influence to encourage everyone involved to respond in a positive way. \n The Taoiseach  In respect of the situation in the Basque country, because of the situation in Ukraine, we did not have an opportunity to have the extensive bilateral meeting we would have wished to have had. The Spanish Government has stated it is committed to the unilateral and unconditional dissolution of ETA and that there is nothing to talk to the group about. The President of the Basque country has noted that ETA has begun to disarm in an unconditional and unilateral manner and that while this is an important step, it is not sufficient. The Deputy can take it that, through the Irish Embassy in Madrid which monitors all of these developments, we will keep in close contact with the Spanish Government and other connections and avail of any opportunity that presents itself to outline our experience in building, in a very difficult period, a fragile but lasting peace, which is of importance to everybody.  On the situation in Crimea and Ukraine, Ambassador Peshkov was called in again last week to the Department of Foreign Affairs and Trade and told clearly that the Government and the Irish people did not recognise the illegal referendum held in Crimea, as a result of which Russia had annexed that part of Ukraine.  At the discussions that took place in Brussels, a three-phase approach was agreed. We discussed how the freezing of assets and the imposition of visa restrictions would impact on the individuals involved. Clearly, the United States was making arrangements to do something similar in parallel.  This will change the nature of the discussion in this country about Europe and about energy in particular. The European Union cannot continue in its dependence on Russia. The decision of the European Council meeting last Friday, in respect of climate change and energy, was to press ahead with the development of the southern corridor and with further interconnectors in the Mediterranean region in respect of gas, as well as an expansion of the possibility for gas from Spain and Portugal to be supplied to other parts of Europe, namely around the Pyrenees and onto the French system.  We have heard other leaders speak about their dependence on Russia for energy. The Ukrainian Prime Minister, Mr. Yatsenuyk, made the point that Gazprom was about to increase the cost of gas per cubic metre from €200 to over €400 and that other countries were paying that for their freedom. That is why the political elements of the agreement with Ukraine were signed by all members of the Union on Friday morning in Brussels, reducing the impact of tariffs and restrictions on goods being exported to the EU from Ukraine. Some countries in the region which are members of NATO are completely dependent on Russia for equipment and spare parts. As the Danish Prime Minister remarked to me, it is a case of living with Russia. During the Danish-led effort in Syria to remove chemical weapons, for example, the first point of contact for the Danes was with a Russian frigate. It is a case of not closing off the options and of asserting the fact that we have no difficulty with the Russian people. The point is that the political leadership in Moscow has made a unilateral move in acquiring that part of Ukraine known as Crimea. As Deputies will know from history, this country lost 30,000 fighting men in the Crimean War in the 1850s.  There was a seriousness about the meeting and general agreement that this has gone too far. People were very anxious to take steps that would impact on Russia in a way that had never been done before. The European Commission was asked by the European Council to prepare a report on further and broader economic sanctions that might be applied which would be really hurtful. However, it must be said that economic sanctions cut both ways and can have an impact on this country too. There are 200 companies in Ireland which supply goods and materials to Russia and these are important considerations.  Countries that were formerly part of the Soviet Bloc and which border Russia are fearful of invasion and are acutely aware of their dependence on Russia for their energy needs. The nature of the debate on energy independence and energy dependence will change as a result of what has happened. We can only hope that the Government of Ukraine will hold the promised free and fair elections in May. Ukraine needs cash, however, and it needs it now - a sum of €2.5 billion is required to pay for gas as well as to meet wage bills and so forth. At the meeting in Brussels the EU High Representative, Ms Ashton, presented a list of the requirements of the Ukraine army, which included shoes and jackets and all of the other basics that a standing army would need, giving an indication of how ill-equipped the army is to defend the country. It was a serious meeting with serious people putting a strategy in place. It was agreed that if there is any more escalation of the situation, broader economic sanctions will apply and will be implemented. \n Deputy Micheál Martin  We are dealing with questions Nos. 1 to 35, which address a broad range of issues.  After last December's meeting of the Council of Europe the Taoiseach said again that all of the agreements meant that the toxic link between sovereign and banking debt had been broken. What he has yet to do, however, is to explain how this is actually the case. It is a year and a half since the Taoiseach and the Tánaiste declared victory on this point and spoke about a seismic shift and so forth. I have asked the basic question on a number of occasions, namely, \"what exactly is Ireland looking for?\". \n The Taoiseach  Pardon? \n Deputy Micheál Martin  What exactly is Ireland looking for in terms of the debt situation and the breaking of the link between sovereign and financial sector debt?  Yesterday my party revealed letters from Mario Draghi to our finance spokesperson, Deputy Michael McGrath. Essentially, Mr. Draghi said that he does not agree with the Government's claim that everything is progressing fine with Ireland's banks. If one reads his letter, in response to Deputy McGrath, one sees that he is distancing himself significantly from the Central Bank's assessment of the capital adequacy of our banks. This followed a letter we wrote to him in the aftermath of his comments to the effect that the impaired loans in our banks needed swift and direct action. He implies in his correspondence that further capitalisation may be required. Can the Taoiseach explain how that sits with the Minister for Finance's claims, as well as his own claims, that Ireland will be reimbursed retrospectively for past recapitalisation. Furthermore, the banking union will provide enough money to cover less than 1% of the capital base of the covered banks. Does the Taoiseach believe that is adequate? Is he happy with that? Does he believe it is an adequate amount? I think it is ridiculously low and cannot, in any shape or form, be considered adequate in terms of a resolution mechanism into the future.  On the issue of Ukraine, I welcome the decision to go to stage three sanctions. Russia's behaviour effectively partitions a former colony and that cannot be let stand with what I consider to be very weak measures, diplomatically. I get the sense that the United States is leading the charge and that the European Union is divided between those who want tougher sanctions and those who want to delay the imposition of same for various economic reasons. The Taoiseach's comments about trade some moments ago suggest that the Russian ambassador's public warnings to the Government last week are hitting home already. What position did we take at the European Council meeting? Did we support those who were looking for stronger sanctions, those who advocated holding on and waiting or did we just wait for a final agreement to emerge and jump on that particular line? We did not take any public stand on it, to the best of my knowledge.  The Taoiseach referred to the issue of surveillance in his reply. At the time of December's European Council meeting, the bugging of European governments was a very big issue. Much of that surveillance was carried out by the British facility in GCHQ. Other countries have been far more direct than us in asking about bugging of conversations and in demanding transparency from the United States and others. Have we done the same and specifically, has the Taoiseach asked the British Prime Minister whether the British Government bugged Irish communications during sensitive negotiations on Northern Ireland? Did the Taoiseach have that discussion with David Cameron? \n The Taoiseach  On Ukraine and the divisions at the European Council regarding sanctions, a range of views were expressed. Some were very forthright in saying that we should move to level three sanctions quickly, while others disputed that, particularly those countries which are close to and dependent on Russia.  Ireland supports the decision of the European Council in respect of the sanctions against Russian individuals and participated in the discussion about what areas might be included in a broader economic plain, be they economic or financial. There is a recognition, however, that no matter what sanctions one imposes, they work both ways in that they will impact on all countries involved. It would be far better to have a situation where Russian understands what it has done.  Another point made was that the winners should be the people of Ukraine in acting as a buffer between the East and the West. Over €11 billion in funds is on the table from the European Union and the Commission. The point made by several speakers at the Council meeting was that the conditions that applied to many of the IMF programmes for Ukraine could be very difficult. Obviously, one needs unity on this position to secure the overall unity of Ukraine. It is not true to claim Ireland did not take a position on this matter. We have been very clear about it - we support the sanctions. \n Deputy Micheál Martin  Does the Government believe the sanctions should be stronger? \n The Taoiseach  If they move to the next level, we will participate. Decisions were made the last day on extra individuals to be restricted, visa liberalisation and a paper being prepared on broader options if there was going to be a further escalation. Ireland is only a small country, but it has a trade figure of €1 billion with Russia where 200 Irish companies provide goods and services. Obviously, there are other markets that we have to go after.  Deputy Micheál Martin referred to GCHQ. When one is dealing with terrorists or subversives, there is, clearly, an understanding one has to have information available on what is necessary to prevent atrocities from taking place. The level of co-operation between the Garda and the PSNI is exceptionally high. The Deputy will appreciate that on several occasions in the past 18 months bombs and other potential threats have been thwarted. \n Deputy Micheál Martin  I was referring to the bugging of European governments. \n The Taoiseach  As far as I am aware, the United States stated it did not have any listening post in Dublin. I did not detect evidence of, as the Deputy called it, GCHQ bugging Government Buildings. \n Deputy Micheál Martin  Did the Taoiseach ask the British Government if it had bugged us? \n The Taoiseach  I cannot recall if I asked that specific question. However, I did raise the issue of surveillance, bugging and the protection of private data.  The Deputy also referred to breaking the link between sovereign and bank debt and what Ireland was looking for in that regard. He is aware that Ireland was first over the edge, with no tools or mechanisms to deal with it. We had to borrow €64 billion, half of it gone with the promissory note agreement, with the support of the European Central Bank. European banking union, with a single supervisory mechanism, SSM, and a single resolution mechanism, SRM, are all part of the process leading to the point where the Council decision of 29 June 2012 to break the link and the possibility of recapitalisation directly of banks can be followed through. Up to €80 billion has been left aside out of the ESM, European Stability Mechanism, to deal with the concept of direct recapitalisation. We cannot make any case on this until all of these facilities are in place, which should apply from November this year. The European Presidency and the Parliament came to an agreement on the single resolution mechanism, its regulation and the IGA, intergovernmental agreement, on 20 March. The text of the SRM was further refined in a trilogue on Friday, 21 March. The SRM regulation will be submitted to COREP, Common Reporting, on 26 March. It is expected that the IGA will be finalised through the intergovernmental conference as quickly as possible. Most people did not expect this to happen because they had doubts about how effective the Greek EU Presidency would be. Greece was commended for its diligence in getting it across the line.  Mutualisation will occur over eight years, with contributions also taking place over eight years, with 40% in year one, 20% in year two and the remainder in equal instalments over the remaining years. It is understood contributions will follow a linear trajectory from year one, 12.5% each year, until the target is reached at the end of eight years. it was originally meant to be over ten years.  The European Central Bank will be the supervisor within the SRM. The supervisory board should be able to assess whether a credit institution is failing or is likely to fail. Therefore, in its executive session it may determine whether resolution is required, but only after having previously informed the ECB about its intention and only if the ECB, in three calendar days after receiving such information, does not make such a decision.  There is also the role between the Council and the Commission in what is determined by the Meroni doctrine. The Council maintains a role, but it is limited to the existence of a public interest and the use of the fund. The Council can only approve or object to a Commission proposal without actually amending it. The role of the plenary session in the board has been limited, depending on a certain threshold being reached. The plenary session may only adopt a resolution scheme if in the support of the fund in that specific resolution action is required above the threshold of €5 billion for which the weighting of liquidity support is 0.5%. It can also evaluate the application of the resolution tools. The legal basis for this is Article 114 of the Treaty on the Functioning of the European Union.  Ireland is looking for the structure to be in place where we can make a case, based on the decision of 29 June, for recapitalisation of the banking system. This is still very much on the table. I was glad to see these other sections being put in place which will allow the complete structure for banking union to be followed through. It is expected that the Parliament will approve it in the next few weeks.  Banks in the member states will contribute to the SRM fund. This reflects the fact that in the integrated financial markets any financial support to resolve a bank issue benefits financial stability and the health of other banks in all member states. These contributions will be calculated in a way that reflects different types of bank and their business models. Contributions will be raised annually and will be pro rata through the amount of liabilities, excluding own funds and covered deposits of all the institutions authorised in participating member states. Contributions will also be risked-based, reflecting different risks inherent in different types of banking activity. Progress was actually made and we do expect it to be finalised, with the structures being in place by mid-summer. We can then deal with the negotiations on the decision of 29 June. \n Deputy Micheál Martin  I have a brief supplementary. \n Deputy Richard Boyd Barrett  It is actually our turn. \n An Ceann Comhairle  Give Deputy Micheál Martin one minute. Deputy Richard Boyd Barrett will get in; do not panic. \n Deputy Micheál Martin  The so-called banking union will only provide enough money to cover less than 1% of the capital base of the banks. Is that adequate? \n The Taoiseach  Obviously, it was an agreed figure. We will be happy if the banks stand up to the stress tests which will take place later this year. We hope the fund in place will be adequate. However, these are matters that will need to be reflected upon as time passes. What is important is to get agreement on a structural fund and to make it work.  The European Central Bank will be responsible for the SSM and will begin to supervise all of the major banks in the eurozone and those member states which choose to join the mechanism.  The ECB, as the common supervisor will take over the responsibility for the banks from national central banks from late 2014. Those national central banks will continue to play an important role, but the ECB will have the ultimate responsibility for the system. This provides for a differentiated approach to supervision, depending on the size and significance of the banks. It provides for equal treatment for the euro area and the non-euro area and member states so as to allow banking union to be attractive to all member states, thereby protecting the Single Market.  While there will be varied views about the adequacy of the fund ----- \n Deputy Micheál Martin  Nobody thinks it is adequate. \n The Taoiseach  The first thing is to get the structure in place and make it work. Then, these issues can be reflected on as time goes on. \n Deputy Richard Boyd Barrett  In his discussions on the economic situation in Europe at the European Council, did the Taoiseach raise the issue of the property sector, housing and homelessness? The reason I ask this is that if we were to sum up in a few words the cause of the European and global economic crisis, it could probably be summed up as \"property speculation in the area of housing\". In the Taoiseach's consideration or in that of his colleagues in Europe, is there any awareness of issues about which I have been trying to ring an alarm bell for a year and a half, that with real estate investment trusts, rising rents, growing homelessness and so on, we are starting to do it all again. We are starting to repeat the mistakes we made in the area of property and housing that led to the bubble and the crash that beggared the people of this country and brought the European economy close to the brink.  I find it extraordinary that in the reports and discussions on the situation we talk about banking union, stress tests for the banks and the viability of the banking system etc. It is all about the banks. We all know the banks want property values to rise. It is in their interests that rents rise, because this increases the value of property and their balance sheets look good. The human consequence of inflating the property market again to benefit the banks is that people are being made homeless. This is not just an Irish problem, but the problem is particularly acute here because property was so central to what crashed our economy. This is happening in Greece, Spain and is starting to happen elsewhere.  As cynical as I am about the neoliberal dogma that dominates European political and economic thought, even I cannot believe that only six or seven years after the crash caused by this issue, it is being stoked up again. I must point out that the Taoiseach's comments, while in New York, encouraging American investors in the idea of making a killing on the Dublin property market were alarming and dangerous, because he was talking yet again about a crisis ----- \n An Ceann Comhairle  I remind the Deputy this is Question Time. \n Deputy Richard Boyd Barrett  -----as an opportunity for investors to make money. However, this is a human crisis that lies at the heart of our economic problems. In his discussion with our European counterparts, is there any awareness on the Taoiseach's part that treating property as a matter for speculation, particularly the area of housing, is dangerous? Is he aware there are dangerous signs a property bubble could be beginning to emerge again in this State, fuelled by the policy of wanting to restore the banks' balance sheets and by the narrow concept of what banking is about? Even in America, the Federal Reserve Bank has a wider mandate than the ECB to ensure that areas such as employment and keeping a roof over people's heads are considerations for banking policy. US banking policy is not a model one would want to follow, but even the US has some awareness that there must be a wider mandate.  On Ukraine, I agree the Russian invasion is unacceptable. The Russian empire has long been the prison house of small nations, particularly in the areas between Russia and Europe. I agree that carrying out referendums under the barrels of tanks and guns is not a legitimate manifestation of self-determination and should be condemned. However, I find it worrying in the extreme that the Taoiseach seems to be the most gung-ho on the European side in portraying this conflict as the bad guy Russians and the good guy Ukrainian Government with Europe backing it. The other of this equation is equally nasty. There is no doubt the former Ukrainian regime was rotten, corrupt, repressive, dictatorial and backed by a nasty regime in Russia under President Putin was pretty vicious to its population. However, we have also had sight of supporters of one of the elements of the Ukrainian Government as out and out fascists - attacking TV presenters in Ukraine. \n An Ceann Comhairle  Will the Deputy please put his question? \n Deputy Richard Boyd Barrett  We seem to be lining up with dangerous people who have a history of corruption and dangerous far right wing political ideas and saying these are the good guys. We should not be doing this. We should be responsible and recognise this is a complex situation where big powers are manoeuvring for self interest and stirring up ethnic and national divisions which could be very dangerous and are reminiscent of what happened at the beginning of the 20th century leading to the First World War. I believe the Taoiseach is being irresponsible in presenting this as a simple black and white, good guy bad guy and is doing so in a way that could be quite dangerous. \n The Taoiseach  Maybe the Deputy should apply to participate in the OSCE monitoring group. Some 500 civilians with expertise are required to monitor violence, human rights issues and aggression against Ukrainian people, whether minorities of different countries or not. There are Romanians, Poles, ethnic Russians and Ukrainians, a complete mix of people, in that country and the Deputy's stirring words might fit in very well. I am quite sure High Representative Ashton may be willing to consider an expert like the Deputy for this.  I agree that the attack on the television station and the television broadcaster was completely unacceptable. It was unacceptable to the government in the Ukraine also. Some people in this democracy certainly stray across the line at times. The Deputy may know some of them, but I do not know whether he does as I believe he is a pacifist at heart, despite his tendency to take part in marches. Ireland is not gung-ho ----- \n Deputy Richard Boyd Barrett  Please do not equate marching with what those thugs were doing. \n The Taoiseach  I make the point that Prime Minister Yatsenyuk came to the European Council meeting twice in Brussels and made the point that when Mr. Yanukovych left Kiev, having privatised the presidential household, it was not burned or looted by the people of Ukraine, that there is no evidence of people being beaten up, raped, robbed or tortured across the country. The Ukrainian population was very civilised, despite the difficulties they faced.  It is not right for the Deputy to come in here and say that Ireland is the most gung-ho of all the European countries and that it sees this as a black and white issue. What we contributed to was a debate, where we were prepared as a member of the European Union to sign the political elements of the agreement with Ukraine so that the people operating in Ukraine could export at lower tariffs to the European Union and thereby create some semblance of economic activity and give some hope to the people.  The Deputy mentioned the United States and Europe in terms of banking and all the rest. \n Deputy Richard Boyd Barrett  I mentioned housing. \n The Taoiseach  Things have changed. We are no longer giving out 100% mortgages. We are acutely aware of the pressure in the housing area, particularly in the greater Dublin area and some of the cities and larger towns around the country.  It has not spread with the same momentum. That is why the Government has worked in recent weeks to put together a realistic, practical response to the construction sector, which is not contributing to job creation and the general economy to the extent it should. Deputy Boyd Barrett is aware that it used to contribute 25% of GDP when it was building 100,00 houses while only 30,000 were needed. It is now down at 6% or 7% and it is building 6,000 or 7,000 houses when we need 25,000 or 30,000. We need to get from where we are to where we want to be without creating a further bubble. As Deputy Boyd Barrett pointed out, it is a seller's market in certain areas of Dublin because demand exists there. I notice the property pages of some of the newspapers are expanding again with the houses that are available. \n Deputy Richard Boyd Barrett  What is the Taoiseach going to do about it? He should build some council houses. \n The Taoiseach  It is very important that there be a functioning banking system. That is why we have great regard for what the credit unions and smaller operators do. That is why there has been an increase in big firms applying for commercial banking licences so that firms that use their equipment can have access to credit. That is why the budget changed the regulations for thresholds for access to credit and VAT thresholds for small firms. That is why the motor industry is facilitating finance for vehicles which is coming from places other than mainline banking. That is why the Minister for Finance, Deputy Noonan has said he is open to suggestions for a third banking force in the country so there can be competition for the provision of credit.  We are acutely aware of the housing provision problem and the Government will respond to that in the next couple of weeks with a comprehensive response for the construction sector. Deputy Boyd Barrett knows how important it is; so do we. I know the pressures on people, many of whom have families and are living in apartments that are too small and want to get a detached house. They need space and the supply of houses is not there. \n Deputy Richard Boyd Barrett  Do you think tax breaks for speculators----- \n An Ceann Comhairle  Would you please speak through the Chair, Deputy? Thank you. There are rules in this House and they apply to you equally as they do to everybody else. \n Deputy Richard Boyd Barrett  I have a supplementary question. \n An Ceann Comhairle  I call Deputy Higgins. \n Deputy Richard Boyd Barrett  So I do not get the same----- \n An Ceann Comhairle  No, you do not, actually. You had two questions. Deputy Martin had ten or 15 questions. \n Deputy Richard Boyd Barrett  I will put in ten questions next time. \n Deputy Joe Higgins  Tens of thousands of mainly working-class youths on this island were slaughtered in Europe as a result of the rivalry between major imperial powers jockeying for influence, territory and markets when that rivalry exploded into the First World War. Has the Taoiseach learned nothing from the history of our own people and of small nations in Europe? The Taoiseach fully supports the policy of the EU towards Ukraine. Is it not obvious to the Taoiseach that the EU was avariciously pushing its own selfish economic and political agenda in Ukraine to trump the equally avaricious Russian elite represented by President Vladimir Putin and company? Of course the ordinary Ukrainian people detested the rotten Yanukovych dictatorship but is that justification for the EU to collaborate to the hilt with right-wing, semi-fascist, repulsive, xenophobic and wholly anti-progressive political forces such as Svoboda and Right Sector? The EU is conspiring with these forces to be the cat's paw of European union to advance its economic agenda within Ukraine. Does the Taoiseach support that?  Russia should be condemned for its interference in Ukraine, but does the Taoiseach not recognise the hypocrisy of his Government and the EU in pushing for sanctions when they uttered not a word against the far more bloody intervention of the EU's allies, such as the United States and Great Britain, in Iraq for example? What sanctions did any Irish Government ever support against the United States or Britain, Mr. Blair and President Bush, for the bloody, criminal invasion of Iraq that has left hundreds of thousands of people dead? Is the Taoiseach satisfied the new Government in Ukraine, which he and the EU hail as a great and new democracy, has installed billionaire oligarchs as regional governors throughout Ukraine? How does it serve the interests of the ordinary Ukrainians, working-class, peasants and poor, to install oligarchs who robbed blind the resources of the country taking advantage of the collapse of the revolting Stalinist regime?  For the poor people of Ukraine, now in the tender embraces of the troika or its equivalent, what kind of future exists in terms of lifting them out of the poverty and hardship that exist for so many when an even worse neo-liberal economic regime is to be installed? Will the Taoiseach not recognise that the people of Ukraine have the right to be left alone from interfering imperial powers, whether Russia or the EU, to decide their own future without this type of meddling, behind-the-scenes string pulling, economic pressure and blackmail from both Russia and the EU? Would the Taoiseach not state those as principles in opposition to the hypocritical policy that is being followed? \n The Taoiseach  Deputy Higgins should bear in mind that the people of Ukraine wanted to join with Western countries for the development of their economy. Mr. Yanukovych decided he should do deals with Russia over their heads and the people rebelled. Mr. Yanukovych left and his party in government changed its view. Therefore this is not meddling by the EU but the invitation of the Ukrainian people and the Government in Kiev to sign political agreements with the EU instead of with Russia. It is not a case of invasion or pressure by the EU to force them to look West. I agree with Deputy Higgins that the winners here should be the people of Ukraine. The question is whether they will be given the right to determine that in their forthcoming elections.  In Ossetia, Transnistria, Moldova and Chechnya, Russia has given passports to ethnic Russians and sent people in to take over at the equivalent of council offices and block the streets of the towns, provoking incidents and creating a need for protection. That is why protectorates have grown up, with President Putin's stated ambition of restoring the Union of Soviet Socialist Republics, USSR, to its former glory. That is why the people of Ukraine said they wanted to open their doors and borders to the EU. I disagree with Deputy Higgins's argument that Europe was forcing the pace. Europe was requested, invited and encouraged, and in response it encouraged the people in Ukraine to do business with the West. The oligarchs Deputy Higgins mentioned are very favourable in the eastern Ukraine region towards the Kiev Government and have an interest in seeing their people are able to do business with the EU. We do not want any more situations of subsidised gas, which created billions of euro for particular people over the past number of years.  Deputy Higgins argued that Europe has meddled in the affairs of Ukraine, but a number of years ago the per capita income of Ukraine and Poland was the same, while now the per capita income of Poland is many multiples of that of Ukraine.  That is why the people of Ukraine aspire to getting out of the position in which they find themselves - so they can have greater prosperity, development of the economy and the right to live and have jobs.  Everybody has a right to be left alone, but that is not what happened in Crimea. I am well aware of the events of the First World War, what happened in Sarajevo and the slaughter of so many mainly young men in the so-called war to end all wars. If Lord Raglan, Lord Lucan and General Nolan had got their directions correct, we might not have lost the Light Brigade at the Battle of Balaclava in Crimea, over 130 of whom were Irish horsemen. The Deputy knows those names from history.  I do not accept that this is a case of Europe wanting to barge into Ukraine and argue that the country must join the Union. This was the wish of the people in Ukraine and it was not respected by the then President Yanukovych, so the popular revolution left him to flee to eastern Ukraine, with the government in Kiev focusing on the West. Russia clearly does not like this and it made its move into Crimea. As a response, the European Union and other countries are imposing various types of sanction. These are to counteract illegal action that is to the detriment of freedom of democracy. It is a response to the invasion of the territorial integrity of Ukraine. This territory was handed over by Khrushchev in the 1950s and has now been annexed again by Russia. This matter will continue to be a source of much difficulty in the time ahead. \n An Ceann Comhairle  I call Deputy Adams. \n Deputy Joe Higgins  I have a brief supplementary question. \n An Ceann Comhairle  Deputy Adams has 19 questions and I am obliged to allow him in again. \n Deputy Gerry Adams  I bring the Taoiseach's attention to Question No. 7, which asks if the Taoiseach discussed with the British Prime Minister legacy matters and how they can be addressed. The talks with Dr. Richard Haass and Professor Meghan O'Sullivan concluded and although I very much welcomed the positive comments by the Tánaiste in January on these proposals, that was months ago, and there has been no progress whatever since. The Taoiseach may have heard at the weekend that the former Church of Ireland Primate, Robin Eames, warned politicians in the North and both governments that unless the issues of the past and the problem of parades and flags are dealt with, they will never be resolved. None of us wants to see that. It is my strong contention that the two governments must take a hands-on role in this matter, with the Irish Government acting as an equal partner with the British, or there will be a real danger that the potential and opportunity created by the Haass and O'Sullivan talks will be lost.  Is the Taoiseach conscious that there has been no progress whatever on these issues and that they need to be dealt with? We cannot wait until after the next local government elections or anything else. The governments must be very focused on the matter. \n The Taoiseach  I share the Deputy's view. I went to the consular offices in New York to speak with Dr. Haass last week and I had a good conversation with him regarding his reflections on the talks and the efforts made by him and Professor O'Sullivan to make progress. Dr. Haass is coming to Tipperary for the peace prize later. \n Deputy Gerry Adams  Yes. \n The Taoiseach  He intends perhaps to make a comment on his analysis of what has happened. I note former President Clinton's comments in Derry that we should finish the job. He clearly put the point that this is the responsibility of the leaders of the parties in Northern Ireland, of which there are five. \n Deputy Gerry Adams  I met Dr. Haass and former President Clinton, but I am asking about the Government's role. \n The Taoiseach  The invitation to Dr. Haass came from the First Minister and Deputy First Minister. The Deputy's party endorsed and accepted all the findings of the Haass talks and wants them implemented, but others did not. It is now a case of leadership and focusing on where progress can be made and the differences arising. The Government has indicated it will actively support the parties in Northern Ireland in making progress, and the Tánaiste has been very active in this regard. I and the British Prime Minister at Downing Street have recommitted to this and we intend, in so far as we can, to support the goal visibly. Ultimately, as the Deputy knows, people may want to play some games before elections take place. The issue is far too serious for that. We will support the efforts of parties, including the Deputy's, to make further progress arising out of some of the platforms that the Haass talks brought about. There was some progress and he was reasonably satisfied that new platforms were built for some elements. It is not satisfactory that the process has not yet ended.  The Deputy is acutely aware that young people in Northern Ireland do not want to see a solid lump of older politics stuck in the rut of the past that does not allow people to focus on a new and exciting future. There are some very good things happening in Northern Ireland and, despite their differences, the First Minister and Deputy First Minister have been around the planet seeking investment for jobs and so on in Northern Ireland. There are some very good opportunities arising in that regard, and we support that, along with cross-Border education, health, infrastructure, etc. We will continue to be supportive. The politicians and leaders of the day will say what further progress can be made and whether we want to continue being locked in the prison of the past, which will stunt the opportunities for young people in Northern Ireland to give vent to their flair and imagination. We will work in whatever way we can with all the parties to help them make progress. "
      },
      "contextDate": "2014-03-25"
    },
    {
      "question": {
        "date": "2014-03-25",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-03-25/writtens/dbsect_173",
          "showAs": "School Equipment",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-03-25/writtens/mul@/dbsect_173.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_173"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Education",
          "roleType": null
        },
        "showAs": " 284. Deputy Simon Harris asked the Minister for Education and Skills if a funding stream exists within his Department for the provision of gym equipment for a school (details supplied) in County Wicklow; and if he will make a statement on the matter. [12904/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-03-25/pq_284",
        "questionNumber": 284,
        "answerText": " Minister for Education and Skills  The PE Hall at the school referred to by the Deputy was constructed in 2002. Funding in the amount of circa €50,000 was paid to Co Wicklow VEC towards the provision of PE equipment for this PE Hall in 2003/2004. "
      },
      "contextDate": "2014-03-25"
    },
    {
      "question": {
        "date": "2014-03-25",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-03-25/writtens/dbsect_518",
          "showAs": "Water Services Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-03-25/writtens/mul@/dbsect_518.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_518"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Environment",
          "roleType": null
        },
        "showAs": " 684. Deputy Simon Harris asked the Minister for the Environment, Community and Local Government if good advice-education and grant schemes will be provided to help families install water conserving features in their houses; and if he will make a statement on the matter.  [13401/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-03-25/pq_684",
        "questionNumber": 684,
        "answerText": " Minister for the Environment, Community and Local Government  From 1 January 2014 Irish Water assumed responsibility for the delivery of water services capital infrastructure, including water conservation measures. Irish Water is committed to installing 1.05 million domestic meters across Ireland between now and 2016. International experience shows that water meters can reduce consumption by between 10 - 15 %. Understanding how much water you consume is an important step in conservation.  As part of the metering programme, my Department is currently working on proposals regarding customer-side leakage but the detailed arrangements are not yet finalised.  I understand that Irish Water has placed information on water conservation for householders on its website ( www.water.ie ) and is also supporting the An Taisce Green Schools programme, which is providing water conservation education to schools throughout Ireland. My Department has asked Irish Water to put in place specific arrangements to address the queries which public representatives may have in relation to matters pertaining to the operation of water services under the new utility. I understand that Irish Water has made contact with Oireachtas members to outline the arrangements for addressing such queries in a timely manner. "
      },
      "contextDate": "2014-03-25"
    },
    {
      "question": {
        "date": "2014-03-25",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-03-25/writtens/dbsect_519",
          "showAs": "Environmental Regulations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-03-25/writtens/mul@/dbsect_519.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_519"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Environment",
          "roleType": null
        },
        "showAs": " 685. Deputy Simon Harris asked the Minister for the Environment, Community and Local Government if he will provide an update on the introduction of a ban on smoky coal; the parts of the country that are not covered by such a ban; and if he will make a statement on the matter. [13435/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-03-25/pq_685",
        "questionNumber": 685,
        "answerText": " Minister for the Environment, Community and Local Government  The ban on the marketing, sale and distribution of bituminous fuel (or ‘smoky coal ban’ as it is commonly known) was first introduced in Dublin in 1990 in response to severe episodes of winter smog that resulted from the widespread use of smoky coal for residential heating .  Air quality monitoring carried out by the Environmental Protection Agency (EPA) showed that the ban proved very effective in reducing particulate matter and sulphur dioxide levels in Dublin. As well as bringing air quality levels into compliance with the then EU standards, the ban had the effect of significantly improving human health in the capital. Research indicated that the ban in Dublin resulted in over 350 fewer annual deaths. The ban was subsequently extended to other urban areas. On 31 August 2012, following a public consultation process, I gave effect to consolidating solid fuel regulations, S.I. No. 326 of 2012, that introduced a number of improved and updated provisions with the aim of ensuring that the smoky coal ban remains fit for purpose in safeguarding air quality by limiting harmful emissions of air pollutants arising from the use of certain residential solid fuels. The updated provisions included the following -  - the boundaries of most existing smoky coal ban areas were reviewed to take account of urban development in the intervening years since the regulations were originally made;  - a complementary ban on the burning of smoky coal inside ban areas was introduced, to better support the established ban on its marketing, sale and distribution; and  - the ban was extended to sev en new towns with effect from May 2013, including Greystones and Wicklow .  The ban now applies in 27 cities and towns nationwide, including all towns with a population greater than 15,000 people, bringing the ban areas broadly into line with national EPA air quality management zones. Maps of all smoky coal ban areas are available on my Department’s website –    www.environ.ie/en/Environment/Atmosphere/AirQuality/SmokyCoalBan/   Monitoring by the EPA has shown that air quality is poorer in towns where the smoky coal ban does not apply, although there is evidence that smaller smoky coal ban areas tend to be less effective. The further extension of the ban to smaller towns on an individual basis may not be the most effective solution to addressing the problem of emissions from residential solid fuel use in these areas. Similarly, the border with Northern Ireland would present enforcement challenges if a national ban on smoky coal were unilaterally introduced. However, it is recognised that having different regulations between urban and rural locations is not ideal, as it results in different levels of environmental protection and clean air benefits for citizens in different locations.  Under the auspices of the North South nisterial Council, and in conjunction with the Department of the Environment for Northern Ireland, my Department has commissioned a study to inform a discussion on policy options to further address emissions from resid ential solid fuel use on an all- island basis. The study will include-  - an assessment of the solid fuel market and barriers to the use of cleaner fuels;  - consideration of the role and impacts of biomass (primarily wood and wood-based products) and the links to climate policy; and  - an economic analysis addressing the potential positive and negative effects on the consumer, for example, resulting from potential fuel switching, the availability of smokeless fuels to supply an all-island market and job creation opportunities in the manufacture and supply of smokeless fuels.  A final report is due in August 2014. "
      },
      "contextDate": "2014-03-25"
    },
    {
      "question": {
        "date": "2014-03-25",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-03-25/writtens/dbsect_520",
          "showAs": "Environmental Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-03-25/writtens/mul@/dbsect_520.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_520"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Environment",
          "roleType": null
        },
        "showAs": " 686. Deputy Simon Harris asked the Minister for the Environment, Community and Local Government the way the smokeless fuel policy is policed by local authorities; the resources local authorities have to ensure such a scheme is policed; the number of persons that have received fines or warnings in relation to smoky coal from 2012 to date in 2014; and if he will make a statement on the matter. [13440/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-03-25/pq_686",
        "questionNumber": 686,
        "answerText": " Minister for the Environment, Community and Local Government  The regulatory provisions of the ban on the marketing, sale, distribution and use of bituminous fuel in specified ban areas are set out in the Air Pollution Act (Marketing, Sale, Distribution and Burning of Specified Fuels) Regulations 2012. The Regulations are enforced by authorised local authority personnel who may undertake inspections of premises and vehicles being used for the sale and distribution of solid fuel , as well as collect samples. A local authority may bring a prosecution under section 11 of the Air Pollution Act 1987 for breaches of the Regulations. The maximum penalty for breaches of the Regulations is a fine of €5,000 and/or imprisonment for up to six months on summary conviction.  The Regulations also require that each local authority submits annual returns to the Environmental Protection Agency (EPA), detailing activities undertaken relating to the implementation and enforcement of the Regulations in their functional areas. EPA figures show that in 2012, a total of 331 enforcement actions were initiated by local authorities. The returns for 2013 are not yet available. My Department has established a local authority implementation group (LAIG) for solid fuel enforcement. The LAIG serves as a forum to facilitate an exchange of information and intelligence between local authorities, the EPA and other interested parties with the aim of improving the consistency of implementation and enforcement of the Regulations. The LAIG meets 2-3 times per year and is attended by most local authorities, the EPA and my Department.  With regard to resource allocation for enforcement, it is a matter for each local authority to determine its own spending priorities in the context of the annual budgetary process, having regard to both locally identified needs and available resources. "
      },
      "contextDate": "2014-03-25"
    },
    {
      "question": {
        "date": "2014-03-12",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-03-12/writtens/dbsect_161",
          "showAs": "Private Residential Tenancies Board",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-03-12/writtens/mul@/dbsect_161.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_161"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Environment",
          "roleType": null
        },
        "showAs": " 138. Deputy Simon Harris asked the Minister for the Environment, Community and Local Government if he will provide details of the way many properties are registered with the Private Residential Tenancies Board; if he will provide a breakdown of those numbers by county; the way many properties which are currently rented are not registered with the PRTB; and if he will make a statement on the matter. [12415/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-03-12/pq_138",
        "questionNumber": 138,
        "answerText": " Minister of State at the Department of the Environment, Community and Local Government  The Residential Tenancies Act 2004 regulates the tenant-landlord relationship in the private rented residential sector and the Act provides that landlords in the sector must apply to register the tenancy of a dwelling with the Private Residential Tenancies Board (PRTB) within one month of the commencement of the tenancy. Tenancies may be registered by post or on-line and I understand that just over 40% of tenancies are currently registered through the on-line facility.  The PRTB is an independent statutory body and details of the register on a county or, in the case of Dublin, a postcode basis are available on its website www.prtb.ie and in its Annual Reports. The PRTB enforces tenancy registration requirements in accordance with the provisions of the Act, specifically Sections 144 and 145 which provide for the issuing of notices to landlords and/or occupiers of the dwellings in question and the prosecution of offenders for non-compliance with the registration requirement. "
      },
      "contextDate": "2014-03-12"
    },
    {
      "question": {
        "date": "2014-03-11",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-03-11/writtens/dbsect_273",
          "showAs": "Postcode Implementation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-03-11/writtens/mul@/dbsect_273.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_273"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Communications",
          "roleType": null
        },
        "showAs": " 295. Deputy Simon Harris asked the Minister for Communications, Energy and Natural Resources if he will provide an update on the implementation plan for post codes here; if post codes will be required for businesses; and if he will make a statement on the matter. [11570/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-03-11/pq_295",
        "questionNumber": 295,
        "answerText": " Minister for Communications, Energy and Natural Resources  On the 8th October 2013, I announced that the Government had approved, subject to contract, the rollout of a new national postcode system that will provide a unique seven character code to every letter-box in the State in 2015.Capita Business Support Service Ireland Limited will operate the postcode under license for an initial ten-year period extendable at the discretion of the Minister for Communications by a further five years. Under the new system, Ireland will have a postal address database of unique identifiers for all addresses in the State including business addresses.  The design phase of the project is currently being finalised and work has commenced on the public sector database implementation which is due to be completed later this year. Later in the year, an information campaign to be launched by the Postcode operator aimed at SMEs and other businesses will help organisations to prepare for the launch date. "
      },
      "contextDate": "2014-03-11"
    },
    {
      "question": {
        "date": "2014-03-11",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-03-11/writtens/dbsect_499",
          "showAs": "Health Services Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-03-11/writtens/mul@/dbsect_499.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_499"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Health",
          "roleType": null
        },
        "showAs": " 539. Deputy Simon Harris asked the Minister for Health the amount of funding that has been allocated to a service provider (details supplied) in County Wicklow for school leavers in 2014; and if he will make a statement on the matter. [11925/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-03-11/pq_539",
        "questionNumber": 539,
        "answerText": " Minister of State at the Department of Health  As the Deputy's question relates to service matters, I have arranged for the question to be referred to the Health Service Executive for direct reply to the Deputy. "
      },
      "contextDate": "2014-03-11"
    },
    {
      "question": {
        "date": "2014-03-04",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-03-04/writtens/dbsect_161",
          "showAs": "Rent Supplement Scheme Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-03-04/writtens/mul@/dbsect_161.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_161"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Social",
          "roleType": null
        },
        "showAs": " 162. Deputy Simon Harris asked the Minister for Social Protection if consideration will be given to increasing the rent allowance in an area (details supplied) in County Wicklow; and if she will make a statement on the matter. [10377/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-03-04/pq_162",
        "questionNumber": 162,
        "answerText": " Minister for Social Protection  The purpose of the rent supplement scheme is to provide short-term income support to assist with reasonable accommodation costs of eligible people living in private rented accommodation who are unable to provide for their accommodation costs from their own resources and who do not have accommodation available to them from another source. There are currently approximately 78,000 rent supplement recipients for which the Government has provided over €344 million for 2014.  Following an extensive review of the private rental market revised maximum rent limits were introduced from Monday 17 June 2013 until 31 December 2014. The purpose of the review is to ensure availability of accommodation for rent supplement tenancies and not to provide access to all housing in all areas while ensuring that maximum value for money is achieved.  Despite the overall pressures on the Social Protection budget, there have been increases in the rent limits in Dublin, Galway, North Kildare and Bray areas. Analysis also shows that there are properties available in County Wicklow within the maximum rent limits with approximately 2,350 rent supplement tenancies in place. A search of a leading property website shows that there are no available properties to rent in the Kilcoole area. Department officials dealing with rent supplement tenants continue to make every effort to ensure that their accommodation needs are met. "
      },
      "contextDate": "2014-03-04"
    },
    {
      "question": {
        "date": "2014-03-04",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-03-04/writtens/dbsect_431",
          "showAs": "Mental Health Services Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-03-04/writtens/mul@/dbsect_431.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_431"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Health",
          "roleType": null
        },
        "showAs": " 479. Deputy Simon Harris asked the Minister for Health the number of young persons being sent to the UK for mental health treatments which are not currently provided here; if he will provide a breakdown by year from 2010 to date in 2014; and if he will make a statement on the matter.  [10858/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-03-04/pq_479",
        "questionNumber": 479,
        "answerText": " Minister of State at the Department of Health  As this is a service issue this question has been referred to the HSE for direct reply. "
      },
      "contextDate": "2014-03-04"
    },
    {
      "question": {
        "date": "2014-02-27",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-02-27/writtens/dbsect_77",
          "showAs": "Bank Charges",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-02-27/writtens/mul@/dbsect_77.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_77"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Finance",
          "roleType": null
        },
        "showAs": " 55. Deputy Simon Harris asked the Minister for Finance if he will respond to a query (details supplied) regarding variable mortgages and the frustration of some variable mortgage holders; and if he will make a statement on the matter. [9986/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-02-27/pq_55",
        "questionNumber": 55,
        "answerText": " Minister for Finance  Firstly, I must confirm to the Deputy that the lending institutions in Ireland, including those in which the State has a significant shareholding, are independent commercial entities. It is not appropriate for me, as Minister for Finance, to comment on or become involved in the detailed mortgage position of mortgage holders.  In relation to the details provided by the Deputy, the Central Bank of Ireland has responsibility for the regulation and supervision of financial institutions in terms of consumer protection and prudential requirements and for ensuring ongoing compliance with applicable statutory obligations. However, the Central Bank has no statutory role in the setting of interest rates by regulated financial institutions, apart from the interest rate cap imposed on the credit union sector in accordance with the provisions of the Credit Union Act, 1997.  The mortgage interest rates that financial institutions operating in Ireland charge to customers are determined as a result of a commercial decision by the institutions concerned.  This interest rate is determined taking into account a broad range of factors, including European Central Bank base rates, deposit rates, market funding costs, the competitive environment and an institution's overall funding. "
      },
      "contextDate": "2014-02-27"
    },
    {
      "question": {
        "date": "2014-02-27",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-02-27/writtens/dbsect_231",
          "showAs": "Forestry Grants",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-02-27/writtens/mul@/dbsect_231.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_231"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Agriculture",
          "roleType": null
        },
        "showAs": " 220. Deputy Simon Harris asked the Minister for Agriculture, Food and the Marine the position regarding an application to participate in the afforestation scheme in an area (details supplied) in County Wicklow; and if he will make a statement on the matter. [9991/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-02-27/pq_220",
        "questionNumber": 220,
        "answerText": " Minister for Agriculture, Food and the Marine  The application under the Native Woodland Establishment Scheme was refused in November 2013 because the site was considered unsuitable for growing broadleaves due to its high elevation, exposure and shallow soil depth.  However, it was also considered that the more productive and sheltered parts of the site may be more suited to the Afforestation Scheme where an alternative species may be considered. On this basis, the applicant has submitted an application under the Afforestation Scheme on a smaller area than in the original application. This application is now under consideration by the Department and a decision will be made and the applicant notified as soon as the necessary enquiries and consultations have been completed. "
      },
      "contextDate": "2014-02-27"
    },
    {
      "question": {
        "date": "2014-02-26",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-02-26/writtens/dbsect_104",
          "showAs": "Schools Building Projects Status",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2014-02-26/writtens/mul@/dbsect_104.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_104"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Simon-Harris.D.2011-03-09",
          "memberCode": "Simon-Harris.D.2011-03-09",
          "showAs": "Simon Harris"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Education",
          "roleType": null
        },
        "showAs": " 88. Deputy Simon Harris asked the Minister for Education and Skills the position regarding the application for funding for a multi-sensory room (details supplied); and if he will make a statement on the matter.  [9961/14] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2014-02-26/pq_88",
        "questionNumber": 88,
        "answerText": " Minister for Education and Skills  My Department has received an application for grant aid from the school referred to by the Deputy to provide equipment for a newly established multi-sensory room.  Additional information was requested from the School Authority and this information was recently received. The application is now being assessed and the School Authorities will be advised of the outcome. "
      },
      "contextDate": "2014-02-26"
    }
  ]
}