{
  "head": {
    "counts": {
      "questionCount": 6236,
      "resultCount": 6236
    }
  },
  "results": [
    {
      "contextDate": "2024-07-04",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-04/writtens/mul@/dbsect_206.xml"
            }
          },
          "debateSectionId": "dbsect_206",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-04/writtens/dbsect_206",
          "showAs": "Tax Code"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-04/pq_209",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 209,
        "showAs": " 209. Deputy Dara Calleary asked the Minister for Finance if his Department will examine the help-to-buy scheme with a view to lowering the 70% mortgage requirement to access the scheme; if he will acknowledge that his threshold excludes thousands of both purchasers and properties from the scheme; and if he will make a statement on the matter. [28749/24] ",
        "answerText": " Minister for Finance  The Help to Buy (HTB) Scheme was introduced in 2017 with the purpose of assisting first-time buyers with the deposit required to purchase or self-build a new house or apartment to live in as their home. The relief is only available in respect of new builds, with a view to increasing the supply of new housing and stimulating demand.  The incentive gives a refund of Income Tax and Deposit Interest Retention Tax (“DIRT”) paid in Ireland over the previous four years, subject to limits outlined in the legislation. Section 477C of the Taxes Consolidation Act 1997 outlines the definitions and conditions that apply to the HTB scheme and provides that the amount of relief available shall be the lesser of:  • €30,000,  • 10 per cent of the purchase value of a new home/self-build property, or  • the amount of Income Tax and DIRT paid in the four years before application for the relief.  An increase in the supply of new housing remains a priority aim of Government policy. HTB is specifically designed to encourage an increase in demand for new build homes in order to support the construction of an additional supply of such properties. For a property to qualify for HTB, it must be new or converted for use as a dwelling, having not been previously been used as a dwelling.  One condition of the scheme is that a qualifying first-time purchaser (“FTP”) must take out a loan in an amount equal to at least 70% of the purchase value of the property. In the case of a self-build property, the purchase value is the approved valuation of the self-build property, as approved by the lender in accordance with the Central Bank’s macro prudential rules. These rules stipulate the valuation should include the site value.  The HTB scheme, was initially intended to be limited to persons who had mortgages with a minimum LTV of 80%. However, Central Bank data indicated that a sizable number of first-time buyers take out a mortgage with a LTV of less than 80%. As such, it was decided to amend the scheme in the subsequent Finance Bill to set the minimum LTV at 70% so as to ensure that first-time buyers did not feel compelled to borrow larger amounts than they would have otherwise in order to qualify for the scheme.  Individuals who are in the position of being able to avail of a mortgage at a lower loan-to-value ratio than 70% are considered to have sufficient resources to meet the deposit requirements of the macro-prudential rules and thus less in need of assistance from the Exchequer. Lowering the LTV ceiling would therefore only increase dead-weight in the scheme. In fact, the independent review of the scheme which took place in 2022 recommended that the LTV be increased to 80% for purchasers availing of HTB.  I have no plans at present to change the loan to ratio value under the scheme. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-04",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2024-05-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-30/writtens/mul@/dbsect_228.xml"
            }
          },
          "debateSectionId": "dbsect_228",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-30/writtens/dbsect_228",
          "showAs": "Maternity Leave"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-05-30/pq_238",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 238,
        "showAs": " 238. Deputy Dara Calleary asked the Minister for Children, Equality, Disability, Integration and Youth if plans are in place to allow women diagnosed with cancer during pregnancy or postpartum to defer their maternity leave while they are going through treatment (details supplied). [24486/24] ",
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  The Maternity Protection Act 1994 and the Maternity Protection (Amendment) Act 2004 provide a pregnant employee with six months of paid maternity leave and an additional 16 weeks of unpaid leave. All forms of family leave are kept under review to ensure that they are effective in supporting families and children.  In October I announced plans to introduce legislation to allow women undergoing treatment for cancer or other serious illnesses postpone their maternity leave.  It is planned to bring this forward together with a number of amendments arising out of my Department’s review of Ireland’s equality legislation. My officials are finalising these proposals and I intend to bring them to Cabinet for approval in the coming weeks. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-05-30",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2024-05-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-08/writtens/mul@/dbsect_250.xml"
            }
          },
          "debateSectionId": "dbsect_250",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-05-08/writtens/dbsect_250",
          "showAs": "Housing Schemes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-05-08/pq_285",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 285,
        "showAs": " 285. Deputy Dara Calleary asked the Minister for Housing, Local Government and Heritage to outline the details of funding applications from Mayo County Council for voids refurbishments in 2022, 2023 and 2024; the funding applied for and funding received; if his Department directs funding towards specific properties or if Mayo County Council has that discretion; and if he is aware there are 16 vacant local authority houses in the Ballina area that Mayo County Council ascertain they have not received funding to refurbish. [20621/24] ",
        "answerText": " Minister for Housing, Local Government and Heritage  The management and maintenance of local authority housing stock, including pre-letting repairs to vacant properties, the implementation of a planned maintenance programme and carrying out of responsive repairs, are matters for each individual local authority under Section 58 of the Housing Act 1966. Local authorities and elected members have a very important role to play in this regard by making adequate budgetary provision for housing repairs and cyclical maintenance utilising the housing rental income available to them as part of the annual budgetary process.  Since 2014, Exchequer funding has also been provided through my Department's Voids Programme to supplement the local authority funding available for the preparation of vacant properties for re-letting. The funding was introduced originally to tackle long-term vacant units and is now increasingly targeted to support authorities to ensure minimal turnaround and re-let times for vacant stock. The emphasis of the programme is on minimum refurbishment works to comply with the Housing (Standards for Rented Houses) Regulations 2019 to ensure quick turnaround and re-letting times.  An annualised breakdown by local authority of the funding provided and the number of properties remediated under the Voids programme, including Mayo County Council for the years 2014 up to and including 2023 is available on my Department's website at the following link:  www.gov.ie/en/collection/0906a-other-local-authority-housing-scheme-statistics/#voids-programme  Local authorities in their administration of the programme select the properties for inclusion and the associated work programme of remediation in order to comply with the Housing (Standards For Rented Houses) Regulations 2019. Local authorities have been notified of their targets and funding available for 2024, however, it will be later this year before significant claims have been received.  Given the very significant investment into the Voids Programme over recent years local authorities are now in a strong position to continue the transition to a strategic and informed planned maintenance approach to stock management and maintenance.  To that end, my Department and local authorities are continuing to progress from a largely response and voids based approach to housing stock management and maintenance, to a planned maintenance approach as referenced in Housing for All, policy objective 20.6. This will require the completion of stock condition surveys by all local authorities and the subsequent development of strategic and informed work programmes in response. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-05-08",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2024-03-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/mul@/dbsect_37.xml"
            }
          },
          "debateSectionId": "dbsect_37",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/dbsect_37",
          "showAs": "Passport Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-20/pq_49",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 49,
        "showAs": " 49. Deputy Dara Calleary asked the Tánaiste and Minister for Foreign Affairs if a person born in the UK with no Irish decent but married to an Irish person and living in Ireland for almost 30 years can apply avail of an Irish passport without applying and paying for naturalisation. [11790/24] ",
        "answerText": " Tánaiste and Minister for Foreign Affairs  All passport applications are subject to the provisions of the Passports Act 2008, as amended. The Act provides, among other things, that a person must be an Irish citizen before a passport can be issued. Entitlement to Irish citizenship is determined by the Irish Nationality and Citizenship Act 1956, as amended.  There are no provisions for the spouse or partner of an Irish citizen to acquire an Irish passport solely by virtue of a marriage or civil partnership with an Irish citizen. The legal provision that provided for post-nuptial citizenship was repealed with effect from 30 November 2005 and therefore it is not possible to apply retrospectively. Citizens can apply for an Irish passport if they acquired Irish citizenship by making a declaration of post-nuptial citizenship, as prescribed by the Department of Justice and Equality prior to this date.  Information on Irish citizenship through naturalisation is available from the Department of Justice which has responsibility for that process. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-20",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2024-03-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/mul@/dbsect_595.xml"
            }
          },
          "debateSectionId": "dbsect_595",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/dbsect_595",
          "showAs": "Fire Service"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-20/pq_666",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 666,
        "showAs": " 666. Deputy Dara Calleary asked the Minister for Housing, Local Government and Heritage if retained firefighters will be included in pension age increase for uniformed workers. [12659/24] ",
        "answerText": " Minister for Housing, Local Government and Heritage  My Department has already taken a number of steps to incrementally increase the retirement age for retained fire-fighters from 55 to 60, following engagements in the Labour Court and the Work Place Relations Commission.  The Government has recently approved an increase in the mandatory retirement age for other members of the uniformed services including An Garda Síochana, the Defence Forces and the Irish Prison Service. It is my intention to examine a similar extension to the mandatory retirement age for both full time and retained firefighters with a view to providing consistency in the uniformed services. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-20",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2024-03-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/mul@/dbsect_694.xml"
            }
          },
          "debateSectionId": "dbsect_694",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/dbsect_694",
          "showAs": "Social Welfare Benefits"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-20/pq_781",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 781,
        "showAs": " 781. Deputy Dara Calleary asked the Minister for Social Protection if changes are going to be made to jobseekers allowance and X and O system to allow people working as care assistants/home help assistants to claim assistance (details supplied). [13081/24] ",
        "answerText": " Minister for Social Protection  The Government is conscious of the recruitment and retention challenges in the home and community care sector and is supportive of properly informed measures to increase capacity in the sector. Towards this end it established a Strategic Workforce Advisory Group in 2022 specifically to look at the labour force challenges facing providers of home-care services.  Following a consultation process, this Group classified, and priority-ranked the challenges faced in the sector and brought forward a number of recommendations for reform. Although the issue of social welfare thresholds was raised, it was ranked behind issues related to other factors, including for example, the rate of payment paid to care workers, unpredictable working hours and the use of temporary contracts within the sector.  The Department supports part-time working through a number of schemes including casual and part-time work arrangements for people on jobseeker payments. In addition, the working family payment supports families on low incomes and there are tapered income disregards across a number of schemes to support the take up of employment including the one-parent family scheme and the disability allowance scheme, neither of which are hours constrained.  The current legislative and operational framework for jobseekers is based on a days worked rather than an hours worked threshold. Under the current system a person can work three days and receive a partial jobseeker payment. It is not possible, under the current system, to apply preferential rules to workers based on their occupation or sector of employment.  In line with the commitment in Pathways to Work, the national employment strategy, work is continuing in relation to the development of the possible features of a Working Age Payment, which will include examining the structure of the existing Jobseeker's Allowance scheme. A Working Age Payment would utilise Revenue Commissioner real time earnings data to adjust payment levels in line with a person’s weekly earnings. In this way it would guarantee a basic income floor and ensure that in all cases a person’s income increases when they work. This would represent a significant change to Jobseeker's Allowance and would address issues relating to the use of days or hours worked.  I trust that clarifies the matter for the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-20",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2024-03-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/mul@/dbsect_1318.xml"
            }
          },
          "debateSectionId": "dbsect_1318",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/dbsect_1318",
          "showAs": "Health Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-20/pq_1485",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1485,
        "showAs": " 1485. Deputy Dara Calleary asked the Minister for Health the status of the appointment of a consultant neurologist at Mayo University Hospital, Castlebar, County Mayo; and if he will make a statement on the matter. [12909/24] ",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-20",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2024-03-07",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-07/writtens/mul@/dbsect_277.xml"
            }
          },
          "debateSectionId": "dbsect_277",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-07/writtens/dbsect_277",
          "showAs": "Agriculture Schemes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-07/pq_294",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 294,
        "showAs": " 294. Deputy Dara Calleary asked the Minister for Agriculture, Food and the Marine when TAMS applications will be processed; if he will expedite applications for time-sensitive measures such as replacement of silage slabs (need to be completed by May); and if he will make a statement on the matter. [11198/24] ",
        "answerText": " Minister for Agriculture, Food and the Marine  Overall, the Targeted Agriculture Modernisation Scheme (TAMS 3), has proved very popular, with an unprecedented level of applications received in the first two tranches (almost four times the average number received per tranche under TAMS 2).  Approvals for TAMS 3 applications are issuing on a daily basis, with a total of 5,635 approvals now issued. As I have previously highlighted, applicants who have applied for mobile equipment may purchase equipment at their own risk, subject to the verification of eligibility in accordance with the Terms and Conditions of the scheme.  To address the issue where there is an urgent need to commence works, the priority approval mechanism that was available under Tranche 1 is available again for Tranche 2 applicants. Applicants or their advisers should contact their local Department office outlining the circumstances and the critical requirement to proceed with the investment. On receipt of a request in writing or by email, the application will then be assessed to determine whether there is an urgent necessity to issue approval. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-07",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2024-02-27",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-27/writtens/mul@/dbsect_92.xml"
            }
          },
          "debateSectionId": "dbsect_92",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-27/writtens/dbsect_92",
          "showAs": "Defective Building Materials"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-02-27/pq_72",
        "to": {
          "roleType": null,
          "showAs": "Environment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 72,
        "showAs": " 72. Deputy Dara Calleary asked the Minister for the Environment, Climate and Communications the reasons he has delayed sanctioning the SEAI to proceed with a bespoke scheme for participants in the defective concrete blocks scheme (details supplied). [8642/24] ",
        "answerText": " Minister for the Environment, Climate and Communications (Deputy Eamon Ryan)  Homeowners eligible for works under the Defective Concrete Blocks (DCB) scheme may apply for energy upgrade grants administered by the Sustainable Energy Authority of Ireland (SEAI). Homeowners’ whose applications are in line with the existing SEAI Scheme criteria and guidelines can access SEAI grants in line with the usual application processes that apply. Further information in that regard is available at Energy Efficient Homes - Home Energy Upgrades And Grants | SEAI.  My Department and SEAI are aware however of the particular issues arising for DCB homeowners that do not currently comply with the SEAI scheme terms and conditions. Examples of such situations include homeowners that previously received SEAI grant support to upgrade a home which now needs to be demolished due to defective concrete block and now wish to avail of further SEAI grant supports for their new home.  The Department is working with SEAI to develop an approach to address these matters. SEAI submitted its most recent proposals to the Department at the end of January regarding how such applications can be managed as seamlessly as possible. The Department is actively engaging with SEAI in relation to the proposals which are expected to be finalised in the coming weeks.  SEAI continues to engage directly with impacted homeowners on a case by case basis to discuss their particular circumstances. A specific page on the SEAI website provides further information for DCB affected homeowners (Defective Concrete Blocks Affected Homeowners | Individual Energy Upgrades | SEAI). Homeowners can also contact the SEAI at a dedicated DCB phone number 01-8082004 or by email at dcb@seai.ie. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-02-27",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2024-02-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-20/writtens/mul@/dbsect_206.xml"
            }
          },
          "debateSectionId": "dbsect_206",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-20/writtens/dbsect_206",
          "showAs": "Irish Language"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-02-20/pq_245",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 245,
        "showAs": " 245. Deputy Dara Calleary asked the Minister for Education when she expects to publish the policy on Irish medium education outside the Gaeltacht; and if she will make a statement on the matter. [7406/24] ",
        "answerText": " Minister for Education  Work is progressing in my Department on the development of the new policy on Irish-medium education outside of the Gaeltacht.  The steering committee which includes representatives drawn from relevant Government Departments and Agencies, is continuing to oversee the development of the policy.  A public consultation process has been conducted to gather the views of stakeholders, including young people, parents, education professionals, education stakeholders and Irish-language organisations. There were three phases in this consultation – an online questionnaire and a call for written submissions, a series of focus groups with primary school pupils and post-primary school students, and stakeholders, and bilateral meetings between officials from my Department and stakeholders.  The Sealbhú research centre in DCU has undertaken an analysis of the information gathered during the consultation. The reports are currently being reviewed by the Steering Committee and will be published online in due course.  A number of actions are being taken to ensure that the new policy will be informed by current research:  • A review of national and international literature has been commissioned through a public procurement process and has been carried out by Sealbhú, DCU. This research focuses on teaching through the medium of minority languages in various jurisdictions with contexts similar to the Irish context  • A report giving an overview of provision for Irish-medium education outside of Gaeltacht areas was compiled and published by my Department.  • Research has been carried out on Irish-medium Aonaid and Sruthanna (Units and Streams) in English-medium schools.  • Two composite reports on inspection findings on the quality of educational provision in Irish-medium primary and post-primary schools were published in spring 2021. A report on inspection findings from visits to Irish-medium early learning and care settings is also being prepared.  I look forward to progressing this important work of strengthening Irish-medium education provision and building on the positive outcomes already being achieved in the implementation of the Policy on Gaeltacht Education. My Department will continue to work with relevant stakeholders in the development of this policy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-02-20",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2024-02-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-20/writtens/mul@/dbsect_230.xml"
            }
          },
          "debateSectionId": "dbsect_230",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-20/writtens/dbsect_230",
          "showAs": "Special Educational Needs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-02-20/pq_270",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 270,
        "showAs": " 270. Deputy Dara Calleary asked the Minister for Education if she is satisfied that the current assessment of need process sufficiently caters for students with severe visual impairment; what accommodations are to be made for severely visually impaired students when completing the test; and if she will make a statement on the matter. [7559/24] ",
        "answerText": " Minister of State at the Department of Education  Enabling children with special educational needs to receive an education is a priority for this government. It is also a key priority for me as Minister for Special Education & Inclusion, for my department and for the National Council for Special Education (NCSE).  The assessment of need process is provided for under the Disability Act 2005. Assessment officers under the remit of the Health Service Executive (HSE) are charged with organising the assessment of need.  The HSE assessment officer makes the determination as to whether or not a child or young person meets the definition of disability contained in the act and the assessment officer coordinates and completes the assessment report.  Matters in relation to the assessment of need process should be directed to the HSE or to the Department of Children, Equality, Disability, Integration and Youth. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-02-20",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2024-02-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-20/writtens/mul@/dbsect_231.xml"
            }
          },
          "debateSectionId": "dbsect_231",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-20/writtens/dbsect_231",
          "showAs": "Special Educational Needs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-02-20/pq_271",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 271,
        "showAs": " 271. Deputy Dara Calleary asked the Minister for Education how many visiting teachers there currently are nationwide for students with visual impairments; if these visiting teachers are appropriately trained in new digital technologies available to assist students; and if she will make a statement on the matter. [7560/24] ",
        "answerText": " Minister of State at the Department of Education  The Department of Education provides an extensive range of supports to assist pupils who are Blind or who have a Visual Impairment. The Department's policy, which is provided for under Section 2 of the Education of Persons with Special Needs Act 2004, aims to ensure all children with special educational needs access appropriate education intervention in mainstream settings where possible.  The National Council for Special Education (NCSE) has responsibility for coordinating and advising on the education provision for children nationwide. The visiting teacher service for the visually impaired forms part of the NCSE support service for schools, and visiting teachers are now recruited, deployed and managed by the NCSE.  Currently there are 16 Visiting teachers posts allocated across the 10 NCSE regional teams, supported by teams of professionals and agencies such as ophthalmology services, speech and language therapists, low vision specialists, psychologists, early intervention teams and school staff.  Each visiting teacher operates in a particular region and manages a caseload of students. The visiting teacher supports children/young people, parents, guardians, teachers and other professionals involved with the child. Each visiting teacher works in partnership with parents to provide advice, and offer guidance, in matters pertaining to the child’s education and overall development. The frequency and nature of support takes into account a range of factors based on the individual’s needs.  Visiting teachers are qualified teachers with particular skills and knowledge on the development and education of children with varying degrees of visual impairment. They offer longitudinal support to children, their families and schools from the time of referral through to the end of post-primary education. They help children to develop tactile and sensory skills and give advice on self-help and other skills needed for independent living. Visiting Teachers will also discuss and demonstrate the management of assistive technologies for children who are blind/visually impaired. In the case of any technical issues with a student's assistive technology, the school can look to the Visiting Teacher and the suppliers of the equipment for support.  The Digital Strategy for Schools to 2027 builds on the achievements and ambition of the previous strategy and aims to further support the school system to ensure that all learners have the opportunity to gain the knowledge and skills they need to successfully navigate an ever evolving digital world. The strategy has been developed following a wide ranging and extensive consultation process and sets out high level objectives under three key pillars.  www.gov.ie/en/publication/69fb88-digital-strategy-for-schools/#overview.  Visiting teachers engage in professional development on an ongoing basis and this includes training and upskilling in assistive technology and new digital technologies. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-02-20",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2024-02-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-20/writtens/mul@/dbsect_568.xml"
            }
          },
          "debateSectionId": "dbsect_568",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-20/writtens/dbsect_568",
          "showAs": "Dental Services "
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-02-20/pq_624",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 624,
        "showAs": " 624. Deputy Dara Calleary asked the Minister for Health if GMS dental patients who cannot access dentists in Ireland can travel to Northern Ireland (details supplied) to have procedures done and if not, can the HSE refund or part refund the costs. [8020/24] ",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-02-20",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2024-02-15",
      "question": {
        "debateSection": {
          "debateSectionId": "dbsect_180",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-15/writtens/dbsect_180",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-15/writtens/mul@/dbsect_180.xml"
            }
          },
          "showAs": "Active Travel"
        },
        "house": {
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil"
        },
        "questionType": "written",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14",
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14"
        },
        "questionNumber": 178,
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to Active Travel. Funding is administered through the National Transport Authority (NTA), who, in partnership with local authorities, have responsibility for the selection and development of specific projects in each local authority area.  Noting the role of the NTA in the matter, I have referred your question to that agency for a more detailed answer. If you do not receive a reply within 10 working days, please contact my private office. ",
        "date": "2024-02-15",
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Transport",
          "roleType": null
        },
        "showAs": " 178. Deputy Dara Calleary asked the Minister for Transport to provide a list of all projects submitted by Mayo County Council for active travel funding under the announcement of 7 February 2024; how the successful projects within that list were chosen and how the other projects may be funded in the future; and if he will make a statement on the matter. [7403/24] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-02-15/pq_178"
      }
    },
    {
      "contextDate": "2024-02-14",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-14/writtens/mul@/dbsect_262.xml"
            }
          },
          "debateSectionId": "dbsect_262",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-14/writtens/dbsect_262",
          "showAs": "Healthcare Policy"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-02-14/pq_300",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 300,
        "showAs": " 300. Deputy Dara Calleary asked the Minister for Health if there are plans to extend mammograms for under 50 year-olds and over 69 year-olds. [6717/24] ",
        "answerText": " Minister for Health  I am fully committed to supporting our population screening programmes which are a valuable part of our health service, enabling early treatment and care for many people, and improving the overall health of our population.  BreastCheck, the National Breast Screening Programme, currently invites women aged 50 to 69 years at regular periods to have a routine mammogram. Under commitments in the Programme for Government, BreastCheck eligibility has been expanded to women aged 69 years since 2021.  In response to the Deputy's question, I will highlight that any decisions about further changes in cancer screening, including further extension of the age ranges, will be made on the advice of the National Screening Advisory Committee (NSAC). This independent expert group considers and assesses evidence in a robust and transparent manner, and against internationally accepted criteria. It is important we have rigorous processes in place to ensure our screening programmes are effective, quality assured and operating to safe standards, and that the benefits of screening outweigh the harms.  I would stress that careful consideration must be given to any proposed expansion of Ireland’s screening programmes and that this process must be afforded the necessary amount of time to complete. This includes ensuring that decisions are made based on internationally accepted criteria and scientific rigour.  In this regard, I am pleased to report that the Committee is already progressing work to consider the further expansion of our cancer screening programmes and has asked HIQA to evaluate the evidence for the further expansion of the age range eligibility for the BreastCheck programme.  Finally, I would highlight to the Deputy that NSAC holds Calls for Submissions, which invite all stakeholders, including members of the public, HSE and other medical professionals, to make proposals for the introduction of new population-based screening programmes or changes to existing programmes in Ireland. The Committee’s third Call for Submissions is currently open until 1 March 2024. Further information is available on the Committee's website at www.nsacommittee.ie. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-02-14",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2024-02-13",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-13/writtens/mul@/dbsect_569.xml"
            }
          },
          "debateSectionId": "dbsect_569",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-13/writtens/dbsect_569",
          "showAs": "Rural Schemes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-02-13/pq_623",
        "to": {
          "roleType": null,
          "showAs": "Rural",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 623,
        "showAs": " 623. Deputy Dara Calleary asked the Minister for Rural and Community Development if her Department has received an application from a group (details supplied) via the community centres investment fund; if she recognises the importance of the organisation to Ballina and the strength of their funding application; and if she will make a statement on the matter. [6088/24] ",
        "answerText": " Minister for Rural and Community Development  Community centres are the cornerstone of community life in many towns, villages and urban areas around the country. This Government recognises the important role they play in community life in Ireland, bringing people together and providing a space to engage with those who may be marginalised or disadvantaged.  With this in mind, I have put in place an integrated programme of supports for the establishment and development of community centres across schemes such as CLÁR, LEADER, the Community Support Fund, the Town and Village Renewal Scheme, and of course the new Community Centres Investment Fund.  The 2022 Community Centres Investment Fund was warmly welcomed the length and breadth of the country. Over €45.8 million has been committed to the improvement and refurbishment of existing community centres across Ireland.  Following on from this investment, I wanted to assist community groups who are striving to build their own community centre to service their local needs. That is why, in 2023, the focus of the Community Centres Investment Fund moved to new builds.  Last year, I announced a €20 million fund to support communities with ‘shovel-ready’ projects on green or brownfield sites for the construction of new community centres. These shovel ready projects have all necessary planning and consents secured so they are already at an advanced stage and ready to commence following a tender process. This fund targets areas without an appropriate facility to meet their community’s needs.  The deadline for receipt of applications for the new build measure has now passed and I was very pleased with the response to this new initiative. In total, twenty-two applications for new build community centres were received by my Department.  I can confirm that an application for the project referenced by the Deputy has been received seeking investment of over €1.1 million from the fund. The assessment of all of the applications is almost complete and I expect to announce the successful projects shortly. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-02-13",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2024-02-01",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-01/writtens/mul@/dbsect_170.xml"
            }
          },
          "debateSectionId": "dbsect_170",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-01/writtens/dbsect_170",
          "showAs": "Pension Provisions"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-02-01/pq_169",
        "to": {
          "roleType": null,
          "showAs": "Environment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 169,
        "showAs": " 169. Deputy Dara Calleary asked the Minister for the Environment, Climate and Communications if he received a request from a company (details supplied) to sanction an increase for members of its pension scheme; if he is conscious that these pensioners are facing income pressures as a consequence of the lack of an increase; if he will give urgent attention to the request; and if he will make a statement on the matter. [4758/24] ",
        "answerText": " Minister for the Environment, Climate and Communications  I propose to take Questions Nos. 169 and 170 together.  My Department in conjunction with the Department of Public Expenditure, NDP Delivery and Reform work to ensure that all pension increase requests are processed in a timely manner to ensure that there are minimal delays to the members of such pension schemes.Myself and my colleague, the Minister for Public Expenditure NDP Delivery and Reform, have consented to the 4% increase effective from 1 January 2024, which will now be applied by the ESB Pension Scheme Trustees. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-02-01",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2024-02-01",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-01/writtens/mul@/dbsect_170.xml"
            }
          },
          "debateSectionId": "dbsect_170",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-01/writtens/dbsect_170",
          "showAs": "Pension Provisions"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-02-01/pq_170",
        "to": {
          "roleType": null,
          "showAs": "Environment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 170,
        "showAs": " 170. Deputy Dara Calleary asked the Minister for the Environment, Climate and Communications the reason it is necessary for a company (details supplied) to seek ministerial permission for a pension increase; what investments have been made by the State in the fund; and if he will make a statement on the matter. [4759/24] ",
        "answerText": " Minister for the Environment, Climate and Communications  I propose to take Questions Nos. 169 and 170 together.  My Department in conjunction with the Department of Public Expenditure, NDP Delivery and Reform work to ensure that all pension increase requests are processed in a timely manner to ensure that there are minimal delays to the members of such pension schemes.Myself and my colleague, the Minister for Public Expenditure NDP Delivery and Reform, have consented to the 4% increase effective from 1 January 2024, which will now be applied by the ESB Pension Scheme Trustees. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-02-01",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2024-01-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-30/writtens/mul@/dbsect_173.xml"
            }
          },
          "debateSectionId": "dbsect_173",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-30/writtens/dbsect_173",
          "showAs": "Flood Relief Schemes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-01-30/pq_231",
        "to": {
          "roleType": null,
          "showAs": "Public Expenditure",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 231,
        "showAs": " 231. Deputy Dara Calleary asked the Minister for Public Expenditure, National Development Plan Delivery and Reform the current status of the Crossmolina flood relief scheme; what actions have been taken since the submission of the consultant's report to him recently; and to outline a timeline for progressing the scheme to construction. [3913/24] ",
        "answerText": " Minister for Public Expenditure, National Development Plan Delivery and Reform  In accordance with the European Union (Environmental Impact Assessment) (Arterial Drainage) Regulations 2019, the Office of Public Works has sought consent for the River Deel Flood Relief scheme under the Arterial Drainage Acts 1945 and 1995. My Department has appointed environmental consultants to carry out the necessary environmental assessments required.  In July 2023, additional supplementary information was requested from OPW to facilitate reaching a full, reasoned conclusion on the environmental impacts of the scheme. The OPW submitted supplementary information to my Department in November 2023.  This supplementary information is currently being examined by the environmental consultants retained by my Department. The supplementary information is being examined in order to inform the reaching of a reasoned conclusion on the environmental effects of the scheme. The supplementary information is also being examined in order to determine whether the information supplied is considered to be 'significant' in the context of Section 7.3(c) of the Regulations. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-01-30",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2024-01-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-30/writtens/mul@/dbsect_299.xml"
            }
          },
          "debateSectionId": "dbsect_299",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-30/writtens/dbsect_299",
          "showAs": "Social Welfare Appeals"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-01-30/pq_372",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 372,
        "showAs": " 372. Deputy Dara Calleary asked the Minister for Social Protection the current timeframe for social welfare appeals; what resources are in place to address appeals; if she will allocate extra resources to address backlogs; and if she will make a statement on the matter. [3915/24] ",
        "answerText": " Minister for Social Protection  The Social Welfare Appeals Office is an Office of the Department of Social Protection which is responsible for determining appeals against decisions in relation to social welfare entitlements. Appeals Officers are independent in their decision making functions.  The average processing times for all appeals finalised in 2023 was 16 weeks. The average time taken to process appeals which required an oral hearing was 29.2 weeks and the time to process appeals determined on a summary basis was 17.6 weeks.  Significant efforts and resources have been devoted to reforming the appeal process in recent years and further improvements in appeals processing times are a priority for the Chief Appeals Officer. A significant Appeals Modernisation Project is currently underway the goal of which is to streamline and enhance the end-to-end appeals process for the customer, the Social Welfare Appeals Office and business areas across the Department.  As part of this project a new IT system went live on 6 November 2023. The new system has significantly reduced the time taken to register and acknowledge appeals lodged with the Appeals Office and in time will reduce the overall average processing times. Additional staff were assigned to the office as part of the project to assist with the preparation for and transition to the new IT system and the establishment of new procedures.  I trust this clarifies matters the matter for the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-01-30",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2024-01-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-23/writtens/mul@/dbsect_393.xml"
            }
          },
          "debateSectionId": "dbsect_393",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-23/writtens/dbsect_393",
          "showAs": "Immigration Policy"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-01-23/pq_446",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 446,
        "showAs": " 446. Deputy Dara Calleary asked the Minister for Justice the current status of IIP applications that were submitted in advance of the February 2023 deadline; and the timeline for sports clubs that have submitted valid applications to be informed about the success or otherwise of their applications. [2620/24] ",
        "answerText": " Minister for Justice  As the Deputy will be aware, the Government agreed to close the Immigrant Investor Programme (IIP) to further applications from 15 February 2023.  As Minister, I do not comment on individual IIP applications, however, my Department’s IIP Unit is committed to ensuring that all applications will be examined on their own merits and will endeavour to conclude all decisions in a timely manner.  I can advise the Deputy that updated information in relation to the winding down of the Programme and the processing of applications has recently been published on my Department’s website and an updated FAQ is now available also. Both are available at the following link: www.irishimmigration.ie/processing-of-iip-applications-on-hand-following-the-closure-of-the-programme/   There has been an unprecedented level of applications to the programme in recent years and it is hoped in the coming months that we will be in a better position to understand the impact this will have on the likely timeframes within which final decisions on projects will be made. As the position becomes clearer, we will seek to communicate how we anticipate projects will progress and we will make every effort to share that information in as timely a manner as possible.  I am advised that this IIP Unit are committed to exploring any new ways of working that could expedite the examination of project applications and reduce the overall timeframe for decisions. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-01-23",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2023-12-12",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-12-12/writtens/mul@/dbsect_576.xml"
            }
          },
          "debateSectionId": "dbsect_576",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-12-12/writtens/dbsect_576",
          "showAs": "Beef Sector"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-12-12/pq_637",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 637,
        "showAs": " 637. Deputy Dara Calleary asked the Minister for Agriculture, Food and the Marine the reason for changes by an organisation (details supplied); if there are avenues for appeals for owners who have had their ratings changed; and if he will make a statement on the matter. [55390/23] ",
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 620, 633, 634, 637 and 638 together.  The Irish Cattle Breeding Federation (ICBF) is the body approved in Ireland in accordance with relevant EU legislation to conduct testing, genetic evaluation and publication of breeding values for dairy and beef cattle have recently updated beef breeding indexes.  This was the first major update since 2015, based predominately on changing economic drivers such as feed costs and beef prices. A modest adjustment also took place based on earlier slaughter of animals, tuberculosis resistance, carcass specifications and lower methane output.  I understand that prior to the updates, Continentals (Charolais, Limousin and Belgian Blue) were the most desirable Terminal cattle breeds and they continue to be the most desirable after the changes. With regard to the Replacement Index, the top three most desirable replacement breeds (Aberdeen Angus, Limousin and Simmental) remain as the top three after the changes.  ICBF have communicated extensively on changes to the beef indexes, including with breed societies, since the changes were announced. ICBF has recently committed to convening an industry stakeholder forum to address issues and concerns raised by suckler farmers and pedigree breeders and I welcome this engagement.  The Suckler Carbon Efficiency Programme aims to provide support to suckler farmers to improve the profitability and environmental sustainability of the national beef herd. I understand from ICBF that 84% of 4-5 Star animals prior to the changes will retain their 4-5 Star status after the changes.  Animals in SCEP herds whose Index falls will not be impacted by the changes unless the SCEP participant sells an animal that has gone down in rating. It is only when this animal moves out of this herd, its 3 Star rating will become applicable and it will no longer meet the 4 and 5 Star eligibility criteria. I understand that any other issues will be addressed in the coming months in the stakeholder forum and communications will be issued to SCEP participants by ICBF. I will continue to monitor any impact on SCEP farmers closely.  I am confident that the amended indexes will contribute to the overall profitability and sustainability of beef production at farm level and my Department will continue to monitor the impact of the amended indexes on SCEP participants. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-12-12",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2023-12-05",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-12-05/writtens/mul@/dbsect_294.xml"
            }
          },
          "debateSectionId": "dbsect_294",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-12-05/writtens/dbsect_294",
          "showAs": "Local Authorities"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-12-05/pq_323",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 323,
        "showAs": " 323. Deputy Dara Calleary asked the Minister for Housing, Local Government and Heritage when details of voluntary redundancy schemes will be released to local authorities (details supplied); and if he will make a statement on the matter. [53675/23] ",
        "answerText": " Minister for Housing, Local Government and Heritage  The Framework for Future Delivery of Water Services (June 2022) was agreed following a comprehensive process of engagement with unions under the aegis of the Workplace Relations Commission and enables the integration of public water services into Uisce Éireann's organisational structure, as envisaged in the Government’s Policy Paper on Water Sector Transformation (February, 2021).  The Framework provides that a voluntary redundancy scheme will be available to local authority water services staff who are otherwise eligible for transfer to Uisce Éireann yet do not see such transfer or reassignment to other local authority service areas, as realistic options. The Scheme will be available to those who are under preserved pension age at 30 June 2024, and who have already accrued entitlement to preserved superannuation benefits under a local government scheme (2 years’ service) on that date.  The Minister for Public Expenditure, NDP Delivery and Reform recently provided sanction to my Department to proceed with the voluntary redundancy scheme on the basis set out in the Framework. While the details are not yet finalised, the scheme will have regard to previous public sector voluntary redundancy schemes.  Following consultation with the relevant stakeholders, my Department will be writing to local authorities to provide direction on the roll out of the Scheme. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-12-05",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2023-12-05",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-12-05/writtens/mul@/dbsect_486.xml"
            }
          },
          "debateSectionId": "dbsect_486",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-12-05/writtens/dbsect_486",
          "showAs": "Dental Services "
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-12-05/pq_540",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 540,
        "showAs": " 540. Deputy Dara Calleary asked the Minister for Health for a list of dentists participating in the GMS scheme in County Mayo. [53399/23] ",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible.  As the Deputy may be aware, management and administrative grade staff in the Fórsa union in the HSE commenced industrial action on Friday 6th October. As a consequence of this industrial action, members in these grades are not engaging with political forums or processes. As a result, the question asked by the Deputy may be delayed in receiving a response directly from the HSE. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-12-05",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2023-12-05",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-12-05/writtens/mul@/dbsect_540.xml"
            }
          },
          "debateSectionId": "dbsect_540",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-12-05/writtens/dbsect_540",
          "showAs": "Medical Aids and Appliances"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-12-05/pq_590",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 590,
        "showAs": " 590. Deputy Dara Calleary asked the Minister for Health if he will consider adding the cost of myopathy lenses to the public scheme (details supplied); if not, if his Department will cover the cost up to costs incurred of ordinary lenses which are covered by the public scheme; and if he will make a statement on the matter. [53676/23] ",
        "answerText": " Minister for Health  The Community Ophthalmic Services Scheme (COSS) is a national fee-per-item scheme which was introduced in 1979. Under the COSS, medical card holders aged over 16 years can be seen by ophthalmologists, community ophthalmic physicians, optometrists or dispensing opticians.  Eligible patients can receive an eye examination and be provided with prescribed optical appliances in accordance with a national schedule of approved optical appliances.  The Health Professionals (Reduction of Payments to Ophthalmologists, Optometrists and Dispensing Opticians) Regulations 2013 (SI 274 of 2013) sets the fees for optometrists and dispensing opticians under the Community Optometric Services, Community Spectacle Dispensing Services and Health Amendment Act Card Schemes. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-12-05",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2023-12-05",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-12-05/writtens/mul@/dbsect_580.xml"
            }
          },
          "debateSectionId": "dbsect_580",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-12-05/writtens/dbsect_580",
          "showAs": "Rural Schemes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-12-05/pq_631",
        "to": {
          "roleType": null,
          "showAs": "Rural",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 631,
        "showAs": " 631. Deputy Dara Calleary asked the Minister for Rural and Community Development when the successful CLÁR measure 1 applicants will be announced; and if she will make a statement on the matter. [53181/23] ",
        "answerText": " Minister for Rural and Community Development  The CLÁR programme provides funding for small-scale projects in designated rural areas that have experienced significant levels of de-population over a defined period. Since the programme was relaunched in 2016, it has supported over 2,250 projects with funding of over €65.7 million. This funding is making a real difference in many of our smaller and more remote communities.  I launched the 2023 programme in March this year. Measure 1 of the programme will support the development of community facilities and amenities including sports facilities, youth clubs, playgrounds, sensory gardens and walking tracks. For the first time, the programme this year offers funding to carry out improvements to spectator stands at local GAA and other sports clubs.  I was pleased earlier this year to announce the approval of funding of over €2 million for 37 projects under measure 2 of the CLÁR programme.  Last week I announced funding of over €4.7 million for the first tranche of 113 projects under measure 1 of CLÁR, focussing on sports infrastructure initiatives. I plan to announce additional approvals under measure 1 and under measure 3 “Our Islands” in the coming days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-12-05",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "question": {
        "debateSection": {
          "showAs": "Defective Building Materials",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-11-30/writtens/dbsect_257",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-11-30/writtens/mul@/dbsect_257.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_257"
        },
        "house": {
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house",
          "showAs": "33rd Dáil"
        },
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Environment",
          "roleType": null
        },
        "date": "2023-11-30",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-11-30/pq_263",
        "questionType": "written",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14",
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14"
        },
        "showAs": " 263. Deputy Dara Calleary asked the Minister for the Environment, Climate and Communications if his Department is in receipt of a submission from SEAI in relation to the defective concrete blocks scheme; if he is aware of the delays being caused by SEAI not expanding its schemes as promised; and if he will treat their submission as a urgent priority. [53034/23] ",
        "answerText": "",
        "questionNumber": 263
      },
      "contextDate": "2023-11-30"
    },
    {
      "question": {
        "debateSection": {
          "showAs": "Departmental Programmes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-11-30/writtens/dbsect_428",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-11-30/writtens/mul@/dbsect_428.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_428"
        },
        "house": {
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house",
          "showAs": "33rd Dáil"
        },
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Justice",
          "roleType": null
        },
        "date": "2023-11-30",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-11-30/pq_443",
        "questionType": "written",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14",
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14"
        },
        "showAs": " 443. Deputy Dara Calleary asked the Minister for Justice the current status of IIP applications that were submitted in advance of the February 2023 deadline; the timeline for sports clubs that have submitted valid applications to be informed about the success or otherwise of their applications; and if she will make a statement on the matter. [53178/23] ",
        "answerText": " Minister for Justice  As the Deputy will be aware, the Government agreed to close the Immigrant Investor Programme (IIP) to further applications from 15 February 2023.  The IIP Unit has published an FAQ document concerning the closure of the programme on my Department's Immigration Services website, which will be updated with any further questions arising from the closure, and is available here: www.irishimmigration.ie/faqs-closure-of-the-immigrant-investor-programme-iip/  Due to the exceptionally large number of applications on hand it is not possible to give a timeframe as to when applications will receive a decision, however, I can confirm that all applications will be considered on their own merits and my Department will endeavour to make decisions in a timely manner. ",
        "questionNumber": 443
      },
      "contextDate": "2023-11-30"
    },
    {
      "contextDate": "2023-11-28",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-11-28/writtens/mul@/dbsect_392.xml"
            }
          },
          "debateSectionId": "dbsect_392",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-11-28/writtens/dbsect_392",
          "showAs": "Immigration Policy"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-11-28/pq_403",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 403,
        "showAs": " 403. Deputy Dara Calleary asked the Minister for Justice when strand 4 endowment applications for the Immigrant Investment Programme will be processed; if she will outline the projected timeframes for processing of application under this strand; and if she will make a statement on the matter. [51903/23] ",
        "answerText": " Minister for Justice  As the Deputy will be aware, the Government agreed to close the Immigrant Investor Programme (IIP) to further applications from 15 February 2023.  The IIP Unit has published an FAQ document concerning the closure of the programme on my Department's Immigration Services website, which will be updated with any further questions arising from the closure, and is available here: www.irishimmigration.ie/faqs-closure-of-the-immigrant-investor-programme-iip/  Due to the exceptionally large number of applications on hand it is not possible to give a timeframe as to when applications will receive a decision, however, I can confirm that all applications will be considered on their own merits and my Department will endeavour to make decisions in a timely manner. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-11-28",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2023-11-21",
      "question": {
        "date": "2023-11-21",
        "by": {
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14",
          "showAs": "Dara Calleary"
        },
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-11-21/writtens/mul@/dbsect_85.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-11-21/writtens/dbsect_85",
          "showAs": "Broadband Infrastructure",
          "debateSectionId": "dbsect_85"
        },
        "showAs": " 106. Deputy Dara Calleary asked the Minister for the Environment, Climate and Communications the options available to a sports club (details supplied) in County Mayo seeking a fibre broadband connection when civil works have been deemed over budget; if he will intervene in this matter and insist on the works being carried out to facilitate this service; and if he will make a statement on the matter. [50671/23] ",
        "questionNumber": 106,
        "questionType": "written",
        "answerText": " Minister for the Environment, Climate and Communications (Deputy Eamon Ryan)  In December 2022, my Department published Ireland's Digital Connectivity Strategy which supports the ambition outlined in the National Digital Strategy and sets out a number of ambitious targets, including that:  • all Irish households and businesses will be covered by a Gigabit network no later than 2028  • all populated areas will be covered by 5G no later than 2030, and  • digital connectivity will be delivered to all schools and broadband connection points by 2023  These targets will be achieved through commercial operators investing in their networks, complemented by the State’s National Broadband Plan intervention. When taken together, all premises in the State will have access to high-speed broadband in every part of the country no matter how remote.  My officials have advised that a representative of Ballina Rugby club should raise a query via the DECC webform at https://secure.dccae.gov.ie/forms/NBP-Customer-Service.aspx and we will escalate with open eir to investigate this matter further.  Commercial operators’ fibre rollouts are progressing at pace. Open eir have already passed over 34,200 homes and businesses in Mayo with gigabit services, with plans to pass a further c.14,000 homes and businesses over the next 2 – 3 years, bringing their total fibre-based investment in the county to over €26m. Other commercial operators are also continuing to increase their network footprint right across Mayo, with SIRO recently passing over 5,000 premises for full fibre, and Virgin Media passing over 7,600 premises.  Recent ComReg data shows that Quarter 2 of 2023 saw a 7.4% increase in fibre broadband subscriptions compared to the first 3 months of the year, and a 33.7% increase when compared to Quarter 2 of 2022. This demonstrates that take-up of fibre connectivity for homes and businesses is increasing substantially as it is deployed to areas where it had previously been unavailable. The same ComReg data also indicates that c. 40% of homes and business throughout the State now have access to gigabit services through either fibre (576,856) or cable (359,669) infrastructure. ",
        "to": {
          "showAs": "Environment",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-11-21/pq_106"
      }
    },
    {
      "contextDate": "2023-11-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-11-16/writtens/mul@/dbsect_140.xml"
            }
          },
          "debateSectionId": "dbsect_140",
          "showAs": "Flood Risk Management",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-11-16/writtens/dbsect_140"
        },
        "by": {
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14",
          "showAs": "Dara Calleary"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "questionType": "written",
        "answerText": " Minister for Public Expenditure, National Development Plan Delivery and Reform  The request for supplementary information has been made under Section 7B(4) of the European Union (Environmental Impact Assessment) (Arterial Drainage) Regulations 2019. Section 7B(4) does not stipulate the imposition of deadlines for the compliance of such a request. Where a request is made under Section 7B(4), the Commissioners of Public Works are obliged to comply with such a request.  Requests under Section 7B(4) of the Regulations are made where supplementary information is required where it is directly relevant to reaching a reasoned conclusion on the significant effects on the environment of the proposed drainage works. There are instances whereby information sought may necessitate the gathering of environmental information from a particular site, and may require certain environmental conditions to be present at that site when the data is collected, so it is not always possible to set a specific deadline in advance. ",
        "questionNumber": 132,
        "house": {
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house",
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail"
        },
        "date": "2023-11-16",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-11-16/pq_132",
        "showAs": " 132. Deputy Dara Calleary asked the Minister for Public Expenditure, National Development Plan Delivery and Reform further to Parliamentary Question No. 345 of 7 November 2023 if, given the time that had elapsed to date and given the duress being suffered by the community of Crossmolina as a result, he will place a deadline for the return of the information referred to from the OPW. [50420/23] "
      }
    },
    {
      "contextDate": "2023-11-14",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-11-14/writtens/mul@/dbsect_594.xml"
            }
          },
          "debateSectionId": "dbsect_594",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-11-14/writtens/dbsect_594",
          "showAs": "Student Accommodation"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-11-14/pq_618",
        "to": {
          "roleType": null,
          "showAs": "Further and Higher Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 618,
        "showAs": " 618. Deputy Dara Calleary asked the Minister for Further and Higher Education, Research, Innovation and Science if he is aware that student accommodation providers with the backing of the colleges around the Dublin area are proposing to move to 51-week contracts for students from next year; if he will acknowledge that a student who wanted to avail of student accommodation again for next year will have to sign up to a new contract and pay for the summer months when they are not there at all; if he will engage with the colleges, with a view to cancelling this planned change; and if he will make a statement on the matter. [49823/23] ",
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  The Residential Tenancies Act (as amended) 2019 brought Student Specific Accommodation (SSA) under the remit of the Residential Tenancies Board (RTB) on the 15 July 2019.  Section 19 b of the Act, provides that a person shall not be required, for the purpose of securing a tenancy, to make any payment other than;  \" (a) an advance payment of rent, which shall be no greater than the amount of rent payable under the tenancy agreement in respect of a period of one month, and  ( b) a deposit of an amount no greater than that payable under the tenancy agreement as rent in respect of a period of one month. \"  This means that a person cannot be expected to pay more than two months’ rent i.e one month’s deposit and one month’s rent in advance to secure a lease.  In addition, Section 19 B (2) of the Act provides that;   \"a tenancy agreement, shall not provide for an advance payment of rent, during the currency of the tenancy, which exceeds an amount that is payable under the tenancy as rent in respect of a period of one month.\"   This means that a tenant is not required to pay more than one month's rent in advance during their tenancy.  A further protection of the Act refers to the required notice of termination;  Paragraph 2 (c) of Section 66 of the Act, provides that in the case of Student Specific Accommodation;   \"the period of notice to be given in respect of a tenancy referred to in subsection (1A) of Section 3 by the tenant and specified in the notice of termination shall be 28 days or such longer period as the tenant choose.\"   This mean that students residing in Student Specific Accommodation (SSA) are only required to give 28 days’ notice to the provider of SSA, if they want to terminate the tenancy arrangement. These students can give a longer period of notice if they wish, but there is no requirement in law to do so.  Officials from my Department have engaged with HEI representatives who have indicated that their members have not sought nor been informed of a move to a 51 week letting period by private providers of student accommodation. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-11-14",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2023-11-07",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-11-07/writtens/mul@/dbsect_308.xml"
            }
          },
          "debateSectionId": "dbsect_308",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-11-07/writtens/dbsect_308",
          "showAs": "Flood Risk Management"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-11-07/pq_344",
        "to": {
          "roleType": null,
          "showAs": "Public Expenditure",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 344,
        "showAs": " 344. Deputy Dara Calleary asked the Minister for Public Expenditure, National Development Plan Delivery and Reform for an update on the flood relief scheme for Ballina, County Mayo. [47498/23] ",
        "answerText": " Minister of State at the Department of Public Expenditure, National Development Plan Delivery and Reform  The Office of Public Works (OPW) has responsibility for leading and co-ordinating the implementation of Ireland’s national flood policy, which includes the development of a planned programme of feasible works for flood relief schemes.  In 2018, to facilitate the development of a programme of works, the OPW completed a strategic study - the National Catchment Flood Risk Assessment and Management (CFRAM) Programme. The CFRAM programme resulted in the publication of 29 Flood Risk Management Plans (FRMPs), which identified and described the flood risk in 29 river basins (including the Moy and Killala Bay Basin and the town of Ballina in Co. Mayo) and potentially viable flood relief works.  To facilitate the progression of potentially viable flood relief works in Ballina, Mayo County Council agreed, with the support of the OPW, to lead the further detailed assessment of the flood risk, design options and environmental assessments to support planning applications for a viable scheme.  The Ballina Flood Relief Scheme, which has a preliminary total project budget of €30m, is currently at Stage 1 – Scheme Development and Preliminary Design. To progress the Ballina Flood Relief Scheme, Mayo County Council engaged the services of RPS Consulting Engineers Ltd.  With support from the OPW, various works have been completed by Mayo County Council and its consultants, including Hydrological and Hydraulic Reports, Topographical Surveys, Ground Investigations and Environmental Surveys, with public consultation events also having been held. A draft Options Report in which a preferred scheme design option has been identified is currently being reviewed. It is envisaged an Environmental Impact Assessment Report will be completed in Q1 2024 at which point Stage I will be completed and the scheme is expected to proceed to planning process from Q2 2024. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-11-07",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2023-11-07",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-11-07/writtens/mul@/dbsect_309.xml"
            }
          },
          "debateSectionId": "dbsect_309",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-11-07/writtens/dbsect_309",
          "showAs": "Flood Risk Management"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-11-07/pq_345",
        "to": {
          "roleType": null,
          "showAs": "Public Expenditure",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 345,
        "showAs": " 345. Deputy Dara Calleary asked the Minister for Public Expenditure, National Development Plan Delivery and Reform for an update on the flood relief scheme for Crossmolina, County Mayo. [47499/23] ",
        "answerText": " Minister for Public Expenditure, National Development Plan Delivery and Reform  My Department has engaged independent environmental consultants to carry out the relevant environmental assessments as required by EU Directives 2011/92 and 2014/52. On the basis of advice received, in order to reach a full, reasoned conclusion on the environmental impacts of the scheme, I have sought supplementary information from the Office of Public Works as provided for under Section 7(4)(b) of the European Union (Environmental Impact Assessment) (Arterial Drainage) Regulations 2019. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-11-07",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2023-11-07",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-11-07/writtens/mul@/dbsect_310.xml"
            }
          },
          "debateSectionId": "dbsect_310",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-11-07/writtens/dbsect_310",
          "showAs": "Flood Risk Management"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-11-07/pq_346",
        "to": {
          "roleType": null,
          "showAs": "Public Expenditure",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 346,
        "showAs": " 346. Deputy Dara Calleary asked the Minister for Public Expenditure, National Development Plan Delivery and Reform to provide an update on the flood relief scheme for Foxford, County Mayo. [47500/23] ",
        "answerText": " Minister of State at the Department of Public Expenditure, National Development Plan Delivery and Reform  In 2018, the Office of Public Works (OPW) completed the Catchment Flood Risk Assessment and Management (CFRAM) Programme – Ireland’s largest study of flood risk. This studied the flood risk for two-thirds of the population against their risk of flooding from rivers and the sea. An output of the CFRAM Programme, the OPW’s Flood Risk Management Plans (FRMPs) provide the evidence for a proactive approach for designing and constructing flood relief schemes for the most at-risk communities.  On foot of the evidence in the FRMP, since 2018 the OPW is finalising a Scheme Viability Review (SVR) for Foxford to determine whether it is feasible to progress a major flood relief scheme for this community or if other flooding mitigation measures should be progressed. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-11-07",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2023-11-07",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-11-07/writtens/mul@/dbsect_1144.xml"
            }
          },
          "debateSectionId": "dbsect_1144",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-11-07/writtens/dbsect_1144",
          "showAs": "Dental Services "
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-11-07/pq_1219",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1219,
        "showAs": " 1219. Deputy Dara Calleary asked the Minister for Health to provide an update on the national school dentist scheme for 6th class children who have yet to be seen by a school dentist due to Covid (details supplied). [48095/23] ",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-11-07",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2023-10-25",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-10-25/writtens/mul@/dbsect_134.xml"
            }
          },
          "debateSectionId": "dbsect_134",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-10-25/writtens/dbsect_134",
          "showAs": "Septic Tanks"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-10-25/pq_118",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 118,
        "showAs": " 118. Deputy Dara Calleary asked the Minister for Housing, Local Government and Heritage if grants are available for inspected and condemned septic tanks that were not registered with a local authority in 2013 but have been registered in 2023, at a cost of €50. [46994/23] ",
        "answerText": " Minister for Housing, Local Government and Heritage  There are currently three Domestic Waste Water Treatment Systems (DWWTS) grant schemes, commonly known as Septic Tank Grants, available to householders. The purpose of the grants is to provide financial assistance to householders to repair or upgrade septic tanks including those that fail inspections by a local authority.  I can confirm that my Department, in consultation with key stakeholders, have completed a review of the three grant schemes. The review process included extensive consultation with stakeholders in the Rural Water Sector to identify where improvements could and should be made to the terms and conditions of the grants.  I expect to make an announcement on the outcome of the review in the coming weeks. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-10-25",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2023-10-24",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-10-24/writtens/mul@/dbsect_572.xml"
            }
          },
          "debateSectionId": "dbsect_572",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-10-24/writtens/dbsect_572",
          "showAs": "Further and Higher Education"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-10-24/pq_628",
        "to": {
          "roleType": null,
          "showAs": "Further and Higher Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 628,
        "showAs": " 628. Deputy Dara Calleary asked the Minister for Further and Higher Education, Research, Innovation and Science if he will re-examine the rules pertaining to traineeships at ETB centres, specifically to allow school-levers enrolling on such courses to access the training allowance without being bound by the rule that states they must have been in receipt of a social welfare payment; if he agrees that his rule is very prohibitive and sends out the wrong message about work and training; and if he will make a statement on the matter. [46073/23] ",
        "answerText": " Minister of State at the Department of Further and Higher Education, Research, Innovation and Science  Traineeships are full-time programmes, between 6 and 20 months, offering occupation-specific training combining formal classroom training and workplace coaching. They are open to all potential participants, of all ages and backgrounds, and are free of charge to participants. Trainees may include school leavers, older learners, those in employment and those who are unemployed.  To qualify for a training allowance while pursuing a Traineeship programme, a person must have been in receipt of a qualifying social welfare payment. The Indecon Review of the Student Grant Scheme noted the range of student supports in the FET system, via the SUSI PLC grants for those on PLC courses and via the ETB training allowances based on a learner’s previous social welfare entitlement depending for a range of other courses, as well as the VTOS and BTEA schemes where learners retain their social welfare entitlements while pursuing certain courses. The Review recommended that consideration be giving to streamlining the system of financial supports available to students in FET and Higher Education. As a first phase of such an approach, it recommended a review and streamlining of financial supports available to FET students.  Against this background, provision is made in Budget 2024 to provide for the removal of PLC fees across the ETB sector, with effect from September 2024. This will ensure a consistency of support for learners and school leavers across the country and remove financial barriers to participation.  As noted in my Department’s options paper on the cost of higher education, published earlier this year, it is proposed to commence a review of the financial supports available to FET learners as recommended in the Indecon Review. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-10-24",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2023-10-24",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-10-24/writtens/mul@/dbsect_584.xml"
            }
          },
          "debateSectionId": "dbsect_584",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-10-24/writtens/dbsect_584",
          "showAs": "Budget 2024"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-10-24/pq_642",
        "to": {
          "roleType": null,
          "showAs": "Further and Higher Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 642,
        "showAs": " 642. Deputy Dara Calleary asked the Minister for Further and Higher Education, Research, Innovation and Science if students returning to third level education to complete a degree at the same level as one previously attained, but four years ago, are eligible for the reduction in student contribution as announced in Budget 2024; and if he will make a statement on the matter. [46336/23] ",
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  Budget 2024 contains a package of measures to support households with the cost of living. These cost of living measures include a €1,000 reduction in the student contribution fee for higher education students applies to those students who are eligible for the free fees initiative (FFI).  Under the FFI students are not typically supported for a repeat period of study or for a different course at the same level. The once off student contribution support of €1,000 therefore cannot apply to students undertaking a new undergraduate course of study if that period of study is not eligible for the free fees scheme in this academic year. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-10-24",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly. ",
        "questionNumber": 522,
        "debateSection": {
          "debateSectionId": "dbsect_526",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-10-17/writtens/mul@/dbsect_526.xml"
            },
            "pdf": null
          },
          "showAs": "Covid-19 Pandemic",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-10-17/writtens/dbsect_526"
        },
        "showAs": " 522. Deputy Dara Calleary asked the Minister for Health for details on non-payment of the pandemic payment to a company (details supplied). [44805/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-10-17/pq_522",
        "by": {
          "showAs": "Dara Calleary",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14",
          "memberCode": "Dara-Calleary.D.2007-06-14"
        },
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "date": "2023-10-17",
        "questionType": "written",
        "house": {
          "houseCode": "dail",
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseNo": "33",
          "chamberType": "house",
          "committeeCode": ""
        }
      },
      "contextDate": "2023-10-17"
    },
    {
      "contextDate": "2023-10-10",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-10-10/writtens/mul@/dbsect_513.xml"
            }
          },
          "debateSectionId": "dbsect_513",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-10-10/writtens/dbsect_513",
          "showAs": "General Practitioner Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-10-10/pq_525",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 525,
        "showAs": " 525. Deputy Dara Calleary asked the Minister for Health for an update on the non-EU doctor scheme; how many GPs have been recruited to date; to provide a breakdown, by county, of the number and location of GPs recruited; how many more are planned to be recruited in 2023 and 2024; the criteria for placement of recruited doctors across the country; what the national average of GPs-to-CHO population in the State currently stands at; and if he will make a statement on the matter. [43746/23] ",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-10-10",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2023-10-10",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-10-10/writtens/mul@/dbsect_596.xml"
            }
          },
          "debateSectionId": "dbsect_596",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-10-10/writtens/dbsect_596",
          "showAs": "Departmental Funding"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-10-10/pq_614",
        "to": {
          "roleType": null,
          "showAs": "Rural",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 614,
        "showAs": " 614. Deputy Dara Calleary asked the Minister for Rural and Community Development the position regarding grant funding for a mens' shed in Mayo which was announced in November 2022 (details supplied). [43777/23] ",
        "answerText": " Minister for Rural and Community Development  In November 2022, I was delighted to announce funding of €800,000 to support Men’s Sheds throughout the country with running costs, such as electricity and insurance bills. The individual grants were distributed to the Men’s Sheds via its representative body, the Irish Men’s Sheds Association (IMSA).  Officials in my Department have informed me the IMSA are currently in direct contact with the Men’s Shed the Deputy refers to relating to details of their funding application.  Separately, Men's Sheds were eligible to apply for funding under the Community Support Fund (CSF) that was announced last November under the Community Enhancement Programme (CEP).  The €10 million CSF was set up to help small community groups with their energy/running costs but also to provide funding for small capital works projects. The CSF is now closed and details of successful Men’s Sheds is available at www.gov.ie/DRCD. Since 2018, over €2.2 million in funding was allocated to Men’s Sheds under the CEP.  Groups are encouraged to engage with their Local Community Development Committees (LCDCs), Local Development Companies and Public Participation Networks (PPN) to ensure they are aware of funding opportunities as they become available. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-10-10",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2023-10-03",
      "question": {
        "showAs": " 579. Deputy Dara Calleary asked the Minister for Health the reason there are significant delays in COS Scheme - Community Opthalmic Physicians employed by HSE. [42205/23] ",
        "to": {
          "roleCode": null,
          "roleType": null,
          "uri": null,
          "showAs": "Health"
        },
        "questionNumber": 579,
        "date": "2023-10-03",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "house": {
          "houseCode": "dail",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "committeeCode": "",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-10-03/pq_579",
        "by": {
          "showAs": "Dara Calleary",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14",
          "memberCode": "Dara-Calleary.D.2007-06-14"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-10-03/writtens/mul@/dbsect_511.xml"
            }
          },
          "showAs": "Health Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-10-03/writtens/dbsect_511",
          "debateSectionId": "dbsect_511"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2023-09-20",
      "question": {
        "questionType": "written",
        "date": "2023-09-20",
        "showAs": " 529. Deputy Dara Calleary asked the Minister for Housing, Local Government and Heritage if a person can apply for the local authority home loan if ground works have already started. [40330/23] ",
        "questionNumber": 529,
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "house": {
          "chamberType": "house",
          "houseNo": "33",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-09-20/pq_529",
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-09-20/writtens/mul@/dbsect_474.xml"
            }
          },
          "debateSectionId": "dbsect_474",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-09-20/writtens/dbsect_474",
          "showAs": "Housing Schemes"
        },
        "by": {
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "showAs": "Dara Calleary",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        },
        "answerText": " Minister for Housing, Local Government and Heritage  The Local Authority Home Loan is a Government-backed mortgage for creditworthy applicants who cannot get sufficient funding from commercial banks to purchase or build a home. It has been available nationwide from local authorities since 4 January 2022 for first-time buyers and fresh start applicants. The loan can be used both for new and second-hand properties, or to self-build.Applications for a Local Authority Home Loan for the purposes of funding a self-build property will only be considered in circumstances where the security property in question is a new construction, i.e. properties that are part-built or otherwise commenced at the time of making a Local Authority Home Loan application will not be eligible for consideration.The final decision on loan approval is a matter for each local authority and its Credit Committee on a case-by-case basis. Decisions on all housing loan applications must be made in accordance with the statutory credit policy that underpins the scheme, in order to ensure consistency of treatment for all applicants. Loan applicants who are dissatisfied with a loan application decision of a local authority Credit Committee may appeal that decision to the local authority. Each local authority will have an appeals procedure to allow dissatisfied applicant(s) to appeal a loan application decision of the Credit Committee. "
      }
    },
    {
      "contextDate": "2023-07-25",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-07-25/writtens/mul@/dbsect_627.xml"
            }
          },
          "debateSectionId": "dbsect_627",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-07-25/writtens/dbsect_627",
          "showAs": "Departmental Policies"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-07-25/pq_677",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 677,
        "showAs": " 677. Deputy Dara Calleary asked the Minister for Social Protection if there are plans to continue paying child benefit beyond the age of 18 years when the person is in full-time education. [35713/23] ",
        "answerText": " Minister for Social Protection  Child Benefit is a universal monthly payment made to families with children up to the age of 16 years.  The payment continues to be paid in respect of children until their eighteenth birthday who are in full-time education, or who have a disability.  Estimated expenditure on the scheme will be approximately €2.1 billion in 2023.  There are currently no plans to extend Child Benefit in respect of students in full time education who are over 18 years of age.  Such an extension would have significant cost implications and would have to be considered in an overall budgetary context.  Families on low incomes may be able to avail of a number of social welfare schemes that support children in full-time education until the age of 22, including:  • Increase for a Qualified Child (IQCs) with primary social welfare payments;  • the Working Family Payment for low-paid employees with children; and  • the Back to School Clothing and Footwear Allowance.  These schemes provide targeted assistance that is directly linked to household income and thereby support low-income families with older children participating in full-time education.  I trust this clarifies matters for the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-07-25",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2023-07-25",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-07-25/writtens/mul@/dbsect_1026.xml"
            }
          },
          "debateSectionId": "dbsect_1026",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-07-25/writtens/dbsect_1026",
          "showAs": "Medicinal Products"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-07-25/pq_1117",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1117,
        "showAs": " 1117. Deputy Dara Calleary asked the Minister for Health if there are plans to add a condition (details supplied) to the long-term illness scheme. [35732/23] ",
        "answerText": " Minister for Health  The Long-Term Illness (LTI) Scheme was established under Section 59(3) of the Health Act 1970 (as amended).  Regulations were made in 1971, 1973 and 1975, prescribing 16 illnesses covered by the Scheme. These are: acute leukaemia; mental handicap; cerebral palsy; mental illness (in a person under 16); cystic fibrosis; multiple sclerosis; diabetes insipidus; muscular dystrophies; diabetes mellitus; parkinsonism; epilepsy; phenylketonuria; haemophilia; spina bifida; hydrocephalus; and conditions arising from the use of Thalidomide.  Under the LTI Scheme, patients receive drugs, medicines, and medical and surgical appliances directly related to the treatment of their illness, free of charge.  While there are currently no plans to extend the list of conditions, it is important to remember that the LTI Scheme exists within a wider eligibility framework.  This Government has put a significant focus on improving access to and the affordability of healthcare services, advancing substantial policy, legislation and investment to deliver expanded eligibility.  In 2022, a range of measures were delivered including the abolition of public inpatient charges for children, reductions in the Drug Payment Scheme threshold to €80 per month, and the introduction of free contraception for women aged 17-25.  The significant investment in Budget 2023 will facilitate better access to affordable, high-quality healthcare for people at a time when the cost-of-living crisis is impacting on everyone. In 2023 this includes:  - an expansion of GP care without charges to children aged under 8, and to people earning no more than the median household income,  - the abolition of all public in-patient hospital charges for adults since 17 April 2023,  an extension of free contraception to 26-year-old women since 1 Jan 2023, and further extension to 27-30 years old women from 1 September 2023.  These measures continue to create a health and social care service that offers affordable access to quality healthcare.  People who cannot, without undue hardship, arrange for the provision of medical services for themselves and their dependants may be eligible for a medical card under the General Medical Services (GMS) Scheme. In accordance with the provisions of the Health Act 1970 (as amended), eligibility for a medical card is determined by the HSE. Medical card eligibility is primarily based on an assessment of means and is not granted on the basis of any particular condition.  In certain circumstances the HSE may exercise discretion and grant a medical card, even though an applicant exceeds the income guidelines, where he or she faces difficult financial circumstances, such as extra costs arising from illness. In circumstances where an applicant is still over the income limit for a medical card, they are then assessed for a GP visit card, which entitles the applicant to GP visits without charge.  Under the Drug Payment Scheme (DPS), no individual or family pays more than €80 a month towards the cost of approved prescribed medicines. The DPS is not means tested and is available to anyone ordinarily resident in Ireland. The DPS significantly reduces the cost burden for families and individuals with ongoing expenditure on medicines.  Individuals may also be entitled to claim tax relief on the cost of their medical expenses, including medicines prescribed by a doctor, dentist, or consultant. Relief is at the standard tax rate of 20%. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-07-25",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2023-07-12",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-07-12/writtens/mul@/dbsect_271.xml"
            }
          },
          "debateSectionId": "dbsect_271",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-07-12/writtens/dbsect_271",
          "showAs": "Health Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-07-12/pq_247",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 247,
        "showAs": " 247. Deputy Dara Calleary asked the Minister for Health if his Department has considered the introduction of a text messaging reminder service for HSE appointments; if he will agree that the degree of missed appointments is posing a strain to HSE services and resources; and if he will make a statement on the matter. [34503/23] ",
        "answerText": " Minister for Health  Text messaging for reminding patients of upcoming appointments is already quite widely used across the health system and was, as the Deputy correctly point out, introduced as a mechanism to try and reduce missed appointments (DNA's / Did Not Attends). Deployment of text reminders has typically been driven by individual hospitals in areas where they felt it had the greatest potential. The HSE has also deployed a solution from Swiftqueue whereby people can book (within certain parameters) appointment dates and times that they know will work for them - again in an effort to modernise the health system and reduce the likelihood of a missed appointment. The HSE can provide more detail on what sites have deployed text reminders. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-07-12",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2023-07-11",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-07-11/writtens/mul@/dbsect_102.xml"
            }
          },
          "debateSectionId": "dbsect_102",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-07-11/writtens/dbsect_102",
          "showAs": "Foreign Birth Registration"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-07-11/pq_123",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 123,
        "showAs": " 123. Deputy Dara Calleary asked the Tánaiste and Minister for Foreign Affairs for an update on a foreign birth register application (details supplied). [34339/23] ",
        "answerText": " Tánaiste and Minister for Foreign Affairs  Foreign Birth Registration (FBR) applications are currently being processed within the normal turnaround time of between 6 and 9 months from receipt of supporting documents. Applications that require further supporting documents will take longer to process. Foreign Birth Registration, by its nature, is a detailed and complex process, often involving official documentation relating to three generations and issued by several jurisdictions. Such documents take considerable time to validate.  With regard to the specific FBR application about which the Deputy has enquired, this application was received by the Department on 28 February 2023. The Department is on schedule to process this application on time. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-07-11",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2023-07-11",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-07-11/writtens/mul@/dbsect_734.xml"
            }
          },
          "debateSectionId": "dbsect_734",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-07-11/writtens/dbsect_734",
          "showAs": "Health Services Staff"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-07-11/pq_810",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 810,
        "showAs": " 810. Deputy Dara Calleary asked the Minister for Health if he is aware that Irish physiotherapists who achieved qualifications in EU countries such as the Netherlands are unable to register with CORU; if he is aware that in order to register with CORU such qualified persons require 210 hours in cardiorespiratory physiotherapy completed in an acute hospital setting in the Republic of Ireland; if he will acknowledge that attaining such placements is increasingly impossible for such persons; if he will outline any changes in policy that his Department is pursuing in an effort to rectify this issue; and if he will make a statement on the matter. [34106/23] ",
        "answerText": " Minister for Health  As the Deputy will be aware, CORU is Ireland's multi-profession health regulator with responsibility for regulating health and social care professionals. CORU’s role is to protect the public by regulating the health and social care professions designated under the Health and Social Care Professionals Act 2005 (as amended), including setting the standards that health and social care professionals must meet to be eligible for registration and maintaining registers of persons who meet those standards.  There are two forms of application to CORU: applications for the recognition of qualifications received outside the State and applications for registration. Professional qualifications awarded outside the State are assessed through a process of “recognition” which involves expert assessment of a qualification’s alignment with the standards of proficiency required in Ireland, and assessment of professional experience and lifelong learning where required.  This involves an assessment which is undertaken on a case-by-case basis by academic and professional assessors which seeks to determine the alignment between an applicant’s qualification and the standards of proficiency required in Ireland. If deficiencies in the qualification are identified, an applicant’s post-qualification training and professional work experience will be considered. If deficits remain, an applicant will be offered a choice between compensation measures: a period of adaptation or an aptitude test.  In total CORU have received 27 applications for recognition of physiotherapy qualifications from applicants who have studied in the Netherlands since 2017. Of these, 18 applicants have had their qualifications recognised by the Physiotherapists Registration Board and have progressed to application for statutory registration by the Physiotherapists Registration Board at CORU.  The breakdown of applicants per year is as follows:     Year    Number of Applicants      2017    4      2018    2      2019    2      2020    4      2021    4      2022    1      2023    1      Total    18     Below is a table of applicants who were required to complete a compensation measure, of which 6 have successfully completed the period of adaptation and have moved onto registration.     Year    Compensation Measure    Recognised post Compensation Measure      2017    1    1      2018    1    0      2019    3    1      2020    2    2      2021    3    1      2022    4    1      2023    1    0      Total    15    6     If substantial deficits are identified against the standards of proficiency (i.e. the minimum standards required for entry to the register of physiotherapists) in any area (for example, cardiorespiratory), a compensation measure will be required. Hours required are decided by the Registration Board based on consideration of all relevant information, including the number of hours required for a professional to be competent to safely practice in that area.  This information is available publicly on the international qualifications section of the CORU website and any professional who wishes to complete or has completed a qualification outside the State should ensure they read the requirements for recognition to ensure they are aware of the standards of proficiency, and what standards they will need to meet if they wish to return to and work in the State.  Applicants who are required to undertake a compensation measure have the option to:  • Complete the period of adaptation required;  • Undertake an aptitude test to address the deficits identified;  • Appeal the Physiotherapist Registration Board Decision;  • Reapply for recognition with further information provided.  Whilst it is not within CORU’s remit to secure adaptation periods for applicants, CORU is in the process of developing an initiative with health care providers to develop supports for applicants undertaking adaptation periods. This initiative is in the final stages of development and CORU expect to commence this support for applicants in the coming months. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-07-11",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2023-07-04",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-07-04/writtens/mul@/dbsect_503.xml"
            }
          },
          "debateSectionId": "dbsect_503",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-07-04/writtens/dbsect_503",
          "showAs": "Pharmacy Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-07-04/pq_617",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 617,
        "showAs": " 617. Deputy Dara Calleary asked the Minister for Health if consideration will be given to the restoration of pharmacy fees slashed under FEMPI; if he will acknowledge that pharmacies are under threat as a result of the failure to restore fees; and if he will make a statement on the matter. [32379/23] ",
        "answerText": " Minister for Health  I propose to take Questions Nos. 552, 561, 567, 577, 617, 619, 620, 638, 650, 651, 652 and 653 together.  I recognise the significant role community pharmacists play in the delivery of patient care and acknowledge the potential for this role to be developed further in the context of healthcare service reform.  In that regard, various approaches to extending the scope of practice of community pharmacists are being progressed by my Department. The implementation of these necessitates engagement with a range of stakeholders and full consideration of all the relevant legislative and operational issues involved.  The regulations governing the pharmacy fee structure are set out in the Public Service Pay and Pensions Act 2017 (No. 34 of 2017) and in S.I. No. 639 of 2019, the Public Service Pay and Pensions Act 2017 (Payments to Community Pharmacy Contractors) Regulations 2019, which put the current fee structure in place, with effect from 1 January 2020.  Under Section 42(14) of the Public Service Pay and Pensions Act 2017 the pharmacy fee structure must be reviewed every third year after 2020. My Department is currently carrying out a review and Department officials have held a productive meeting with the Irish Pharmacy Union in that regard. Another meeting is scheduled to take place in July.  I believe that there is a real opportunity to work collaboratively with community pharmacists, and with other healthcare providers, to make a significant difference to patient outcomes. Of course, any publicly funded pharmacy service expansion should address unmet public healthcare needs, improve access to existing public health services, and provide better value for money. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-07-04",
        "by": {
          "showAs": "Dara Calleary",
          "memberCode": "Dara-Calleary.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dara-Calleary.D.2007-06-14"
        }
      }
    }
  ]
}