{
  "head": {
    "counts": {
      "questionCount": 3085,
      "resultCount": 3085
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister of State at the Department of Children, Disability and Equality  The Government recognises that there are unacceptable delays for children and families who have applied for Assessments of Need.  Under the Disability Act, an Assessment of Need is an assessment process carried out by the HSE where a person is of the opinion that he/she may have a disability, for anyone born after 1st June 2002.  It should be emphaised than an Assessment of Need is not required to access health services provided by Primary Care, Children’s Disability Network Teams or CAMH’s.  Nevertheless, demand for Assessments of Need have grown on an exceptional basis in recent years.  The HSE has provided data on the 870 overdue applications for Assessment of Need in Laois/Offaly broken down as follows:  • 6 months = 206 applications  • 9 months = 153 applications  • 12 months = 254 applications  • 18 months = 257 applications  Significant efforts have been made to increase the completion rates of Assessments of Need in Laois Offaly. This is reflected in the completion of 172 Assessment Reports in the first 3 quarters of 2025. This is a 45% year on year increase when compared to the same period in 2024.  However there has also been a continued growth in demand for an Assessment of Need in Laois/Offaly, increasing by 14% in the first 3 quarters of 2025, compared to the same period last year.  This continued growth in demand for Assessment of Need highlights the scale of the challenge we are facing not just in Laois/Offaly but also at a national level and the need for urgent reform to occur.  Last week, Government announced a series of reforms to the Assessment of Need process which will make the process more effective and efficient for children and families. Over time, this should lead to a reduction in the waiting time to receive an assessment.  This reform includes legislative and operational reforms to support the efficiency and effectiveness of the Assessment of Needs process.  The proposed legislative changes will not remove the right for parents to apply for an Assessment of Need for their child, nor will they alter the statutory six-month timeline set out in the Disability Act.  I want to assure the Deputy that the provision of an effective and efficient delivery of assessments of need remains a priority for the Government. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 28. Deputy Brian Stanley asked the Minister for Children, Disability and Equality the number of children in Laois and Offaly waiting more than 6, 9, 12 and 18 months to have an assessment of needs completed, in tabular form; and if she will make a statement on the matter. [72811/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "showAs": "Brian Stanley"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_70",
          "debateSectionId": "dbsect_70",
          "showAs": "Disabilities Assessments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_70.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_28",
        "questionNumber": 28
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 80. Deputy Brian Stanley asked the Minister for Children, Disability and Equality the greatest length of time a child is waiting in Laois-Offaly to have a referral for an assessment of needs, AON; and the greatest length of time currently to have an AON completed. [72810/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "showAs": "Brian Stanley"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_124",
          "debateSectionId": "dbsect_124",
          "showAs": "Disabilities Assessments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_124.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_80",
        "questionNumber": 80
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for funding the coach park in the Dublin City Docklands as referenced in the Deputy's query.  In light of the NTA's responsibility in this area, I have forwarded the Deputy's query to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 165. Deputy Brian Stanley asked the Minister for Transport if he will engage with the National Transport Authority regarding the closure of the coach park in the Docklands without sufficient notice to coach operators, and without any alternative location; and if he will make a statement on the matter. [73188/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "showAs": "Brian Stanley"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_160",
          "debateSectionId": "dbsect_160",
          "showAs": "National Transport Authority",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_160.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_165",
        "questionNumber": 165
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Defence (Deputy Helen McEntee)  Protecting undersea critical infrastructure requires a multifaceted approach with different capabilities working in coordination to firstly detect an undersea threat, localise it, classify it and track it as it moves through the water. The Government has committed to measures to safeguard undersea critical infrastructure and the Department of Defence and the Defence Forces have a significant body of work underway in that regard.  In relation to subsea domain awareness capabilities, a programme of work has been approved as part of the overall Equipment Development Plan. As part of the NDP Plan for the Defence Forces which I published last week, investment in sonar capability is being prioritised as the first project which will see the Naval Service acquire sonar capability which will be used to detect objects near cables and pipelines in Irish territorial waters and the EEZ. This new acquisition will enhance awareness below the surface, contributing to the overall maritime picture available to Naval Service and the wider Defence Forces. This is a complex project and a new capability, so work in training personnel and establishing the procedures and structures required within the Defence Forces has commenced, and will continue in the period up to the delivery and operationalisation of the system.  A second project within that subsea programme of work has commenced. This project will result in a new Air Corps capability which can be used to detect, localise, identify, and track objects in the Irish EEZ. This capability will be used in conjunction with the new towed sonar capability planned for delivery in 2027, and also with existing Air Corps assets.  In the longer term, my department is preparing a Capability Development Programme which will identify at a high level, the capability requirements for the Defence Forces out to 2040 across all domains of operation including the subsea domain. This ongoing piece of work, once complete, will inform the prioritisation of capabilities the Defence Forces will progress in moving towards the strategic level of ambition set out in the Defence Policy Review. This will be in line with the capital allocation under the National Development Plan. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 102. Deputy Brian Stanley asked the Minister for Defence the work that is being carried out to improve the technology, such as radar equipment, which needs to be made available to the Naval Service to protect undersea cables and critical infrastructure around the coast; and if she will make a statement on the matter. [71892/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "showAs": "Brian Stanley"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_43",
          "debateSectionId": "dbsect_43",
          "showAs": "Naval Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_43.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_102",
        "questionNumber": 102
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  While Ireland may be militarily neutral, we are not politically neutral and together with our EU partners, Ireland has been resolute in our response to Russia’s illegal, unjustifiable and morally reprehensible war against Ukraine.  I, and the rest of the Government are committed to working with our European and Ukrainian counterparts to maintain our solidarity with Ukraine and to ensure Ukraine gets the support it needs to defend itself against brutal Russian aggression.  Through our Military Representatives and Officials based in Brussels, my Department is kept informed of Ukraine’s support needs on an ongoing basis and actively explores ways in which Ireland can continue provide non-lethal support, including through the donation of equipment.  To date, the military equipment donated has included :  200 units of body armour delivered in March 2022  2 large de-mining vehicles (DOKING Mine Flails) in February 2023  65 vehicles delivered in June 2024 and September 2025 which included a Fire Truck, ambulances, trucks and minivans.  5 mobile radar defence systems (Giraffes) plus an additional 2 for spare parts delivered in June 2025  3 Demining Robots (Reachers) delivered in September 2025  All equipment donated to date has had no impact on the operational capacity of the Defence Forces and were otherwise exiting from service.  The Defence Forces are continually examining all potential opportunities to donate further equipment and vehicles to the Ukrainian Armed Forces.   Question No. 151 answered with Question No. 121.  ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 150. Deputy Brian Stanley asked the Minister for Defence the military equipment that has been transferred from the Irish Defence Forces to the Ukraine Armed Forces and government of Ukraine over the duration of the war since the invasion by Russia; and if she will make a statement on the matter. [71891/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "showAs": "Brian Stanley"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_88",
          "debateSectionId": "dbsect_88",
          "showAs": "Ukraine War",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_88.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_150",
        "questionNumber": 150
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 356, 357 and 358 together.  The Deputy has asked about deemed disposal. Deemed disposal is an anti-avoidance measure that applies to investments in Irish domiciled investment funds and life assurance products, as well as equivalent offshore funds and certain foreign life assurance products. Under the deemed disposal rule, tax is levied eight years after an investment is made, and every subsequent eight years, regardless of whether or not a disposal has in fact occurred. The tax is levied on any gain in the value of the investment from the date of acquisition to the date of the deemed disposal. On the ultimate disposal of the investment, any tax paid is allowed as a credit against the final tax liability. The purpose of deemed disposal is to prevent the indefinite roll-up of income and gains and the associated loss of tax to the Exchequer. Under the Irish system pension savings grow tax free until drawdown. Therefore, deemed disposal does not apply to pension funds and products.  Across Member States there are many different approaches to the taxation of investments, including in some instances a savings and investment account with its own specific tax treatment. This range of approaches was considered by the European Commission in developing their Recommendation on savings and investment accounts in September 2025. The recommendation provides a European blueprint for savings and investment accounts, and its publication was welcomed by Ireland.  The Deputy maybe aware that Finance Bill 2025 provides for a reduction in the taxation rate that applies to Irish and equivalent offshore funds, and Irish and certain foreign life assurance products, from 41% to 38%, intended as an important first step in supporting retail investment in Ireland.  I am conscious of the need for further adaptation of the existing complex system which applies to the taxation of investments, and I hope that further progress can be made across coming budgets to address some of the existing obstacles to greater retail investment. To this end Budget 2026 included the announcement of the publication of a roadmap for retail investment in early 2026. Work is underway on this roadmap, which will set out an approach to simplify and adapt the tax framework to further support retail investment. This roadmap will facilitate due consideration of the Funds Sector 2030 Report and the European Commission’s recommendation on Savings and Investment Accounts. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 356. Deputy Brian Stanley asked the Tánaiste and Minister for Finance when he intends to abolish the deemed disposal regime applicable to investment funds; the timeline for implementing the recommendations of the Funds Sector 2030 Report in this regard; and if he will make a statement on the matter. [71372/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "showAs": "Brian Stanley"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_258",
          "debateSectionId": "dbsect_258",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_258.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_356",
        "questionNumber": 356
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 356, 357 and 358 together.  The Deputy has asked about deemed disposal. Deemed disposal is an anti-avoidance measure that applies to investments in Irish domiciled investment funds and life assurance products, as well as equivalent offshore funds and certain foreign life assurance products. Under the deemed disposal rule, tax is levied eight years after an investment is made, and every subsequent eight years, regardless of whether or not a disposal has in fact occurred. The tax is levied on any gain in the value of the investment from the date of acquisition to the date of the deemed disposal. On the ultimate disposal of the investment, any tax paid is allowed as a credit against the final tax liability. The purpose of deemed disposal is to prevent the indefinite roll-up of income and gains and the associated loss of tax to the Exchequer. Under the Irish system pension savings grow tax free until drawdown. Therefore, deemed disposal does not apply to pension funds and products.  Across Member States there are many different approaches to the taxation of investments, including in some instances a savings and investment account with its own specific tax treatment. This range of approaches was considered by the European Commission in developing their Recommendation on savings and investment accounts in September 2025. The recommendation provides a European blueprint for savings and investment accounts, and its publication was welcomed by Ireland.  The Deputy maybe aware that Finance Bill 2025 provides for a reduction in the taxation rate that applies to Irish and equivalent offshore funds, and Irish and certain foreign life assurance products, from 41% to 38%, intended as an important first step in supporting retail investment in Ireland.  I am conscious of the need for further adaptation of the existing complex system which applies to the taxation of investments, and I hope that further progress can be made across coming budgets to address some of the existing obstacles to greater retail investment. To this end Budget 2026 included the announcement of the publication of a roadmap for retail investment in early 2026. Work is underway on this roadmap, which will set out an approach to simplify and adapt the tax framework to further support retail investment. This roadmap will facilitate due consideration of the Funds Sector 2030 Report and the European Commission’s recommendation on Savings and Investment Accounts. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 357. Deputy Brian Stanley asked the Tánaiste and Minister for Finance if he has assessed the impact of the deemed disposal regime on ordinary retail investors and pension savers; if he accepts that the requirement to pay tax on unrealised gains penalises long term saving and undermines financial planning for households; the way in which the recommendations of the Funds Sector 2030 Report will address these concerns; and if he will make a statement on the matter. [71373/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "showAs": "Brian Stanley"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_258",
          "debateSectionId": "dbsect_258",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_258.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_357",
        "questionNumber": 357
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 356, 357 and 358 together.  The Deputy has asked about deemed disposal. Deemed disposal is an anti-avoidance measure that applies to investments in Irish domiciled investment funds and life assurance products, as well as equivalent offshore funds and certain foreign life assurance products. Under the deemed disposal rule, tax is levied eight years after an investment is made, and every subsequent eight years, regardless of whether or not a disposal has in fact occurred. The tax is levied on any gain in the value of the investment from the date of acquisition to the date of the deemed disposal. On the ultimate disposal of the investment, any tax paid is allowed as a credit against the final tax liability. The purpose of deemed disposal is to prevent the indefinite roll-up of income and gains and the associated loss of tax to the Exchequer. Under the Irish system pension savings grow tax free until drawdown. Therefore, deemed disposal does not apply to pension funds and products.  Across Member States there are many different approaches to the taxation of investments, including in some instances a savings and investment account with its own specific tax treatment. This range of approaches was considered by the European Commission in developing their Recommendation on savings and investment accounts in September 2025. The recommendation provides a European blueprint for savings and investment accounts, and its publication was welcomed by Ireland.  The Deputy maybe aware that Finance Bill 2025 provides for a reduction in the taxation rate that applies to Irish and equivalent offshore funds, and Irish and certain foreign life assurance products, from 41% to 38%, intended as an important first step in supporting retail investment in Ireland.  I am conscious of the need for further adaptation of the existing complex system which applies to the taxation of investments, and I hope that further progress can be made across coming budgets to address some of the existing obstacles to greater retail investment. To this end Budget 2026 included the announcement of the publication of a roadmap for retail investment in early 2026. Work is underway on this roadmap, which will set out an approach to simplify and adapt the tax framework to further support retail investment. This roadmap will facilitate due consideration of the Funds Sector 2030 Report and the European Commission’s recommendation on Savings and Investment Accounts. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 358. Deputy Brian Stanley asked the Tánaiste and Minister for Finance if he has examined the way in which the deemed disposal regime places Ireland at a disadvantage compared to other EU member states where investors are not taxed on unrealised gains; the way in which the Funds Sector 2030 Report proposes to align Ireland's framework with international best practice; and if he will make a statement on the matter. [71374/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "showAs": "Brian Stanley"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_258",
          "debateSectionId": "dbsect_258",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_258.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_358",
        "questionNumber": 358
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The baseline income thresholds increased by €5,000 for all local authorities with effect from 1 January 2023. The thresholds thus increased to €40,000, €35,000 and €30,000 for Bands 1, 2 and 3 respectively. These thresholds are net income thresholds, i.e. gross household income less income tax, PRSI, Universal Social Charge and Additional Superannuation Contribution. Income is defined and assessed according to a standard Household Means Policy. The Policy provides for a range of income disregards and local authorities also have discretion to disregard income that is once-off, temporary or short-term in nature and which is outside the regular pattern of a person’s annual income.    My Department has been examining the existing income limits in the context of current market and household income conditions, including the suitability or otherwise of the current framework having regard to the significantly changed landscape since the standardised income limits were introduced. This includes examining the findings of research commissioned by my Department and this work is ongoing.  I am not in a position at this point to indicate the outcome of these considerations but I envisage that the analysis will be concluded early in 2026 to facilitate a final determination on next steps. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 561. Deputy Brian Stanley asked the Minister for Housing, Local Government and Heritage further to Parliamentary Question No. 16 of 15 May 2025, if he will provide an update on the research being undertaken to develop a new social housing eligibility model; if this research has progressed further; whether consultation with stakeholders has commenced; if, arising from this research, there will be any increase to social housing income thresholds in line with commitments under the Housing for All Action Plan; and if he will make a statement on the matter. [71624/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "showAs": "Brian Stanley"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_442",
          "debateSectionId": "dbsect_442",
          "showAs": "Housing Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_442.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_561",
        "questionNumber": 561
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The project to which the Deputy refers has been devolved for delivery to Laois and Offaly Education and Training Board (LOETB).  The project brief provides for a 1,000 pupil post primary school plus a six classroom Special Educational Needs (SEN) base .  The project is currently at Stage 2b of the architectural design process. This allows for detailed design and planning, obtaining the necessary statutory permissions and the preparation of tender documents. A Planning Permission application is currently with Laois County Council.  While at this early stage it is not possible to provide a timeline for completion of this project, LOETB will continue to engage directly with the school authorities to keep them fully informed of progress on this important project.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs.  In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  The current status of all projects is listed on a county-by-county basis at www.gov.ie. under item number 10 and this is updated on a regular basis to reflect project progress through the various stages of capital appraisal, site acquisition, design, tender and construction. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 121. Deputy Brian Stanley asked the Minister for Education and Youth to accelerate the building project for a school (details supplied), as demand for school places in the locality continues to grow; and if she will make a statement on the matter. [70773/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "showAs": "Brian Stanley"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_144",
          "debateSectionId": "dbsect_144",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_144.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_121",
        "questionNumber": 121
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  This Government is fully committed to ensuring that every child has a positive school experience, with access to qualified and engaged teachers who are dedicated to supporting their learning. This remains a top priority.  As with other sectors, recruitment challenges exist in some schools. ?To address teacher supply issues including the recruitment of substitutes, the Government has implemented several measures that have led to:????  • An increase of 20% in Initial Teacher Education graduates (student teachers)?between 2018 and 2023.?  • The Teaching Council reported 94,928 teachers registered in the 2016/17 school year increasing to 122,743 teachers registered in 2023/24. Currently, the Teacher Council have reported that there are over 127,000 on the register representing a 34% increase in the number of teachers registered between 2017 and now. ????  • Recent data showed there were over 79,000 qualified teachers employed in Ireland with over 43,000 at primary level including special schools.?  There are a range of measures in place to address teacher supply including improving the availability of substitutes to schools.  Substitutable leave absences may be filled by schools in several ways.? A substitute teacher may be recruited locally by a school, and a claim for payment for the teacher may be submitted to my Department, via the Online Claims System. Alternatively, the absence may be covered by schools under a number of schemes, which are managed locally by schools.?  The Supervision and Substitution Scheme allows for the supervision of students during breaks and before and after school and allows for substitution to cover certain categories of teacher absences. With effect from the beginning of the 2013/14 school year, participation in the Supervision and Substitution scheme is compulsory for teachers, save for those who had availed of the opt-out arrangements before this date.?All schools therefore provide cover for a significant number of substitutable absences, arising over the school year, through the Supervision and Substitution scheme.?  For primary schools, substitute teacher supply panels are also in place. For the 2025/26 school year, 587 substitute teacher supply posts have been allocated to 168 panels, covering 2,905 schools This scheme provides substitute cover for teachers employed in primary schools who are absent on short-term leave. Absences covered by the teacher supply panels are recorded locally by the schools and the schools are not required to claim for the substitutable leave to my Department.?  My Department has also continued the suspension of the usual limits on career break and job-sharing schemes to the current school year 2025/26 to increase the pool of teachers available to undertake substitute work in primary and post-primary schools.  Communications campaigns have also been run to encourage retired teachers to return to teaching and student teachers registered under Route 5 with the Teaching Council provide valuable substitution cover.  The Department is committed to addressing teacher supply introducing new measures to help teachers gain permanent roles more quickly and approving regulations recently to allow teachers who qualified overseas to undertake their induction in the State. Promotion of the teaching profession as a career continues and workforce planning for teachers is underway.  The teaching profession is highly attractive, with strong demand for teacher education programmes with over 1,800 newly qualified primary teachers registered with the Teaching Council in 2025 with over 127,000 on the register. Salaries are competitive, currently starting at €44,879 for primary teachers arising to €85,000 under the current pay deal.??? Few teachers resign: less than 3% of the teaching workforce resign or retire annually from contracted teaching posts.  Around 6% of first-choice CAO applications from 2017–2024 were for teaching, showing steady demand. In 2025, first preferences rose by 9% for primary teaching. 85% of newly appointed primary teachers in 2024/25 are on full-time, mostly fixed-term contracts and 93% of teachers with 5+ years’ experience hold permanent full-time or pro-rata contracts.  My Department frequently consults and engages closely with stakeholders including teacher unions on teacher supply issues through industrial relations forums, sectoral meetings, and direct discussions. I am considering further measures to strengthen the teaching workforce and ensure that schools have the support needed to provide an excellent education for every student.? ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 125. Deputy Brian Stanley asked the Minister for Education and Youth if she is aware that some schools are now facing up to a 60% crisis around getting a substitute teacher according to an organisation (details supplied), that is 336 schools saying they are finding this very difficult; the action her Department is taking to help alleviate this issue; and if she will make a statement on the matter. [61035/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "showAs": "Brian Stanley"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_148",
          "debateSectionId": "dbsect_148",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_148.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_125",
        "questionNumber": 125
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  In Co. Laois, there are currently four schools that are considered base schools for the Supply Panel system. These four schools have a total of eleven supply panel teaching positions covering short term substitution needs across 79 schools in Co. Laois.  In addition to the above, there would also be receiving schools in Co. Laois near county borders, whose base schools lie in other counties.  In forming the Supply Panel clusters, my Department's GIS system identified the receiving schools based on distance from the base school. Teaching posts were allocated to each Supply Panel cluster based on the number of permanent teaching positions in the schools in the cluster and the distance to the base school.  The information requested by the Deputy is attached. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 128. Deputy Brian Stanley asked the Minister for Education and Youth the number of panels which are in County Laois for substitute teachers; the number of teachers on each panel; the number of schools serviced by each panel; and if she will make a statement on the matter. [61036/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "showAs": "Brian Stanley"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_151",
          "debateSectionId": "dbsect_151",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_151.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_128",
        "questionNumber": 128
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  My Department is committed to expanding apprenticeship opportunities, supported by a significant investment of €79 million in 2026, bringing the total apprenticeship budget to over €410 million, more than double the level in 2020.  The choice of apprenticeships is expanding and range from skilled trades to ICT or social work. Recently, I launched apprenticeship number 78, the first ever all-island apprenticeship, the Accounting Technologist.  To encourage early engagement, the Initial Vocational Education and Training (iVET) module is now available to all Transition Year students. Developed by the NCCA, ETBI, and SOLAS, iVET provides hands-on exposure to vocational pathways through FET and apprenticeship taster courses, career talks, and workshops.  My Department also funds WorldSkills Ireland, an event that attracted over 30,000 students from more than 300 secondary schools nationwide, showcasing the talent and ambition of Ireland’s apprentices and highlighting the vital role of skills in building a future-ready workforce.  The Apprentice of the Year and Apprentice Employer of the Year awards celebrate excellence and highlight how apprenticeships address skills needs across sectors.  These efforts, combined with strong government investment, have delivered real results. Annual apprenticeship registrations have grown by 75%, from 5,326 in 2020 - the year my department was formed - to 9,352 in 2024. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 244. Deputy Brian Stanley asked the Minister for Further and Higher Education, Research, Innovation and Science the steps being taken by his Department to expand the number in apprenticeships and encourage more young people to take up apprenticeships; and if he will make a statement on the matter. [67777/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "showAs": "Brian Stanley"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_257",
          "debateSectionId": "dbsect_257",
          "showAs": "Apprenticeship Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_257.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_244",
        "questionNumber": 244
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I can confirm to the Deputy, that the Department recognises the limitations that a lack of indoor PE facilities places on the delivery of the PE curricula. However, it is important to note that almost 95% of the post primary schools, and over 70% of the primary schools that made 2020 Annual Schools Returns have indicated to the department that they either have a PE Hall, access to a nearby PE Hall, or a project in train that will deliver a new PE Hall. Practically all schools have outdoor play areas and many schools use adjacent local facilities, including community halls, public parks, playing fields and swimming pools.  Investment and expenditure on PE Halls is an element of the overall School Building Programme. The provision of GP rooms and PE Halls, at primary and post primary level respectively, and outdoor hard play areas, form part of the accommodation brief for all new school buildings. This is also the case where a major building or refurbishment project is being delivered for an existing school.  The main focus of the Department’s capital funding over the last decade and for the coming period is on provision of critical additional capacity to cater for increasing demographics and children with special education needs.  Since 2020, my Department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In addition, repurposing and optimisation of existing accommodation capacity across the school estate has been a key enabler of timely, local provision of special class capacity in a way that supports best practice in inclusion and integration. Circa 80% of new special classes in 2025/26 are being facilitated in repurposed classroom accommodation.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my Department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 404. Deputy Brian Stanley asked the Minister for Education and Youth if a sports hall will be provided for a school (details supplied); and if she will make a statement on the matter. [70917/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "showAs": "Brian Stanley"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_398",
          "debateSectionId": "dbsect_398",
          "showAs": "School Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_398.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_404",
        "questionNumber": 404
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Health  After a hearing in the Labor Court in June, it was recommended that a final extension of the current Special Scheme to the 31st of December 2025, at which point anyone remaining on the scheme should transition to the Public Service Sick Leave Scheme. Any employee of the public health sector remaining unwell beyond that date, may utilise the full provisions of the Public Service Sick Leave Scheme which will provide further support. Employees who did not qualify for the Special Scheme but are also impacted by Long-Covid may also utilise the supports of the sick leave scheme. The sick leave scheme provides full pay for three months, followed by half pay for three months, and after that, Temporary Rehabilitative Remuneration may be applied for, which, if granted, provides up to a further 547 days of paid leave. The Critical Illness Protocol that forms part of the sick leave scheme may also provide additional supports if granted. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 558. Deputy Brian Stanley asked the Minister for Health the way in which healthcare workers who will be deemed to be unfit for work due to long-Covid will be catered for when supports expire (details supplied); and if she will make a statement on the matter. [70875/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "showAs": "Brian Stanley"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_529",
          "debateSectionId": "dbsect_529",
          "showAs": "Covid-19 Pandemic Supports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_529.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_558",
        "questionNumber": 558
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Deputy Brian Stanley  Will the Minister consider granting funding to homecoming festivals in various locations in the country to promote tourism and increase investment, particularly in rural areas? What is his opinion on this? What supports can be provided? \n Deputy Dara Calleary  I thank the Deputy for his question. My Department implements a wide range of schemes and supports that are available to community organisations and groups across the country. While my Department does not have a scheme specifically for community or homecoming festivals, there may be an avenue of support under the LEADER programme or potentially the local enhancement programme.  In respect of the LEADER programme, in line with the programme for Government, LEADER has a strong focus on rural tourism and funding has been made available under the programme for festivals and local tourism initiatives. For example, I am sure the Deputy will be well aware of the Old Fort Quarter festival, which has been run very successfully in Portlaoise in recent years. That has received funding from LEADER.  In order for a project to be eligible for LEADER funding, the proposed activity must be compatible with the actions outlined in the approved LEADER local development strategy and comply with the EU regulations and operating rules. The programme is administered by the local action groups, LAGs, across the country. Prospective applicants organising festivals should contact their relevant LAG.  Moving to the local enhancement programme, which is run by the Minister of State, Deputy Buttimer, and me, this programme provides small capital grants to community and voluntary groups to improve facilities or purchase equipment. This may support groups that help run local festivals. We are finalising local enhancement programme for 2026 and will announce details of the new programme imminently. \n Deputy Brian Stanley  What the Minister said in the last couple of sentences, in relation to finalising plans for 2026, is timely. This is a great way of improving tourism and visitor numbers. As we all know, tourism figures are down this year and there are various reasons for that. Some of it is due to high prices being charged by some hotels and over-pricing, and the industry has to take that on board. The first homecoming festival was organised in Laois this year and it was a huge success. It took place on 4, 5 and 6 September. A lot of voluntary work and commitment go into these festivals and it is an area we need to target in terms of economic and tourism benefits. It also has community and family benefits, because people who had not seen each other for 50 years, in some cases, met again for the first time. The route to securing funding needs to be simplified. I take on board the point about the LEADER programme but it tends to be set. There are a lot of calls on it. A separate stream of funding needs to be made available for this. \n Deputy Dara Calleary  I absolutely appreciate the role of any festival or gathering in any rural community. That is why we support the rural shows to the extent of €1 million right across the country, with over 130 of them. Fáilte Ireland, which is the predominant domestic tourism development agency, has a range of schemes in place for supporting local festivals and local community events, as do the local authorities. As I said, the LEADER programme supports festivals. There is one in Portlaoise and others in Ballinakill, Cullahill and Spink, across the Deputy's county. The LEADER programme has a very good track record of supporting festivals across County Laois. I know there are a number of local authorities around the country that provide current funding for festivals in local areas as well.  We are more than happy to assist with capital funding through the LEADER programme, but given the existing level of support through Fáilte Ireland and other organisations, I have no plans to look at this proposal further at this point. \n Deputy Brian Stanley  I thank the Minister for his reply. I acknowledge the support given to the Old Fort Quarter festival and other projects in County Laois through the LEADER fund and I accept that. The key thing is that sometimes the information on what is available and where it can be accessed is unclear. I know some bureaucracy is necessary and it is important that money be accounted for properly and that things be done the right way. However, we need to try to streamline this. There can be a multitude of places to go to for funding but sometimes there is a fog in that regard. It needs to be kept very simple and straightforward. Maybe there could be something from the Department to state what is available. The Minister mentioned a number of avenues. Information is key for local communities to find out where to go for this. \n Deputy Dara Calleary  Absolutely. We did try to provide that information, but that feedback is coming back to me quite often, so we will consider a one-stop shop for that information. I acknowledge that it is predominantly volunteers who organise these festivals. These are people who are very busy elsewhere in their lives and are probably involved in multiple other organisations in their communities at the same time. We will try to ensure we have a one-stop shop to provide the information.  I wish to bring the attention of every Deputy here this morning to the fact we are finalising the current consultation on Our Rural Future, which is our scaffolding document for rural policy. The final date for submissions is 12 December, which is tomorrow week, and I encourage all Deputies to look at the current draft and to input into that review. If there are suggestions or proposals similar to those the Deputy has, every Deputy should try to make those and we will incorporate the views of Oireachtas Members into the document. It is the scaffolding document on which we will build projects and funding programmes over the next five years. ",
        "questionType": "oral",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 4. Deputy Brian Stanley asked the Minister for Rural and Community Development and the Gaeltacht if he will consider granting funding to homecoming festivals in various locations in the country in the interest of promoting tourism and increasing investment in rural areas; and if he will make a statement on the matter. [67914/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "showAs": "Brian Stanley"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/dbsect_6",
          "debateSectionId": "dbsect_6",
          "showAs": "Rural Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/mul@/dbsect_6.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_4",
        "questionNumber": 4
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 101, 376, 377 and 379 together.  I am focused on taking all necessary steps to manage the international protection process efficiently and effectively, while also ensuring the integrity of the system.  We know that a significant proportion of people who apply for international protection here in Ireland have entered over our shared land border with the UK. We must recognise however that, when my officials and I speak to our UK counterparts, they also express concern that many people are travelling in the opposite direction too: from Ireland, across the land border, and into the UK to claim asylum there.  It is true then that both Ireland and the UK have a common interest in the effective operation of the Common Travel Area (CTA) from a migration as well as from a security point of view and we work together to prevent any abuses of the CTA as well as to strengthen the external border of the CTA.  My Department is carrying out a joint risk assessment with the UK Home Office which will consider emerging trends which may impact operational and policy priorities. Its overarching aim is to inform policy making and operational prioritisation in line with our existing strategy to secure the external CTA border.  I would also add that, since my appointment as Minister for Justice, I have had a number of engagements with the then UK Home Secretary, Yvette Cooper, where we discussed cooperation in respect of managing the Common Travel Area, and our shared objectives to provide for effective management of migration and border security. I am looking forward to engaging with the current Home Secretary, Shabana Mahmood, in the coming weeks where this important engagement will continue.  I can assure the Deputy that I and the Government are aware that changes to the UK’s asylum practices or laws can result in changes to the migratory flows between the UK and Ireland. My officials and I will be closely monitoring any effect on trends in applications and will take any action necessary in close cooperation with the UK. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 101. Deputy Brian Stanley asked the Minister for Justice, Home Affairs and Migration the implications the change of rules by the British Government on immigration may have on the Irish State; the additional measures that will have to be put in place as a consequence of the changes; and if he will make a statement on the matter. [66650/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "showAs": "Brian Stanley"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_124",
          "debateSectionId": "dbsect_124",
          "showAs": "Immigration Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_124.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_101",
        "questionNumber": 101
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  In general, medical or health related benefits fall within the remit of the Department of Health and the HSE. However, my Department administers the treatment benefit scheme which provides certain dental, optical, and medical appliances benefits to insured workers, the self-employed and retired people who have the required number of PRSI contributions. These treatments are also available to an insured person's dependent spouse or partner, if applicable.  Under the medical appliance strand of the scheme, my Department pays the full cost of a hearing aid up to a maximum of €500 (€1,000 for a pair) once every 4 years for eligible persons. It will also pay the full cost of repairs to aids, up to a maximum of €100, once every 4 years.  There are currently no plans to change the eligibility requirements for the treatment benefit scheme. However, my Department keeps its range of supports under constant review in order to ensure they meet their objectives. Any changes to the current level of support would need to be considered in an overall policy and budgetary context. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 170. Deputy Brian Stanley asked the Minister for Social Protection if he will review and expand the level of support provided under the treatment benefit scheme for individuals requiring audiological supports, including hearing aids, or those living with congenital deafness given that lifetime costs for such supports can exceed €50,000 compared to the current €1,000 provision; and if he will make a statement on the matter. [68428/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "showAs": "Brian Stanley"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_161",
          "debateSectionId": "dbsect_161",
          "showAs": "Social Welfare Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_161.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_170",
        "questionNumber": 170
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Health  Ireland continues a strong tradition of providing humanitarian assistance, including through the Department of Foreign Affairs and Trade, Irish Aid humanitarian and development assistance programme and the HSE Global Health Programme.  In September 2024, a Government decision was made that Ireland would evacuate up to 30 paediatric patients from Gaza ( under 17 years of age ) and their carers out of Egypt, in response to the World Health Organisation's (WHO) request to activate the EU Civil Protection Mechanism (UCPM) to assist in addressing the Gaza healthcare needs through medical evacuation.  In July 2025, the Government amended the scope of the Gaza Medevac Initiative to allow family members of paediatric patients—parents, minor siblings, or adult dependent siblings of the patient —to obtain visas and permission to enter the State. The Government also agreed to examine other options in addition to Egypt for evacuation of paediatric patients from Gaza.  Since September 2024, Ireland has evacuated 19 paediatric patients and 84 accompanying family members in evacuations from Egypt in December 2024 and May 2025 and from Gaza via Jordan in October 2025.  Such medical evacuations are highly complex, and many factors are subject to challenging, shifting external circumstances. Considerable cooperation among a variety of international stakeholders is necessary to ensure safe and successful operations.  The Ministry of Health in Gaza has the primary role of selecting patients for overseas medical evacuation. In consultation with WHO and other partners, the Ministry for Health in Gaza follows a strict set of criteria for selecting patients to be evacuated.  Only paediatric patients are considered for the Irish Gaza Medevac Initiative. Paediatric patients are selected by the Health Service Executive (HSE) and Children’s Health Ireland (CHI) from the WHO medevac-approved list, strictly subject to treatment capacity in the HSE and CHI.  Once CHI has confirmed that the selection criteria are met, offers of medical evacuation are made. If accepted, relevant authorities work to secure all required documentation and permits to allow the patient and their family members to be evacuated. Plans are drawn up to carry out the complex medical evacuation in cooperation with key organisations on the ground and in Ireland.  This is the process that has been followed in all medical evacuations to date and which will inform all future medical evacuations carried out by Ireland under the Gaza Medevac Initiative. In addition, there are many elements of an evacuation that are not within the control of the WHO or the participating European countries.  My Department, the Department of Foreign Affairs and Trade (DFAT), the Department of Justice, Home Affairs and Migration, the Irish Red Cross, the HSE, CHI and international organisations will continue to work closely to deliver on the Government's commitment of evacuating up to 30 paediatric patients from Gaza and their families. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 248. Deputy Brian Stanley asked the Minister for Health if the Government will expand the scheme of medical treatment in Irish hospitals for children from Gaza; and if she will make a statement on the matter. [68254/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "showAs": "Brian Stanley"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_211",
          "debateSectionId": "dbsect_211",
          "showAs": "Hospital Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_211.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_248",
        "questionNumber": 248
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Health  Medical card provision is primarily based on financial assessment. In accordance with the Health Act 1970 (as amended), eligibility for a medical card is determined by the HSE, which assesses each application on a qualifying financial threshold. This is the amount of money that an individual can earn per week and still qualify for a card. It is specific to the individual’s own financial circumstances.  People under 70 are assessed under the general means tested medical card thresholds which are based on an applicant’s household income after deduction of tax, PRSI and Universal Social Charge. Certain expenses are also taken into account. People aged 70 or older are assessed under medical card income thresholds which are based on gross income. However, those aged over 70 can also be assessed under the general means tested scheme where there are particularly high medical costs. Detailed guidelines are available at: www2.hse.ie/services/schemes-allowances/medical-cards/applying/assessment/.  The issue of granting medical cards on the basis of illness or a disability was previously examined in 2014 by the HSE Expert Panel on Medical Need and Medical Card Eligibility. The Group concluded that it was not feasible, desirable, nor ethically justifiable to list medical conditions in priority order for medical card eligibility. In following the Expert Group’s advice, a person’s means remains the main qualifier for a medical card.  Every effort is made by the HSE, within the framework of the legislation, to support applicants in applying for a medical card and, in particular, to take full account of the difficult circumstances in the case of applicants who may be in excess of the income guidelines. The HSE may exercise discretion and grant a medical card, even though an applicant exceeds the income threshold where they face difficult financial circumstances, such as extra costs arising from an illness. Social and medical issues are also considered when determining whether undue hardship exists for an individual accessing general practitioner or other medical services.  I can assure the Deputy that, to ensure the medical card system is responsive and sensitive to people's needs, my Department keeps medical card issues under review and any changes are considered in the context of Government policy and other issues which may be relevant. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 268. Deputy Brian Stanley asked the Minister for Health if she will establish a pathway to ensure that individuals diagnosed with congenital deafness may qualify for a medical card on the basis of their diagnosis rather than solely through means assessment; and if she will make a statement on the matter. [68429/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "showAs": "Brian Stanley"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_229",
          "debateSectionId": "dbsect_229",
          "showAs": "Medical Cards",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_229.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_268",
        "questionNumber": 268
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I propose to take Questions Nos. 391 and 441 together.  I can advise the Deputy that there are currently seven overseas Visa Offices in addition to the Visa Office in Dublin. They are located in Abuja, Beijing, London, Moscow, Ankara, Abu Dhabi and New Delhi. In addition, the Department of Foreign Affairs and Trade process certain visa applications in Irish Embassies abroad under delegated sanction from my Department.  While processing times can vary across the different Visa Offices and Irish Embassies, the majority of visas are processed within stated target times.  The current processing times of applications for join family visas varies depending on the circumstances when the application is made. If a non-EEA national is moving to Ireland because they have been granted a Critical Skills Employment Permit they can apply for join family visas at the same time as their own employment visa. When these visas are applied for together, they are processed in tandem and are typically completed in under eight weeks. My Department aims to process join family visa applications made in other circumstances within 12 months.  I can assure the Deputy the majority of join family visas receive a first instance decision within the 12 month business target. In the first nine months of 2025 the average processing time for a join family application was approximately 100 days.  Processing times and decisions at the Dublin Visa Office and the Overseas Visa Offices can be checked at the following link: www.irishimmigration.ie/visa-decisions/  It should be noted that some applications can take considerably longer. Processing times for all applications are influenced by a number of factors. The time it can take varies depending on the type and complexity of application; individual circumstances; peak application periods; such as holidays or the start of the school year; and, crucially, the quality and completeness of the application lodged. Verifying an application is an important part of our immigration system and the checks involved can take time to complete.  I understand that extended wait times can be frustrating for applicants, and I want to assure anyone who has made an application for a visa that my Department is doing everything possible to progress these applications as quickly as possible.  In 2024, approximately 201,000 visa applications, of all types, were received by the Visa Division of my Department. This reflects an increase of 21%, compared to 2023, with over 35,000 additional applications received. These increases have continued, in the first nine months of 2025, my Department's Visa Division received approximately 166,000 visa applications and has issued over 153,000 decisions. This reflects an increase in applications of 5.5% compared to the same period in 2024. My officials are working to meet the increased level of demand, and over 8,200 additional visa decisions have issued in the first nine months of 2025, compared to the same period in 2024.  On 26 November, I announced the publication of a comprehensive review of the Non-EEA Family Reunification Policy. This review sets out a number of short-term measures to be introduced immediately, and longer-term measures which will be kept under ongoing review.  The purpose of the revised Policy is not to deter people making applications, but to ensure that people who are sponsoring an application have sufficient resources to provide for their family, without the reliance on public services or state funds.  The revised policy can be accessed on my Departments website at the following link: www.gov.ie/en/department-of-justice-home-affairs-and-migration/publications/revised-non-eea-family-reunification-policy-and-final-report-on-the-review-of-the-policy/. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 391. Deputy Brian Stanley asked the Minister for Justice, Home Affairs and Migration if it has been brought to his attention that applications for Long-Stay Family Reunification Visas are currently taking in excess of 24 months to process; the measures he intends to introduce to bring processing times back in line with the advertised six month standard; and if he will make a statement on the matter. [68449/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "showAs": "Brian Stanley"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_350",
          "debateSectionId": "dbsect_350",
          "showAs": "Family Reunification",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_350.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_391",
        "questionNumber": 391
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  While international attention is understandably focused on the ceasefire and need for implementation of the peace agreement in Gaza, including the need to urgently scale up humanitarian access, Ireland has not lost sight of the situation in the West Bank, where unprecedented Israeli military operations have caused widespread displacement and destruction of civilian infrastructure and homes.  I am deeply concerned by illegal settlement construction, and increasing and escalating extremist settler violence, which continue in an environment of impunity, restricting life for Palestinians across the West Bank. The olive harvest this year has been marred by the highest levels of settler violence recorded over the past five years. The number of settlement plans and tenders advanced by Israel in 2023 and 2024 represents a 250% increase over a period of seven years since 2018.  Ireland, alongside our EU partners, is strongly opposed to Israel’s settlement policy and activities, including in and around East Jerusalem. Israeli settlements in the occupied Palestinian territory are illegal under international law. This is the long-standing position of the European Union. Ireland has repeatedly called on Israel to immediately halt these activities and welcomes strong US statements clearly opposing annexation of the West Bank.  Ireland has strongly supported the sanctions adopted by the EU against both individuals and entities involved in settler violence. Ireland welcomes further proposals from the European Commission to sanction extremist Israeli ministers and violent settlers.  The West Bank must be centrally considered as work to implement the next phase of the Comprehensive Peace Plan for Gaza progresses, given its centrality to a durable peace plan with the implementation of the two-State solution as its central goal. Ireland continues to advocate for this at EU and international level. Ireland was active in preparing the UN High-level Conference on the Two-State Solution, held in New York from 28 - 30 July and the outcome document from the meeting – the New York Declaration – has been endorsed by 142 countries. Ireland is also an active member of the Global Alliance for the Implementation of the Two-State Solution and will host a meeting of the Global Alliance in Ireland in early 2026, where we will share elements of our own experience of a successful peace process in Northern Ireland.  I am also extremely concerned about Israeli actions that severely hamper the functioning of Palestine’s economy and financial systems. Last week, I attended the inaugural meeting of the Palestine Donor Group in Brussels where I called on Israel to release the withheld tax revenues of over US$3 billion immediately and to urgently implement the Paris Protocol to ease the liquidity crisis facing the Palestinian Authority. Ireland has also joined the Emergency Coalition for the Financial Sustainability of the Palestinian Authority the purpose of which is to stabilise the Palestinian Authority’s finances and preserve its ability to govern, provide essential services, and maintain security, all of which are indispensable to regional stability and to preserving the two-State solution. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Brian Stanley",
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_80.xml"
            }
          },
          "debateSectionId": "dbsect_80",
          "showAs": "Middle East",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_80"
        },
        "questionNumber": 52,
        "date": "2025-11-27",
        "showAs": " 52. Deputy Brian Stanley asked the Minister for Foreign Affairs and Trade her assessment of the intimidation and violence against the Palestinian people in the West Bank; the actions her Department is taking to increase the international pressure on Israel to halt their campaign of displacement; and if she will make a statement on the matter. [66647/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_52"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is an operational matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Brian Stanley",
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_421.xml"
            }
          },
          "debateSectionId": "dbsect_421",
          "showAs": "Hospital Procedures",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_421"
        },
        "questionNumber": 492,
        "date": "2025-11-27",
        "showAs": " 492. Deputy Brian Stanley asked the Minister for Health if elective surgeries have been cancelled in Children’s Health Ireland at Crumlin; if so, to outline the reasons for such cancellations; when elective surgeries are expected to recommence; and if she will make a statement on the matter. [66828/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_492"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Health  After a hearing in the Labor Court in June, it was recommended that a final extension of the current Special Scheme to the 31st of December 2025, at which point anyone remaining on the scheme should transition to the Public Service Sick Leave Scheme. Any employee of the public health sector remaining unwell beyond that date, may utilise the full provisions of the Public Service Sick Leave Scheme which will provide further support. Employees who did not qualify for the Special Scheme but are also impacted by Long-Covid may also utilise the supports of the sick leave scheme. The sick leave scheme provides full pay for three months, followed by half pay for three months, and after that, Temporary Rehabilitative Remuneration may be applied for, which, if granted, provides up to a further 547 days of paid leave. The Critical Illness Protocol that forms part of the sick leave scheme may also provide additional supports if granted. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Brian Stanley",
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_505.xml"
            }
          },
          "debateSectionId": "dbsect_505",
          "showAs": "Covid-19 Pandemic Supports",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_505"
        },
        "questionNumber": 577,
        "date": "2025-11-27",
        "showAs": " 577. Deputy Brian Stanley asked the Minister for Health if she will extend the temporary scheme of paid leave for public health service employees unfit for work post Covid-19 beyond 31 December 2025, in recognition of the exceptional service and sacrifices made by frontline staff during the pandemic; and if she will make a statement on the matter. [67234/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_577"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "showAs": " 817. Deputy Brian Stanley asked the Minister for Health to ensure applications for European health insurance cards for travelling can be done by way of a paper form, as well as online, to facilitate persons who are not computer literate and may not have access to a computer; and if she will make a statement on the matter. [65236/25] ",
        "debateSection": {
          "showAs": "Health Services",
          "debateSectionId": "dbsect_729",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_729",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_729.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Brian Stanley",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "memberCode": "Brian-Stanley.D.2011-03-09"
        },
        "questionNumber": 817,
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_817",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 897. Deputy Brian Stanley asked the Minister for Health if the orthopaedic Department of Tullamore Hospital is currently operating at full capacity; and if she will make a statement on the matter. [65806/25] ",
        "debateSection": {
          "showAs": "Hospital Services",
          "debateSectionId": "dbsect_810",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_810",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_810.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Brian Stanley",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "memberCode": "Brian-Stanley.D.2011-03-09"
        },
        "questionNumber": 897,
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_897",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 898. Deputy Brian Stanley asked the Minister for Health if Tullamore Hospital is currently prevented for outsourcing work to clear the orthopaedic waiting list, which holds 297 people; if, as a result, patients are prevented from using available services, such as the National Treatment Purchase Fund, to have surgeries completed; and if she will make a statement on the matter. [65807/25] ",
        "debateSection": {
          "showAs": "Hospital Waiting Lists",
          "debateSectionId": "dbsect_811",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_811",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_811.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Brian Stanley",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "memberCode": "Brian-Stanley.D.2011-03-09"
        },
        "questionNumber": 898,
        "answerText": "",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_898",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_33",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/debate/dbsect_33",
          "showAs": "Hospital Facilities",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/debate/mul@/dbsect_33.xml"
            }
          }
        },
        "questionType": "oral",
        "showAs": " 88. Deputy Brian Stanley asked the Minister for Health to request the management of the HSE to utilise the existing hospital building at St. Vincent's, Mountmellick, when the new wing opens, which would increase the bed capacity in the facility; and if she will make a statement on the matter. [64160/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_88",
        "answerText": " Deputy Brian Stanley  I welcome the framework for endometriosis as well. It is something I have raised with the Minister in the past. I support that work.  It is very important the capacity at the hospital is increased. \n Minister of State at the Department of Health (Deputy Kieran O'Donnell)  St. Vincent's Community Nursing Unit, Mountmellick, County Laois, is a public nursing home that currently provides 56 long-stay beds and one short-stay bed. Phase 1 of the current capital project for St. Vincent's consists of a new two-storey development containing 50 single en suite rooms adjacent and linked to the existing facility.  The project is expected to be construction complete in the next few weeks.  It is currently expected that St. Vincent’s will be operational in Q1 of 2026, following the transfer of residents, the reviewing of staff rosters and the application to vary the registration with HIQA. When complete, St. Vincent's will be registered for 58 beds consisting of 57 long-stay beds and one short-stay bed.  The eight-bed dementia unit in the existing building will continue to operate. The HSE has advised that they are reviewing plans in respect of the future use of the existing facility. However, the main kitchen, canteen, laundry, and storerooms will continue to be accessed by staff. The church will also continue to be accessed by residents and staff as required, and daycare will remain operational in its current location.  The scale and scope of future additional phasing of capital works at St. Vincent’s is currently being reviewed by the HSE, and once completed, the specific scope for phase 2 of the capital project will be determined.  Specifically on the matter raised, as I said, the HSE is currently reviewing plans in respect of future use of the existing facility. More particularly, the HSE is currently in the initiation phase of project planning for utilisation of the existing building, necessitating complete refurbishment, taking account of the demands for additional rehab, long- and short-stay beds in the community nursing unit, CNU. Any development in the old St. Vincent's building will be subject to capital and revenue funding approval. \n Deputy Brian Stanley  I thank the Minister of State for his reply. There are 58 beds there at the moment. The important thing when the new wing is opened, which I welcome as it is a €31 million investment we have been long waiting for, is that we increase that bed capacity of 58 beds. The reality is that 25 of the existing beds are in a ward that was refurbished in recent years at huge expense. There are double-glazed windows and completely refitted en suite rooms. It would be outrageous were those 25 beds to be taken out of use. There is capacity here to get the hospital up to 83 beds. There are brilliant staff there. It is a very well run facility. As I said, they are totally refurbished rooms. A total of 25 beds could continue. There is a shortage of nursing home beds in the county. The Minister of State knows the situation he dealt with personally with regard to the residence. I thank him for his work on that and on the private ones. We have lost Ballard Lodge, a private nursing which closed down and which was a good facility. We need extra capacity in the county. I plead with the Ministers of State and the Minister, Deputy Carroll MacNeill, to do everything they can to try to ensure that they increase the capacity to 83. \n Deputy William Aird  I put in a parliamentary question and received a reply on the 14 October, outlining exactly what the Minister of State has said. Funding of the sum of €23.7 million was allocated for a 130-bed facility in St. Vincent's in 2016. The project is being carried out in phases, including work on a new 50-bed unit. Will the Minister of State give a firm commitment that the overall capacity will be a 130-bed unit when all phases are complete? I refer to the existing facility in St. Vincent's in Mountmellick, which I know very well because my late mother was a nurse there for many years. A special occasion was when we went to look at the Christmas decorations at Christmas and to visit the patients who were there. I want to make sure we can keep the number of beds we have there. As a politician - we are all politicians at the end of the day working on behalf of the people in our communities - the single biggest issue raised in my clinics every day is by people who are trying to get their loved ones into one of the nursing homes. It is very difficult. There is no capacity in any private residential nursing homes. As has been said, the nursing home in Portlaoise is closed at the moment, which puts huge pressure on the situation. I am asking the Ministers of State and the Minister if they can do everything possible for us. \n Deputy Kieran O'Donnell  I thank Deputies Stanley and Aird for raising this matter. As I said earlier, the HSE is currently reviewing matters in respect of phase 2 and, more particularly, in respect of the use of the existing building in terms of pure logistics. The person in charge is in contact with HIQA. There was a request for a preliminary visit of the area in respect of the new building and specifically in respect of the existing building. As I said, the eight-bed dementia unit will continue to operate in the existing building. The HSE advises it is currently reviewing plans in respect of the future use of the existing building. More particularly on that, the HSE is currently in the initiation phase of project planning for utilisation of the existing building in terms of complete refurbishment. I take on board the point the Deputy Stanley made about the 25 beds and the point Deputy Aird made about the increased capacity. We have taken account of the demand for additional rehab, long-stay and short-stay beds in the CNU. Developments in the old St. Vincent's building will be subject to capital and revenue funding approval. I take the points both Deputies made on board. I commit to working on what they have raised. \n Deputy Brian Stanley  The first thing I want to say in reply to the Minister of State is that €31 million is the cost that I have been given for the new 50-bed unit that is being developed there. In response to a previous parliamentary question, the Minister said that \"scale and scope of phasing of these works is currently being reviewed with service colleagues, and once completed, the specific scope for Phase 2\", which is the next wing of the 50, \"will be determined.\" That is a change of from the original plan of three phases. I am trying to be practical about this. I know money cannot be pulled out of the sky but we have 25 beds there out of the existing 50. The first thing is to keep them there. The second thing is to move onto phase 2 for the second 50 beds because we need them. There is a growing elderly population. I do not need to tell the Minister of State that the demand is there for it. A lot of families are coming to me about it.  I was not aware that you could come in on the back of a written question at oral question time. \n An Leas-Cheann Comhairle  You can. \n Deputy Brian Stanley  It is a new procedure in the Dáil. Maybe the Standing Orders have been changed and the Leas-Cheann Comhairle might advise me afterward. \n An Leas-Cheann Comhairle  I allowed him in. \n Deputy Kieran O'Donnell  It is good to see such strong cross-party representation from the constituency of Laois. On the particular matter Deputy Stanley raised, there are two aspects. They are currently reviewing the scope for additional works under phase 2. More particularly, both Deputies raised the point in respect of the existing building. I followed up with the HSE yesterday in advance of our debate. I got the update the Deputy is looking for, which is that it is currently looking at the use of the existing building. It is looking at it in the context of the refurbishment that was referred to, the 25 beds, which I will bring up with it, and the need for additional rehab long-stay and short-stay beds. The first step is that the HSE completes its work in that area. We then need to look at funding. I will be following up with the HSE on that particular matter. ",
        "questionNumber": 88,
        "by": {
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "showAs": "Brian Stanley"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_216",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_216",
          "showAs": "Hospital Facilities",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_216.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 197. Deputy Brian Stanley asked the Minister for Health if she will ensure that when the new wing of St. Vincent's Hospital, Mountmellick, is open, the existing section of the hospital that is in use continues to be operational given this was extensively refurbished in recent years; and if she will make a statement on the matter. [64159/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_197",
        "answerText": " Minister for Health  As this is a service matter I have asked the HSE to respond to the deputy as soon as possible. ",
        "questionNumber": 197,
        "by": {
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "showAs": "Brian Stanley"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_443",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_443",
          "showAs": "Health Services Staff",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_443.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 572. Deputy Brian Stanley asked the Minister for Health when an occupational therapist will be recruited for primary care services in Laois; and if she will make a statement on the matter. [60014/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_572",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 572,
        "by": {
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "showAs": "Brian Stanley"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_444",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_444",
          "showAs": "Health Services Staff",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_444.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 573. Deputy Brian Stanley asked the Minister for Health when an occupational therapist will be put in place in Laois to provide services to the elderly; and if she will make a statement on the matter. [60013/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_573",
        "answerText": " Minister for Health (Deputy Jennifer Carroll MacNeill)  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 573,
        "by": {
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "showAs": "Brian Stanley"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_445",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_445",
          "showAs": "Health Services Staff",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_445.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 574. Deputy Brian Stanley asked the Minister for Health when a psychologist cognitive behavioural therapist and a social worker will be put in place in County Laois; if the recruitment process is open; and if she will make a statement on the matter. [60016/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_574",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "questionNumber": 574,
        "by": {
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "showAs": "Brian Stanley"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 999,
        "showAs": " 999. Deputy Brian Stanley asked the Minister for Health if the orthodontic section of Tullamore Hospital is currently operating at full capacity; and if she will make a statement on the matter. [62959/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "showAs": "Brian Stanley",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "memberCode": "Brian-Stanley.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_999",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_783",
          "showAs": "Dental Services ",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_783",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_783.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1000,
        "showAs": " 1000. Deputy Brian Stanley asked the Minister for Health the number of joint replacements carried out in Tullamore Hospital since 1 January 2025; and if she will make a statement on the matter. [62960/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "showAs": "Brian Stanley",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "memberCode": "Brian-Stanley.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1000",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_784",
          "showAs": "Hospital Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_784",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_784.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Health  As this is a service matter I have asked the HSE to respond to the deputy as soon as possible. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1001,
        "showAs": " 1001. Deputy Brian Stanley asked the Minister for Health the number of patients that are currently on waiting lists for joint replacements at Tullamore Hospital; the breakdown of same; and if she will make a statement on the matter. [62961/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "showAs": "Brian Stanley",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "memberCode": "Brian-Stanley.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1001",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_786",
          "showAs": "Hospital Waiting Lists",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_786",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_786.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Health  As this is a service matter, it has been referred to the Health Service Executive for attention and direct reply to the Deputy. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1002,
        "showAs": " 1002. Deputy Brian Stanley asked the Minister for Health if Tullamore Hospital is currently prevented from outsourcing work to clear the orthodontic waiting lists; if the hospital is prevented from outsourcing this and from utilising the services for example, of the National Treatment Purchase fund; and if she will make a statement on the matter. [62962/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "showAs": "Brian Stanley",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "memberCode": "Brian-Stanley.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1002",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_787",
          "showAs": "Dental Services ",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_787",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_787.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Climate, Energy and the Environment  The Commission for Regulation of Utilities (CRU) was assigned responsibility for the regulation of the Irish electricity sector following the enactment of the Electricity Regulation Act, 1999 and subsequent legislation. The procurement of battery storage facilities supplying the electricity grids is an operational matter for the entities involved and is not one in which the Minister has a statutory function. EirGrid, the Transmission System Operator, in conjunction with the regulatory authority, the Commission for the Regulation of Utilities, develop the primary procurement mechanisms to incorporate electricity storage onto the grid to ensure the proper functioning of the grid. The electricity storage systems including battery electricity storage systems are then developed by private enterprise. The Deputy may wish to engage with CRU or EirGrid directly regarding the issue that he is raising. Both CRU (oireachtas@cru.ie) and EirGrid (oireachtas@eirgrid.ie) have contact email addresses for Deputies should they wish to raise matters of concern such as that in the Question. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_170",
        "debateSection": {
          "debateSectionId": "dbsect_188",
          "showAs": "Electricity Grid",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_188",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_188.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Climate"
        },
        "questionNumber": 170,
        "by": {
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09",
          "showAs": "Brian Stanley"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 170. Deputy Brian Stanley asked the Minister for Climate, Energy and the Environment the total spend on batteries supplying the electricity grid from 2018 to date in 2025, by year; and the estimate over procurement of batteries each year from 2018 to date to date in 2025, by year, in tabular form. [62306/25] "
      }
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Brian Stanley",
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_75.xml"
            }
          },
          "debateSectionId": "dbsect_75",
          "showAs": "Disabilities Assessments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_75"
        },
        "questionNumber": 117,
        "date": "2025-11-12",
        "showAs": " 117. Deputy Brian Stanley asked the Minister for Children, Disability and Equality the average waiting time in Laois for an assessment of need (AON); and the longest time any child is waiting for an AON in County Laois. [60015/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_117"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Brian Stanley",
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_131.xml"
            }
          },
          "debateSectionId": "dbsect_131",
          "showAs": "Disability Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_131"
        },
        "questionNumber": 170,
        "date": "2025-11-12",
        "showAs": " 170. Deputy Brian Stanley asked the Minister for Children, Disability and Equality the current staffing level on the Laois CDNT teams; the percentage of posts filled, for each of the required disciplines; and if she will make a statement on the matter. [60012/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_170"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The system of social assistance supports provides payments based on an income need.  The means test plays a critical role in determining whether or not an income need arises as a consequence of a particular contingency – such as disability, unemployment or caring.  This ensures that the recipient has a verifiable income need and that resources are targeted to those who need them most.  By its nature, the means test takes account of the income a person or couple has in terms of cash, property - other than the family home - and capital.  It does not take account of a person’s expenditure.  Introducing a rent or mortgage disregard in the means test for social protection payments would have significant budgetary implications and would give rise to inconsistencies in how means tests are applied across schemes.  It would also significantly increase the complexity of the means assessment.  Any changes in this regard would have to be considered in the overall policy context. ",
        "to": {
          "showAs": "Social",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Brian Stanley",
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_592.xml"
            }
          },
          "debateSectionId": "dbsect_592",
          "showAs": "Social Welfare Eligibility",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_592"
        },
        "questionNumber": 678,
        "date": "2025-11-12",
        "showAs": " 678. Deputy Brian Stanley asked the Minister for Social Protection given the ongoing housing crisis, if his Department will consider adjusting the means assessment criteria for social welfare claims to allow for deductions in respect of rent and mortgage payments; and if he will make a statement on the matter. [61917/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_678"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The Back to Work Enterprise Allowance scheme offers support for people who are long-term unemployed and who are interested in self-employment as a route to re-entering the labour market. The scheme supports people in receipt of a qualifying social welfare payment to develop a business while allowing them to retain a reducing proportion of their payment over two years.  To qualify for the Back to Work Enterprise Allowance scheme, a person is required to have received an eligible income support payment continuously for nine months.  A person is also required to have an underlying entitlement to a qualifying scheme.  If, for example, a person has received Jobseeker's Benefit for nine months, they must have an entitlement to Jobseeker's Allowance in order to qualify for Back to Work Enterprise Allowance which is then payable for up to two years.  The time spent on the Jobseeker's Benefit is counted towards the qualification period.  Having an entitlement to Jobseeker's Allowance ensures that the Back to Work Enterprise Allowance is targeted at those who require financial support.  The use of the means test is a method of targeting scarce resources to those with an identified financial need.  Removal of the means test for Jobseeker’s Allowance, in the case of entitlement to the Back to Work Enterprise Allowance scheme would have significant policy and budgetary implications and reduce the scope for my Department to provide income supports to lower income households.  Applicants claiming either Jobseeker’s Benefit or Jobseeker’s Pay-Related Benefit may be entitled to the Short-Term Enterprise Allowance which is available for the duration of their scheme, for up to six or nine months.  Any changes to the conditions of the scheme would need to be considered in the wider budgetary context.  I trust this clarifies the position for the Deputy. ",
        "to": {
          "showAs": "Social",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Brian Stanley",
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_593.xml"
            }
          },
          "debateSectionId": "dbsect_593",
          "showAs": "Social Welfare Eligibility",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_593"
        },
        "questionNumber": 679,
        "date": "2025-11-12",
        "showAs": " 679. Deputy Brian Stanley asked the Minister for Social Protection his plans to remove the requirement for an application to have an underlying entitlement to jobseeker’s allowance for those seeking to qualify for the back to work enterprise allowance, where said applicants have previously satisfied the nine month qualifying period on jobseeker’s benefit; and if he will make a statement on the matter. [61918/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_679"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Children",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1479. Deputy Brian Stanley asked the Minister for Children, Disability and Equality when occupational therapists will be appointed for child disability network teams in Laois; if HSE recruitment is underway; if a panel is in place for occupational therapists for these positions; and if she will make a statement on the matter. [58011/25] ",
        "by": {
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "showAs": "Brian Stanley",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1479",
        "questionNumber": 1479,
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "debateSection": {
          "showAs": "Disability Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1266",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1266.xml"
            }
          },
          "debateSectionId": "dbsect_1266"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1668. Deputy Brian Stanley asked the Minister for Health if occupational therapists are in place in County Laois; if so, the number of therapists available; if a recruitment process is underway for occupational therapists; if a panel is in place; if there are vacant posts; if so, when these posts will be filled; and if she will make a statement on the matter. [58009/25] ",
        "by": {
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "showAs": "Brian Stanley",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1668",
        "questionNumber": 1668,
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "debateSection": {
          "showAs": "Health Services Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1434",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1434.xml"
            }
          },
          "debateSectionId": "dbsect_1434"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1669. Deputy Brian Stanley asked the Minister for Health if an occupational therapist is in place to serve primary care in County Laois; if a recruitment process is underway; if a panel is in place; when positions will be filled; and if she will make a statement on the matter. [58010/25] ",
        "by": {
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "showAs": "Brian Stanley",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1669",
        "questionNumber": 1669,
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "debateSection": {
          "showAs": "Health Services Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1435",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1435.xml"
            }
          },
          "debateSectionId": "dbsect_1435"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_259.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_259",
          "debateSectionId": "dbsect_259"
        },
        "to": {
          "showAs": "Public Expenditure",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Construction works at the Portlaoise Divisional Garda Headquarters are progressing on site.  The scope of the project comprises several elements; the refurbishment and multi-storey extension of an existing building, the construction of a substantial new building and all of the associated preparatory works and site completion works.  The budget allocation includes the cost of the construction works as contracted and all other development costs, as such it is not possible to publish this material until such time as the contract has been concluded. ",
        "questionType": "written",
        "showAs": " 329. Deputy Brian Stanley asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the budget allocation and full contract cost for construction works and refurbishment of Portlaoise Garda Station; and if he will make a statement on the matter. [56513/25] ",
        "questionNumber": 329,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Brian Stanley",
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_329"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_451.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_451",
          "debateSectionId": "dbsect_451"
        },
        "to": {
          "showAs": "Justice",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Justice, Home Affairs and Migration  This Government is committed to ensuring that An Garda Síochána has the resources it needs to fight crime and keep our communities safe. The Garda Vote in Budget 2026 provides unprecedented funding of €2.59 billion for the year.  The Garda Commissioner is responsible for the management and administration of Garda business, including all decisions related to upgrades on the Garda Estate. The Office of Public Works has responsibility for the provision and maintenance of Garda accommodation.  Through the National Development Plan 2026-2030, I have also prioritised investment in capital development for An Garda Síochána to support projects across the Garda estate and a refurbishment programme for stations across the country.  I am informed that there are currently two capital refurbishment projects in Laois scheduled for completion in 2026 which are set out below.     Portarlington Garda Station    Window and door restoration works      Portlaoise Head Quarters    Redevelopment of Portlaoise HQ     I am also informed that following various works which were recently completed at Garda stations in Laois in 2024 and 2025 which are set out below.     Durrow Garda Station    Ramp / universal access & upgrade of dayroom and public counter      Borris in Ossary Garda Station    First Floor Refurbishment      Pavilions A &B    Fitout Works      Abbeyleix    Cell upgrade and prisoner processing area works     I am informed that this information is correct as of 15 October 2025.  The Garda Commissioner keeps the distribution of resources under continual review and I will continue to engage regularly with him to ensure our Gardaí have the resources they need to keep our communities safe. ",
        "questionType": "written",
        "showAs": " 547. Deputy Brian Stanley asked the Minister for Justice, Home Affairs and Migration the other capital works on Garda Stations in Laois which will be funded in 2026, aside from Portlaoise Garda Station; and if he will make a statement on the matter. [56514/25] ",
        "questionNumber": 547,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Brian Stanley",
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_547"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Prison Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_458.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_458",
          "debateSectionId": "dbsect_458"
        },
        "to": {
          "showAs": "Justice",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Justice, Home Affairs and Migration  In 2024, Government approved increasing the maximum retirement age to 62 years of age for a number of the uniform services, including the Irish Prison Service. This increased retirement age reflects the reality across all sectors that people can and want to work in their chosen careers for longer.  The legislative basis to increase the retirement age was included in the Courts, Civil Law, Criminal Law and Superannuation (Miscellaneous Provisions) Act 2024. Section 28 of this Act amended the Civil Service Regulation Act 1956 to provide a power to make regulations relating to the retirement age of prison officers. The Civil Service Regulation Act 1956 (Retirement of Prison Officers) Regulations 2024 were made pursuant to this power and specified a maximum retirement age of 62 years for prison officers with effect from 19 August 2024.  I can advise the Deputy that while there are currently no plans to increase the retirement age of prison officers further, these matters are kept under review. ",
        "questionType": "written",
        "showAs": " 562. Deputy Brian Stanley asked the Minister for Justice, Home Affairs and Migration if his Department, and the Prison Service, will consider extending the mandatory retirement age for prison officers beyond the current 62 years. [56612/25] ",
        "questionNumber": 562,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Brian Stanley",
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_562"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Mental Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_635.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_635",
          "debateSectionId": "dbsect_635"
        },
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister of State at the Department of Health  As this is a service matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "questionType": "written",
        "showAs": " 745. Deputy Brian Stanley asked the Minister for Health when the vacant post for assistant director of nursing in Kildare-West Wicklow Mental Health Services will be filled; and if she will make a statement on the matter. [56584/25] ",
        "questionNumber": 745,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Brian Stanley",
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_745"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Health Service Executive",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_636.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_636",
          "debateSectionId": "dbsect_636"
        },
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "showAs": " 746. Deputy Brian Stanley asked the Minister for Health to provide a list of director and assistant director of nursing positions within the HSE that have been filled since 1 January 2025 to date; and if she will make a statement on the matter. [56585/25] ",
        "questionNumber": 746,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Brian Stanley",
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_746"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Health Service Executive",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_637.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_637",
          "debateSectionId": "dbsect_637"
        },
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "showAs": " 747. Deputy Brian Stanley asked the Minister for Health to provide a list of director and assistant director of nursing positions within the HSE that remain vacant to date; to provide a timeline for when these positions will be filled; and if she will make a statement on the matter. [56586/25] ",
        "questionNumber": 747,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Brian Stanley",
          "memberCode": "Brian-Stanley.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Stanley.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_747"
      }
    }
  ]
}