{
  "head": {
    "counts": {
      "questionCount": 334,
      "resultCount": 334
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Deputy Joe Cooney  Roughly 22,000 children will need childcare in County Clare by 2027. Only five services have registered and only 26 individual childminders have done the mandatory pre-registration training so far. With less than two years before these new regulations take effect, what is being done to ensure the number of childminders will be sufficient to meet the future demand in Clare by 2027? \n Deputy Norma Foley  I thank the Deputy. Childminders are a hugely important part of early learning and care and school-age childcare provision and they continue to be the option of choice for many families. The National Action Plan for Childminding 2021-2028 set out a pathway for the extension of regulation to childminders. A singular objective of the national action plan is to enable parents who use childminders to benefit from State subsidies through the national childcare scheme. The Childcare Support Act 2018, which provides a statutory basis for the national childcare scheme, specifies that only Tusla-registered childminders are eligible to participate in the scheme. The limitation of public funding schemes to Tusla-registered providers helps to ensure public funding is provided where there is assurance of the quality of provision.  It must be noted that childminding regulations only came into effect in September 2024, with a statutory transition period of three years ending in September 2027. Registration is therefore not mandatory until the end of this transition period. This phased approach aims to facilitate the largest possible number of childminders to enter the regulated sector, the sphere of quality assurance, and access to Government subsidies, while recognising the time and supports required for childminders to learn about and prepare for registration. The childminding-specific regulations are designed to be proportionate and appropriate to the home and family setting in which childminders work. The regulations differ substantially from regulations for centre-based childcare. While the Department has successfully completed phase 1 of the national action plan, considerable work lies ahead during phase 2 in supporting the large number of unregistered childminders to register with Tusla and take part in the national childcare scheme before the end of the transition period, in County Clare and right around the country.  I fully understand the sense of uncertainty and anxiety childminders may be experiencing in this period of transition. Communication is essential to overcoming this. A national communications strategy is a key element in phase 2 of the national action plan during the transition period we are now in. Work on this communications strategy has begun with the aim of informing childminders and parents about the changes, the supports available and what to expect. The Department has committed to a review of the initial implementation of the childminding-specific regulations in phase 2 also. I aim to meet Childminding Ireland on a one-to-one basis before the review of the regulations commences. \n Deputy Joe Cooney  I thank the Minister. In Clare we will need roughly 170 childminders to accommodate the number of children who use individual childminders' services. My experience on the ground in Clare is that existing services are already under huge pressures, with long waiting lists, very limited availability in many areas and, unfortunately, increasing numbers of childminders shutting up shop. I acknowledge the need for registration but am very concerned about how this will play out if there is not a well-thought-out strategy put in place to retain existing childminders and encourage new entrants to the sector, which is vital and important for our young generation in these very demanding times. \n Deputy Norma Foley  I thank the Deputy. I acknowledge that the issue of childminders and registration and the challenges they might face has been consistently raised in this Chamber.  I do not wish to be repetitive but I will say again that I absolutely acknowledge that childminders are an incredibly important and valuable resource in the whole sphere of the childcare sector and I want them to continue in the business. I have to ensure they are regulated and, as has been said, I do not think any childminders are opposed to that. However, it is an important element of child safeguarding.  There will be a review - I spoke about it earlier - as early as possible in 2026. That will be important for engagement. I have also given a commitment that I will meet Childminding Ireland before that review commences. Yesterday, I published Shaping the Future: Early Years Action Plan. The action plan commits to restructuring the core funding pilot for registered childminders in 2026 - in other words, a number of childminders in the pilot are part of the core funding process. That will also be restructured going forward to bring more and more into it. That is my ambition anyway. I am committed to continuing to work with childminders to make it as easy and accessible as possible for them to come within the regulations. \n Deputy Joe Cooney  My main concern is that there will only be a trickle of applications for the training and a then a flood at the last minute. We can be smart and avoid that last-minute surge by putting in place a planned, targeted information campaign for next year, possibly using the childcare committees. This would ensure that any misinformation about the process is countered and that anyone who might be interested hears about this well before the deadline, which is important. We could take this campaign directly to parents by going to schools. This would drive a huge awareness campaign at local level, especially in more rural areas where the impact will be mostly felt. \n Deputy Norma Foley  I appreciate that the Deputy has come with many positive suggestions for how we can collaboratively support childminders going forward. Already the Department provides funding to each of the county and city childcare committees so that there is a specific individual who is a childminding development officer in place in each of the committees to work directly with childminders. That is an important access point for childminders and it will be drawn upon more and more. I have already outlined a stronger communication campaign which we are in the process of undertaking. We will do all we can - and I appreciate the many examples the Deputy gave - to ensure the maximum number of people are engaging on a consistent basis before 2027. It is a feature of life that there is always a rush towards the end and I absolutely accept that it would be better if there were a consistent registration so we will continue to work on that. I appreciate the Deputy's input. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 7. Deputy Joe Cooney asked the Minister for Children, Disability and Equality if she is satisfied that the number of childminding services registered with Tusla, and the numbers of childminders undertaking the pre-registration training, will be sufficient to meet the future demand in Clare; and if she will make a statement on the matter. [73088/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_8",
          "debateSectionId": "dbsect_8",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_8.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_7",
        "questionNumber": 7
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  My Department funds a number of grant schemes administered by the Sustainable Energy Authority of Ireland (SEAI) to support homeowners to improve energy efficiency, and to promote the adoption of renewable energy systems.  The SEAI launched a pilot scheme for the retrofit of traditionally built homes in September 2024. The initial pilot is limited to 100 dwellings with the objective of gathering data on the types of solutions set out in the Department of Housing, Local Government and Heritage guidance: Improving Energy Efficiency in Traditional Buildings: Guidance for Specifiers and Installers.  The pilot scheme is available under the SEAI’s National Home Energy Upgrade Scheme which provides an end-to-end service for homeowners.  Under this pilot, upgrades are delivered through registered One Stop Shops, supported by a home-owner appointed qualified traditional building professional (TBP). Grant supports are at the same level as those under the National Home Energy Upgrade Scheme – as outlined on the SEAI website at: www.seai.ie/grants/home-energy-grants/one-stop-shop  To date, 57 applications have been received, with the pilot’s first retrofits due for completion in Quarter 1, 2026.  The learnings on the Traditional Homes Pilot to date are:  - increasing homeowner awareness is important, as they play a significant role in decision-making and influencing solutions/contractor choices;  - many learnings on balancing the energy upgrade versus the impact on the building;  - maintaining the architectural heritage of the building, to ensure retrofit measures do not compromise its character; and  - incorporating the TBP can be a challenge, particularly regarding the relationship across various actors in a project.  Any decisions to expand traditional home retrofits beyond the National Home Energy Upgrade Scheme will be informed by the final findings of the pilot scheme which are expected in 2026. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 126. Deputy Joe Cooney asked the Minister for Climate, Energy and the Environment if he will consider introducing a technical grant support for single home energy upgrade measures in traditionally built properties to cover the added conservation costs these types of buildings can incur; and if he will make a statement on the matter. [73270/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_157",
          "debateSectionId": "dbsect_157",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_157.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_126",
        "questionNumber": 126
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  Ireland enjoys a strong and mutually beneficial trading relationship with the Republic of Korea. This relationship and steady growth in two-way trade is complemented by strong people-to-people connections and regular bilateral and multilateral political engagement.  Ireland’s total trade in goods with the Republic of Korea was valued at €2.6 billion in 2024; with exports from Ireland to the Republic of Korea in trade in goods valued at €0.9 billion, and imports from the Republic of Korea in trade in goods at €1.7 billion. In the absence of 2024 figures, total trade in services between Ireland and the Republic of Korea in 2023 was valued at €4.2 billion.  Important sectors for exports from Ireland to the Republic of Korea include agri-food, pharmaceuticals, ICT, life sciences, agri-tech and renewable energies while imports from the Republic of Korea to Ireland include electronics and motor vehicles.  Our trade and investment promotion agencies are active in the Korean market and work closely with my officials at the Irish Embassy in Seoul. All Team Ireland members in the Republic of Korea work hand in hand to support Irish companies already doing business or considering entering the Korean market, Korean companies seeking to invest in Ireland as well as to seek opportunities for deepening our trading relations.  Strengthening our two-way economic partnerships in the Asia-Pacific region is a key strategic priority for my Department. This is very much true of our relationship with the Republic of Korea, a valued partner of Ireland.  In October 2023 the then Taoiseach, accompanied by senior Ministers, led the very successful inaugural Team Ireland Trade Mission to the Republic of Korea – an initiative with the objective of supporting the Government’s development and expansion of Ireland’s exports, tourism, and inward investment from existing and new markets. This trade mission has been followed by regular Ministerial visits to the Republic of Korea in the furtherance of these goals as well as more broadly strengthening our bilateral relations.  Our work to further develop the economic relationship with the Republic of Korea is very much aligned with the objectives of the Government Action Plan on Market Diversification which was announced this year. This Action Plan sets out a whole-of-Government commitment to support Irish businesses to adapt to the evolving global trading environment by striking out into new and diverse markets and deepening their engagement in existing markets. The Government Trade Forum will monitor the implementation of the Action Plan, ensuring that there is direct engagement with business organisations.  My Department remains committed to further developing the strong trading relationship between Ireland and the Republic of Korea along with deepening and strengthening our already strong bilateral ties. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 32. Deputy Joe Cooney asked the Minister for Foreign Affairs and Trade to outline Ireland's trading relationship with South Korea. [72770/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_56",
          "debateSectionId": "dbsect_56",
          "showAs": "Trade Relations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_56.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_32",
        "questionNumber": 32
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has responsibility for the planning and development of public transport infrastructure including bus stops/shelters nationally.  There is a commitment under the Programme for Government to ensure that public transport operators provide safe and accessible access for all passengers and a commitment to work with local authorities and national bodies to improve public transport options and infrastructure.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a direct reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 147. Deputy Joe Cooney asked the Minister for Transport the amount the National Transport Authority has spent on installation of bus shelters within County Clare in 2024 and to date in 2025, in tabular form; the locations of each; and if he will make a statement on the matter. [72768/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_145",
          "debateSectionId": "dbsect_145",
          "showAs": "Bus Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_145.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_147",
        "questionNumber": 147
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  A temporary 9% rate of VAT on the supply of apartments came into effect on budget night. The extension of the 9% VAT rate to the construction of apartments, and the supply and construction of apartment blocks, including student accommodation, came into effect on 26 November 2025. The 9% rate will apply until 31 December 2030.  The 9% VAT rate applies to all apartments in a multi-storey building that comprises, or will comprise, not less than 3 apartments with grouped or common access. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 172. Deputy Joe Cooney asked the Tánaiste and Minister for Finance whether the reduced rate of VAT on apartments will apply to apartments delivered \"above-the-shop\" or only to new-build apartment complexes; and if he will make a statement on the matter. [73209/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_168",
          "debateSectionId": "dbsect_168",
          "showAs": "House Prices",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_168.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_172",
        "questionNumber": 172
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The Office of Government Procurement, a Division within my Department, has established central procurement solutions for Cleaning Services for Public Sector Bodies throughout the State. The arrangement was established in August 2024 and will run until August 2028. All twenty four service providers listed below are appointed under this framework agreement.    Service Provider Names:    ABC Cleaning Services & Supplies Ltd  AFM Facilities Ltd  Ailesbury Contract Cleaning Ltd  Aramark Workplace Solutions  BidVest Noonan  CICS SiloClean Ltd  Maloney Cleaning Services  Derrycourt Cleaning Specialists  Elevare Security Services Ireland Ltd  Five Star Facility Services Ltd  FM Cleaning Systems Ltd t/a FM Services Group  Grosvenor Cleaning Services  ISS Ireland Ltd  MCC Cleaning Services Ltd  MCG Facilities Management Ireland Ltd  MCR Outsourcing Ltd  Momentum Property Support Service Limited T/A ABM Ireland  Moore Cleaning Services  Milgan & Dilgan Ltd (SOS Group)  OCS One Complete Solution  Rockcastle FM Ltd  Taylor Cleaning Services  The Cleaning Corporation  Whelan Cleaning Systems Ltd ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 186. Deputy Joe Cooney asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the names of companies that are currently on the Office of Government Procurement framework for the provision of cleaning staff to Civil Services; when each contract with each company is due to expire, in tabular form. [72771/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_177",
          "debateSectionId": "dbsect_177",
          "showAs": "Office of Government Procurement",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_177.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_186",
        "questionNumber": 186
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Enterprise, Tourism and Employment  I recently launched the newly launched National Tourism Policy, A New Era for Irish Tourism , which reflects the Programme for Government and wider priorities, setting out a vision for sustainable, regionally balanced growth. A key feature of this policy is the commitment to develop a dedicated Marine Tourism Strategy, ensuring Ireland’s coastal and marine assets are fully integrated into national tourism planning. This strategy will focus on enhancing infrastructure, diversifying experiences, and promoting year-round activity, supporting local communities and businesses while aligning with climate and sustainability goals.  Currently, Fáilte Ireland’s Regional Tourism Development Strategies and Destination and Experience Development Plans (DEDPs) feature major initiatives to strengthen coastal tourism. The Cliff Coast DEDP, for example, focuses on North Kerry and West Clare, creating sustainable tourism through distinctive coastal experiences. The Dublin Coastal Trail is being expanded to include additional villages, enriching visitor engagement with maritime heritage. These projects aim to attract more visitors, encourage longer stays, and boost local economies while safeguarding Ireland’s natural coastal beauty. Similarly, the Cork City, Harbour and East Cork DEDP, launched in November 2024, provides a strategic framework for tourism growth in the region. It prioritises the development of a landmark visitor attraction in Cork City and improvements to harbour accessibility, creating a sustainable amenity that connects communities and enhances the visitor experience. In 2025, Fáilte Ireland, in collaboration with Cork County Council, hosted a series of public consultations on the Cork Harbour Tourism Strategy with the aim to gather feedback and help shape the future direction of the strategy.  In addition to the above, Fáilte Ireland’s marketing is focused on inspiring domestic consumers to take short breaks in Ireland. Fáilte Ireland target consumers living across the island of Ireland and our ultimate goal is to increase domestic tourism revenue by presenting a year-round tourism proposition and helping spread tourism more evenly across the country. Keep Discovering is the cornerstone of Fáilte Ireland’s consumer marketing strategy. The campaign reminds Irish and Northern Irish consumers that while they think they know Ireland, there is always something new to discover and encourages everyone to Keep Discovering. The campaign aims to both inspire visitors to choose Ireland first and foremost and then to provide compelling reasons for them to book now by showcasing world-class tourism regions and the many things to see and do in destinations right across the country. The campaign is always-on throughout the year but significantly up-weighted during the off-peak months to support season extension and year-round tourism in Ireland.  In April 2021, Fáilte Ireland announced plans to develop state-of-the-art facilities for outdoor water-based activities as part of its “Platforms for Growth 2” investment grant-aid scheme. There are 19 sites across the country that will benefit from this scheme. Each centre will provide hot showers, changing and toilet facilities, secure storage, induction spaces, equipment washdown and orientation points. Accessibility and sustainability will be key focus points for the projects, ensuring full wheelchair access and the installation of solar heating panels. In August 2025, the first Water Sports Facility opened in Curracloe, County Wexford. Other individual projects are advancing through the different development stages with a number expected to open in 2026 and 2027.  Opened June 2023 , the  National Surf Centre, Strandhill is a unique visitor experience, which was developed by Fáilte Ireland, the Department of Rural and Community Development and Sligo County Council. This is Ireland’s first purpose-built surfing facility and will see Strandhill emerge as a world-class surfing destination.  Furthermore, the Shannon Tourism Masterplan, a collaborative project led by Waterways Ireland with Fáilte Ireland and 10 Local Authorities along the River Shannon and Shannon-Erne Waterway aims to position the Shannon as a destination for international and domestic tourism, transforming the region into a key tourist destination amongst Ireland’s Hidden Heartlands. The River Shannon, its lakes, and inland waterways form a core part of Ireland’s Hidden Heartlands tourism offering. The Masterplan evaluates the strengths and challenges of this asset and proposes measures to develop a sustainable international destination that respects the environment and local communities. One key action is the “ Feasibility Study on the Future Development and Greening of the Cruise Hire Sector” to more sustainable practices and enhancing visitor experiences along the Shannon Navigation and Shannon-Erne Waterway up to 2033. Fáilte Ireland unveiled the roadmap for this sector in October 2024, and initial actions are now underway, with further progress planned through 2026.  Finally, in September 2024, Fáilte Ireland and Waterways Ireland officially launched the redevelopment of Connaught Harbour in Portumna, marking a major milestone in the Shannon Tourism Masterplan. The project will significantly expand public mooring berths and introduce a canoe step to improve access to the Lough Derg Blueway. Plans also include new onshore amenities such as seating and picnic areas, a cycle and walking trail linking the harbour to the town and Blueway, additional parking, and landscaping enhancements to create a strong sense of arrival. This redevelopment will strengthen the boating and cruise hire sector in the region while improving visitor facilities and connectivity. The investment also includes the addition of canoe steps for access to the Lough Derg Blueway; additional onshore facilities such as seating and picnic areas; a new cycle and walking trail linking Connaught Harbour to Portumna town and Lough Derg Blueway; additional parking facilities including EV chargers, and improves the visual impact of the harbour, creating a sense of arrival in the town. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 197. Deputy Joe Cooney asked the Minister for Enterprise, Tourism and Employment the new steps Fáilte Ireland will take in 2026 to promote water sport tourism within Ireland; and if he will make a statement on the matter. [72775/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_190",
          "debateSectionId": "dbsect_190",
          "showAs": "Tourism Promotion",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_190.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_197",
        "questionNumber": 197
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  As the Deputy may be aware, the purpose of the Summer Works Scheme (SWS) is to enable individual school authorities to undertake small-scale building works on a devolved basis and, ideally, can be carried out during the summer months or at other times that avoid disrupting the operation of the school. The SWS operates on a multi-annual basis for categories of works such as roof works, window replacement, mechanical and electrical works, external works etc.  Since 2024 my department has provided funding to the value of almost €36m under the Summer works scheme to schools. The below table sets out the funding provided under the Summer Works Scheme for the years 2024 to date as per the Deputy's request:      County      2024      Nov-25      Total Spend       Carlow    € 907,476.00    € 165,987.00    € 1,073,463.00      Cavan    € 154,575.00    € -    € 154,575.00      Clare    € 336,253.00    € 454,428.00    € 790,681.00      Cork    € 1,810,441.00    € 3,723,209.00    € 5,533,650.00      Donegal    € 121,330.00    € -    € 121,330.00      Dublin    € 4,503,100.00    € 3,485,966.00    € 7,989,066.00      Galway    € 255,903.00    € 622,215.00    € 878,118.00      Kerry    € 307,694.00    € 13,029.00    € 320,723.00      Kildare    € 819,623.00    € 292,388.00    € 1,112,011.00      Kilkenny    € 109,153.00    € -    € 109,153.00      Laois    € 62,996.00    € -    € 62,996.00      Leitrim    € 10,929.00    € -    € 10,929.00      Limerick    € 887,377.00    € 1,794,046.00    € 2,681,423.00      Longford    € 878,622.00    € 118,872.00    € 997,494.00      Louth    € 1,014,844.00    € -    € 1,014,844.00      Mayo    € 272,560.00    € 1,024,293.00    € 1,296,853.00      Meath    € 80,670.00    € 318,106.00    € 398,776.00      Monaghan    € 663,176.00    € -    € 663,176.00      Offaly    € 266,415.00    € -    € 266,415.00      Roscommon    € 45,618.00    € 111,315.00    € 156,933.00      Sligo    € 278,450.00    € 1,421,513.00    € 1,699,963.00      Tipperary    € 423,031.00    € 159,806.00    € 582,837.00      Waterford    € 405,214.00    € 280,647.00    € 685,861.00      Westmeath    € 939,733.00    € 3,799.00    € 943,532.00      Wexford    € 2,690,142.00    € 322,408.00    € 3,012,550.00      Wicklow    € 2,646,240.00    € 435,723.00    € 3,081,963.00       Total      € 20,891,565.00      € 14,747,750.00      € 35,639,315.00       ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 236. Deputy Joe Cooney asked the Minister for Education and Youth the amount of funding her Department provided to schools for works under the Summer Works Scheme in 2024 and 2025, by county, in tabular form; and if she will make a statement on the matter. [72772/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_220",
          "debateSectionId": "dbsect_220",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_220.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_236",
        "questionNumber": 236
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 310 to 312, inclusive, together.  The Vacant Property Refurbishment Grant, introduced in July 2022, provides a grant of up to €50,000 for the refurbishment of vacant properties for occupation as a principal private residence and for properties which will be made available for rent. A top-up grant of up to €20,000 is available where the property is confirmed to be derelict, bringing the total grant available for a derelict property up to a maximum of €70,000. In order to qualify for the grant, the property must be vacant for two years or more at the time of application.  The grant process involves the local authority receiving and reviewing applications to ensure that the grant conditions are met and arranging for a qualified person to visit the property to check the refurbishment work being applied for and to assess the proposed cost. Following confirmation of a successful application and the works being completed, the local authority will conduct a final property visit to review that the work has been completed in-line with the grant application. Once the local authority is satisfied, they will then pay the grant.  Payment of the grant at the end of the process is to ensure that the applicant has carried out the works applied for and for which the grant is being paid. This is also the case for grants such as the SEAI grants and Housing Adaptation Grants, which are paid when works are completed.  A comprehensive review of the Vacant Property Refurbishment Grant was undertaken in 2024, which considered all aspects of the scheme including the matter of staged payments. The review of the grant and the commitments contained in the Programme for Government were considered as part of the new housing plan which was launched in November.  Delivering Homes, Building Communities 2025-2030 will support the refurbishment of a total of 20,000 homes using the grant. The housing plan has also committed to improve and expand the Vacant Property Refurbishment Grant including by introducing an 'Above the Shop' top up grant. The new Vacant over the Shop Grant will have a stepped approach to adding additional homes, with a grant package of up to €100,000 currently envisaged where one residential unit is being created and a total package of up to €140,000 envisaged if three or more homes are created. My Department is currently progressing this work. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 310. Deputy Joe Cooney asked the Minister for Housing, Local Government and Heritage if the national target for the Vacant Property Refurbishment Grant, is to bring back 20,000 homes into use by 2030 or annually up to 2030; and if he will make a statement on the matter. [73210/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_277",
          "debateSectionId": "dbsect_277",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_277.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_310",
        "questionNumber": 310
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 310 to 312, inclusive, together.  The Vacant Property Refurbishment Grant, introduced in July 2022, provides a grant of up to €50,000 for the refurbishment of vacant properties for occupation as a principal private residence and for properties which will be made available for rent. A top-up grant of up to €20,000 is available where the property is confirmed to be derelict, bringing the total grant available for a derelict property up to a maximum of €70,000. In order to qualify for the grant, the property must be vacant for two years or more at the time of application.  The grant process involves the local authority receiving and reviewing applications to ensure that the grant conditions are met and arranging for a qualified person to visit the property to check the refurbishment work being applied for and to assess the proposed cost. Following confirmation of a successful application and the works being completed, the local authority will conduct a final property visit to review that the work has been completed in-line with the grant application. Once the local authority is satisfied, they will then pay the grant.  Payment of the grant at the end of the process is to ensure that the applicant has carried out the works applied for and for which the grant is being paid. This is also the case for grants such as the SEAI grants and Housing Adaptation Grants, which are paid when works are completed.  A comprehensive review of the Vacant Property Refurbishment Grant was undertaken in 2024, which considered all aspects of the scheme including the matter of staged payments. The review of the grant and the commitments contained in the Programme for Government were considered as part of the new housing plan which was launched in November.  Delivering Homes, Building Communities 2025-2030 will support the refurbishment of a total of 20,000 homes using the grant. The housing plan has also committed to improve and expand the Vacant Property Refurbishment Grant including by introducing an 'Above the Shop' top up grant. The new Vacant over the Shop Grant will have a stepped approach to adding additional homes, with a grant package of up to €100,000 currently envisaged where one residential unit is being created and a total package of up to €140,000 envisaged if three or more homes are created. My Department is currently progressing this work. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 311. Deputy Joe Cooney asked the Minister for Housing, Local Government and Heritage if the 'above-the-shop' top-up grant package of up to €140,000 will be awarded on a per single property basis or on a per unit delivered basis; and if he will make a statement on the matter. [73211/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_277",
          "debateSectionId": "dbsect_277",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_277.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_311",
        "questionNumber": 311
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 310 to 312, inclusive, together.  The Vacant Property Refurbishment Grant, introduced in July 2022, provides a grant of up to €50,000 for the refurbishment of vacant properties for occupation as a principal private residence and for properties which will be made available for rent. A top-up grant of up to €20,000 is available where the property is confirmed to be derelict, bringing the total grant available for a derelict property up to a maximum of €70,000. In order to qualify for the grant, the property must be vacant for two years or more at the time of application.  The grant process involves the local authority receiving and reviewing applications to ensure that the grant conditions are met and arranging for a qualified person to visit the property to check the refurbishment work being applied for and to assess the proposed cost. Following confirmation of a successful application and the works being completed, the local authority will conduct a final property visit to review that the work has been completed in-line with the grant application. Once the local authority is satisfied, they will then pay the grant.  Payment of the grant at the end of the process is to ensure that the applicant has carried out the works applied for and for which the grant is being paid. This is also the case for grants such as the SEAI grants and Housing Adaptation Grants, which are paid when works are completed.  A comprehensive review of the Vacant Property Refurbishment Grant was undertaken in 2024, which considered all aspects of the scheme including the matter of staged payments. The review of the grant and the commitments contained in the Programme for Government were considered as part of the new housing plan which was launched in November.  Delivering Homes, Building Communities 2025-2030 will support the refurbishment of a total of 20,000 homes using the grant. The housing plan has also committed to improve and expand the Vacant Property Refurbishment Grant including by introducing an 'Above the Shop' top up grant. The new Vacant over the Shop Grant will have a stepped approach to adding additional homes, with a grant package of up to €100,000 currently envisaged where one residential unit is being created and a total package of up to €140,000 envisaged if three or more homes are created. My Department is currently progressing this work. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 312. Deputy Joe Cooney asked the Minister for Housing, Local Government and Heritage his plans on making the Vacant Homes Grant payment available in staged payments; and if he will make a statement on the matter. [73212/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_277",
          "debateSectionId": "dbsect_277",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_277.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_312",
        "questionNumber": 312
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  As this is an operational matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 381. Deputy Joe Cooney asked the Minister for Health the number of persons currently on the waiting list for home help services within CHO 3; the total number of hours allocated currently; the total number of hours actually being provided; and if she will make a statement on the matter. [72764/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_336",
          "debateSectionId": "dbsect_336",
          "showAs": "Health Services Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_336.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_381",
        "questionNumber": 381
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 382. Deputy Joe Cooney asked the Minister for Health the number of WTE dentists and dental nurse posts filled at Sixmilebridge Health Centre in 2024 and to-date in 2025, in tabular form. [72765/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_337",
          "debateSectionId": "dbsect_337",
          "showAs": "Dental Services ",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_337.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_382",
        "questionNumber": 382
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter I have asked the HSE to respond to the deputy as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 383. Deputy Joe Cooney asked the Minister for Health the number of WTE consultant otolaryngologist based at University Hospital Limerick in 2024 and to-date in 2025, in tabular form. [72766/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_338",
          "debateSectionId": "dbsect_338",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_338.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_383",
        "questionNumber": 383
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 384. Deputy Joe Cooney asked the Minister for Health the number of WTE psychologists based at Shannon Health Centre in 2024 and to-date in 2025, in tabular form. [72767/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_339",
          "debateSectionId": "dbsect_339",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_339.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_384",
        "questionNumber": 384
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  I can confirm that the Department of Rural and Community Development and the Gaeltacht does not employ any architects or structural engineers. The Department does not have a requirement for these skillsets as it does not deliver capital works directly, with the majority of our schemes delivered through local authorities. The Department does, however, have a qualified quantity surveyor and a civil engineer who assist in oversight of project planning and delivery. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 452. Deputy Joe Cooney asked the Minister for Rural and Community Development and the Gaeltacht the number of WTE qualified architect and structural engineers employed by his Department in 2024 and to-date in 2025, in tabular form. [72773/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_402",
          "debateSectionId": "dbsect_402",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_402.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_452",
        "questionNumber": 452
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  The CLÁR programme provides funding for small-scale projects in rural areas that have experienced significant levels of de-population. It supports a wide range of community facilities and amenities under measure 1 and community vehicles under measure 2. Measure 3 relates to funding for island communities. In 2025 I was delighted to announce a record €14 million in CLÁR funding for 238 projects under all measures.  As requested by the Deputy, the following table shows the number of applications submitted for CLÁR 2025 under measures 1 and 2, in each county and the number of successful applications under those measures.      County      Measure 1 No. of Projects Received      Measure 1 No. of Projects Approved      Measure 2 No. of Projects Received      Measure 2 No. of Projects Approved        Carlow     6    5    0    0       Cavan     15    9    0    0       Clare     15    9    1    0       Cork     16    10    9    4       Donegal     16    10    2    2       Galway     16    10    4    2       Kerry     16    10    6    4       Kilkenny     6    6    0    0       Laois     15    9    0    0       Leitrim     15    9    0    0       Limerick     15    9    1    0       Longford     10    9    2    1       Louth     15    9    1    1       Mayo     16    10    10    7       Meath     8    7    0    0       Monaghan     15    9    4    2       Offaly     10    7    3    1       Roscommon     15    9    4    2       Sligo     16    9    0    0       Tipperary     15    9    2    2       Waterford     7    7    2    2       Westmeath     15    9    1    1       Wicklow     8    8    1    1       Total      301      198      53      32       ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 453. Deputy Joe Cooney asked the Minister for Rural and Community Development and the Gaeltacht the number of applications for the CLÁR funding under measures 1 and measure 2 in 2025, in each county; the number of successful applications under each measure, in tabular form; and if he will make a statement on the matter. [72774/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_403",
          "debateSectionId": "dbsect_403",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_403.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_453",
        "questionNumber": 453
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Localised flooding issues are a matter, in the first instance, for each Local Authority to investigate and address, and a Local Authority may carry out flood mitigation works using its own resources.  Local Authorities may apply to the OPW for funding for flood mitigation works under the OPW's Minor Flood Mitigation Works and Coastal Protection Scheme. This scheme was introduced by the OPW on an administrative, non-statutory basis in 2009. The purpose of the scheme is to provide funding to Local Authorities to undertake minor flood mitigation works, or studies to address localised flooding and coastal protection problems within their administrative areas.  Since its introduction in 2009, some €70 million has been approved under the Scheme for some 900 local authority led projects that are delivering flood mitigation and coastal protection for some 8,000 properties.  On 21st August 2025, I announced an increase in funding supports are to be made available to Local Authorities under the Minor Flood Mitigation Works and Coastal Protection Scheme. I also announced €3m in funding is to be made available to Local Authorities for approved projects under this scheme to remove river conveyance blockages, which are causing an increase in flood risk from rivers to properties.  The OPW is finalising the details of these revisions and I expect to advise Local Authorities of the revised criteria for the Scheme, including the €3m fund for the removal of river conveyance blockages, in the coming weeks. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 58. Deputy Joe Cooney asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the progress made with the revision to the minor works scheme, particularly with regard to removing river conveyance blockages; and if he will make a statement on the matter. [69533/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_97",
          "debateSectionId": "dbsect_97",
          "showAs": "Flood Relief Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_97.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_58",
        "questionNumber": 58
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  This government is fully committed to supporting students with special educational needs to fulfil their full potential and the Programme for Government makes a number of commitments to deliver on this objective.  Through the accelerated provision of additional special class and special school places over recent years, there are now over 30,000 students enrolled in special classes and special schools. 2,700 new places were created for the 2025/26 school year and these, together with the over 1,200 existing places due to students moving on from primary schools and post-primary schools, has meant that close to 4,000 specialist places were made available for the 2025/26 school year.  407 new special classes were sanctioned for the 2025/26 school year. Of these 7 are in County Clare, 3 at primary and 4 at post-primary level.  This brings to 83 the number of special classes currently in operation in the county. There are also 2 special schools in County Clare with approximately 247 students enrolled.  A list of schools with special classes, broken by location and class designation is published annually by the NCSE on their [ website ].  The NCSE is currently collating the data and information received by 1 October through the Parents Notify process and are engaging with schools regarding where specialist provision is best placed for the 2026/27 school year. It is expected that many of these special classes will be sanctioned by 31 December 2025.  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 126. Deputy Joe Cooney asked the Minister for Education and Youth the location, pupil numbers and maximum capacity by class for ASD units in each primary and post-primary school in County Clare, for 2024-2025 and 2025-2026 school years, in tabular form; and if she will make a statement on the matter. [69532/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_149",
          "debateSectionId": "dbsect_149",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_149.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_126",
        "questionNumber": 126
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  As Minister of State for International & Road Transport, Logistics, Rail & Ports, I wish to advise that the driver licensing exchange process is handled by the National Driver Licence Service, the provision of which I have delegated under national legislation to the Road Safety Authority.  As part of the standard governance processes for State agencies under my Department, officials from the Department meet with senior management from the Authority on a quarterly basis to discuss a range of issues. This includes operational performance and potential areas of concern.  The final quarterly governance meeting for the RSA will take place in the coming weeks and I will request that my officials seek an analysis from the RSA regarding the licence exchange process. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 274. Deputy Joe Cooney asked the Minister for Transport his plans to simplify and improve the driving licence exchange process; and if he will make a statement on the matter. [70160/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_253",
          "debateSectionId": "dbsect_253",
          "showAs": "Driver Licences",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_253.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_274",
        "questionNumber": 274
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  My Department undertakes the Lead Government Department role, as set out in the Strategic Emergency Management (SEM) Framework (2017), in relation to the coordination of national level responses to severe weather and flooding emergencies, where warranted. My Department's National Directorate for Fire and Emergency Management undertakes this role and works closely with local authority Severe Weather Assessment Teams and Met Éireann.  Local authorities are designated as the lead agencies for coordinating a response to flooding and severe weather emergencies. All local authorities have an established Severe Weather Assessment Team in place, monitoring Met Éireann weather warnings, High Tide Advisories and the European Flood Awareness System (EFAS) advisory warnings. Local authorities also have Severe Weather/ Flood Plans in place to support the response to weather emergencies.  Since 2009, my Department has made financial support of over €100 million available to assist local authorities in meeting the unbudgeted costs of clean-up and necessary immediate works, including for exceptional overtime payments, the hire of plant and heavy machinery, the purchase of materials required for the clean-up and the hire of contractors associated with significant severe weather emergency events.  This is in recognition of the exceptional nature of the activities carried out by local authorities in responding to these types of emergencies and the fact that the costs of these un-programmed activities could not be foreseen in annual expenditure planning. This practice is considered a vital enabler to underpin a rapid response by local authorities.  In the context of Storm Éowyn and the exceptional nature of the response activities carried out by local authorities, clearly the costs of these activities were not budgeted for within existing resources. As always, my Department, in consultation with the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation, has been working with local authorities as they coordinated recovery and restoration works.  My Department is currently in the payments process, reviewing applications and clarifying claims with local authorities, with payments to be completed before year end.  It should be noted that funding the repair of public infrastructure is undertaken by the relevant Department in line with its sectoral responsibility. Capital costs associated with infrastructural damage, for example damage to the roads network and coastal protection infrastructure (where necessary), are funded under relevant sectoral arrangements. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 496. Deputy Joe Cooney asked the Minister for Housing, Local Government and Heritage the costs incurred by each local authority, as a result of storm Éowyn, in tabular form; and if those local authorities have been fully reimbursed for those costs by the Exchequer; and if he will make a statement on the matter. [69438/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_432",
          "debateSectionId": "dbsect_432",
          "showAs": "Weather Events",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_432.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_496",
        "questionNumber": 496
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I recently announced a developer-led wastewater infrastructure initiative to support housing delivery in areas where Uisce Éireann’s services are currently insufficient or not planned in the near term.  Developers will be able to fund and deliver the necessary infrastructure, with Uisce Éireann overseeing design and construction to ensure regulatory compliance and assuming ownership once completed. The framework has been agreed with Uisce Éireann and preparation for implementation is under way, with all measures to be in place by the end of the first quarter of 2026.  This initiative is based on close collaboration between developers and Uisce Éireann on the development of wastewater solutions. I do not propose to convene a separate expert panel at this time. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 516. Deputy Joe Cooney asked the Minister for Housing, Local Government and Heritage if he will convene an expert panel including, Uisce Éireann, the EPA, construction industry and manufacturers of modular wastewater treatment systems to develop a practical, certified delivery-focused set of planning guidelines to enable the swift roll out of developer-led waste water infrastructure; and if he will make a statement on the matter. [70161/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_450",
          "debateSectionId": "dbsect_450",
          "showAs": "Wastewater Treatment",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_450.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_516",
        "questionNumber": 516
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The Vacant Property Refurbishment Grant, introduced in July 2022, provides a grant of up to €50,000 for the refurbishment of vacant properties for occupation as a principal private residence and for properties which will be made available for rent. A top-up grant of up to €20,000 is available where the property is confirmed to be derelict, bringing the total grant available for a derelict property up to a maximum of €70,000. In order to qualify for the grant, the property must be vacant for two years or more at the time of application.  The objective of the grant is to support the refurbishment of vacant and derelict properties, bringing them back into use as homes. In order to qualify for the grant, the property must be vacant for two years or more at the time of application.  The grant is currently available for the conversion of former commercial or public use buildings as well as \"Above the Shop\" type conversions.  The Housing Plan Delivering Homes, Supporting Communities, reinforces and expands the range of existing measures being implemented by Government to tackle the issue of vacancy and dereliction. The plan includes additional support under the Vacant Property Refurbishment Grant for the refurbishment and conversion of above the shop vacant floors for use as homes. In recognition of the works involved a package of up to €140,000 will be made available, which will include availability of an expert advice grant. My Department is currently progressing work to introduce the “Above the Shop\" scheme. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 517. Deputy Joe Cooney asked the Minister for Housing, Local Government and Heritage the details of the above-the-shop expansion to the vacant property refurbishment grant; and if he will make a statement on the matter. [70162/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_451",
          "debateSectionId": "dbsect_451",
          "showAs": "Vacant Properties",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_451.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_517",
        "questionNumber": 517
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The Department of Social Protection provides a suite of income supports for those who are unable to work due to illness or disability. Entitlement to these supports is generally not contingent on the nature of the illness but on the extent to which a particular illness impairs or restricts a person’s capacity to work.  Invalidity Pension is a social insurance payment for people aged under 66 who cannot work due a long-term illness or disability. To qualify, the person must have been incapable of work for at least 12 months and be likely to be incapable of work for at least another 12 months or must be permanently incapable of work.  Self-employed persons pay Class S Pay Related Social Insurance, PRSI, contributions which are reckonable for Invalidity Pension. Other Classes that are reckonable for Invalidity Pension are A, E, and H contributions. Claimants must have 260 weeks of paid PRSI contributions since entering social insurance and 48 weeks of paid or credited PRSI contributions in the last or second-last complete contribution year before the ‘relevant date’ – this is the date of the start of the person’s permanent incapacity for work as determined by the department.  Disability Allowance is my Department's primary disability related social assistance scheme. Disability Allowance is a means-tested payment for people with a disability who are aged between 16 and 66. In order to be eligible, the disability must be expected to last for at least one year. The allowance is also subject to a means test, a medical assessment and a habitual residency requirement. The purpose of the means test is to ensure that resources are directed to those with the greatest need for income supports by the State.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 544. Deputy Joe Cooney asked the Minister for Social Protection the supports available for self-employed people who are unable to work due to a life changing medical diagnosis; and if he will make a statement on the matter. [69437/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_472",
          "debateSectionId": "dbsect_472",
          "showAs": "Social Welfare Benefits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_472.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_544",
        "questionNumber": 544
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 968. Deputy Joe Cooney asked the Minister for Health the number of MRI scans that take place in UHL by day of the week, for each month since October 2024, in tabular form; and if she will make a statement on the matter. [69436/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_799",
          "debateSectionId": "dbsect_799",
          "showAs": "Hospital Procedures",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_799.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_968",
        "questionNumber": 968
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  This is a matter for Department of Social Protection and should be redirected to that Department. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 969. Deputy Joe Cooney asked the Minister for Health the supports available for self-employed people who are unable to work due to a life changing medical diagnosis; and if she will make a statement on the matter. [69444/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_800",
          "debateSectionId": "dbsect_800",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_800.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_969",
        "questionNumber": 969
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  The Business Energy Upgrades Scheme is funded by my Department and administered by the Sustainable Energy Authority of Ireland (SEAI) as part of a suite of business supports. In 2024 alone, the SEAI Business Supports provided grant support of over €40 million to over 3,000 businesses significantly supporting energy cost reduction, competitiveness, and emissions reduction.  The Business Energy Upgrades Scheme was opened for applications in November 2024 and offers businesses access to rapid approval grant funding for a range of retrofit measures for buildings such as hotels, offices, retail and restaurants. There has been strong activity on the application portal with a large volume of draft applications (over 550) as people review the potential options. Typically, some time is required by the commercial sector to prepare the necessary details before submitting the application. 167 applications have been approved with a combined total in offers of €2.99 million supporting a total of 304 measures. All nine measures available are represented within this package of applications which is a good initial indicator of the public’s interest in the overall suite of technologies provided.  The Business Energy Upgrades Scheme is critical to supporting a higher rate of commercial building retrofit and is expected to double the number of commercial building retrofits and heat pumps supported from 2024 to 2025.  A table showing the breakdown by county is attached.  A county breakdown, with number of businesses per county, is in the table beneath:     County     € Potential Grant Amount      Businesses       Dublin    € 975,650.36    24      Cork    € 345,738.11    21      Waterford    € 310,685.86    11      Cavan    € 222,965.33    5      Galway    € 150,480.55    8      Louth    € 140,962.46    4      Carlow    € 131,232.16    4      Kilkenny    € 122,404.50    2      Meath    € 103,965.93    4      Sligo    € 99,901.25    5      Clare    € 73,798.00    2      Kerry    € 54,119.29    4      Tipperary    € 39,296.20    2      Limerick    € 37,220.00    4      Longford    € 33,853.00    3      Laois    € 27,543.50    1      Donegal    € 25,703.57    4      Roscommon    € 23,569.37    1      Kildare    € 20,028.54    2      Offaly    € 19,098.00    4      Monaghan    € 14,459.00    4      Wexford    € 12,320.00    2      Wicklow    € 3,080.00    1       Total      € 2,988,074.98      122       ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 31. Deputy Joe Cooney asked the Minister for Climate, Energy and the Environment if he will provide details of the number of SMEs that have participated in the business energy upgrade scheme since its inception; and a breakdown of the measures supported, by county, in tabular form; and if he will make a statement on the matter. [67622/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_35",
          "debateSectionId": "dbsect_35",
          "showAs": "Environmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_35.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_31",
        "questionNumber": 31
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Transport  The Deputy may be aware my predecessor, Eamon Ryan, previously met with the then Minister of State with responsibility for the Office of Public Works, Patrick O’Donovan, to discuss the complex issues in relation to flooding in the Ballycar area. At that meeting the OPW Chair advised he would reconvene the steering group behind a December 2020 Report on Ballycar to continue discussions.  The steering group in question includes Iarnród Éireann, the OPW, Clare County Council and the Geological Survey Ireland. Officials from my Department will engage with the OPW on reconvening the group with a view to progressing the matter, including how these works will be funded. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 111. Deputy Joe Cooney asked the Minister for Transport if the preferred option of a technically viable drainage scheme that would prevent flooding at Ballycar, contained within the report undertaken by consultant engineers RPS for Iarnród Eireann and stakeholder representatives from Clare County Council, the Office of Public Works, the Geological Survey Ireland and the National Parks &amp; Wildlife Services, has been costed; if that project is included for delivery in the NDP 2026–2030 Department’s Sectoral Investment Plan; and if he will make a statement on the matter. [67625/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_98",
          "debateSectionId": "dbsect_98",
          "showAs": "Flood Risk Management",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_98.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_111",
        "questionNumber": 111
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The purpose of the Climate Action Summer Works Scheme (CASWS) is to enable individual school authorities to undertake small-scale building works on a devolved basis that, ideally, can be carried out during the summer months or at other times that avoid disrupting the operation of the school. The CASWS operates on a multi-annual basis across a number of categories of works.  It is envisaged that approvals in any given year will involve a spread of categories rather than the traditional single category at a time. This is aimed at managing market capacity and maximising value for money opportunities for school authorities.  The CASWS will operate on a multi-annual basis. In November 2025, my colleague the former Minister of Education and Youth, Helen McEntee TD, announced the first tranche of approvals under the new Climate Action Summer Works Scheme. 297 projects were approved to proceed and involve primary, post primary and special schools, along with projects in all counties and across all categories of works.  My Department can confirm an application was received from the school in question however the school was not on the list of approvals in the first tranche. Given that funding is limited in any particular year it is necessary to prioritise applications. Under the new climate action summer works scheme which operates on a multi-annual basis, like previous summer works schemes, applications from schools that are not reached for funding or market prioritisation reasons in 2026 will qualify to be assessed for purposes of the funding available for climate action summer works in subsequent years.  It is anticipated that the next tranche of approvals will be in the latter half of 2026.  Full details of the of the announcement and the list of schools approved in the first tranche, the Circular (0029/2025) for the scheme and guidance documents for schools can be found at the below link; www.gov.ie/en/department-of-education/services/summer-works-scheme/. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 247. Deputy Joe Cooney asked the Minister for Education and Youth for an update on the application by a school (details supplied) under the summer works scheme; and if she will make a statement on the matter. [67624/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_231",
          "debateSectionId": "dbsect_231",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_231.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_247",
        "questionNumber": 247
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  There are currently 32 employers who remain in receipt of the Employment Support Scheme with 38 employees supported, as of October 2025.  The Employment Support Scheme offered financial support to employers to cover a disabled employee’s productivity shortfall. The employer paid 100% of the gross wage, then claimed between 20%-50% back, depending on, what was then described as the employee’s productivity shortfall.  The Wage Subsidy Scheme came into operation as a pilot scheme in September 2005. It replaced the Pilot Programme for the Employment of People with Disabilities and the Employment Support Scheme, both of which were closed to new applicants at that time.  Following a review of its pilot phase, the Wage Subsidy Scheme was placed on a permanent non-statutory footing in October 2008.  Customers on the Pilot Programme for the Employment of People with Disabilities were absorbed into Wage Subsidy Scheme. Any employee in an employment subsidised under the Employment Support Scheme in 2005 when the scheme closed to new applicants was allowed to remain on the scheme, but only in that specific employment. If the Employment Support Scheme employment terminates, the employee cannot transfer their Employment Support Scheme to a new employment but can instead apply for the Wage Subsidy Scheme.  There are currently 1,509 employers availing of the Wage Subsidy Scheme with 2,538 employees supported through the scheme.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 371. Deputy Joe Cooney asked the Minister for Social Protection the numbers of people who remain in receipt of the employment support scheme for people with disabilities, a predecessor of the wage subsidy scheme; and if he will make a statement on the matter. [67623/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_332",
          "debateSectionId": "dbsect_332",
          "showAs": "Employment Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_332.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_371",
        "questionNumber": 371
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "showAs": " 504. Deputy Joe Cooney asked the Minister for Housing, Local Government and Heritage whether the proposed arrangements for Uisce Éireann to take in charge privately developed wastewater treatment systems will be included in either an oversight agreement/performance delivery agreement or shareholders letter of expectation with its parent Department. [65133/25] ",
        "debateSection": {
          "showAs": "Wastewater Treatment",
          "debateSectionId": "dbsect_467",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_467",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_467.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Joe Cooney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "memberCode": "Joe-Cooney.D.2024-11-29"
        },
        "questionNumber": 504,
        "answerText": " Minister for Housing, Local Government and Heritage  I have recently outlined new arrangements to allow privately developed wastewater treatment systems to be constructed to Uisce Éireann standards and subsequently taken into public ownership and operation.  These arrangements are intended to support housing delivery in areas where wastewater capacity has constrained development, while ensuring that environmental and regulatory standards are protected.  In this context, I have written to both Uisce Éireann and the Environmental Protection Agency (EPA) setting out the arrangements and the requirements that must apply. Any privately delivered infrastructure must meet Uisce Éireann’s design, construction and commissioning standards, and must comply with EPA regulatory obligations. It also makes clear that Uisce Éireann will assume ownership and operational responsibility for these assets.  With regard to governance, these arrangements will be incorporated into the existing oversight framework for Uisce Éireann. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_504",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 505. Deputy Joe Cooney asked the Minister for Housing, Local Government and Heritage the number of applications, and the number of approvals, for the local authority purchase and renovate loan applications, by county, by year to date in 2025, in tabular form; and if he will make a statement on the matter. [65135/25] ",
        "debateSection": {
          "showAs": "Departmental Data",
          "debateSectionId": "dbsect_468",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_468",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_468.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Joe Cooney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "memberCode": "Joe-Cooney.D.2024-11-29"
        },
        "questionNumber": 505,
        "answerText": " Minister for Housing, Local Government and Heritage  Applications for a Local Authority Purchase and Renovation (LAPR) Loan are made through individual local authorities and the final decision on loan approval is a matter for the relevant local authority and its Credit Committee on a case-by-case basis.  Decisions on all housing loan applications must be made in accordance with Regulations establishing the scheme and the Credit Policy that underpins the scheme, in order to ensure a prudent and consistent approach in the best interests of both borrowers and the lenders, the local authorities.  Information on the number of persons making applications for a LAPR loan to local authorities is not held by my Department. My Department publishes information on the number and value of (i) local authority loan approvals and (ii) local authority loan drawdowns for both the Local Authority Home Loan and the Local Authority Purchase and Renovation Loan. Local authority approval means that an official letter of offer has been sent to a borrower (and therefore relates to a specific property and loan amount). Information on the Local Authority Purchase and Renovation Loan is published at national level only. This is done to ensure that no individual is identifiable from the data provided, following principles laid out in both the General Data Protection Regulation and Data Protection Act of 2018  Information on drawdowns, approvals, average drawdowns, and average approvals for Local Authority Home Loans and Local Authority Purchase and Renovation loans are available on my Department’s website at the following link:  https://www.gov.ie/en/collection/42d2f-local-authority-loan-activity/#local-authority-loans-approvedpaid ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_505",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 751. Deputy Joe Cooney asked the Minister for Children, Disability and Equality the number of childminders who have registered in County Clare to the end of October 2025; the number of people in County Clare who have completed the Children First E-Learning Programme; and if she will make a statement on the matter. [65136/25] ",
        "debateSection": {
          "showAs": "Departmental Data",
          "debateSectionId": "dbsect_667",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_667",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_667.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Joe Cooney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "memberCode": "Joe-Cooney.D.2024-11-29"
        },
        "questionNumber": 751,
        "answerText": " Minister for Children, Disability and Equality  In County Clare, 5 Childminding Services were recorded as registered with Tusla at the end of September 2025, and a total of 26 people have completed the pre-registration training to date.  Childminders are a hugely important part of early learning and care and school-age childcare provision, and they continue to be the option of choice for many families.  The National Action Plan for Childminding 2021-2028 set out a pathway for the extension of registration to childminders who work in their own homes. As a result of the commencement of the relevant parts of the Child Care (Amendment) Act 2024 and the Childminding Services Regulations, which came into effect on 30 September 2024, childminders are now able to apply to register with Tusla and can therefore also take part in the National Childcare Scheme.  The regulation of childminding services is critical to the safeguarding of children. The route to registration under the new regulations requires childminders to undertake pre-registration training, as well as meeting certain regulatory requirements including Garda vetting, first aid certification and child safeguarding training.  We are now in a 3-year transition period (to September 2027) during which childminders are being encouraged and supported to register, but registration is not yet mandatory.  This phased approach aims to facilitate the largest possible number of childminders to enter the regulated sector, the sphere of quality assurance, and access to Government subsidies, while recognising the time and supports required for childminders to learn about and prepare for registration.  Supports are available for childminders at local level through the City and County Childcare Committees. Each City and County Childcare Committee employs a Childminding Development Officer, who provides a range of supports to local childminders, including delivery of the short pre-registration training course. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Children",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_751",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_101",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_101",
          "showAs": "Post Office Network",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_101.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 70. Deputy Joe Cooney asked the Minister for Culture, Communications and Sport if he will consider permitting community social enterprises to operate post offices; and if he will make a statement on the matter. [60299/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_70",
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  An Post has statutory responsibility for the State’s postal service and the post office network. An Post is a commercial State company with a mandate to act commercially and, as such, day to day operational matters, including decisions in relation to the size, distribution, and future of the network, are matters for the Board and the management of the company directly.  Operational matters relating to the post office network are a matter for the Board and management of An Post and and as such the matter to which you refer is not one in which I, as Minister, have a role. ",
        "questionNumber": 70,
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 140,
        "showAs": " 140. Deputy Joe Cooney asked the Minister for Transport the number of passenger journeys in each of   the past three years on Local Link services in County Clare; and if he will make a statement on the matter. [63385/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Joe Cooney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "memberCode": "Joe-Cooney.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_140",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_98",
          "showAs": "Bus Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_98",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_98.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Transport  As Minister of State at the Department of Transport with special responsibility for Rural Transport, I have responsibility for policy and overall funding in relation to rural public transport service provision; however, I am not involved in the day-to-day operations.  The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally. In light of the NTA responsibilities I have referred your question to the NTA for direct reply to you. Please advise my private office if you do not receive a reply within ten working days. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 155,
        "showAs": " 155. Deputy Joe Cooney asked the Minister for Transport the progress made on the proposed flood mitigation measures at Ballycar, County Clare; and if he will make a statement on the matter. [63384/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Joe Cooney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "memberCode": "Joe-Cooney.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_155",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_114",
          "showAs": "Flood Relief Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_114",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_114.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  The Deputy may be aware my predecessor, Eamon Ryan, previously met with the then Minister of State with responsibility for the Office of Public Works, Patrick O’Donovan, to discuss the complex issues in relation to flooding in the Ballycar area. At that meeting the OPW Chair advised he would reconvene the steering group behind a December 2020 Report on Ballycar to continue discussions.  The steering group in question includes Iarnród Éireann, the OPW, Clare County Council and the Geological Survey Ireland. Officials from my Department will engage with the OPW on reconvening the group with a view to progressing the matter.  Of relevance, the Department of Transport's annual capital allocations from 2026 to 2030 were confirmed in the Review of the National Development Plan (NDP), published by the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation in July. The Department of Transport is currently finalising its NDP Sectoral Investment Plan in the context of that capital funding envelope and a decision on a programme of delivery, including investments in the rail sector, with this level of capital investment, will be made shortly. The related Sectoral Plan is expected to be published within a month. ",
        "date": "2025-11-18"
      }
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Children, Disability and Equality  The Programme for Government commits to placing an autism strategy on a statutory footing. This commitment has recently been reiterated in the National Human Rights Strategy for Disabled People, which was published in September 2025.  The Department will consider how best to fulfil this commitment as part of a wider review of disability legislation which is currently being planned. The new National Human Rights Strategy for Disabled People recognises that there is a need to review and update existing disability legislation and to consider where a need for new legislation may exist, particularly since Ireland ratified the UNCRPD. This is to ensure that our disability legislation properly accounts for the human rights of disabled people.  The review will encompass a number of pieces of legislation on disability, including the Disability Act 2005, the Irish Sign Language Act 2017, and the Assisted Decision-Making (Capacity) Acts.  The Programme for Government also contains a commitment to the full implementation of the current Autism Innovation Strategy. This is my immediate priority. The Strategy was launched in August 2024.  It contains 83 actions which aim to make a meaningful difference to the lives of autistic people. An implementation period of 18-months was set for the Strategy.  11 Government Departments and related public bodies committed to leading on, or supporting, actions in the Strategy. They submit progress reports at 6-month intervals, which are considered by a stakeholder-led Oversight and Advisory Group. This group plays a key role in monitoring the implementation of the Strategy, and in providing constructive advice to guide whole-of-Government work on autism based on the lived experience and expertise of group members. This group meets quarterly.  I am pleased to report that significant progress has been made on the implementation of the Strategy. Departments submitted their 12-month progress reports in August of this year. There is still work to be done, but these reports showed that the vast majority of actions are on schedule or completed.  The Department of Children, Disability, Equality is leading on 7 actions within the Strategy and I am pleased to say that we are on track to deliver upon these commitments within the projected implementation timeframe.  Where the Oversight and Advisory Group identifies priority areas for delivery, these have been, and will continue to be, escalated to the Strategy Steering Committee. This Group is chaired by the Minister of State for Disability and includes representatives from relevant departments and agencies as well as representatives from the Oversight and Advisory Group. The most recent meeting was held in late September. ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Joe Cooney",
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_59.xml"
            }
          },
          "debateSectionId": "dbsect_59",
          "showAs": "Disability Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_59"
        },
        "questionNumber": 101,
        "date": "2025-11-12",
        "showAs": " 101. Deputy Joe Cooney asked the Minister for Children, Disability and Equality the steps being taken to fulfil the Programme for Government commitment to place an autism innovation strategy on a statutory footing; and if she will make a statement on the matter. [61512/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_101"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  I have committed to reduce monthly fees to €200 over the lifetime of the Government. The steps in achieving this ambition over the coming years will be set out in the Action Plan on Accessible, High Quality, Affordable Early Learning and Care and School-Age Childcare, which the Department is continuing to develop. In line with the commitment in the Progaramme for Government, the Action Plan will be informed by a broad consultation process.  This Action Plan will build on significant progress in affordability that has already been made through a number of existing Schemes.  The Early Childhood Care and Education (ECCE) Programme, which provides two years of pre-school without charge, enjoys participation rates of 96%. Over 70% of families on low income report that they would not be able to send their child to pre-school without this Programme.  The National Childcare Scheme (NCS) complements the ECCE Programme, providing subsidies – both universal and targeted - to reduce the costs to parents for children to participate in early learning and childcare.  The NCS has undergone a number of enhancements in recent years to further improve affordability for parents. These include the extension of the universal subsidy to all children under 15 and two increases to the minimum hourly subsidy, which is now worth a minimum of €96.20 per week for 45 hours.  Record numbers of children and their families are now benefiting from the NCS. Almost 220,000 unique children benefited from an NCS subsidy in 2024.  Children in childminding settings that have come forward for registration, following changes to the childminder Tulsa registration requirements last September, can also benefit from NCS subsidies.  An evaluation of the National Childcare Scheme is due to start this year. This evaluation will review how the Scheme has performed to date and identify potential enhancements that could be made. The findings from this evaluation will inform the work of the Department in reaching the cap of €200 per month per child within the lifetime of the Government.[ ]  While work on developing the Action Plan is ongoing, we are not waiting until its publication to deliver on key commitments in the Programme for Government. Budget 2026 enables Core Funding to continue to support fee-control measures and will also allow for growth in the sector. The allocation for Core Funding in 2026 will ensure fees remain at 2021 levels for a majority of providers. As well as this, there will be a new maximum fee cap set to reduce costs for families paying the highest fees across the country. Further details of the new, lower maximum fee caps will be announced in the coming months.  The 2026 allocation for Core Funding will also support implementation of the recently announced Employment Regulation Orders, which led to a 10% increase in the minimum rate of pay for educators from 13 October.  Further steps will be detailed in the Action Plan, which will look at affordability, access and quality of the early learning and care and school-age childcare system. [ ] ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Joe Cooney",
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_76.xml"
            }
          },
          "debateSectionId": "dbsect_76",
          "showAs": "Childcare Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_76"
        },
        "questionNumber": 118,
        "date": "2025-11-12",
        "showAs": " 118. Deputy Joe Cooney asked the Minister for Children, Disability and Equality if she will outline the roadmap to reduce the cost of childcare to €200 per month per child through the national childcare scheme; and if she will make a statement on the matter. [61511/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_118"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_59",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Joe Cooney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "memberCode": "Joe-Cooney.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_49",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_49",
          "showAs": "National Security",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_49.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 59. Deputy Joe Cooney asked the Tánaiste and Minister for Defence given the risk to our undersea cables and other critical sub-sea infrastructure, the steps his Department is taking to increase the level of naval protection for Irelands Exclusive Economic Zone; and if he will make a statement on the matter. [60300/25] ",
        "questionNumber": 59,
        "answerText": " Tánaiste and Minister for Defence  I propose to take Questions Nos. 17, 27, 49 and 59 together.  The Defence Forces routinely carry out monitoring and surveillance of Ireland’s Exclusive Economic Zone (EEZ) using both Naval Service assets and Air Corps maritime patrol aircraft. In addition to at sea monitoring, the Naval Operations Command Centre in Haulbowline carries out remote monitoring twenty four hours a day, seven days a week.  It is clear that protecting critical undersea infrastructure requires collaboration within the State as well as collaboration with other European states to provide a broader understanding of what is occurring in the greater maritime space. This means that Government Departments and agencies, infrastructure operators, the Defence Forces, the private sector and academia all have a part to play. Safeguarding critical undersea infrastructure requires a multifaceted approach with a wide variation of parties involved.  To that end, my Department has taken the lead in the development of a National Maritime Security Strategy following identification of maritime security as a priority in last year’s Defence Policy Review. This strategy is being developed in consultation with national and international stakeholders and I look forward to its submission to me before the end of this year.  Earlier this year, I approved the Defence Forces participation in the Common Information Sharing Environment (CISE). Joining CISE will support better monitoring and surveillance of growing threats at sea and will help improve the Defence Forces maritime domain awareness. This will aid their decision-making during complex maritime operational scenarios as well as their ability to share information with other EU maritime organisations.  I recently announced the signing of a multi-million euro contract with Thales DMS for the provision of towed sonar capability for the Defence Forces. The new sonar capability will be used on Irish Naval vessels to monitor activities in the Irish Exclusive Economic Zone (EEZ) and, in particular, in the vicinity of subsea communication cables or gas pipelines.  Ireland is actively participating in a number EU PESCO (Permanent Structure Cooperation) projects including, Critical Seabed Infrastructure Protection, Maritime Autonomous and semi-Autonomous Systems for Mine Countermeasures and Upgrade of Maritime Surveillance. These collaborations will enhance cooperation with EU participating states thus benefiting Ireland in the protections of undersea critical infrastructure by enhancing maritime surveillance, situational awareness, response effectiveness and integration of systems. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_84",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Joe Cooney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "memberCode": "Joe-Cooney.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_25",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/debate/dbsect_25",
          "showAs": "Energy Conservation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/debate/mul@/dbsect_25.xml"
            },
            "pdf": null
          }
        },
        "questionType": "oral",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Climate",
          "roleCode": null
        },
        "showAs": " 84. Deputy Joe Cooney asked the Minister for Climate, Energy and the Environment the number of home energy upgrades completed to date this year in each county; the way in which this compared with the same periods of the past five years; and if he will make a statement on the matter. [60298/25] ",
        "questionNumber": 84,
        "answerText": " Deputy Joe Cooney  Everywhere I go these days I see houses getting energy upgrades. They will ensure that our homes will be easier and cheaper to heat and keep warm, which is very welcome. Might the Minister have the number of homes that have completed energy upgrades this year and how that compares with previous years? \n Deputy Alan Dillon  Gabhaim buíochas leis an Teachta for his question. My Department funds a number of grant schemes administered by the SEAI for solar PV and heat pump installation as part of the national retrofit plan. To the end of September 2025, over 41,500 home energy upgrades had been completed with SEAI grant support. That compares with 38,000 in the same period in 2024, 34,000 in 2023, 16,062 in 2022, 9,938 in 2021 and 12,573 in 2020. That represents 10% growth on last year and 22% on 2023, showing strong momentum.  I acknowledge that the approval and completion timelines remain a challenge. We are particularly focused on deep retrofits and the warmer homes scheme. Average wait times, as acknowledged earlier in the House, remain high because the works are complex and demand is strong. We will continue to invest in skilled workers, more contractors and streamlined processes. We are also taking action including simplification of the application process. We are expanding the one-stop shop, which now comprises over 26 contractors, the home energy improvement loan, with rates of 2.99%, and building capacity, which must grow to meet current demand.  Budget 2026 also provided €558 million, an 89% increase, that will be supplemented with ERDF funding. On the specific data in regard to ramping up delivery, we hope by 2030 that targets of over 500,000 B2 retrofits and over 400,000 heat pumps will be delivered. \n Deputy Joe Cooney  One of the issues I have heard from people who have looked to upgrade their traditional built houses, many of which are in our towns and villages as the Minister of State is well aware, is the potential need to engage conservation professionals, given the construction methods. This puts a far greater cost burden on the owner. I am led to believe there is a significant shortage in such professionals, both technical and practical. This makes for huge delay in delivering the energy upgrades and therefore they are far less attractive. For example, the cost of conservation technical expertise to ensure the internal and external walls of these properties are treated properly could erode a grant available of up to 60%. Does the Minister of State have a breakdown of the number of traditional properties that have taken on these energy upgrades? Will the Minister of State consider putting some extra funding in place for people who own these properties to engage conservation professionals? \n Deputy Alan Dillon  I thank the Deputy for his question and for outlining the challenges faced by some homeowners. We are looking at continuing policy development in regard to the national retrofit plan. In recent years, significant changes have been introduced as part of the retrofitting scheme. One part of that was a new pilot to support the retrofitting of traditional built homes. I will work with the Deputy on the specific instance he has raised. We have also introduced two pilots aimed at informing approaches to increase the number of heat pumps installed. We know as demand increases a lot of the traditional built homes that may have conservation challenges will become a lot more expensive to retrofit. We are working at streamlining the processes. If there are examples that the Deputy wants to share with us, we certainly will work with SEAI and try to build them into a broader programme that meets the needs of everyone throughout the country. \n Deputy Joe Cooney  There is an upgrade scheme through the SEAI at the minute called the traditional home pilot scheme. There is a low uptake, and this is directly related to the costs associated with conservation technical expertise and the lack of conservation professionals. Will the Minister of State provide details as to the number of expressions of interest there have been through the one-stop shops and the number of those who have followed through with the applications? If we are serious about upgrading many of the older properties in the country - and let us be honest there are lots of them - many of them use turf and coal for heating and have thermal inefficiencies, we will have to acknowledge the reality around the added costs associated with treating them properly. \n Deputy Alan Dillon  Over 41,500 upgrades have been completed so far this year. We have been building momentum. I do not have the numbers on hand for traditional built housing, but I certainly can get that back to the Deputy. As I said earlier, we need more skills and contractors and better supply chain resilience. That is why we are very much focused on more SEAI staff for the warmer homes scheme, and indeed, more one-stop shop operators. It is at 26 already. To the Deputy's point, it needs to be ensured that all homes are included. To get that specific skill set and expertise is something we can go to back to SEAI on and revert to the Deputy on. We will get the figures to the Deputy around warmer home retrofits for traditional homes. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_315",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Joe Cooney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "memberCode": "Joe-Cooney.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_285",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_285",
          "showAs": "Animal Welfare",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_285.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Agriculture",
          "roleCode": null
        },
        "showAs": " 315. Deputy Joe Cooney asked the Minister for Agriculture, Food and the Marine his plans to provide an authorised officer in County Clare for the purposes of the Animal Health and Welfare Act 2013; and if he will make a statement on the matter. [60535/25] ",
        "questionNumber": 315,
        "answerText": " Minister for Agriculture, Food and the Marine  Under the Animal Health and Welfare Act, 2013, my Department has primary policy responsibility for the welfare of all animals.  Since the introduction of the Act, approximately 1,000 staff within my Department have been designated as authorised officers, under the Act.  A large number of these authorised officers are based in my Department’s network of Regional Veterinary Offices throughout the country, providing nationwide coverage. Their responsibilities include carrying out welfare inspections in every county and providing advice and support to the keepers of animals. Primary responsibility for protecting the welfare of animals rests with the owner or keeper.  Authorised officers regularly carry out inspections and investigations, and work towards ensuring the welfare of animals and compliance with legislation, with interventions ranging from advice to warnings, and to legal compliance notices. When necessary, legal sanctions are imposed, and prosecutions are taken when other efforts to ensure compliance have failed or there is blatant disregard for an animal’s welfare.  To date, over 200 successful prosecutions have been taken under the Animal Health and Welfare Act, and a number of other investigations are ongoing.  Members of An Garda Síochána and the Customs Service are directly authorised under the Act.  Local authorities are empowered to appoint authorised officers under the Act.  My Department has entered into service level agreements with different organisations.  It is then the responsibility of those organisations to allocate staff resources as appropriate to their particular roles. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_316",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Joe Cooney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "memberCode": "Joe-Cooney.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_286",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_286",
          "showAs": "Animal Breeding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_286.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Agriculture",
          "roleCode": null
        },
        "showAs": " 316. Deputy Joe Cooney asked the Minister for Agriculture, Food and the Marine if he will consider amending the Dog Breeding Establishment Act 2010 to include an obligation for dog breeders to keep a record of to whom pups are being sold/given or otherwise distributed; and if he will make a statement on the matter. [60536/25] ",
        "questionNumber": 316,
        "answerText": " Minister for Agriculture, Food and the Marine  Responsibility for all policy and legislation in relation to the Dog Breeding Establishments Act 2010 transferred to my Department on 1 August 2025.  In March 2024, the then Minister for Rural and Community Development established the Dog Control Stakeholder Group to review the Control of Dogs Act and the Dog Breeding Establishments Act.  The stakeholder group’s remit includes considering the need for legislative change. This requires in-depth analysis and consultation to ensure that amendments are not just robust, fit for purpose and implementable, but that they also deliver the best outcomes for communities.  I am committed to reviewing all legislation relating to dogs, and in this regard will be guided by the recommendations of the Dog Control Stakeholder Group.  I expect the group to revert to me with recommendations on the matter in due course. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney",
          "memberCode": "Joe-Cooney.D.2024-11-29"
        },
        "questionNumber": 166,
        "questionType": "written",
        "answerText": " Minister for Health  The Government is fully committed to improving services in the Mid West region, including at UHL.  In April 2024, the Government announced a package of measures to increase capacity, address overcrowding and deescalate the pressure experienced in the UHL Emergency Department. These measures included increasing bed capacity, initiatives to divert patients from ED attendance as well as increasing staffing levels and further implementation of the Framework for Safe Nurse Staffing.  Investment in the hospitals in the region has increased from €370 million in 2019 to €689 million in 2024. The UHL budget has increased from €265 million to €507 million in the same period.  Staffing at the hospital has grown by 53% since Dec 2019. This includes 300 more WTE doctors (including consultants), 571 more nurses and midwives, as well as 163 more health and social care professionals.  Alongside advice and considerations for the future of services in the Mid West, the HIQA report published on September 30th has demonstrated that improvements are continuing to be made at UHL and across the Mid West.  There is good use of local injury and medical assessment units, and many interventions that can have a positive effect on patient experience time and the best use of the Emergency Department have been successfully rolled out.  Recent implemented measures include the virtual ward initiative, Advanced Nurse Practitioners to look after less severely ill patients, discharge coordinators in UHL, and the ‘Pathfinder’ and ‘ED in the home’ initiatives.  The Programme for Government commits to continue to increase capacity and open more beds at UHL and across the Mid West and to take account of all of the HIQA recommendations.  The HIQA review identified three potential options for consideration, and I and my Department are reviewing the extensive evidence base in detail before reporting back to Government. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Health",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_192",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_192",
          "showAs": "Patient Safety",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_192.xml"
            }
          }
        },
        "showAs": " 166. Deputy Joe Cooney asked the Minister for Health if, given the serious risks to patient safety identified in the recent HIQA report into urgent and emergency care in the Midwest, she will outline in detail all steps her office and her Department have taken to engage with the regional senior executive team in the Midwest to mitigate those risks; and if she will make a statement on the matter. [60220/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_166"
      }
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Foreign",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 156. Deputy Joe Cooney asked the Tánaiste and Minister for Foreign Affairs and Trade when he last met with the Croatian Ambassador to Ireland. [59927/25] ",
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_156",
        "questionNumber": 156,
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  I last formally met with Ambassador Vidiš of the Republic of Croatia on 31 March 2025 in the context of a visit made to Ireland by the Minister of Foreign and European Affairs of Croatia, Gordan Grlic Radman. Croatia is a close European partner, and we are committed to further enhance our bilateral relations between our two countries, including through our Embassy in Zagreb. The Department of Foreign Affairs and Trade works closely with the Embassy of Croatia in Ireland on the full range of bilateral issues, including strengthening our economic and political ties, advancing shared policy priorities within the EU, and promoting cultural and people-to-people connections between Ireland and Croatia.  I am kept fully informed of the Croatian Ambassador's and Embassy's activities by my officials in the Department of Foreign Affairs, who are in regular communication with the Ambassador and his team. ",
        "debateSection": {
          "showAs": "Official Engagements",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_161",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_161.xml"
            }
          },
          "debateSectionId": "dbsect_161"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Foreign",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 157. Deputy Joe Cooney asked the Tánaiste and Minister for Foreign Affairs and Trade the amount his Department paid towards a cost-of-living allowance and local post allowance to his departmental officials posted at the Irish Embassies in Pretoria, Beijing, Buenos Aires and Brasilia in 2024, in tabular form. [59928/25] ",
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_157",
        "questionNumber": 157,
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  Civil servants posted to our missions abroad are paid the standard salary for their grade as determined by the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation and are paid in accordance with the normal Irish taxation and social security obligations that apply to civil servants.  In common with other diplomatic services, this Department further supports officers who are assigned abroad to serve the State in an official capacity through a system of Foreign Service Allowances (FSA). This is to assist in defraying the additional costs officers and their families incur in moving and living abroad. These allowances are based on independently sourced data and are reviewed annually. Foreign service allowances are paid to officers for the duration of their posting to a diplomatic mission, and are payable based on their grade, civil status, family circumstances and the location.  In 2024, expenditure on Cost of Living Allowance and Local Post Allowance in respect of officers in Embassies in Pretoria, Beijing, Buenos Aires and Brasilia was €729,160.00  In line with data protection obligations, I have not provided a breakdown of this information by mission as this could lead to the identification of personal information of individuals. ",
        "debateSection": {
          "showAs": "Departmental Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_162",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_162.xml"
            }
          },
          "debateSectionId": "dbsect_162"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Finance",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 441. Deputy Joe Cooney asked the Minister for Finance his plans to expand the living cities initiative scheme to other large towns with historic centres, such as Ennis in County Clare; and if he will make a statement on the matter. [57810/25] ",
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_441",
        "questionNumber": 441,
        "answerText": " Minister for Finance  The Living City Initiative (LCI) is a targeted measure which is aimed at very specific areas in urgent need of regeneration, it is provided for under sections 372AAA to 372AAD of the Taxes Consolidation Act 1997. It currently offers income or corporation tax relief for qualifying expenditure incurred in the refurbishment and conversion of qualifying residential and commercial buildings located within ‘Special Regeneration Areas' (SRAs) of the cities of Cork, Dublin, Galway, Kilkenny, Limerick and Waterford.  In my recent Budget address, I announced a number of enhancements to the LCI to strengthen the scheme to be included in Finance Bill 2025. The Bill was published on 16 October last.  I also announced that the LCI would be extended to the regional centres of Athlone, Drogheda, Dundalk, Letterkenny and Sligo.  The reason for the extension of the scheme to these places is that they are the five regional centres set out in the National Planning Framework. In particular, National Policy Objective 15 of the Framework provides for the application of:  \"a tailored approach to urban development...\"(s)trengthening Ireland’s overall urban structure, particularly in the Northern and Western and Midland Regions, to include the regional centres of Sligo and Letterkenny in the North-West, Athlone in the Midlands and cross-border networks focused on the Letterkenny-Derry North-West City Region and Drogheda-Dundalk-Newry on the Dublin-Belfast corridor....\"  I have no plans at present to the extend the initiative to other towns. ",
        "debateSection": {
          "showAs": "Regeneration Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_411",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_411.xml"
            }
          },
          "debateSectionId": "dbsect_411"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Finance",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 442. Deputy Joe Cooney asked the Minister for Finance the breakdown of the number of houses in each LPT band, in each of the years 2015 to 2025; and the income from each band by year for the same period, in tabular form; and if he will make a statement on the matter. [57811/25] ",
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_442",
        "questionNumber": 442,
        "answerText": " Minister for Finance (Deputy Paschal Donohoe)  I am advised by Revenue that that number of properties, and liability, by LPT band for the years 2015-2025 is provided in the tables below.  Liability is based on the returns filed and payments received.   Number of properties and liability by LPT band  ",
        "debateSection": {
          "showAs": "Tax Yield",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_412",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_412.xml"
            }
          },
          "debateSectionId": "dbsect_412"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Public Expenditure",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 566. Deputy Joe Cooney asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the number of males and females that are fluent in Irish from the most recent HEO recruitment campaign within the civil service that are still on the panel; and the date this panel will expire. [59922/25] ",
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_566",
        "questionNumber": 566,
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The current Interdepartmental Competition for Higher Executive Officer (HEO) positions requiring fluency in the Irish language was launched in November 2023. To date, five appointments have been made from the resulting panel. An additional 19 candidates remain available for invitation to the interview stage, should further vacancies arise. This group comprises 13 female and 6 male candidates.  Originally scheduled to close on 30 November 2025, the panel has now been extended and will remain active until March 2026. ",
        "debateSection": {
          "showAs": "Irish Language",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_518",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_518.xml"
            }
          },
          "debateSectionId": "dbsect_518"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Enterprise",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 622. Deputy Joe Cooney asked the Minister for Enterprise, Tourism and Employment to provide details of the IDA Ireland client companies with operations in County Clare, in tabular form. [59919/25] ",
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_622",
        "questionNumber": 622,
        "answerText": " Minister for Enterprise, Tourism and Employment  Regional development is a key focus of our Programme for Government and is central to the work of my Department and our enterprise development agencies. In that regard, IDA Ireland partners with client companies and key stakeholders in all regions in pursuit of its objective to maximise regional opportunities.  Under its current strategy, “Adapt Intelligently: A Strategy for Sustainable Growth and Innovation 2025-29” IDA Ireland is targeting 1,000 investments, with 55% (550) in regional locations. This ambitious target reflects IDA Ireland’s ongoing commitment to support transformation and growth across all regions. In this regard, IDA is targeting 100 investments to the Mid-West Region - which included Co. Clare - up from 76 under its previous strategy, 2021–2024, when 95 investments were won.  County Clare plays a significant role in IDA Ireland’s regional investment strategy as part of the Mid-West Region. There are currently 153 IDA-supported companies in the region, directly employing 27,698 people, 62 of which are in Clare, employing 6,041.  The availability of suitable property and strategic sites is a critical component of the regional value proposition and to the winning of investments into the regions. As part of its Regional Property Programme, IDA Ireland continues to work closely with the private sector, Shannon Group and local authorities in the Mid-West to secure the provision and marketing of appropriate and cost-effective building and property solutions for client companies. In addition, IDA also continues to evaluate opportunities for expanding its property portfolio in the region.  Finally, the table below lists all IDA client companies located in Co Clare.          Company Name       Aercap Ireland Limited (Shannon)      Aero-Zone Ltd      Amax Information Technologies Limited      Aon Insurance Managers (Shn) Limited      Arista Networks      ATSG Ireland      AXA Partners      Baker Hughes EMEA Unlimited Company      Beckman Coulter Biomedical Limited      Beta Layout Limited      Bijur Delimon International (Ireland)      Bristol Myers Squibb Distribution      Collins Aerospace Ireland (Shannon)      Daktronics Ireland Co. Limited      Deepak Fasteners (Shannon) Limited      Dhl Global Forwarding      Digital River Ireland Limited      Element Six Limited      Elsevier Ireland Limited      Engine Lease Finance Corporation      Essidev      exida Ireland      Extreme Networks Ireland Limited (Shannon)      Heraeus Metal Processing Limited      Hi Life Tools (PTG)      HID Global Logistics Centre      Hubbell Ireland      Hummingbird Aero International      Idex Pump Technologies (Irl) Limited      Intel Research and Development Ireland Limited      Interaxon IR Ltd      IQEQ Corporate Services (Ire) Limited      Jaguar Land Rover Ireland      John Crane Ireland Limited      JP Lease Aircraft Leasing Shannon      Kwik Lok (Ireland) Limited      Lufthansa Technik Shannon      Lufthansa Technik Turbine Shannon Limited      Magellan Aviation Services Limited      MeiraGTx Ireland      Mentor Graphics (Ireland) Limited (Siemens EDA)      Microchip Ireland - Ennis      Nano Diamond Products DAC      Novacoast EU Limited      OLED Material Manufacturing Ltd      Panalok      Phardiag Ltd      PPG SCM Ireland Ltd      Reagecon Diagnostics Ltd      REVA Air Ambulance Ireland      RSA Securities Ireland Ltd      Saint Gobain Performance Plastics Ireland      Schenker (Ireland) Ltd      Shannon Engine Support Limited      Speed Electronics Limited      STS Aviation Services International (Naas Aircraft Services International Limited)      TE Connectivity Ireland Ltd      Vortex Aviation Shannon      White Horse Insurance Ireland Limited      WWT International Engineering Services, LLC      Zagg Intl Distribution Limited      Zimmer Orthopaedics Manufacturing Limited      ",
        "debateSection": {
          "showAs": "Industrial Development",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_570",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_570.xml"
            }
          },
          "debateSectionId": "dbsect_570"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 635. Deputy Joe Cooney asked the Minister for Education and Youth the reasoning behind the different levels of capitation grant for primary and post primary schools; and if she plans to equalise those grants; and if she will make a statement on the matter. [57812/25] ",
        "by": {
          "memberCode": "Joe-Cooney.D.2024-11-29",
          "showAs": "Joe Cooney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Joe-Cooney.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_635",
        "questionNumber": 635,
        "answerText": " Minister for Education and Youth  The Government is committed to increasing funding to support schools, and the Programme for Government commits to increasing capitation funding to schools of all types to ensure that schools can meet the elevated day-to-day running costs.  The commitment in the Programme for Government builds on the progress which has been made in recent years. As part of the capitation package in Budget 2026, I am pleased that a total of €39m was secured for a permanent increase in mainstream capitation grant funding for schools, increasing the mainstream rate of capitation to €274 per pupil in primary schools and to €406 in post-primary schools for the 2026/2027 school year. Over the last three Budgets this has resulted in an increase in the level of capitation rates of 49.7% (€91) paid to primary schools and 28.5% (€90) paid to post-primary schools. This will also allow for an increase of €20 in capitation rates for Urban Band One DEIS primary schools, increasing the mainstream pupil rate in these schools to €294. The increased capitation rates will also see special schools now receive the same rates of capitation for young people aged 12 and over, as their peers in mainstream post-primary schools.  The Department is committed to providing funding to recognised primary and post-primary schools in the Free Education Scheme by way of per capita grants. The two main grants are the capitation grant to cater for day-to-day running costs such as heating, lighting, cleaning, insurance and general up-keep, and the ancillary grant to cater for the cost of employing ancillary services staff. Schools have the flexibility to use capitation funding provided for general running costs and ancillary funding provided for caretaking and secretarial services as a common grant from which the Board of Management can allocate according to its own priorities, except for the employment of relevant secretaries as per Circular 0036/2022.  The current standard rate of capitation grant is €224 per pupil in primary schools and €386 per student in post-primary schools. Primary schools with fewer than 60 pupils are paid the capitation and the ancillary grants on the basis of having 60 pupils. Enhanced rates are also paid in respect of pupils with special educational needs and Traveller pupils.  It is difficult to make precise comparisons between the levels of grants paid and the actual costs of running schools at primary and post-primary level. In general, post-primary schools are larger than primary schools. They have specialist rooms such as laboratories, workshops etc. This leads to higher unit costs for heat, light, power, maintenance and cleaning. There are also additional resources required at post-primary level for specialist subjects, such as, Home Economics, Wood Technology, Engineering, Graphics and Applied Technology. Therefore, there is a difference in the level of capitation grant funding provided to Primary and Post-Primary schools.  Schools should also ensure that they are availing of the available OGP procurement frameworks and getting best value for money for all school expenditure, in accordance with Circular 0060/2013. Schools Procurement Unit (SPU), funded by the Department, is an important source of advice and support to schools on procurement matters – www.spu.ie.  The Financial Support Services Unit (FSSU), funded by the Department, is an important source of advice and support to schools on financial matters, including budgeting and cashflow management - www.fssu.ie. ",
        "debateSection": {
          "showAs": "Capitation Grants",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_581",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_581.xml"
            }
          },
          "debateSectionId": "dbsect_581"
        }
      },
      "contextDate": "2025-11-04"
    }
  ]
}