{
  "head": {
    "counts": {
      "questionCount": 998,
      "resultCount": 998
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Improving access to quality and affordable early learning and childcare is a key priority of Government.  Early learning and childcare capacity is increasing. Data from the Annual Early Years Sector Profile shows that the estimated number of enrolments increased by over 18% between 2022 and 2024 in Galway, demonstrating substantially increased access to provision for children.  However, it appears that demand for early learning and childcare remains higher than available supply in certain parts of the country, particularly for younger children.  A new Forward Planning Unit in the Department has developed a forward planning model which will be central to achieving the policy goals set out in the Programme for Government to build an affordable, high-quality, accessible early childhood learning and childcare system, with State-led facilities adding capacity.  The Department continues to support the ongoing development and resourcing of Core Funding which has given rise to a significant expansion of places since the scheme was first introduced. Core Funding, which is in its fourth programme year, funds services based on the number of places available.  Budget 2025 secured funding for the fourth programme year to facilitate a further 3.5% increase from September 2025. Budget 2026 has made provision for the fifth programme year for a further expansion in supply of 4.2% starting in September 2026.  The total allocation for Core Funding in the 2026/27 programme year will increase to over €480 million. This increased investment will allow increases in growth of the sector driven both by new services joining the sector and existing services offering more places or longer hours to families and supports both providers and workers by enabling increases in pay.  In addition to current funding to support access to early learning and childcare, capital funding allocated under the National Development Plan has enabled expansion of early learning and childcare.  The Building Blocks Extension scheme allowed Core Funding Partner Services to extend their existing premises or, in the case of community services, to construct or purchase new premises. The Scheme will deliver up to 1,500 full-day care places, beginning to become available from 2026.  As part of the National Development Plan review, the allocation for capital investment in early learning and childcare is €197 million over the next five years. This will include investment in buildings through the State-led early learning and childcare programme, investment in expansion of existing early learning and childcare operators through the current and future Building Blocks schemes and a number of quality initiatives including supports to childminders.  Preparatory work for this programme of capital investment is underway and I plan to bring this plan to Government for approval in the new year, with the multi-year programme of investment to commence from 2026 onwards. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 17. Deputy Albert Dolan asked the Minister for Children, Disability and Equality her Departments plans to expand and strengthen childcare provision in east Galway, including measures to increase capacity, support new providers, and address shortages of affordable early learning and care places for families across the region; and if she will make a statement on the matter. [73187/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_61",
          "debateSectionId": "dbsect_61",
          "showAs": "Early Childhood Care and Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_61.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_17",
        "questionNumber": 17
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 438. Deputy Albert Dolan asked the Minister for Health the administrative cost to the Health Service of a missed appointment; if the HSE has carried out any assessments or calculations on same; and if she will make a statement on the matter. [73186/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_389",
          "debateSectionId": "dbsect_389",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_389.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_438",
        "questionNumber": 438
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 16 to 24, inclusive, together.  I attended the leaders’ summit at COP30 in Belém, Brazil, on 6 and 7 November. Coming a decade after the Paris Agreement and during a period of enhanced geopolitical turbulence, my attendance at the summit was an important opportunity to show Ireland’s continuing commitment to the objectives of the UN Framework Convention on Climate Change and the Paris Agreement to limit emissions in order to avoid the worst impacts of climate change. I delivered Ireland’s national statement on 6 November, highlighting the reality that climate change is no longer a distant threat and pointing to the remarkable litany of record-breaking climate events in the 12 months since COP29 in Azerbaijan, including Storm Éowyn which brought the strongest wind gusts ever recorded in Ireland and the highest storm surges on the western seaboard. We saw the damage that Storm Bram caused last week to counties all over the country. I also argued that the sharpest impacts of climate change are felt by the world’s most vulnerable people and countries and noted that no country can successfully address the crisis of climate change alone.  I participated in two thematic round tables with my fellow leaders to discuss climate issues of common concern. The first focused on \"Climate and Nature: Forests and Oceans\". I reiterated Ireland’s strong support for the agreement reached at COP15 to protect at least 30% of land and oceans by 2030. The second thematic session took the form of a panel discussion on \"Energy transition and ten years of the Paris Agreement: NDCs and financing\". I expressed Ireland’s commitment to ensuring a just and inclusive energy transition pathway for all nations. I also shared Ireland’s focus on accelerating the delivery of renewable generation. I also participated in a small round table hosted by President Lula da Silva and attended also by the United Nations Secretary General, António Guterres, on climate adaptation and resilience. I spoke of Ireland’s commitment in this area with 80% of our climate finance concentrated on adaptation.  I also attended an event launching the Tropical Forest Forever Fund, hosted by President Lula. This global initiative aims to finance the conservation of tropical forests. I reaffirmed Ireland’s commitment to the preservation and sustainable use of the Amazon rainforest. I announced Ireland’s commitment to provide €15 million over the next three years to the Amazon fund, with the aim of preventing and combating deforestation.  While in Belém, I also took the opportunity to visit the offices of the United Nations High Commission for Refugees, where I met with representatives of some of the refugees they work with, including indigenous people from the Amazon displaced by climate change. To date in 2025, Ireland has provided over €25.5 million in funding to UNHCR. \n Deputy Malcolm Byrne  I welcome the fact that the Taoiseach attended the COP in Brazil as head of Government. It is appropriate that he did so. I welcome his remarks while there. I ask the Taoiseach to consider that Ireland might consider hosting a future COP to raise awareness of the important issues he has outlined.  I do want to express concern that if we are going to reduce our own dependence on fossil fuels and get people out of cars, we have to provide them with a realistic public transport alternative. I am passionate about rail travel but unfortunately the M11 is increasingly becoming a car park every morning. The problem for those travelling along the M11 into the capital, unlike a number of other commuter routes, is that we do not have a realistic rail alternative. We have fewer services, worse rolling stock and more overcrowding than any other rail service. What particularly annoys me is the fact that yesterday, the rail project prioritisation strategy made no commitments whatsoever about improvements for the Rosslare rail line and further looked at abandoning the proposals to develop and reopen the Rosslare to Waterford rail line. If we are to provide a real alternative and reduce our dependence on fossil fuels and car use, there has to be a real public transport alternative. I want assurances that the Department of Transport has not abandoned the rail commuters along the Rosslare rail line. \n Deputy Naoise Ó Cearúil  I note that, following the Taoiseach's attendance at COP in Belém, the EU made a significant decision to permanently stop Russian gas imports and phase out Russian oil. Similar to Deputy Byrne, I wish to highlight the issue of reducing our reliance on fossil fuels in the context of significant investment in public transport, in terms of DART+ West, for example, going to Maynooth and then Kilcock. The prioritisation of DART+ South West was not announced. There is significant traffic and build-up on the N7, M7, N4 and M4, particularly the N7 coming from Naas, Sallins and Celbridge. Indeed, Deputy Shane Moynihan has raised it previously. We need to ensure that these key pieces of infrastructure are prioritised along the commuter line that is causing the greatest amount of traffic. \n Deputy Darren O'Rourke  One of the most effective ways we can reduce emissions is by encouraging people on to public transport. I want to raise the lack of public transport in Bellewstown, County Meath. A 13-year-old boy, James Black, has started a campaign there and has hundreds of petition signatures calling for a public bus services for the village of Bellewstown. Fair play and well done to him for that. He has got an amount of media attention about it. He is very articulate and very clear in what he is trying to achieve.  The connecting Ireland scheme in the Department of Transport is a very good one but it is underfunded and Bellewstown is not included in it. Will the Taoiseach increase funding to the connecting Ireland scheme and will he include Bellewstown, County Meath in it? \n Deputy Liam Quaide  We heard a lot during the last Government about how much more investment went into the National Parks and Wildlife Service but in east Cork and Waterford, the level of under-resourcing has been baffling. In east Cork, we have had no ranger for approximately 12 of the last 15 years. There has been no district conservation officer for 18 months and no regional manager in place for years over east Cork and Waterford. It is difficult to give precise figures for these vacancies, because the Department has been incredibly opaque in response to questions I have submitted on recruitment to the NPWS. In one response, the Minister referred to \"perceived vacancies\", as if we were all imagining those roles being vacant. Also, bizarrely, the Department will not give details of staffing by geographical area for \"operational security reasons\". This is akin to An Garda Síochána not sharing numbers of gardaí employed in a given division. The Department also will not give any information on recruitment campaigns being undertaken. Meanwhile, hedgerows and trees are being trashed with impunity and the whole idea of habitat protection looks more like a bad joke in this country. When are we going to see more transparency from the Department of heritage on staffing of the NPWS? When are we going to see those crucial roles in east Cork and Waterford filled? \n Deputy Peadar Tóibín  Today the Minister of State, Deputy Thomas Byrne, stated that the Mercosur deal held many benefits for the Irish farmers and the wider economy. He said that for Ireland, Mercosur could be a significant beneficiary. This is incredible. It is the Minister of State putting up the white flag of surrender in terms of Mercosur. It comes just a few days after the Government put up the white flag in terms of the Irish fishing industry. Make no mistake about it, the Mercosur trade agreement will damage the livelihoods of hundreds of thousands of farmers in this country. All the fine words about COP mean nothing if we are going to facilitate or allow Mercosur to go through. It beggars belief that at a time of climate crisis, we will be bringing in Brazilian beef, which is produced in an environmentally unfriendly way, by which forests are burnt down and land is overgrazed, not to mention the environmental cost of transporting all that beef from South America to Europe. Will the Government stop speaking from both sides of its mouth in terms of Mercosur? \n Deputy Ruairí Ó Murchú  It is difficult to believe that we are talking about rail services being cancelled. These are proposed new services that make complete sense because we want people to move to public transport. We know the advantages that exist in that regard. One of the new rail services that was being proposed between Clongriffin and Drogheda has been mothballed. This would have allowed for further express services to Dundalk, Drogheda, Newry and Belfast. Such services are absolutely necessary because they are allowed to skip slower services. What is happening does not make any sense at this point. Will the Taoiseach seek some clarity in respect of this matter? I other colleagues in expressing absolute anger if this is the road we are going to take. No pun intended. \n The Taoiseach  I thank Deputy Byrne for acknowledging that it was important to attend the COP, even though it was a long distance to go. We needed to send a signal given that we are at a point at which the issue of climate change is receding in terms of political prioritisation. This is a real concern. Some people are pulling back from their commitments.  On hosting a future COP in Ireland, next autumn we will have the largest ever political meeting held in Ireland. There will be over 40 states represented. It is a ginormous undertaking to host a COP, but it is something the country should aspire to do in the future. It depends on the shape and nature of a COP. In some ways it has become very big. Maybe it is has gone too far in some respects in the context of how it has evolved. We need to get back to the more fundamental origin and idea around COP, which was countries coming together to make decisions on global agreements in respect of sustainability, the future of the planet and the impact of climate change.  I will look at the matter of rail project prioritisation. I take on board what the Deputy said. We have a lot of projects that are needed. We do not have commensurate capital, but I will have a look at where the Rosslare railway line is. We put a lot of money into Rosslare on the custom side and all of that in the context of Brexit. We did it in double-quick time. Rosslare to Waterford is an important link. I will have a look at that to see what we can do and where we are. \n Deputy Malcolm Byrne  There is nothing on the roster----- \n An Ceann Comhairle  This is not a back-and-forth. \n The Taoiseach  I said I am going to have a look at it. The Deputy asked me to have a look at it, so I am telling him that I am going to have a look at it.  Deputy Ó Cearúil is correct on the moves we made in terms of dependency on Russian oil and gas. On public transport, it is key. I have spoken to the Ministers for public expenditure and Transport in respect of DART+ South West. That has gone through all the planning and is shovel ready. The county council has zonings for between 10,000 to 18,000 houses. It feels that this is essential infrastructure. I am seeing if we can do something to make that we progress the project. That is work I am engaged in at the moment with the relevant Ministers.  Deputy O'Rourke referred to public transport more generally and to a young person named James Black. I pay tribute to him for his civic initiative, participation and being involved in something like that in terms of public service for Bellewstown. I will talk to the Minister and make him aware of that. On Connecting Ireland, I take on board the Deputy's views.  Deputy Quaide referred to the National Parks and Wildlife Service, NPWS. There has been huge investment in recruitment. The investment in the NPWS has more or less doubled since 2020. I took a personal interest in this. I worked previous with the then Minister, Malcolm Noonan, on it and continue to work on it with the Minister of State, Deputy Christopher O'Sullivan. Recently, we announced a €700,000 lifeline for Fota Wildlife Park through the NPWS because of the understanding work that Fota does in respect of conservation of particular species and so forth. I will engage with NPWS in respect of the issues the Deputy has raised to see if we can throw some light on the situation.  Deputy Tóibín referred to Mercosur. There was no agreement on that. It was not put to COREPER last Friday. I do not have the up-to-date information, but it seems unlikely now that it will put before COREPER before Christmas. What we have undertaken to do is work with like-minded countries, particularly France and Italy----- \n Deputy Peadar Tóibín  What is our position? \n The Taoiseach  -----in terms of securing additional safeguards. Quite a significant number of safeguards have been secured. That is contrary to what was there a year ago. They are taking the form of legal instruments that the Commission has committed to.  We succeeded in securing the nitrates derogation. It is a significant advancement that we now have that for a further three years. It was challenging and difficult. We worked hard with the Commission to get it over the line. Approximately 200,000 tonnes of Mercosur beef come into Europe on an annual basis as it stands. The new initiative under Mercosur would allow 99,000 of those to be brought in under a reduced tariff preference. The Minister of State, Deputy Thomas Byrne, spoke about the wider issues around Mercosur. All trade agreements bring benefits and losses. There is no any heresy in saying that. The Canada deal was tremendous for Ireland in terms of the increased exports for SMEs and so on. I accept that every agreement is different. At the moment, there is no sense of any breakthrough or agreement in respect of Mercosur. That is where we are at present.  Deputy Ó Murchú referred to the Clongriffin to Drogheda service. Capital is not limitlessness. \n Deputy Ruairí Ó Murchú  I get that. I was just wondering. \n The Taoiseach  If we were to add up the figures from everybody's contributions, I would guess that we would arrive at another €50 billion. We have to try keep things moving with planning in the context of progressing as many projects as we possibly can and to make sure that we have sustainability, financing and all of that. I will have to look at the rail prioritisation strategy that emerged on Friday. \n An Ceann Comhairle  I thank the Taoiseach. ",
        "questionType": "oral",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 17. Deputy Albert Dolan asked the Taoiseach if he will report on his attendance at COP30 in Belém [65713/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/dbsect_12",
          "debateSectionId": "dbsect_12",
          "showAs": "Taoiseach's Meetings and Engagements",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/mul@/dbsect_12.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_17",
        "questionNumber": 17
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The National Development Plan (NDP) Review published in July 2025 set out €275.4 billion in public capital investment to 2035. This represents the largest ever capital investment programme in the history of the State. As part of this, the allocation of NDP funding prioritised investment in the critical growth-enabling sectors of housing, energy, water and transport. Investment in these sector of critical economic infrastructure is essential to deliver on the core ambition of the Review - to enable the delivery of 300,000 homes by 2030 and to boost our international competitiveness.  As Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation, I am responsible for the provision of capital expenditure allocations to departments and the monitoring of monthly expenditure returns. Responsibility for the management and delivery of individual investment projects or sectoral policy strategies, within the agreed NDP allocations, rests with the individual sponsoring Department in each case. The prioritisation of individual projects, such as the University Hospital Galway Development Control Plan, is a matter for the Minister responsible for the policy area, in this instance, the Minister for Health.  To that end, Ministers across Government have been publishing sectoral investment plans setting out their capital priority projects to be delivered across 2026 to 2030. The Department of Health's Capital Sectoral Plan was published in November and set out that department's capital priorities to be delivered from its €9.25 billion capital allocation across 2026 to 2030. Further information is available at: https://www.gov.ie/en/department-of-health/publications/national-development-plan-review-2025-sectoral-investment-plan/. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 46. Deputy Albert Dolan asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if consideration has been given to the inclusion of the University Hospital Galway Development Control Plan within the forthcoming sectoral allocations of the National Development Plan; the criteria and mechanisms by which the success of the revised National Development Plan will be measured; and if he will make a statement on the matter. [70758/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_87",
          "debateSectionId": "dbsect_87",
          "showAs": "National Development Plan",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_87.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_46",
        "questionNumber": 46
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Deputy Albert Dolan  I submitted a question seeking an update on many building projects in Galway East such as Coláiste an Eachréidh, which is a fantastic Gael campus project; Kilcoona National School; St. Brigid's in Loughrea; Carrabane National School; Gort National School; and Gort Community School. If the Minister of State could provide me with an update on any of these projects, I would be grateful. \n Deputy Michael Moynihan  I thank the Deputy for his comprehensive list of school projects. I know that a significant amount of work is taking place. I compliment the Deputy on the work he does in engaging with schools because I believe public representatives should be constantly engaging with school communities. I thank him for his engagement on this and his engagement with us over the past number of months.  Since 2020, the Department has invested over €6 billion in school building projects under the national development plan involving the completion of over 1,300 school building projects. Over €227 million has been invested in schools across County Galway in this period, involving the completion of 79 school building projects.  The six building projects in Galway East referred to by the Deputy are part of the Department’s overall delivery pipeline. Three of the projects are additional school accommodation, ASA, projects devolved for delivery to the school authority or to Galway and Roscommon Education and Training Board. St. Brigid’s in Loughrea is at stage 2a while Kilcoona National School and Gort Community School are at stage 2b of the architectural design process.  The other three projects in Athenry and Carrabane and Gort National School are all large-scale capital projects and are at stage 3 tender action, evaluation and award stage. However, I am pleased to inform the Deputy that a letter of intent has recently issued to the successful contractor on the Gort National School project and it is expected that this project will progress to construction shortly.  In July, the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026 to 2030 under the national development plan. In relation to project roll-out for large-scale projects and ASA scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project roll-out over the course of 2026 to 2030 period. \n Deputy Albert Dolan  I thank the Minister of State for the update on those schools. For the people of Galway East, these projects are absolutely vital but I will focus on Carrabane National School. I know this has been raised with the Minister of State multiple times and that progress is taking place but the school is in an absolutely dire state at the moment. It needs that large-scale investment to build a brand-new school to bring it into the 21st century and ensure the children in that area are not left behind but receive the standard of education that is required in what is ultimately a safe and healthy environment. That is what is really important. \n Deputy Mairéad Farrell  In relation to the expected commencing of the construction of school buildings, I am aware the Minister of State recently visited Lakeview School, which is an important school on the east side of Galway city. As he will know, unfortunately, it is only able to place five students for the 2026-2027 school year. There is a waiting list of 11 children who cannot be accommodated due to space constraints. The school has the physical space but what it needs is complete refurbishment, which will allow more children to be able to use that fantastic school. This is the school's third year looking for more appropriate classroom space. I know the Minister of State is aware of this project and has been to this school. Will he progress this to ensure more children in Galway city can be accommodated in Lakeview? \n Deputy Michael Moynihan  I thank both Deputies. Deputy Dolan has raised Carrabane National School continuously with me and the Department. We visited the school in Galway and I know the challenges that are there. It was remiss of me not to say that I am very much looking forward to working with our new Minister for education, Deputy Hildegarde Naughton. We have had many lengthy discussions on education over the past number of weeks. I really look forward to engagement with her and her understanding. She held the role I have now, so she will have a huge understanding of it.  I will certainly raise these issues. We visited Lakeview School and saw the challenges. Like many schools that we visit, we see the challenges that are there. We are there to meet them as best we can into the future. We will certainly come back to the Deputies on it. ",
        "questionType": "oral",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 102. Deputy Albert Dolan asked the Minister for Education and Youth when construction is expected to commence on approved school building projects (details supplied) in Galway East; if she will provide an update timeline for delivery of these projects; and if she will make a statement on the matter. [70757/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/dbsect_32",
          "debateSectionId": "dbsect_32",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/mul@/dbsect_32.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_102",
        "questionNumber": 102
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects.  The Department’s school building programme is delivered through a range of procurement strategies, which are tailored to the scale and complexity of our projects and programmes and allow access to a diversity of contractors and consultants. This approach has maintained a strong and consistent delivery, even through recent Brexit and Covid-related turbulence in the construction sector  To support the necessary scale of delivery the Department utilises devolved delivery arrangements through a diversity of partners and have put supports in place to bolster the capacity of partner organisations, including buildings officers and project management supports. Smaller scale school building projects, including all Additional School Accommodation scheme projects, are delivered on a devolved basis for the most part. Individual school authorities are typically the client on these projects and they have the responsibility for making payments to Design Teams and contractors in accordance with the requirements and timelines set out in the public services contracts and public works contracts. The Department provides advance funding to school authorities to enable them to make these payments in a timely manner. There should not therefore be any reason for delays with payments for services or works that are delivered in accordance with the requirements set out in the relevant public services contracts and public works contracts. If the Deputy has any particular case in mind regarding a delayed payment, I am happy for the Department to have it examined and to clarify the position regarding payment.  As part of its stakeholder engagement, the Department engages with industry representatives including the Construction Industry Federation (in relation to works contracts) and professional representative bodies such as the RIAI, SCSI and ACEI in which payment of invoices and fees are discussed as part of stakeholder communications. The Department is committed to continuing to work with all stakeholders – in the construction industry and within the school sector - to ensure that all aspects of school building project delivery and associated payments are managed as efficiently and effectively as possible. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 110. Deputy Albert Dolan asked the Minister for Education and Youth to provide an update on current delays to payments to design teams; and if she will make a statement on the matter. [70756/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_132",
          "debateSectionId": "dbsect_132",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_132.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_110",
        "questionNumber": 110
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 1 to 11, inclusive, together.  The Government is committed to the delivery of a national security strategy and work is ongoing in finalising the strategy, co-ordinated by the national security secretariat in my Department and integrating inputs from a range of relevant stakeholders, including the Department of Foreign Affairs and Trade, the Department of Defence, the Department of Justice, Home Affairs and Migration, An Garda Síochána, the Defence Forces and the National Cybersecurity Centre.  The programme for Government, securing Ireland's future sets out a number of national security commitments, acknowledging that this is a time of upheaval, in particular geopolitical upheaval, with threats and challenges arising from a rapidly changing global geopolitical landscape. The preparation of a draft strategy covers a broad range of national security issues. There is necessarily a focus on the State’s internal security, including the evolving challenges we face from terrorism and extremism and from cyber threats, and a focus on the need to increase our investment in security and to modernise our legislation in the security field, notably in the investigatory powers available to our services. It will include also the implications of recent security, defence and international developments and their related impacts, notably the deteriorating security situation in Europe given Russia's ongoing war in Ukraine and the growth in cyber and hybrid threats in Europe. It will combine an enhanced maritime domain awareness with a prioritised focus on ensuring protection of critical maritime infrastructure, especially critical undersea infrastructure. The ongoing implementation of the report of the Commission on the Defence Forces and the modernisation of aspects of our defence legislation is also included in the preparations.  The National Cyber Security Centre has been placed under the remit of the Minister for Justice, Home Affairs and Migration. This is an important element of the realignment of our national security infrastructure, and a project has been initiated to establish this new statutory national security authority, led by the Department of Justice, Home Affairs and Migration. Earlier this year, I established the Ministerial Council on National Security, which comprises me as chair, the Tánaiste, the Minister for Foreign Affairs and Trade and for Defence, and the Minister for Justice, Home Affairs and Migration. The council will ensure that at the highest level there is a structured, ongoing review of our strategic national security interests and systematised monitoring of progress on delivering the Government’s commitments over the coming months, including the finalisation of the draft national security strategy. \n Deputy Tom Brabazon  As the Taoiseach is aware, drone sightings in Dublin Bay during the recent Zelenskyy visit underline and underscore the scale of our vulnerabilities and the urgency and need for preparing a strategic national security package. There are reports that international anti-drone units were deployed to Dublin during the visit to assist the emergency response unit. While we welcome the assistance of other states, we should not have to rely on others for our own defence. We should be self-reliant in the first instance. It should be expected that such activity will continue when Ireland takes over the EU Presidency next year, and a national security strategy would allow us to assess risks facing the State, including emergency aerial and technological threats, and set clear goals to guide Government and law makers. Can the Taoiseach provide an update to the House on the development of Ireland's national security strategy and an update on the drone sightings during the Zelenskyy visit? \n Deputy Albert Dolan  When we are talking about national security, it is vital we also give people confidence at a local level in our local security, particularly with regard to An Garda Síochána. In Galway East we have towns that are booming, thriving and growing such as Gort, Loughrea, Tuam and Athenry. Those towns are all feeding into Galway city. They have seen massive population increases and for those people to feel secure in those towns, we need an increase in our gardaí allocation and our gardaí numbers. More importantly, as the populations continue to grow in these towns, we need gardaí that become community gardaí, that the people know and connect with and can build relationships with into the future. These gardaí will serve the area. Our gardaí on the ground right now are working really hard but they need to be supported to handle the large caseloads right across the country but particularly in Galway East, we need additional gardaí. \n Deputy Paul Murphy  Does the Taoiseach think there is any national security implications for the significant decline in basic civil liberties that is happening in Britain, such as the proscription of organisations of Palestine protestors like Palestine Action, the denial of the right to a jury in the vast majority of trials and what is happening with the Palestine protesters who are charged with nothing more than property damage and who have been held for over a year without trial and without access to bail? The consequence is there are now eight protesters on hunger strike for over 30 days. This is the longest, most significant hunger strike since the H-block hunger strikers. Their demands are minimal, namely, the right to a fair trial, the right to access bail, the right to access medical care in prison and for the ending of the proscription of Palestine Action. There is an almost total media blackout on this in Britain, leading people to suspect there is a so-called D-notice in relation to this. Is the Taoiseach concerned about the decline of civil liberties and the fact that people are forced to go on hunger strike in Britain? \n Deputy Ryan O'Meara  Next year we will hold the Presidency of Europe. During that time, as the Taoiseach is more than aware, our national security will be of paramount importance. Given what has happened with drone activity and interference in Denmark, there is a fear the same will happen in Ireland. With President Zelenskyy's visit last week, we saw drones off the coast of Dublin. It is one thing for us to be a militarily neutral country, and that is right, but it is another thing for us to be able to say whether we can patrol our own skies and protect our own airspace. In light of the Presidency coming up in the middle part of next year, what will our national security strategy do? When will we see it? What will be in it regarding the protection of our skies and airports from rogue actors operating drones? \n Deputy Rose Conway-Walsh  The very serious incident of five drones endeavouring to intercept the plane carrying President Zelenskyy last week brought our unpreparedness on defence and national security into sharp focus. Was the C70 form completed to ensure that a Garda defence co-ordinated response was put in place? Were all protocols followed? Why did the navy ship not have drone-disabling equipment? Why were airlines not informed that there was drone activity in the vicinity into which they were flying?  Lieutenant General Rossa Mulcahy told John Mooney of The Sunday Times that the military needs more personnel, intelligence and high-tech capabilities to navigate these uncertain times. Why is the Taoiseach so reluctant to allow the defence and national security committee to do what its title suggests and have oversight of national security? \n Deputy Peadar Tóibín  Can the Taoiseach categorically say that the Government is able to protect all of the EU leaders who will come to this country during the EU Presidency? Who launched the drones that were seen off Dublin Bay during the Zelenskyy visit? Why were those drones not dealt with? Where did these drones come from? Where did they retreat to? How come none of that information is known at this stage? Who was behind the drones? We have heard statements that it is likely that they may have come from Russia, but what evidence is there of this? One of the more memorable answers the Taoiseach gave to a question on national security in the previous Dáil, when the issue of the so-called Russian spy was discussed, was that he did not receive those briefings. He quite pointedly said he did not receive the information he should be receiving on that. How can people in Ireland have confidence, given the fact that our Defence Forces have been run down for so long and we can only staff one ship on the seas at any given time? \n Deputy Paul Lawless  The national security strategy consultation launched in 2019 was intended to guide our strategy on security for the past five years, from 2020-25. Despite this, no strategy was published during this timeframe. During that timeframe we had a huge ransomware attack on the HSE which put a significant number of people's lives and health in jeopardy and cost the State several million euro. What is happening on this? When will the strategy be published? It is costing the State a significant amount of money. \n Deputy Ruairí Ó Murchú  We need some sort of detail and we need to know there is a plan to address cybersecurity and hybrid warfare. The HSE attack brought to light what was probably happening to a lot of businesses which did not provide information. There has been increased funding for the National Cyber Security Centre, NCSC, but we need to get down to brass tacks. There have been drone attacks over the past while and we need to make sure that we have the capacity and technological know-how to be able to deal with these issues. There has been a failure to date in respect of funding to ensure we have the full capacity required. \n Deputy Richard Boyd Barrett  One of the biggest atrocities and national security breaches was the Dublin-Monaghan bombing carried out by the Glenanne gang. There were headlines yesterday stating that there was no collusion in the Dublin-Monaghan bombing. First, the Kenova report yesterday dealt with Stakeknife, not the Dublin-Monaghan bombing. The Denton report will not be published until January. \n The Taoiseach  It was a summary of Denton. \n Deputy Richard Boyd Barrett  The report states that the British Army had the names of the killers on the night of the bombing but nobody was ever arrested. The representatives of the families think that smacks of collusive behaviour. The authors were also extremely critical of the Irish authorities, including the Garda, and the British authorities for destroying much of the files and evidence so that the people compiling the report could not gather conclusive evidence. The whole thing stinks to high heaven. The representatives of the families have asked for a public inquiry. Will the Taoiseach listen to them? \n The Taoiseach  I thank all Deputies who raised issues in terms of national security and the national security strategy. It reflects a growing awareness and engagement with this House, not before time, in respect of security and defence issues. There has been a wilful ignoring of these issues for far too long in the House. Particular perspectives have been taken on this. Even this morning, there were references to the United Kingdom, Europe or America as being threats. The clear threats right now in this era include a Russian threat to our security and security infrastructure. We have had engagement between Iran and Russia and North Korea and Russia. North Korean soldiers have been on European soil during a period of war, seeking to violate the territorial integrity of Ukraine and its sovereignty. These are the realities we face. We wish we were not facing these realities and we would prefer a Continent at peace and so on.  The strategy will be completed. Deputy Brabazon was the first to speak and referred to self-reliance. We will develop radar capacity, and that is very close to action in terms of procurement – a lot of work has gone into that. We need to co-operate and co-ordinate with other member states in the European Union and the United Kingdom in respect of all of these issues because a pattern has developed in terms of the emergence of these drones and the violation of the airspace of EU member states. The most notable incident occurred in Copenhagen at the time of the European Political Community meeting. Denmark sought help and advice from other EU member states at that time. There were incidents in Belgium, France, Poland, in terms of train tracks and so on, and in the Baltic Sea. We are agreed that, on the drone issue, disabling technology is important.  The visit of President Zelenskyy was very effective from a security perspective. I want to make it clear to everybody that an incident did occur on that night. A small number of unidentified drones were observed in the vicinity of a Naval Service vessel on patrol off the coast of Dublin. The drones were not a threat to President Zelenskyy's aircraft - that needs to be clear - because it had safely landed quite some time prior to the incident, nor were they a threat to his departure. An operational response was put in place that was appropriate to the circumstances by the commander of the naval vessel at the time and, subsequently, by the police and military authorities working in close co-operation. They worked closely together in advance of the visit and so on.  The Garda liaised with its Ukrainian partners throughout the visit of the President on the security arrangements, including with regard to this incident. The Garda special detective unit is carrying out an investigation of the circumstances of the incident with input from the Defence Forces. It is a very concerning incident, as I said, like other similar incidents in other European states. The circumstances are suggestive of this being part of an ongoing Russian-inspired hybrid campaign against European Union and Ukrainian interests. \n Deputy Paul Murphy  I would like the Taoiseach to present some evidence. He said the circumstances are suggestive----- \n The Taoiseach  Of course the Deputy would. Could I say to Deputy Brabazon----- \n Deputy Paul Murphy  The circumstances are contested. It might well have been the Russians but I would like to see some evidence if this will be used as an agenda to undermine our neutrality. \n An Ceann Comhairle  We just cannot have this, Deputy Murphy. \n The Taoiseach  The gardaí----- \n An Ceann Comhairle  We cannot have this interaction. \n The Taoiseach  I will come back to the Deputy. \n Deputy Paul Murphy  I thank the Taoiseach. \n The Taoiseach  An Garda Síochána is substantively enhancing and has enhanced its anti-drone capabilities. It has significant capabilities on land, and the navy likewise. The military generally has the capabilities throughout all three strands: air, sea and land. We will continue to enhance that and harness all technology available in the country, both private sector but also on our university campuses that can assist in that regard.  All politics is local and Deputy Dolan asked about gardaí in east Galway and the expanding towns. We have seen good progress in the recruitment of gardaí through Templemore. It has seen its highest intake this year. The Commissioner has been allocating significant numbers to given areas. Dublin benefited initially. Cork is benefiting now, to be quite frank, in terms of the city centre. The idea is to get around to the rest of the country but to do it in significant numbers so it really has impact. I understand we are pleading for patience on the Deputy's behalf and others but we are making progress. Funding is there to keep the throughput at the level it currently is in Templemore.  On the remarks made by Deputy Murphy, the United Kingdom does not present a national security threat to Ireland. \n Deputy Paul Murphy  The Taoiseach should have read the Denton report. \n The Taoiseach  On the issue he raised in terms of the civil liberties issue within the UK, it is an issue the UK has to challenge and deal with. I noted his comment, \"nothing more than property damage\". That was interesting. I do not believe people should be----- \n Deputy Paul Murphy  Interned for property damage. \n The Taoiseach  No one should be interned and there should be trials. I love the Deputy's casual approach to property damage. It is fine. It is grand. Do not worry about it. Let us continue doing it. \n Deputy Paul Murphy  That is not what I said. \n The Taoiseach  It is what he implied. \n Deputy Paul Murphy  No, it is not. \n The Taoiseach  Ah, come on. \n Deputy Paul Murphy  The point I was making is it is not normal to hold people----- \n The Taoiseach  We discussed this----- \n An Ceann Comhairle  Deputy Murphy made his point already. \n Deputy Paul Murphy  -----without trial for over a year for property damage. \n An Ceann Comhairle  We are not doing this, Deputy Murphy. We are not doing this. \n Deputy Paul Murphy  That is the point I was making and the Taoiseach knows it. \n An Ceann Comhairle  There are other Members to be regarded. \n The Taoiseach  Can I just say to Deputy Murphy that Deputies in this House have had their property damaged. I do not believe that should lead to internment or anything like that. \n Deputy Paul Murphy  Exactly. \n The Taoiseach  No, no. \n An Ceann Comhairle  Allow the Taoiseach to answer. \n The Taoiseach  Let us be very clear. In dealing with protest, there are different levels of protest. The right to protest and to free speech is absolutely inviolable. It has to be allowed and facilitated in any true democracy. When protests get too extreme, you then impact on other people's rights to personal safety, life and property. I respectfully suggest that is something the Deputy does not pay much attention to. \n Deputy Paul Murphy  Israeli weaponry property? No. \n The Taoiseach  In terms of the other issue Deputy O'Meara raised, I have dealt with some of the aspects of what happened on the night and so forth. In terms of the EU Presidency, which people have raised, there is a lot of work under way to prepare for that. An Garda Síochána is central to the security planning and preparation. It has established a dedicated European Union Presidency co-ordination office, led by the deputy commissioner of policing operations to oversee all aspects of operational planning, logistics and inter-agency engagement. There is ongoing interdepartmental engagement through a whole range of forums. Close co-operation with European policing and security partners concerning the Presidency is ongoing, as per the norm.  In the modern security arena, you have to co-ordinate, co-operate and share intelligence with other agencies. That is absolutely key. Otherwise, you are at nothing in terms of protecting the State or protecting our people. I do not want to go into all of the details here. Some of this is security sensitive. I have a report about the drone situation. When we are discussing security, there has to be an understanding there are limits to what can be put into the public domain. That impacts further gathering and garnering of intelligence. It also impacts on our capacity to withstand further threats and so on like that. There will be a lot of planning for VIP protection, venue security, transport management, cyber resilience and public order contingencies. All of that is being worked on. It is a mammoth task. It is a huge operation. Other member states have had to do something similar. It is symptomatic of where we are in terms of the threats to European security and so forth.  I think I have dealt with most of the issues Deputy Rose Conway-Walsh raised and I was responding to her in respect of that. \n Deputy Rose Conway-Walsh  Sorry, the Taoiseach has not----- \n An Ceann Comhairle  Absolutely not, Deputy. The Deputy has to take the answer. \n Deputy Rose Conway-Walsh  I just want to put it on the record the Taoiseach has not answered. \n The Taoiseach  I am not finished yet. No member state yet, bar France in the past 48 hours or so, has attempted to disabled drones or bring them down, for different reasons. That is a matter we have to leave to the operational people in charge. We cannot dictate that sort of a response here. \n Deputy Rose Conway-Walsh  Do we have the capacity? \n An Ceann Comhairle  Deputy, no. \n The Taoiseach  We have the capacity. \n An Ceann Comhairle  If the Deputy needs to raise a Topical Issue, she can put one down. This is not a back and forth. \n The Taoiseach  Once again, it is a matter for those on the ground and in the theatre to decide the best and most appropriate response at the time.  I have dealt with some of Deputy Tóibín's questions. The national security council has been established. There is a clear structure emanating from that in terms of awareness, being briefed and so forth. I was briefed on this incident. I sought a briefing immediately on it and I received it. Obviously, it is something that will be discussed at the national security council later.  In terms of Deputy Lawless----- \n Deputy Peadar Tóibín  The Taoiseach has not categorically----- \n An Ceann Comhairle  No. If the Deputy is not happy with the answer, put down----- \n Deputy Peadar Tóibín  -----stated that EU leaders will be safe during the Presidency. \n An Ceann Comhairle  Deputy Tóibín, you know you are wrong. \n Deputy Peadar Tóibín  He also has not stated where those drones came from and where they went. \n An Ceann Comhairle  I am asking the Deputy to stop addressing the Taoiseach until he finishes his answers, \n Deputy Peadar Tóibín  He has not answered those questions. \n An Ceann Comhairle  The Deputy might not like the answer but it is the Taoiseach's answer. Do not interject again, please. \n The Taoiseach  I was just about to make the point in terms of the cybersecurity attacks. Sorry, we will protect those who are coming into this country. There is no question. Do not always be so fast to denigrate ourselves. Do not listen to all the noise out there. What happened during President Zelenskyy's visit was a good security operation by our Defence Forces and by an Garda----- \n Deputy Peadar Tóibín  Why will the Taoiseach not answer the question about the drones? \n An Ceann Comhairle  Deputy, please have respect for the other Members. \n The Taoiseach  Through the Chair, we need to acknowledge that and the very effective work of An Garda Síochána and our Defence Forces. There is a lot of noise which suits other interests to portray Ireland in a certain light. The Deputy should be wary of that, too.  Deputy Lawless raised the issue of cybersecurity. Cyber threats and attacks have increased significantly since the Russian invasion of Ukraine. Some have been by criminal elements, some have been by professionals. There are also third party state actors in respect of cybersecurity threats. It is a very serious issue for both public utilities and private sector companies. It is costing a lot of funding to deal with that. We have brought the National Cyber Security Centre under the Department of justice. It is a very strong centre and has grown in capacity very significantly in the past five years. I remember when we started it. It has developed a really strong capacity under Richard Browne. Credit needs to be given in respect of that.  I make the point to Deputy Ó Murchú that there is not a failure in funding, frankly, and finance will not be an issue here. What is an issue is the procurement timelines, both within the European defence industry and more generally. We are working to see if we can accelerate procurement. We are doing that with the radar. That is why we took a joint country approach to procurement - to fast track it. In other words, we use the experience and expertise of countries that have experience of procuring the radar we are now seeking. Everyone will be about how fast we can procure. It will also be about taking an intelligent approach in terms of what we procure. The nature of modern warfare or security threats has changed radically. We are all witnessing the drone technology change, as well as the cybersecurity. What can we do undersea? How do we protect cables? How do we protect gas connectors? It is a whole-of-society security approach that is required here. It is not the traditional, conventional approach to defence and security. We need to consider and explore that point more, perhaps.  On the Dublin-Monaghan bombing, Deputy Boyd-Barrett is correct insofar as the summary of the Denton report was produced yesterday. It is regrettable that we do not have the full Denton report. I think there was some legal action taken to try to prevent it being published in full. The Kenova report has been published. We should have a debate on the Kenova report in this House in the new year. It reveals very sordid activity by state actors but also by paramilitaries, including the Provisional IRA. The Kenova report does not pull its punches in saying it was a threat to its own community or attacked its own community. What went on is quite unbelievable.  The Denton report stated that 120 people were murdered by a network of loyalist paramilitaries and RUC and UDR personnel, including those killed in the Dublin-Monaghan bombings. It is a very sordid story and both the Kenova and Denton reports cover it. I pay tribute to Jon Boutcher, who is now the head of the PSNI, for his leadership on Kenova, and also to Iain Livingstone. They withstood a lot of pressure. We will have two comprehensive reports, if we can get the latter one published. \n An Ceann Comhairle  That is it, Taoiseach. We move to questions Nos. 12 to 28, inclusive. With 16 Members and a remaining 18 and a half minutes, it is highly unlikely we will get to the third group of questions. I ask Members to be brief. ",
        "questionType": "oral",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 4. Deputy Albert Dolan asked the Taoiseach for a report on the national security strategy. [65712/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/debate/dbsect_14",
          "debateSectionId": "dbsect_14",
          "showAs": "National Security",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/debate/mul@/dbsect_14.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_4",
        "questionNumber": 4
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 12 to 28, inclusive, together.  The Cabinet committee on infrastructure last met on 3 November and will meet again early in the new year. The Cabinet committee works to drive infrastructure delivery and the implementation of the revised national development plan. As Members know, last week, we brought to Government the essence of that plan. The reform of the delivery of critical, growth-enhancing infrastructure is a key commitment in the programme for Government. Last week marked a major milestone on this agenda with the publication of the accelerating infrastructure report and action plan.  This plan sets out 30 high-impact and time-bound reforms to speed and scale up delivery of homes, roads, public transport, wastewater plants and energy infrastructure. Actions include legislative reforms to balance individual rights and public good, simplify regulation and consenting systems, cut administrative burden and red tape and build public acceptance and a delivery culture. The reforms align with broader housing, climate and competitiveness goals. These will be achieved by streamlining approvals to allow concurrent processing, introducing statutory timelines for major project decisions, rationalising delivery guidance to reduce duplication and complexity, enhancing procurement practices through clearer project pipelines, and fostering a delivery-focused culture that balances safeguards with urgency.  We are at a critical juncture. We have a strong economy and growing population, but our infrastructure delivery is too slow. We have a once-in-a-generation opportunity to transform this. The Government, private sector and communities must align behind delivery. The plan is underscored by the largest capital investment in the history of the State, with over €275 billion planned over the coming ten years.  Over recent weeks, Departments have published their ambitious sectoral investment plans for the next five years. Areas such as energy, transport and water will see a significant scale-up in funding and delivery, all of which will support us to address our infrastructure deficit and scale up housing. There will also be robust oversight of the Government’s performance in achieving these actions with regular reports on progress to the Cabinet committee on infrastructure. In the period ahead, the Cabinet committee will, therefore, oversee both the investments and reforms required to ensure that infrastructure is delivered as efficiently and quickly as possible. \n An Ceann Comhairle  There are 12 Deputies present. They will have 30 seconds each, which means there will be six minutes for questions and six minutes for a response. That is as fair as I can be. \n Deputy Aindrias Moynihan  The recently published national development plan update sets out an ambitious plan for key infrastructure for the years ahead. Many of the capital works are due to get under way by 2030 and others thereafter. Having a pipeline of projects ready is vital because there is so much background work involved with them. I am particularly focused on the ones after 2030. We have seen how the N22 Macroom bypass took many years to advance through the earlier stages, such as the background works, planning and design and so on. The next phase of that road is the piece between Macroom and Ballincollig. It needs to continue in the background and get through the various background stages so that we have a pipeline of projects ready to roll as soon as possible. \n Deputy Ruairí Ó Murchú  We have all seen a huge amount of flood damage and the danger of nature. While a huge amount of work has been done by local authorities and emergency services, this brings to light the need to deal expeditiously with CFRAM protections that are necessary throughout Louth. With regard to the south part of the Dundalk and Blackrock project, the promise is quarter 2 of 2027 for planning application submission. There have been promises and we have been waiting years. \n The Taoiseach  Is that CFRAM? \n Deputy Ruairí Ó Murchú  It is CFRAM. There are five particular projects throughout Louth, in Drogheda, Carlingford, Greenore, Baltray and Ardee. The lack of wastewater capacity is also causing issues. \n Deputy Albert Dolan  We need to double-track the rail line from Galway city to Athenry. The passing loop at Oranmore is under construction now. Ceannt Station is moving to be a station with five platforms. Huge investment has gone in but we must continue it because we are going to wait years for the Galway city outer bypass and the reality is that rail is the lever we can pull. We can build a double track from Athenry to Galway city which would greatly improve the quality of life for all commuters in east Galway. \n Deputy Darren O'Rourke  We need updated wind and solar farm guidelines. The wind farm guidelines are in draft form since 2019 and the last full version was in 2006. There is a commitment in the programme for Government for solar farm guidelines but recent responses say they are at a very early stage of a scoping process. When will they be ready? \n Deputy Paul Murphy  The new roll-out of BusConnects routes has been a disaster in my constituency. Constituents report that buses on the F spine route, which were supposed to provide a more direct route to the city centre and greater connectivity, are taking 20 to 30 minutes longer to get into town and providing fewer options for people trying to get to work or school. It is made worse by the frequent delays and cancellations seen across nearly all routes in Dublin South-West, including the S and W spines operated by Go-Ahead Ireland. Elsewhere, the NTA has been forced to change routes in Finglas and Chapelizod due to protests and people making their voices heard. Will the NTA do the same here or will people be forced to protest? \n Deputy Séamus McGrath  Central to a good infrastructure system is a good public transport system. I welcome the approval of BusConnects Cork by Cabinet to proceed to the planning phase. That is very welcome but we cannot wait years for improvements to the local bus service. I am sure the Taoiseach, like other public representatives in Cork, is inundated with unreliability issues relating to local bus services, such as buses not turning up, disappearing buses and inaccurate information on the travel app. It is simply not good enough and it has been going on for years. People are tired of excuses from the National Transport Authority and Bus Éireann. I ask the Taoiseach to please take this issue up and look for immediate improvements. \n Deputy Tony McCormack  While we prioritise electricity, water and transport, digital connectivity must now be treated equally. It is essential for Ireland's competitiveness. Europe has fallen behind the US and China. 5G stand-alone is under 2% in the EU and 0% in Ireland, compared with 20% in the US and 80% in China. AI, ehealth and advanced manufacturing cannot run on yesterday’s networks. If we want future investment in next-generation technology, connectivity must be prioritised. Will the Cabinet committee on infrastructure evaluate 5G stand-alone as a national priority? During Ireland's EU Presidency, will the Government push for strong, pro-investment digital policy under the digital networks Act? \n Deputy Peadar Tóibín  The Navan to Dublin rail line is not included in the national development plan review as a project that will start to be built before 2030. It has no start date for construction at all at the moment. It is up to a future government to fund the construction of a Navan to Dublin rail line. No money has been assigned or ring-fenced for that particular project, despite the fact there are 90,000 people commuting from Meath at the moment, 60,000 of whom travel by car and add to the M50 crisis. The M50 is currently grinding to a halt. If the Government wants to help fix the M50 crisis, allow people in Meath to use public transport to get to work without pushing them into cars every single day. \n Deputy Paul Lawless  Ireland faces an emergency crisis in terms of infrastructure, housing, energy and water. According to the ESRI, an additional 40,000 construction workers will be needed for the housing plan and an additional 40,000 will be needed for infrastructure. That is 80,000 construction workers who are required to meet the Government’s plan. Indeed, the Dublin metro will require 8,000 construction workers. What is the Taoiseach’s plan in order to achieve this? I speak to construction workers in Australia all the time. They want to come home but they are simply totally disenfranchised and disengaged. The Government has no interest in bringing them home. \n Deputy Rose Conway-Walsh  I know the Taoiseach will agree that the people in Mayo deserve to have proper road infrastructure. I want to specifically talk to him about the R312, which is the main road connecting Erris to the county town of Castlebar. I want it to be designated a regional strategic road because that is the only way it will get the funding it needs. It is a dangerous road. People have put up with it for years but it is time for it to be fixed. \n The Taoiseach  Which one is that? \n Deputy Rose Conway-Walsh  It is the R312. I thank the Taoiseach. \n Deputy Barry Heneghan  Ba mhaith liom ceist a chur ar an Taoiseach faoin flooding we saw in Clontarf yesterday. I thank the Minister of State, Deputy Boxer Moran, for coming down and sorting out the dreaded sandbags, but households and businesses were very worried yesterday. I had tens of people----- \n The Taoiseach  Where was that? \n Deputy Barry Heneghan  Clontarf. Does the Taoiseach not know I am a Clontarf man? The flood defence is critically needed. Will flood defences be included in critical infrastructure with the recent announcement last week? This needs to be fast-tracked and people and businesses need assurance. \n An Ceann Comhairle  Finally, Deputy Conor D. McGuinness. \n Deputy Conor D. McGuinness  Once again, I am raising with the Taoiseach the N25, which is the transport spine of Waterford's infrastructure and long regarded as the most dangerous national road in the State. There has been no funding for safety improvements. Routine maintenance, resurfacing and line painting are not good enough at this stage. Bus stops are being withdrawn. There was another HGV incident this morning just outside Dungarvan. We need to see serious investment in safety improvements on the N25 right from Rosslare to Cork city, but particularly in Waterford where there has been no funding for safety improvements. \n An Ceann Comhairle  Taoiseach, the floor is yours for five minutes. \n The Taoiseach  I love the demarcation lines. The \"Rosslare to Cork city, but particularly in Waterford\" part of it. I am sorry. I get it. Do not worry. \n Deputy Conor D. McGuinness  There have been no safety upgrades. There was a serious incident there this morning. \n The Taoiseach  It is just an observation. I will start with Deputy Aindrias Moynihan, who made a very good point. Hopefully, with this national development plan and the allocation of ten years, we will avoid this stop-start where we get a project from A to B but C is not provided for at all. We had that over the last two decades, I suppose. I recall how the Cork-Limerick road had planning in an earlier era and then that was all shelved after the financial crash and so on. If they had kept the planning going, they would have been in a much better position now to actually start. I do accept that, and particularly on the N22. The Macroom bypass has been extremely effective but there is the problem that you go along a great road into Ballincollig if you are coming from the Kerry side but then you are suddenly into what, as the Deputy was saying to me the other day, is like a parking lot for the next 20 to 40 minutes. It is a very good point that we should encourage Transport Infrastructure Ireland, TII, and others to keep thinking of the next stage and to have the planning ready and preparatory work done. I will work on that particular stretch the Deputy has referenced.  Deputy Ó Murchú raised the flood damage, CFRAM and the five projects in Louth. Deputy Barry Heneghan had a similar point. In general, flood protection schemes take a long time. Some of that is due to stakeholder engagement and public engagement, and there can be objections and so on. If any projects are of such imperative, these are. We do know that when these projects happen, they are effective in protecting against flooding. Towns that had historical flooding events have stopped them because of good infrastructure being put in. These projects invite a lot of objections. We had it in Cork city and it went the whole way to the top courts. It is only now that work is under way and all of that. There was flooding in Cork city this week. It was there because of the tidal levels, but one could argue that if you had the protections in, then businesses and people would have been protected and people could have gone in and out of town. I am very conscious of that.  With regard to Deputy Dolan's question, I will come back to the Minister. It was a good point. I do no know where we are on it in terms of the national development plan but there is no question that Galway city is facing enormous congestion, including all the areas feeding into Galway city. It is a real problem. Public transport, including rail, does give us an option, but not the whole option. We have to get the ring road done. Equally, though, the rail infrastructure is critical. I will talk to the Minister for Transport, Darragh O'Brien, about that.  Deputy O'Rourke raised the issue of the updated wind farm guidelines. The Deputy is correct that they have been a long time coming and technology has changed in the intervening period. I have asked the Minister, James Browne, to accelerate the work on the guidelines. The unit in his Department is also working on planning exemptions. There is a lot of work there. The Department is also working on rural guidelines for housing and one-off housing. There is a lot of work in that Department but I accept that we do need to bring this to a conclusion. At some stage, we need some collective debate on energy. We are all dealing with individual cases of objections to solar, objections to gas generation, objections to wind onshore, and objections to wind offshore potentially. We desperately need the offshore wind. This is something we have got to progress through planning. I am hoping we can get wind farms built, certainly through 2030 to 2031. If we do not, then we are in trouble from an energy perspective. As a collective - when I say \"collective\", I mean the entire Oireachtas - we have to try to stand back and say that there are huge challenges. We discussed security earlier. We are very dependent on the importation of fossil fuels through the interconnectors. There are real issues here that we need to be clear-eyed about. We can then take decisions once everybody realises that there are pluses and minuses in all of this.  Deputy Paul Murphy raised BusConnects, which he said was a \"disaster\"----- \n Deputy Paul Murphy  Some of it. \n The Taoiseach  That is okay. It is a word that is not uncommon. Anyway, I have had my issues with BusConnects down through the years. There have been issues for habitual users of bus services who feel the changing of services or the reorientation of scheduling and so on has eroded what they would have had prior to it. Then we had all the issues around what were, in my view, over-the-top initial plans, which then got rolled back. This seems to have been a pattern throughout the BusConnects journey and I think lessons could be learned from that. A lot of heat built up that perhaps was not necessary in the first place because a lot of stuff that was proposed was then taken away. We will engage with the National Transport Authority, NTA, in terms of what is happening. It has made a lot of progress now on BusConnects. We need a good bus transport system.  That brings me to Deputy Séamus McGrath's point. Yes, I have heard similar reports in terms of reliability. Originally, a year and a half ago, the shortage of drivers was blamed, but we definitely need to improve reliability. There had been very good stuff happening in public transport growth and so on.  I will talk to Deputy McCormack again. The Deputy is absolutely correct that America, China and others are way ahead of us in some of this in the digital space. We need to catch up fairly quickly. I will look at the 5G stand-alone issue.  Deputy Tóibín mentioned the NDP. The Navan rail line is in the NDP review----- \n Deputy Peadar Tóibín  It is not a Bill. \n The Taoiseach  The Deputy has a great capacity. He is brilliant at it, actually. From a political agitation perspective, the Deputy has a great capacity to turn what others would see as success into defeat. For the Deputy in opposition to say that we are not releasing----- \n Deputy Peadar Tóibín  That----- \n An Ceann Comhairle  Do not interrupt. \n Deputy Peadar Tóibín  I have to, a Cheann Comhairle. \n An Ceann Comhairle  No, Deputy Tóibín, do not even dare. \n The Taoiseach  The Deputy is trying to ask how I can----- \n An Ceann Comhairle  Deputy Tóibín will have to look for it afterwards. \n The Taoiseach  I spoke to the Minister, Deputy O'Brien, about this and he is very clear that the Navan line is going ahead. \n Deputy Peadar Tóibín  There is no date for construction. \n An Ceann Comhairle  Do not even think about it. \n The Taoiseach  The Government is absolutely committed to it.  On Deputy Lawless's question, there is a huge increase in apprenticeships. We are recruiting people back. We are anxious for people to come back into the country, and people are coming back into the country. The construction industry is confident enough in terms of the numbers for getting the housing done, for example, and the huge retrofit programme that is going on as well.  I will talk and engage with the Minister in respect of Deputy Conway-Walsh's query on the R312.  Regarding Deputy Heneghan's question, I have discussed that in terms of Clontarf and flood relief generally. It will be part of critical infrastructure, absolutely. I see it as critical infrastructure because it is a big threat to us. The storms are worse and they are more severe. We need to accelerate the protection of people, households and businesses in that respect.  On the N25, we need to get the bypasses along that road. That is a section of the road that definitely needs improvement.  I thank the Ceann Comhairle. \n An Ceann Comhairle  I thank the Taoiseach and Members. For future reference, if there needs to be back and forth, this is not the forum in which to pose a question. \n Deputy Ruairí Ó Murchú  In the review----- \n An Ceann Comhairle  We have a Dáil reform committee today at which it will be discussed. \n The Taoiseach  We need a bit of entertainment and lively engagement, too. \n An Ceann Comhairle  This is not the forum, Taoiseach. ",
        "questionType": "oral",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 15. Deputy Albert Dolan asked the Taoiseach when the Cabinet committee on infrastructure will next meet. [65711/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/debate/dbsect_15",
          "debateSectionId": "dbsect_15",
          "showAs": "Cabinet Committees",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/debate/mul@/dbsect_15.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_15",
        "questionNumber": 15
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  I propose to take Questions Nos. 359, 360, 361 and 362 together.  I am aware of recent discussion regarding Trifluoroacetic Acid (TFA) in cereal-based foods, including the report “Unseen and Unregulated: TFA, the ‘forever chemical’ in Europe’s Cereals”, which presents findings across 16 European countries. The Food Safety Authority of Ireland (FSAI) has advised that it will review this report and, as part of that process, will engage as necessary with EU counterparts, including the European Food Safety Authority (EFSA). EFSA published a draft statement in 2025 on consumer health-based guidance values for TFA, and the final EFSA risk assessment is expected in 2026.  TFA can be present in the environment from multiple sources, including the atmospheric transformation of certain refrigerant gases and the use of some pesticide substances. Pesticides that could potentially give rise to TFA are already included in the European regulatory review programme established under Regulation (EC) No. 1107/2009. The scientific review is managed by EFSA and includes input from the European Chemicals Agency (ECHA) where appropriate. EFSA and ECHA are currently completing a body of work regarding toxicological reference values for TFA and on the formation of TFA from pesticide use in the environment. It is important that all relevant information is considered in detail so that harmonised, coordinated action can be taken by European Member States regarding pesticide regulation. Ireland will continue to be guided by the scientific opinions and conclusions of EFSA and ECHA. Protection of human health is always the foremost concern.  With respect to monitoring, foods are routinely tested for the presence of certain contaminants under Regulation (EU) 2023/915. TFA is not currently included among those regulated chemical contaminants. In parallel, FSAI is assessing whether targeted national testing for TFA is practical and scientifically warranted at this time, taking into consideration available national or international research, current laboratory capacity, and the absence (pending EFSA’s final opinion) of an established health-based guidance value.  Regarding public health concerns, EFSA has been formally mandated by the European Commission to define a health-based guidance value for TFA for use in assessing potential risks for consumers via dietary intake. EFSA published a provisional value in July 2025, based on detailed analysis of technical data from a wide range of sources, and will finalise its scientific opinion in 2026 following public consultation. Based on EFSA’s published information—which is the most reliable scientific information currently available—the levels of TFA reported in some cereal-based foods do not indicate a health risk for children.  In addition to EFSA’s work, the European Commission has formally requested further scientific advice from ECHA and the World Health Organisation (WHO) to inform a harmonised EU approach and assist Member States in implementing coordinated measures. The outcomes of these processes will guide my Department. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 359. Deputy Albert Dolan asked the Minister for Health her response to the newly published report “Unseen and Unregulated: TFA, the ‘forever chemical’ in Europe’s Cereals” (details supplied), which identifies widespread contamination of cereal-based foods across Europe, including samples purchased in Ireland; her intentions to assess the implications for Irish consumers. [70791/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_305",
          "debateSectionId": "dbsect_305",
          "showAs": "Health and Safety",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_305.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_359",
        "questionNumber": 359
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  I propose to take Questions Nos. 359, 360, 361 and 362 together.  I am aware of recent discussion regarding Trifluoroacetic Acid (TFA) in cereal-based foods, including the report “Unseen and Unregulated: TFA, the ‘forever chemical’ in Europe’s Cereals”, which presents findings across 16 European countries. The Food Safety Authority of Ireland (FSAI) has advised that it will review this report and, as part of that process, will engage as necessary with EU counterparts, including the European Food Safety Authority (EFSA). EFSA published a draft statement in 2025 on consumer health-based guidance values for TFA, and the final EFSA risk assessment is expected in 2026.  TFA can be present in the environment from multiple sources, including the atmospheric transformation of certain refrigerant gases and the use of some pesticide substances. Pesticides that could potentially give rise to TFA are already included in the European regulatory review programme established under Regulation (EC) No. 1107/2009. The scientific review is managed by EFSA and includes input from the European Chemicals Agency (ECHA) where appropriate. EFSA and ECHA are currently completing a body of work regarding toxicological reference values for TFA and on the formation of TFA from pesticide use in the environment. It is important that all relevant information is considered in detail so that harmonised, coordinated action can be taken by European Member States regarding pesticide regulation. Ireland will continue to be guided by the scientific opinions and conclusions of EFSA and ECHA. Protection of human health is always the foremost concern.  With respect to monitoring, foods are routinely tested for the presence of certain contaminants under Regulation (EU) 2023/915. TFA is not currently included among those regulated chemical contaminants. In parallel, FSAI is assessing whether targeted national testing for TFA is practical and scientifically warranted at this time, taking into consideration available national or international research, current laboratory capacity, and the absence (pending EFSA’s final opinion) of an established health-based guidance value.  Regarding public health concerns, EFSA has been formally mandated by the European Commission to define a health-based guidance value for TFA for use in assessing potential risks for consumers via dietary intake. EFSA published a provisional value in July 2025, based on detailed analysis of technical data from a wide range of sources, and will finalise its scientific opinion in 2026 following public consultation. Based on EFSA’s published information—which is the most reliable scientific information currently available—the levels of TFA reported in some cereal-based foods do not indicate a health risk for children.  In addition to EFSA’s work, the European Commission has formally requested further scientific advice from ECHA and the World Health Organisation (WHO) to inform a harmonised EU approach and assist Member States in implementing coordinated measures. The outcomes of these processes will guide my Department. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 360. Deputy Albert Dolan asked the Minister for Health if her Department has carried out an assessment of the potential health risk to children from trifluoroacetic acid exposure in cereal-based foods. [70792/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_305",
          "debateSectionId": "dbsect_305",
          "showAs": "Health and Safety",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_305.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_360",
        "questionNumber": 360
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  I propose to take Questions Nos. 359, 360, 361 and 362 together.  I am aware of recent discussion regarding Trifluoroacetic Acid (TFA) in cereal-based foods, including the report “Unseen and Unregulated: TFA, the ‘forever chemical’ in Europe’s Cereals”, which presents findings across 16 European countries. The Food Safety Authority of Ireland (FSAI) has advised that it will review this report and, as part of that process, will engage as necessary with EU counterparts, including the European Food Safety Authority (EFSA). EFSA published a draft statement in 2025 on consumer health-based guidance values for TFA, and the final EFSA risk assessment is expected in 2026.  TFA can be present in the environment from multiple sources, including the atmospheric transformation of certain refrigerant gases and the use of some pesticide substances. Pesticides that could potentially give rise to TFA are already included in the European regulatory review programme established under Regulation (EC) No. 1107/2009. The scientific review is managed by EFSA and includes input from the European Chemicals Agency (ECHA) where appropriate. EFSA and ECHA are currently completing a body of work regarding toxicological reference values for TFA and on the formation of TFA from pesticide use in the environment. It is important that all relevant information is considered in detail so that harmonised, coordinated action can be taken by European Member States regarding pesticide regulation. Ireland will continue to be guided by the scientific opinions and conclusions of EFSA and ECHA. Protection of human health is always the foremost concern.  With respect to monitoring, foods are routinely tested for the presence of certain contaminants under Regulation (EU) 2023/915. TFA is not currently included among those regulated chemical contaminants. In parallel, FSAI is assessing whether targeted national testing for TFA is practical and scientifically warranted at this time, taking into consideration available national or international research, current laboratory capacity, and the absence (pending EFSA’s final opinion) of an established health-based guidance value.  Regarding public health concerns, EFSA has been formally mandated by the European Commission to define a health-based guidance value for TFA for use in assessing potential risks for consumers via dietary intake. EFSA published a provisional value in July 2025, based on detailed analysis of technical data from a wide range of sources, and will finalise its scientific opinion in 2026 following public consultation. Based on EFSA’s published information—which is the most reliable scientific information currently available—the levels of TFA reported in some cereal-based foods do not indicate a health risk for children.  In addition to EFSA’s work, the European Commission has formally requested further scientific advice from ECHA and the World Health Organisation (WHO) to inform a harmonised EU approach and assist Member States in implementing coordinated measures. The outcomes of these processes will guide my Department. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 361. Deputy Albert Dolan asked the Minister for Health if she will allocate funding for Irish research into trifluoroacetic acid in food and the environment, given the absence of a national exposure assessment. [70793/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_305",
          "debateSectionId": "dbsect_305",
          "showAs": "Health and Safety",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_305.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_361",
        "questionNumber": 361
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  I propose to take Questions Nos. 359, 360, 361 and 362 together.  I am aware of recent discussion regarding Trifluoroacetic Acid (TFA) in cereal-based foods, including the report “Unseen and Unregulated: TFA, the ‘forever chemical’ in Europe’s Cereals”, which presents findings across 16 European countries. The Food Safety Authority of Ireland (FSAI) has advised that it will review this report and, as part of that process, will engage as necessary with EU counterparts, including the European Food Safety Authority (EFSA). EFSA published a draft statement in 2025 on consumer health-based guidance values for TFA, and the final EFSA risk assessment is expected in 2026.  TFA can be present in the environment from multiple sources, including the atmospheric transformation of certain refrigerant gases and the use of some pesticide substances. Pesticides that could potentially give rise to TFA are already included in the European regulatory review programme established under Regulation (EC) No. 1107/2009. The scientific review is managed by EFSA and includes input from the European Chemicals Agency (ECHA) where appropriate. EFSA and ECHA are currently completing a body of work regarding toxicological reference values for TFA and on the formation of TFA from pesticide use in the environment. It is important that all relevant information is considered in detail so that harmonised, coordinated action can be taken by European Member States regarding pesticide regulation. Ireland will continue to be guided by the scientific opinions and conclusions of EFSA and ECHA. Protection of human health is always the foremost concern.  With respect to monitoring, foods are routinely tested for the presence of certain contaminants under Regulation (EU) 2023/915. TFA is not currently included among those regulated chemical contaminants. In parallel, FSAI is assessing whether targeted national testing for TFA is practical and scientifically warranted at this time, taking into consideration available national or international research, current laboratory capacity, and the absence (pending EFSA’s final opinion) of an established health-based guidance value.  Regarding public health concerns, EFSA has been formally mandated by the European Commission to define a health-based guidance value for TFA for use in assessing potential risks for consumers via dietary intake. EFSA published a provisional value in July 2025, based on detailed analysis of technical data from a wide range of sources, and will finalise its scientific opinion in 2026 following public consultation. Based on EFSA’s published information—which is the most reliable scientific information currently available—the levels of TFA reported in some cereal-based foods do not indicate a health risk for children.  In addition to EFSA’s work, the European Commission has formally requested further scientific advice from ECHA and the World Health Organisation (WHO) to inform a harmonised EU approach and assist Member States in implementing coordinated measures. The outcomes of these processes will guide my Department. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 362. Deputy Albert Dolan asked the Minister for Health if she will instruct the Food Safety Authority of Ireland to immediately begin national testing of cereal-based foods for trifluoroacetic acid, given the widespread contamination reported across Europe. [70794/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_305",
          "debateSectionId": "dbsect_305",
          "showAs": "Health and Safety",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_305.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_362",
        "questionNumber": 362
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The VAT rating of goods and services is subject to the requirements of EU VAT law, with which Irish VAT law must comply. In general, the EU VAT Directive provides that all goods and services are liable to VAT at the standard rate unless they fall within certain categories to which Member States may apply a lower rate. The VAT Directive also provides a zero rating for the export and intra-EU supply of goods under certain conditions.  The supply of livestock animals is subject to the super reduced rate of 4.8%, otherwise known as the livestock VAT rate. However, the supply may be liable to the zero rate if the goods are exported as is the case with all exports of goods outside the EU, for example to Great Britain.  For the zero rate to apply, the goods supplied (e.g. the livestock) must be dispatched or transported directly by, or on behalf of, the supplier or the purchaser to a destination outside the European Union. Where the purchaser dispatches or transports the goods, they must be established outside the State for the zero rate to apply. The supplier of exported goods must ensure the goods have left the EU and retain evidence that the goods have left the EU. Further VAT guidance on exporting goods is available on Revenue.ie https://www.revenue.ie/en/vat/goods-and-services-to-and-from-abroad/vat-and-exports/index.aspx   Supplies of goods to businesses in Northern Ireland are subject to the same rules as any other intra EU cross-border supply of goods. Subject to certain conditions, a supply of goods, including livestock, to a business in Northern Ireland would be liable to VAT at the zero rate. The Northern Irish business would be liable to self-account for the equivalent UK VAT in Northern Ireland to the HMRC. Further VAT guidance on cross-border supplies of goods is available on Revenue.ie https://www.revenue.ie/en/vat/goods-and-services-to-and-from-abroad/intracommunity-supplies/index.aspx   Where a business has been incorrectly charged VAT by their supplier, they should in the first instance resolve the matter with their supplier. In most cases this will resolve the matter. However, if the matter cannot be resolved through agreement, the business may contact their local Revenue Branch. They should provide details of the supplier, the nature of the supply and how the goods were dispatched and transported taking into the requirements set out above and in Revenue’s published guidance.  Subject to certain conditions, businesses operating in the UK and who are charged Irish VAT can reclaim that VAT directly from Revenue, either through the electronic refund facility (EVR) available to Northern Irish businesses or via the 13th VAT Directive claims process available to Great Britain businesses. However, these facilities cannot be used to reclaim Irish VAT incorrectly charged by a supplier. Instead, the business should resolve the matter with their supplier and may contact their local Revenue Branch if the matter cannot be resolved.  Further information on the EVR is available on Revenue.ie https://www.revenue.ie/en/vat/repayments-to-unregistered-persons/foreign-traders-and-vat/foreign-traders-established-in-the-eu-paying-irish-vat.aspx   Further information on the 13th VAT Directive process is available on Revenue.ie https://www.revenue.ie/en/vat/repayments-to-unregistered-persons/foreign-traders-and-vat/foreign-traders-established-outside-the-eu-paying-irish-vat.aspx   As a matter of policy, Revenue does not refund VAT that was incorrectly charged. To do otherwise would expose the Exchequer to loss and create a significant compliance risk, given that, under VAT law, a supplier who charged the VAT would still have an entitlement to reclaim this VAT within four years subject to certain conditions.  The Deputy is welcome to supply details of any cases that have been directly raised with him, so that Revenue can look into the matter. He will appreciate, though that they will not be able to disclose the outcome of any investigations, owing to their statutory obligation to preserve taxpayer confidentiality. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 283. Deputy Albert Dolan asked the Tánaiste and Minister for Finance the current VAT policy in respect of UK customers purchasing livestock animals in Ireland for export to the UK; and the reason UK buyers are required to pay VAT upfront and subsequently claim a refund given that the animals are being exported; and if he will make a statement on the matter. [69037/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_261",
          "debateSectionId": "dbsect_261",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_261.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_283",
        "questionNumber": 283
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  The use of asbestos was phased out in Ireland with laws passed in 1994 and 1998, but a complete ban was not enacted until 2004, under the European Communities (Dangerous Substances and Preparations) (Marketing and Use) Regulations 2003.  Under https://echa.europa.eu/documents/10162/ea9dc42d-7656-8afd-09e4-d8b41fae2c9c of Annex XVII to the REACH Regulation, the manufacture, placing on the market (including import) and use of asbestos fibres (Crocidolite, Amosite, Anthophyllite, Actinolite, Tremolite and Chrysotile) and of articles and mixtures containing these fibres added intentionally is prohibited. However, the use of articles containing asbestos fibres which were already installed and/or in service in the State before 1 January 2005 continue to be permitted to be used until they are disposed of or reach the end of their service life.  While awareness has been raised of the recent reports from Australia relating to the detection of asbestos containing components used in the internal service lifts of a number of wind turbines, neither The Department of Enterprise, Tourism and Employment nor The Health and Safety Authority has been notified of the presence of asbestos containing components in any wind turbines operating in the state.  No assessment or investigation into the presence of asbestos-containing braking system in wind turbines operating in the State has been undertaken to date. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 353. Deputy Albert Dolan asked the Minister for Enterprise, Tourism and Employment given recent reports that the Australian Government has identified the possible use of asbestos materials in certain wind turbines brake systems, if he will confirm whether asbestos-containing components are used in any wind turbines operating in the State; if any assessment or investigation has been undertaken to determine this; and if so, the findings of that investigation. [70247/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_318",
          "debateSectionId": "dbsect_318",
          "showAs": "Wind Energy Generation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_318.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_353",
        "questionNumber": 353
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 996. Deputy Albert Dolan asked the Minister for Health if she will commit to the establishment and national roll-out of a publicly funded Oral Immunotherapy (OIT) programme for food allergies, including peanut and tree-nut allergies; the proposed timeline for the roll-out; and if she will make a statement on the matter. [69646/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_825",
          "debateSectionId": "dbsect_825",
          "showAs": "Health Strategies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_825.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_996",
        "questionNumber": 996
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 997. Deputy Albert Dolan asked the Minister for Health the measures being taken to ensure equitable access to allergy diagnostics and treatments for children, adolescents and adults across all regions; the steps being taken to expand services beyond the limited regional availability at present; and if she will make a statement on the matter. [69647/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_826",
          "debateSectionId": "dbsect_826",
          "showAs": "Health Strategies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_826.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_997",
        "questionNumber": 997
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 998. Deputy Albert Dolan asked the Minister for Health if she will introduce a national scheme for improved access to emergency anaphylaxis medication, including adrenaline auto-injectors, along with structured training and guidance for schools, childcare providers and public settings; and if she will make a statement on the matter. [69648/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_827",
          "debateSectionId": "dbsect_827",
          "showAs": "Medicinal Products",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_827.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_998",
        "questionNumber": 998
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 999. Deputy Albert Dolan asked the Minister for Health if her Department has assessed the number of families travelling abroad to access allergy treatments such as OIT; the risks associated with unsupported treatment outside the State; and her plans to address this gap in domestic service provision; and if she will make a statement on the matter. [69649/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_828",
          "debateSectionId": "dbsect_828",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_828.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_999",
        "questionNumber": 999
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  In October 2015, the then Minister for Health signed The Medicinal Products (Prescription and Control of Supply) (Amendment) (No.2) Regulations 2015 (S.I. 449/2015) into effect. The regulations increase access to specified prescription-only medicines in an emergency including adrenaline. This allows for the administration of adrenaline for known or suspected anaphylaxis, to be administered by trained members of the public in emergency situations, without the need for a prescription. Of note, there is provision for organisations such as schools and workplaces to store these medications for the administration by a trained person.  The Pharmaceutical Society of Ireland provide guidance on the implementation of this amendment for pharmacists and the Pre Hospital Emergency Care Council has established a course for the education and training of persons to safely and competently administer adrenaline in an emergency.  There is a responsibility to ensure that medications are stored and administered safely and appropriately. Those with a known risk of anaphylaxis should carefully follow their doctor’s guidance regarding carrying an adrenaline pen (‘EpiPen’) on person.  Community pharmacies are among the most accessible and trusted healthcare providers in Ireland. The State recognises the importance of pharmacies being prepared to administer these medicines safely and effectively. This is reflected in the Community Pharmacy Agreement 2025 which establishes an Emergency Medicine Administration Preparedness Allowance. To recognise that community pharmacists are authorised to administer emergency medicines, and that this service is provided on an ad hoc basis requiring pharmacists to be trained and ready to respond, an annual recurring allowance of €525 will be made available to community pharmacy contractors, commencing in 2026. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1000. Deputy Albert Dolan asked the Minister for Health if she will work with the Minister for Education and Youth to ensure that all schools have access to stock adrenaline auto-injectors, rather than relying on individual students and their families to supply them; the measures being taken to provide mandatory, standardised training for teachers and school staff so they feel confident and safe in administering auto-injectors in the event of anaphylaxis; and if she will make a statement on the matter. [69650/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_829",
          "debateSectionId": "dbsect_829",
          "showAs": "Medicinal Products",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_829.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1000",
        "questionNumber": 1000
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  On 28 November 2025, the Minister for Health published the National Development Plan (NDP) Sectoral Plan for Health 2026–2030.  The Sectoral Plan sets the strategic direction for health sector capital investment under the revised NDP allocation (2026–2030). Detailed plans, including individual projects and progress updates, will be published annually in the HSE Capital Plans.  The health sector maintains a strong track record of delivery and intends to maximise the allocated funding to enable high-quality and efficient services with equitable access across the country, while actively managing projects to respond to internal and external opportunities and challenges.  The Sectoral Plan notes that our acute hospital campuses require a clear, coherent master planning approach to sequencing and phased expansion. Development Control Plans (DCPs), shaped by clinically informed regional priorities, will enable the advancement of a pipeline of projects positioned for delivery.  An integrated campus DCP for University Hospital Galway (UHG), informed by population health needs and clinical demand, has been developed. It provides a clear masterplan for the sequencing and delivery of new facilities. A phased approach to development at UHG will be necessary to ensure continued delivery of care on the congested hospital campus.  The immediate priority identified in the master planning is the delivery of significant additional inpatient bed capacity to mitigate the pressures on, and support delivery of, a range of services on the UHG campus. Site clearance works have already been undertaken to begin clearing the site for a 150-bed ward block, which forms part of the first phase of development on the campus. The Acute Hospital Inpatient Bed Capacity Expansion Plan is countenanced within the Sectoral Plan.  Where DCPs have been completed and delivery phases have begun, the next phase will be advanced and positioned for delivery as part of the Sectoral Plan. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1050. Deputy Albert Dolan asked the Minister for Health if consideration is being given to fully including the University Hospital Galway (UHG) Development Control Plan (DCP) within the forthcoming sectoral National Development Plan allocations for the health capital budget; and if she will make a statement on the matter. [70037/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_873",
          "debateSectionId": "dbsect_873",
          "showAs": "Hospital Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_873.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1050",
        "questionNumber": 1050
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  Launched in 2022, the Town Centre First (TCF) Policy is a major cross-government policy that aims to tackle vacancy, combat dereliction and breathe new life into our town centres. The policy supports the Our Rural Future vision for a thriving rural Ireland which is integral to our national economic, social, cultural and environmental wellbeing and development.  In December 2021, funding of €2.6 million was announced to support the development of 26 TCF town plans nationally, including Gort in east Galway. These community-based plans are produced by individual Town Teams, drawn from local community and business representatives, and are helping communities develop a vision for their town and identify viable projects to realise that vision. This first phase of TCF plans are complete and have moved onto the project delivery phase.  In February 2024, a new TCF suite of supports was launched with €4.5 million allocated through three funding measures, which will help regenerate town centres through a bottom-up approach. This includes funding allocations for the development of a further 26 TCF town plans, with Athenry awarded €30,000 under this measure.  TCF also  includes a Town Teams support fund, with Headford in east Galway and An Cheathrú Rua and Oranmore awarded €10,000 each.  Funding of up to €50k has also been provided to assist towns in preparing for major projects via the TCF “Project Development Measure’’. This has included projects in Ahascragh, Clonbur and Eyrecourt.  Rather than being a funding stream in its own right, the significance of TCF is that it is a policy document providing an integrated policy approach for the development of Irish towns which is underpinned by a range of capital funding streams.  This includes funding streams which are available across Government. For example, operating to Town Centre First principles, my Department administers a range of measures to support the revitalisation and regeneration of rural towns and villages including the Town and Village Renewal Scheme (TVRS) and the Rural Regeneration and Development Fund (RRDF).  Calls for Proposals are periodically issued to local authorities who can then submit proposals in line with priorities identified in Town Centre First Plans.  The TVRS provides of funding for projects designed to combat vacancy and dereliction and rejuvenate town and village centres.  Since its launch, almost €184 million has been allocated to over 1,800 projects across Ireland. Examples of the TVRS in East Galway includes a Streetscape Enhancement Scheme allocated €100,000 in Portumna town centre and the development of the Pulse Hub-Co Working and Remote Working Space in Ballinasloe allocated €250,000.  I expect to announce successful projects under the 2025 TVRS in the coming weeks.  The RRDF is a major capital investment programme which seeks to support large-scale, ambitious projects which can achieve sustainable economic and social development in rural areas.  Since 2018, over €613 million has been allocated to 273 RRDF projects. Examples of the RRDF in East Galway includes the Athenry Public Realm Enhancement Scheme approved in 2024 and allocated €6.75m, the ‘Regeneration Loughrea’ scheme allocated €4.25m and the renovation of Tuam Town Hall  which was allocated €3.69m last year.  Details of all the towns and projects awarded funding under Town Centre First and my Department’s range of capital schemes can be found on the Departments website.  It is also important to note that there is a range of other support funding in place right across Government.  Town Centre First has been developed in conjunction with the Minister for Housing, Local Government and Heritage.  ‘Bringing Back Homes’ details over 20 incentives, funded measures and grants to address vacancy and dereliction.  Supports include the Vacant Property Refurbishment Grant under the Croí Conaithe initiative, the Repair and Leasing Scheme, the Buy and Renew Scheme, and the Living City Initiative.  Government remains committed to the success of the TCF policy and will continue to work closely with local authorities to deliver on the goal of revitalising rural towns and villages. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 25. Deputy Albert Dolan asked the Minister for Rural and Community Development and the Gaeltacht the funding allocated to date under the Town Centre First initiative for towns in Galway east such as Athenry, Gort and Loughrea; the status of pending applications; his plans to support further regeneration in small towns throughout east Galway; and if he will make a statement on the matter. [68442/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_62",
          "debateSectionId": "dbsect_62",
          "showAs": "Regeneration Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_62.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_25",
        "questionNumber": 25
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Tuam Community Training Centre, based in Galway, provides education, training, restorative justice interventions, personal development and progression opportunities for young adult offenders and those at risk of offending or re-offending. The premises occupied by the centre is owned by my Department and the work they do is funded by the Probation Service. I saw first-hand the valuable work carried out by the centre during my visit there last May. I am also aware that there are issues with the condition of the building. Following engagement with the Centre by the Probation Service, my officials are considering options for the building occupied by the Tuam Community Training Centre. I can assure the Deputy that I will provide an update once these options have been reviewed and a decision reached.  The Centre engages with probation clients providing support and training in the community. This is consistent with the Government’s commitment in the Programme for Government to the expanded use of community sanctions, which will improve efforts to rehabilitate offenders and contribute to reducing prison overcrowding.  In April 2025, I launched the Probation Service Community Service Implementation Plan, “New Directions 2025-2027” which sets out a range of actions and targets to increase the uptake, consistency and availability of Community Service Orders throughout the country, so as to provide a meaningful alternative to custodial sentences where appropriate and support desistance from offending behaviour.  Budget 2026 provides an 11.2% increase in funding for the Probation Service, allowing for the recruitment of 100 additional staff. This additional funding will also be used to increase use of supervised community sanctions in the criminal courts, expand restorative justice services and expand supervised temporary release schemes nationally.  On 6 May 2025, I published the General Scheme of the Criminal Law and Civil Law (Miscellaneous Provisions) Bill 2025, which seeks to amend legislation to increase the maximum number of hours that can be imposed under a Community Service Order from 240 to 480 hours. The amendment will also require a judge to consider a Community Service Order, if a sentence of up to two years is being considered, rather than the current one year requirement.  Work is also under way to develop a pilot bail support policy for women, as an alternative to being detained in custody while awaiting trial or sentencing.  €7.3 million additional funding is being provided for Youth Diversion Projects, which now provide opportunities to prevent young people from getting involved in anti-social, or criminal behaviour, in every part of the State.  The Programme for Government also commits to implement electronic monitoring (EM) for appropriate categories of offender and Budget 2026 allocated funding of €2.1m for the project to allow for staffing, procurement, and other set-up costs. It is intended to go to tender for an electronic monitoring provider shortly. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 97. Deputy Albert Dolan asked the Minister for Justice, Home Affairs and Migration his Department’s plans for the building currently occupied by a community centre (details supplied) in Tuam, County Galway; if his Department plans to retain, refurbish, or dispose of the property; the engagement which has taken place with TCTC regarding the future use of the building; and if he will make a statement on the matter. [67870/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_120",
          "debateSectionId": "dbsect_120",
          "showAs": "Community Development Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_120.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_97",
        "questionNumber": 97
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Garda Commissioner is responsible under section 33 of the Policing, Security and Community Safety Act 2024 for the management and administration of An Garda Síochána, which includes the distribution and stationing of Garda personnel throughout the State. The Commissioner is independent in his functions under section 34 of the Act and, as Minister, I have no role in these independent functions.  I am advised by the Garda authorities that there is currently one Sergeant and six Gardaí permanently allocated to Athenry Garda Station.  In the interest of transparency, information in relation to the allocation of Gardaí by Division, Station and rank, and Garda Staff by Division and Station, including for Athenry Garda station, is publicly available and can be found at the following link:  www.garda.ie/en/about-us/our-departments/human-resources-and-people-development/garda-hr-directorate/garda-strength-breakdown-2025/.  The Deputy should select the most recent month and access the file titled “ Garda Members by Division District Station 2009 to the most recent date ” for a breakdown of total Garda numbers by Garda station going back to 2009.  The Deputy should select the most recent month and access the file titled “ Garda Staff by Division and Station to the most recent date ” for a breakdown of total Gardaí numbers going back to 2010. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 137. Deputy Albert Dolan asked the Minister for Justice, Home Affairs and Migration the current staffing levels at Athenry Garda station. [67869/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_159",
          "debateSectionId": "dbsect_159",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_159.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_137",
        "questionNumber": 137
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The management and maintenance of local authority housing stock, including pre-letting repairs to vacant properties, is a matter for each individual local authority under s.58 of the Housing Act 1966. Local authorities must also ensure all tenanted properties comply with the provisions of the Housing (Standards for Rented Houses) Regulations 2019. Accordingly, minimising vacancy rates, speeding up turnaround times, and maximising the number of homes brought back into productive use are matters for local authorities.  That said, my Department provides annual funding under the Planned Maintenance/Voids Programme to support local authority management and maintenance programmes. Some €189 million has been provided to help bring back almost 13,200 vacant social homes to use between 2020 and end-2024. A further €31 million is available this year to support the refurbishment and re-letting of a minimum of 1,900 social homes, facilitating the quick turnaround of vacant homes and continuing the transition from a reactive voids approach to a planned maintenance approach.  This funding complements local authority own resources. It is not a substitute for local authority funding and the requirement for adequate budgeting for housing management and maintenance by local authority officials and elected members as part of their annual budgetary process.  In line with Programme for Government commitments, and having regard to continuous engagement with local authorities on how to most effectively target Department supports, a revised programme will be introduced in 2026. The programme will focus first and foremost on supporting the continued transition to a proactive planned maintenance approach and supporting only those works necessary to ensure compliance with the Housing (Standards for Rented Houses) Regulations 2019, thereby facilitating as quick a turnaround as possible of casually vacant local authority social homes.  Any new measures or changes to the programme will be formally communicated to local authorities in the new year. Notwithstanding, the maintenance of social housing, ensuring a quick turnaround of vacant homes, and maximising the number of homes brought back into active use will remain matters for each local authority. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 350. Deputy Albert Dolan asked the Minister for Housing, Local Government and Heritage to detail the primary operational, staffing, procurement, and supply-chain constraints reported by local authorities in returning void social housing units to use; and the measures, financial, regulatory, or administrative, his Department is considering to reduce  turnaround times and increase throughput. [68963/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_325",
          "debateSectionId": "dbsect_325",
          "showAs": "Housing Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_325.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_350",
        "questionNumber": 350
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 540. Deputy Albert Dolan asked the Minister for Health if consideration will be given to allowing older persons to apply for a medical card through their local community welfare officer, in light of the significant difficulties many older persons experience in completing the required paperwork and navigating the current application process; and if she will make a statement on the matter. [68981/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_483",
          "debateSectionId": "dbsect_483",
          "showAs": "Medical Cards",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_483.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_540",
        "questionNumber": 540
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  LEADER is a long standing and effective EU programme that delivers tangible benefits to rural communities in areas such as economic development and job creation, rural infrastructure, social inclusion, and environmental sustainability. Therefore, the development of EU regulations relating to the post 2027 Common Agricultural Policy, or CAP, and the new National and Regional Partnership Plans is a matter of significant importance to my Department.  Within the draft regulations, the inclusion of the LEADER programme as a CAP intervention is to be welcomed. As part of the on-going negotiation process, my Department continues to emphasise the importance of a ringfenced allocation for the LEADER Programme.  I note that detailed discussions in relation to the shape and operation of the new regulations are on-going at both national and EU levels. To facilitate the current negotiation process for the post 2027 period, the Department of Agriculture Food and the Marine has established a CAP Consultative Committee, which includes representation from my Department.  Separate to that engagement, I will also continue to work with MEPs and my Government colleagues to ensure that the LEADER programme is funded into the future.  In addition, I note that my Department funds many other community related initiatives and rural investment schemes. For example, under the Social Inclusion and Community Activation Programme funding is provided to Local Development Companies to complete work to tackle poverty and social exclusion. Similarly, the range of schemes included in my department's Rural Development Investment Programme have seen unprecedented levels of investment in recent years. These and other programmes are making a real difference, and I am committed to ensuring that my department continues to implement a range of schemes and supports which directly benefit communities all across the country. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 550. Deputy Albert Dolan asked the Minister for Rural and Community Development and the Gaeltacht regarding the future of LEADER funding, if his Department has considered any alternative or complementary funding models to ensure the continued delivery of community-led local development initiatives beyond the current LEADER programme period; and if he will make a statement on the matter. [62211/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_494",
          "debateSectionId": "dbsect_494",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_494.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_550",
        "questionNumber": 550
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 13 to 23, inclusive, together.  Regulation, and the extent of any regulatory or administrative burden, has recently become a greater focus at European Union level and nationally as a means to further enhance competitiveness. At a European level, both simplification and implementation are important Commission priorities. The Commission is striving to simplify and lighten the administrative burden of European Union regulations to ensure they are proportionate, stable, coherent and technologically neutral.  Likewise, our national regulatory framework is a central focus for the Government as we strive to support competitiveness at a time of international economic uncertainty. In line with the programme for Government, we published an action plan on competitiveness and productivity on 10 September this year. The action plan includes actions across government to ensure the development of a more effective regulatory system which will support economic growth.  These actions reflect priority areas where targeted public policy intervention can have the greatest impact. These include a red-tape challenge to reduce regulation for SMEs; the application of the SME test by Government Departments to all measures, in particular policy initiatives where it is proposed to increase costs on small businesses; expediting the Environmental (Miscellaneous Provisions) Bill; commencing reforms, as we have done, under the Planning and Development Act 2024 to enhance delivery of infrastructure; and implementing the outstanding recommendations from the review of the administration of civil justice review group report.  Increased regulatory burden has also been identified as a barrier to infrastructure development and delivery. The Minister, Deputy Chambers, supported by the work of the accelerating infrastructure task force, this morning, with Government colleagues including me, the Tánaiste and the Minister of State, Deputy Harkin, published a plan which will include extensive regulatory reforms aimed at accelerating the delivery of critical infrastructure.  Today's plan provides the blueprint to reduce complexity and blockages in the system and deliver infrastructure with urgency. The changes we are initiating today are vital if we are to maintain our competitive position in an ever uncertain world. They are also necessary to support our citizens with top class public services, job security, access to housing and all other facilities necessary to enjoy the stability and good quality of life we are all entitled to expect.  The actions are ambitious but achievable, and delivering them will require commitment and co-operation across a broad and diverse range of stakeholders, from political, legal and public sectors, industry and society as a whole. We have established a cost-of-business advisory forum where business owners and representative bodies can speak directly to decision-makers about the real-world impact of regulations, fees and operational challenges. The work of that forum is under way. The Minister, Deputy McEntee, is working on the simplification omnibus packages put forward by the European Commission in a range of policy areas, most recently the Commission's digital simplification omnibus package, which was published last month.  My Department will play a co-ordinating role across these different regulatory reform initiatives, as outlined in the action plan on competitiveness and productivity, including the establishment of a central economic regulators' forum, and we will work with the Minister for Enterprise, Tourism and Employment and other Government colleagues on that agenda. \n Deputy Tony McCormack  I thank the Taoiseach for his response. I acknowledge the significant work he, the Minister, Deputy Chambers, and their two Departments are doing on infrastructure reform, particularly the steps being taken to modernise planning, reduce delays and ensure major projects move forward. Infrastructure reform is vital, but businesses and especially SMEs are also calling for a more streamlined regulatory environment. These firms consistently cite overlapping rules, slow approvals and heavy administrative demands as major obstacles to growth. Building on the work already happening on infrastructure, will the Taoiseach update the House on what specific measures his Department is pursuing to simplify compliance for SMEs, reduce unnecessary paperwork and make it easier for businesses to operate and expand? How will these reforms help to lower costs for employers and the taxpayer by making the system more efficient overall? \n Deputy Albert Dolan  It is vital that when we speak about regulatory reform, we talk about the administrative operations of existing systems in the function of the State. I will specifically reflect on the Sustainable Energy Authority of Ireland, SEAI, and the roll-out of grants. We are about to have a debate in this Chamber on energy costs. One thing that is vital is that the best way the Government can help to reduce energy costs in homes is to retrofit them for the future so that they simply do not need as much energy. That is the number one way to reduce the cost and it facilitates homes to be more efficient and takes pressure off the grid. The Government needs to do something to accelerate the rate at which homes can be retrofitted by the SEAI. For many constituents in my constituency, it is taking too long to get through the process of approval of the grant to construction. \n Deputy Ruairí Ó Murchú  We all accept there are huge issues with bureaucracy and red tape in planning. We should have seen simplification and streamlining. Conversations about this are occurring across Europe, but we know about the home-grown issues. It is an issue I have brought up previously, even within the planning systems involving State authorities. For example, Louth County Council is involved in the Ardee Education Together National School build and a particular issue has arisen. We do not have enough agility in the system. Multiple requests have gone in stating that there are not enough parking spaces. There are 21 spaces, including three disability spaces. There are only two set-down spaces for minibuses and there is a need for five as there are five autism spectrum disorder, ASD, classes and there is not even room for a full-size 52-seater bus to turn. There are 21 spaces for staff and there is a need for something closer to 40. \n An Ceann Comhairle  Thank you, Deputy. \n Deputy Ruairí Ó Murchú  It is possible to get this work done at this time, but if the works continue as planned, the problem will still need to be fixed but it could take more than €100,000, so we need something to be done. \n Deputy Darren O'Rourke  I raise the regulation of social media companies in the online space, particularly as it relates to children. The criticism that has been levelled at Coimisiún na Meán's online safety code is that an earlier draft had a recommendation that social media companies turn off recommender systems and it has been removed. Recommender systems profile people who are using apps and then drive them down often hateful and dangerous rabbit holes. It is not healthy for them or society. Will this be looked at? \n Deputy Ruth Coppinger  I raise regulatory reform of immigration and particularly family reunification. It is now being made much harder for many essential workers to be unified with their families, in particular migrant healthcare assistants who were brought over here on a visa programme and are working in private nursing homes. Last week on RTÉ radio, the Minister for justice was asked by the presenter whether these people are not entitled to a normal family life. They are caring for our older people and we have to show we care for them. The Minister's reply was that no one is forcing them to come here. That is absolutely heartless, shows zero empathy and is also completely counterproductive because many of them are nurses. They could go to other countries, but they have come to Ireland and are working below their grades or qualifications, giving huge added value to the nursing homes. I urge the Taoiseach to have a heart. We had a briefing here a few years ago, which Deputy Michael Healy-Rae attended because he knew the value of those healthcare assistants in nursing homes. These are essential workers and they will go elsewhere. \n An Ceann Comhairle  Thank you, Deputy. \n Deputy Ruth Coppinger  Please entitle them to have a normal family life. These mothers should not be separated from their kids. \n Deputy Paul Murphy  The programme for Government says the Government will move responsibility for the Multi-Unit Developments, MUD, Acts to the Department of housing from the Department of justice and establish a unit in the Housing Agency to regulate owners' management companies, OMCs, to ensure effective governance. That is important work that needs to happen. The problem is that it is not happening currently, but it has been agreed. Effectively what is holding it up is that, as a result of the Mulcreevy judgment, the primary legislation needs to be changed. At the moment, the MUD Act refers to the Minister for justice and not the Minister for housing. A simple amendment is needed to change the reference to the Minister for housing. Until that happens, all this work of regulatory oversight of OMCs and so on is simply not taking place. There was a meeting of the housing committee to discuss these issues. It invited various officials from the Department of housing and was told they could not come yet because their line Minister is not yet responsible for this. \n An Ceann Comhairle  Thank you, Deputy. \n Deputy Paul Murphy  The Housing Agency has not been allocated funding for doing any regulatory work as a result. This needs urgent action. \n Deputy Liam Quaide  There was a health committee session last week on the regulation of counselling and psychotherapy. In standards it has published, CORU has adopted a position that is entirely at odds with the main representative groups of those disciplines, which will reduce supervision requirements and remove mandatory personal therapy for trainees. These changes, if implemented, will degrade professional standards and undermine patient safety. CORU is showing a remarkable level of intransigence on these fundamentals of safe practice. Practitioners and representative bodies have warned that the proposals could also jeopardise recognition and mobility across the EU for counsellors and psychotherapists. We must protect high-quality training, preserve public confidence and ensure regulation strengthens, not weakens, these services.  I am not expressing some fringe opinion. The health committee was unanimous in supporting the counselling and psychotherapy representative groups and the session included some strong and insightful contributions from the Taoiseach's party colleagues, including Senator Costello. Will the Government immediately pause the CORU process, bring representative bodies and practitioners into full consultation and commit to reforms that prioritise client safety and high professional standards? \n Deputy Rose Conway-Walsh  I will talk about the regulation of quarries. The Taoiseach knows the price we have paid in this country and the price that families affected by the defective concrete blocks scandal have paid due to a lack of regulation.  Many of the homeowners I have spoken to in Mayo are not satisfied with the current regulations of quarries and in particular, that geologists are not examining the aggregate within the quarries that are being used to build homes now. I ask the Taoiseach to have a look at this area to see what can be done in that regard. It can be easily fixed by engaging and employing geologists to do the job and to make sure that people have confidence in the materials that are coming out of quarries. \n Deputy Richard Boyd Barrett  The Taxi Regulation Act 2013 clearly gives the Minister the power to impose regulations around the activities of dispatch companies. Today, for the third time in two weeks, taxi drivers in Dublin are protesting. There is a widespread protest against this across the country by taxi drivers over the behaviour of Uber, a multimillion euro company, that is trying to undermine the livelihood of nearly 20,000 taxi drivers by introducing a fixed fare system. This will undermine the regulated fare structure and therefore the livelihoods of taxi drivers and ultimately the industry itself. In the long run, as is clear from Uber's behaviour elsewhere in the world, it will not benefit the customer. Once the company gets hold of a market, fares and charges go up and the livelihoods of taxi drivers get smashed. Will the Taoiseach ask the Minister for Transport to impose such regulations to prevent Uber destroying the industry and livelihoods of taxi drivers around this fixed fare system and enforce the taxi regulation and meter stuff? \n The Taoiseach  Deputy McCormack raised infrastructure reform, particularly for small to medium-sized businesses. Some of the measures we have taken in respect of deferring the alignment of the minimum wage with the national living wage will help to avoid the escalation of costs because the SME sector has borne the brunt of a lot of additional costs over the past five years. There is no doubt the reduction in VAT on hospitality will help a lot of SMEs in the hospitality sector and hairdressing as well. The number of sick days leave is going to be quickly expanded. We have expanded it to three days. The cumulative cost of everything has been fairly excessive. The Small Business Forum is there to try to balance imposition on small business as well as the cost.  The other issue is the sequential approach to planning and regulations as opposed to a concurrent approach whereby instead of waiting for the planning to be done, agencies do the procurement. Instead of waiting for environmental assessments, doing them all in parallel would speed up a lot of activity. In many instances, we are constantly looking at the avoidance of increased cost for SMEs and trying to slow down the increased costs that have come their way. It is interesting the rate of youth employment has crept up in the past six to nine months. I believe that is related to costs on SMEs.  Deputy Dolan is correct that retrofitting is the most effective way to reduce costs. Between 2019 and September 2025, the Government provided over €1.5 billion in support to homeowners for over 228,000 upgrades, including 30,000 fully funded retrofits under the warmer homes scheme. It is estimated that if a deep retrofit is done, it can save a household up to €1,100 per year in energy costs. I get the Deputy's point that the administration of it needs to be faster. There is also resource demand in respect of it as well with some people not being able to afford to do retrofits because of the cost.  On Deputy Ó Murchú's issue, I do not have the specifics on Ardee Educate Together National School. I do not know what the interaction with the county council is, but in any event----- \n Deputy Ruairí Ó Murchú  The refusal to change----- \n The Taoiseach  They should sort it out. A school is an important facility. The county council should be facilitative in the building of a school. \n Deputy Ruairí Ó Murchú  It is not just the council. \n The Taoiseach  Deputy O'Rourke raised regulation online. We have now established the regulatory framework governing online. There is ongoing review in respect of it. Children must be protected. That has to be the optimal.  Deputy Coppinger raised healthcare assistants and family reunification. We have significant reunification in Ireland under our migration system, in particular when people leave direct provision who have residency. The Minister will bring forward legislation in respect of this and these are issues we can discuss in greater detail at that stage.  On Deputy Murphy's point, I will talk to the Ministers responsible. There has to be proper regulation of management companies. There are fundamental rights involved in terms of those complexes. I will pursue that with the Minister and see where we are in terms of amendment to primary legislation.  Deputy Quaide raised the issue of counselling and psychotherapy. On qualification frameworks and regulators generally, we want more therapists, but they have to be highly qualified. Public health is number one and the protection of the consumer. In some instances, they can be quite protectionist as well. The judgment called for regulators and I would like CORU to get the judgment right in terms of not having the bar so high that there are only highly qualified, and others are not. That is not just in terms of therapy and counselling; that is in terms of teaching and a range of other issues.  Deputy Conway-Walsh raised the regulation of quarries. I will talk to the Minister involved in that. We can overregulate too but I take the Deputy's point about the quality of aggregate and quality of the product. There are existing systems to deal with that. The SEAI is there. There are various regulatory bodies to deal with the quality of materials, but I will talk to the Minister in respect of that. New bodies were set up after the defective blocks scheme.  Deputy Boyd Barrett raised taxi regulation. I will talk to the Minister about the issues that the Deputy raised. There is a balance between consumers, those availing of taxis and the regulation of same. We had regulation a long time ago; it did not work. There was always an imbalance between supply and demand. I will look at this and will talk to the Minister for Transport in respect of it. He is fully aware of it. \n An Ceann Comhairle  We have a delegation of students visiting from Ukraine as our part of our EPAS programme hosted by Maynooth Post Primary School. They are most welcome. We had their president here yesterday, which we enjoyed immensely. ",
        "questionType": "oral",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 14. Deputy Albert Dolan asked the Taoiseach for an update on his Department’s plans to co-ordinate a range of actions aimed at regulatory reform. [58232/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/debate/dbsect_16",
          "debateSectionId": "dbsect_16",
          "showAs": "Regulatory Reform",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/debate/mul@/dbsect_16.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_14",
        "questionNumber": 14
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " The Taoiseach  Neither the Department of the Taoiseach nor the National Economic and Social Development Office (NESDO) - the only body under the aegis of the Department of the Taoiseach - has incurred expenditure on external consultancy in the past five years.  In the case of the Department, such expenditure - were it to be incurred - would be reported in the Department's annual Appropriation Account and the Department's Annual Report.  In the case of NESDO, such expenditure - were it to be incurred - would be reported in the NESDO Annual Report.  The Department's 2024 Appropriation Account is available at www.audit.gov.ie/en/publications/appropriation%20accounts/appropriation-accounts-2024.html.  The Department's 2024 Annual Report is available at www.gov.ie/en/department-of-the-taoiseach/publications/department-of-the-taoiseach-annual-report-2024.  Annual reports of the National Economic and Social Development Office are available at www.nesc.ie/publications/. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 83. Deputy Albert Dolan asked the Taoiseach further to Parliamentary Question No. 2148 of 4 November 2025 to the Minister for Further and Higher Education, Research, Innovation and Science in which he confirmed that, although not required by statute, his Department voluntarily publishes its annual consultancy spending online in the interest of transparency and accessibility, if his Department operates a similar practice; if not, whether consideration will be given to adopting this approach as a transparency measure consistent with the Code of Practice for the Governance of State Bodies and wider open-government principles. [68466/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_76",
          "debateSectionId": "dbsect_76",
          "showAs": "Departmental Reports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_76.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_83",
        "questionNumber": 83
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  This Department complies with the requirement to publish all purchase orders exceeding €20,000, as required under the 2011 Public Service Reform Plan. These publications refer to transactions for goods and services. These are publicly accessible and published quarterly in arrears on the gov.ie website on this weblink: www.gov.ie/en/department-of-foreign-affairs/organisation-information/payments-over-20000.  While there is no statutory requirement to publish annual consultancy spending online, consideration will be given to publishing this consultancy expenditure data online on an annual basis. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 88. Deputy Albert Dolan asked the Minister for Foreign Affairs and Trade further to Parliamentary Question No. 2148 of 4 November 2025 to the Minister for Further and Higher Education, Research, Innovation and Science in which he confirmed that, although not required by statute, her Department voluntarily publishes its annual consultancy spending online in the interest of transparency and accessibility, if her Department operates a similar practice; if not, whether consideration will be given to adopting this approach as a transparency measure consistent with the Code of Practice for the Governance of State Bodies and wider open-government principles; and if she will make a statement on the matter. [68458/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_82",
          "debateSectionId": "dbsect_82",
          "showAs": "Departmental Reports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_82.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_88",
        "questionNumber": 88
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 91. Deputy Albert Dolan asked the Minister for Climate, Energy and the Environment further to Parliamentary Question No. 2148 of 4 November 2025 to the Minister for Further and Higher Education, Research, Innovation and Science in which he confirmed that, although not required by statute, his Department voluntarily publishes its annual consultancy spending online in the interest of transparency and accessibility, if his Department operates a similar practice; if not, whether consideration will be given to adopting this approach as a transparency measure consistent with the Code of Practice for the Governance of State Bodies and wider open-government principles; and if he will make a statement on the matter. [68452/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_85",
          "debateSectionId": "dbsect_85",
          "showAs": "Departmental Reports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_85.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_91",
        "questionNumber": 91
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Defence  My Department provides a range of publicly accessible information in relation to its expenditure across all elements.  The latest audited financial statements of the agencies under the remit of my Department can be found on my Departments website at the following link: www.gov.ie/en/department-of-defence/organisation-information/latest-financial-details-from-the-department-of-defence/.  The audited Appropriation Accounts of my Department are published on the Office of the Comptroller and Auditor General's website. My Department also publishes details of Defence Vote Expenditure by category annually on the website in our Annual Report. Other routinely published information is also available on my Department's website including details of Purchase Orders for goods and services valued at more than €20,000 which includes those above that threshold for consultancy companies.  There are three bodies under the aegis of my Department, all of which are funded from my Department's voted expenditure and are reported on as such. Those bodies are the Army Pensions Board, established under the Army Pensions Act 1927, the Ombudsman for the Defence Forces (ODF), established pursuant to the provisions of the Ombudsman (Defence Forces) Act 2004 and the External Oversight Body of the Defence Forces (EOB), which was placed on a Statutory basis on 1 December 2024. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 92. Deputy Albert Dolan asked the Minister for Defence further to Parliamentary Question No. 2148 of 4 November 2025 to the Minister for Further and Higher Education, Research, Innovation and Science in which he confirmed that, although not required by statute, her Department voluntarily publishes its annual consultancy spending online in the interest of transparency and accessibility, if her Department operates a similar practice; if not, whether consideration will be given to adopting this approach as a transparency measure consistent with the Code of Practice for the Governance of State Bodies and wider open-government principles; and if she will make a statement on the matter. [68454/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_86",
          "debateSectionId": "dbsect_86",
          "showAs": "Departmental Reports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_86.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_92",
        "questionNumber": 92
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Transport  My Department complies with requirements in public tendering to ensure good governance.  My Department publishes details of all Purchase Orders for goods/services (including consultancy services) in excess of €20,000 on its website each quarter which is available at this link: www.gov.ie/en/department-of-transport/organisation-information/departmental-purchase-orders-greater-than-20000/#2025.  Public procurement practices in my Department are subject to audit and scrutiny by both the Department's Internal Audit Unit and by the C&AG under the Comptroller and Auditor General (Amendment) Act 1993. My Department is also subject to the reporting requirements under Circular 40/02, Circular 5/23, Circular 9/24 and it also reports on procurement compliance in its Annual Appropriation Account. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 102. Deputy Albert Dolan asked the Minister for Transport further to Parliamentary Question No. 2148 of 4 November 2025 to the Minister for Further and Higher Education, Research, Innovation and Science in which he confirmed that, although not required by statute, his Department voluntarily publishes its annual consultancy spending online in the interest of transparency and accessibility, if his Department operates a similar practice; if not, whether consideration will be given to adopting this approach as a transparency measure consistent with the Code of Practice for the Governance of State Bodies and wider open-government principles; and if he will make a statement on the matter. [68467/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_96",
          "debateSectionId": "dbsect_96",
          "showAs": "Departmental Reports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_96.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_102",
        "questionNumber": 102
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  A detailed analysis of my Department’s total expenditure is included in the publication of the Vote 7 annual Appropriation Account. My Department prepares its annual Appropriation Account in accordance with the Exchequer and Audit Departments Act, 1866 (as amended by the Comptroller and Auditor General (Amendment) Act, 1993) and with accounting rules and procedures laid down by the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation.  Each quarter my Department also publishes purchase orders for goods and services over €20,000. A description of services, including consultancy is included in the quarterly reports.  In addition, my Department has voluntarily published annual consultancy costs up to 2022 and will publish the 2023 and 2024 consultancy costs in the coming weeks. The 2025 consultancy costs will also be published in the first quarter of 2026.  The links to my Department’s annual consultancy costs and quarterly purchase orders over €20,000 are included below for ease of reference.  www.gov.ie/en/department-of-finance/collections/consultancy-costs/.  www.gov.ie/en/department-of-finance/collections/purchase-orders/#2025. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 113. Deputy Albert Dolan asked the Tánaiste and Minister for Finance further to Parliamentary Question No. 2148 of 4 November 2025 to the Minister for Further and Higher Education, Research, Innovation and Science in which he confirmed that, although not required by statute, his Department voluntarily publishes its annual consultancy spending online in the interest of transparency and accessibility, if his Department operates a similar practice; if not, whether consideration will be given to adopting this approach as a transparency measure consistent with the Code of Practice for the Governance of State Bodies and wider open-government principles; and if he will make a statement on the matter. [68457/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_108",
          "debateSectionId": "dbsect_108",
          "showAs": "Departmental Reports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_108.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_113",
        "questionNumber": 113
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  My Department adheres to the EU and National public procurement guidelines and legislation and maintains high standards in the management of the public funds entrusted to it and is fully committed to transparency, fairness and accountability in all its purchasing activities.  As a requirement under the relevant Circular 20/2024, my Department reports the total cost of external consultancy annually in its Appropriation Accounts. In addition, my Department publishes information on its website in relation to purchase orders in excess of €20,000 every quarter.  It is the intention of my Department to continue adopting a transparent and accessible approach to information about public funds and, in this context, the Department will examine the potential for publishing further relevant information related to consultancy spend in 2026. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 122. Deputy Albert Dolan asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation further to Parliamentary Question No. 2148 of 4 November 2025 to the Minister for Further and Higher Education, Research, Innovation and Science in which he confirmed that, although not required by statute, his Department voluntarily publishes its annual consultancy spending online in the interest of transparency and accessibility, if his Department operates a similar practice; if not, whether consideration will be given to adopting this approach as a transparency measure consistent with the Code of Practice for the Governance of State Bodies and wider open-government principles; and if he will make a statement on the matter. [68463/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_116",
          "debateSectionId": "dbsect_116",
          "showAs": "Departmental Reports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_116.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_122",
        "questionNumber": 122
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Enterprise, Tourism and Employment  In accordance with the Public Service Reform Plan 2011, purchase orders for amounts over €20,000 are published online by my Department. This includes expenditure on consultancy.  I note the approach taken by the Department of Further and Higher Education, Research, Innovation and Science and have asked my officials to consider the matter and progress. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 132. Deputy Albert Dolan asked the Minister for Enterprise, Tourism and Employment further to Parliamentary Question No. 2148 of 4 November 2025 to the Minister for Further and Higher Education, Research, Innovation and Science in which he confirmed that, although not required by statute, his Department voluntarily publishes its annual consultancy spending online in the interest of transparency and accessibility, if his Department operates a similar practice; if not, whether consideration will be given to adopting this approach as a transparency measure consistent with the Code of Practice for the Governance of State Bodies and wider open-government principles; and if he will make a statement on the matter. [68456/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_125",
          "debateSectionId": "dbsect_125",
          "showAs": "Departmental Reports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_125.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_132",
        "questionNumber": 132
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Information in relation to consultancy expenditure in my Department is compiled annually in respect of the previous year and published online at www.gov.ie/en/collection/department-of-education-and-skills-expenditure-on-consultancy/ The data in respect of 2025 is being compiled at present and will be published online as soon as it is available. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 150. Deputy Albert Dolan asked the Minister for Education and Youth further to Parliamentary Question No. 2148 of 4 November 2025 to the Minister for Further and Higher Education, Research, Innovation and Science in which he confirmed that, although not required by statute, her Department voluntarily publishes its annual consultancy spending online in the interest of transparency and accessibility, if her Department operates a similar practice; if not, whether consideration will be given to adopting this approach as a transparency measure consistent with the Code of Practice for the Governance of State Bodies and wider open-government principles; and if she will make a statement on the matter. [68455/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_143",
          "debateSectionId": "dbsect_143",
          "showAs": "Departmental Reports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_143.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_150",
        "questionNumber": 150
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Culture, Communications and Sport  The spend on administrative consultancy is cited in my Department's Appropriation Accounts. These accounts are available online www.audit.gov.ie/en/publications/appropriation%20accounts/  While my Department does not publish its annual spending specific to consultancy online, I have furnished the House with consultancy details through replies to Parliamentary Questions, most recently in June and July of this year, and will continue to do so as requested. These replies are available online. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 152. Deputy Albert Dolan asked the Minister for Culture, Communications and Sport further to Parliamentary Question No. 2148 of 4 November 2025 to the Minister for Further and Higher Education, Research, Innovation and Science in which he confirmed that, although not required by statute, his Department voluntarily publishes its annual consultancy spending online in the interest of transparency and accessibility, if his Department operates a similar practice; if not, whether consideration will be given to adopting this approach as a transparency measure consistent with the Code of Practice for the Governance of State Bodies and wider open-government principles; and if he will make a statement on the matter. [68453/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_145",
          "debateSectionId": "dbsect_145",
          "showAs": "Departmental Reports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_145.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_152",
        "questionNumber": 152
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy James Browne)   Reply not received from Department.  ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 159. Deputy Albert Dolan asked the Minister for Housing, Local Government and Heritage further to Parliamentary Question No. 2148 of 4 November 2025 to the Minister for Further and Higher Education, Research, Innovation and Science in which he confirmed that, although not required by statute, his Department voluntarily publishes its annual consultancy spending online in the interest of transparency and accessibility, if his Department operates a similar practice; if not, whether consideration will be given to adopting this approach as a transparency measure consistent with the Code of Practice for the Governance of State Bodies and wider open-government principles; and if he will make a statement on the matter. [68461/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_152",
          "debateSectionId": "dbsect_152",
          "showAs": "Departmental Reports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_152.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_159",
        "questionNumber": 159
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  Consultancy is defined by the Department of Finance as where a person or organisation provides intellectual or knowledge-based services (e.g. expert analysis and advice) through delivering reports, studies, assessments, recommendations, proposals, etc. that contribute to decision making or policy development.  The procurement of consultancy services is essential to support my Department in providing high quality service to the public in a cost effective and efficient manner. All expenditure is closely monitored, and companies are only engaged for essential work, following a rigorous assessment of need and where the required competencies do not exist in house.  I can confirm to the Deputy that all expenditure since 2011 incurred by my Department in relation to Consultancy and IT External Services Provision is published annually on the Gov.ie website at: www.gov.ie/en/organisation-information/48366f-department-of-employment-affairs-and-social-protection-policy-on-pro/#what-we-purchase. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 171. Deputy Albert Dolan asked the Minister for Social Protection further to Parliamentary Question No. 2148 of 4 November 2025 to the Minister for Further and Higher Education, Research, Innovation and Science in which he confirmed that, although not required by statute, his Department voluntarily publishes its annual consultancy spending online in the interest of transparency and accessibility, if his Department operates a similar practice; if not, whether consideration will be given to adopting this approach as a transparency measure consistent with the Code of Practice for the Governance of State Bodies and wider open-government principles; and if he will make a statement on the matter. [68465/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_162",
          "debateSectionId": "dbsect_162",
          "showAs": "Departmental Reports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_162.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_171",
        "questionNumber": 171
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  My Department is committed to the principles of openness, transparency and the accountability of public bodies. Public procurement is governed by EU and national rules and my Department ensures that appropriate procedures are followed for all procurement activity.  An analysis of my Department’s expenditure is provided in the annual appropriation accounts for the Justice Vote (Vote 24). This includes reporting on consultancy-based expenditure. The appropriation accounts can be accessed on the website of the Comptroller & Auditor General at: www.audit.gov.ie/en/publications/appropriation%20accounts/.  In line with an action in the Public Service Reform Plan (2011), my Department publishes all purchase orders of €20,000 or over on its website at: www.gov.ie/en/department-of-justice-home-affairs-and-migration/collections/department-of-justice-purchase-orders-issued-over-20000-in-value/. A description of services, including consultancy is included in the quarterly reports.  My Department is planning to migrate to a new financial management shared services system supported by the NSSO next year. Once this has been completed, my officials will be in a better position to assess what further information can be routinely published. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 198. Deputy Albert Dolan asked the Minister for Justice, Home Affairs and Migration further to Parliamentary Question No. 2148 of 4 November 2025 to the Minister for Further and Higher Education, Research, Innovation and Science in which he confirmed that, although not required by statute, his Department voluntarily publishes its annual consultancy spending online in the interest of transparency and accessibility, if his Department operates a similar practice; if not, whether consideration will be given to adopting this approach as a transparency measure consistent with the Code of Practice for the Governance of State Bodies and wider open-government principles; and if he will make a statement on the matter. [68462/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_175",
          "debateSectionId": "dbsect_175",
          "showAs": "Departmental Reports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_175.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_198",
        "questionNumber": 198
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  In line with the reporting requirements of the Freedom of Information Act 2014, my Department publishes quarterly reports on:  All procured contracts with a value of €25,000 or greater, and  All paid Purchases Orders with a value of €20,000 or greater.  In addition, while my Department does not provide a detailed breakdown by area, such as for expenditure on consultants, details of annual expenditure are published annually in my Department's Appropriation Account. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 219. Deputy Albert Dolan asked the Minister for Agriculture, Food and the Marine further to Parliamentary Question No. 2148 of 4 November 2025 to the Minister for Further and Higher Education, Research, Innovation and Science in which he confirmed that, although not required by statute, his Department voluntarily publishes its annual consultancy spending online in the interest of transparency and accessibility, if his Department operates a similar practice; if not, whether consideration will be given to adopting this approach as a transparency measure consistent with the Code of Practice for the Governance of State Bodies and wider open-government principles; and if he will make a statement on the matter. [68450/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_189",
          "debateSectionId": "dbsect_189",
          "showAs": "Departmental Reports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_189.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_219",
        "questionNumber": 219
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The Department is currently collating the information requested and a reply will issue directly to the Deputy on this matter as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 227. Deputy Albert Dolan asked the Minister for Children, Disability and Equality further to Parliamentary Question No. 2148 of 4 November 2025 to the Minister for Further and Higher Education, Research, Innovation and Science in which he confirmed that, although not required by statute, her Department voluntarily publishes its annual consultancy spending online in the interest of transparency and accessibility, if her Department operates a similar practice; if not, whether consideration will be given to adopting this approach as a transparency measure consistent with the Code of Practice for the Governance of State Bodies and wider open-government principles; and if she will make a statement on the matter. [68451/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_196",
          "debateSectionId": "dbsect_196",
          "showAs": "Departmental Reports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_196.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_227",
        "questionNumber": 227
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Health  Consultancy expenditure costs are reported in the Department’s audited Appropriation Account, which is publicly available on the Comptroller and Auditor General’s website, in accordance with the Code of Practice for the Governance of State Bodies.  The Department will consider measures to make this information more accessible as part of its ongoing commitment to transparency. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 270. Deputy Albert Dolan asked the Minister for Health further to Parliamentary Question No. 2148 of 4 November 2025 to the Minister for Further and Higher Education, Research, Innovation and Science in which he confirmed that, although not required by statute, her Department voluntarily publishes its annual consultancy spending online in the interest of transparency and accessibility, if her Department operates a similar practice; if not, whether consideration will be given to adopting this approach as a transparency measure consistent with the Code of Practice for the Governance of State Bodies and wider open-government principles; and if she will make a statement on the matter. [68460/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_231",
          "debateSectionId": "dbsect_231",
          "showAs": "Departmental Reports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_231.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_270",
        "questionNumber": 270
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  My Department publishes details of consultancy payments made in a given year following the close of the financial year. The published information comprises details of the nature of the consultancy work undertaken and the costs incurred.  This information is available on the Department’s website at the following link:  www.gov.ie/en/department-of-rural-and-community-development-and-the-gaeltacht/organisation-information/financial-information/#consultancies. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 274. Deputy Albert Dolan asked the Minister for Rural and Community Development and the Gaeltacht further to Parliamentary Question No. 2148 of 4 November 2025 to the Minister for Further and Higher Education, Research, Innovation and Science in which he confirmed that, although not required by statute, his Department voluntarily publishes its annual consultancy spending online in the interest of transparency and accessibility, if his Department operates a similar practice; if not, whether consideration will be given to adopting this approach as a transparency measure consistent with the Code of Practice for the Governance of State Bodies and wider open-government principles; and if he will make a statement on the matter. [68464/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_235",
          "debateSectionId": "dbsect_235",
          "showAs": "Departmental Reports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_235.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_274",
        "questionNumber": 274
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  Enabling students with special educational needs to receive an appropriate education is a priority for this Government. It is also a key priority for me, my department and for the National Council for Special Education (NCSE).  The NCSE is, in the first instance, the primary body responsible for the matter the Deputy has raised. I will arrange for your query to be forwarded to the NCSE for their attention and direct reply.  Deputies are also welcome to raise such queries with the NCSE directly through their dedicated Oireachtas query line at oireachtasqueries@ncse.ie ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 206. Deputy Albert Dolan asked the Minister for Education and Youth further to Parliamentary Question No. 645 of 4 November 2025, whether schools will be instructed or required by the NCSE to redeploy special needs assistants (SNAs) from their mainstream SNA allocation in order to meet above-SERC needs in autism classes under the new SNA review guidelines; whether the previous above-SERC SNA review process for autism classes has been discontinued; and if she will make a statement on the matter. [67273/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_190",
          "debateSectionId": "dbsect_190",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_190.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_206",
        "questionNumber": 206
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 325 to 330, inclusive, together.  The management and maintenance of local authority social homes, including pre-letting repairs to vacant properties, implementing a planned maintenance programme and carrying out responsive repairs, are matters for each local authority under s.58 of the Housing Act 1966. Local authorities are also required to ensure all tenanted homes comply with the Housing (Standards for Rented Houses) Regulations 2019.  Notwithstanding these obligations, my Department provides annual funding under the Planned Maintenance/Voids Programme to support local authorities in this regard. From 2014 to the end of 2024, almost 26,000 vacant social homes have been brought back to productive use through investment of more than €361m. An annualised breakdown by local authority of the funding provided and the number of properties remediated under the Voids programme is available at www.gov.ie/en/collection/0906a-other-local-authority-housing-scheme-statistics/#voids-programme.  Some €31 million will be provided in 2025, supporting the refurbishment and re-letting of at least 1,900 social homes, facilitating the quick turnaround of casual vacancies and continuing the transition from a reactive voids approach to a planned maintenance approach. Data on delivery under the 2025 Planned Maintenance/Voids Programme will be available early next year.  Critically, funding from my Department for planned maintenance and the quick turnaround of casual vacancies is intended to complement local authority own funding. It does not substitute for adequate provision for housing maintenance by local authority officials and elected members as part of the annual budgetary process.  Local authorities will always have a level of vacancy in their housing stock. This will fluctuate over time as tenancy surrender and re-letting of dwellings is an ongoing process.  While data regarding the number of voids are not routinely collated by my Department, statistics in relation to social homes, at a point in time, are published by the National Oversight and Audit Commission (NOAC) in their Annual Reports on Performance Indicators in Local Authorities. These reports provide a range of information in relation to social housing stock, including levels of vacancy in local authority owned properties. The most recent report relating to 2024 is available at www.noac.ie/noac_publications/report-77-noac-performance-indicator-report-2024/.  Data regarding the number of social homes classified as voids and the average cost of remediating dwellings should be sought directly from local authorities.  My Department has not examined the feasibility of aligning local authority programmes with the private sector vacant property grant. Similarly, an analysis of the cost, speed and long-term maintenance outcomes versus acquiring, leasing or building social homes has not been undertaken. The imperative at present is to maximise the quantum of social housing available to households from all sources, including the quick turnaround of all casually vacant social homes.  A new planned maintenance and repairs programme will be introduced in 2026, focusing on a prompt turnaround and re-letting of vacant homes and only those works necessary to ensure compliance with the Housing (Standards for Rented Houses) Regulations 2019. This approach, coupled with a continued transition to planned maintenance will minimise the works required when homes become vacant and secure the most cost effective and prompt turnaround of vacant local authority homes. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 325. Deputy Albert Dolan asked the Minister for Housing, Local Government and Heritage further to schemes such as the town and village renewal grant, if local authorities may use, or support applicants to use, such schemes to bring vacant or derelict residential units or voids back into productive use;; and if he will make a statement on the matter. [67513/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_297",
          "debateSectionId": "dbsect_297",
          "showAs": "Vacant Properties",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_297.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_325",
        "questionNumber": 325
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 325 to 330, inclusive, together.  The management and maintenance of local authority social homes, including pre-letting repairs to vacant properties, implementing a planned maintenance programme and carrying out responsive repairs, are matters for each local authority under s.58 of the Housing Act 1966. Local authorities are also required to ensure all tenanted homes comply with the Housing (Standards for Rented Houses) Regulations 2019.  Notwithstanding these obligations, my Department provides annual funding under the Planned Maintenance/Voids Programme to support local authorities in this regard. From 2014 to the end of 2024, almost 26,000 vacant social homes have been brought back to productive use through investment of more than €361m. An annualised breakdown by local authority of the funding provided and the number of properties remediated under the Voids programme is available at www.gov.ie/en/collection/0906a-other-local-authority-housing-scheme-statistics/#voids-programme.  Some €31 million will be provided in 2025, supporting the refurbishment and re-letting of at least 1,900 social homes, facilitating the quick turnaround of casual vacancies and continuing the transition from a reactive voids approach to a planned maintenance approach. Data on delivery under the 2025 Planned Maintenance/Voids Programme will be available early next year.  Critically, funding from my Department for planned maintenance and the quick turnaround of casual vacancies is intended to complement local authority own funding. It does not substitute for adequate provision for housing maintenance by local authority officials and elected members as part of the annual budgetary process.  Local authorities will always have a level of vacancy in their housing stock. This will fluctuate over time as tenancy surrender and re-letting of dwellings is an ongoing process.  While data regarding the number of voids are not routinely collated by my Department, statistics in relation to social homes, at a point in time, are published by the National Oversight and Audit Commission (NOAC) in their Annual Reports on Performance Indicators in Local Authorities. These reports provide a range of information in relation to social housing stock, including levels of vacancy in local authority owned properties. The most recent report relating to 2024 is available at www.noac.ie/noac_publications/report-77-noac-performance-indicator-report-2024/.  Data regarding the number of social homes classified as voids and the average cost of remediating dwellings should be sought directly from local authorities.  My Department has not examined the feasibility of aligning local authority programmes with the private sector vacant property grant. Similarly, an analysis of the cost, speed and long-term maintenance outcomes versus acquiring, leasing or building social homes has not been undertaken. The imperative at present is to maximise the quantum of social housing available to households from all sources, including the quick turnaround of all casually vacant social homes.  A new planned maintenance and repairs programme will be introduced in 2026, focusing on a prompt turnaround and re-letting of vacant homes and only those works necessary to ensure compliance with the Housing (Standards for Rented Houses) Regulations 2019. This approach, coupled with a continued transition to planned maintenance will minimise the works required when homes become vacant and secure the most cost effective and prompt turnaround of vacant local authority homes. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 326. Deputy Albert Dolan asked the Minister for Housing, Local Government and Heritage to outline all current funding streams, capital supports, and operational supports made available by his Department to local authorities for the purpose of returning vacant or derelict local authority homes to use voids, including approvals, drawdown mechanisms, turnaround targets, and auditing arrangements; and if he will make a statement on the matter. [67514/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_297",
          "debateSectionId": "dbsect_297",
          "showAs": "Vacant Properties",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_297.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_326",
        "questionNumber": 326
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 325 to 330, inclusive, together.  The management and maintenance of local authority social homes, including pre-letting repairs to vacant properties, implementing a planned maintenance programme and carrying out responsive repairs, are matters for each local authority under s.58 of the Housing Act 1966. Local authorities are also required to ensure all tenanted homes comply with the Housing (Standards for Rented Houses) Regulations 2019.  Notwithstanding these obligations, my Department provides annual funding under the Planned Maintenance/Voids Programme to support local authorities in this regard. From 2014 to the end of 2024, almost 26,000 vacant social homes have been brought back to productive use through investment of more than €361m. An annualised breakdown by local authority of the funding provided and the number of properties remediated under the Voids programme is available at www.gov.ie/en/collection/0906a-other-local-authority-housing-scheme-statistics/#voids-programme.  Some €31 million will be provided in 2025, supporting the refurbishment and re-letting of at least 1,900 social homes, facilitating the quick turnaround of casual vacancies and continuing the transition from a reactive voids approach to a planned maintenance approach. Data on delivery under the 2025 Planned Maintenance/Voids Programme will be available early next year.  Critically, funding from my Department for planned maintenance and the quick turnaround of casual vacancies is intended to complement local authority own funding. It does not substitute for adequate provision for housing maintenance by local authority officials and elected members as part of the annual budgetary process.  Local authorities will always have a level of vacancy in their housing stock. This will fluctuate over time as tenancy surrender and re-letting of dwellings is an ongoing process.  While data regarding the number of voids are not routinely collated by my Department, statistics in relation to social homes, at a point in time, are published by the National Oversight and Audit Commission (NOAC) in their Annual Reports on Performance Indicators in Local Authorities. These reports provide a range of information in relation to social housing stock, including levels of vacancy in local authority owned properties. The most recent report relating to 2024 is available at www.noac.ie/noac_publications/report-77-noac-performance-indicator-report-2024/.  Data regarding the number of social homes classified as voids and the average cost of remediating dwellings should be sought directly from local authorities.  My Department has not examined the feasibility of aligning local authority programmes with the private sector vacant property grant. Similarly, an analysis of the cost, speed and long-term maintenance outcomes versus acquiring, leasing or building social homes has not been undertaken. The imperative at present is to maximise the quantum of social housing available to households from all sources, including the quick turnaround of all casually vacant social homes.  A new planned maintenance and repairs programme will be introduced in 2026, focusing on a prompt turnaround and re-letting of vacant homes and only those works necessary to ensure compliance with the Housing (Standards for Rented Houses) Regulations 2019. This approach, coupled with a continued transition to planned maintenance will minimise the works required when homes become vacant and secure the most cost effective and prompt turnaround of vacant local authority homes. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 327. Deputy Albert Dolan asked the Minister for Housing, Local Government and Heritage if his Department maintains any form of benchmarking, comparative performance assessment, league table, or KPI-based ranking of local authorities in respect of their management of vacant/void social housing units, including turnaround times, cost per unit, and annual throughput; and if such information exists, if he will publish it; and if not, the reason such comparative evaluation is not undertaken. [67515/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_297",
          "debateSectionId": "dbsect_297",
          "showAs": "Vacant Properties",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_297.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_327",
        "questionNumber": 327
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 325 to 330, inclusive, together.  The management and maintenance of local authority social homes, including pre-letting repairs to vacant properties, implementing a planned maintenance programme and carrying out responsive repairs, are matters for each local authority under s.58 of the Housing Act 1966. Local authorities are also required to ensure all tenanted homes comply with the Housing (Standards for Rented Houses) Regulations 2019.  Notwithstanding these obligations, my Department provides annual funding under the Planned Maintenance/Voids Programme to support local authorities in this regard. From 2014 to the end of 2024, almost 26,000 vacant social homes have been brought back to productive use through investment of more than €361m. An annualised breakdown by local authority of the funding provided and the number of properties remediated under the Voids programme is available at www.gov.ie/en/collection/0906a-other-local-authority-housing-scheme-statistics/#voids-programme.  Some €31 million will be provided in 2025, supporting the refurbishment and re-letting of at least 1,900 social homes, facilitating the quick turnaround of casual vacancies and continuing the transition from a reactive voids approach to a planned maintenance approach. Data on delivery under the 2025 Planned Maintenance/Voids Programme will be available early next year.  Critically, funding from my Department for planned maintenance and the quick turnaround of casual vacancies is intended to complement local authority own funding. It does not substitute for adequate provision for housing maintenance by local authority officials and elected members as part of the annual budgetary process.  Local authorities will always have a level of vacancy in their housing stock. This will fluctuate over time as tenancy surrender and re-letting of dwellings is an ongoing process.  While data regarding the number of voids are not routinely collated by my Department, statistics in relation to social homes, at a point in time, are published by the National Oversight and Audit Commission (NOAC) in their Annual Reports on Performance Indicators in Local Authorities. These reports provide a range of information in relation to social housing stock, including levels of vacancy in local authority owned properties. The most recent report relating to 2024 is available at www.noac.ie/noac_publications/report-77-noac-performance-indicator-report-2024/.  Data regarding the number of social homes classified as voids and the average cost of remediating dwellings should be sought directly from local authorities.  My Department has not examined the feasibility of aligning local authority programmes with the private sector vacant property grant. Similarly, an analysis of the cost, speed and long-term maintenance outcomes versus acquiring, leasing or building social homes has not been undertaken. The imperative at present is to maximise the quantum of social housing available to households from all sources, including the quick turnaround of all casually vacant social homes.  A new planned maintenance and repairs programme will be introduced in 2026, focusing on a prompt turnaround and re-letting of vacant homes and only those works necessary to ensure compliance with the Housing (Standards for Rented Houses) Regulations 2019. This approach, coupled with a continued transition to planned maintenance will minimise the works required when homes become vacant and secure the most cost effective and prompt turnaround of vacant local authority homes. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 328. Deputy Albert Dolan asked the Minister for Housing, Local Government and Heritage the number of local authority dwellings classified as void, by each local authority in each of the past five years; the number returned to use annually; the average cost of remediation per dwelling; the mean and median turnaround time; the value of Departmental funding drawn down for this purpose; and if he will make a statement on the matter. [67516/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_297",
          "debateSectionId": "dbsect_297",
          "showAs": "Vacant Properties",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_297.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_328",
        "questionNumber": 328
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 325 to 330, inclusive, together.  The management and maintenance of local authority social homes, including pre-letting repairs to vacant properties, implementing a planned maintenance programme and carrying out responsive repairs, are matters for each local authority under s.58 of the Housing Act 1966. Local authorities are also required to ensure all tenanted homes comply with the Housing (Standards for Rented Houses) Regulations 2019.  Notwithstanding these obligations, my Department provides annual funding under the Planned Maintenance/Voids Programme to support local authorities in this regard. From 2014 to the end of 2024, almost 26,000 vacant social homes have been brought back to productive use through investment of more than €361m. An annualised breakdown by local authority of the funding provided and the number of properties remediated under the Voids programme is available at www.gov.ie/en/collection/0906a-other-local-authority-housing-scheme-statistics/#voids-programme.  Some €31 million will be provided in 2025, supporting the refurbishment and re-letting of at least 1,900 social homes, facilitating the quick turnaround of casual vacancies and continuing the transition from a reactive voids approach to a planned maintenance approach. Data on delivery under the 2025 Planned Maintenance/Voids Programme will be available early next year.  Critically, funding from my Department for planned maintenance and the quick turnaround of casual vacancies is intended to complement local authority own funding. It does not substitute for adequate provision for housing maintenance by local authority officials and elected members as part of the annual budgetary process.  Local authorities will always have a level of vacancy in their housing stock. This will fluctuate over time as tenancy surrender and re-letting of dwellings is an ongoing process.  While data regarding the number of voids are not routinely collated by my Department, statistics in relation to social homes, at a point in time, are published by the National Oversight and Audit Commission (NOAC) in their Annual Reports on Performance Indicators in Local Authorities. These reports provide a range of information in relation to social housing stock, including levels of vacancy in local authority owned properties. The most recent report relating to 2024 is available at www.noac.ie/noac_publications/report-77-noac-performance-indicator-report-2024/.  Data regarding the number of social homes classified as voids and the average cost of remediating dwellings should be sought directly from local authorities.  My Department has not examined the feasibility of aligning local authority programmes with the private sector vacant property grant. Similarly, an analysis of the cost, speed and long-term maintenance outcomes versus acquiring, leasing or building social homes has not been undertaken. The imperative at present is to maximise the quantum of social housing available to households from all sources, including the quick turnaround of all casually vacant social homes.  A new planned maintenance and repairs programme will be introduced in 2026, focusing on a prompt turnaround and re-letting of vacant homes and only those works necessary to ensure compliance with the Housing (Standards for Rented Houses) Regulations 2019. This approach, coupled with a continued transition to planned maintenance will minimise the works required when homes become vacant and secure the most cost effective and prompt turnaround of vacant local authority homes. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 329. Deputy Albert Dolan asked the Minister for Housing, Local Government and Heritage if his Department has examined the feasibility of aligning private-sector vacant property grants with local authority programmes for returning voids to use; and if not, if such alignment will now be considered. [67517/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Albert-Dolan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Albert-Dolan.D.2024-11-29",
          "showAs": "Albert Dolan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_297",
          "debateSectionId": "dbsect_297",
          "showAs": "Vacant Properties",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_297.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_329",
        "questionNumber": 329
      },
      "contextDate": "2025-12-02"
    }
  ]
}