{
  "head": {
    "counts": {
      "questionCount": 1668,
      "resultCount": 1668
    }
  },
  "results": [
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Children",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1875. Deputy Dessie Ellis asked the Minister for Children, Disability and Equality to outline the reason for deductions made to pay for persons (details supplied); and if she will make a statement on the matter. [44694/25] ",
        "by": {
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "showAs": "Dessie Ellis",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_1875",
        "questionNumber": 1875,
        "answerText": " Minister for Children, Disability and Equality  Thank you for your enquiry about the  Technical Adjustment Payments applied to public service employees transferring from the National Educational Welfare Board’s (NEWB) payroll systems to the Tusla - Child and Family Agency payroll.  I am advised that when Tusla was established on 1 January 2014 it brought together over 4,000 staff who were previously employed within Children and Family Services of the Health Service Executive (HSE), the National Educational Welfare Board (NEWB), and the Family Support Agency (FSA). The National Educational Welfare Board was renamed the Educational Welfare Service (EWS) when it was subsumed into Tusla. The establishment of Tusla encompassed the move of staff from ten different payrolls with a number of different pay frequencies onto a single standard payroll.  Staff from the HSE transferred to the newly established Tusla payroll on 1st January 2014. Staff from NEWB and FSA continued to be paid on their respective payrolls until December 2014 at which point, they were transferred to the Tusla payroll.  The payment of a Technical Adjustment Payment is a standard agreed method with Trade Unions applied across the public service sector for employees transferring payroll frequencies to bridge payroll gaps. Technical Adjustment Payments have never been referred to, considered or reported by Tusla as overpayments and must be repaid by any employees that receive such a payment.  In advance of the transfer to the Tusla payroll, there were multiple communications to all employees, including those who transferred from the NEWB, and who were encompassed by the Technical Adjustment Payment. The communications in respect of the Technical Adjustment Payment specified that it was not a cash advance and it was not a loan and must be repaid and expressly provided that “…. it must be repaid on leaving/retirement and will be recouped from your final salary ”. Staff did not have to sign acceptance, but many communications and presentations were given to staff, and these communications continue to be provided to remaining staff in relation to this payment.  Prior to the transfer to the Tusla payroll system. NEWB staff were paid fortnightly on a Thursday for days worked up to and including the pay date and one day in advance, i.e. the Friday. The move to the Tusla payroll meant that NEWB staff continued to be paid fortnightly on a Thursday, but not up-to-date and one day in advance as per the NEWB payroll, but 11 days in arrears in line with the Tusla payroll. To ensure that NEWB staff were not disadvantaged by the move of payroll, a “Technical Adjustment Payment” was made to employees to ensure there was no gap in pay while aligning the payroll and pay dates, i.e. aligned to 11 days in arrears and continuing to be paid fortnightly thereafter. Table 1 below outlines the schedule of pay dates for the staff members transferring payrolls.  Staff moved to Tusla HR/Payroll on 20.12.2014. Tusla fortnightly salary for period 08.12.2014 to 21.12.2014 had a pay date of 01.01.2015. In this pay EWS staff were paid for 20.12.2014-21.12.2014 plus 12 days technical adjustment to bridge the gap to next pay date on 15.01.2015 for days worked between 22.12.2014 to 04.01.2015.  Table 1: Schedule of pay dates for staff members transferring payrolls      Pay Date      Pay Period      Pay Master            EWS Payroll Pre-Transferring to Tusla Payroll               21.11.2014    08.11.2014 – 21.11.2014    EWS      02.12.2014    22.11.2014 – 02.12.2014    EWS      19.12.2014    03.12.2014 – 19.12.2014    EWS           Commencing on Tusla Payroll               01.01.2015  (paid 31.12.2014)    20.12.2014 – 21.12.2014  (plus 12 days technical adjustment)    Tusla      15.01.2015    22.12.2014 – 04.01.2015    Tusla          05.01.2015 – 18.01.2015    Tusla       The move to Tusla HR/Payroll meant that EWS staff continued to be paid fortnightly on a Thursday, but the working dates in their fortnightly salary changed, the Technical Adjustment Payment was a notional payment to ensure that there was no cashflow disadvantage to employees as a result of moving pay periods or as a result of any tax implications that may arise.  In essence the Technical Adjustment Payment from 01.01.2015 meant that staff received their usual fortnightly amount even though the revised pay period covered two working days that had not already been covered in a previous payment. 12 notional days were added to achieve this. The pay received on 15.01.2015 then paid those staff for the actual days worked. At that point it can be seen that the Technical Adjustment Payment ensured staff had no cashflow problems or disruption to their income but also that 12 days of work had been double remunerated.  The payment of a Technical Adjustment Payment is a standard agreed method with Trade Unions applied across the public service sector for employees transferring payroll frequencies to bridge payroll gaps and this process has been in operation through all payroll frequency changes throughout the HSE and Tusla for many years.  The NEWB staff were advised of the impact to them at the time by means of a number of communication methods including staff presentations, organisational memos, and individual letters explaining the process, payments and amounts to them. NEWB staff were also informed that they could choose to repay the Technical Adjustment Payment at the time of the payment was made or at any time throughout their employment. Those who chose not to repay it at the time or throughout their employment were notified that it would be recouped by Tusla upon the staff member leaving or retiring from the Agency.  Tusla to date, has recouped all Technical Adjustment Payments that remained unpaid by staff members upon leaving or on retiring from the agency, this payment has been recouped through deductions from their final Tusla salary payment.  Any changes to how these Technical Adjustment Payments are applied across the public service sector would have a significant impact on the Public Service payroll administrator’s ability to recoup any outstanding payments from staff members as they leave or retire.  This issue of payment and recoupment of a technical adjustment payment was raised by a former employee of the NEWB and progressed through the WRC, Labour Court and High Court, all of which confirmed the payment and recoupment of Technical Adjustment payment occurred and recoupment was warranted. ",
        "debateSection": {
          "showAs": "Employment Rights",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_1587",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_1587.xml"
            }
          },
          "debateSectionId": "dbsect_1587"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "showAs": "Dessie Ellis",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09"
        },
        "showAs": " 1053. Deputy Dessie Ellis asked the Minister for Education and Youth if alternative school places have been sought for children who were offered autism class placements at a school (details supplied) and now have been left with no school place for September; and if she will make a statement on the matter. [41431/25] ",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_891.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_891",
          "showAs": "Special Educational Needs",
          "debateSectionId": "dbsect_891"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_1053",
        "answerText": " Minister of State at the Department of Education and Youth  I propose to take Questions Nos. 1053 and 1081 together.  This government is fully committed to supporting children with special educational needs to fulfil their full potential and the Programme for Government makes a number of commitments to deliver on this objective.  Reconfiguration works to provide two special education classrooms, and two mainstream classrooms is in delivery for the school referred to by the Deputy.  The use of the parish hall is part of this brief.  A full statutory application for change of use was required to facilitate the use of the parish hall as part of the project. A decision to grant planning permission for change of use of the Parish Hall was received in mid-June. I can confirm that works have now commenced on the Parish Hall with a tentative projected timeline for completion of works by the end of Q3 or early in Q4.  The department is working to ensure the expedited delivery of all required accommodation solutions for special classes, and it is expected that the required accommodation will be in place for the start of the school year in the vast majority of cases.  Where this is not the case, the NCSE and department will support the school to put appropriate contingency arrangements in place to ensure that these classes can open while permanent accommodation is being provided. ",
        "questionNumber": 1053
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "showAs": "Dessie Ellis",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09"
        },
        "showAs": " 1059. Deputy Dessie Ellis asked the Minister for Education and Youth the number of children currently still without a school place for September; the number of children waiting for autism classes with no other school placement; the number of children waiting for a place in a special education school; the number of children who have been offered places but there is no building ready; the number of children in mainstream school with a diagnosis in an inappropriate setting; and if she will make a statement on the matter. [41450/25] ",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_897.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_897",
          "showAs": "School Enrolments",
          "debateSectionId": "dbsect_897"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_1059",
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is the national agency with responsibility for the provision of special education places. This year the NCSE has sanctioned 407 new special classes for the coming school year bringing to 3,742 the number of special classes in our schools. There are new classes in every county in Ireland and with the number of special classes doubling in the last five years, this now means that there are more classes than ever ensuring greater numbers of children can access places in their local school. Furthermore the number of special class places in our schools will exceed demand.  Combined with 300 new special school places this brings to 2,700 the number of new school places for children with special educational needs.  This year, the approach taken was to maximise the use of existing accommodation in schools to ensure new special classes could open as quickly as possible for the 2025/26 school year. The NCSE also prioritised schools which did not have an existing special class. This has ensured that 80% of the new classes sanctioned are in schools with available accommodation.  Where schools require modular accommodation for new special classes, these projects are being fast-tracked by my department to deliver this accommodation as early as possible. In a small number of instances where a delay in new special class accommodation is expected such as where new modular classrooms are being provided, contingency arrangements are being made with the relevant schools with the support of the NCSE.  The NCSE has advised my Department that the vast majority of children seeking a special school or special class place have now been assigned a school place. They are working very closely with the remaining families to ensure that they are being kept updated as the remaining  special class and special school places are being finalised by a small number of schools. ",
        "questionNumber": 1059
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "showAs": "Dessie Ellis",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09"
        },
        "showAs": " 3270. Deputy Dessie Ellis asked the Minister for Health if a drug will be made available to a person (details supplied). [44201/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_2888.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_2888",
          "showAs": "Medicinal Products",
          "debateSectionId": "dbsect_2888"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_3270",
        "answerText": " Minister for Health  As this is a service matter and under the Health (Pricing and Supply of Medical Goods) Act 2013, the HSE has statutory responsibility for decisions on the pricing and reimbursement of medicines and medical devices, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 3270
      },
      "contextDate": "2025-07-29"
    },
    {
      "contextDate": "2025-07-03",
      "question": {
        "questionNumber": 208,
        "answerText": " Minister of State at the Department of Education and Youth  This government is fully committed to supporting children with special educational needs to fulfil their full potential and the Programme for Government makes a number of commitments to deliver on this objective.  The National Council for Special Education (NCSE) has responsibility for coordinating and advising on the education provision for children with special educational needs, including the allocation of special needs assistants (SNAs). The NCSE has advised my department that all schools have been informed of their SNA allocation for the 2025/26 school year.  As the NCSE is responsible for the allocation of SNAs to schools, I have forwarded the school's details to them for their attention and direct reply.  Deputies are also welcome to raise such matters with the NCSE directly through their dedicated Oireachtas query line at oireachtasqueries@ncse.ie.  It is open to any school which feels like it has insufficient SNA support to meet the needs of its students to submit to the NCSE a request seeking a review of its allocation. Detailed information on the NCSE's SNA review process is published on the NCSE's website.  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "house": {
          "houseNo": "34",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail"
        },
        "date": "2025-07-03",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "showAs": " 208. Deputy Dessie Ellis asked the Minister for Education and Youth if she will ensure a child (details supplied) is allocated an SNA as recommended by separate assessments; and if she will make a statement on the matter. [36713/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-03/pq_208",
        "debateSection": {
          "debateSectionId": "dbsect_225",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-03/writtens/dbsect_225",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-03/writtens/mul@/dbsect_225.xml"
            }
          },
          "showAs": "Special Educational Needs"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "showAs": "Dessie Ellis",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2025-05-13",
      "question": {
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-13/writtens/mul@/dbsect_599.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-13/writtens/dbsect_599",
          "showAs": "Schools Building Projects",
          "debateSectionId": "dbsect_599"
        },
        "questionType": "written",
        "questionNumber": 844,
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Justice",
          "roleType": null
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09",
          "showAs": "Dessie Ellis",
          "memberCode": "Dessie-Ellis.D.2011-03-09"
        },
        "showAs": " 844. Deputy Dessie Ellis asked the Minister for Justice to provide an update on the proposed building for a school (details supplied), which has not progressed since the sod was turned in March 2023; and if he will make a statement on the matter. [23214/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-05-13/pq_844",
        "answerText": " Minister for Justice  At the outset, it is important to note that, as Minister, I do not comment on individual Immigrant Investor Programme (IIP) applications.  Since the closure of the programme, the IIP Unit has continued to process and submit applications to the Evaluation Committee for consideration and recommendation. At present, there are approximately 100 Immigrant Investor Programme project proposals undergoing, or awaiting, such consideration.  My Department’s IIP Unit is committed to ensuring that all applications will be examined on their own merits and will endeavour to conclude all decisions in a timely manner.  The IIP Unit of my Department communicates with projects seeking to benefit from investments made in connection with an IIP application in relation to how the terms of the programme apply to their particular project. The Unit also engages with projects and monitors them for their compliance with the IIP requirements.  I can advise you that further details concerning the processing of outstanding IIP applications is published on the Immigration Service Delivery website of my Department, including an FAQ document. Both can be accessed at the following link: www.irishimmigration.ie/processing-of-iip-applications-on-hand-following-the-closure-of-the-programme. ",
        "date": "2025-05-13"
      }
    },
    {
      "question": {
        "house": {
          "houseNo": "34",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil"
        },
        "by": {
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09",
          "showAs": "Dessie Ellis"
        },
        "questionNumber": 2424,
        "showAs": " 2424. Deputy Dessie Ellis asked the Minister for Health the number waiting for a BreastCheck through the HSE’s national screening service for each CHO; the average wait time for BreastCheck for each CHO; and if she will make a statement on the matter. [20808/25] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-04-29/pq_2424",
        "debateSection": {
          "debateSectionId": "dbsect_2135",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-29/writtens/dbsect_2135",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-29/writtens/mul@/dbsect_2135.xml"
            },
            "pdf": null
          },
          "showAs": "Cancer Services"
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "date": "2025-04-29"
      },
      "contextDate": "2025-04-29"
    },
    {
      "contextDate": "2025-02-25",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-25/writtens/mul@/dbsect_602.xml"
            }
          },
          "debateSectionId": "dbsect_602",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-25/writtens/dbsect_602",
          "showAs": "Disability Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-25/pq_737",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 737,
        "showAs": " 737. Deputy Dessie Ellis asked the Minister for Children, Equality, Disability, Integration and Youth the length of the waiting list is for a child to see a children’s disability network team for a child resident in Finglas, Ballymun, Whitehall and Beaumont; and when a child (details supplied) will be seen by the CDNT; and if she will make a statement on the matter. [7176/25] ",
        "answerText": " Minister of State at the Department of Children, Equality, Disability, Integration and Youth  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail"
        },
        "date": "2025-02-25",
        "by": {
          "showAs": "Dessie Ellis",
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2025-02-18",
      "question": {
        "by": {
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09",
          "showAs": "Dessie Ellis"
        },
        "date": "2025-02-18",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-18/pq_691",
        "answerText": " Minister of State at the Department of Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 691. Deputy Dessie Ellis asked the Minister for Health regarding a building project (details supplied) the initial projected cost of this centres new entrance; the reason some construction work that was completed, relating to a wall that was built at the centre, was subsequently demolished; if there has been any further request for additional funding for this project; if so, the amount of additional money requested; when he expects this project to be completed; and if she will make a statement on the matter. [5522/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_573",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-18/writtens/mul@/dbsect_573.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-18/writtens/dbsect_573",
          "showAs": "Primary Care Centres"
        },
        "questionNumber": 691,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 922,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_922",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_875",
          "showAs": "Health Service Executive",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_875",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_875.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister of State at the Department of Children, Equality, Disability, Integration and Youth  In Budget 2025, €27m has been allocated for HSE capital projects to support and deliver disabilities services. This represents a €4m increase on 2023 and is due to grow to €29.2m in 2026.  The HSE Capital Plan 2024, together with the National Service Plan 2024, was approved on 14th February 2024. This Capital Plan aims to reflect the priorities within the National Development Plan. It also reflects the priorities set out in the Action Plan for Disability Services 2024-2026, which was published in December 2023. The HSE is currently preparing the Capital Plan for 2025, based on the allocations provided in Budget 2025, and will submit that to the Department shortly for approval.  It is important to note that while the Ministers are responsible for approving the overall Capital Plan, the HSE is responsible for allocating funding to individual projects in alignment with strategic priorities. Funding decisions are made within the structured guidelines of the HSE’s Capital Projects Manual framework, ensuring that the process remains transparent and aligned with national priorities.  As funding individual projects falls within the operational remit of the HSE, I have asked them to respond to the Deputy directly with regard to the status of this specific project. ",
        "showAs": " 922. Deputy Dessie Ellis asked the Minister for Children, Equality, Disability, Integration and Youth if there has been any funding allocated in the HSE’s Capital Plan for 2025 to build a facility to provide for the additional services to be provided by an organisation (details supplied); and if he will make a statement on the matter. [44453/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Dessie Ellis",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09",
          "memberCode": "Dessie-Ellis.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2024-10-24",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-24/writtens/mul@/dbsect_130.xml"
            }
          },
          "debateSectionId": "dbsect_130",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-24/writtens/dbsect_130",
          "showAs": "Road Tolls"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-24/pq_101",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 101,
        "showAs": " 101. Deputy Dessie Ellis asked the Minister for Transport if he could exempt public service vehicles, such as taxis, from the peak-time toll prices (€12.50) at the Dublin Port Tunnel, as this incurs a substantial extra cost to a taxi fare which is passed onto the clients (details supplied); and if he will make a statement on the matter. [43607/24] ",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and funding in relation to the national roads programme. Under the Roads Acts 1993-2015, the operation and management of individual national roads , including tolls, is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned.  Therefore, matters relating to the day to day operations regarding national roads, including toll roads are within the remit of TII. More specifically, the statutory power to levy tolls, to make toll bye-laws and to enter into agreements with private investors are vested in TII under Part V of the Roads Act 1993 (as amended). The setting of tolls is a statutory function of TII.  With regard to the payment mechanism associated with toll operations, it is a contractual obligation which may incorporate a traffic guarantee mechanism. Therefore, the contracts for the privately-operated toll schemes are commercial agreements between TII and the Public Private Partnership (PPP) concessionaires concerned.  In relation to the Dublin Tunnel specifically, it is important to point out the tolling arrangements also serve an important demand management function, to ensure that non-HGV traffic does not impede the transit of heavy goods vehicles to Dublin Port.  Noting the above position, I have referred the question to TII for a direct reply. Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-10-24",
        "by": {
          "showAs": "Dessie Ellis",
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2024-10-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-08/writtens/mul@/dbsect_524.xml"
            }
          },
          "debateSectionId": "dbsect_524",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-08/writtens/dbsect_524",
          "showAs": "Suicide Prevention"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-08/pq_520",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 520,
        "showAs": " 520. Deputy Dessie Ellis asked the Minister for Health if the HSE provides any funding to a local service (details supplied) currently or has provided funding at any time in the past; if not, if the HSE be willing to enter into a service level agreement with the service to provide funding towards a manager and to assist in the day-to-day running of this vital local service; and if he will make a statement on the matter. [39735/24] ",
        "answerText": " Minister of State at the Department of Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-10-08",
        "by": {
          "showAs": "Dessie Ellis",
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2024-10-01",
      "question": {
        "by": {
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09",
          "showAs": "Dessie Ellis"
        },
        "date": "2024-10-01",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-01/pq_440",
        "answerText": " Minister for Health  As this is a service matter, it has been referred to the Health Service Executive for attention and direct reply to the Deputy. ",
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 440. Deputy Dessie Ellis asked the Minister for Health if there are plans for a primary health care centre for Santry, Whitehall, and Beaumont, Dublin, given the significant growth in population in these areas; and if he will make a statement on the matter. [38539/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_455",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-01/writtens/mul@/dbsect_455.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-01/writtens/dbsect_455",
          "showAs": "Primary Care Centres"
        },
        "questionNumber": 440,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_1184.xml"
            }
          },
          "debateSectionId": "dbsect_1184",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_1184",
          "showAs": "Social Welfare Benefits"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_1342",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1342,
        "showAs": " 1342. Deputy Dessie Ellis asked the Minister for Social Protection the status of an application for domiciliary care allowance for the mother of a young child (details supplied) who has a range of long-term conditions, who has significant delays in motor skills and who is being assessed for epilepsy; and if she will make a statement on the matter. [32594/24] ",
        "answerText": " Minister for Social Protection  Domiciliary Care Allowance is payable in respect of a child aged under 16 who has a severe disability requiring continual or continuous care and attention substantially over and above the level of care and attention normally required by a child of the same age and where the level of the child's disability is such that the child is likely to require this level of care and attention for at least 12 consecutive months.  Eligibility for Domiciliary Care Allowance (DCA) is not based entirely on the child's disability but essentially on the impact of the disability / diagnosis, in terms of the associated level of care and attention required by the relevant child, compared to the age appropriate level. For the purpose of DCA, it must be established in the decision and assessment process, that the level of care and attention required by the child meets the threshold outlined in legislation for eligibility for DCA, that is continual or continuous care and attention substantially in excess of that normally required by a child of a similar age, who does not have such a disability /diagnosis.  I can confirm that an application for DCA in respect of their child was received by my Department from the person concerned on 1 December 2023.  A Deciding Officer disallowed their application as per decision dated 24 January 2024. Based on the information provided, the child concerned was not considered to satisfy the conditions for DCA. This determination also considered the supporting documentary (medical) evidence that was provided by the applicant in their application. The Deciding Officer had regard to the professional opinion of a departmental Medical Assessor (MA) in the decision process and a copy of that medical opinion was issued to the applicant for information, along with the above original decision notification.  The person concerned requested a review of the above decision. Following a review of their application in respect of their child, including the new information / documentary evidence provided by the applicant in support of their review request, a Deciding Officer decided not to revise the above decision, as per review decision dated 23 February 2024 and the person concerned was notified of that further decision in writing.  The person concerned appealed the Department's decision to the Social Welfare Appeals Office (SWAO) and their file was submitted to that office on 17 May 2024 for determination by an Appeals Officer. The SWAO will notify the applicant directly of the appeal outcome in due course.  I hope this clarifies the position for the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Dessie Ellis",
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2024-01-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-30/writtens/mul@/dbsect_485.xml"
            }
          },
          "debateSectionId": "dbsect_485",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-30/writtens/dbsect_485",
          "showAs": "Hospital Appointments Status"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-01-30/pq_558",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 558,
        "showAs": " 558. Deputy Dessie Ellis asked the Minister for Health the number of outpatient hospital cancellations and the procedures cancelled from 2022 to date for the National Orthopaedic Hospital Cappagh, in tabular form. [4162/24] ",
        "answerText": " Minister for Health  As this Parliamentary Question relates to an operational issue, it is a matter for the HSE. However, members of the Oireachtas are advised that the HSE is currently not in a position to answer PQs due to industrial action. It is hoped that normal services will resume soon. In the meantime, this Department will continue to refer PQs to HSE for their direct reply as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-01-30",
        "by": {
          "showAs": "Dessie Ellis",
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2024-01-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-30/writtens/mul@/dbsect_486.xml"
            }
          },
          "debateSectionId": "dbsect_486",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-30/writtens/dbsect_486",
          "showAs": "Hospital Waiting Lists"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-01-30/pq_559",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 559,
        "showAs": " 559. Deputy Dessie Ellis asked the Minister for Health the waiting times for each hospital department from 2022 to date for the National Orthopaedic Hospital Cappagh, in tabular form. [4163/24] ",
        "answerText": " Minister for Health  In relation to the particular query raised, as this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible.  As the Deputy may be aware, management and administrative grade staff in the Fórsa union in the HSE commenced industrial action on Friday 6th October 2023. As a consequence of this industrial action, members in these grades are not engaging with political forums or processes. As a result, the question asked by the Deputy may be delayed in receiving a response directly from the HSE. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-01-30",
        "by": {
          "showAs": "Dessie Ellis",
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2024-01-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-30/writtens/mul@/dbsect_487.xml"
            }
          },
          "debateSectionId": "dbsect_487",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-30/writtens/dbsect_487",
          "showAs": "Hospital Waiting Lists"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-01-30/pq_560",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 560,
        "showAs": " 560. Deputy Dessie Ellis asked the Minister for Health the number of outpatient appointments before cancellations at the National Orthopaedic Hospital Cappagh, in tabular form. [4164/24] ",
        "answerText": " Minister for Health  In relation to the particular query raised, as this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible.  As the Deputy may be aware, management and administrative grade staff in the Fórsa union in the HSE commenced industrial action on Friday 6th October 2023. As a consequence of this industrial action, members in these grades are not engaging with political forums or processes. As a result, the question asked by the Deputy may be delayed in receiving a response directly from the HSE. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-01-30",
        "by": {
          "showAs": "Dessie Ellis",
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2024-01-17",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-17/writtens/mul@/dbsect_805.xml"
            }
          },
          "debateSectionId": "dbsect_805",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-17/writtens/dbsect_805",
          "showAs": "Public Sector Pay"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-01-17/pq_889",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 889,
        "showAs": " 889. Deputy Dessie Ellis asked the Minister for Social Protection if she is aware that apart from some long service incremental increases for long-serving staff in 2017, staff in the Citizens Information Service have not received a wage increase since 2008 (details supplied); her plans to implement this recommended wage increase; the date for the implementation of same; and if she will make a statement on the matter. [56847/23] ",
        "answerText": " Minister for Social Protection  The Citizens Information Board (CIB) is the statutory body under the aegis of the Department of Social Protection, with responsibility for supporting the provision of information, advice (including money and budgeting advice) and advocacy on a wide range of public and social services.  CIB provides some services directly to the public and funds and supports a number of Service Delivery Companies to provide services on its behalf, including eight regional companies of the Citizens Information Service (CIS).  I absolutely recognise and value the essential work carried out by staff of the CIS and their dedication to their role in ensuring that people have access to quality and independent information, advice and advocacy services across the country.  DSP allocates annual Exchequer funding to CIB to deliver its services and the services of its Service Delivery Companies, including the CIS companies.  In July 2023, as part of the Estimates process, CIB submitted a funding request for 2024 to the Department.  This request included additional funding for a 11% pay increase for employees of the CIS and followed a Workplace Relations Commission (WRC) process that directly involved both SIPTU and the CIS Employers Group.  However, neither my Department nor the Department of Public Expenditure and NDP Delivery and Reform (DPENDPR) had any involvement in this pay request or the WRC process that led to it.  It is important that any pay request, which impacts the services under a remit of a Government Department are carefully considered well in advance and have the involvement of all relevant stakeholders including my Department and DPENDPR from early in the process.  I therefore believe that the best way forward is for all relevant stakeholders, including CIB, the employer and staff CIS representatives, my Department and DPENDPR, to engage on this issue. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-01-17",
        "by": {
          "showAs": "Dessie Ellis",
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2023-11-21",
      "question": {
        "date": "2023-11-21",
        "by": {
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09",
          "showAs": "Dessie Ellis"
        },
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-11-21/writtens/mul@/dbsect_185.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-11-21/writtens/dbsect_185",
          "showAs": "School Facilities",
          "debateSectionId": "dbsect_185"
        },
        "showAs": " 221. Deputy Dessie Ellis asked the Minister for Education if a kitchen will be considered for a school (details supplied); and if she will make a statement on the matter. [50535/23] ",
        "questionNumber": 221,
        "questionType": "written",
        "answerText": " Minister for Education  The major building project for the school referred to by the Deputy will be delivered under the Departments ADAPT Programme.  The ADAPT Programme uses a professional external Project Manager to co-ordinate and drive the Design Team to achieve the best possible timeframe for the project through the stages of Architectural Planning to Tender and Construction.  The project is at the initial stage of Architectural Planning, Stage 1 – Preliminary Design, where the Design Team will assess the site and prepare their initial sketch schemes.  A preferred design option based on the Schedule of Accommodation to be provided, including the scope and extent of works to be carried out, will be established during this early stage.  On receipt of the Stage 1 report, the Stage 1 Stakeholders meeting will be arranged, between the School Authorities, Design Team, Project Manager and the Department. Any proposed changes to the brief will be reviewed at the Stage 1 Stakeholders meeting. Following that meeting, my Department will advise all Stakeholders regarding the further progression of the project. ",
        "to": {
          "showAs": "Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-11-21/pq_221"
      }
    },
    {
      "contextDate": "2023-11-21",
      "question": {
        "date": "2023-11-21",
        "by": {
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09",
          "showAs": "Dessie Ellis"
        },
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-11-21/writtens/mul@/dbsect_298.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-11-21/writtens/dbsect_298",
          "showAs": "Citizens Information Services",
          "debateSectionId": "dbsect_298"
        },
        "showAs": " 341. Deputy Dessie Ellis asked the Minister for Social Protection the number of Citizen’s Advice centres in Dublin; the numbers employed in each centre and the grade of each employee; and if she will make a statement on the matter. [50966/23] ",
        "questionNumber": 341,
        "questionType": "written",
        "answerText": " Minister for Social Protection  The Citizens Information Board (CIB) is the statutory body under the aegis of my Department that funds and supports eight regional Citizens Information Service (CIS) companies, which in turn operate the national network of Citizens Information Centres.  Each CIS company is a separate company in its own right, governed by a voluntary Board of Directors.  Decisions regarding the delivery of services and the recruitment and placement of staff are entirely a matter for these Boards and are based on regional needs. Two companies have responsibility for the provision of CIS services in Dublin - North Dublin CIS and Dublin South CIS.  CIB has informed me that there are currently 10 Citizens Information Centres in North Dublin CIS and 9 Citizens Information Centres in Dublin South CIS.  As employees of companies limited by guarantee, CIS staff are not public servants and are therefore not subject to civil service grades, with grades internal to CIS. The breakdown of staff by CIS grade in each Citizens Information Centre in North Dublin CIS and Dublin South CIS is detailed in the tables below.   North Dublin CIS      Centre    Development Manager    Senior Information Officer    Information Officer    Advocacy Support Worker    Admin    Total Employed      Balbriggan*    0    0    1.5    1    0    2.5      Ballymun**                        Blanchardstown    0.5    0    3    0    0.57    4.07      Cabra***                        Dublin City Centre    1    1    5    0    0.5    7.5      Green Street (MACRO)    0.5    0    2.07    0    0    2.57      Finglas    1    0    4    0    0.5    5.5      Malahide    0    0    1    0    0    1      Northside Coolock    1    0    3.5    0    0    4.5      Swords    1    0    1.5    0    0    2.5     *North Dublin Citizens Information Service has 1 Regional Manager and 1 Regional Administrator based in Balbriggan  ** Ballymun CIC, the service is provided by Information Officers from Finglas CIC  *** Cabra CIC, the service is provided by Information Officers from Finglas CIC   Dublin South CIS      Centre    Development Manager    Senior Information Officer    Information Officer    Advocacy Support Worker    Admin    Total Employed      Ballyfermot    0    0    2    0    0    2      Carmelite*                        Clondalkin    1    1    2    0    0.5    4.5      Dublin 12 and 6W    0    0    2    0    0    2      Dun Laoghaire    1    0    2.5    0    0.5    4      Dundrum    0    0    2    0    0    2      Liberties    1    1    4    0    0.5    6.5      Lucan    0    0    1    0    0    1      Tallaght**    1    1    3.4    1    1.2    7.6     * Carmelite CIC, the service is provided by Information Officers from Liberties CIC  **Dublin South Citizens Information Service has 1 Regional Manager and 1 Regional Administrator based in Tallaght. ",
        "to": {
          "showAs": "Social",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-11-21/pq_341"
      }
    },
    {
      "contextDate": "2023-11-14",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-11-14/writtens/mul@/dbsect_470.xml"
            }
          },
          "debateSectionId": "dbsect_470",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-11-14/writtens/dbsect_470",
          "showAs": "Medicinal Products"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-11-14/pq_493",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 493,
        "showAs": " 493. Deputy Dessie Ellis asked the Minister for Health the current status of the atropine 0.01% eye drops, under trial since prior to 2021; to confirm if the trial will be concluded in January 2024, as outlined in a letter to a person (details supplied) from the Head of Pharmacy Function, HSE, as these drops have proven very effective for the daughter of the person; and if he will make a statement on the matter. [49365/23] ",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-11-14",
        "by": {
          "showAs": "Dessie Ellis",
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2023-11-07",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-11-07/writtens/mul@/dbsect_438.xml"
            }
          },
          "debateSectionId": "dbsect_438",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-11-07/writtens/dbsect_438",
          "showAs": "School Accommodation"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-11-07/pq_478",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 478,
        "showAs": " 478. Deputy Dessie Ellis asked the Minister for Education whether it is the intention to continue with the refurbishment of a school (details supplied), with a view to modernising the school or if it is her Department's intention to build alongside the old school a new school to replace it; if she will clarify what her Department's plans for this school are; and if she will make a statement on the matter. [47704/23] ",
        "answerText": " Minister for Education  The major building project for the school referred to by the Deputy will be delivered under the Departments ADAPT Programme.  The ADAPT Programme uses a professional external Project Manager to co-ordinate and drive the Design Team to achieve the best possible timeframe for the project through the stages of Architectural Planning to Tender and Construction.  The Brief for this project is the development of a 16 Classroom Gaelscoil with an additional 2 Classrooms for pupils with Special Educational Needs at the current site.  The tender competition to appoint the Design Team for this major project (Consultant Architect, Civil Structural Engineer, Building Services Engineer, Quantity Surveyor and PSDP) has concluded.  A workshop meeting between the Project Manager, Design Team and Department officials was held recently.  The Design Team are now commencing the initial stage of Architectural Planning, Stage 1 – Preliminary Design, where the Design Team will assess the site and prepare their initial sketch schemes.  A preferred design option, including the scope and extent of works to be carried out will be established during this early stage.  On conclusion of this process my Department will keep the school authorities informed. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-11-07",
        "by": {
          "showAs": "Dessie Ellis",
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2023-10-10",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-10-10/writtens/mul@/dbsect_547.xml"
            }
          },
          "debateSectionId": "dbsect_547",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-10-10/writtens/dbsect_547",
          "showAs": "Health Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-10-10/pq_561",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 561,
        "showAs": " 561. Deputy Dessie Ellis asked the Minister for Health if there are plans to address the fact that there are no chiropodists currently available under the public health system in Finglas (details supplied); his plans to address the matter; the actions that have been taken to provide this type of care in the Finglas area; and if he will make a statement on the matter. [44026/23] ",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-10-10",
        "by": {
          "showAs": "Dessie Ellis",
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2023-09-26",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-09-26/writtens/mul@/dbsect_103.xml"
            }
          },
          "debateSectionId": "dbsect_103",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-09-26/writtens/dbsect_103",
          "showAs": "Driver Test"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-09-26/pq_126",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 126,
        "showAs": " 126. Deputy Dessie Ellis asked the Minister for Transport the average wait times for driving tests in eight testing centres (details supplied); and if he will make a statement on the matter. [40959/23] ",
        "answerText": " Minister of State at the Department of Transport  Under the Road Safety Authority Act 2006, the Road Safety Authority (RSA) has statutory responsibility for the National Driving Test service. Consequently, the detailed information for each test centre requested is held by them.  I have referred the Question to the Authority for direct reply. I would ask the Deputy to contact my office if a response is not received within 10 days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-09-26",
        "by": {
          "showAs": "Dessie Ellis",
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09"
        }
      }
    },
    {
      "contextDate": "2023-09-26",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-09-26/writtens/mul@/dbsect_226.xml"
            }
          },
          "debateSectionId": "dbsect_226",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-09-26/writtens/dbsect_226",
          "showAs": "Qualifications Recognition"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-09-26/pq_258",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 258,
        "showAs": " 258. Deputy Dessie Ellis asked the Minister for Education the reason for the delay in issuing teacher registration numbers across the State (details supplied); and if she will make a statement on the matter. [41259/23] ",
        "answerText": " Minister for Education  The Teaching Council is the competent authority for the recognition of qualifications for those who qualified as teachers outside of Ireland. The Teaching Council adheres to the Teaching Council Act 2001-2015, the Teaching Council Registration Regulations (2016) and in its role as a competent authority, it operates in accordance with the EU Mutual Recognition of Professional Qualifications Directive (2005/36/EU as amended). As a statutory professional standards body, the Teaching Council is required by law to properly determine and to authenticate the relevant standards and qualifications of all applicants for registration. One of the ways the Council ensures and regulates standards is by ensuring that all teachers entering the profession in Ireland have met the required standards.  Fully qualified teachers are eligible to apply for registration with the Teaching Council under the Teaching Council (Registration) Regulations. The Council registers teachers under five Routes of Registration: Route 1 Primary, Route 2 Post-primary, Route 3 Further Education, Route 4 Other and Route 5 Student Teachers.  Teachers who qualify from outside of Ireland applying for registration under the standard pathway to registration must be fully qualified teachers which includes the completion of any period of post-qualification registration requirements in the country they qualified, e.g., teacher induction in England. All applications from teachers who qualify outside of Ireland are processed in line with EU Directive.  In addition, for a time limited period under the Teaching Council (Registration) (Amendment), 2023, the Teaching Council is accepting applications from teachers who have not completed induction in the country they qualified.  The Teaching Council has confirmed that there are no backlogs or delays in the processing of any category of applications, including all applications currently being processed. The published timeframes for the processing of applications are being adhered to. The Teaching Council has all necessary resources in place to ensure the timely registration, renewal of registration and vetting of teachers for the national Register of Teachers. Over the past two years in particular, they have further streamlined and enhanced all registration systems and processes, introducing a new online registration system that has added efficiencies to processes, making it easier for applicants to track applications in real time.The average processing time to successful completion of registration for domestically qualified applicants is is 2.6 weeks.  The Teaching Council receives approximately 600 eligible applications annually from teachers who have qualified outside of the Republic of Ireland. Teachers who qualified outside of Ireland are advised that applications may take up to 12 weeks to process from receipt of all required documentation. This is in line with the EU Directive timeframe which provides for an assessment to be carried out due to the necessity to verify and assess qualifications and credentials obtained in other countries. Processing time commences from the date that applicants submit all documents required to conduct that assessment.  On average the processing time of overseas applications for primary teachers is 3-4 weeks and for post-primary teachers is 8 weeks. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-09-26",
        "by": {
          "showAs": "Dessie Ellis",
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09"
        }
      }
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage (Deputy Kieran O'Donnell)  I propose to take Questions Nos. 449, 653 and 707 together.  My Department provides Exchequer funding to local authorities to support the suite of Housing Adaptation Grants for Older People and People with a Disability which supports older and disabled people living in private houses to adapt their home to meet their needs. The grants are 80% funded by my Department, with a 20% contribution from the resources of the local authority.  The funding available for these grants in 2023 has increased by almost €2 million on the original 2022 provision to a total of €83.125 million which includes an Exchequer funding provision of €66.5 million together with a €16.625 million contribution from local authorities. Increasing funding by 12.5% would cost an additional €8.3125 million to the Exchequer and additional funding of almost €2.08 million to fund the contribution by the local authorities.  Housing for All commits to reviewing the grants scheme and a report on the review has been prepared by my Department. The review was informed by engagement with external stakeholders, including the Department of Health, the HSE, the Disability Federation of Ireland and the Irish Wheelchair Association. Among the areas which the review considered are the income thresholds and the grant limits. On foot of the careful consideration of the Review report, I have asked my Department to engage with the Department of Public Expenditure, NDP Delivery and Reform on the Review report. ",
        "house": {
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "by": {
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "showAs": "Dessie Ellis",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09"
        },
        "questionType": "written",
        "date": "2023-06-13",
        "to": {
          "showAs": "Housing",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "questionNumber": 649,
        "showAs": " 649. Deputy Dessie Ellis asked the Minister for Housing, Local Government and Heritage if there is an intention to increase the housing adaption grant for people with disabilities, which has a maximum grant of €30,000 or 95% of the cost of the works up to the maximum grant amount of €30,000, in view of the increased costs in construction; and if he will make a statement on the matter. [27098/23] ",
        "debateSection": {
          "debateSectionId": "dbsect_575",
          "showAs": "Housing Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-06-13/writtens/dbsect_575",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-06-13/writtens/mul@/dbsect_575.xml"
            }
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-06-13/pq_649"
      },
      "contextDate": "2023-06-13"
    },
    {
      "question": {
        "answerText": " Minister for Justice  I propose to take Questions Nos. 861 and 862 together.  As the Deputy will be aware, under the Garda Síochána Act 2005 (as amended), the Garda Commissioner is responsible for the administration and management of An Garda Síochána, including for the recruitment, training and deployment of Garda members. As Minister, I have no role in such matters.  The Government is committed to building stronger, safer communities and a strengthened, well-resourced Garda Síochána is central to this policy. This commitment is demonstrated by the unprecedented provision of over €2.14 billion to the Garda Vote this year, which is allowing for sustained and ongoing recruitment and investment in new equipment and new vehicles.  This level of funding provides for a steady pipeline of new Gardaí in the coming years, supporting the recruitment of up to 1,000 Gardaí and 400 additional Garda staff this year, with new recruits to enter the Garda College approximately every 11 weeks.  I am assured that the Commissioner keeps the allocation of these resources under continued review, in line with crime and population trends, to ensure their optimum use.  As the Deputy is aware both Ballymun and Santry Garda stations are located within the DMR North Division. I am informed by the Garda authorities that, as of the end of April 2023, a total of 759 Garda members and 69 Garda staff were assigned to DMR North Division. This represents respective increases of 14% and 57% since end December 2015.  This increase in Garda staff numbers means that as well as new Gardaí assigned to the Division, additional Gardaí can be redeployed from administrative to operational policing duties, where their training and policing expertise can be used to best effect.  Coupled with further reassignments of Gardaí to operational front-line policing and the continued roll out of the new Operating Model with its core focus on community policing, I am confident that the Commissioner has suitable resources and plans in place to continue to deliver on An Garda Síochána's mission of keeping people safe.  I am further advised that as of the same date there were 130 Garda members assigned to Ballymun Garda Station, which represents an increase of 5% since the end of December 2015, and 82 Garda members assigned to Santry Garda station. This is consistent with the numbers assigned to Santry Garda station at the end of December 2015.  I understand that it is a matter for the Divisional Chief Superintendent to determine the optimum distribution of duties among the personnel available to them, having regard to the profile of each area within the Division and its specific needs.  For the Deputy's information, the attached table which was provided to me by An Garda Síochána sets out the number of Gardaí assigned to the DMR North Division at the end of April 2023, the latest date for which figures are available, by District and Station.  In the interest of transparency, detailed statistics on Garda workforce numbers are published on gov.ie and are updated regularly by my Department from information provided by An Garda Síochána. The statistics can be accessed using the following link:  www.gov.ie/en/publication/bd777-an-garda-siochana-your-police-service-some-facts-and-figures/.  GARDA STATISTICS MONTH ENDING 30 April 2023     Division    District    Station    GD    SG    IN    SU    CS    AC    Total      D.M.R. NORTH    BALBRIGGAN    BALBRIGGAN    79    8    4    1          92            GARRISTOWN    2                   2            LUSK    12    1                13            RUSH    7    1                8            SKERRIES    10    2                12            TOTAL    110    12    4    1          127         BALLYMUN    BALLYMUN    103    20    4    2    1       130            DUBLIN AIRPORT    40    5    1             46            SANTRY    66    13    3             82            TOTAL    209    38    8    2    1       258         COOLOCK    COOLOCK    104    13    3    1          121            MALAHIDE    23    2    1             26            SWORDS    69    7    1             77            TOTAL    196    22    5    1          224         RAHENY    CLONTARF    54    9    1             64            HOWTH    22    4    1             27            RAHENY    48    6    3    2          59            TOTAL    124    19    5    2          150      D.M.R. NORTH  Total          639    91    22    6    1       759    ",
        "house": {
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "by": {
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "showAs": "Dessie Ellis",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09"
        },
        "questionType": "written",
        "date": "2023-06-13",
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "questionNumber": 861,
        "showAs": " 861. Deputy Dessie Ellis asked the Minister for Justice the number of gardaí assigned to work in Ballymun Garda station. [27317/23] ",
        "debateSection": {
          "debateSectionId": "dbsect_745",
          "showAs": "An Garda Síochána",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-06-13/writtens/dbsect_745",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-06-13/writtens/mul@/dbsect_745.xml"
            }
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-06-13/pq_861"
      },
      "contextDate": "2023-06-13"
    },
    {
      "question": {
        "answerText": " Minister for Justice  I propose to take Questions Nos. 861 and 862 together.  As the Deputy will be aware, under the Garda Síochána Act 2005 (as amended), the Garda Commissioner is responsible for the administration and management of An Garda Síochána, including for the recruitment, training and deployment of Garda members. As Minister, I have no role in such matters.  The Government is committed to building stronger, safer communities and a strengthened, well-resourced Garda Síochána is central to this policy. This commitment is demonstrated by the unprecedented provision of over €2.14 billion to the Garda Vote this year, which is allowing for sustained and ongoing recruitment and investment in new equipment and new vehicles.  This level of funding provides for a steady pipeline of new Gardaí in the coming years, supporting the recruitment of up to 1,000 Gardaí and 400 additional Garda staff this year, with new recruits to enter the Garda College approximately every 11 weeks.  I am assured that the Commissioner keeps the allocation of these resources under continued review, in line with crime and population trends, to ensure their optimum use.  As the Deputy is aware both Ballymun and Santry Garda stations are located within the DMR North Division. I am informed by the Garda authorities that, as of the end of April 2023, a total of 759 Garda members and 69 Garda staff were assigned to DMR North Division. This represents respective increases of 14% and 57% since end December 2015.  This increase in Garda staff numbers means that as well as new Gardaí assigned to the Division, additional Gardaí can be redeployed from administrative to operational policing duties, where their training and policing expertise can be used to best effect.  Coupled with further reassignments of Gardaí to operational front-line policing and the continued roll out of the new Operating Model with its core focus on community policing, I am confident that the Commissioner has suitable resources and plans in place to continue to deliver on An Garda Síochána's mission of keeping people safe.  I am further advised that as of the same date there were 130 Garda members assigned to Ballymun Garda Station, which represents an increase of 5% since the end of December 2015, and 82 Garda members assigned to Santry Garda station. This is consistent with the numbers assigned to Santry Garda station at the end of December 2015.  I understand that it is a matter for the Divisional Chief Superintendent to determine the optimum distribution of duties among the personnel available to them, having regard to the profile of each area within the Division and its specific needs.  For the Deputy's information, the attached table which was provided to me by An Garda Síochána sets out the number of Gardaí assigned to the DMR North Division at the end of April 2023, the latest date for which figures are available, by District and Station.  In the interest of transparency, detailed statistics on Garda workforce numbers are published on gov.ie and are updated regularly by my Department from information provided by An Garda Síochána. The statistics can be accessed using the following link:  www.gov.ie/en/publication/bd777-an-garda-siochana-your-police-service-some-facts-and-figures/.  GARDA STATISTICS MONTH ENDING 30 April 2023     Division    District    Station    GD    SG    IN    SU    CS    AC    Total      D.M.R. NORTH    BALBRIGGAN    BALBRIGGAN    79    8    4    1          92            GARRISTOWN    2                   2            LUSK    12    1                13            RUSH    7    1                8            SKERRIES    10    2                12            TOTAL    110    12    4    1          127         BALLYMUN    BALLYMUN    103    20    4    2    1       130            DUBLIN AIRPORT    40    5    1             46            SANTRY    66    13    3             82            TOTAL    209    38    8    2    1       258         COOLOCK    COOLOCK    104    13    3    1          121            MALAHIDE    23    2    1             26            SWORDS    69    7    1             77            TOTAL    196    22    5    1          224         RAHENY    CLONTARF    54    9    1             64            HOWTH    22    4    1             27            RAHENY    48    6    3    2          59            TOTAL    124    19    5    2          150      D.M.R. NORTH  Total          639    91    22    6    1       759    ",
        "house": {
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "by": {
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "showAs": "Dessie Ellis",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09"
        },
        "questionType": "written",
        "date": "2023-06-13",
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "questionNumber": 862,
        "showAs": " 862. Deputy Dessie Ellis asked the Minister for Justice the number of Garda personnel assigned to the Santry-Whitehall area, given the closure of Whitehall Garda station. [27318/23] ",
        "debateSection": {
          "debateSectionId": "dbsect_745",
          "showAs": "An Garda Síochána",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-06-13/writtens/dbsect_745",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-06-13/writtens/mul@/dbsect_745.xml"
            }
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-06-13/pq_862"
      },
      "contextDate": "2023-06-13"
    },
    {
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-04-20/writtens/mul@/dbsect_256.xml"
            }
          },
          "showAs": "Housing Provision",
          "debateSectionId": "dbsect_256",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-04-20/writtens/dbsect_256"
        },
        "showAs": " 249. Deputy Dessie Ellis asked the Minister for Housing, Local Government and Heritage the number of affordable housing units delivered via the cost rental equity loan, the affordable housing fund and project Tosaigh in Dublin north west in each of the years, 2016 to 2022; and planned number to be delivered in 2023 with a breakdown of units per scheme and average price of units by unit size, in tabular form; and if he will make a statement on the matter. [18685/23] ",
        "answerText": "",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-04-20/pq_249",
        "date": "2023-04-20",
        "questionNumber": 249,
        "house": {
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33"
        },
        "by": {
          "showAs": "Dessie Ellis",
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09"
        },
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "roleType": null,
          "uri": null
        },
        "questionType": "written"
      },
      "contextDate": "2023-04-20"
    },
    {
      "contextDate": "2023-04-18",
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding for public transport.  The National Transport Authority (NTA) has statutory responsibility for developing an accessible, integrated and sustainable public transport network.  In light of the NTA's responsibilities for progressively making public transport accessible, including providing grants for wheelchair accessible taxi and hackney vehicles, I have forwarded your question to the NTA for direct reply to you. Please advise my private office if you do not receive a response within ten working days. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-04-18/pq_286",
        "questionNumber": 286,
        "showAs": " 286. Deputy Dessie Ellis asked the Minister for Transport the number of people whose application for grant funding on the wheelchair accessible vehicles scheme has been successful and are awaiting payment of the grant; additionally, the average time it takes for the grant to be paid out to those whose application for grant funding has been successful; and if he will make a statement on the matter. [17046/23] ",
        "questionType": "written",
        "date": "2023-04-18",
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-04-18/writtens/mul@/dbsect_250.xml"
            }
          },
          "showAs": "Departmental Schemes",
          "debateSectionId": "dbsect_250",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-04-18/writtens/dbsect_250"
        },
        "by": {
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "showAs": "Dessie Ellis",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09"
        },
        "to": {
          "showAs": "Transport",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "house": {
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "houseNo": "33",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        }
      }
    },
    {
      "contextDate": "2023-04-18",
      "question": {
        "answerText": " Minister for Justice  I propose to take Questions Nos. 962 and 973 together.  As the Deputy will be aware, under the Garda Síochána Act 2005 (as amended), the Garda Commissioner is responsible for the administration and management of An Garda Síochána, including responsibility for the Garda vetting system.  Additionally, the National Vetting Bureau Act 2012 makes it the responsibility of the Chief Bureau Officer of the Garda National Vetting Bureau (GNVB), to establish and maintain the database of the Bureau. As Minister, I have no role in such matters.  However, I am advised by An Garda Síochána that there are no backlogs or delays in Garda vetting. In 2022, the Garda National Vetting Bureau (GNVB) received over 549,000 applications, the highest-ever number.  I am further advised that from 1 January 2023 to date, the GNVB has received 154,445 vetting applications. This is a marked increase on the 145,768 applications received in the same period in 2022, with the Bureau working seven days per week in an effort to process the unprecedented numbers of applications.  The Bureau cannot advise the average length of time it took to process an individual application. Nonetheless, the average turnaround time for vetting applications where there is no need to take any further action or make any further enquiries has, since the start of 2023, been seven working days. Therefore, applications are processed within the target turnaround time.  I am also informed that the turnaround time for standard vetting of hosts for Ukrainian families and aviation vetting continues to be one working day.  The Bureau advise that, in a number of instances, it is necessary for them to conduct enquiries for a multiplicity of reasons within An Garda Síochána and with relevant stakeholders. Therefore, processing times for such applications are significantly longer than the general average.  The Bureau has communicated with all relevant stakeholders to advise them of the current turnaround times and to assure them that they continue to process vetting applications as expeditiously as possible.  I can advise the Deputy that the Garda Vetting Review Group was established in April 2021 and meets regularly to discuss potential amendments to vetting legislation. This group includes members of the GNVB in An Garda Síochána, officials from my Department, from Tusla, and from other relevant stakeholders.  The primary focus of the Group is strengthening the vetting legislation in an effective manner, including any changes that may be possible in relation to multi-purpose vetting or re-vetting.  As per action 10 in Justice Plan 2023, which is available on the Department’s website, I expect to receive the Group’s report by the end of Q2. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-04-18/pq_973",
        "questionNumber": 973,
        "showAs": " 973. Deputy Dessie Ellis asked the Minister for Justice the number of applications for Garda vetting received from January 2022 to date by the Garda National Vetting Bureau; the average length of time it took to process an individual application; and if he will make a statement on the matter. [17246/23] ",
        "questionType": "written",
        "date": "2023-04-18",
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-04-18/writtens/mul@/dbsect_846.xml"
            }
          },
          "showAs": "An Garda Síochána",
          "debateSectionId": "dbsect_846",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-04-18/writtens/dbsect_846"
        },
        "by": {
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "showAs": "Dessie Ellis",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09"
        },
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "house": {
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "houseNo": "33",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        }
      }
    },
    {
      "contextDate": "2023-02-16",
      "question": {
        "debateSection": {
          "showAs": "Covid-19 Pandemic",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-02-16/writtens/mul@/dbsect_253.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_253",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-02-16/writtens/dbsect_253"
        },
        "house": {
          "houseCode": "dail",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "by": {
          "showAs": "Dessie Ellis",
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09"
        },
        "date": "2023-02-16",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-02-16/pq_235",
        "answerText": " Minister for Housing, Local Government and Heritage  I refer to my reply to Questions Nos. 317 and 325 of 31 January 2023 which sets out the position on this matter. ",
        "questionNumber": 235,
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Housing",
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 235. Deputy Dessie Ellis asked the Minister for Housing, Local Government and Heritage if he is aware that approximately 130 members of staff from the Dublin Fire Brigade have yet to be paid the pandemic special recognition payment; the qualifying criteria for this payment to members of the Dublin Fire Brigade; if any members of the service have been excluded from this payment; the reason they have been excluded and not deemed to fit the criteria for the payment; and if he will make a statement on the matter. [7845/23] "
      }
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 171,
        "showAs": " 171. Deputy Dessie Ellis asked the Minister for Health the number of persons who died from Covid and the flu, respectively in 2022, in tabular form; and if he will make a statement on the matter. [3466/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-25/pq_171",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09",
          "showAs": "Dessie Ellis",
          "memberCode": "Dessie-Ellis.D.2011-03-09"
        },
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Health  This PQ relates to operational matters and has been referred to the HSE for direct reply. ",
        "debateSection": {
          "debateSectionId": "dbsect_173",
          "showAs": "Infectious Diseases",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-25/writtens/mul@/dbsect_173.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-25/writtens/dbsect_173"
        },
        "date": "2023-01-25",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-25"
    },
    {
      "question": {
        "questionType": "written",
        "questionNumber": 172,
        "showAs": " 172. Deputy Dessie Ellis asked the Minister for Health the number of persons who died from Covid and the flu, respectively in each of the years 2014 to 2019, in tabular form; and if he will make a statement on the matter. [3467/23] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-01-25/pq_172",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09",
          "showAs": "Dessie Ellis",
          "memberCode": "Dessie-Ellis.D.2011-03-09"
        },
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "answerText": " Minister for Health  This PQ relates to operational matters and has been referred to the HSE for direct reply. ",
        "debateSection": {
          "debateSectionId": "dbsect_174",
          "showAs": "Infectious Diseases",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-25/writtens/mul@/dbsect_174.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-01-25/writtens/dbsect_174"
        },
        "date": "2023-01-25",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail"
        }
      },
      "contextDate": "2023-01-25"
    },
    {
      "contextDate": "2022-12-13",
      "question": {
        "showAs": " 70. Deputy Dessie Ellis asked the Tánaiste and Minister for Enterprise, Trade and Employment his views on the pay and conditions of electricians and apprentice electricians working in the State; and if he will make a statement on the matter. [62108/22] ",
        "date": "2022-12-13",
        "questionNumber": 70,
        "answerText": " Minister of State at the Department of Enterprise, Trade and Employment  In 2021 the Labour Court prepared a proposal for a Sectoral Employment Order for the employees and apprentices in the electrical contracting sector. Sectoral Employment Orders (SEOs) are legally binding orders and require employers in the specific sector to provide staff with minimum rates of pay and pension contributions.  SEOs can be established following a request from a trade union or an employer’s organisation to the Labour Court to review issues such as the pay, pension or sick pay scheme for workers in a particular sector. The Labour Court can then conduct an examination for that sector, and make a recommendation to the Minister for Enterprise, Trade and Employment to establish an SEO for the sector. When the Minister signs an SEO, the Labour Court’s recommendations become legally binding across the sector.  On 1 February 2022, following the recommendation by the Labour Court I signed a Sectoral Employment Order into effect for the electrical contracting sector. This Order set a statutory minimum rate of pay starting from €24.14 per hour for employees and between 35% and 80% of that minimum rate for apprentices.  However, in October 2022 the Order was set aside by the High Court and accordingly there is currently no Sectoral Employment Order for electrical contractors in place. However, it is open for either employers or employee representatives to request that the Labour Court prepare a new proposal for a Sectoral Employment Order.  In general, SEOs provide fair and sustainable rates of remuneration for employees and help create a level playing field for contractors competing in the sectors concerned.   Supplementary Template  ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-12-13/pq_70",
        "by": {
          "showAs": "Dessie Ellis",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09",
          "memberCode": "Dessie-Ellis.D.2011-03-09"
        },
        "debateSection": {
          "debateSectionId": "dbsect_41",
          "showAs": "Wage-setting Mechanisms",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-13/writtens/mul@/dbsect_41.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-12-13/writtens/dbsect_41"
        },
        "to": {
          "showAs": "Enterprise",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-10-18",
      "question": {
        "questionType": "written",
        "answerText": " Minister for Health  As part of Budget 2023, I announced €32.2 million in funding for Women’s Health Initiatives in 2023, to include dedicated funding for Cariban. The dedicated funding for Cariban will help women who experience hyperemesis gravidarum, a severe form of morning sickness, during pregnancy.  The HSE asked the Medicines Management Programme to examine the appropriateness and feasibility of a patient specific arrangement for the product. The HSE Medicines Management Programme assessment for Cariban has now been completed, and their recommendations will be followed in providing access to patients. Cariban will be funded from January 1st 2023 ",
        "to": {
          "roleCode": null,
          "roleType": null,
          "uri": null,
          "showAs": "Health"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-10-18/pq_849",
        "by": {
          "showAs": "Dessie Ellis",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09",
          "memberCode": "Dessie-Ellis.D.2011-03-09"
        },
        "showAs": " 849. Deputy Dessie Ellis asked the Minister for Health if any progress is being made to make the cariban medication free for pregnant women suffering from morning sickness; and if he will make a statement on the matter. [52009/22] ",
        "date": "2022-10-18",
        "house": {
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseNo": "33"
        },
        "debateSection": {
          "showAs": "Medicinal Products",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-18/writtens/mul@/dbsect_731.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_731",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-10-18/writtens/dbsect_731"
        },
        "questionNumber": 849
      }
    },
    {
      "question": {
        "questionNumber": 1565,
        "questionType": "written",
        "date": "2022-07-26",
        "house": {
          "chamberType": "house",
          "houseNo": "33",
          "houseCode": "dail",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "to": {
          "uri": null,
          "showAs": "Justice",
          "roleCode": null,
          "roleType": null
        },
        "debateSection": {
          "debateSectionId": "dbsect_1342",
          "showAs": "Prison Service",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-07-26/writtens/dbsect_1342",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-07-26/writtens/mul@/dbsect_1342.xml"
            }
          }
        },
        "showAs": " 1565. Deputy Dessie Ellis asked the Minister for Justice the number of prisoners considered to be affiliated to organisations (details supplied) who were incarcerated between 1968 and 1998 in Mountjoy Prison, Portlaoise Prison, Limerick Prison and the Curragh Camp; and if she will make a statement on the matter. [40625/22] ",
        "by": {
          "showAs": "Dessie Ellis",
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-07-26/pq_1565",
        "answerText": " Minister for Justice  The information requested by the Deputy is not readily available and to collate it would require the extensive manual examination of paper files and a significant amount of staff time. "
      },
      "contextDate": "2022-07-26"
    },
    {
      "question": {
        "questionNumber": 1566,
        "questionType": "written",
        "date": "2022-07-26",
        "house": {
          "chamberType": "house",
          "houseNo": "33",
          "houseCode": "dail",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "to": {
          "uri": null,
          "showAs": "Justice",
          "roleCode": null,
          "roleType": null
        },
        "debateSection": {
          "debateSectionId": "dbsect_1343",
          "showAs": "Court Sittings",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-07-26/writtens/dbsect_1343",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-07-26/writtens/mul@/dbsect_1343.xml"
            }
          }
        },
        "showAs": " 1566. Deputy Dessie Ellis asked the Minister for Justice the number of cases brought to trial in the Special Criminal Court between 1972 and 1998; the number of those convicted before the Special Criminal Court, by case and year of conviction, in tabular form; and if she will make a statement on the matter. [40626/22] ",
        "by": {
          "showAs": "Dessie Ellis",
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-07-26/pq_1566",
        "answerText": " Minister for Justice  The detailed information sought by the Deputy is not maintained by my Department. However, the Courts Service Annual Reports, which are publically available, provide statistics, including statistics relating to proceedings before the Special Criminal Court.  The Deputy will be aware that the Special Criminal Court is established pursuant to Part V of the Offences Against the State Act 1939. An independent review group has been established to carry out a comprehensive review of all aspects of the Offences Against the State legislation. The final report and recommendations of the group, including any recommendations concerning the operation of the Special Criminal Court, will be given careful consideration when received. "
      },
      "contextDate": "2022-07-26"
    },
    {
      "question": {
        "questionNumber": 695,
        "questionType": "written",
        "date": "2022-07-14",
        "house": {
          "chamberType": "house",
          "houseNo": "33",
          "houseCode": "dail",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "debateSection": {
          "debateSectionId": "dbsect_656",
          "showAs": "Health Services Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-07-14/writtens/dbsect_656",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-07-14/writtens/mul@/dbsect_656.xml"
            }
          }
        },
        "showAs": " 695. Deputy Dessie Ellis asked the Minister for Health the number of psychiatric consultants in CH09 working out of the Ballymun health centre; the number of hours and days worked; the number of cases waiting for assessment; the average wait times for such assessments; and if he will make a statement on the matter. [38900/22] ",
        "by": {
          "showAs": "Dessie Ellis",
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-07-14/pq_695",
        "answerText": " Minister of State at the Department of Health  As this is a service matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. "
      },
      "contextDate": "2022-07-14"
    },
    {
      "question": {
        "questionNumber": 696,
        "questionType": "written",
        "date": "2022-07-14",
        "house": {
          "chamberType": "house",
          "houseNo": "33",
          "houseCode": "dail",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "debateSection": {
          "debateSectionId": "dbsect_657",
          "showAs": "Hospital Appointments Status",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-07-14/writtens/dbsect_657",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-07-14/writtens/mul@/dbsect_657.xml"
            }
          }
        },
        "showAs": " 696. Deputy Dessie Ellis asked the Minister for Health if he will examine the case of a vulnerable young person (details supplied) who is currently awaiting a psychiatric assessment, who has been given an appointment for November of 2022 for this assessment and has been waiting months for such an appointment; and if he will make a statement on the matter. [38901/22] ",
        "by": {
          "showAs": "Dessie Ellis",
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-07-14/pq_696",
        "answerText": " Minister of State at the Department of Health  As this is a service matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. "
      },
      "contextDate": "2022-07-14"
    },
    {
      "question": {
        "questionNumber": 768,
        "questionType": "written",
        "date": "2022-07-05",
        "house": {
          "chamberType": "house",
          "houseNo": "33",
          "houseCode": "dail",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "debateSection": {
          "debateSectionId": "dbsect_700",
          "showAs": "Covid-19 Pandemic Supports",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-07-05/writtens/dbsect_700",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-07-05/writtens/mul@/dbsect_700.xml"
            }
          }
        },
        "showAs": " 768. Deputy Dessie Ellis asked the Minister for Health if he intends to include prison nurses in the front-line healthcare bonus scheme given that they are currently excluded from the scheme and prison nurses have been working throughout the pandemic at great risk to their own health and well-being; and if he will make a statement on the matter. [35784/22] ",
        "by": {
          "showAs": "Dessie Ellis",
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-07-05/pq_768",
        "answerText": " Minister for Health  Firstly I would like to extend my sincere gratitude to all healthcare workers for their efforts during this most challenging period.  As the deputy is aware, on January 19th, the Government announced a COVID-19 pandemic recognition payment for frontline public sector healthcare workers, to recognise their unique role during the pandemic. Following extensive engagement with healthcare unions on the matter, on 19th April the HSE published eligibility guidelines and FAQs, as apply to the HSE and Section 38 agencies, which are available on its website: www.hse.ie/eng/staff/resources/hr-circulars/hr-circular-012-2022-pandemic-special-recognition-payment.html. Payment is currently receiving priority across all Hospital Groups and Community Services in the HSE.  The HSE and the Department are currently examining progressing the rollout to the list of 6 non-HSE/non-Section 38 organisation types covered by the Government Decision.  Officials in the Department and the HSE are prioritising the work needed to progress this. It is hoped that information will be published shortly for those certain non-HSE/S38 healthcare employees that are covered by the Government Decision and the process available to their employers to implement this measure for their eligible staff. This shall cover eligible staff in:  1, Private Sector Nursing Homes and Hospices (e.g. Private, Voluntary, Section 39 etc.);  2. Eligible staff working on-site in Section 39 long-term residential care facilities for people with disabilities;  3. Agency roles working in the HSE;  4. Health Care Support Assistants (also known as home help / home care / home support) contracted to the HSE;  5. Redeployed members of the Defence Forces to work in frontline Covid-19 exposed environments for the HSE;  6. Paramedics employed by the Department of Local Government, Housing and Heritage.  The Government is mindful of other workers who played their own part during this difficult period in sustaining other services. It is tough to draw a line on this matter, but the Government based its decision on the risks which the above frontline workers faced. In recognition of the efforts of all workers, volunteers, and the general public during the COVID-19 pandemic, and in remembrance of people who lost their lives due to the COVID-19 pandemic, the Government announced a public holiday which took place on 18 March 2022. From February next year there will also be a new permanent public holiday established to mark Imbolc/St Brigid’s Day. "
      },
      "contextDate": "2022-07-05"
    },
    {
      "contextDate": "2022-05-31",
      "question": {
        "date": "2022-05-31",
        "questionType": "written",
        "showAs": " 419. Deputy Dessie Ellis asked the Minister for Education the number of placements that are available for children diagnosed with autism for the catchment area of the SENO and for CHO9, respectively; the number of new placements that will be available for each catchment area for the new school term starting in September 2022; and if she will make a statement on the matter. [27931/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-05-31/pq_419",
        "questionNumber": 419,
        "to": {
          "uri": null,
          "showAs": "Education",
          "roleCode": null,
          "roleType": null
        },
        "answerText": " Minister of State at the Department of Education  Enabling children with special educational needs to receive an education is a priority for this Government.  This year, my Department will spend in excess of €2 Billion, or over 25% of the Department’s budget on providing a wide range of schemes and supports for children with special educational needs.  This includes additional teaching and care supports.  As a result, the number of special education teachers, special needs assistants and special class and school places are at unprecedented levels.  The National Council for Special Education (NCSE) has responsibility for coordinating and advising on the education provision for children nationwide.  Over the last two years, my Department and the NCSE have worked closely on a more streamlined and joined up planning process which has ensured a targeted approach to meet demand for special needs placements ahead of each new school-year.  I am satisfied that this more joined up approach is delivering. Through this intensive intervention, we have seen over 300 special classes, providing over 1,800 new places, opened nationwide for the 2021/22 school-year.  I also acknowledge that notwithstanding the extent of this investment, there are some parts of the country where increases in population and other issues have led to concerns regarding a shortage of school places.  I can confirm that the NCSE is aware of an identified need for additional special classes for students with autism in the area referenced by the Deputy. Work has been underway with stakeholders for a number of years in this area to meet the demand for places.  NCSE has well established structures in place for engaging with schools and parents and seeks to ensure that schools in an area can, between them, cater for all children who have been identified as needing special class placements.  NCSE is continuing to engage with schools regarding the establishment of additional special classes for 2022/23 and beyond. There are specific plans in place to open additional special classes and every support will be made available to progress their opening in the shortest possible timeframe with a particular focus on September next.  It is of course open to any school to engage with the NCSE to establish a special class.  My Department is committed, in conjunction with the NCSE, to continue to work with parents, schools, patrons and all stakeholders to ensure that there are sufficient appropriate places for students with additional needs and to support all students to achieve their potential.  I want to reassure the Deputy also that my Department will continue to support the NCSE and schools through the provision of the necessary funding and capital investment to ensure all children are successful in accessing an education.  The list of special schools is available on the NCSE website at the following link:  ncse.ie/wp-content/uploads/2021/12/NCSE-Special-School-Allocations-21-22-website-03-12-2021.pdf.  and for special classes at: ncse.ie/wp-content/uploads/2022/04/Final-2021_2022-Sp-Class-list-25_03_22.pdf. ",
        "house": {
          "houseNo": "33",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": "",
          "showAs": "33rd Dáil"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09",
          "showAs": "Dessie Ellis",
          "memberCode": "Dessie-Ellis.D.2011-03-09"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-05-31/writtens/dbsect_310",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-05-31/writtens/mul@/dbsect_310.xml"
            }
          },
          "debateSectionId": "dbsect_310",
          "showAs": "Special Educational Needs"
        }
      }
    },
    {
      "contextDate": "2022-05-31",
      "question": {
        "date": "2022-05-31",
        "questionType": "written",
        "showAs": " 747. Deputy Dessie Ellis asked the Minister for Health the number of children aged 3 to 5 years of age that were diagnosed with autism from 2018 to date in tabular form; and if he will make a statement on the matter. [27928/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-05-31/pq_747",
        "questionNumber": 747,
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "answerText": " Minister of State at the Department of Health  I propose to take Questions Nos. 747, 748 and 749 together.  As these are service matters, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "house": {
          "houseNo": "33",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": "",
          "showAs": "33rd Dáil"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09",
          "showAs": "Dessie Ellis",
          "memberCode": "Dessie-Ellis.D.2011-03-09"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-05-31/writtens/dbsect_619",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-05-31/writtens/mul@/dbsect_619.xml"
            }
          },
          "debateSectionId": "dbsect_619",
          "showAs": "Departmental Data"
        }
      }
    },
    {
      "contextDate": "2022-05-31",
      "question": {
        "date": "2022-05-31",
        "questionType": "written",
        "showAs": " 748. Deputy Dessie Ellis asked the Minister for Health the number of children aged 6 to 8 years of age that were diagnosed with autism from 2018 to date in tabular form; and if he will make a statement on the matter. [27929/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-05-31/pq_748",
        "questionNumber": 748,
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "answerText": " Minister of State at the Department of Health  I propose to take Questions Nos. 747, 748 and 749 together.  As these are service matters, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "house": {
          "houseNo": "33",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": "",
          "showAs": "33rd Dáil"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09",
          "showAs": "Dessie Ellis",
          "memberCode": "Dessie-Ellis.D.2011-03-09"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-05-31/writtens/dbsect_619",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-05-31/writtens/mul@/dbsect_619.xml"
            }
          },
          "debateSectionId": "dbsect_619",
          "showAs": "Departmental Data"
        }
      }
    },
    {
      "contextDate": "2022-05-31",
      "question": {
        "date": "2022-05-31",
        "questionType": "written",
        "showAs": " 749. Deputy Dessie Ellis asked the Minister for Health the number of children aged 9 to 12 years of age that were diagnosed with autism from 2018 to date in tabular form; and if he will make a statement on the matter. [27930/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-05-31/pq_749",
        "questionNumber": 749,
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "answerText": " Minister of State at the Department of Health  I propose to take Questions Nos. 747, 748 and 749 together.  As these are service matters, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "house": {
          "houseNo": "33",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": "",
          "showAs": "33rd Dáil"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09",
          "showAs": "Dessie Ellis",
          "memberCode": "Dessie-Ellis.D.2011-03-09"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-05-31/writtens/dbsect_619",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-05-31/writtens/mul@/dbsect_619.xml"
            }
          },
          "debateSectionId": "dbsect_619",
          "showAs": "Departmental Data"
        }
      }
    },
    {
      "contextDate": "2022-05-31",
      "question": {
        "date": "2022-05-31",
        "questionType": "written",
        "showAs": " 763. Deputy Dessie Ellis asked the Minister for Health the number of persons that are currently waiting to be allocated a wheelchair; the number of wheelchairs that are allocated each month; and if he will make a statement on the matter. [27996/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-05-31/pq_763",
        "questionNumber": 763,
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "house": {
          "houseNo": "33",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": "",
          "showAs": "33rd Dáil"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09",
          "showAs": "Dessie Ellis",
          "memberCode": "Dessie-Ellis.D.2011-03-09"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-05-31/writtens/dbsect_634",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-05-31/writtens/mul@/dbsect_634.xml"
            }
          },
          "debateSectionId": "dbsect_634",
          "showAs": "Medical Aids and Appliances"
        }
      }
    },
    {
      "contextDate": "2022-05-31",
      "question": {
        "date": "2022-05-31",
        "questionType": "written",
        "showAs": " 764. Deputy Dessie Ellis asked the Minister for Health the percentage of wheelchairs and other medical aids such as zimmer-frames, orthopaedic chairs issued to patients which are refurbished and reutilised in cases in which the person no longer requires their use; and if he will make a statement on the matter. [27997/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-05-31/pq_764",
        "questionNumber": 764,
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "house": {
          "houseNo": "33",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": "",
          "showAs": "33rd Dáil"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09",
          "showAs": "Dessie Ellis",
          "memberCode": "Dessie-Ellis.D.2011-03-09"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-05-31/writtens/dbsect_635",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-05-31/writtens/mul@/dbsect_635.xml"
            }
          },
          "debateSectionId": "dbsect_635",
          "showAs": "Medical Aids and Appliances"
        }
      }
    },
    {
      "contextDate": "2022-03-22",
      "question": {
        "by": {
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09",
          "showAs": "Dessie Ellis"
        },
        "date": "2022-03-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-03-22/pq_107",
        "answerText": " Tánaiste and Minister for Enterprise, Trade and Employment  The Government is committed to providing emergency support to meet the immediate needs of those fleeing the Russian invasion of Ukraine. My Department will be working alongside the Department of Social Protection and other relevant Departments in facilitating full access to the labour market for those arriving from Ukraine, as guaranteed under the EU’s Temporary Protection Directive.  I discussed some of these issues with businesses at a meeting of the Enterprise Forum last week. We will consider further how we can ensure those arriving can take up appropriate employment as soon as possible and that businesses are adequately informed.  As well as full labour market access, the Temporary Protection Directive guarantees rights and supports for those arriving in Ireland, including:  - Permission to reside in Ireland for a period of 1 year. This permission may be further extended after this year has elapsed.  - Social welfare income supports  - Access to education  - Access to medical care  In addition to a support centre established in Dublin Airport, three new city centre hubs to support Ukrainian nationals have been established by the Government, in Dublin, Cork and Limerick. These ‘Ukraine supports centres’, as well as a number of Intreo Centres, will assist Ukrainians in obtaining PPS numbers, in availing of social welfare income supports and receiving referrals to other State services.  The Intreo employment services are available to assist those arriving from Ukraine as they seek employment in the Irish labour market, including through skills audits and CV preparation.  A dedicated section on the Department of Social Protection’s free recruitment platform, www.jobsireland.ie , is also being developed to provide information to newly arrived Ukrainians; this will include a document of Frequently Asked Questions which will be available in English, Ukrainian and Russian. This will be advertised through social media and at the Ukraine Support Centres, while the Employment Services Officers of the Department of Social Protection will also be available to Ukrainians seeking assistance.  Employers who wish to support Ukrainians through provision of employment opportunities, which should be compliant with employment law and good practice and offer market rates of pay, should register on www.jobsireland.ie . This will enable Employment Services Officers to match the skills of those seeking employment with available work opportunities. Ukrainians seeking employment will also be able to access the service directly, to upload details of their skills and experience for matching with available employment opportunities.  It should be remembered that many of those newly arrived are traumatised and that while some have a good level of English, many others have little or none. The aim will be to match those in a position to work with jobs for which they have recognised qualifications and the language skills necessary to undertake the work.  The Department of Social Protection will be working with the Department of Further and Higher Education, Research, Innovation and Science and its agencies to support Ukrainian jobseekers in acquiring English language and other skillsets as necessary. My Department will also be making available enterprise supports, to facilitate those with entrepreneurial experience in re-establishing where possible businesses in Ireland. ",
        "to": {
          "uri": null,
          "showAs": "Enterprise",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 107. Deputy Dessie Ellis asked the Tánaiste and Minister for Enterprise, Trade and Employment if there are plans to engage with various professions, sectors and employers to ascertain if the qualifications of Ukrainian nationals are acceptable here to create employment opportunities; if so, if they can be rapidly facilitated to work, particularly in sectors in which Ireland currently has shortages in the economy, such as the hospitality sector; if he will engage with ministerial colleagues in this regard; if he will consider putting in place a mechanism to identify employment vacancies in local areas to simplify and facilitate the rapid employment of Ukrainian refugees; and if he will make a statement on the matter.  [14521/22] ",
        "debateSection": {
          "debateSectionId": "dbsect_121",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-03-22/writtens/mul@/dbsect_121.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-03-22/writtens/dbsect_121",
          "showAs": "Ukraine War"
        },
        "questionNumber": 107,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2022-03-22",
      "question": {
        "by": {
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09",
          "showAs": "Dessie Ellis"
        },
        "date": "2022-03-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-03-22/pq_108",
        "answerText": " Minister of State at the Department of Enterprise, Trade and Employment  In Ireland, there is a robust suite of employment protections in place.  I wish to confirm to the Deputy that migrant workers benefit from the same statutory employment protections as their Irish and EEA resident counterparts.  Along with the Government, our State Agencies, Trade Unions and employer representative organisations are committed to ensuring that every Ukrainian person who arrives in Ireland is welcomed and provided with all the supports and protections they require to make them feel safe and integrated into our communities right across the country. ",
        "to": {
          "uri": null,
          "showAs": "Enterprise",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 108. Deputy Dessie Ellis asked the Tánaiste and Minister for Enterprise, Trade and Employment the plans that are in place to engage with the various unions with regard to Ukrainian refugees to agree on their employment conditions to ensure they are not exploited when employed; and if he will make a statement on the matter. [14522/22] ",
        "debateSection": {
          "debateSectionId": "dbsect_122",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-03-22/writtens/mul@/dbsect_122.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-03-22/writtens/dbsect_122",
          "showAs": "Ukraine War"
        },
        "questionNumber": 108,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2022-03-22",
      "question": {
        "by": {
          "memberCode": "Dessie-Ellis.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Dessie-Ellis.D.2011-03-09",
          "showAs": "Dessie Ellis"
        },
        "date": "2022-03-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-03-22/pq_305",
        "answerText": " Minister for Housing, Local Government and Heritage  Under Section 159 of the Local Government Act 2001, each Chief Executive is responsible for the staffing and organisational arrangements necessary for carrying out the functions of the local authority for which he or she is responsible.  My Department will continue to work with the local government sector in respect of its involvement in the response to the Ukrainian situation. ",
        "to": {
          "uri": null,
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 305. Deputy Dessie Ellis asked the Minister for Housing, Local Government and Heritage the plans that are in place to recruit extra staff for local authorities to deal with the unprecedented level of demand for services if the estimated number of Ukrainian refugees arrive in Ireland; and if he will make a statement on the matter. [14523/22] ",
        "debateSection": {
          "debateSectionId": "dbsect_285",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-03-22/writtens/mul@/dbsect_285.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-03-22/writtens/dbsect_285",
          "showAs": "Local Authorities"
        },
        "questionNumber": 305,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "chamberType": "house"
        }
      }
    }
  ]
}