{
  "head": {
    "counts": {
      "questionCount": 2492,
      "resultCount": 2492
    }
  },
  "results": [
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 325,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_325",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_315",
          "showAs": "Health and Safety",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_315",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_315.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Enterprise",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister of State at the Department of Enterprise, Trade and Employment  The Approved Form (AF 1) supplied is used to notify the Health and Safety Authority (HSA) of any construction work as defined in the Safety, Health and Welfare (Construction) Regulations 2013, which is likely to last longer than 30 working days or 500 person days. It can also be used to provide changes in appointments since initial notification of projects.  As the construction sector has a very significant accident rate, research indicates that a significant level of risk can be designed out prior to the commencement of the activity. The Safety, Health and Welfare at Work (Construction) Regulations 2013 places duties on the Client to notify the HSA of the appointment of the Project Supervisor for the Design Process (PSDP).  This notification should be submitted by Registered Post to the HSA, or as may be directed by the HSA. Information is also available on www.HSA.ie.  The Department of Enterprise, Trade and Employment and the HSA have not had any involvement in the erecting of this notice at this location, nor is there any regulatory requirement to do so. ",
        "showAs": " 325. Deputy Anne Rabbitte asked the Minister for Enterprise, Trade and Employment the reason a Health and Safety Authority notice was erected at a location (details supplied); the relevance of such a notice to the building and community; and if he will make a statement on the matter. [44083/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Anne Rabbitte",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03",
          "memberCode": "Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 373,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_373",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_357",
          "showAs": "School Transport",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_357",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_357.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Education  The School Transport Scheme is a significant operation managed by Bus Éireann on behalf of the Department of Education. In the 2023/24 school year over 163,800 children, including over 136,000 pupils travelling on primary and post primary services, 20,200 pupils with special educational needs, and 7,400 pupils who have arrived to Ireland from Ukraine were transported on a daily basis to primary and post-primary schools throughout the country.  The total cost of the scheme in 2023 was €382.02m.  Over 140,000 mainstream tickets have issued for the 2024/2025 school year, which is already 3% more than the total tickets issued for the full 2023/2024 school year.  The purpose of my Department's School Transport Scheme is, having regard to available resources, to support the transport to and from school of children who reside remote from their nearest school.  The pupil referred to by the Deputy falls into the TAMs concessionary category as they are attending their second closest school/centre.  An application was received late for the 2024/25 school year. No payment was received prior to the deadline for the 2024/25 school year and the service is now operating to capacity.  Under the terms of the School Transport Schemes, children are eligible for transport at primary level where they reside not less than 3.2 kms from and are attending their nearest national school. At post primary level, they are eligible where they reside not less than 4.8 kms from and are attending their nearest post primary school/education centre. Distance is determined by the Department/Bus Éireann and rules have regard to ethos and language.  Children who are eligible for school transport and who complete the application process on time (apply on time and pay on time) are accommodated on school transport services where such services are in operation and where there is capacity to do so.  Children who are not eligible but who apply for school transport are considered for spare seats that may exist after eligible children have been facilitated; such seats are referred to as concessionary seats.  Because of the nature of concessionary transport for non-eligible children and the priority of providing places for eligible children, there may be an excess of demand over supply for concessionary places. In these cases Bus Éireann will allocate tickets for spare seats using an agreed selection process.  Temporary Alleviation Measures (TAMs) at post primary level are continued for the current school year. Under these measures, transport will be provided where there is a route in operation and where capacity exists for concessionary post primary pupils who are eligible for transport to their nearest school, are attending their second nearest school and who applied and paid on time. ",
        "showAs": " 373. Deputy Anne Rabbitte asked the Minister for Education the process in place for exchange students to access school transport (details supplied); and if she will make a statement on the matter. [44103/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Anne Rabbitte",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03",
          "memberCode": "Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 374,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_374",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_358",
          "showAs": "School Transport",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_358",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_358.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Education  The School Transport Scheme is a significant operation managed by Bus Éireann on behalf of the Department of Education. In the 2023/24 school year over 163,800 children, including over 136,000 pupils travelling on primary and post primary services, 20,200 pupils with special educational needs, and 7,400 pupils who have arrived to Ireland from Ukraine were transported on a daily basis to primary and post-primary schools throughout the country.  The total cost of the scheme in 2023 was €382.02m.  Over 140,000 mainstream tickets have issued for the 2024/2025 school year, which is already 3% more than the total tickets issued for the full 2023/2024 school year.  The purpose of my Department's School Transport Scheme is, having regard to available resources, to support the transport to and from school of children who reside remote from their nearest school.  Under the current terms of the School Transport Schemes, children are eligible for transport at primary level where they reside not less than 3.2 kms from and are attending their nearest national school. At post primary level, they are eligible where they reside not less than 4.8 kms from and are attending their nearest post primary school/education centre. Distance is determined by the Department/Bus Éireann and rules have regard to ethos and language.  Children who are eligible for school transport and who complete the application process on time (apply on time and pay on time) are accommodated on school transport services where such services are in operation and where there is capacity to do so.  Children who are not eligible but who apply for school transport are considered for spare seats that may exist after eligible children have been facilitated; such seats are referred to as concessionary seats.  Because of the nature of concessionary transport for non-eligible children and the priority of providing places for eligible children, there may be an excess of demand over supply for concessionary places. In these cases Bus Éireann will allocate tickets for spare seats using an agreed selection process.  Temporary Alleviation Measures (TAMs) at post primary level are continued for the current school year. Under these measures, transport will be provided where there is a route in operation and where capacity exists for concessionary post primary pupils who are eligible for transport to their nearest school, are attending their second nearest school and who applied and paid on time.  Bus Éireann advises that the pupil referred to by the Deputy has been accommodated on a service for the 2024/25 school year. As all eligible pupils in this area are being accommodated on a service, the establishment of a new service or the upgrade to a larger bus is not warranted. ",
        "showAs": " 374. Deputy Anne Rabbitte asked the Minister for Education if additional capacity is being added to route F53T to enable families access to this bus route (details supplied); and if she will make a statement on the matter. [44104/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Anne Rabbitte",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03",
          "memberCode": "Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 892,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_892",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_845",
          "showAs": "Departmental Funding",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_845",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_845.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  In relation to capital funding, I wish to inform the Deputy that neither my Department nor Tusla have capital funding to develop the capital infrastructure of Family Resource Centres (FRC), including purchasing sites for the development of new centres. Tusla does not have a dedicated budget for capital or building works for third party organisations.  The Family Resource Centre programme is a community development programme that is financially supported by many State agencies in a partnership approach. FRCs may draw on various sources of funding provided by other Government Departments, agencies and private sources. I would suggest, in relation to any grant funding for the purchase of a site, that the local County or City Council be considered as a starting point in the context of capital funding. ",
        "showAs": " 892. Deputy Anne Rabbitte asked the Minister for Children, Equality, Disability, Integration and Youth the grants available to a facility (details supplied) to purchase a site for the development of a new centre; and if he will make a statement on the matter. [44088/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Anne Rabbitte",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03",
          "memberCode": "Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 1327,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_1327",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_1262",
          "showAs": "Grant Payments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_1262",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_1262.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Rural",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Rural and Community Development  My Department has a number of capital programmes designed to support community groups wishing to purchase a site for the development of new centres. Subject to meeting individual scheme requirements, applications for the purchase of land to develop new centres can be made under the Town and Village Renewal Scheme (TVRS), the Rural Regeneration and Development Fund (RRDF),  the LEADER programme and also the Community Recognition Fund (CRF).  The 2023 TVRS placed particular emphasis on projects that bring economic and social vibrancy to town centres in line with Government’s policies, making them better places to live, work, socialise and raise a family. The acquisition of land in town centres which supports local authorities with the development of town regeneration or community focused projects such as town parks and plazas was one of the types of activities supported under the 2023 Scheme.  Each year, the priorities of the scheme are reviewed to ensure that funding is targeted effectively to support vibrant and attractive communities. This will continue with future calls for proposals under the scheme. The core aims of Town Centre First policy and the needs of communities around Ireland will be at the heart of any changes made.  The RRDF provides investment to support suitable projects in towns and villages with a population of less than 10,000, and outlying areas. The RRDF provides funding for the development and construction of large scale capital projects in towns, villages and rural areas across Ireland.  Calls for applications to the Fund are sought under two categories – Category 1 and Category 2. Category 1 relates to large scale ambitious capital projects with all necessary planning and other consents in place and ready to proceed. Category 2 provides grant funding to enable the development of project proposals suitable for future calls for Category 1 applications.  I announced the last round of successful projects for Category 1 funding on the 13th May 2024. Only last week I opened a new call for applications under Category 2 with a closing date of 14th March 2025.  Funding under the 2023-2027 LEADER programme may also be available to support this type of activity. While LEADER funding would not support the purchase of land or buildings as a standalone project, the LEADER programme may provide grant aid, not exceeding 10% of the overall project costs, where the purchase of land or buildings formed part of a larger project.  Prospective applicants should, in the first instance, contact their relevant Local Action Group, through its Implementing Partner, to discuss the eligibility of the project and the funding that may be available. Details of the Local Action Groups are available on my Department's website.  The CRF was first introduced in 2023 to recognise the huge efforts made by communities in welcoming and supporting people coming to Ireland. Through the 2023 allocation, funding of €50 million was approved for some 900 projects. To further support communities, a further €50 million in funding under the Community Recognition Fund was announced last March.  Applications under the current round of funding can be submitted by local authorities across three phases.  The closing dates for receipt of applications under the final phase is January 31st, 2025.  Local authorities are required to engage and collaborate with communities to identify the most appropriate projects for support. The purchase of land can be considered where it fits with the other criteria of the fund. Any potential applicant should contact their local authority directly for more information on the application process.  Further details on each of these funds can be found on my Department's website. ",
        "showAs": " 1327. Deputy Anne Rabbitte asked the Minister for Rural and Community Development the grants available to a facility (details supplied) to purchase a site for the development of a new centre; and if she will make a statement on the matter. [44087/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Anne Rabbitte",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03",
          "memberCode": "Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-10-24",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-24/writtens/mul@/dbsect_228.xml"
            }
          },
          "debateSectionId": "dbsect_228",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-24/writtens/dbsect_228",
          "showAs": "Departmental Funding"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-24/pq_215",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 215,
        "showAs": " 215. Deputy Anne Rabbitte asked the Minister for Housing, Local Government and Heritage the status of an application for capital assistance scheme funding for a service (detail supplied); the date on which it will be sanctioned; and if he will make a statement on the matter. [43576/24] ",
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy Darragh O'Brien)  The application for funding under the Capital Assistance Scheme in this instance, is in respect of the capital costs for a new construction development. Regrettably, it appears that there was a significant delay from when the group undertook the construction tender, before my Department received the required post-tender cost proposal.  My Department is now examining the proposed construction costs, bearing in mind the time lapse since the group undertook the tendering process, and will be in contact with the local authority shortly on this. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-10-24",
        "by": {
          "showAs": "Anne Rabbitte",
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-10-24",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-24/writtens/mul@/dbsect_286.xml"
            }
          },
          "debateSectionId": "dbsect_286",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-24/writtens/dbsect_286",
          "showAs": "Foreshore Issues"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-24/pq_273",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 273,
        "showAs": " 273. Deputy Anne Rabbitte asked the Minister for Agriculture, Food and the Marine the status of an application (details supplied); the timeline for sanctioning of same; and if he will make a statement on the matter. [43678/24] ",
        "answerText": " Minister for Agriculture, Food and the Marine  The operator of the site the Deputy refers to was issued with an aquaculture licence by the Aquaculture Licence Appeals Board (ALAB) on 26 January 2023 “for the cultivation of Native and Pacific Oyster on a site…”. The holder of an aquaculture licence also requires a Foreshore Licence.  My Department is currently processing a Foreshore Licence application for this site. All applications for a foreshore licence are considered in accordance with the provisions of the Foreshore Act 1933 (as amended) and applicable national and EU legislation. The licensing process involves consultation with scientific and technical advisers and Statutory Consultees. The legislation also provides for a period of public consultation. The consultation process for this application concluded on the 9th of March 2024.  As this application is under active consideration, it would not be appropriate to comment further on the matter at this time. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-10-24",
        "by": {
          "showAs": "Anne Rabbitte",
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "question": {
        "by": {
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03",
          "showAs": "Anne Rabbitte"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-23/writtens/dbsect_116",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-23/writtens/mul@/dbsect_116.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_116",
          "showAs": "Tax Code"
        },
        "showAs": " 67. Deputy Anne Rabbitte asked the Minister for Finance if he considered making a proposal to discuss ways to alleviate VAT on Sky services for pubs as hospitality providers; and if he will make a statement on the matter. [43403/24] ",
        "questionNumber": 67,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-23/pq_67",
        "date": "2024-10-23",
        "answerText": " Minister for Finance  I am advised by Revenue that the VAT rating of goods and services is subject to EU VAT law, with which Irish VAT law must comply. In general, the EU VAT Directive provides that all goods and services are liable to VAT at the standard rate, unless they fall within the categories of goods and services specified in Annex III of the VAT Directive, in respect of which Member States may apply a lower rate of VAT.  It should be noted that while internet access and live streaming of certain events are included in Annex III of the VAT Directive it is not possible to provide a separate VAT rate for businesses in the hospitality sector when they purchase these services.  Change to VAT rates applied to goods and services will be considered as part of the normal budget process.  However, it should be noted that VAT registered businesses can reclaim VAT on inputs so a change in VAT rates for internet access or live streaming events would not result in a net financial benefit for those businesses. ",
        "questionType": "written",
        "house": {
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "to": {
          "roleCode": null,
          "roleType": null,
          "showAs": "Finance",
          "uri": null
        }
      },
      "contextDate": "2024-10-23"
    },
    {
      "question": {
        "by": {
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03",
          "showAs": "Anne Rabbitte"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-23/writtens/dbsect_162",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-23/writtens/mul@/dbsect_162.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_162",
          "showAs": "Vacant Properties"
        },
        "showAs": " 117. Deputy Anne Rabbitte asked the Minister for Housing, Local Government and Heritage to end long-term vacancy and dereliction under the urban regeneration development fund; and if he will make a statement on the matter. [43446/24] ",
        "questionNumber": 117,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-23/pq_117",
        "date": "2024-10-23",
        "answerText": " Minister for Housing, Local Government and Heritage  Tackling vacancy and dereliction is a key priority for this Government.  The Vacant Homes Action Plan, which I published in January 2023, built on Pathway 4 of Housing for All and set out the various actions that were being pursued to return vacant properties back into use as homes. Earlier this year I published an update on the Action Plan which shows the significant progress that is being made. Both the Vacant Homes Action Plan and related update can be accessed on my Department’s website at the following link: www.gov.ie/en/publication/df86c-vacant-homes-action-plan-2023-2026/  As part of the Action Plan, I announced a €150 million Urban Regeneration and Development Fund (URDF) for local authorities to acquire vacant or derelict properties for reuse or sale, using their compulsory purchase powers were necessary.  The URDF Call 3 fund is being used for the acquisition of long term vacant and derelict buildings and sites in URDF towns by local authorities, for onward sale on the open market to purchasers who undertake to return the properties to use within timelines agreed with the local authority.  The URDF Call 3 funding is intended to address the financial barriers and risk faced by local authorities in seeking to tackle long term vacant and derelict buildings and sites across URDF eligible towns and cities. The fund will be available to cover the acquisition and sales costs of a property and any minor works required to make the property more suitable for sale e.g. improving access, tidying up, opening up to facilitate inspections, building condition assessments, reports etc.  Acquired properties are then offered by local authorities for private sale at market value to those who in return will commit to bringing the property back into residential use. Proceeds from the sale of these properties will be used to replenish the fund, allowing a local authority to establish a rolling programme to tackle long-term vacancy and dereliction without a requirement for borrowing and the associated financial risk.  Purchasers of these properties from the local authority will be able to defray the costs of returning them to use by accessing, subject to eligibility, the new Croí Cónaithe Vacant Homes Grant, SEAI energy efficiency grants or the Repair and Leasing Scheme.  In Q3 2023, following a consultation process with the local authority sector, formal approval in principle was issued to each local authority for a programme of property acquisitions. Following assessment of submissions for all 31 local authorities against the relevant criteria, 946 long term vacant (> 2 years) and derelict buildings located in URDF town and city centres were initially approved for acquisition and placed on the approved acquisition programme.  A one-year review on the implementation of the programme to date and an update on the approved acquisition programmes is currently underway, the results of which will be brought to my attention once completed.  The successful implementation of the Call 3 programme will support the Government’s Town Centre First Policy, Vacant Homes Action Plan and the National Planning Framework objectives seeking to provide increased numbers of homes in towns and urban areas where people can live close to local services, amenities and employment. ",
        "questionType": "written",
        "house": {
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "to": {
          "roleCode": null,
          "roleType": null,
          "showAs": "Housing",
          "uri": null
        }
      },
      "contextDate": "2024-10-23"
    },
    {
      "question": {
        "by": {
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03",
          "showAs": "Anne Rabbitte"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-23/writtens/dbsect_157",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-23/writtens/mul@/dbsect_157.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_157",
          "showAs": "Vacant Properties"
        },
        "showAs": " 118. Deputy Anne Rabbitte asked the Minister for Housing, Local Government and Heritage the number of grants applied for, and drawn down through, Galway County Council under the Croí Cónaithe fund in 2022, 2023 and the year to date; and if he will make a statement on the matter. [43447/24] ",
        "questionNumber": 118,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-23/pq_118",
        "date": "2024-10-23",
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy Darragh O'Brien)  I propose to take Questions Nos. 112 and 118 together.  The Vacant Property Refurbishment Grant is a key support, introduced by this Government, to bring vacant and derelict properties back into use as homes. A grant of up to €50,000 is available for the refurbishment of vacant properties for occupation as a principal private residence and for properties which will be made available for rent. A top-up grant of up to €20,000 is available where the property is derelict, bringing the total grant available for a derelict property up to €70,000.  The Grant is available in respect of vacant and derelict properties built prior to 2008, in towns, villages, cities and rural areas.  The level of interest in and take-up of the Grant has been significant since it was launched. To date over 10,200 grant applications have been received across local authorities and over 6,800 approved. Payment of grants by local authorities commenced at the end of 2023, as refurbishment works started to be completed, and this has steadily increased. I expect this trend to continue, with the number of grants paid significantly increasing over the coming months as more refurbishment works are completed.  My Department publishes data on applications for the Vacant Property Refurbishment Grant on its website on a quarterly basis, which includes a breakdown of the grants paid per local authority and the total amount of grants paid. This data can be accessed at the following link: www.gov.ie/en/collection/4bbe4-vacant-property-refurbishment-grant-statistics/ ",
        "questionType": "written",
        "house": {
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "to": {
          "roleCode": null,
          "roleType": null,
          "showAs": "Housing",
          "uri": null
        }
      },
      "contextDate": "2024-10-23"
    },
    {
      "question": {
        "by": {
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03",
          "showAs": "Anne Rabbitte"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-23/writtens/dbsect_255",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-23/writtens/mul@/dbsect_255.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_255",
          "showAs": "Departmental Funding"
        },
        "showAs": " 217. Deputy Anne Rabbitte asked the Minister for Rural and Community Development the projects in east Galway that have been approved for funding under the rural regeneration and development fund; the amount of funding received for the years 2020, 2021, 2022, 2023, and the year to date, in tabular form; and if she will make a statement on the matter. [43439/24] ",
        "questionNumber": 217,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-23/pq_217",
        "date": "2024-10-23",
        "answerText": " Minister for Rural and Community Development  The Rural Regeneration and Development Fund (RRDF) provides funding for the development and construction of large scale capital projects in towns, villages and rural areas across Ireland. Since 2018, funding of €584 million has been allocated to 243 projects.  Calls for applications to the Fund are sought under two categories – Category 1 and Category 2. Category 1 relates to large scale ambitious capital projects with all necessary planning and other consents in place and ready to proceed. Category 2 provides grant funding to enable the development of project proposals suitable for future calls for Category 1 applications.  Since 2020, seven Galway projects have been allocated RRDF funding of €19.5 million.  I announced the last round of successful projects on the 13th May 2024 for Category 1 funding. I was delighted to provide funding of €13.7 million to Galway County Council and Galway Rural Development for three projects in Galway – Athenry, Tuam and Glenamaddy.  I have listed all projects allocated funding in Galway, including the east Galway area, from 2020 to 2024 below.     Year Funding Awarded    Location    Project Name    Total RRDF Funding      2020    Clifden    Clifden Town Centre    €792,030.00      2020    Portumna    Portumna Vision 2030    €1,192,855.00      2021    Portumna    Portumna Courthouse    €2,950,748.87      2022    Gort    Gort Inse Guaire    €798,584.00      2024    Athenry    Athenry Public Realm Enhancement and Community and Enterprise Hub    €6,075,518.00      2024    Glenamaddy    Creation of Multi-Use Community Facility in Glenamaddy    €4,003,125.00      2024    Tuam    Tuam Town Hall    €3,685,359.00      Total          €19,498,219.87    ",
        "questionType": "written",
        "house": {
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "to": {
          "roleCode": null,
          "roleType": null,
          "showAs": "Rural",
          "uri": null
        }
      },
      "contextDate": "2024-10-23"
    },
    {
      "question": {
        "by": {
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03",
          "showAs": "Anne Rabbitte"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-23/writtens/dbsect_256",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-23/writtens/mul@/dbsect_256.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_256",
          "showAs": "Departmental Funding"
        },
        "showAs": " 218. Deputy Anne Rabbitte asked the Minister for Rural and Community Development the projects in east Galway that have been approved for funding under the town and village renewal scheme; the amount of funding received, for the years 2020, 2021, 2022, 2023, and the year to date, in tabular form; and if she will make a statement on the matter. [43440/24] ",
        "questionNumber": 218,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-23/pq_218",
        "date": "2024-10-23",
        "answerText": " Minister for Rural and Community Development  Our Rural Future, Ireland's Rural Development Policy 2021 – 2025, represents the Irish Government’s blueprint for the sustainable development of rural Ireland. It sets out a vision for a thriving rural Ireland, and to that end establishes a strategic framework for the delivery of capital investment under my Department's Rural Development Investment Programme. The delivery of these actions will enhance the wellbeing and quality of life for people living in our rural towns and villages.  The Town and Village Renewal Scheme (TVRS) was introduced in 2016 and is one of a number of measures designed to rejuvenate rural towns and villages throughout Ireland. Since the launch of the scheme over €177 million has been allocated to almost 1,800 projects. Of this just under €7 million has been allocated to 76 projects in County Galway.  In line with the policy commitments of Our Rural Future, TVRS priorities are reviewed at the end of each scheme year to ensure that funding is targeted effectively to support vibrant and attractive communities and to respond to changing needs and opportunities.  TVRS is administered through local authorities, who work closely with local communities and businesses to develop proposals that will bring long-lasting, positive impacts to rural towns and villages.  The 2023 Scheme placed particular emphasis on projects that bring economic and social vibrancy to town centres in line with Government policies, which will encourage more people into town and village centres to work, live, socialise and spend time in. At the end of April last, I announced €20.4 million in funding to support 82 successful projects under the 2023 Scheme, of which Galway has been allocated €750,000 for three projects.  Earlier this year, I launched a series of measures under the Town Centre First Suite of Supports to regenerate town centres. One such measure supports the completion of Project Development Measure (PDM) projects and on the 23 August 2024, I announced €2.6 million in funding to support 53 successful projects of which Galway has been allocated €148,925 for three projects.  The allocations in the table below include the amounts awarded to Galway under TVRS and the TCF Suite of Supports PDM.  The priorities for the 2024/25 TVRS are currently under review to inform the next iteration of the scheme which is provisionally scheduled to launch before the end of this year.  Details of projects allocated funding in Galway, including those in East Galway, are provided below:   Galway renewal funding 2020-2023  ",
        "questionType": "written",
        "house": {
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "to": {
          "roleCode": null,
          "roleType": null,
          "showAs": "Rural",
          "uri": null
        }
      },
      "contextDate": "2024-10-23"
    },
    {
      "question": {
        "by": {
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03",
          "showAs": "Anne Rabbitte"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-23/writtens/dbsect_257",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-23/writtens/mul@/dbsect_257.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_257",
          "showAs": "Departmental Funding"
        },
        "showAs": " 219. Deputy Anne Rabbitte asked the Minister for Rural and Community Development the projects in east Galway that have been approved for funding under the local improvement scheme; the amount of funding received, for the years 2020, 2021, 2022, 2023, and the year to date, in tabular form; and if she will make a statement on the matter. [43441/24] ",
        "questionNumber": 219,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-23/pq_219",
        "date": "2024-10-23",
        "answerText": " Minister for Rural and Community Development  The Local Improvement Scheme, or LIS, supports the improvement of rural roads and laneways that are generally not maintained by local authorities.  My Department reintroduced the scheme in 2017 after several years without dedicated funding. Between 2017 and 2024, my Department allocated almost €170 million to local authorities under the scheme. Up to the end of 2023, this has upgraded over 4,000 non-public roads and lanes, benefitting nearly 20,000 landowners and residents in these rural areas.  While my Department provides funding for the scheme, it is administered by each local authority, which is responsible for the selection and prioritisation of roads in accordance with the eligibility criteria set out in the scheme outline. My Department retains LIS information on a county rather than municipal area basis. Details relating to municipal areas may be available from the relevant local authorities.  Last year, over €1.99 million in funding was granted to Galway County Council, including LIS funding for repairing island roads. This brings the total amount allocated to Galway since 2017 to more than €10.4 million. The table below sets out the overall funding allocated to Galway County Council in 2020, 2021, 2022, and 2023, and to date in 2024, as well as the number of roads completed.  Dedicated funding was introduced last year for LIS repair works on eligible island roads. Galway received €476,000 and has been allocated €500,000 in LIS funding across 2024 and 2025.     Galway    Roads Completed    Funding Allocated      2020    30    €856,959      2021    49    €1,580,871      2022    50    €1,682,841      2023    48    €1,994,259      2024/2025    *TBC    €3,088,444      Total    177    €8,727,374    ",
        "questionType": "written",
        "house": {
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "to": {
          "roleCode": null,
          "roleType": null,
          "showAs": "Rural",
          "uri": null
        }
      },
      "contextDate": "2024-10-23"
    },
    {
      "question": {
        "by": {
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03",
          "showAs": "Anne Rabbitte"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-23/writtens/dbsect_258",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-23/writtens/mul@/dbsect_258.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_258",
          "showAs": "Departmental Funding"
        },
        "showAs": " 220. Deputy Anne Rabbitte asked the Minister for Rural and Community Development the projects in east Galway that have been approved for funding under the outdoor recreation infrastructure scheme; the amount of funding, for the years 2020, 2021, 2022, 2023, and the year to date, in tabular form; and if she will make a statement on the matter. [43442/24] ",
        "questionNumber": 220,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-23/pq_220",
        "date": "2024-10-23",
        "answerText": " Minister for Rural and Community Development  The Outdoor Recreation Infrastructure Scheme (ORIS) provides funding for the development and enhancement of outdoor recreational infrastructure such as walking trails, cycleways, water-based recreation sites and mountain trails. Since 2020, funding of almost €5 million has been allocated to 58 outdoor recreation projects in County Galway.  A table detailing the ORIS projects approved in County Galway since 2020 is set out below. This information relates to the funding approvals per calendar year rather than each annual iteration of the scheme. For example, projects under measures 1, 2 and 3 of the ORIS 2023 scheme were formally announced at the start of 2024 and are included under the 2024 column below.  Details of all approved projects can be found on my Department's website.     Approval Year    Organisation    Measure    Project Name    Grant Amount Approved      2020    Galway County Council    2    Upgrade work to a New Trail Development \"Lúibín Leitir Móir - Slí Chonamara    €95,873      2020    Galway County Council    2    Knockdoemore - Lackagh Walking Trail    €185,546      2020    Galway County Council    2    The Walks Project, Loughrea    €100,000      2021    Galway County Council    1    Aughrane Forest Trail Project - Phase 1    €17,685      2021    Galway County Council    1    Glenamaddy Frass Looped Walks Phase 1    €18,000      2021    Galway County Council    1    Lismany Kylemore Boardwalk    €20,000      2021    Galway County Council    1    Lismany Kylemore Trail    €20,000      2021    Galway County Council    1    Clonbur Walking and Bicycle Trails (Maintenance)    €18,000      2021    Comhar Na nOilean    1    Out and About on the Offshore Islands    €19,935      2021    Comhar Na nOilean    1    Inishbofin Looped Walks & Blueways    €12,600      2021    Forum Connemara CLG    1    Luba Binn Shleibhe/Binn Shleibhe Loop    €20,000      2021    Galway County Council    1    Connemara Greenway Maintenance    €17,000      2021    Galway County Council    1    The Wheels of Athenry Cycle Trail    €19,800      2021    Galway County Council    1    Cill Mhuirbhigh Beach Maintenance    €19,800      2021    Galway County Council    1    Sandybanks Lane Walkway    €20,000      2021    Galway County Council    1    Annaghdown Pier    €20,000      2021    Galway County Council    1    Lúibín Gharumna Trail    €19,638      2021    Forum Connemara CLG    1    Inis Nee Loop    €17,774      2021    Forum Connemara CLG    1    Binn Shléibhe    €17,955      2021    Galway County Council    2    Atlantic Waterfall Walk, Letterfrack    €183,465      2021    Galway County Council    2    Woodford Millennium Oak Forest    €200,000      2021    Galway County Council    2    The Walks Project    €200,000      2021    Galway County Council    3    Portumna Blueway, Wayfinding, Sculpture Park    €499,585      2021    Údarás na Gaeltachta    3    Bealach Shéanadh Mhacha / Discover Shéanadh Mhacha    €500,000      2021    Galway County Council    3    Connemara Trails & Eurovelo Route    €500,000      2021    Galway County Council    PDM    The Long Point Loughrea    €50,000      2022    Galway County Council    1    Connemara Greenway Maintenance    €28,350      2022    Galway County Council    1    Connemara Greenway Marketing    €27,000      2022    Galway County Council    1    Monivea Woods Trail    €27,000      2022    Galway County Council    1    Carrabane Forest Muddy Walks    €29,250      2022    Galway County Council    1    Gort Riverwalk    €27,424      2022    Galway County Council    1    Glenamaddy Walking Trails-Frass Looped Walks Phase 2    €21,072      2022    Forum Connemara CLG    1    Luba Lough Coolin    €26,024      2022    Forum Connemara CLG    1    Luibin Cnoc Choilin    €30,000      2022    Galway Rural Development    1    Redevelopment of Bellew Riverside Nature Park    €23,075      2022    Galway Rural Development    1    Resurface existing walking track and carpark Galway Ruralark at Shannon Riverside Walkway.    €25,579      2022    Galway Rural Development    1    Upgrade of Hymany Way    €28,316      2022    Galway County Council    2    Creggs Mountain Walk    €200,000      2022    Galway County Council    2    The Walks Loughrea    €200,000      2022    Galway County Council    2    Killarainy Woods Trail    €103,950      2022    Galway County Council    3    Western Way Trail Upgrade    €425,250      2022    Galway County Council    PDM    East Galway Eco Park    €50,000      2022    Galway County Council    PDM    Portumna Outdoor Recreation Park    €49,950      2023    Galway County Council    PDM    Rinville Forest Park Masterplan    €49,950      2023    Galway County Council    PDM    Ballinasloe Outdoor Recreation Park    €49,950      2023    Galway County Council    PDM    Linn Taoide Arainn    €35,847      2023    Údarás na Gaeltachta    PDM    Lúibín Gharumna    €22,770      2023    Údarás na Gaeltachta    PDM    Cois Caolaire    €45,810      2024    Galway County Council    1    Creggs Wildlife Garden accessibility upgrade    €20,339      2024    Galway County Council    1    Gateway to the Corrib    €18,000      2024    Galway County Council    1    Hymany Way Upgrade    €29,710      2024    Galway County Council    1    Lackagh Knockdoemore Walkway 2023 Enhancements    €27,450      2024    Galway County Council    1    Traught Beach Accessibility Upgrade    €29,700      2024    Galway County Council    1    An Trá Mhor Inverin Accessibility Upgrade    €29,700      2024    Galway County Council    1    Cill Murvey Beach Accessibility Upgrade    €29,700      2024    Galway County Council    2    Glinsk Heritage Park    €200,000      2024    Galway County Council    2    Castlegrove Woods Tales & Trails    €47,821      2024    Galway County Council    2    Ionad Pobail an Mháma - Car Park    €172,583      Total          58 Projects    €4,944,226    ",
        "questionType": "written",
        "house": {
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "to": {
          "roleCode": null,
          "roleType": null,
          "showAs": "Rural",
          "uri": null
        }
      },
      "contextDate": "2024-10-23"
    },
    {
      "question": {
        "by": {
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03",
          "showAs": "Anne Rabbitte"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-23/writtens/dbsect_259",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-23/writtens/mul@/dbsect_259.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_259",
          "showAs": "Departmental Funding"
        },
        "showAs": " 221. Deputy Anne Rabbitte asked the Minister for Rural and Community Development the projects in east Galway that have been approved for funding under the CLÁR programme; the amount funding received, for the years 2020, 2021, 2022, 2023, and the year to date in tabular form; and if she will make a statement on the matter. [43443/24] ",
        "questionNumber": 221,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-23/pq_221",
        "date": "2024-10-23",
        "answerText": " Minister for Rural and Community Development  The CLÁR programme provides targeted investment for small scale infrastructural projects in defined rural areas. Since 2020, over 90 projects have been approved in county Galway with almost €5.7 million in funding. To date this year, there have been approvals under Measures 1 and 2 of CLÁR 2024 and I hope to announce Measure 3 projects in the coming weeks  The following table lists the projects approved in Galway since 2020.     Scheme Year    Local authority (LA) / community group application    Clár Measure    Project    Project Description    Amount Allocated      2020    LA    1    Attymon Village    Footpath and Lighting    €40,500      2020    LA    1    Coláiste an Chreagáin Mountbellew    Bus and car turnaround and drop off area    €50,000      2020    LA    1    Coiste Forbartha Chorr na Móna, Conga    Footpath upgrade, resurfacing of the parking area and Public lighting.    €36,000      2020    LA    1    Glinsk National School, Ballynakill    Drop off area and footpaths    €50,000      2020    LA    1    St Columba’s National School, Killbeacanty    Safety lights, upgrade road markings, car parking facilities    €36,000      2020    LA    2    Comhairle Muintir an Chaiseal CFTR    Landscaping, fencing and picnic tables and seating    €27,000      2020    LA    2    Lawrancetown Community Development Group    Amenity Area works    €21,549      2020    Group    3a    Cairdeas, Forbairt Chonamara Láir Teo    Equipment    €3,986      2020    Group    3a    Glenamaddy Community Care    Equipment    €2,250      2020    Group    3a    Forum Connemara    Vehicle Adaption    €6,786      2020    Group    3a    COPE Galway    Vehicle adaption & equipment    €8,034      2020    Group    3a    Muintearas Teoranta    Equipment    €2,967      2020    Group    3b    Ability West Clifden    Vehicle with adaption    €54,000      2020    Group    3b    Brothers of Charity    Vehicle    €40,406      2020    Group    3b    Ballinasloe Social Services    Large minibus with lift    €59,400                     €438,878      2021    LA    1    Clonbern NS    Pedestrian crossing and school parking upgrades.    €50,000      2021    LA    1    Galway County Council and Woodford Parish Development    Extension of footpaths from Woodford to Derrycrag Nature Reserve.    €50,000      2021    LA    2    Lurga NS    Development of community MUGA.    €50,000      2021    LA    2    Skehana Community Development Committee (SCD)    Development of community accessible playground.    €49,513      2021    LA    2    Glinsk Community Development Association    Development of community playground.    €50,000      2021    LA    2    Abbey Community Development Association    Final Phase of Community MUGA, Lighting, Access to Adjacent Sensory Play Area, Gym.    €27,000      2021    LA    3a    Comharchumann Forbartha Arann    Development of Community Garden at Garrai na gCrann, shed, tools, bedding materials and planting.    €8,100      2021    Group    3b    East Galway and Midlands Cancer Support    Purchase of Vehicle    €42,930      2021    Group    3b    Ability West Mountbellew    Bus with adaption    €54,000      2021    LA    Innovation    Galway County Council    To undertake repairs at 3 community playgrounds. Update community directory of playgrounds.    €30,825      2021    Group    Innovation    Comhairle Ceantar na nOileán Teo.    (1) HUB Ceantar na nOileán (2) Gaeltacht Retrofit Co-Op. Establishment of Ireland's first Gaeltacht Retrofit Co-OP. To establish a skills exchange and mentoring programme.    €50,000                     €462,368      2022    LA    1    Comhairle Ceantar na nOileán Teo    Development of a community cinema and drop in youth hub facility at the Hall Pobail Tir an Fhia to include library, coffee dock & game area.    €41,827      2022    LA    1    Mountbellew Moylough GAA Club    Construction of 1.1km walking/running track around site perimeter. Enhancements also to parking and lighting on site.    €50,000      2022    LA    1    Cleggan - Claddaghduff Community Council    Enhancement to surface and surrounds of ballcourt at Cleggan Community Centre    €36,492      2022    LA    1    Kilchreest National School BOM    Development of a car parking facility to allow access to community walking track and pitch area.    €50,000      2022    LA    1    Clonberne Community Centre Co Ltd    Enhancement to access roadway allowing for increased & accessible use of existing community facilities. Associated landscaping works & development of a pollinator area.    €50,000      2022    LA    1    Gort GAA Club    Development of an 850m accessible perimeter walkway around the 20acre site for community use.    €45,000      2022    LA    1    Ahascragh Fohenagh GAA Club    Level existing car park, improvements to site accessibility, drainage, surfacing and lined finish.    €49,500      2022    LA    1    Ballinasloe Rugby Club    Develop a walking track around the perimeter of their site encompassing two pitches.    €32,400      2022    LA    1    Clontuskert Community Development Group    Resurfacing and lining of parking area, upgrade to lighting, painting of building facade, heating system upgrade, seating & garden area    €30,267      2022    LA    1    Ionad Oideachas Pobail Glinnsce & Caiseal    Development of safe accessible parking facilities at the education centre.    €27,000      2022    LA    1    Galway County Council    Enhancements to the community playground in Portumna    €36,473      2022    LA    1    Skehana Community Development (SCD)    Upgrade of the current car parking at the Skehana Community Facility which is home to 5 rural sports clubs. Significant biodiversity element to project.    €50,000      2022    LA    1    Killyan Community Field    Upgrades to include works on walkway and lighting around perimeter of pitches. Plans also include improvements to site drainage and installation of seating area    €45,000      2022    LA    1    Collins Park Playground Committee    To enhance facilities at the community playground. Fit accessible play equipment to enhance inclusivity. Provision for playground maintenance also included in plans.    €18,904      2022    LA    1    Donaghpatrick National School    Development of a community walkway and small playground on the school grounds which will be accessible to the wider community.    €50,000      2022    Group    2    Galway Hospice    Purchase of a Vehicle    €36,384      2022    Group    2    Galway Mountain Rescue Team    Purchase and conversion of a Van    €70,501      2022    Group    2    Irish Wheelchair Association Tuam    Purchase of fully wheelchair accessible bus    €54,427      2022    Group    2    Forum Connemara    Vehicle    €45,348      2022    Group    2    Irish Red Cross - (Lough Mask Lake Rescue)    Purchase of Rescue boat    €30,000      2022    Group    3    Coiste Chomhlacht Forbartha Inis Meáin    Purchase of a plug-in hybrid minibus, PV panels, and a plug-in charging point    €114,147      2022    Group    3    Inis Oírr Comhar Caomhán Teo    Enhancement of existing public toilets facilities and associated Litter/recycling infrastructure    €56,815      2022    Group    3    Comharchumann Forbartha Árann    Purchase raised beds, signage, equipment, bins, picnic table, seating and CCTV    €43,098                     €1,063,583      2023    Group    2    Coiste Spreagadh na nAosach Carna    Wheelchair accessible bus    €80,159      2023    Group    2    Brothers of Charity    Passenger Vehicle    €29,600      2023    Group    2    Irish Red Cross    One panel van based ambulance    €50,000      2023    Group    2    Irish Red Cross    Purchase van to convert to wheelchair enabled patient transport minibus    €45,000      2023    LA    1    East Galway United Community Development Group    Develop car parking facilities to include disabled access & toilet facilities    €50,000      2023    LA    1    Portumna GAA Club    Construction of Spectator Stand    €50,000      2023    LA    1    Beagh GAA    Upgrades at community centre    €50,000      2023    LA    1    Killimor GAA    Spectator stand upgrade    €45,000      2023    LA    1    Tommy Larkins (Woodford)    Upgrade of lighting    €43,184      2023    LA    1    St Brendans GAA, Ballygar    Lighting of walking way around community pitches    €50,000      2023    LA    1    Tynagh Abbey Duniry Hurling Club    Provision of external and Internal Public Toilets in Tynagh Abbey Duniry Community Centre    €50,000      2023    LA    1    Ballinakill, Leitir Mealláin- Amenity Viewing Area    Improves access to area of natural beauty. Upgrading an existing pull-in area    €21,942      2023    LA    1    Dunmore NS    Development of walking track and sensory garden    €50,000      2023    LA    1    Ballinakill National School, Loughrea    Upgrading Tennis Court to Astro turf and upgrade of lighting.    €50,000      2023    LA    1    Milltown Community Council Ltd    Construction of a walk/cycle way on riverbank between the village and the local sportsground    €50,000      2023    LA    1    Ballinasloe Social Services    Upgrade kitchen facilities in community centre    €50,000      2023    LA    1    Comhar Chuigéal Teoranta Comhar Chuigéal (Leitir Mealláin) Teoranta,    Forbairt Halla Pobail Leitir Mealláin & Oibreacht sláinte agus Sabháilteachta ar an bPáirc Spraoi.    €41,027      2023    LA    1    Caltra National School    Upgrading Tennis Court to Astro turf and upgrade of lighting    €42,278      2023    Group    3    Cleas CTR    Vehicle    €51,467      2023    Group    3    Comharcumann Frobartha Arann    Seating area at beach with blue flag    €45,000      2023    Group    3    Comharcumann Frobartha Arann    Reference Library    €28,467                     €973,124      2024    Group    2    Ballinasloe Social Services    Social Services Centre, Brackernagh, Ballinasloe    €23,440      2024    Group    2    Ability West    Blackrock House, Salthill, Galway Portumna    €35,424      2024    LA    1    Scoil Mhuire Gan Smal - Ballygar National School    Deliver a MUGA within existing boundaries    €50,000      2024    LA    1    Kilchreest National School Board of Management    Complete additonal 450m of walking track    €50,000      2024    LA    1    Roundstone Community Development Council Ltd (Playground Committee)    Enhance village centre playgourd    €50,000      2024    LA    1    Williamstown Development Company CLG, Supported by Williamstown GAA Club & National School    Walkway enhancements with lighting, sensory garden and landscaping.    €50,000      2024    LA    1    Clonberne Community Centre Co Ltd & SNO Club (Special Needs +Others)    Playground enhancements    €50,000      2024    LA    1    Moylough Parish Sports Field    Upgrade to Moylough Playground    €50,000      2024    LA    1    Leenane Development Association CLG    Install Sensory play equipment around the internal accessible paths of the Leenane Community Park    €45,000      2024    LA    1    Dunmore Tidy Towns & Galway County Council    Upgrade and enhance Dunmore River Walk    €50,000      2024    LA    1    Clontuskert Community Development Group    Upgrade and refurbishment of community rooms and changing facilities at local community pitch    €45,000      2024    LA    1    Killimordaly Community Centre CLG    Small Scale Renovation and Roof Repairs to existing Community Centre    €50,000      2024    LA    1    Killererin Community Council    Small Scale Community Centre renovation    €49,456      2024    LA    1    Woodford Parish Development    Village centre community playground and additional seating    €50,000      2024    LA    1    Esker Committee Centre    Small scale renovations (lighting and internal thermal upgrades)    €48,262      2024    LA    1    Kilconly Community Recreational Group    Add 1 x Tennis Court and 1 x Basketball    €44,730      2024    LA    1    Gort Community Playground    Install a net climbing frame    €42,307                     €783,619    ",
        "questionType": "written",
        "house": {
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "to": {
          "roleCode": null,
          "roleType": null,
          "showAs": "Rural",
          "uri": null
        }
      },
      "contextDate": "2024-10-23"
    },
    {
      "question": {
        "by": {
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03",
          "showAs": "Anne Rabbitte"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-23/writtens/dbsect_260",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-23/writtens/mul@/dbsect_260.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_260",
          "showAs": "Departmental Funding"
        },
        "showAs": " 222. Deputy Anne Rabbitte asked the Minister for Rural and Community Development the projects in east Galway that have been approved for funding under the community centre investment fund, for the years 2022, 2023 and the year to date; and if she will make a statement on the matter. [43444/24] ",
        "questionNumber": 222,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-23/pq_222",
        "date": "2024-10-23",
        "answerText": " Minister for Rural and Community Development  Under the 2022 Community Centre Investment Fund, almost €46 million was committed for the improvement and refurbishment of existing community centres across Ireland. There was a huge uptake of this funding and over 860 different projects are being delivered in centres the length and breadth of the country. I am happy to confirm that 61 projects totalling over €4.2 million were approved in Galway. These are outlined in the table at the link below.  In 2023, the focus of the Community Centres Investment Fund moved to new builds. Earlier this year, funding of €30 million was approved for the construction of 12 new community centres covering nine counties. County Galway had two successful projects under this fund. Áras Lae, Maigh Cuilinn has been approved €6 million in grant aid and Newcastle Community Centre in Galway City was approved for over €4.3 million. Again, these are outlined in the table at the link.  The Community Centre Investment Fund 2024 will provide funding towards capital costs for the refurbishment of existing community centres. The window for applying for the scheme closed in early September. These applications are currently being assessed and I expect to begin announcing successful projects before the end of the year.   Community Centre Investment Fund Co. Galway  ",
        "questionType": "written",
        "house": {
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "to": {
          "roleCode": null,
          "roleType": null,
          "showAs": "Rural",
          "uri": null
        }
      },
      "contextDate": "2024-10-23"
    },
    {
      "question": {
        "by": {
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03",
          "showAs": "Anne Rabbitte"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-23/writtens/dbsect_261",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-23/writtens/mul@/dbsect_261.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_261",
          "showAs": "Departmental Funding"
        },
        "showAs": " 223. Deputy Anne Rabbitte asked the Minister for Rural and Community Development the projects in east Galway that have been approved for funding under LEADER; the amount funding, for the years 2020, 2021, 2022, 2023, and the year to date, in tabular form; and if she will make a statement on the matter. [43445/24] ",
        "questionNumber": 223,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-23/pq_223",
        "date": "2024-10-23",
        "answerText": " Minister for Rural and Community Development  The LEADER Programme is a key intervention of Our Rural Future, the Government’s Policy for rural development, which aims to deliver a range of actions to rural communities over the lifetime of the policy. It supports a broad range of activities that aim to respond to the diversity of the local needs of our rural areas.  From 2020 to 31st December 2023, 151 projects with a value of over €4.5 million were approved for funding by Galway Rural Development, the Local Action Group (LAG) under the 2014-2022 LEADER programme in east Galway. This programme closed for approvals at the end of 2023.  The 2023-2027 LEADER programme has now commenced in east county Galway. The LAG is in the early stages of implementation, which involves engaging with the communities and working with them to develop their project proposals. As such, there have been no projects approved to date in 2024 under the new programme but I look forward to seeing progress in this area over the coming months.  Details of all projects approved under the 2014-2022 LEADER programme by the LAG operating in east Galway and the funding allocated to them is available on my Department’s website at: www.gov.ie/en/publication/b849be-local-action-groups-approved-projects-2014-2020/ ",
        "questionType": "written",
        "house": {
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "to": {
          "roleCode": null,
          "roleType": null,
          "showAs": "Rural",
          "uri": null
        }
      },
      "contextDate": "2024-10-23"
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 194,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_194",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_171",
          "showAs": "Public Transport",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_171",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_171.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Transport  Under Budget 2025, funding has been allocated to the Department of Transport to provide for free public transport for children aged 5 to 8 years. Free travel for all children under-fives on subsidised public transport services was introduced in 2017, and this new measure now extends that to include children aged between 5 and 8 years of age.  The extension will be introduced next year, with a lead time involved to allow for the necessary technical changes required to facilitate the implementation of this change to child fares. Similar to the previous fare initiatives this measure marks another step towards making sustainable transport a more affordable option for more families. ",
        "showAs": " 194. Deputy Anne Rabbitte asked the Minister for Transport when free travel for children under nine years of age, announced in Budget 2025, will come into effect; and if he will make a statement on the matter. [42786/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Anne Rabbitte",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03",
          "memberCode": "Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 421,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_421",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_385",
          "showAs": "Fire Service",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_385",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_385.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 421, 422 and 431 together.  The provision of a fire service in its functional area, including the establishment and maintenance of a fire brigade, the assessment of fire cover needs and the provision of fire station premises, is a statutory function of individual fire authorities under the Fire Services Act 1981 & 2003. My Department supports the fire authorities through setting general policy, providing a central training programme, issuing guidance on operational and other related matters and providing capital funding for priority infrastructural projects.  In December 2020, I announced the Fire Services Capital Programme for the period 2021-2025, with a funding allocation of €61m. Following extensive engagement with fire authorities, a number of proposals for station works etc. were received. The proposals were evaluated and prioritised on the basis of the:  Area Risk Categorisation of the fire station (population, fire risks, etc.);  established Health and Safety needs;  state of development of the project;  value for money offered by the proposal; and  the totality of requests from all authorities.  The 2021 - 2025 Programme was projected to see six new fire stations built, continued support for the construction of a further 12 new fire stations, nine fire station refurbishments as well as the allocation of 35 new fire appliances. Continued investment in the fire appliance fleet has been identified as a key national priority; that is why, in October 2023, I announced the allocation of an additional 40 new fire appliances at a cost of €20.8m.  My Department has not received a proposal from Galway County Council for a fire station project for Portumna. Any future capital programme will have regard to Galway County Council’s priorities and the totality of requests from fire authorities countrywide for funding in considering any proposal.  Two fire stations, Athenry and Loughrea, prioritised by Galway County Council, have been included in the 2021 – 2025 Capital programme.  Athenry fire station received approval to accept a tender for construction with a projected build cost of €2.48 million in November 2022. I understand construction of this project is now complete with an expected official opening ceremony to take place in November 2024.  In October 2021, Galway County Council received approval to proceed to invite tenders to appoint a design team and progress to full design and cost plan stage for a new fire station at Loughrea at an indicative build cost projected - at that time - of €1.26 million. I understand the Council is currently at planning stage of this project.  In the lifetime of the 2021 – 2025 Fire Services Capital Programme, to date Galway Fire Service has received €1.233 million in capital funding to support the purchase of front-line appliances and equipment including funding for the allocation of a new Class B fire tender under the 2021 – 2023 Office of Government Procurement (OGP) framework.  Galway Fire Service has also received funding approval for approximately €2.2 million to support the planned purchase of appliances and equipment as detailed below, including a new 42m aerial appliance and a further allocation of two new Class B fire tenders under the 2023 – 2025 OGP Framework. My Department awaits claims for payment from Galway County Council in this regard.       Application Number    Category    Description      2024-13    App & Equip    Mid-Sized replacement fire appliance (Inis Mór)      2024-23    App & Equip    Replacement Incident Command Unit      2024-25    App & Equip    Remotely Operated Vehicle (Transport Support)      2024-26    App & Equip    Remotely Operated Vehicle (ROV) Remote Detection Equipment      2023-17    App & Equip    42m High Reach Aerial Appliance      2023-103    App & Equip    Trailer mounted lighting units x3      2023-104    App & Equip    Battery Operated Rescue Tools Sets x13      2023-110    App & Equip    Diesel Engine Truck      2023-124    App & Equip    6 Ramfan EX50-Li plus chargers      2023-130    App & Equip    Support Van (Inis Mór)      2023-75    App & Equip    2023 - 2025 Class B OGP Framework      2023-78    App & Equip    2023 - 2025 Class B OGP Framework        ",
        "showAs": " 421. Deputy Anne Rabbitte asked the Minister for Housing, Local Government and Heritage to provide details for all capital plans for the development of fire services in Galway; and if he will make a statement on the matter. [43423/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Anne Rabbitte",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03",
          "memberCode": "Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 422,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_422",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_385",
          "showAs": "Fire Service",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_385",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_385.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 421, 422 and 431 together.  The provision of a fire service in its functional area, including the establishment and maintenance of a fire brigade, the assessment of fire cover needs and the provision of fire station premises, is a statutory function of individual fire authorities under the Fire Services Act 1981 & 2003. My Department supports the fire authorities through setting general policy, providing a central training programme, issuing guidance on operational and other related matters and providing capital funding for priority infrastructural projects.  In December 2020, I announced the Fire Services Capital Programme for the period 2021-2025, with a funding allocation of €61m. Following extensive engagement with fire authorities, a number of proposals for station works etc. were received. The proposals were evaluated and prioritised on the basis of the:  Area Risk Categorisation of the fire station (population, fire risks, etc.);  established Health and Safety needs;  state of development of the project;  value for money offered by the proposal; and  the totality of requests from all authorities.  The 2021 - 2025 Programme was projected to see six new fire stations built, continued support for the construction of a further 12 new fire stations, nine fire station refurbishments as well as the allocation of 35 new fire appliances. Continued investment in the fire appliance fleet has been identified as a key national priority; that is why, in October 2023, I announced the allocation of an additional 40 new fire appliances at a cost of €20.8m.  My Department has not received a proposal from Galway County Council for a fire station project for Portumna. Any future capital programme will have regard to Galway County Council’s priorities and the totality of requests from fire authorities countrywide for funding in considering any proposal.  Two fire stations, Athenry and Loughrea, prioritised by Galway County Council, have been included in the 2021 – 2025 Capital programme.  Athenry fire station received approval to accept a tender for construction with a projected build cost of €2.48 million in November 2022. I understand construction of this project is now complete with an expected official opening ceremony to take place in November 2024.  In October 2021, Galway County Council received approval to proceed to invite tenders to appoint a design team and progress to full design and cost plan stage for a new fire station at Loughrea at an indicative build cost projected - at that time - of €1.26 million. I understand the Council is currently at planning stage of this project.  In the lifetime of the 2021 – 2025 Fire Services Capital Programme, to date Galway Fire Service has received €1.233 million in capital funding to support the purchase of front-line appliances and equipment including funding for the allocation of a new Class B fire tender under the 2021 – 2023 Office of Government Procurement (OGP) framework.  Galway Fire Service has also received funding approval for approximately €2.2 million to support the planned purchase of appliances and equipment as detailed below, including a new 42m aerial appliance and a further allocation of two new Class B fire tenders under the 2023 – 2025 OGP Framework. My Department awaits claims for payment from Galway County Council in this regard.       Application Number    Category    Description      2024-13    App & Equip    Mid-Sized replacement fire appliance (Inis Mór)      2024-23    App & Equip    Replacement Incident Command Unit      2024-25    App & Equip    Remotely Operated Vehicle (Transport Support)      2024-26    App & Equip    Remotely Operated Vehicle (ROV) Remote Detection Equipment      2023-17    App & Equip    42m High Reach Aerial Appliance      2023-103    App & Equip    Trailer mounted lighting units x3      2023-104    App & Equip    Battery Operated Rescue Tools Sets x13      2023-110    App & Equip    Diesel Engine Truck      2023-124    App & Equip    6 Ramfan EX50-Li plus chargers      2023-130    App & Equip    Support Van (Inis Mór)      2023-75    App & Equip    2023 - 2025 Class B OGP Framework      2023-78    App & Equip    2023 - 2025 Class B OGP Framework        ",
        "showAs": " 422. Deputy Anne Rabbitte asked the Minister for Housing, Local Government and Heritage the status of the Portumna fire station; and if he will make a statement on the matter. [43415/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Anne Rabbitte",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03",
          "memberCode": "Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 431,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_431",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_385",
          "showAs": "Fire Service",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_385",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_385.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 421, 422 and 431 together.  The provision of a fire service in its functional area, including the establishment and maintenance of a fire brigade, the assessment of fire cover needs and the provision of fire station premises, is a statutory function of individual fire authorities under the Fire Services Act 1981 & 2003. My Department supports the fire authorities through setting general policy, providing a central training programme, issuing guidance on operational and other related matters and providing capital funding for priority infrastructural projects.  In December 2020, I announced the Fire Services Capital Programme for the period 2021-2025, with a funding allocation of €61m. Following extensive engagement with fire authorities, a number of proposals for station works etc. were received. The proposals were evaluated and prioritised on the basis of the:  Area Risk Categorisation of the fire station (population, fire risks, etc.);  established Health and Safety needs;  state of development of the project;  value for money offered by the proposal; and  the totality of requests from all authorities.  The 2021 - 2025 Programme was projected to see six new fire stations built, continued support for the construction of a further 12 new fire stations, nine fire station refurbishments as well as the allocation of 35 new fire appliances. Continued investment in the fire appliance fleet has been identified as a key national priority; that is why, in October 2023, I announced the allocation of an additional 40 new fire appliances at a cost of €20.8m.  My Department has not received a proposal from Galway County Council for a fire station project for Portumna. Any future capital programme will have regard to Galway County Council’s priorities and the totality of requests from fire authorities countrywide for funding in considering any proposal.  Two fire stations, Athenry and Loughrea, prioritised by Galway County Council, have been included in the 2021 – 2025 Capital programme.  Athenry fire station received approval to accept a tender for construction with a projected build cost of €2.48 million in November 2022. I understand construction of this project is now complete with an expected official opening ceremony to take place in November 2024.  In October 2021, Galway County Council received approval to proceed to invite tenders to appoint a design team and progress to full design and cost plan stage for a new fire station at Loughrea at an indicative build cost projected - at that time - of €1.26 million. I understand the Council is currently at planning stage of this project.  In the lifetime of the 2021 – 2025 Fire Services Capital Programme, to date Galway Fire Service has received €1.233 million in capital funding to support the purchase of front-line appliances and equipment including funding for the allocation of a new Class B fire tender under the 2021 – 2023 Office of Government Procurement (OGP) framework.  Galway Fire Service has also received funding approval for approximately €2.2 million to support the planned purchase of appliances and equipment as detailed below, including a new 42m aerial appliance and a further allocation of two new Class B fire tenders under the 2023 – 2025 OGP Framework. My Department awaits claims for payment from Galway County Council in this regard.       Application Number    Category    Description      2024-13    App & Equip    Mid-Sized replacement fire appliance (Inis Mór)      2024-23    App & Equip    Replacement Incident Command Unit      2024-25    App & Equip    Remotely Operated Vehicle (Transport Support)      2024-26    App & Equip    Remotely Operated Vehicle (ROV) Remote Detection Equipment      2023-17    App & Equip    42m High Reach Aerial Appliance      2023-103    App & Equip    Trailer mounted lighting units x3      2023-104    App & Equip    Battery Operated Rescue Tools Sets x13      2023-110    App & Equip    Diesel Engine Truck      2023-124    App & Equip    6 Ramfan EX50-Li plus chargers      2023-130    App & Equip    Support Van (Inis Mór)      2023-75    App & Equip    2023 - 2025 Class B OGP Framework      2023-78    App & Equip    2023 - 2025 Class B OGP Framework        ",
        "showAs": " 431. Deputy Anne Rabbitte asked the Minister for Housing, Local Government and Heritage the fire services earmarked for development over the next five years in County Galway; the estimated funding associated with each planned development; and if he will make a statement on the matter. [42639/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Anne Rabbitte",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03",
          "memberCode": "Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-10-17",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 147,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-17/pq_147",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_155",
          "showAs": "Bus Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-17/writtens/dbsect_155",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-17/writtens/mul@/dbsect_155.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators.  In light of the NTA's responsibility in this area, I have forwarded the Deputy's query to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "showAs": " 147. Deputy Anne Rabbitte asked the Minister for Transport the plans being considered for increased bus services from Headford to Galway; and if he will make a statement on the matter. [42135/24] ",
        "date": "2024-10-17",
        "by": {
          "showAs": "Anne Rabbitte",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03",
          "memberCode": "Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-10-16",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 52,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-16/pq_52",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_97",
          "showAs": "Transport Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-16/writtens/dbsect_97",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-16/writtens/mul@/dbsect_97.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport.  The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally. The NTA also has national responsibility for integrated local and rural transport, including Local Link services and delivering the Connecting Ireland Rural Mobility Plan.  In light of the NTA's responsibilities for public transport services, including in County Leitrim, I have referred your question to the NTA for direct reply to you. Please advise my private office if you do not receive a reply within ten working days. ",
        "showAs": " 52. Deputy Anne Rabbitte asked the Minister for Transport the estimated cost of expanding the Leitrim integrated transport pilot project to every county; and if he will make a statement on the matter. [41682/24] ",
        "date": "2024-10-16",
        "by": {
          "showAs": "Anne Rabbitte",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03",
          "memberCode": "Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-10-16",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 224,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-16/pq_224",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_273",
          "showAs": "Health Services Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-16/writtens/dbsect_273",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-16/writtens/mul@/dbsect_273.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is an operational matter, involving recruitment and costs, I have asked the Health Service Executive to respond to the Deputy, as soon as possible. ",
        "showAs": " 224. Deputy Anne Rabbitte asked the Minister for Health the estimated cost of hiring 100 nurse specialists across neuro services; and if he will make a statement on the matter. [41683/24] ",
        "date": "2024-10-16",
        "by": {
          "showAs": "Anne Rabbitte",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03",
          "memberCode": "Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-10-16",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 225,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-16/pq_225",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_274",
          "showAs": "Health Services Staff",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-16/writtens/dbsect_274",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-16/writtens/mul@/dbsect_274.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "showAs": " 225. Deputy Anne Rabbitte asked the Minister for Health the estimated cost of increasing the number of consultant neurologists by at least six; and if he will make a statement on the matter. [41684/24] ",
        "date": "2024-10-16",
        "by": {
          "showAs": "Anne Rabbitte",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03",
          "memberCode": "Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-10-16",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 271,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-16/pq_271",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_322",
          "showAs": "Further and Higher Education",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-16/writtens/dbsect_322",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-16/writtens/mul@/dbsect_322.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Further and Higher Education",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  Higher Education Institutions (HEIs) are autonomous institutions responsible for their own academic affairs including the curriculum and student numbers on individual courses. The costs incurred by a HEI in increasing student places on a particular course or establishing an additional course can vary depending on a variety factors including the type of course and the individual circumstances of the relevant HEI.  Where additionally is required on courses or a new course is required, specific engagement with the sector and external stakeholders is very often required. This process allows for a deeper consideration of wider issues such as capacity, staffing, other supports, availability of placements, capital investment in buildings and equipment etc. It is therefore, not possible to definitively calculate the costs sought in the absence of a specific engagement with the sector.  The delivery of healthcare programmes is complex and requires multiple parts of the health and education systems working together.  It should be noted that in recent years there has been a substantial expansion of therapy and key healthcare places in Higher Education Institutions in Ireland. In July, Government approved the prioritisation of funding to support the expansion of training places in priority healthcare areas including Speech and Language Therapy and Occupational Therapy, as well as Physiotherapy.  This will contribute to delivering expansion in the region of 35% in these vital disciplines over the next two academic years. Additional places commencing in September 2024 include expanded intakes on Speech and Language Therapy, Occupational Therapy and Podiatric Medicine programmes in University of Galway, Physiotherapy in RCSI and the introduction of an undergraduate Occupational Therapy programme in University of Limerick.  Additionality delivered in recent years has seen over 460 permanent new higher education healthcare places created in September 2023 in Irish HEIs, and further capacity created in Northern Ireland, where an additional 80 places in allied healthcare disciplines in Ulster University in September 2023 were created for students from this jurisdiction. These places include 28 in Occupational Therapy and 10 in Speech and Language Therapy.  It is a priority for government that the mental health needs of adults and children are also being met and efforts are ongoing in order to increase the amount of psychologists both in clinical and education settings. As part of these efforts, funding was secured in Budget 2023 by the Department of Health to provide for sponsorship for Clinical and Counselling trainee Psychologist PhD programmes. This arrangement is not the responsibility of my Department, but the Department of Health and the HSE.  The Department of Education has been examining how it can continue to recruit adequate numbers of suitably qualified Educational Psychologists and continue to respond to the educational psychological needs of children in recognised primary and post-primary schools across the country.  Since January 2023, the Department of Education has supported bursaries for Trainee Educational Psychologists who are enrolled in the University College Dublin Professional Doctorate in Educational Psychology and Mary Immaculate College Limerick’s Professional Doctorate in Educational and Child Psychology. Those in receipt of a bursary commit to joining NEPS upon graduation. There are over 60 Trainee Educational Psychologists in receipt of a bursary who are expected to join NEPS upon graduation, with an additional 14 to be awarded bursaries from September 2024, bringing the total to 74.  Enhancing student capacity to meet projected workforce demand is a key consideration of workforce planning and is key to enabling further expansion on these programmes. Practice education placements are essential to support clinical skills development and the application of theory to patient care and attainment of regulatory required standards of proficiency where applicable.  Extensive engagement is ongoing between officials in the Department of Further and Higher Education, Research, Innovation and Science, and officials in the Department of Health, as well as the HSE and higher education sector. Work is underway on the oversight and infrastructure for clinical placements to enable further expansion. ",
        "showAs": " 271. Deputy Anne Rabbitte asked the Minister for Further and Higher Education, Research, Innovation and Science the estimated cost of expanding course places on an annual basis across physiotherapy, speech and language therapy, occupational therapy and psychology by 50 places per course per relevant higher education institution; and if he will make a statement on the matter. [41685/24] ",
        "date": "2024-10-16",
        "by": {
          "showAs": "Anne Rabbitte",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03",
          "memberCode": "Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-10-03",
      "question": {
        "by": {
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03",
          "showAs": "Anne Rabbitte"
        },
        "questionNumber": 70,
        "questionType": "written",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to Active Travel. Funding is administered through the National Transport Authority (NTA), who, in partnership with local authorities, have responsibility for the selection and development of specific projects in each local authority area.  Noting the role of the NTA in the matter, I have referred your question to that agency for a more detailed answer. If you do not receive a reply within 10 working days, please contact my private office. ",
        "showAs": " 70. Deputy Anne Rabbitte asked the Minister for Transport the status of active travel plans being considered for Craughwell, County Galway; and if he will make a statement on the matter. [39536/24] ",
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Transport",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "date": "2024-10-03",
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-03/writtens/mul@/dbsect_82.xml"
            },
            "pdf": null
          },
          "showAs": "Active Travel",
          "debateSectionId": "dbsect_82",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-03/writtens/dbsect_82"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-03/pq_70"
      }
    },
    {
      "contextDate": "2024-10-03",
      "question": {
        "by": {
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03",
          "showAs": "Anne Rabbitte"
        },
        "questionNumber": 71,
        "questionType": "written",
        "answerText": " Minister of State at the Department of Transport  I propose to take Questions Nos. 71 and 72 together.  Local Authorities around the country are currently in the process of conducting speed limit reviews on the roads within their jurisdictions. This is in response to the Road Traffic Act 2024 and the planned reduction in default speed limits to establish a safer speed baseline and combat the rising trend of road fatalities and serious injuries.  While default speed limits are set in primary legislation, variations from these defaults through the setting of bye-laws is an important devolved function for Local Authorities. When setting bye-laws, Local Authorities are statutorily required to carry out a speed limit review. Neither I, nor my Department have a role in the reviews. Queries on specific reviews should be directed to the relevant Local Authority. ",
        "showAs": " 71. Deputy Anne Rabbitte asked the Minister for Transport the status of a speed limit review on the R446 at a school (details supplied) in County Galway where the speed limit is currently 80 km/h; and if he will make a statement on the matter. [39537/24] ",
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Transport",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "date": "2024-10-03",
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-03/writtens/mul@/dbsect_83.xml"
            },
            "pdf": null
          },
          "showAs": "Road Safety",
          "debateSectionId": "dbsect_83",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-03/writtens/dbsect_83"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-03/pq_71"
      }
    },
    {
      "contextDate": "2024-10-03",
      "question": {
        "by": {
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03",
          "showAs": "Anne Rabbitte"
        },
        "questionNumber": 72,
        "questionType": "written",
        "answerText": " Minister of State at the Department of Transport  I propose to take Questions Nos. 71 and 72 together.  Local Authorities around the country are currently in the process of conducting speed limit reviews on the roads within their jurisdictions. This is in response to the Road Traffic Act 2024 and the planned reduction in default speed limits to establish a safer speed baseline and combat the rising trend of road fatalities and serious injuries.  While default speed limits are set in primary legislation, variations from these defaults through the setting of bye-laws is an important devolved function for Local Authorities. When setting bye-laws, Local Authorities are statutorily required to carry out a speed limit review. Neither I, nor my Department have a role in the reviews. Queries on specific reviews should be directed to the relevant Local Authority. ",
        "showAs": " 72. Deputy Anne Rabbitte asked the Minister for Transport the status of a speed limit review on the R446 between Cappataggle and Aughrim, County Galway, where the speed limit is currently 80 km/h; and if he will make a statement on the matter. [39538/24] ",
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Transport",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "date": "2024-10-03",
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-03/writtens/mul@/dbsect_83.xml"
            },
            "pdf": null
          },
          "showAs": "Road Safety",
          "debateSectionId": "dbsect_83",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-03/writtens/dbsect_83"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-03/pq_72"
      }
    },
    {
      "contextDate": "2024-10-01",
      "question": {
        "by": {
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03",
          "showAs": "Anne Rabbitte"
        },
        "date": "2024-10-01",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-01/pq_444",
        "answerText": " Minister for Health  As this is an administrative matter for the HSE, the HSE has been asked to respond directly to the Deputy. ",
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 444. Deputy Anne Rabbitte asked the Minister for Health the steps being taken to address a pension abatement liability being faced by a worker (details supplied); and if he will make a statement on the matter. [38575/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_459",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-01/writtens/mul@/dbsect_459.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-01/writtens/dbsect_459",
          "showAs": "Pension Provisions"
        },
        "questionNumber": 444,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2024-09-26",
      "question": {
        "to": {
          "uri": null,
          "showAs": "Education",
          "roleType": null,
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-09-26/pq_155",
        "questionType": "written",
        "date": "2024-09-26",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-26/writtens/dbsect_175",
          "showAs": "School Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-26/writtens/mul@/dbsect_175.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_175"
        },
        "questionNumber": 155,
        "answerText": " Minister for Education  Promoting positive mental health is a priority for the Department of Education and myself as Minister.  The Department’s approach in the Wellbeing Policy is founded on research and best international practice in relation to how schools can best support the wellbeing and mental health of children and young people. The approach proposed is a whole school and preventative approach which has multiple components that include:  • Providing children and young people with opportunities to build core social and emotional skills and competencies  • Providing children and young people with opportunities to experience supportive relationships within the school setting and to learn through those relationships  • Providing children and young people with opportunities to be part of a school environment and culture that feels both physically and psychologically safe, an environment in which children and young people feel a sense of belonging and connectedness, in which they feel their voice is heard, and they feel supported.  • Schools are encouraged to use a reflective, school self-evaluation approach to identify and prioritise the needs of its own school community in relation to the promotion of wellbeing and mental health, and to respond to meeting those needs.  A dedicated wellbeing portal can be accessed via ‘Wellbeing in Education’ on Gov.ie, bringing together all the wellbeing and mental health supports and resources that have been developed by the Department and the Department’s support services.  My Department’s National Educational Psychological Service (NEPS) provides educational psychological support to all primary and post-primary and special schools.  The NEPS service provides access for all schools to:  • Psychological support in the event of a Critical Incident  • A Casework Service for individual children where there is a need for intensive consultation and assessment via a NEPS psychologist or through the Scheme for the Commissioning of Psychological Assessments (SCPA).  • A school staff Support and Development Service, to build school capability to provide a comprehensive continuum of support in schools and  • Ongoing access to advice and support for schools.  This approach allows psychologists to give early attention to urgent individual cases and, through supporting school staff, to benefit many more children than could be seen individually.  NEPS teams offer training and guidance for teachers in the provision of universal and targeted evidence-informed approaches and early intervention to promote children’s wellbeing, social, emotional and academic development. For example, Initiatives such as the Incredible Years Social Emotional learning Programmes and the FRIENDS Resilience Programmes which aim to address anxiety reduction have been welcomed by schools and their impact positively evaluated.  I have also recently announced the publication of a tender to procure services to further support wellbeing and mental health in post-primary schools. The focus will be to strengthen supports and resources available to Student Support Teams to enhance the wellbeing and mental health of young people in the school community, with supports developed for students, parents and school staff. The tender has been awarded and work has commenced on the programme content.  Post-primary schools currently have access to Guidance Counsellors. Counselling is a key part of the role of the Guidance Counsellor, offered on an individual or group basis. The Guidance Counsellor also identifies and supports the referral of students to external counselling agencies and professionals, as required. Each post-primary school currently receives an allocation in respect of guidance provision, calculated by reference to the approved enrolment.  Separately, in June 2023, I was delighted to launch a €5 million pilot of counselling and wellbeing supports in primary schools in selected counties. This pilot will continue to June 2025. Strand 1 sees one-to-one counselling supports being provided to primary schools for the first time in counties Cavan, Laois, Leitrim, Longford, Mayo, Monaghan, and Tipperary. Strand 2 of the pilot is the establishment of a new type of support to schools from Education Wellbeing Teams and involves the introduction of Education Wellbeing Practitioners to provide enhanced in-school supports for a cluster of primary schools in Cork, Carlow, Dublin 7, and Dublin 16. All of which supplements the mental health supports which are offered by the HSE throughout the country. ",
        "house": {
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseNo": "33",
          "showAs": "33rd Dáil"
        },
        "showAs": " 155. Deputy Anne Rabbitte asked the Minister for Education the funding for mental health/counselling support provided to a school (details supplied); the number of hours this translates to; and if she will make a statement on the matter. [38304/24] ",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03",
          "showAs": "Anne Rabbitte",
          "memberCode": "Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_77.xml"
            }
          },
          "debateSectionId": "dbsect_77",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_77",
          "showAs": "Energy Conservation"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_84",
        "to": {
          "roleType": null,
          "showAs": "Environment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 84,
        "showAs": " 84. Deputy Anne Rabbitte asked the Minister for the Environment, Climate and Communications the total funding utilised in County Galway for SEAI grants, by type of grant, in each of the years 2020 to 2023 and to date in 2024, in tabular form; and if he will make a statement on the matter. [32019/24] ",
        "answerText": " Minister for the Environment, Climate and Communications  The Sustainable Energy Authority of Ireland (SEAI) manage a range number programmes across energy efficiency, renewable energy, innovation and integration. The administration and management of grant applications under these schemes are an operational matter for the SEAI.  The specific data requested by the Minister is not routinely supplied by SEAI to my Department. I have directed SEAI to reply directly to the Minister with the data requested for Co. Galway, in so far as it is available, as soon as possible.  SEAI has established a specific email address for queries from Oireachtas members so that such queries can be addressed promptly, in line with SEAI’s objective to deliver services to the highest standards. The email address is oireachtas@seai.ie. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Anne Rabbitte",
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_93.xml"
            }
          },
          "debateSectionId": "dbsect_93",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_93",
          "showAs": "National Broadband Plan"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_101",
        "to": {
          "roleType": null,
          "showAs": "Environment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 101,
        "showAs": " 101. Deputy Anne Rabbitte asked the Minister for the Environment, Climate and Communications if and when he has engaged with the Minister for Tourism, Culture, Arts, Gaeltacht, Sport and Media regarding the number of households in rural Ireland effected by lack of access to broadband through the National Broadband Plan, and in turn are unable to access a service (details supplied); and if he will make a statement on the matter. [32786/24] ",
        "answerText": " Minister for the Environment, Climate and Communications  Ireland's Digital Connectivity Strategy, published by my Department, sets ambitious targets, which include providing a Gigabit network to all households and businesses in Ireland by 2028 and access to 5G in all populated areas by 2030.  The target that all premises in the State will have access to gigabit broadband by 2028 is on track and will be met through a combination of commercial investment and state funding. There are 2.5m premises in the State and about 77% now have access to a broadband speed of 1 Gigabit or more.  National Broadband Ireland (NBI) is currently rolling out a high speed and future-proofed broadband network. The intervention area covers over 1.1 million people living and working in over 560,000 premises, including almost 100,000 businesses and farms along with some 672 schools.  NBI are connecting circa 4,000 homes each month and expect to have passed in excess of 300,000 premises by the end of 2024.  I am advised by NBI that over 266,900 premises are passed across 26 counties and available for immediate connection. Furthermore, over 88,300 premises are already connected to the National Broadband Plan’s high-speed broadband network.  The network rollout for the National Broadband Plan (NBP) is divided into 227 (DAs) across the country. These typically measure approximately 25km in radius and cover 96% of Ireland’s landmass. The network is specifically designed based on the NBI network coming from the eir exchanges or the metropolitan area networks (MANs) which allows NBI to reach every premises quickly.  NBI also has a dedicated email address, reps@nbi.ie, which can be used by Oireachtas members for specific queries.  Along with the NBP intervention contract, progress is being made by commercial operators in expanding their next generation networks throughout the State and ensuring the targets set out in the Digital Connectivity Strategy are achieved. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Anne Rabbitte",
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_203.xml"
            }
          },
          "debateSectionId": "dbsect_203",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_203",
          "showAs": "Road Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_216",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 216,
        "showAs": " 216. Deputy Anne Rabbitte asked the Minister for Transport the total funding provided to Galway County Council for roads, broken down per municipal area in each year since 2020 to date, in tabular form; and if he will make a statement on the matter. [32033/24] ",
        "answerText": " Minister for Transport  In accordance with the provisions of Section 13 of the Roads Act 1993, each local authority has statutory responsibility for the improvement and maintenance of their regional and local roads. Works on those roads are funded from local authorities' own resources and are supplemented by State Road grants. The initial selection and prioritisation of works to be funded is a matter for the local authority.  Details of the regional and local road grant allocations and payments to local authorities are outlined in the regional and local road allocations and payments booklets which are available on the Oireachtas Digital Library. Decisions regarding allocations to individual Municipal Districts are a matter for each local authority, taking into account the funding available to it from local and State sources as well as its particular priorities.  Regarding national roads, as Minister for Transport I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Road Acts 1993-2015 and in line with the National Development Plan (NDP), the planning, design, construction, operation and management of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals. In this context, TII is best placed to advise you.  Noting the above position, I have referred your question to TII for a direct reply. Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Anne Rabbitte",
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_237.xml"
            }
          },
          "debateSectionId": "dbsect_237",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_237",
          "showAs": "Public Transport"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_249",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 249,
        "showAs": " 249. Deputy Anne Rabbitte asked the Minister for Transport the number of public transport services established from 2020 to 2024 to date in County Galway; the funding required to enable delivery of same; and if he will make a statement on the matter. [32784/24] ",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators.  In light of the NTA’s responsibility in this area, I have forwarded the Deputy's request to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Anne Rabbitte",
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_419.xml"
            }
          },
          "debateSectionId": "dbsect_419",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_419",
          "showAs": "Public Sector Pensions"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_468",
        "to": {
          "roleType": null,
          "showAs": "Public Expenditure",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 468,
        "showAs": " 468. Deputy Anne Rabbitte asked the Minister for Public Expenditure, National Development Plan Delivery and Reform if a person who has served in the Defence Forces for less than 21 years and has taken a position within the public service can have their pension contributions transferred to the single pension scheme in their new position; and if he will make a statement on the matter. [31262/24] ",
        "answerText": " Minister for Public Expenditure, National Development Plan Delivery and Reform  In answering the Deputy's question, it is assumed that the scenario outlined applies to an individual who has retired or resigned from a role in the Defence Forces, in which they were a member of a pre-existing public service pension scheme, and who has now accepted another public service role, where membership of the Single Public Service Pension Scheme applies. It should be noted that, in this scenario, the gap between both employments should be 26 weeks or more for Single Scheme membership to apply in the person's new employment, as per Section 10 of the Public Service Pensions (Single Scheme and Other Provisions) Act 2012. If the gap is less than this, the individual has a right to continue in a relevant pre-existing pension scheme.  The transfer of retirement benefits accrued under pre-existing public service pension schemes into the Single Scheme is not permitted. However, a person retains their right to preserved benefits in a pre-existing public service pension scheme, which should be made available to them at preserved pension age, subject to that scheme's rules and regulations. The individual would also continue to accrue Single Scheme benefits, which will be payable to them on their retirement.  Where a person is currently in receipt of a public service pension and subsequently accepts another salaried role in the public service, their pension payment may be subject to abatement by their employer, as per Section 52 of the Single Scheme Act. Upon subsequent retirement, the individual will receive payment of their pre-existing public service pension in full, in addition to payment of their Single Scheme entitlements from their most recent employment.  If the individual had been a member of the Single Scheme in the Defence Forces and subsequently attained another role in the public service, they would simply continue accruing benefits within the Single Scheme. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Anne Rabbitte",
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_540.xml"
            }
          },
          "debateSectionId": "dbsect_540",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_540",
          "showAs": "School Accommodation"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_594",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 594,
        "showAs": " 594. Deputy Anne Rabbitte asked the Minister for Education further to Parliamentary Question No. 333 of 14 May 2024, if the stage 2B report, under review from both a financial and technical perspective, has concluded (details supplied); if so, the outcome of said review; when a decision on the matter will issue; the next steps in the process; and if she will make a statement on the matter. [30990/24] ",
        "answerText": " Minister for Education  As the Deputy is aware, the school in question was approved to enter the department’s pipeline of school buildings under my department's Additional Schools Accommodation (ASA) Scheme to provide a mainstream classroom and a special education tuition room.  The stage 2B architectural report was submitted to my department and is nearing completion of its required financial and technical review. My department is committed to ensuring appropriate accommodation is available for the pupils in the school referred to by the Deputy and will ensure that this school's project as for all projects on our school building programme is subject to the due diligence required under the public Infrastructure Guidelines. My department is also required to manage the timing, scope and cost of individual projects to remain within budgetary parameters for the overall programme – this involves constant review throughout the project lifecycle.  My department will be in contact with the school directly on the outcome of this review.  The current status of all projects is listed on a county by county basis at www.gov.ie and this is updated on a regular basis to reflect  project progress through the various stages of capital appraisal, site acquisition, design, planning, tender and construction. Since 2020, my department has invested in the region of €4.9 billion in our schools throughout the country, involving the completion of over 900 school building projects and with construction currently underway at approximately 300 other projects, which includes 30 new school buildings. These 300 projects currently at construction involve a total State investment of over €1.2bn. This is a record level of investment in school buildings. It will expand the number of school places, significantly increase provision for special education and upgrade and modernise our school infrastructure.  The impact of this will be felt in communities right around the country.  The Department’s approach is to maximise the usage of existing capacity in the school estate and, in tandem with this, to manage the progression of the existing pipeline of projects within available budgets and in line with the Government’s Infrastructure Guidelines. This allows the Department to keep a strong focus on the provision of additional capacity to cater for demographics, new housing developments and the rollout of additional special classes for children with additional needs. The Department’s Modular Accommodation Programme is also used to provide additional capacity in the school estate to meet urgent requirements. The Department has always operated a tightly prioritised approach to the school building programme, focused over recent years on the delivery of additional capacity where required, and this will continue to be the case. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Anne Rabbitte",
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_608.xml"
            }
          },
          "debateSectionId": "dbsect_608",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_608",
          "showAs": "Schools Building Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_674",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 674,
        "showAs": " 674. Deputy Anne Rabbitte asked the Minister for Education the status of the emergency works application for a school (details supplied); the status of its new-build application; and if she will make a statement on the matter. [31898/24] ",
        "answerText": " Minister for Education  In relation to the application for the new school building, -  I can confirm that my Department is in receipt of an application for a new school building under the Additional School Accommodation (or ASA) scheme, from the school in question.  The purpose of my Department’s Additional School Accommodation (or ASA) scheme is to ensure that essential mainstream classroom accommodation and accommodation for pupils with special education needs is available to cater for pupils enrolled each year, where the need cannot be met by the school’s existing accommodation or at other schools in the area.  The Department has to prioritise its limited capital resources, in the context both of the ongoing requirement for additional school places, including SEN places, and the high construction inflation which has significantly impacted on the cost of projects that we must deliver.  Since 2020, my Department has invested in the region of €4.9 billion in our schools, involving the completion of over 900 school building projects and with construction currently underway at approximately 300 other projects, which includes 30 new school buildings. These 300 projects currently at construction involve a total State investment of over €1.2bn.  In Co Galway alone, since 2020, the Department has invested over €155 million in school infrastructure and completed 65 school building projects.  This significant investment is intended to allow us to move forward with certainty on modernising our school infrastructure with a real focus on sustainability, for school communities across Ireland.  The strengthened focus on refurbishment of existing school stock will have different strands and will include a deep-energy retrofit programme in support of our 2030 and 2050 Climate Action Goals.  Officials in my Department have engaged with the school to determine immediate accommodation needs which can be delivered through the additional accommodation scheme.  When a decision has been made regarding this application, it will be communicated to the school authority directly.  Regarding Emergency Works, the school to which the Deputy refers applied for multiple categories on one application and also did not provide cost breakdowns for the works contained therein, both of which were in breach of the Emergency Works Scheme (EWS) guidelines. The EWS team have been in contact with the school’s Principal highlighting that the original application which was submitted had a costing which was excessive and also contravened Procurement guidelines.  The Principal was provided with a clear pathway of how to apply for all the works with the least amount of costs to the school. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Anne Rabbitte",
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_620.xml"
            }
          },
          "debateSectionId": "dbsect_620",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_620",
          "showAs": "Schools Building Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_685",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 685,
        "showAs": " 685. Deputy Anne Rabbitte asked the Minister for Education the funding provided for school building projects in Galway, including brief details of each project, in each year since 2020, in tabular form; and if she will make a statement on the matter. [32020/24] ",
        "answerText": " Minister for Education  Since 2020, my department has invested in the region of €4.9 billion in our schools throughout the country, involving the completion of over 900 school building projects and with construction currently underway at approximately 300 other projects, which includes 30 new school buildings. These 300 projects currently at construction involve a total State investment of over €1.2bn.  I also announced earlier in the year that close to 90 projects, including 28 new school buildings, would be authorised to proceed from tender stage to construction over the course of 2024 and early 2025. In total, around €800 million will be invested in these projects under the department’s Large Scale Capital Programme and Additional Accommodation Scheme for essential classroom accommodation.  Between projects currently under construction and projects moving to construction in this latest phase, investments by the Department of Education are adding over 550,000 square metres of new and modernised capacity to our school estate.  This is a record level of investment in school buildings. It will expand the number of school places, significantly increase provision for special education and upgrade and modernise our school infrastructure. The impact of this will be felt in communities right around the country.  The key drivers of capital investment in the schools sector include:  • demographic growth, particularly at post primary level  • increased demand for special educational needs provision  • alignment of school place provision with new housing development  • climate action objectives including deep energy retrofit.  Since 2020, in the region of€155 million has been invested in Co. Galway schools. Of this over €147 million relates to investment under the school building programme.  Between 2020 to date 65 school building projects have been completed in Co. Galway, including 3 new schools.  Currently there are 19 school building projects under construction in Co. Galway, including 1 new school.  There are also 85 school building projects (Large Scale/ASA/Modular) in Co. Galway moving through the various stages of design, of which 16 are new school projects.  These projects are being delivered to ambitious timeframes, and the position on individual projects evolves all the time as they advance through various stages. The status of all projects is set out at (www.gov.ie) . This is updated on a regular basis to reflect project progress through the various stages of capital appraisal, site acquisition, design, tender and construction.  The table below provides details of yearly investment in the School Building Programme in Co. Galway from 2020 to date.  Capital Expenditure on School Building Projects in Co. Galway     2020 (€m)    2021(€m)    2022(€m)    2023(€m)    2024(€m)    Total (€m)      32    28    27    38    22    147    ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Anne Rabbitte",
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_621.xml"
            }
          },
          "debateSectionId": "dbsect_621",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_621",
          "showAs": "School Equipment"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_686",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 686,
        "showAs": " 686. Deputy Anne Rabbitte asked the Minister for Education the funding provided for the installation of solar panels on schools in Galway in each year since 2020, in tabular form; and if she will make a statement on the matter. [32021/24] ",
        "answerText": " Minister for Education  The first phase of the Schools PV Programme was launched on 23rd November 2023.  It provides eligible schools with up to 6 kilowatts peak of roof-mounted solar PV, which equates to approximately 16 solar panels and offers an opportunity for schools to reduce their carbon emissions and their energy costs.  Each school which has been approved for funding under the programme is required to inform the Department when its installation has been complete. here has been a really positive response for solar panels from schools. To date, of the 1,100 schools which have been approved for funding, more than 500 have informed the Department that their installation is complete, 124 of these are in County Galway. This number will continue to rise as installations are confirmed.  The scheme is funded from the Climate Action Fund managed by the Department of Environment, Climate and Communications. As well as the obvious financial and climate benefits, it is expected that the visibility of the solar panels on schools will also deliver the added benefit of encouraging discussion and uptake of the technology in the wider community. As an ongoing active delivery programme financial details are not being released at this time. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Anne Rabbitte",
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_840.xml"
            }
          },
          "debateSectionId": "dbsect_840",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_840",
          "showAs": "Sports Funding"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_926",
        "to": {
          "roleType": null,
          "showAs": "Tourism",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 926,
        "showAs": " 926. Deputy Anne Rabbitte asked the Minister for Tourism, Culture, Arts, Gaeltacht, Sport and Media the breakdown of funding for sports capital projects in Galway, including both local and regional scale projects, since 2020, in tabular form; and if she will make a statement on the matter. [32022/24] ",
        "answerText": " Minister of State at the Department of Tourism, Culture, Arts, Gaeltacht, Sport and Media  I propose to take Questions Nos. 926 and 927 together.  On 9 May 2024, Minister Martin and I announced over €26 million in equipment-only grants under the latest round of the SCEP. The grants have been provisionally allocated to organisations across the country and to over fifty sports and activities.  Further SCEP allocations, including those for capital works and capital works with an equipment component, will be announced by Autumn. On 29 May 2024, Minister Martin and I announced that at least €250 million in funding will be available under the latest round of the SCEP. This record level of funding should mean a positive outcome for all valid applications. Allocations under the Sports Capital and Equipment Programme 2020 round were made in 2021 and 2022.  Allocations in respect of Galway under SCEP since 2020 are set out in the spreadsheet at the link.   SCEP Galway  ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Anne Rabbitte",
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_840.xml"
            }
          },
          "debateSectionId": "dbsect_840",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_840",
          "showAs": "Sports Funding"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_927",
        "to": {
          "roleType": null,
          "showAs": "Tourism",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 927,
        "showAs": " 927. Deputy Anne Rabbitte asked the Minister for Tourism, Culture, Arts, Gaeltacht, Sport and Media the breakdown of funding for sports equipment in Galway since 2020, in tabular form; and if she will make a statement on the matter. [32023/24] ",
        "answerText": " Minister of State at the Department of Tourism, Culture, Arts, Gaeltacht, Sport and Media  I propose to take Questions Nos. 926 and 927 together.  On 9 May 2024, Minister Martin and I announced over €26 million in equipment-only grants under the latest round of the SCEP. The grants have been provisionally allocated to organisations across the country and to over fifty sports and activities.  Further SCEP allocations, including those for capital works and capital works with an equipment component, will be announced by Autumn. On 29 May 2024, Minister Martin and I announced that at least €250 million in funding will be available under the latest round of the SCEP. This record level of funding should mean a positive outcome for all valid applications. Allocations under the Sports Capital and Equipment Programme 2020 round were made in 2021 and 2022.  Allocations in respect of Galway under SCEP since 2020 are set out in the spreadsheet at the link.   SCEP Galway  ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Anne Rabbitte",
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_972.xml"
            }
          },
          "debateSectionId": "dbsect_972",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_972",
          "showAs": "Housing Provision"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_1085",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1085,
        "showAs": " 1085. Deputy Anne Rabbitte asked the Minister for Housing, Local Government and Heritage the number of housing units delivered in County Galway, broken down by social and affordable housing units on a yearly basis per municipal area since 2020, in tabular form; and if he will make a statement on the matter. [32010/24] ",
        "answerText": " Minister for Housing, Local Government and Heritage  My Department publishes comprehensive programme-level statistics on a quarterly basis on social and affordable housing delivery activity by local authorities and AHBs in each local authority area. This data, which is gathered on a local authority-wide basis, is available to the end of Q1 2024 and is published on the statistics' page of my Department’s website at the following link: www.gov.ie/en/collection/6060e-overall-social-housing-provision/  My Department also publishes the Social Housing Construction Status Report (CSR). The CSR provides details of social housing developments and their location that have been completed, are under construction or are progressing through the various stages of the design and tender processes. This includes details of which local authority or AHB delivered, or is delivering, the development. The most recent publication was for Quarter 1 2024. All Construction Status Reports are available at the following link: www.gov.ie/en/collection/cb885-social-housing-construction-projects-status-reports/ ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Anne Rabbitte",
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_918.xml"
            }
          },
          "debateSectionId": "dbsect_918",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_918",
          "showAs": "Housing Schemes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_1086",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1086,
        "showAs": " 1086. Deputy Anne Rabbitte asked the Minister for Housing, Local Government and Heritage the total funding provided for housing adaptations in County Galway, broken down by municipal area since 2020, in tabular form; and if he will make a statement on the matter. [32011/24] ",
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage (Deputy Alan Dillon)  I propose to take Questions Nos. 1016 and 1086 together.  My Department provides Exchequer funding to local authorities under the Housing Adaptation Grants for Older People and People with a Disability scheme, to assist people in private houses to make their accommodation more suitable for their needs. The grants include the Housing Adaptation Grant for People with a Disability, the Mobility Aids Grant and the Housing Aid for Older People Grant, which are 80% funded by my Department, with a 20% contribution from the resources of the local authority. The detailed administration of the scheme including assessment, approval, prioritisation and budgetary apportionment is the responsibility of local authorities.  Details of the allocations and drawdown for 2020 - 2023, including for both City and County Councils in Cork and Galway, are available on my Department's website at the following link:  www.housing.gov.ie/housing/statistics/social-and-affordble/other-local-authority-housing-scheme-statistics .  For 2024, Galway County Council have claimed €864,756 to date from my Department, facilitating the payment of 175 grants. So far in 2024, Galway City Council have claimed €879,008 to date from my Department, facilitating the payment of 158 grants. These allocations are matched by a 20% contribution from the resources of the local authority. My Department does not receive details of spend from Galway County and Galway City Councils at municipal area level. This information may be available directly from these local authorities. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Anne Rabbitte",
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_973.xml"
            }
          },
          "debateSectionId": "dbsect_973",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_973",
          "showAs": "Housing Schemes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_1087",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1087,
        "showAs": " 1087. Deputy Anne Rabbitte asked the Minister for Housing, Local Government and Heritage the total funding provided for HAP supports in County Galway, broken down for each municipal area since 2020, in tabular form; and if he will make a statement on the matter. [32013/24] ",
        "answerText": " Minister for Housing, Local Government and Heritage  My Department publishes comprehensive programme-level statistics on social housing delivery activity in all local authority areas on the statistics page of its website. The data requested is not available by municipal area but by local authority administrative area and can be found on my Department’s website at this link:  www.gov.ie/en/collection/6060e-overall-social-housing-provision/#housing-assistance-payment .  The following table sets out the HAP Landlord Payments for Galway City Council and Galway County Council for the years 2020 to 2023.  This funding represents the portion paid by my Department after receipt of the differential rent which is paid by the tenant to the local authority. It does not include administration costs related to the HAP scheme. This data is published on an annual basis.     Local authority    2020  €    2021  €    2022  €    2023  €      Galway City Council    13,045,460    13,779,048    13,614,770    14,103,825      Galway County Council    7,895,181    9,105,299    9,404,335    10,040,369      Total County Galway    20,940,641    22,884,347    23,019,105    24,144,194    ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Anne Rabbitte",
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_1090.xml"
            }
          },
          "debateSectionId": "dbsect_1090",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_1090",
          "showAs": "Medical Aids and Appliances"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_1248",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1248,
        "showAs": " 1248. Deputy Anne Rabbitte asked the Minister for Social Protection the reason a person (details supplied) was refused a grant for hearing aids; and if she will make a statement on the matter. [31291/24] ",
        "answerText": " Minister for Social Protection  The Treatment Benefit Scheme provides dental, optical, aural and hair replacement products and services to insured workers, the self-employed, retired people and their dependent spouse/partner who have the required number of social insurance (PRSI) contributions.  To qualify a person needs to have at least 260 PRSI contributions paid at either Class A, E, H, P or S, since first starting work, and also have 39 contributions paid or credited in the relevant contribution year on which the claim is based.  The person concerned does not qualify for treatment benefit as they have no paid or credited PRSI contributions in the relevant year(s) on which the claim is based.  If the person concerned has a current Medical Card, they should contact their local HSE office which will advise on entitlements under the HSE scheme.  I hope this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Anne Rabbitte",
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_1122.xml"
            }
          },
          "debateSectionId": "dbsect_1122",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_1122",
          "showAs": "Departmental Data"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_1280",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1280,
        "showAs": " 1280. Deputy Anne Rabbitte asked the Minister for Social Protection the payment changes made to the old age contributory pension each year from 2019 and to date in 2024; and if she will make a statement on the matter. [31824/24] ",
        "answerText": " Minister for Social Protection  The State Pension is the bedrock of the pension system in Ireland.  It is extremely effective at ensuring that our pensioners do not experience poverty.  In 2024, for the second year in succession, the State Pension (Contributory) increased by €12 per week and has now increased by €29 in the lifetime of this Government. These weekly increases were part of a broader package, along with a wide range supports and lump-sum payments which were paid in late 2023 and into 2024.  These included supports for those living alone and those in receipt of Fuel Allowance, many of whom are pensioners and are payable depending on the person's circumstances.  The rates and changes of the State Pension (Contributory) between 2019 and 2024 are set out in the table below   State Pension (Contributory) Maximum Payment Rates 2019-2024      Date    Rate    Increase      01/01/2019    €           243.30          29/03/2019    €           248.30    €                5.00      03/01/2022    €           253.30    €                5.00      01/01/2023    €           265.30    €              12.00      01/01/2024    €           277.30    €              12.00     My Department regularly reviews its supports and payment schemes, to ensure that they continue to meet their objectives.  Any decision to further increase social welfare rates will be considered while taking account of the overall budgetary context and the availability of financial resources.  I hope this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Anne Rabbitte",
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_1124.xml"
            }
          },
          "debateSectionId": "dbsect_1124",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_1124",
          "showAs": "Departmental Data"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_1281",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1281,
        "showAs": " 1281. Deputy Anne Rabbitte asked the Minister for Social Protection the payment changes made to the disability allowance each year from 2019 and to date in 2024; and if she will make a statement on the matter. [31825/24] ",
        "answerText": " Minister for Social Protection  My Department provides a suite of income supports for those unable to work due to illness or disability.  These include insurance-based schemes, based on Pay Related Social Insurance (PRSI) contributions, and means-tested social assistance schemes.  The primary disability related social assistance scheme is the Disability Allowance, which is a means-tested payment for people with a specified disability who are aged between 16 and 66.  In addition to the means test, in order to be eligible, the disability must be expected to last for at least one year.  The allowance is also subject to a medical assessment and a habitual residency requirement.  Maximum weekly rates of Disability Allowance from 2019 to date, including increases for qualified adults and qualified children, are laid out in tabular form below:   Disability Allowance payment rates 2019-2024:      Year    Maximum weekly rate    €    Increase for Qualified Adult    €    Increase for qualified child under 12.    €    Increase for qualified child over 12.    €      2024    232.00    154.00    46.00    54.00      2023    220.00    146.00    42.00    50.00      2022    208.00    138.00    40.00    48.00      2021    203.00    134.70    38.00    45.00      2020    203.00    134.70    36.00    40.00      2019    203.00    134.70    34.00    37.00     Disability Allowance is structured to support recipients to avail of work opportunities, be that self-employment or insurable employment.  Budget 2023 was the third successive budget that the Government has progressively increased earnings disregards, which will see people with disabilities retaining more of their payments while in employment.  The earnings disregard for recipients of Disability Allowance has increased by almost 38% over these budgets from €120 to €140 to €165 currently.  A person can earn up to €165 and keep their payment in full and can earn up to €505.10 and keep a small portion of their payment and keep their secondary benefits.  Other increases and benefits which may be payable to Disability Allowance recipients include the Living Alone Allowance, currently €22 per week, and the Fuel Allowance of €33.00 per week.  The fuel allowance scheme operates for 28 weeks per annum from October to April.  A person in receipt of Disability Allowance may also be entitled to the Household Benefits Package and Free Travel Pass.  Also, as part of Budget 2024, I introduced significant supports for people with disabilities which include:  • €400 once-off payment for Disability Allowance, Blind Pension, Invalidity Pension and Carer’s Support Grant recipients in November 2023 to address the high cost of living.  • €200 lump sum Living Alone Allowance payment.  • €300 lump sum Fuel Allowance payment.  • Christmas Bonus double payment to all persons getting a long-term disability payment.  • January Cost of Living Bonus double payment to all persons getting a long-term disability payment.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Anne Rabbitte",
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_1125.xml"
            }
          },
          "debateSectionId": "dbsect_1125",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_1125",
          "showAs": "Departmental Data"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_1282",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1282,
        "showAs": " 1282. Deputy Anne Rabbitte asked the Minister for Social Protection the payment changes made to the single parent allowance each year from 2019 and to date in 2024; and if she will make a statement on the matter. [31826/24] ",
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 1282 and 1294 together.  The One-Parent Family Payment is a payment for lone parents under 66, who are not cohabiting, and whose youngest child is under seven. The Jobseekers Transitional Payment is a special arrangement under the Jobseeker’s Allowance scheme for lone parents under 66 who are not cohabiting and whose youngest child is between seven and fourteen years old.  There have been several changes to these schemes since 2019 which have had a positive impact for those in receipt of the payments.  In 2019, the core rates of both payments increased by €5, and the income disregard on both schemes increased from €130 to €150 per week. The latter measure resulted in recipients being able to earn more without affecting their payment.  In 2020, the earnings disregard was increased by a further €15 to €165 per week.  In April 2021, the earnings threshold of €425 was removed from the One-Parent Family Payment. The removal of the threshold meant that the payment no longer ceased at €425.  Instead, the payment tapers off as earnings increase.  Budgets 2022, 2023 and 2024 saw increases to the weekly personal rate of both payments of €5, €12 and €12 respectively, bringing the current personal rate of payment to €232 per week.  Since 2020, the weekly rate of the Increase for Qualified Child payment, for children over and under 12 years old, have consistently increased - taking the weekly rates from €34 for those under 12 and €37 for those aged 12 or over in 2019 to €46 and €54 per week in 2024.  The Social Welfare and Civil Law (Miscellaneous Provisions) Act 2024 provides for changes to the assessment of means. As a result, child maintenance payments are now excluded from the means assessment for both the One-Parent Family Payment and the Jobseeker’s Transitional Payment as well as other payments. This change to the means test came into effect from the week beginning 4th June 2024.  In addition, since late 2022, the Department ceased applying the \"efforts to seek maintenance\" requirement for the One-Parent Family and Jobseeker's Transitional Payments. This requirement had often involved applicants having to go to Court. The Liable Relative Provisions, which applied to One-Parent Family Payment whereby the Department could seek a contribution from the child's other parent, have been revoked and have not been applied to new claims since late 2022.  I trust this clarifies the position for the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Anne Rabbitte",
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_1126.xml"
            }
          },
          "debateSectionId": "dbsect_1126",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_1126",
          "showAs": "Departmental Data"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_1283",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1283,
        "showAs": " 1283. Deputy Anne Rabbitte asked the Minister for Social Protection the payment changes made to the carers allowance each year from 2019 and to date in 2024; and if she will make a statement on the matter. [31827/24] ",
        "answerText": " Minister for Social Protection  The main income supports to carers provided by my department include Carer's Allowance, Carer's Benefit, Domiciliary Care Allowance and the Carer's Support Grant. Spending on these payments in 2024 is expected to exceed €1.7 billion.  Carer’s Allowance is the main scheme by which the department provides income support to carers in the community.  There are currently 97,127 people in receipt of Carer's Allowance and the estimated spend on this payment in 2024 is over €1.1 billion.  The primary objective of the payment is to provide an income support to carers whose earning capacity is substantially reduced as a consequence of their caring responsibilities and in so doing to support the ongoing care of the person in respect of whom care is being provided.  Where carers are providing care to more than one person, an increase of 50% is applicable.  A half-rate Carer’s Allowance may also be available to those in receipt of particular social welfare payments who are providing full-time care and attention.  In these cases, a carer may retain their main payment and receive another payment, depending on their means, the maximum of which is equivalent to a half-rate Carer’s Allowance.  Payment changes made to the Carer's Allowance each year from 2019 and to date are laid out in tabular form below.  In 2019, the maximum rate of all weekly social welfare payments increased by €5 per week with proportional increases for qualified adults and people on reduced rates of payment.   Carer’s Allowance Payment Rates 2019-2024:      Year    Maximum Weekly Rate Aged Under 66, caring for 1 person €    Maximum Weekly Rate Aged Under 66, caring for 2 or more people €    Maximum Weekly Rate Aged 66 and Over, caring for 1 person €    Maximum Weekly Rate Aged 66 and Over, caring for 2 or more people €      2019-2021    219.00    328.50    257.00    347.50      2022    224.00    336.00    262.00    393.00      2023    236.00    354.00    274.00    411.00      2024    248.00    372.00    286.00    429.00     Since my appointment as Minister, I have also made a number of significant improvements to the means test for Carer's Allowance.  I was the first Minister in 14 years to make changes to the Carer's Allowance earnings and capital disregards.  • In June 2022, the income disregards were increased from €332.50 to €350 for a single person, and from €665 to €750 for carers with a spouse/partner.  • Last month, the weekly income disregards were increased further, from €350 to €450 for a single person, and from €750 to €900 for carers with a spouse/partner.  • The capital and savings disregard for the Carer’s Allowance means assessment was also increased in 2022 from €20,000 to €50,000.  These changes mean that carers on a reduced rate move to a higher payment.  In addition, many carers who previously did not qualify for a payment due to their means are brought into the Carer's Allowance system for the first time.  Since 2022, this amounts to cumulative increases to the income disregards of €117.50 for a single carer and €235.00 for a carer who is part of couple.  These are the highest disregards in the Social Welfare system.  It is also worth noting that, in addition to the Carer's Allowance payment improvements, as outlined above, over the last two Budgets there has been a suite of once-off lump sum and double payments to assist with the cost of living and rising bills.  More recently, as part of Budget 2024, these included:  • €400 for people receiving Carer’s Support Grant paid in November.  • A Christmas Bonus Double Payment to those in receipt of a qualifying social welfare payment, including carers.  • A further double payment was paid earlier in the year.  I am committed to supporting our family carers and I will continue to keep the range of supports provided by my department under review.  Any further improvements to the Carer’s Allowance payment would have to be considered in an overall budgetary and policy context.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Anne Rabbitte",
          "memberCode": "Anne-Rabbitte.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Anne-Rabbitte.D.2016-10-03"
        }
      }
    }
  ]
}