{
  "head": {
    "counts": {
      "questionCount": 999,
      "resultCount": 999
    }
  },
  "results": [
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 462,
        "showAs": " 462. Deputy Christopher O'Sullivan asked the Minister for Education and Youth for an update on the progress of the extension and refurbishment plans for a school (details supplied); and if she will make a statement on the matter. [63195/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Education"
        },
        "by": {
          "showAs": "Christopher O'Sullivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_462",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_386",
          "showAs": "Schools Building Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_386",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_386.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Education and Youth  The project referred to by the Deputy has been devolved to the Catholic Education an Irish Schools Trust (CEIST).  The project brief provides for a 600 pupil post primary school plus 3 Special Education Needs (SEN) classrooms.  In Quarter 1 2025, a Stage 1 meeting took place, and further information was requested to be submitted by the Design Team. This has been received and is currently undergoing review by the Department.  While at this early stage it is not possible to provide a timeline for completion of this project, CEIST will continue to engage directly with the school authorities to keep them fully informed of progress on this important project.  In July, the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my Department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  All Government Departments are expected to publish their sectoral NDP Implementation Plans in November. My Department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 858,
        "showAs": " 858. Deputy Christopher O'Sullivan asked the Minister for Agriculture, Food and the Marine the crops which will be included in the next round of tillage supports; and if he will make a statement on the matter. [63229/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Agriculture"
        },
        "by": {
          "showAs": "Christopher O'Sullivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_858",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_661",
          "showAs": "Tillage Sector",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_661",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_661.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Agriculture, Food and the Marine  My Department is currently examining options on how best to mange the additional funding that was allocated to the tillage sector in Budget 2026. Consultations with relevant stakeholders on these supports will take place in the near future.  In 2026 it is anticipated that the Straw Incorporation Measure (SIM) and Protein Aid will continue in the current format as these schemes are part of the current CAP Strategic Plan agreed with the European Commission.  The Government remains committed to the sector, and I will continue working with my colleagues across Government to ensure that essential targeted supports are provided where possible given the importance of the sector within the wider agricultural industry. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1047,
        "showAs": " 1047. Deputy Christopher O'Sullivan asked the Minister for Health if an update will be provided on the South Doc services in West Cork, including the steps taken to reopen the premises in Skibbereen; and if she will make a statement on the matter. [63168/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "showAs": "Christopher O'Sullivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1047",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_831",
          "showAs": "General Practitioner Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_831",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_831.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the HSE to reply to the Deputy directly as soon as possible. ",
        "date": "2025-11-18"
      }
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I propose to take Questions Nos. 408 and 430 together.  Through the national Catchment Flood Risk Assessment and Management (CFRAM) Programme, the largest study of flood risk was completed by the Office of Public Works, (OPW), in 2018. This studied the flood risk for two thirds of the population against their risk of flooding from rivers and the sea. The Government’s Flood Risk Management Plans, an output of CFRAM, provided the evidence for a proactive approach to designing and constructing flood relief schemes for the most at-risk communities.  Under the national delivery model, Cork County Council is leading the delivery of six flood relief schemes in the first tranche including Bantry Flood Relief Scheme, with nine schemes planned in the second tranche. The OPW is funding nine staff in Cork County Council to support the delivery of its programme of schemes.  Investment of €1.3 billion through the National Development Plan has allowed the OPW, since 2018, to treble the number of flood relief schemes at design, planning, and construction to some 100 schemes, including the scheme for Bantry.  Bantry Flood Relief Scheme, is currently at Stage 1 (Scheme Development and Preliminary Design). The proposed Bantry scheme is expected to provide protection to some 200 properties against significant flood risk.  The scheme consultants have identified an emerging preferred option which, if feasible, will be presented to the public before the end of this year. A date for this event will be confirmed shortly. The submission of this major scheme to planning is currently scheduled for Q3 2027.  Cork County Council is also progressing the installation of screens as an interim measure, one of which is in the Mill River. Cork County Council is engaging with the landowner concerned.  A further screen is scheduled to be installed on the Alley River in Summer 2026.  To mitigate damage from recurring flood events, the OPW, since 2021, has approved some €335,000 to Cork County Council to strengthen its emergency response for the installation of non-return valves, purchase of pumps and large sandbags.  This also includes funding of some €143,000 for Individual Property Protection for affected properties in Bantry.  Cork County Council is continuing to explore, with consultants for the main flood relief scheme, other possible mitigation measures ahead of the scheme’s delivery.  The Mill Culvert Upgrade Project is a separate project to the Bantry Flood Relief Scheme.  Cork County Council is leading this project and has secured Part 8 planning consent. The Council is working with all the project stakeholders, including the OPW and Uisce Éireann on the overall funding proposal for the Mill Culvert Upgrade Project.  To allow the continued progression of the project the OPW recently approved funding for Cork County Council to meet the consultant costs associated with this stage of the project.  Cork County Council appointed a consultant for detailed design, contractor procurement and management in October 2025.  The consultant is undertaking a review of the deliverables for the project and a contract programme for delivery of the project will be finalised shortly. ",
        "to": {
          "showAs": "Public Expenditure",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Christopher O'Sullivan",
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_353.xml"
            }
          },
          "debateSectionId": "dbsect_353",
          "showAs": "Flood Risk Management",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_353"
        },
        "questionNumber": 408,
        "date": "2025-11-12",
        "showAs": " 408. Deputy Christopher O'Sullivan asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the progress made to deliver a flood management solution for Bantry and, critically, an interim flood management plan to protect businesses and homes while long-term solutions are being developed; and if he will make a statement on the matter. [61559/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_408"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_160",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Christopher O'Sullivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08"
        },
        "debateSection": {
          "debateSectionId": "dbsect_157",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_157",
          "showAs": "Environmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_157.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Climate",
          "roleCode": null
        },
        "showAs": " 160. Deputy Christopher O'Sullivan asked the Minister for Climate, Energy and the Environment if consideration will be given to expanding the Better Energy Homes Programme to include replacement of items such as heat pumps that were installed without any grant support; and if he will make a statement on the matter. [60594/25] ",
        "questionNumber": 160,
        "answerText": " Minister for Climate, Energy and the Environment  My Department funds a number of grant schemes, administered by the Sustainable Energy Authority of Ireland (SEAI), to support homeowners improve the energy efficiency of their buildings, and to promote the adoption of renewable energy systems. These schemes include grants for the fabric upgrade of buildings (e.g. insulation), as well as solar PV and heat pump installation.  It is important to note that the grants available through the SEAI aim to maximise emissions reductions and deliver energy savings for the widest range of homeowners possible. The grants which are available, and their respective eligibility criteria, were designed to deliver significant energy savings to homeowners at the best value for money for the Exchequer. Since the funds that are available for energy efficiency are limited, the Department must prioritise their use where they will have the most impact.  Therefore, regarding grant support for the installation of a heat pump, grants will only be paid in relation to homes where solid fuel, oil/gas boiler or electrical heating (other than heat pump) is present, or where there is no heating in situ. There is currently no plan to amend these criteria.  My Department, in partnership with the SEAI, continues to ensure that grant schemes terms and conditions, eligibility criteria, and rates are kept under review, taking account of demand, research, innovation, evolving technology and other relevant factors. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan",
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08"
        },
        "questionNumber": 98,
        "questionType": "written",
        "answerText": " Minister for Enterprise, Tourism and Employment  The Increased Cost of Business grant and the Power Up grant opened to applications in 2024. Both grant schemes are now closed having paid out over €400 million to businesses across the country.  Both grant schemes are now closed and it is not possible to reopen them at this point. However in terms of broader Government supports for businesses, I'd like to draw your attention to the National Enterprise Hub online portal provides all business owners with a centralised signposting service of over 250 Government supports from 30 Departments and Agencies. The Hub has a team of expertly trained advisors who can help to diagnose the needs of your business and direct you to the appropriate available supports or indeed put you in direct contact with the relevant agency. The Hub team can be contacted through the website (www.neh.gov.ie) via live chat or by phone on 01 727 2100. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Enterprise",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_127",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_127",
          "showAs": "Business Supports",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_127.xml"
            }
          }
        },
        "showAs": " 98. Deputy Christopher O'Sullivan asked the Minister for Enterprise, Tourism and Employment to consider expanding the criteria of payments designed to help businesses with the costs of operation, as the ICOB and Power Up grant, for instance, have not reached business owners that have to pay their rates through their landlords as per their agreed contracts, meaning they did not meet the criteria for these payments; and if he will make a statement on the matter. [60223/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_98"
      }
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  Domestic electricity micro-generation is supported by the Micro-generation Support Scheme (MSS). Grants are available through the Sustainable Energy Authority of Ireland (SEAI) for domestic installations of solar PV up to a maximum of €1,800 in 2025 and are available to houses built and occupied prior to 2021.  Since the introduction of the MSS domestic grant in 2022, the MSS has gone strength to strength supporting more homes install solar PV. Since its launch in 2022 when over 10,000 homes received support, the Domestic Solar PV grant scheme has grown exceeding expectations each year with 22, 214 and 28,000 homes receiving grant support in 2023 and 2024 respectively.  From 2022 to end of August 2025, over 90,000 homes have received grants totalling €196.7m, resulting in over 450 MW installed and 93.2kt CO2 saved. The scheme supports households to reduce their energy use and in turn make savings on their energy bills.  This high level of demand indicates that the scheme is working well and that not only have citizens recognised the significant benefits of investing in Solar PV, but that the solar pv industry and supply chain have adapted to the demands of our citizens.  The current scheme built on the success of a previous pilot version of the grant scheme. As part of the transition between schemes and in order to increase access to the new scheme, the eligibility criteria were changed from those houses built prior to 2011, to those built prior to 2021.  Targeting the grant scheme at older homes, maximizes emissions reductions and delivers energy savings for the widest range of homeowners possible, whilst also making the most efficient use of limited Exchequer funding for the scheme. There are no plans to change the building year requirement at this stage but grant eligibility will be kept under review, and changes to the scheme will be made when necessary. ",
        "by": {
          "showAs": "Christopher O'Sullivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "date": "2025-10-08",
        "questionNumber": 139,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/dbsect_122",
          "debateSectionId": "dbsect_122",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/mul@/dbsect_122.xml"
            }
          },
          "showAs": "Environmental Schemes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-08/pq_139",
        "showAs": " 139. Deputy Christopher O'Sullivan asked the Minister for Climate, Energy and the Environment if the SEAI Solar PV grants can be extended to properties build and occupied after 2021; and if he will make a statement on the matter. [53967/25] "
      },
      "contextDate": "2025-10-08"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08"
        },
        "showAs": " 660. Deputy Christopher O'Sullivan asked the Minister for Health if consideration will be given to extending the capacity at Kinsale Community Hospital by an additional 100 beds and improving both inpatient and outpatient services; and if she will make a statement on the matter. [53435/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_605.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_605",
          "showAs": "Hospital Facilities",
          "debateSectionId": "dbsect_605"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_660",
        "answerText": " Minister for Health  As this is a service matter I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "questionNumber": 660
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "questionNumber": 405,
        "showAs": " 405. Deputy Christopher O'Sullivan asked the Minister for Education and Youth the number of children on reduced school days or absences due to school-based avoidance; and if she will make a statement on the matter. [36099/25] ",
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08"
        },
        "date": "2025-07-01",
        "questionType": "written",
        "debateSection": {
          "showAs": "School Attendance",
          "debateSectionId": "dbsect_380",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-01/writtens/mul@/dbsect_380.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-01/writtens/dbsect_380"
        },
        "answerText": " Minister of State at the Department of Education and Youth  The position of the Department of Education & Youth is that all pupils who are enrolled in a school should attend school for the full day. Where this is not possible for exceptional circumstances this is known as a reduced school day.  A commitment was made to ensure robust data collection on the use of reduced school days and to further ensure that reduced school days are only used in a manner that is limited, appropriate and absolutely necessary. In September 2021, the Department of Education & Youth issued Reduced School Day Guidelines to all schools on the procedures to be followed when reduced school days are put in place for students. These guidelines came into effect on 1 January 2022. These guidelines clearly state that reduced school days should not be used as a sanction, offered as an alternative to a sanction, or used as a behavioural management tool.  Reduced School Days or RSD is a transitionary arrangement which should only ever be considered in very limited and time-bound circumstances such as, for example, supporting a student to return to school after a period of absence, or due to a medical or mental health-related condition, or due to other exceptional circumstance and only with the consent of the parent or the guardians. It is designed to assist the student to attend for some part of the school day along with his/her peers, where it is not possible at a point in time for them to attend in a full-time capacity.  The latest available statistics, which are published on gov.ie, show that during the 2023/24 school year TESS received a total of 1,275 first notifications for school students who were on a reduced school day. This is broken down further as 612 primary students, 566 post-primary students and 97 special school students. The department is committed to publishing data in respect of reduced school days on an annual basis with the data in respect of the current school year due to be published in the autumn of 2025.  The latest available statistics are published at the following link: https://reduced-school-days-report-202324-school-year.pdf  My department continues to work closely with Tusla Education Support Service (TESS) who employs Educational Welfare Officers throughout the country to provide support, guidance and advice to all schools and parents with regard to school attendance issues to ensure that all students are supported to the greatest extent possible to attend for the full school day and to provide the best outcomes for students, school, and parents. The Educational Welfare service does not specifically collate school avoidance information for children. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-01/pq_405",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-07-01"
    },
    {
      "question": {
        "questionNumber": 406,
        "showAs": " 406. Deputy Christopher O'Sullivan asked the Minister for Education and Youth how her Department is supporting teachers in educating autistic children within mainstream school classes; and if she will make a statement on the matter. [36100/25] ",
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08"
        },
        "date": "2025-07-01",
        "questionType": "written",
        "debateSection": {
          "showAs": "Teacher Training",
          "debateSectionId": "dbsect_381",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-01/writtens/mul@/dbsect_381.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-01/writtens/dbsect_381"
        },
        "answerText": " Minister of State at the Department of Education and Youth  Providing inclusive education to children with special educational needs is a fundamental principle of the education system. This principle is observed through Department policies, Teaching Council requirements for initial teacher education, curriculum provision and the range of supports provided to schools by the National Council for Special Education (NCSE) and Oide.  Teachers undertake professional learning in a range of pedagogical, curricular and educational areas. Teacher Professional Learning (TPL) provided for teachers supports the inclusion of students with Special Education Needs (SEN) in mainstream classrooms.  Inclusive education is a mandatory element of initial teacher education (ITE) programmes. Within further updated standards which the Teaching Council adopted in 2020, known as Céim Standards for Initial Teacher Education, inclusive education was further strengthened as one of seven core elements which must underpin all aspects of programmes of ITE.  Launched in March 2023, the Policy Statement on Initial Teacher Education looks to build on the work carried out to enhance inclusive education under Céim: Standards for Initial Teacher Education. The Teaching Council provided a report to my department in October 2024 on how the core element of inclusive education has been included in initial teacher education. This will help foster progress on other actions agreed as part of the Policy Statement on Initial Teacher Education .  Furthermore, the Department has initiated a process to move towards a mandatory assessed placement period in a special education needs setting for all student teachers. As part of this, it is envisaged the Teaching Council, on behalf of the Department, will conduct a survey across all Initial Teacher Education (ITE) providers to gain a deeper understanding of the current landscape of school placement provision in special education settings. This will support the consideration of the Teaching Council in the development and approval of a Guidance Note for Higher Education Institutions, to be issued in Q3 2025 around an assessed student placement period in a SEN setting, working with a view to supporting initial change in September 2026.  Funded by the Department, Oide works with teachers and school leaders to provide ongoing support and professional development, which promotes inclusive practices.  Oide’s Leadership team are facilitating the Caidrimh Programme. This provides professional learning and support to guide Special Schools in effectively collaborating, sharing, and distributing their roles and responsibilities to create a school environment that is responsive and inclusive to diverse needs.  The Department provides funding for two distinct categories of post-graduate programmes for Special Education Teachers:  • Post-Graduate Diploma Programme of Teacher Professional Learning for Special Education Teachers.  • Graduate Certificate in Autism Education for teachers working with Autistic Pupils in Special Schools, Special Classes or as Special Education Teachers in mainstream Primary and Post-Primary Schools.  In 2024 approximately €852,000 was provided for these programmes to provide for over 300 places.  The Department of Education funds the Teacher Fee Refund Scheme which provides funding towards the cost of course participation and examination fees on successful completion of teacher professional learning courses, including inclusion programmes.  Recognising the need to provide specific supports to teachers in the area of autism, the department developed a guidance document for schools to support the needs of students with autism – “Autism Good Practice Guidance for Schools”. The content is relevant to supporting students across a range of educational environments including mainstream, special class and special school settings.  This guidance document has been developed as a resource for schools to support the needs of students with autism. It aims to assist teachers, SNAs and others working with children and young people with autism in an education setting to understand their needs so there can be effective engagement.  The department provided a number of workshops for schools on the autism guidance across the country and which were very well attended by school staff.  An online learning programme is currently in development for the Autism Good Practice Guidance.  In addition to and separate from Department funded Inclusion/SEN courses, some Higher Education Institutes offer privately funded courses on these topics at post-graduate/master’s level, which participants fund themselves.  Finally, the NCSE provides supports to teachers and schools in a way that builds capacity, supports the inclusion of all children, including students with special educational needs, at a whole school level. The NCSE Support Service manages, co-ordinates and develops a range of supports in response to identified teacher training needs. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-01/pq_406",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-07-01"
    },
    {
      "question": {
        "questionNumber": 627,
        "showAs": " 627. Deputy Christopher O'Sullivan asked the Minister for Children, Disability and Equality if consideration will be given to providing more CDNT supports to mainstream schools; and if she will make a statement on the matter. [36101/25] ",
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08"
        },
        "date": "2025-07-01",
        "questionType": "written",
        "debateSection": {
          "showAs": "Disability Services",
          "debateSectionId": "dbsect_573",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-01/writtens/mul@/dbsect_573.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-01/writtens/dbsect_573"
        },
        "answerText": " Minister of State at the Department of Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-01/pq_627",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-07-01"
    },
    {
      "question": {
        "questionNumber": 162,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-05-27/pq_162",
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan"
        },
        "showAs": " 162. Deputy Christopher O'Sullivan asked the Minister for Transport when the timetable for the 239 morning bus service from Courtmacsherry to Cork city will be reviewed, to ensure that the service arrives in Cork depot to accommodate service users connections for work and college; and if he will make a statement on the matter. [26737/25] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Transport",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2025-05-27",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-27/writtens/mul@/dbsect_84.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-27/writtens/dbsect_84",
          "showAs": "Bus Services",
          "debateSectionId": "dbsect_84"
        },
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators, in this case, Bus Éireann. In light of the NTA and Bus Éireann's responsibility in this area, I have forwarded the Deputy's query to them both for direct reply. Please advise my private office if you do not receive a response within ten working days.   "
      },
      "contextDate": "2025-05-27"
    },
    {
      "contextDate": "2025-05-07",
      "question": {
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-07/writtens/mul@/dbsect_407.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-07/writtens/dbsect_407",
          "showAs": "Departmental Schemes",
          "debateSectionId": "dbsect_407"
        },
        "questionType": "written",
        "questionNumber": 417,
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan",
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08"
        },
        "showAs": " 417. Deputy Christopher O'Sullivan asked the Minister for Health if it has been brought to her attention that the dispensing fee for HRT is less than that allocated to the contraception scheme (details supplied); to consider increasing the HRT to match the contraception scheme; and if she will make a statement on the matter. [22066/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-05-07/pq_417",
        "answerText": " Minister for Health  I recently announced that from the 1st June 2025, the provision of Hormone Replacement Therapy (HRT) products for the treatment of the symptoms of menopause will be provided free to women at the point of dispensing. The implementation of this measure will now include a dispensing fee for pharmacists. This is step forward from the Budget 2025 announcement which only covered the medication costs. This fee level aligns with the highest paid under the community drug schemes.  This measure is also targeted at assisting women who do not have access to a medical card or whose HRT costs fall below the current Drugs Payment Scheme threshold of €80 per month.  My Department and the Health Service Executive (HSE) has engaged extensively with the Irish Pharmacy Union (IPU) in relation to the practical rollout of this measure. In addition to several meetings at official level, I met with the IPU on two separate occasions. At the first meeting we discussed my ambitions for extending the scope of community pharmacists and the implementation of the Budget 2025 HRT measure. The second meeting focused on the practical roll-out of the HRT measure.  I regret that the implementation of this measure could not be agreed with the IPU, despite engagement over many months. However, I must follow through on the commitment made in the Programme for Government: Securing Ireland's Future.  When operational, this measure will cover any HRT medications and products which are reimbursable by the HSE, which have been prescribed for the purposes of alleviating the symptoms of menopause. Reimbursement support will commence from the 1st June 2025. The measure as planned will now involve no costs for the prescribed HRT product at the point of dispensing in participating pharmacies.  There has also been ongoing engagement between Department officials and the IPU regarding the potential to extend the scope of practice of community pharmacists. I want to see pharmacists practicing at their full potential, delivering expert professional services and expanded healthcare roles like diagnosing and prescribing for common conditions. This will enhance patient access to health care, speed up diagnoses, and improve recovery, as we also continue to expand GP services for Ireland’s growing population. I look forward to working on this with pharmacies as the year progresses. ",
        "date": "2025-05-07"
      }
    },
    {
      "contextDate": "2025-03-25",
      "question": {
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan"
        },
        "date": "2025-03-25",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-25/pq_617",
        "answerText": " Minister for Agriculture, Food and the Marine  In 2018, a transition period to a ban on vessels over 18 metres trawling in inshore waters, inside the six nautical mile zone and the baselines, was announced. This measure, however, was the subject of extended legal proceedings resulting in the measure being overturned in 2023.  In 2024, over a period of eight weeks, the Minister held a new public consultation on a review of trawling activity inside the six nautical mile zone and the baselines. The consultation took place without prejudice.  The purpose of this consultation was to invite stakeholders and interested parties to advise of their views on any changes to policy within the scope of this review. A large volume of submissions - over 5,500 - were received. These submissions will be considered in the review of trawling activity inside the six nautical mile zone and baselines. All relevant issues will be carefully considered before a decision can be made. ",
        "to": {
          "uri": null,
          "showAs": "Agriculture",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 617. Deputy Christopher O'Sullivan asked the Minister for Agriculture, Food and the Marine the status of plans to reintroduce a ban on pair trawling by large vessels within six nautical miles off the Irish coast (details supplied). [13782/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_406",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-25/writtens/mul@/dbsect_406.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-25/writtens/dbsect_406",
          "showAs": "Maritime Jurisdiction"
        },
        "questionNumber": 617,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-03-06",
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-06/pq_418",
        "questionNumber": 418,
        "showAs": " 418. Deputy Christopher O'Sullivan asked the Minister for Health the updated timelines on primary care psychology waiting list for a person (details supplied); and if she will make a statement on the matter. [10374/25] ",
        "questionType": "written",
        "date": "2025-03-06",
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-06/writtens/mul@/dbsect_421.xml"
            }
          },
          "showAs": "Primary Care Services",
          "debateSectionId": "dbsect_421",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-06/writtens/dbsect_421"
        },
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08"
        },
        "to": {
          "showAs": "Health",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "house": {
          "committeeCode": "",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "houseNo": "34",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        }
      }
    },
    {
      "contextDate": "2025-03-06",
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-06/pq_419",
        "questionNumber": 419,
        "showAs": " 419. Deputy Christopher O'Sullivan asked the Minister for Health the updated timelines on the autism diagnostic assessment waiting list for a person (details supplied); and if she will make a statement on the matter. [10375/25] ",
        "questionType": "written",
        "date": "2025-03-06",
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-06/writtens/mul@/dbsect_422.xml"
            }
          },
          "showAs": "Hospital Waiting Lists",
          "debateSectionId": "dbsect_422",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-06/writtens/dbsect_422"
        },
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08"
        },
        "to": {
          "showAs": "Health",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "house": {
          "committeeCode": "",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "houseNo": "34",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_860",
        "answerText": " Minister for Agriculture, Food and the Marine  Under the €258m European Maritime, Fisheries and Aquaculture Fund (EMFAF) 2021-2027, co-funded by the Irish Government and the EU. Aquaculture operators may access support under a number of schemes, such as the Seafood Training Scheme, the Sustainable Aquaculture Scheme, and the Seafood Capacity Building Scheme.  These schemes are all administered on my behalf by Bord Iascaigh Mhara (BIM) and further details are available on www.bim.ie.  BIM also provides a range of other supports and advisory services to aquaculture producers. In addition aquaculture producers also have access to finance under schemes implemented by the Strategic Banking Corporation of Ireland (SBCI).  I am aware of the challenges faced by the aquaculture industry due to rising costs and other challenges. Preparatory work to progress the implementation of The National Strategic Plan for Sustainable Aquaculture Development has begun.  The implementation of this Strategy will provide a framework for engagement with the sector and an opportunity to identify and put in place measures to support the sustainable and continued development of this important sector over the coming years. ",
        "to": {
          "uri": null,
          "showAs": "Agriculture",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 860. Deputy Christopher O'Sullivan asked the Minister for Agriculture, Food and the Marine the status of the aquaculture assistance package that was mentioned in December 2024 (details supplied); and if he will make a statement on the matter. [2384/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_763",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_763.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_763",
          "showAs": "Agriculture Supports"
        },
        "questionNumber": 860,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_768",
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  My Department provides funding under the suite of Housing Adaptation Grants for Older People and Disabled People, to assist people in private houses to make their accommodation more suitable for their needs. The suite of grants, which include the Housing Adaptation Grant for Disabled People, the Mobility Aids Grant and the Housing Aid for Older People Grant, are funded by my Department with a contribution from the local authority.  The Housing Aid for Older People Grant scheme provides grants of up to €10,700 to assist older people living in poor housing conditions to have necessary repairs or improvements carried out. Qualifying works include structural repairs or improvements, upgrading unsafe electrical wiring, drylining, repair or replacement of windows and doors and the repair or provision of central heating (where no central heating exists or the existing system is broken or beyond repair).  The European Union (Energy Performance of Buildings) Regulations 2024 (S.I. No. 749/2024), signed by the Minister for the Environment, Climate and Communications on 19 December 2024, transposes Article 17(15) of Directive 2024/1275 of the European Parliament and of the Council of the 24 April 2024 on the energy performance of buildings (recast) into Irish law. The Regulations provide that from the 1 January 2025 public bodies shall not provide any financial incentives for the installation of stand-alone boilers powered by fossil fuels other than those already approved under EU funds.  As a result, grants under the Housing Aid for Older People Grant scheme can no longer be provided for the installation of new stand-alone boilers powered by fossil fuels. However, any applications for grant funding in respect of the purchase of a new fossil fuel boiler (oil or gas), which were received and approved by a local authority prior to 1 January 2025 can still be paid to applicants after 1 January 2025. The grant scheme continues to be available for applications approved after 1 January 2025 in respect of costs relating to the repair of an existing fossil fuel boiler by a qualified contractor (oil or gas) or the purchase and installation of a second hand fossil fuel boiler by a qualified contractor (oil or gas).  Grants under the scheme may also continue to be paid after 1 January 2025 in respect of the repair or replacement of all other parts of a central heating system such as new radiators, oil tanks or pipe work, regardless of connection to an existing fossil fuel boiler (oil or gas). Grants continue to be paid in respect of non fossil fuel heating such electric or biomass heating solutions e.g. wall mounted electric heaters or wood pellet stoves etc., where either are deemed to be a suitable option in line with applicant’s circumstances. The detailed administration of the schemes is the responsibility of the local authorities, therefore the qualifying works is a matter for consideration and decision on a case-by-case basis by the local authority within the scope of the grant scheme.  Grant funding for insulation works and associated heating systems are appropriate to the schemes available from the Sustainable Energy Authority of Ireland (SEAI). Further information in relation to these schemes can be found on the SEAI website at www.seai.ie/homeenergyupgrades. ",
        "to": {
          "uri": null,
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 768. Deputy Christopher O'Sullivan asked the Minister for Housing, Local Government and Heritage the options that are available to older people who can no longer use the housing aid for older people grant to buy a new fossil fuel boiler, such as an oil or gas boiler, given the new grant amount will not cover air to water systems, and in many cases the house will not be suitable for these heating systems (details supplied); and if he will make a statement on the matter. [1144/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_735",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_735.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_735",
          "showAs": "Energy Policy"
        },
        "questionNumber": 768,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_1090",
        "answerText": " Minister for Agriculture, Food and the Marine  In December 2018, a transition period to a ban on vessels over 18 metres trawling in inshore waters, inside the six nautical mile zone was announced.  A significant part of the objective of this measure was to manage the fishing effort on sprat stocks which are primarily targeted within inshore waters.  This measure, however, was the subject of extended legal proceedings the outcome of which, received last year, is that the ban has been overturned.  In February 2024, I held a new public consultation on a review of trawling activity inside the six nautical mile zone and the baselines. The consultation took place over a period of eight weeks and closed on Friday 12th April.  This consultation took place without prejudice.  The purpose of this consultation was to invite stakeholders and interested parties to advise me of their views on any changes to policy within the scope of this review. A large volume of submissions - over 5,000 - were received. These submissions will be used to inform my review of trawling activity inside the six nautical mile zone and baselines. My Department is in the process of analysing the submissions. All relevant issues must be carefully considered before a decision can be made. ",
        "to": {
          "uri": null,
          "showAs": "Agriculture",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 1090. Deputy Christopher O'Sullivan asked the Minister for Agriculture, Food and the Marine when a decision on the public consultation on trawling activity inside the six-nautical-mile zone is due; and if he will make a statement on the matter. [1145/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_1022",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_1022.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_1022",
          "showAs": "Fishing Industry"
        },
        "questionNumber": 1090,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_1501",
        "answerText": " Minister for Health  The Long-Term Illness (LTI) Scheme was established under Section 59(3) of the Health Act 1970 (as amended). Regulations were made in 1971, 1973 and 1975, prescribing 16 conditions covered by the Scheme. These are: acute leukaemia; mental handicap; cerebral palsy; mental illness (in a person under 16); cystic fibrosis; multiple sclerosis; diabetes insipidus; muscular dystrophies; diabetes mellitus; parkinsonism; epilepsy; phenylketonuria; haemophilia; spina bifida; hydrocephalus; and conditions arising from the use of Thalidomide.  Under the LTI Scheme, patients receive drugs, medicines, and medical and surgical appliances directly related to the treatment of their illness, free of charge. While there are currently no plans to extend the list of conditions, it is important to remember that the LTI Scheme exists within a wider eligibility framework.  There has been a significant focus on improving access to and the affordability of healthcare services over the last few years. This includes reductions in the Drugs Payment Scheme threshold, expansion of access to free GP care, and the abolition of all public in-patient hospital charges for children and adults. These measures continue to create a health and social care service that offers affordable access to quality healthcare.  People who cannot, without undue hardship, arrange for the provision of medical services for themselves and their dependants may be eligible for a medical card under the General Medical Services (GMS) Scheme. In accordance with the provisions of the Health Act 1970 (as amended), eligibility for a medical card is determined by the HSE.  In certain circumstances the HSE may exercise discretion and grant a medical card, even though an applicant exceeds the income guidelines, where he or she faces difficult financial circumstances, such as extra costs arising from illness. In circumstances where an applicant is still over the income limit for a medical card, they are then assessed for a GP visit card, which entitles the applicant to GP visits without charge.  Under the Drugs Payment Scheme (DPS), no individual or family pays more than €80 a month towards the cost of approved prescribed medicines. The DPS is not means tested and is available to anyone ordinarily resident in Ireland. The DPS significantly reduces the cost burden for families and individuals with ongoing expenditure on medicines.  Individuals may also be entitled to claim tax relief on the cost of their medical expenses, including medicines prescribed by a doctor, dentist, or consultant. Relief is at the standard tax rate of 20%. ",
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 1501. Deputy Christopher O'Sullivan asked the Minister for Health if he will consider including organ transplant recipients in the long-term illness scheme; and if he will make a statement on the matter. [1143/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_1414",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_1414.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_1414",
          "showAs": "Healthcare Policy"
        },
        "questionNumber": 1501,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_1699",
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  A new Student Accommodation Strategy is in development following Government approval of the long-term Policy in January 2024. The Strategy aims to increase supply of state supported student accommodation, reduce the cost of delivery through development of standardised design guidance, promote efficient use of existing building stock through refurbishment and an examination of vacancy, while supporting balanced regional development through the Technological University (TU) Feasibility study.  The intention of the TU Feasibility Study is to develop a programmatic approach to facilitate future Technological University student accommodation proposals. The results of the TU Feasibility study will determine what opportunities are available to meet the future demand for student accommodation through either new-build PBSA, leasing, acquisition, refurbishing or redevelopment of existing sites. A number of accommodation delivery mechanisms are being examined.  The Standardised Design Study will be key to establishing best practice and value for money for the State, ensuring affordability of additional supply for students.  The TU Feasibility study is progressing in tandem with the Standardised Design Study for student accommodation, to enable a viable design model for state supported student accommodation based on regional needs and feasibility assessments.  The outcomes of these studies will provide a framework of delivery models and funding options to inform the new Strategy and are expected in early 2025.  It is intended that the Strategy will be delivered in Q2 2025. ",
        "to": {
          "uri": null,
          "showAs": "Further and Higher Education",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 1699. Deputy Christopher O'Sullivan asked the Minister for Further and Higher Education, Research, Innovation and Science the timeline for his plans to deliver a stand-alone strategy for the delivery of purpose-built student accommodation in Ireland; and if he will make a statement on the matter. [46355/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_1606",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_1606.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_1606",
          "showAs": "Student Accommodation"
        },
        "questionNumber": 1699,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "question": {
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-23/writtens/dbsect_89",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-23/writtens/mul@/dbsect_89.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_89",
          "showAs": "Departmental Funding"
        },
        "showAs": " 38. Deputy Christopher O'Sullivan asked the Minister for the Environment, Climate and Communications to provide a breakdown of the funding for national home retrofit programmes in each of the years 2016 to 2024, in tabular form.  [43450/24] ",
        "questionNumber": 38,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-23/pq_38",
        "date": "2024-10-23",
        "answerText": " Minister for the Environment, Climate and Communications  The Sustainable Energy Authority of Ireland (SEAI) manage a number of residential and community energy upgrade grant support schemes on behalf of my Department. These include the Better Energy Homes Scheme; Warmer Homes Scheme; the Community Energy Grant Scheme, the National Home Energy Upgrade Scheme through One Stop Shops and the Solar PV Scheme. These schemes provide an unprecedented opportunity for people all over Ireland to upgrade to a warmer, healthier and more comfortable home, with lower energy bills and emission.  Between 2016 and the end of the third quarter of 2024, almost 240,000 home energy upgrades were supported by SEAI. The budgets for SEAI residential and Community energy efficiency upgrade schemes have increased from €58 million in 2016 to over €430 million this year and in 2025 will grow further to over €469 million (current and capital funding). Demand across the SEAI schemes is growing and so is spend and output.  The table below sets out the annual funding budgets to the SEAI Residential/ Community Energy Efficiency Upgrade Schemes for the period 2016-2024.      Year      Current funding budget €m      Capital funding budget €m      TOTAL €m       2016    2.26    55.81    58.07      2017    2.65    74.81    77.46      2018    3.93    84.8    88.73      2019    3.68    87.5    91.18      2020    3.68    119.1    122.78      2021    4.19    209    213.19      2022    4.48    255.2    259.68      2023    4.45    348.27    352.72      2024    4.82    429.75    434.57    ",
        "questionType": "written",
        "house": {
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "to": {
          "roleCode": null,
          "roleType": null,
          "showAs": "Environment",
          "uri": null
        }
      },
      "contextDate": "2024-10-23"
    },
    {
      "question": {
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-23/writtens/dbsect_111",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-23/writtens/mul@/dbsect_111.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_111",
          "showAs": "Regional Airports"
        },
        "showAs": " 62. Deputy Christopher O'Sullivan asked the Minister for Transport to provide a breakdown of funding allocated to both Cork and Shannon airports in each of the years 2016 to 2024, in tabular form. [43451/24] ",
        "questionNumber": 62,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-23/pq_62",
        "date": "2024-10-23",
        "answerText": " Minister of State at the Department of Transport  As the Deputy will be aware the regional airports in Cork and Shannon are State-owned airports. Both have a commercial mandate and are expected to rely on their own resources, without recourse to the Exchequer, which they had done prior to COVID-19.  However, since 2020 unprecedented Exchequer funding totalling over €92m was provided to these regional State airports, supporting vital safety and security operations and activities as well as projects with a sustainability focus. Funding in 2021 also provided these airports with the flexibility to roll out route incentives to airlines, which supported strong recovery and growth of connectivity.  In addition, further to an action under the Mid-term Review of the Regional Airports Programme, both Cork and Shannon airports were allocated funding in 2024 to support them in meeting their carbon emission reduction targets under the Climate Action Plan.  As requested by the Deputy, please see the following table which provides a breakdown of Exchequer funding allocated by my Department to both Cork and Shannon airports in each of the years 2020 to 2024.   Exchequer Funding to Cork and Shannon Airports 2020-2024      Funding Programme/Scheme    2020    2021    2022    2023    2024*    TOTAL         €m    €m    €m    €m    €m    €m      Cork Airport                        COVID-19 Regional State Airports Programme 2021       €16.69             €16.69      COVID-19 Supplementary Support Scheme for Irish Airports       €8.38             €8.38      Regional Airports Programme 2021-2025          €14.46    €1.37       €15.83      Regional State Airports Sustainability Programme                €2.28    €2.28      Cork Airport Total       €25.07    €14.46    €1.37    €2.28    €43.18                               Shannon Airport                        Emergency Funding    €0.30    €5.35    €1.13          €6.78      COVID-19 Regional State Airports Programme 2021       €11.6             €11.6      COVID-19 Supplementary Support Scheme for Irish Airports       €5.49             €5.49      Regional Airports Programme 2021-2025          €10.51    €12.58       €23.09      Regional State Airports Sustainability Programme                €1.93    €1.93      Shannon Airport Total    €0.30    €22.44    €11.64    €12.58    €1.93    €48.89      Total Combined Funding    €0.30    €47.51    €26.1    €13.95    €4.21    €92.07      *2024 funding refers to funding allocations in 2024 and not funding draw down to date.  ",
        "questionType": "written",
        "house": {
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "to": {
          "roleCode": null,
          "roleType": null,
          "showAs": "Transport",
          "uri": null
        }
      },
      "contextDate": "2024-10-23"
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 20,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_20",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_40",
          "showAs": "Climate Action Plan",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_40",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_40.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Taoiseach",
          "uri": null,
          "roleCode": null
        },
        "answerText": " The Taoiseach  The Department of the Taoiseach prepares progress reports on the delivery of measures committed to under the Climate Action Plan.  The latest progress report for the 2024 Climate Action Plan (CAP24) was published on 3 September. It provides detail on actions that were due to be completed in Quarter 1 and Quarter 2 of 2024, along with progress on delayed high impact actions from the Climate Action Plan 2023.  This latest progress report shows that 20 of the 33 actions set out for the first half of the year were completed by the end of Q2. Actions reported as delayed will continue to be pursued and will be reported on in the upcoming Quarter 3 Progress Report.  Examples of high impact actions completed, and detailed in the Quarter 1/Quarter 2 Progress Report, include:  • Publishing the National Biomethane Strategy  • Publishing the high-powered EV charging strategy  • Developing the Strategic Rail Review implementation plan  • Reducing the minimum number of large fossil-fuel electricity generators  • Delivering low-cost finance options for home retrofit  • Publishing a decarbonisation roadmap for industrial heat  • Establishing the National Agricultural Soil Carbon Observatory  • Updating the shadow price of carbon  • Publishing a new Green Public Procurement Strategy  • Adopting 31 Local Authority Climate Action Plans, and  • Finalising a new National Adaptation Framework.  The Quarter 3 progress report is currently being compiled and will be published following consideration by the Government. ",
        "showAs": " 20. Deputy Christopher O'Sullivan asked the Taoiseach if he will report on the 2024 Climate Action Plan progress report published by his Department on 3 September 2024. [36708/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Christopher O'Sullivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 292,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_292",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_260",
          "showAs": "Climate Action Plan",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_260",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_260.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Enterprise",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Enterprise, Trade and Employment  As the Deputy will be aware, last June I announced that €300 million will be available to drive the decarbonisation of Ireland’s industrial emitters over the coming years. The fund will be used by Enterprise Ireland and IDA Ireland to support client companies to reduce their industrial emissions between now and 2030 through the Environmental Aid scheme.  Enterprise Ireland is supporting client companies to adopt innovative decarbonisation technologies at scale. Since the launch of the fund, significant projects have been delivered throughout industries including Food & Drinks, Cement, and Dairy. The value of grant approvals in 2024 is €28.8 million. The amount to be approved by Enterprise Ireland in 2025, based on an identified pipeline of projects, is currently forecasted at €38.8 million.  Meanwhile, since last June’s announcement, IDA Ireland has approved a total grant aid of €6.63 million to five client companies to reduce their industrial emissions. ",
        "showAs": " 292. Deputy Christopher O'Sullivan asked the Minister for Enterprise, Trade and Employment in relation to the €300 million to drive the decarbonisation of manufacturing sectors that he announced in June 2024, the amount allocated to date; the amount to be funded by his Department in 2025; and if he will make a statement on the matter. [43118/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Christopher O'Sullivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-17",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 144,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-17/pq_144",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_152",
          "showAs": "Electric Vehicles",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-17/writtens/dbsect_152",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-17/writtens/mul@/dbsect_152.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Transport  The Government has committed significant funding to support zero and low emitting vehicles through the National Development Plan, which currently includes an allocation of almost €500 million for the period 2021-2025 and additional support from the Climate Action Fund, the Shared Island Fund and the EU Just Transition Fund.  €115.8m has been allocated in 2024 to ensure the continued transition to electric vehicles which includes funding for EV grants and EV charging infrastructure.  Based on 2023 sales, and accounting for the downturn in sales that has been seen in 2024 figures to date, projections for current spend to the end of this year with the current grant rate of €3,500 are €45,905,299.  If the grant rate of €5,000 was to be reinstated, based on the 2024 projections, the spend for 2024 would be €65,578,998.  If the grant was to be increased to €5,000, the extra €19,673,699 of spend would be diverted from other schemes that are in place to improve the charging infrastructure around the country. In line with International best practice, the focus of government funding has transitioned from vehicle spending to charging infrastructure.  There are still a number of incentives, other than the purchase grant of up to €3,500 off the price of a new battery electric vehicle (BEV), that are aimed at increasing the uptake of BEVs, including:  • A Home Charger purchase grant scheme - up to €300;  • VRT relief of up to €5,000 for the purchase of BEVs;  • Benefit-in-Kind tax relief for battery electric vehicles;  • eSPSV grant scheme – a generous grant for taxi drivers to make the switch to Wheelchair Accessible EV’s of up to €25,000;  • ZEHDV grant scheme – a grant scheme for HDVs to bridge the gap between a low emission vehicle and a fossil fuel vehicle; and  • Low rate of annual motor tax;  These and related infrastructure supports will continue to incentivise the switch to electric vehicles as well as enabling the expansion of a fast and accessible rapid electric vehicle charging network to stay ahead of demand. ",
        "showAs": " 144. Deputy Christopher O'Sullivan asked the Minister for Transport the first- and full-year costs of reinstating the grant rate of €5,000 for the purchase of EVs. [42196/24] ",
        "date": "2024-10-17",
        "by": {
          "showAs": "Christopher O'Sullivan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08"
        }
      }
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan"
        },
        "questionNumber": 110,
        "showAs": " 110. Deputy Christopher O'Sullivan asked the Minister for the Environment, Climate and Communications to provide an update on the Celtic Interconnector project; the estimated timeline for completion; the amount of State funding to date towards the project; and the remaining Exchequer funding both current and capital committed over the remainder of this decade. [40923/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Environment"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_110",
        "debateSection": {
          "debateSectionId": "dbsect_92",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_92",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_92.xml"
            },
            "pdf": null
          },
          "showAs": "Energy Infrastructure"
        },
        "answerText": " Minister for the Environment, Climate and Communications  The Celtic Interconnector is a 700 MW electricity interconnector between Brittany and East Cork, developed by EirGrid and its French counterpart, Réseau de Transport d’Électricité (RTÉ). This project will reinstate direct connectivity to the Internal Energy Market following the United Kingdom's departure from the European Union.  The project is on track for completion in 2027. The 2024 survey campaign for the project has been successfully completed. The installation of the HVDC cable commenced in the second quarter of 2024, while the HVAC cable route installation is projected to be completed by the fourth quarter of 2024.  The offshore marine installation and submarine cable protection works are scheduled to begin in 2025, with completion anticipated in 2026. The commissioning phase for the interconnector is planned for 2026, with energization aimed for late 2026 and the trial operation period expected to conclude by the end of March 2027.  The cost of the project is shared between EirGrid and RTÉ in accordance with the Cost Benefit Cost Allocation determination. The costs are financed rather than directly funded by the State, with costs to be recovered from the operation of the Interconnector. Further detail on this regulatory framework, that aims align the interests of electricity customers and EirGrid while enabling EirGrid to progress and finance this project, is available on the website of the Commission for the Regulation of Utilities [1] .  The project achieved Project of Common Interest Status and was successful in securing €530 million in capital funding under the Connecting Europe Facility significantly mitigating financing requirements.  [1] cruie-live-96ca64acab2247eca8a850a7e54b-5b34f62.divio-media.com/documents/CRU202213-Celtic-Electricity-Interconnector-EirGrid-Regulatory-Framework-Request-decis.pdf . ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan"
        },
        "questionNumber": 111,
        "showAs": " 111. Deputy Christopher O'Sullivan asked the Minister for the Environment, Climate and Communications to provide an update on the upgrading of the national grid, including the transmission of offshore energy into the national grid; the estimated timeline for completion; the State funding both current and capital to date towards this project; and the Exchequer funding committed over the remainder of this decade. [40924/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Environment"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_111",
        "debateSection": {
          "debateSectionId": "dbsect_93",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_93",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_93.xml"
            },
            "pdf": null
          },
          "showAs": "Energy Infrastructure"
        },
        "answerText": " Minister for the Environment, Climate and Communications  Responsibility for the regulation of the electricity market is a matter for the Commission for Regulation of Utilities (CRU) which is an independent regulator, accountable to a committee of the Oireachtas and not me as Minister. The CRU was assigned responsibility for the regulation of the Irish electricity sector following the enactment of the Electricity Regulation Act, 1999 and subsequent legislation.  The CRU is responsible for, inter alia, the economic regulation of the electricity system operators ESB Networks, distribution, and Eirgrid, transmission. The cost of building, safely operating and maintaining the electricity system is recovered by system operators through charges on customers, all of which is overseen and agreed with the CRU. System operator spending is agreed with the CRU in five year cycles, referred to as Price Reviews. The current price review (Price Review 5) is in effect until the end of 2025 and saw the CRU sanction a €4 billion capital investment in the Grid over the period 2021-2025.  Work has commenced on Price Review 6 which will see the CRU sanction the investment in the grid for 2026 to 2030. While a decision is not expected until Q3 2025, the CRU recently published their strategy paper which sought to inform and sought comments from the public on their approach to deciding the funding for the period.  In July 2023 EirGrid published Shaping our Electricity Future 1.1, an update to their roadmap for the development of the transmission grid out to 2030 to deliver on the renewable energy targets, to include the integration of offshore wind into the electricity grid. In January 2023, ESB Networks launched its networks for Net Zero Strategy which outlines its commitment to futureproofing Ireland’s electricity network and making the country’s goal of net zero by 2050 a reality.  Eirgrid and ESB Networks are independent of the Minister in the exercise of their functions as System Operators. The matters raised in this question are operational matters for both Eirgrid and ESB Networks, in the first instance, and the CRU and therefore not a matter in which I have function. The CRU, ESB Networks and EirGrid have respective contact email address for Deputies, of which they are aware, should they wish to raise matters of concern or seek updates on developments to the national electricity grid. ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan"
        },
        "questionNumber": 112,
        "showAs": " 112. Deputy Christopher O'Sullivan asked the Minister for the Environment, Climate and Communications to outline the targets set out for increasing onshore wind, solar PV and offshore wind energy generation in GW by 2030; the estimated annual cost to Exchequer required to meet these targets, in tabular form. [40925/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Environment"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_112",
        "debateSection": {
          "debateSectionId": "dbsect_94",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_94",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_94.xml"
            },
            "pdf": null
          },
          "showAs": "Renewable Energy Generation"
        },
        "answerText": " Minister for the Environment, Climate and Communications  A renewables-led system is one of the core foundations of Ireland’s plan to radically reduce emissions in the electricity sector, protect our energy security, and ensure our economic competitiveness.  The Government’s Climate Action Plan 2023 (CAP 23), reaffirmed by CAP 24, sets Ireland an ambitious target of 80% of electricity demand from renewable sources by 2030, to be met through 9 GW of onshore wind, 8 GW of solar, and at least 5 GW of offshore wind. This will require unprecedented levels of investment in renewable electricity generation development and in the infrastructure required to expand and strengthen our electricity grid.  The Renewable Electricity Support Scheme (RESS) is Ireland's flagship support scheme for grid-scale renewable electricity generators and a key measure in supporting our ambitious renewable electricity targets. The renewable electricity projects, developed under the RESS (or through private power purchase agreements) are not directly funded by the Exchequer; rather they are financed by developers and supported by the Public Service Obligation (PSO).  The PSO is calculated by the CRU on an annual basis and may be a levy or benefit on every final electricity customer's bill depending on the level of the wholesale electricity price. When fossil fuel prices are higher than renewable prices, the PSO can go to zero/negative – meaning that consumers can benefit from a payback, which they have in recent years. When fossil fuel prices are lower, the PSO is a charge to consumers through the PSO Levy.  The CRU has calculated that a PSO Levy of €251 million is required for the ‘2024/2025 PSO Year’. Onshore wind and solar projects in the RESS will be paying out over €52 million to Irish households and businesses over 2024/2025 – helping to offset the PSO levy rise.  The Climate Action Plan 2024 provides that an estimated investment of €23 billion in wind and solar energy is required as well as significant investment in the electricity network and other supporting infrastructure.  The electricity system operators, ESB Networks and EirGrid, are responsible for the building, maintenance, and safe operation of the electricity system. This is funded through network charges on all final electricity customer's bills. The CRU oversees and agrees these charges in five-year cycles, known as price reviews. The current price review, Price Review 5, is in effect until the end of 2025 and saw the CRU sanction a €4 billion capital investment in the grid over the 2021-25 period. Work has commenced on Price Review 6 (2026-30), with the CRU recently publishing a strategy paper on PR6, seeking comments from the public on their approach to deciding the funding for this period. ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan"
        },
        "questionNumber": 113,
        "showAs": " 113. Deputy Christopher O'Sullivan asked the Minister for the Environment, Climate and Communications to outline long-term battery storage capacity currently in Ireland; and to outline any State funding provided on an annual basis to such projects, in tabular form. [40926/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Environment"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_113",
        "debateSection": {
          "debateSectionId": "dbsect_95",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_95",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_95.xml"
            },
            "pdf": null
          },
          "showAs": "Energy Infrastructure"
        },
        "answerText": " Minister for the Environment, Climate and Communications  At present there is over 1 GW of electricity storage operating on the national electricity grid. 292 MW of this is pumped hydro-electric storage located at Turlough Hill Co. Wicklow, with the remainder Battery Electricity Storage Systems (BESS).  These 1 GW of electricity storage systems provide both electricity capacity to the grid to meet demand and the system services required to maintain the proper functioning of the grid, for durations of between 0.5 hours to 6 hours.  Capacity contracts for electricity storage are funded in a similar manner as other generators via the Capacity Remuneration Mechanism (CRM). Electricity storage assets may also receive funding via the Renewable Electricity Support Scheme (RESS) once they are co-located with renewable generators (wind or solar) behind the same meter point. Electricity storage system services contracts are funded via the DS3 programme operated by the Transmission System operators and funded through the 5 year Price Review programme under the remit of the Commission for Regulation of Utilities (CRU).  As per Action #6 of the recently published Electricity storage policy framework for Ireland, a further 1 GW of electricity storage is expected to be incorporated to the grid through two, first of kind, Route to Market products. These products are under development by ESB Networks (Distribution System Operator) and EirGrid (Transmission system operator), in line with the Commission for Regulation of Utilities. It is expected that these Route to Market products will be in place by Q4 2025 (ESB Networks) and Q2 2026 (EirGrid) respectively. Both System operators will publish a public consultation on their respective Route to Market products in Q4 2024 and both products are expected to be funded through the 5 year price review programme under the remit of the Commission for Regulation of Utilities (CRU). ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan"
        },
        "questionNumber": 114,
        "showAs": " 114. Deputy Christopher O'Sullivan asked the Minister for the Environment, Climate and Communications to outline any analysis carried out by his Department, consultancy or State body, relating to repowering windfarms in Ireland that will reach their end of life in 2030 and associated annual Exchequer costs; to outline any State funding both current and capital allocated to date in 2024; and the funding committed over the remainder of this decade to repowering such windfarms. [40927/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Environment"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_114",
        "debateSection": {
          "debateSectionId": "dbsect_96",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_96",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_96.xml"
            },
            "pdf": null
          },
          "showAs": "Renewable Energy Generation"
        },
        "answerText": " Minister for the Environment, Climate and Communications  The Renewable Energy Directive requires Member States to introduce accelerated and simplified permitting procedures for the repowering of renewable energy projects. Planning matters fall under the remit of the Minister for Housing, Local Government and Heritage and the decision to repower individual projects is a matter for developers.  Through the Accelerating Renewable Electricity Taskforce, officials in my department are working closely with Department of Housing, Local Government and Heritage on a range of policy measures to ensure that there is a supportive policy framework in place that facilitates the accelerated deployment of onshore wind and solar farm developments and supports a streamlined process for repowering of renewable electricity generation projects.  Ireland is a world leader in onshore wind and the continued operation of Ireland's fleet of onshore wind farms is critical to ensuring a secure and affordable energy supply to 2030 and beyond.  Repowering of existing wind farms has potential to deliver an increase in generation capacity, usually by replacing older, less efficient turbines with newer models with higher capacities, with limited additional environmental impact while maintaining electricity system security of supply.  Continued operation of existing renewable energy through permitting and other means as well as repowering will be critical to underpin the delivery of Ireland's 80% by 2030 renewable electricity target, that emissions reductions are delivered at least cost to households and businesses and security of electricity supply is maintained.  While the repowering of windfarms in Ireland is an important future policy consideration, no specific analysis has been carried out or funding provided by my Department to date. ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan"
        },
        "questionNumber": 115,
        "showAs": " 115. Deputy Christopher O'Sullivan asked the Minister for the Environment, Climate and Communications the estimated cost of holding an annual renewable electricity support scheme auction. [40928/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Environment"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_115",
        "debateSection": {
          "debateSectionId": "dbsect_97",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_97",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_97.xml"
            },
            "pdf": null
          },
          "showAs": "Renewable Energy Generation"
        },
        "answerText": " Minister for the Environment, Climate and Communications  The Renewable Electricity Support Scheme (RESS) is Ireland’s flagship support scheme for grid-scale renewable electricity generators and a key measure in supporting Ireland's ambitious renewable electricity targets under the Climate Action Plan. The RESS is comprised of a series of regular competitive auctions. The results of the most recent and very successful fourth RESS auction were published on 27 September 2024.  The RESS auction is designed and developed in-house by my Department and the auction is operated by EirGrid under auction operator license from the CRU at no cost to the Department. The administration and enduring contract management of the scheme is carried out internally by officials in my Department.  As part of the design and administration of the scheme, my Department procures consultancy support for legal and economic advice to aid in the development of the terms and conditions of each RESS auction and the associated documentation, as well as to assist with the handling of any queries or challenges relating to same.  For 2023 and year to date 2024, during which time two RESS auctions have been developed, the cost of legal consultancy associated with the development and operation of the schemes was €100,000. The cost of economic advice in the same period was just over €74,000. ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan"
        },
        "questionNumber": 116,
        "showAs": " 116. Deputy Christopher O'Sullivan asked the Minister for the Environment, Climate and Communications to outline current policy towards community-led renewable energy projects as well as local renewable energy trusts. [40950/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Environment"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_116",
        "debateSection": {
          "debateSectionId": "dbsect_98",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_98",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_98.xml"
            },
            "pdf": null
          },
          "showAs": "Renewable Energy Generation"
        },
        "answerText": " Minister for the Environment, Climate and Communications  Through the first two Renewable Electricity Support Scheme (RESS) auctions, my Department provided pathways and supports for Renewable Energy Communities (RECs) to participate in renewable energy projects through the application of a community projects category. Community renewable energy trusts is a term generally used in the UK to refer to entities similar to RECs.  My Department’s continued engagement with RECs, has identified evidence of significant challenges that they projects may face with the auction based nature of RESS, along with other barriers to project delivery. Therefore, support for communities for the development of renewable projects will now transition to the Small-Scale Renewable Electricity Support Scheme (SRESS).  In May I announced the tariffs for the export tariff phase of SRESS, which will support small-scale and community renewable projects. In the largest SRESS category, communities will receive a guaranteed tariff 20% higher than the average community price in the most recent RESS auction for community projects in 2022.  A set of technical and financial supports for community projects are currently available to communities through the Community Enabling Framework under the RESS. Similar supports will be available under the SRESS.  In addition, in 2023 and 2024 SEAI also undertook seven county level grid studies to support communities in identifying sites that are most likely to have an economically viable grid connection.  In September, the Commission for Regulation of Utilities published the new Electricity Connection Policy – Generation and System Services policy. The new policy provides greater opportunities for connection to the electricity network for community renewable energy projects through provisions such as the reduction in the first stage grid payment fees; the removal of upper and lower capacity limits; the size of projects not required to pay a capacity bond increasing from 5MW to 6MW; and the removal of caps on the number of projects per processing batch. ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan"
        },
        "questionNumber": 156,
        "showAs": " 156. Deputy Christopher O'Sullivan asked the Minister for Transport if his Department has received applications from Cork County Council for improvement grant aid towards the R572 each year since 2000; and if he will make a statement on the matter. [41341/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_156",
        "debateSection": {
          "debateSectionId": "dbsect_137",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_137",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_137.xml"
            },
            "pdf": null
          },
          "showAs": "Road Projects"
        },
        "answerText": " Minister for Transport (Deputy Eamon Ryan)  I propose to take Questions Nos. 156 and 178 together.  In accordance with the provisions of Section 13 of the Roads Act 1993, each local authority has statutory responsibility for the improvement and maintenance of their regional and local roads. Works on those roads are funded from local authorities' own resources and are supplemented by State Road grants. Of these grants, the vast majority (approximately 90%) are targeted at the maintenance and renewal of the network with c. 10% of the remaining funding invested in new roads/bridges or for road realignments.  Any road improvement projects proposed by local authorities for consideration for funding are assessed by the Department on a case-by-case basis. All projects put forward by local authorities for consideration must comply with the requirements of the Infrastructure Guidelines (formerly the Public Spending Code) and the Department's Transport Appraisal Framework. Given the limited funding available for regional and local road improvement works it is important for local authorities to prioritise projects within their overall area of responsibility with these requirements in mind.  Funding has been provided for three Specific Improvement Grant schemes on the R572 between 2000 and 2024 as follows:  • SG: R572 Castletownbere Road received funding from the Department between 2010 and 2012.  • SG: R572 Loughavaul Pavement Strengthening received funding from the Department between 2013 and 2015.  • SG: R572 Realignment at Adrigole is an ongoing scheme which first received funding under the Specific Improvement Grant in 2023.  Details of the regional and local road grant allocations and payments to local authorities are outlined in the regional and local road allocations and payments booklets which are available on the Oireachtas Digital Library.  Cork County Council received an allocation of €50,000 this year under the Specific Improvement Grant Programme for the R572 Realignment project. Planning and implementation of the R572 Realignment project is the responsibility of Cork County Council. ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan"
        },
        "questionNumber": 178,
        "showAs": " 178. Deputy Christopher O'Sullivan asked the Minister for Transport if he will confirm the allocation under the specific improvement grants from 2000 to 2024 for the R572 regional road to Castletownbere fishing port, in tabular form; and if he will make a statement on the matter.  [41340/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_178",
        "debateSection": {
          "debateSectionId": "dbsect_137",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_137",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_137.xml"
            },
            "pdf": null
          },
          "showAs": "Road Projects"
        },
        "answerText": " Minister for Transport (Deputy Eamon Ryan)  I propose to take Questions Nos. 156 and 178 together.  In accordance with the provisions of Section 13 of the Roads Act 1993, each local authority has statutory responsibility for the improvement and maintenance of their regional and local roads. Works on those roads are funded from local authorities' own resources and are supplemented by State Road grants. Of these grants, the vast majority (approximately 90%) are targeted at the maintenance and renewal of the network with c. 10% of the remaining funding invested in new roads/bridges or for road realignments.  Any road improvement projects proposed by local authorities for consideration for funding are assessed by the Department on a case-by-case basis. All projects put forward by local authorities for consideration must comply with the requirements of the Infrastructure Guidelines (formerly the Public Spending Code) and the Department's Transport Appraisal Framework. Given the limited funding available for regional and local road improvement works it is important for local authorities to prioritise projects within their overall area of responsibility with these requirements in mind.  Funding has been provided for three Specific Improvement Grant schemes on the R572 between 2000 and 2024 as follows:  • SG: R572 Castletownbere Road received funding from the Department between 2010 and 2012.  • SG: R572 Loughavaul Pavement Strengthening received funding from the Department between 2013 and 2015.  • SG: R572 Realignment at Adrigole is an ongoing scheme which first received funding under the Specific Improvement Grant in 2023.  Details of the regional and local road grant allocations and payments to local authorities are outlined in the regional and local road allocations and payments booklets which are available on the Oireachtas Digital Library.  Cork County Council received an allocation of €50,000 this year under the Specific Improvement Grant Programme for the R572 Realignment project. Planning and implementation of the R572 Realignment project is the responsibility of Cork County Council. ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan"
        },
        "questionNumber": 238,
        "showAs": " 238. Deputy Christopher O'Sullivan asked the Minister for Public Expenditure, National Development Plan Delivery and Reform the annual Exchequer funding provided for measures (details supplied); and to outline current policy in these areas, in tabular form.  [40971/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_238",
        "debateSection": {
          "debateSectionId": "dbsect_202",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_202",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_202.xml"
            },
            "pdf": null
          },
          "showAs": "Office of Public Works"
        },
        "answerText": " Minister of State at the Department of Public Expenditure, National Development Plan Delivery and Reform (Deputy Kieran O'Donnell)  Additional time is needed to collate the information requested by the Deputy. The Office of Public Works will respond directly to the Deputy on this matter. ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan"
        },
        "questionNumber": 481,
        "showAs": " 481. Deputy Christopher O'Sullivan asked the Minister for Agriculture, Food and the Marine the full-year cost of all tillage sector supports in 2024 and 2025, in tabular form; the breakdown per scheme; and the annual cost of schemes (details supplied). [41039/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_481",
        "debateSection": {
          "debateSectionId": "dbsect_433",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_433",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_433.xml"
            },
            "pdf": null
          },
          "showAs": "Tillage Sector"
        },
        "answerText": " Minister for Agriculture, Food and the Marine  The Tillage Sector has been allocated additional funding in both 2024 and 2025, above the annual €20m already provided via the Cap Strategic Programme for both the Protein and Straw Incorporation Measures.  The additional Tillage Top Up and Unharvested Crop Loss expenditure of €14.3M realised in early 2024, was in respect of cereal crops planted during Winter 22 - Spring 23 season.  The Tillage Support measure of €30m recently announced as part of Budget 2025 will be based on Tillage and Horticulture crops planted during Winter 23 - Spring 24 season.  A residual maintenance payment in respect of Tillage area converted in 2023 and maintained into 2024 estimated at €1.4m, will also be paid in 2024.  The table below sets out the various payments by year:     Scheme    2024    2025      Protein    €10m    €10m      SIM    €10    €10m      Tillage Top Up    €12.65M    ---      Unharvested Cro Loss    €1.65M    ---      Tillage Support    ---    €30m      Tillage Incentive Scheme    €1.4M    ---    ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan"
        },
        "questionNumber": 482,
        "showAs": " 482. Deputy Christopher O'Sullivan asked the Minister for Agriculture, Food and the Marine the full-year cost of all organic sector supports in 2024 and 2025, in tabular form; and the breakdown per scheme. [41040/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_482",
        "debateSection": {
          "debateSectionId": "dbsect_434",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_434",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_434.xml"
            },
            "pdf": null
          },
          "showAs": "Organic Farming"
        },
        "answerText": " Minister for Agriculture, Food and the Marine  My Department is committed to meeting our target of 10% of all agricultural land being farmed organically by 2030.  There has been a very strong uptake of the Organic Farming Scheme over the last three years, most recently in December 2023, when a further 1,000 farmers joined the Scheme. This means that, this year, there will be approximately 5,000 organic farmers in Ireland farming approximately 5% of the land. A key element of this is providing the infrastructure and support to both those farmers looking to convert to organic and those who have already converted.  Outlined in the below tables are the expenditure allocations for 2024 and the budget for 2025 for all organic sector supports:     Scheme    2024    2025      Organic Processing Investment Grant    €1.5 million    €3.5 million      Organic Farming Scheme    €57 million    €67 million                 Subvention to certification bodies for farm Inspections    €900,000    €1 million      Development of the Organic Sector    €500,000    €1 million      In addition, the Targeted Agricultural Modernisation Scheme (TAMS) supports organic farmers at a grant rate of 60%. To date,over €1.8 million has been paid in grant aid under the Organic Capital Investment Scheme of TAMS 3 in 2024. ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan"
        },
        "questionNumber": 483,
        "showAs": " 483. Deputy Christopher O'Sullivan asked the Minister for Agriculture, Food and the Marine the estimated annual cost of supports currently being provided for supports (details supplied). [41041/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_483",
        "debateSection": {
          "debateSectionId": "dbsect_435",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_435",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_435.xml"
            },
            "pdf": null
          },
          "showAs": "Agriculture Supports"
        },
        "answerText": " Minister for Agriculture, Food and the Marine  My Department has provided a number of schemes in support of extreme weather/flooding in recent years. These include the Shass Landslide Scheme, the Shannon Callows Flood Scheme, the Unharvested Crop Loss Support Scheme, the Fodder Transport Support Scheme and most recently the Cooley Flood Damage Relief Scheme.  Please see table below outlining the cost associated with the most recent schemes, as of 14/10/2024. Further payments may issue under the various schemes depending on the outcome of reviews and appeals etc. Payment have not commenced for the Fodder Transport Support Scheme and the Cooley Flood Damage Relief Scheme.     Scheme    Cost (as of 11/10/2024)      Shass Landslide Scheme    €0.34 million      Shannon Callows Flood Scheme    €0.75 million      Unharvested Crop Loss Support Scheme    €1.67 million      Fodder Transport Support Scheme    Payments yet to issue      Cooley Flood Damage Relief Scheme    Payments yet to issue    ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan"
        },
        "questionNumber": 484,
        "showAs": " 484. Deputy Christopher O'Sullivan asked the Minister for Agriculture, Food and the Marine the estimated annual cost of supports currently provided for schemes (details supplied). [41042/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_484",
        "debateSection": {
          "debateSectionId": "dbsect_437",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_437",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_437.xml"
            },
            "pdf": null
          },
          "showAs": "Agriculture Supports"
        },
        "answerText": " Minister for Agriculture, Food and the Marine  I wish to inform the Deputy that the 2024 allocations for my department's agri-environmental Schemes is set out in the following table.     SCHEME    2024 Allocation €000      B.3 - AGRI-ENVIRONMENTAL SCHEMES    92,499      B.4 - AREAS OF NATURAL CONSTRAINT SCHEME    247,000      B.10 - FORESTRY & BIO ENERGY*    115,000      B.14 - AGRI-CLIMATE RURAL ENVIRONMENT SCHEME    200,000      B.15 - ORGANIC FARMING SCHEME    47,000      SUCKLER CARBON EFFICIENCY PROGRAMME    52,000      NATIONAL GENOTYPING PROGRAMME    5,000     *2024 forestry allocation includes €18 million of the Department's 2023 deferred capital surrender.  Subhead B.3 Agri-Environmental Schemes consists of a number of schemes including:  • GLAS  • Locally led Agri-Environmental Schemes  • Traditional Buildings  • Other Agri Environmental Initiatives (e.g. Soil Sampling, Multi-species Sward Measure and Red Clover Silage Measure)  • An agri-environment Targeted Agricultural Modernisation Scheme (TAMS) and an Organic Farming scheme. These schemes will ultimately be funded from the European Union Recovery Instrument  • Straw Incorporation Measure  In addition to the measures outlined above the Suckler Carbon Efficiency Programme (SCEP) provides support to beef farmers to improve the environmental sustainability of the national beef herd. The programme aims to build on the gains delivered in recent years through the Beef Data and Genomics Programme (BDGP) and the Beef Environmental Efficiency Programme (BEEP) by improving the genetic merit of the Irish suckler herd, to reduce the carbon footprint of Irish beef. ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan"
        },
        "questionNumber": 485,
        "showAs": " 485. Deputy Christopher O'Sullivan asked the Minister for Agriculture, Food and the Marine the estimated annual cost of a scheme (details supplied). [41043/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_485",
        "debateSection": {
          "debateSectionId": "dbsect_438",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_438",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_438.xml"
            },
            "pdf": null
          },
          "showAs": "Agriculture Schemes"
        },
        "answerText": " Minister for Agriculture, Food and the Marine  The Targeted Agricultural Modernisation Scheme (TAMS 3), which is a measure under the CAP Strategic Plan 2023-2027, supports a number of measures to improve water quality. There is an indicative budget of €370 million available for the period 2023-2027 for all TAMS 3 measures, and all investments must be linked to Climate, Environment or Animal Welfare.  The existing measures included in TAMS 3 already contribute to improved water quality.  In particular, the LESS scheme includes measures that contribute to better water quality. The investment items are specifically designed to minimise the surface area to which slurry is applied and ensure that slurry is targeted directly onto the soil, thus avoiding run-off into watercourses.  The installation of solar-powered water pumps and nose pumps, which provides livestock with clean drinking water without requiring direct access to watercourses, is a further measure under TAMS to improve water quality,  I recently announced the opening of the Nutrient Importation Storage Scheme as part of TAMS 3. This measure will have a positive impact on water quality and overall emissions from the sector by encouraging farmers to import organic fertiliser, thus reducing the use of chemical fertilisers on these holdings.  This scheme, together with the enhanced 60% grant aid for all nutrient storage, subject to Commission approval, will assist in achieving improved water quality. This support will provide improved nutrient storage and more appropriate use of all organic manures in times of unpredictable weather patterns.  I will ensure that the list of investment items will continue to be reviewed on a regular basis. The inclusion of further investment categories will, of course, be dependent on the availability of the required funding under the TAMS 3 schemes. ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan"
        },
        "questionNumber": 486,
        "showAs": " 486. Deputy Christopher O'Sullivan asked the Minister for Agriculture, Food and the Marine the Exchequer funding allocated to the sustainability support and advisory programme in 2024 and 2025; the 2024 funding allocation, by current and capital funding; and the number of full- and part-time staff working directly on the programme in his Department, in tabular form. [41044/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_486",
        "debateSection": {
          "debateSectionId": "dbsect_439",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_439",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_439.xml"
            },
            "pdf": null
          },
          "showAs": "Departmental Funding"
        },
        "answerText": " Minister for Agriculture, Food and the Marine  The Agricultural Sustainability Support and Advisory Programme (ASSAP) is a Government and industry funded initiative which commenced in 2018 to facilitate improvements in water quality. Supported by my Department, the Department of Housing, Local Government and Heritage (DHLGH), and by Dairy Industry Ireland, ASSAP involves both Teagasc, and industry employed advisers working with farmers in a confidential and voluntary manner to improve water quality.  ASSAP currently involves a resource of ~50 advisers of which 20 are funded by Government. In addition, Government funds two ASSAP support posts. Of the 22 posts funded by Government, my Department supports four advisers through the Agricultural Catchments Programme (ACP), with a further five permanent advisers working on the Programme funded from my Department's grant aid to Teagasc as well as Teagasc's own resources. The funding for a further 13 posts (11 advisers, one administrative resource, and the ASSAP programme manager) is provided by DHLGH.  Details of the salary and travel and subsistence allocated to ASSAP by my Department as well as Teagasc's own resources are detailed in Table 1. The funding for the 13 posts supported by DHLGH is a matter for my colleague, Minister O'Brien.  All funding provided by my Department is from Current Expenditure cost centres and this funding is administered and overseen by my staff as part of their normal work. My Department does not have any staff working directly on the programme.  Table 1: Funding Allocated to ASSAP by the Department of Agriculture, Food and the Marine (DAFM) and Teagasc     Year    Funded by    No. of Advisers    Salary Cost Allocated    Travel & Subsistence Cost Allocated      2024    DAFM through the ACP    4    €262,625    €32,000      2024    DAFM grant aid to Teagasc/Teagasc own resources    5    €300,603    €28,699      2025    DAFM through the ACP    4    €284,711    €32,000      2025    DAFM grant aid to Teagasc/Teagasc own resources    5    €344,579    €29,000     Note: Table 1 does not include posts and funding supported by DHLGH ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan"
        },
        "questionNumber": 487,
        "showAs": " 487. Deputy Christopher O'Sullivan asked the Minister for Agriculture, Food and the Marine the total amount invested over the 2020 to 2024 period in current and capital expenditure in local piers and harbours, by relevant county, in tabular form. [41045/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_487",
        "debateSection": {
          "debateSectionId": "dbsect_440",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_440",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_440.xml"
            },
            "pdf": null
          },
          "showAs": "Harbours and Piers"
        },
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 487 and 488 together.  The responsibility for the development and maintenance of Local Authority owned piers, harbours and slipways rests with each Local Authority in the first instance. I am also mindful that the primary governance role for local authorities rests with the Minister for Housing, Local Government and Heritage and any wider funding issues for local authorities should be addressed to that Minister.  My Department administers Local Authority Marine Infrastructure Schemes for capital works undertaken by the Local Authorities. Funding for individual projects is allocated in advance of project commencement. My Department reimburses the Local Authorities the eligible project costs (pro-rata) on a matured liability basis following inspection of the capital works and verification of the evidenced expenditure. The focus of the Schemes is to support actual capital works and it is a matter for each Local Authority to progress any preparatory studies, permitting and design works. Therefore, if the Deputy requires overall investment (project costs), each Local Authority would be best positioned to provide same.  In 2020 and 2021, the Local Authorities were reimbursed €2.4m and €3.5m respectively for capital projects completed under the Fishery Harbour and Coastal Infrastructure Development Programmes for those years. Through the Brexit Adjustment Local Authority Marine Infrastructure (BALAMI) Scheme 2022-2023, my Department provided an unprecedented level of funding, reimbursing the Local Authorities a total of €37.8m over 2022 and 2023, of which €35.4m was funded by the Brexit Adjustment Reserve and €2.4m was supported by the National Exchequer (Brexit Adjustment Reserve does not provide for reimbursement of VAT).  In January of this year, I announced the allocation of €12.7m for 15 local authority marine infrastructure projects. Details of the announcement and project allocations are available in tabular form online at gov - Minister McConalogue announces funding of €12.7million for Local Authority Marine Infrastructure (www.gov.ie) . These projects were previously put forward by the Local Authorities under the Brexit Adjustment Local Authority Marine Infrastructure (BALAMI) Scheme 2022-2023. To date in 2024 over €2.5m has been reimbursed to the Local Authorities with over €2.3m of that being funded from the Brexit Adjustment Reserve and the balance supported by the National Exchequer.  The attached table details the funding administered by my Department in the period 2020-2023, and the funding allocated in 2024 under the Local Authority Marine Infrastructure Schemes. Final expenditure for 2024 will not be available until after the Scheme closes at the end of the year.   Funding to the local authorities  ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan"
        },
        "questionNumber": 488,
        "showAs": " 488. Deputy Christopher O'Sullivan asked the Minister for Agriculture, Food and the Marine to outline current annual funding provided for initiatives (details supplied); and the breakdown, by scheme/funding stream if available, in tabular form. [41046/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_488",
        "debateSection": {
          "debateSectionId": "dbsect_440",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_440",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_440.xml"
            },
            "pdf": null
          },
          "showAs": "Harbours and Piers"
        },
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 487 and 488 together.  The responsibility for the development and maintenance of Local Authority owned piers, harbours and slipways rests with each Local Authority in the first instance. I am also mindful that the primary governance role for local authorities rests with the Minister for Housing, Local Government and Heritage and any wider funding issues for local authorities should be addressed to that Minister.  My Department administers Local Authority Marine Infrastructure Schemes for capital works undertaken by the Local Authorities. Funding for individual projects is allocated in advance of project commencement. My Department reimburses the Local Authorities the eligible project costs (pro-rata) on a matured liability basis following inspection of the capital works and verification of the evidenced expenditure. The focus of the Schemes is to support actual capital works and it is a matter for each Local Authority to progress any preparatory studies, permitting and design works. Therefore, if the Deputy requires overall investment (project costs), each Local Authority would be best positioned to provide same.  In 2020 and 2021, the Local Authorities were reimbursed €2.4m and €3.5m respectively for capital projects completed under the Fishery Harbour and Coastal Infrastructure Development Programmes for those years. Through the Brexit Adjustment Local Authority Marine Infrastructure (BALAMI) Scheme 2022-2023, my Department provided an unprecedented level of funding, reimbursing the Local Authorities a total of €37.8m over 2022 and 2023, of which €35.4m was funded by the Brexit Adjustment Reserve and €2.4m was supported by the National Exchequer (Brexit Adjustment Reserve does not provide for reimbursement of VAT).  In January of this year, I announced the allocation of €12.7m for 15 local authority marine infrastructure projects. Details of the announcement and project allocations are available in tabular form online at gov - Minister McConalogue announces funding of €12.7million for Local Authority Marine Infrastructure (www.gov.ie) . These projects were previously put forward by the Local Authorities under the Brexit Adjustment Local Authority Marine Infrastructure (BALAMI) Scheme 2022-2023. To date in 2024 over €2.5m has been reimbursed to the Local Authorities with over €2.3m of that being funded from the Brexit Adjustment Reserve and the balance supported by the National Exchequer.  The attached table details the funding administered by my Department in the period 2020-2023, and the funding allocated in 2024 under the Local Authority Marine Infrastructure Schemes. Final expenditure for 2024 will not be available until after the Scheme closes at the end of the year.   Funding to the local authorities  ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan"
        },
        "questionNumber": 489,
        "showAs": " 489. Deputy Christopher O'Sullivan asked the Minister for Agriculture, Food and the Marine the annual funding provided for incentives (details supplied). [41047/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_489",
        "debateSection": {
          "debateSectionId": "dbsect_441",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_441",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_441.xml"
            },
            "pdf": null
          },
          "showAs": "Departmental Funding"
        },
        "answerText": " Minister for Agriculture, Food and the Marine  At present there are no state funded incentives in place for payments directly to fishing vessels to incentivise fish landings into Irish ports. Any such incentive is likely to be contrary to internal market rules.  Significant investment has been made in the infrastructure and facilities available at the State owned Fisheries Harbour Centres to support fish landings from both Irish and other fleets.  Funding supports for the fishing sector are provided under the Seafood Development Programme (SDP). The SDP is co-funded by the Irish Government and the EU Commission under the European Maritime, Fisheries and Aquaculture Fund (EMFAF) 2021-2027. To be eligible for funding all measures must be in compliance with the provisions of the EMFAF regulation, which in turns is aligned with the objectives of the Common Fisheries Policy (CFP). ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08",
          "showAs": "Christopher O'Sullivan"
        },
        "questionNumber": 503,
        "showAs": " 503. Deputy Christopher O'Sullivan asked the Minister for Agriculture, Food and the Marine the full-year cost of all fishing/marine sector supports/schemes in 2024 and 2025, in tabular form; and the annual current and capital funding breakdown, per scheme, including several schemes (details supplied). [41080/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_503",
        "debateSection": {
          "debateSectionId": "dbsect_455",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_455",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_455.xml"
            },
            "pdf": null
          },
          "showAs": "Fishing Industry"
        },
        "answerText": " Minister for Agriculture, Food and the Marine  Funding for supports for the commercial seafood sector are provided under the Seafood Development Programme (SDP). The SDP is co-funded by the Irish Government and the EU Commission under the European Maritime, Fisheries and Aquaculture Fund (EMFAF) 2021-2027.  There are a number of schemes currently open for applications, which are administered by Bord Iascaigh Mhara (BIM) as an agency of my Department. Details of schemes that are currently open for applications can be found at www.bim.ie .  Budget Allocation & Spend 2024  Details of the 2024 budget allocation and spend-to-date for schemes opened in 2024 are set out in the following table.  It should be noted that the figures below reflect the fact that these schemes opened to applications in recent months, and particularly in the case of capital investment schemes it is anticipated that a significant proportion of applicants approved for funding in 2024 will be drawing down their grant aid in 2025.  It should further be noted that the level of demand for all open schemes for industry is being kept under close review by BIM, and there may be some adjustment of budget allocation to individual schemes in light of demand in order to ensure that the overall available budget is utilised to the maximum degree possible.  *Please note that the Fleet Safety & Marine Tourism Safety Schemes are exchequer funded schemes     Scheme Name    2024 spend    No. of Applications to date    2024 Allocation    Current/Capital      Fleet Safety Scheme*    €438,179    139    €700,000    Capital      Marine Tourism Safety Scheme*    €17,118    7    €70,000    Capital      Seafood Training Scheme    €68,883    126    €70,000    Current      Inshore Fisheries Scheme - V-notching    €00.00    116    €350,000    Current      Seafood Training Scheme - Upskilling Individuals    €00.00    146    €175,000    Current      Producer Organisation Scheme    €00.00    5    €320,000    Current      Inshore Fleet Economic Assessment Scheme    €00.00    511    €1,500,000    Current      Small Scale Coastal Fisheries Scheme    €00.00    39    €350,000    Capital      Sustainable Fisheries Scheme    €00.00    46    €600,000     Capital       Young Fisher Scheme    €00.00    4    €230,000    Capital      Seafood Processing Capital Investment Scheme    €00.00    8    €2,250,000    Capital      Sustainable Aquaculture Scheme    €00.00    24    €300,000    Capital      Seafood Capacity Building Scheme    €00.00    8    €15,000    Current     Budget Allocation 2025  At present it is not possible to provide a breakdown of the budget allocation for individual schemes in 2025.  The overall budget allocation to BIM in 2025 to support implementation of measures funded under the SDP is approximately €34.16 million. This budget allocation will support not only the industry schemes, but a range of measures undertaken by BIM as part of its work programme. This allocation for 2025 reflects an increase in budget, in light of the anticipated demand across all industry schemes administered by BIM into 2025. However the precise allocation for each individual scheme for 2025 cannot be finalised until the Revised Estimates Volume (REV) is published. ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "contextDate": "2024-10-10",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-10/writtens/mul@/dbsect_190.xml"
            }
          },
          "debateSectionId": "dbsect_190",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-10/writtens/dbsect_190",
          "showAs": "Departmental Schemes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-10/pq_192",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 192,
        "showAs": " 192. Deputy Christopher O'Sullivan asked the Minister for Housing, Local Government and Heritage the steps being taken to increase the period of time over which successful croí cónaithe grants can be drawn down (details supplied); and if he will make a statement on the matter. [40783/24] ",
        "answerText": " Minister for Housing, Local Government and Heritage  Pathway 4 of Housing for All sets out a blueprint to address vacancy and make efficient use of our existing housing stock.  The Vacant Property Refurbishment Grant, introduced in July 2022 under the Croí Cónaithe Towns Fund, supports bringing vacant and derelict properties back into use as homes. A grant of up to €50,000 is available for the refurbishment of vacant properties for occupation as a principal private residence and for properties which will be made available for rent. Where the refurbishment costs are expected to exceed the standard grant of up to €50,000, a top-up grant amount of up to €20,000 is available where the property is confirmed by the applicant to be derelict or where the property is already on the local authority’s Derelict Sites Register, bringing the total grant available for a derelict property up to a maximum of €70,000.  The grant is available in respect of vacant and derelict properties built up to and including 2007, in towns, villages, cities and rural areas.  In order to support the timely delivery of properties back into use, from May 2023, once a Vacant Property Refurbishment Grant application receives approval, applicants must complete works applied for within a period of 13 months. In exceptional circumstances, where an applicant is experiencing particular issues and cannot complete the works applied for under the grant within the 13 month period, the local authority may consider and grant an extension of the approval period at their discretion. My Department issued a circular to all local authorities in October 2023 in this regard.  When the Croí Cónaithe Towns Fund was launched, a commitment was given that a review of the schemes under it, including the Vacant Property Refurbishment Grant, would be undertaken by mid 2024. The review has now been completed and I am now considering its contents. The matter of the timeline for completion of works has been considered as part of the review. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-10-10",
        "by": {
          "showAs": "Christopher O'Sullivan",
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-10",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-10/writtens/mul@/dbsect_184.xml"
            }
          },
          "debateSectionId": "dbsect_184",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-10/writtens/dbsect_184",
          "showAs": "Housing Schemes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-10/pq_193",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 193,
        "showAs": " 193. Deputy Christopher O'Sullivan asked the Minister for Housing, Local Government and Heritage to review the practice of including child maintenance payments in housing applications (details supplied); and if he will make a statement on the matter. [40784/24] ",
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 185 and 193 together.  Applications for social housing support are assessed by the relevant local authority, in accordance with the eligibility and need criteria set down in section 20 of the Housing (Miscellaneous Provisions) Act 2009 and the associated Social Housing Assessment Regulations 2011, as amended.The 2011 Regulations prescribe maximum net income limits for each local authority, in different bands according to the area concerned, with income being defined and assessed according to a standard Household Means Policy.Under the Policy, net income for social housing assessment is defined as gross household income less income tax, PRSI, Universal Social Charge and Additional Superannuation Contribution. The Policy provides for a range of income disregards, and local authorities have discretion to decide to disregard income that is temporary, short-term or once-off in nature. However, with the exception of the specific payments listed in the Policy as being disregarded, all income from social insurance and social assistance payments, allowances and benefits, and maintenance payments received is assessable. My Department is currently in the process of reviewing assessable and non assessable income under the Household Means Policy in order to ensure it continues to be appropriate.  In relation to rent calculations, local authorities set and collect rents on their dwellings in accordance with section 58 of the Housing Act 1966. The making or amending of such rent schemes is generally a matter for local authorities within broad principles set out by my Department, including that rent levels should be based on income and reflect tenants’ ability to pay.  Local discretion and flexibility are inherent in the devolved administration of rent schemes and different approaches are taken to rent setting across local authorities. Accordingly, decisions regarding the sources of income included and disregarded for rent assessment purposes, including child maintenance, are matters for individual local authorities. I have no role in this regard. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-10-10",
        "by": {
          "showAs": "Christopher O'Sullivan",
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-10",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-10/writtens/mul@/dbsect_243.xml"
            }
          },
          "debateSectionId": "dbsect_243",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-10/writtens/dbsect_243",
          "showAs": "Horse Racing Industry"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-10/pq_244",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 244,
        "showAs": " 244. Deputy Christopher O'Sullivan asked the Minister for Agriculture, Food and the Marine the steps being taken to reduce the delays in the processing of equine passports; and if he will make a statement on the matter. [40775/24] ",
        "answerText": " Minister for Agriculture, Food and the Marine  My Department is aware of delays in the processing of equine passport applications at Horse Sport Ireland (HSI).  This is an operational matter for HSI. My Department has however met with HSI to stress the importance of prompt identification of equines and the need for swift turnaround times in the issuing of identification documents.  My Department has emphasised the need for this situation to improve and for HSI to keep their customers up to date on the status of their passport applications.  I am continuing to monitor this matter closely. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-10-10",
        "by": {
          "showAs": "Christopher O'Sullivan",
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2024-10-10",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-10/writtens/mul@/dbsect_261.xml"
            }
          },
          "debateSectionId": "dbsect_261",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-10/writtens/dbsect_261",
          "showAs": "Hospital Equipment"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-10/pq_262",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 262,
        "showAs": " 262. Deputy Christopher O'Sullivan asked the Minister for Health the steps being taken to increase the number of outpatient paediatric hospital rooms in Cork University Hospital that are fitted with a ceiling track hoist (details supplied); and if he will make a statement on the matter. [40777/24] ",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-10-10",
        "by": {
          "showAs": "Christopher O'Sullivan",
          "memberCode": "Christopher-O'Sullivan.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Christopher-O'Sullivan.D.2020-02-08"
        }
      }
    }
  ]
}