{
  "head": {
    "counts": {
      "questionCount": 2163,
      "resultCount": 2163
    }
  },
  "results": [
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-04-16/pq_290",
        "questionNumber": 290,
        "house": {
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail"
        },
        "to": {
          "roleCode": null,
          "uri": null,
          "roleType": null,
          "showAs": "Education"
        },
        "debateSection": {
          "debateSectionId": "dbsect_244",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-16/writtens/dbsect_244",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-16/writtens/mul@/dbsect_244.xml"
            }
          },
          "showAs": "Schools Building Projects"
        },
        "showAs": " 290. Deputy Peter Burke asked the Minister for Education if she will provide an update on an application for additional modular classrooms for a school (details supplied); and if she will make a statement on the matter. [16051/24] ",
        "answerText": " Minister for Education  I can confirm to the Deputy, that my Department is in receipt of an application for additional accommodation from the school in question.  The purpose of my Department’s Additional School Accommodation (or ASA) scheme is to ensure that essential mainstream classroom accommodation and accommodation for pupils with special education needs is available to cater for pupils enrolled each year, where the need cannot be met by the school’s existing accommodation or at other schools in the area.  At primary level, this situation generally arises to cater for a school’s accommodation requirements where an additional teaching post has been sanctioned by Teacher Allocation Section, or the requirement for a new class for pupils with special education needs has been identified by the National Council for Special Education (NCSE), and all available alternative accommodation within the school is already being used for classroom purposes. The capacity at other schools in the area is also considered as part of the assessment of any accommodation needs.  The National Council for Special Education (NCSE) has the responsibility for planning and coordinating school supports for children with special educational needs.  The Department engages intensely with the NCSE in relation to the forward planning of new special classes and additional special school places. This forward planning work is well underway ahead of the 2024/25 school year. This work involves a detailed review of statistical data in relation to forecasting demand for special class places, an analysis of available school accommodation, consideration of improved data sharing arrangements and a particular focus on the provision of special classes at post-primary level. In planning and providing for additional school accommodation, the Department must also have regard to construction inflation pressures and competing demands on suppliers of modular accommodation and project management services.  In general, demographics have been falling at primary level and are due to continue to decrease. Therefore the Department considers it prudent to maximise the use of existing spare accommodation capacity at primary level in the first instance, before considering any applications for further accommodation needs. This is in line with public spending requirements. In relation to the provision of primary special classes, the shared preference of both the Department and the NCSE is to use and reconfigure existing school accommodation to provide special classes. Given the number of primary special classes available already and the falling demographics, it is also likely that most of the new additional special classes may be required in larger population centres in a local school planning area.  At local level, the NCSE is currently reviewing the overall demand for such provision in the area alongside the availability of space in local schools. The NCSE and the Department continue to engage on a regular basis in relation to the provision of additional special education placements.  My officials will be in touch with the school authorities as soon as possible in relation to their application, once the NCSE has completed their review of the demand in the area. ",
        "questionType": "written",
        "by": {
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03",
          "showAs": "Peter Burke"
        },
        "date": "2024-04-16"
      },
      "contextDate": "2024-04-16"
    },
    {
      "contextDate": "2024-04-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-09/writtens/mul@/dbsect_166.xml"
            }
          },
          "debateSectionId": "dbsect_166",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-09/writtens/dbsect_166",
          "showAs": "Bus Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-04-09/pq_173",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 173,
        "showAs": " 173. Deputy Peter Burke asked the Minister for Transport if he will review the public and private bus transport available (details supplied) in light of recent announcements of service withdrawal; what measures are in place to service this route; and if he will make a statement on the matter. [13602/24] ",
        "answerText": " Minister for Transport  As Minister for Transport, I am responsible for policy and overall funding in relation to public transport. However, I am not involved in day-to-day operational matters. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling of those services in conjunction with the relevant transport operators.  While most public transport in Ireland comprises the bus and rail services funded through the NTA’s public service obligation (PSO) programme, there is part of the national public transport system that comprises non-subvented bus services, which are run on a commercial basis by bus and coach businesses of varying sizes throughout the country. As a commercial operator, any decisions taken by Aircoach regarding routes scheduling and timetabling are a matter for the company, the NTA has no powers to refuse an application from an operator to reduce or withdraw services on a commercial route.  In circumstances where a commercial operator ceases operating a specific route, such as Aircoach route 706/706X, the NTA undertakes an examination to determine whether, with the discontinuation of the commercial service, it is necessary for a replacement PSO service to be introduced to ensure no loss of connectivity to the travelling public. This process includes an assessment of the level of demand for public transport services in the affected area, an evaluation of whether existing PSO services can be reconfigured to meet any shortfall, or whether it is necessary to competitively tender for the provision of services.  Given the NTA's statutory responsibility for securing the provision of public passenger transport services nationally, I have also forwarded the Deputy's question to the NTA for reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-04-09",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-04-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-09/writtens/mul@/dbsect_442.xml"
            }
          },
          "debateSectionId": "dbsect_442",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-09/writtens/dbsect_442",
          "showAs": "Schools Building Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-04-09/pq_466",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 466,
        "showAs": " 466. Deputy Peter Burke asked the Minister for Education if a building unit site visit can be facilitated for two schools (details supplied) in County Westmeath; and if she will make a statement on the matter. [14364/24] ",
        "answerText": " Minister for Education  I can confirm to the Deputy, that my Department received a request to amalgamate, from the schools in question, in June 2022.  In March 2023, the school authorities were advised that the Department had no objection to the amalgamation, contingent on no capital funding being provided. The school authorities advised that their Boards of Management would give further consideration to the issue and revert to the Department in due course. However, to date there has been no correspondence from the school in relation to the matter.  I wish to advise the Deputy, that funding was provided for the provision of 1 x Special Education Modular Classroom, under the Additional School Accommodation (ASA) scheme, for one of the schools in question in 2023. The modular accommodation has been delivered on site and the class has since opened. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-04-09",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-04-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-09/writtens/mul@/dbsect_884.xml"
            }
          },
          "debateSectionId": "dbsect_884",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-09/writtens/dbsect_884",
          "showAs": "Agriculture Schemes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-04-09/pq_956",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 956,
        "showAs": " 956. Deputy Peter Burke asked the Minister for Agriculture, Food and the Marine when a TAMS 3 grant will be paid to a farmer (details supplied); and if he will make a statement on the matter. [14045/24] ",
        "answerText": " Minister for Agriculture, Food and the Marine  The person named submitted an application on 14 December 2023 for a slurry tanker and trailing shoe under the Low Emission Slurry Spreading Scheme, which is a measure under TAMS 3.  This application has passed all the initial administrative checks and has now proceeded for further technical checks at the local regional office. I would advise that, as this is a mobile investment application, the person named may proceed with that investment at their own risk before formal approval issues.  Once formal approval has issued, the applicant will be able to upload their claim for payment on the online TAMS system. My Department is currently focusing on the issuing of approvals, so it is expected that the processing of payments will commence once the issuing of approvals in respect of applications on hand has been completed. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-04-09",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-04-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-09/writtens/mul@/dbsect_1007.xml"
            }
          },
          "debateSectionId": "dbsect_1007",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-04-09/writtens/dbsect_1007",
          "showAs": "Care Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-04-09/pq_1091",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1091,
        "showAs": " 1091. Deputy Peter Burke asked the Minister for Children, Equality, Disability, Integration and Youth when funding issues will be resolved at a section 39 organisation (details supplied); and if he will make a statement on the matter. [14037/24] ",
        "answerText": " Minister of State at the Department of Children, Equality, Disability, Integration and Youth  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-04-09",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-03-21",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-21/writtens/mul@/dbsect_169.xml"
            }
          },
          "debateSectionId": "dbsect_169",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-21/writtens/dbsect_169",
          "showAs": "Road Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-21/pq_164",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 164,
        "showAs": " 164. Deputy Peter Burke asked the Minister for Transport when funding will be allocated to a project (details supplied); the timeframe for the delivery of this project; and if he will make a statement on the matter. [13392/24] ",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport.  The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally. The NTA also has national responsibility for integrated local and rural transport, including the rollout of new and enhanced Town services.  In light of the NTA's responsibilities for public transport services in County Westmeath, I have referred your question to the NTA for direct reply to you. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-21",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-03-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/mul@/dbsect_229.xml"
            }
          },
          "debateSectionId": "dbsect_229",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/dbsect_229",
          "showAs": "Tax Code"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-20/pq_260",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 260,
        "showAs": " 260. Deputy Peter Burke asked the Minister for Finance if he has plans to extend benefit-in-kind taxation from January 2025; and if he will make a statement on the matter. [12783/24] ",
        "answerText": " Minister for Finance  I am answering this question in reference to the temporary changes to vehicle BIK provided in sections 7 and 8 in Finance Act (No. 2) 2023.  The Government remains committed to the environmental rationale behind the current emissions-based vehicle benefit-in-kind (BIK) regime, which has been in operation since 1 January 2023. Since this date, the amount taxable as BIK continues to be determined by the car’s Original Market Value (OMV) and the annual business kilometres driven, while new CO2 emissions-based bands determine whether a standard, discounted, or surcharged rate is taxable. Battery Electric vehicles (BEVs) benefit from a preferential rate of BIK, ranging from 9-22.5% depending on mileage, while fossil-fuel vehicles are subject to higher BIK rates, up to 37.5%. This new structure with CO2-based discounts and surcharges is designed to incentivise employers to provide employees with low-emission cars.  However, as the new emissions-based regime resulted in significant BIK increases for many high mileage and/or above average emission vehicles, given the broader inflationary context, temporary changes to BIK were introduced as part of Finance Act 2023. This temporary change comprised of a universal relief of €10,000 being applied to the OMV of vehicles in Category A-D, in order to reduce the amount of BIK payable. Additionally, the lower mileage limit in the highest mileage band was reduced by 4,000 km, so that the highest mileage band is entered into at 48,001 km.  The BIK relief was introduced as a temporary measure, which remained in place until 31 December 2023. An extension of this measure was announced as part of a cost of living package in Budget 2024. The measure is due to expire on 31 December 2024 and there are currently no plans to extend the €10,000 deduction.  In addition to the favourable treatment for low emission vehicles in the new BIK structure, Budget 2024 also extended the EV tapering mechanism applied to BIK relief for electric vehicles of €35,000 to end 2025, with reductions of €20,000 in 2026 and €10,000 in 2027. This measure forms part of a broader series of generous tax related measures for BEVs, including a reduced rate of 7% VRT, a VRT relief (to end 2025), low motor tax of €120 per annum, and 0% BIK on electric charging. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-20",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-03-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/mul@/dbsect_367.xml"
            }
          },
          "debateSectionId": "dbsect_367",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/dbsect_367",
          "showAs": "Education Policy"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-20/pq_412",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 412,
        "showAs": " 412. Deputy Peter Burke asked the Minister for Education if she will provide details of the process whereby a parent can appeal a decision taken by a primary school and its board of management in relation to the welfare of a student; and if she will make a statement on the matter. [11923/24] ",
        "answerText": " Minister for Education  Under the Education Act 1998, legally, all schools are managed by the school Board of Management and as my Department has no role in the employment of staff in schools or the day to day management of schools, a complaint about a child’s school and its staff should be made to the school itself.  Accordingly, while my Department provides funding and policy direction for schools, my Department does not have the power to instruct schools to follow a particular course of direction with regard to individual complaint cases or to investigate individual complaints except where the complaint involves a refused enrolment, expulsion or suspension, in accordance with section 29 of the Education Act, 1998. In dealing with parental complaints, my Department's role is to clarify for parents how their grievances and complaints regarding schools can be progressed.  Where a parent has a concern about a child at school they can discuss the matter informally with the class teacher and/or the principal. If the matter cannot be resolved informally, the school should have a formal complaints procedure that can be followed. This procedure should set out what a parent may have to do and how long it should take to deal with a complaint. The role and responsibilities of the principal and board of management should also be set out. The complaint procedures currently operated by most schools are the standard procedures that have been agreed between the teacher unions and school management bodies and a copy should be provided by schools to a parent on request.  Where a parent is of the view that a school's board of management has failed to investigate or adequately investigate their complaint, they should bring the matter to the attention of the patron. In the event that, after raising its concerns with the school patron, a parent still considers that the matter has not been resolved, it is open to the parent to raise the matter with the Ombudsman for Children.  The Office of the Ombudsman for Children may also independently investigate complaints relating to the administrative actions of a school recognised by the Department of Education provided the parent has fully followed the school's complaints procedures. The key criterion for any intervention by the Ombudsman for Children is that the administrative actions of a school has, or may have, adversely affected the child.  Further information is available on the gov.ie website: www.gov.ie/en/policy-information/complaints-about-schools/. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-20",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-03-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/mul@/dbsect_389.xml"
            }
          },
          "debateSectionId": "dbsect_389",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/dbsect_389",
          "showAs": "School Transport"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-20/pq_436",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 436,
        "showAs": " 436. Deputy Peter Burke asked the Minister for Education if a bus service will be provided for a school (details supplied) in County Westmeath; and if she will make a statement on the matter. [12063/24] ",
        "answerText": " Minister for Education  The School Transport Scheme is a significant operation managed by Bus Éireann on behalf of the Department of Education. In the current school year over 161,600 children, including over 135,000 pupils travelling on primary and post primary services, 19,800 pupils with special educational needs, and 6,800 pupils who have arrived to Ireland from Ukraine are transported on a daily basis to primary and post-primary schools throughout the country.  The total cost of the scheme in 2023 was €382.02m.  There has been an overall increase in both applications and tickets issued for the 2023/2024 school year in comparison to the 2022/2023 school year.  Children are eligible for transport at primary level where they reside not less than 3.2 kilometres from and are attending their nearest national school, and at post primary level where they reside not less than 4.8 kilometres from and are attending their nearest post primary school/education centre as determined by the Department/Bus Éireann, having regard to ethos and language.  Children who are eligible for school transport and who have completed the application process on time will be accommodated on school transport services where such services are in operation and capacity exists.  Children who are not eligible for school transport, but who completed the application process on time, will be considered for spare seats that may exist after eligible children have been facilitated; such seats are referred to as concessionary seats.  Because of the nature of concessionary transport for non-eligible children and the priority of providing places for eligible children, there may be an excess of demand over supply for concessionary places, in these cases Bus Éireann will allocate tickets for spare seats using an agreed selection process.  Bus Éireann have advised that there is no service operating to this school. A minimum number of 10 eligible children residing in a distinct locality, as determined by Bus Éireann, are required before consideration may be given to the establishment or retention of school transport services, provided this can be done within reasonable cost limits.  Families who wish to avail of school transport and have their eligibility status assessed should apply on-line in a timely manner to Bus Éireann on Bus Éireann’s website at www.buseireann.ie.  Bus Éireann, who operates the school transport scheme on behalf of the Department, review all school transport services over the summer months. Arising from this review, routes may be altered, extended or withdrawn depending on the number and location of eligible children who will be availing of school transport for the following school year. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-20",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-03-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/mul@/dbsect_451.xml"
            }
          },
          "debateSectionId": "dbsect_451",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/dbsect_451",
          "showAs": "School Staff"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-20/pq_499",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 499,
        "showAs": " 499. Deputy Peter Burke asked the Minister for Education what progress has been made in addressing the contract of employment of school caretakers; her plans to include them under her Department; her timeframe for negotiations; and if she will make a statement on the matter. [12681/24] ",
        "answerText": " Minister for Education  Caretakers are valued and vital members of the school system. The majority of primary and post-primary schools receive assistance to provide for caretaker services under grant schemes. Where a school employs a caretaker under these grant schemes to support those functions, those staff members are employees of the individual schools and as such the responsibility for the terms and conditions of employment such as contracts as well as rates of pay currently rests with the school.  The February 2022 agreement for revised salary and annual leave entitlements for grant funded school secretaries is now fully operational, and the lessons learned from that process are forming a key element in negotiating and implementing a similar package for grant funded school caretakers.  At present work is ongoing in my Department to develop a comprehensive survey which will enable my officials to confirm their understanding of the current working patterns as well as the terms and conditions of work for school caretakers. In parallel with this, officials from the Department and Fórsa are currently in communication on this important issue and have begun initial discussions with the union with an aim of progressing this matter as soon as reasonably possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-20",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-03-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/mul@/dbsect_469.xml"
            }
          },
          "debateSectionId": "dbsect_469",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/dbsect_469",
          "showAs": "School Facilities"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-20/pq_517",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 517,
        "showAs": " 517. Deputy Peter Burke asked the Minister for Education if a second ASD class will be sanctioned in a school (details supplied) to accommodate applications; and if she will make a statement on the matter. [12875/24] ",
        "answerText": " Minister of State at the Department of Education  Enabling children with special educational needs to receive an education is a priority for this government. It is also a key priority for me as Minister for Special Education & Inclusion, for my department and for the National Council for Special Education (NCSE).  The vast majority of children with special educational needs are supported to attend mainstream classes with their peers. Where children with more complex needs require additional supports, special classes and special school places are provided.  In 2023, my department spent over €2.6 billion on special education and further progress will be made this year as an additional €113 million will be dedicated to providing supports for children with special educational needs.  This includes funding to support children with special educational needs in mainstream classes; funding for new special classes and new special school places; additional special educational teachers, special needs assistants (SNAs) and funding for the National Educational Psychological Service (NEPS).  In 2024, the number of teaching and SNA posts in our schools will increase with an additional 744 teachers and 1,216 SNAs added to deliver up to 2,700 new places for children with special educational needs. This will mean we will have over 41,500 qualified and committed people in our schools who are focused wholly and exclusively on supporting children with special educational needs.  The NCSE has the responsibility for planning and coordinating school supports for children with special educational needs.  Over the last number of years, my department and the NCSE have introduced a number of strategic initiatives to plan for and provide sufficient special class and special school places.  These initiatives are bearing fruit with almost 1,300 new special classes sanctioned and seven new special schools established over the last four years.  My department engage intensely with the NCSE in relation to the forward planning of new special classes and additional special school places. This forward planning work is well underway ahead of the 2024/25 school year. This work involves a detailed review of statistical data in relation to forecasting demand for special class places, an analysis of available school accommodation, consideration of improved data sharing arrangements and a particular focus on the provision of special classes at post-primary level.  As a result of this forward planning, two new special schools have been established for this current school year in Cork and Dublin, with further capacity being expanded in 11 other special schools.  In December 2023, I was also very happy to announce with my colleague Minister Foley, the establishment of a further four new special schools for the 2024/25 school year in Meath, Kildare, Wexford and Limerick. This will bring to 11 the number of new special schools established in recent years.  Along with the two new special schools opening this school year, 390 new special classes – 254 at primary and 136 at post-primary level – have been sanctioned by the NCSE for opening this current school year.  Of these 6 are in Longford. This brings to 39 the number of special classes in County Longford, 25 at primary level and 14 at post-primary level.  As demand for new special classes at post-primary level is expected to increase significantly over the next few years, due to increasing demographics and increasing prevalence rates, my department and the NCSE have engaged with post-primary stakeholders in relation to the provision of special classes.  My department has communicated to all post-primary schools of the need to begin planning to provide additional special classes. It is envisaged that all post-primary schools will be required to provide special classes over the next 2 to 4 years, with an approximate average of 4 special classes in each school.  In relation to the school referred to by the Deputy, the NCSE has advised my department that they recently received an expression of interest for the establishment of an autism class from the school. It is of course open to any school to do so and every school who express such an interest is to be commended.  However, it may not be possible for the NCSE to sanction a new special class in every school that expresses an interest.  The department and the NCSE are currently reviewing the overall demand for such provision in the area alongside the availability of space in local schools. The local special educational needs officer (SENO) remains in contact with the principal of the school and with the parents of children in the area. Parents will be duly notified as new special class placements become available and are sanctioned for the 2024/25 school year within the area.  When assessing the needs in the local area, the NCSE identify schools in the neighbouring vicinity with available special class vacancies and assess their capability with consideration to demographical and statistical data.  Planning for special classes and places in Co. Longford and nationwide is currently underway ahead of the 2024/25 school year. Schools and parents will be notified as soon as possible if a special class can be established.  Parents seeking special class placements for their children are advised to contact the NCSE locally so that their needs can be taken into account for planning purposes. The local special educational needs organisers (SENOs) remain available to assist and advise parents of children with special educational needs. Parents may contact SENOs directly using the contact details available at: www.ncse.ie/regional-services-contact-list.  Information on the list of schools with special classes, the types and locations of these classes is published on the NCSE website and is available at: www.ncse.ie/special-classes.  My department and the NCSE are committed to ensuring that sufficient special education placements will be available for children for this school year and future years. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-20",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-03-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/mul@/dbsect_488.xml"
            }
          },
          "debateSectionId": "dbsect_488",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/dbsect_488",
          "showAs": "School Facilities"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-20/pq_537",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 537,
        "showAs": " 537. Deputy Peter Burke asked the Minister for Education if she will progress an application for additional modular classrooms for a school (details supplied); and if she will make a statement on the matter. [13052/24] ",
        "answerText": " Minister for Education  I wish to advise the Deputy that my Department is in receipt of an application for additional accommodation from the school in question.  The purpose of my Department’s Additional School Accommodation (or ASA) scheme is to ensure that essential mainstream classroom accommodation and accommodation for pupils with special education needs is available to cater for pupils enrolled each year, where the need cannot be met by the school’s existing accommodation or at other schools in the area.  At primary level, this situation generally arises to cater for a school’s accommodation requirements where an additional teaching post has been sanctioned by Teacher Allocation Section, or the requirement for a new class for pupils with special education needs has been identified by the National Council for Special Education (NCSE), and all available alternative accommodation within the school is already being used for classroom purposes. The capacity at other schools in the area is also considered as part of the assessment of any accommodation needs.  The National Council for Special Education (NCSE) has the responsibility for planning and coordinating school supports for children with special educational needs.  The Department engages intensely with the NCSE in relation to the forward planning of new special classes and additional special school places. This forward planning work is well underway ahead of the 2024/25 school year. This work involves a detailed review of statistical data in relation to forecasting demand for special class places, an analysis of available school accommodation, consideration of improved data sharing arrangements and a particular focus on the provision of special classes at post-primary level. In planning and providing for additional school accommodation, the Department must also have regard to construction inflation pressures and competing demands on suppliers of modular accommodation and project management services.  In general, demographics have been falling at primary level and are due to continue to decrease. Therefore the Department considers it prudent to maximise the use of existing spare accommodation capacity at primary level in the first instance, before considering any applications for further accommodation needs. This is in line with public spending requirements. In relation to the provision of primary special classes, the shared preference of both the Department and the NCSE is to use and reconfigure existing school accommodation to provide special classes. Given the number of primary special classes available already and the falling demographics, it is also likely that most of the new additional special classes may be required in larger population centres in a local school planning area.  At local level, the NCSE is currently reviewing the overall demand for such provision in the area alongside the availability of space in local schools. The NCSE and the Department continue to engage on a regular basis in relation to the provision of additional special education placements.  My officials will be in contact with the school in due course following further consultation with NCSE. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-20",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-03-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/mul@/dbsect_624.xml"
            }
          },
          "debateSectionId": "dbsect_624",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/dbsect_624",
          "showAs": "International Protection"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-20/pq_703",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 703,
        "showAs": " 703. Deputy Peter Burke asked the Minister for Housing, Local Government and Heritage if the facility to fast track the provision of temporary accommodation without the need for planning permission for Ukrainian families is still in place; when this order will be reviewed; and if he will make a statement on the matter. [13124/24] ",
        "answerText": " Minister for Housing, Local Government and Heritage  The European Union (Planning and Development) (Displaced Persons from Ukraine Temporary Protection) Regulations 2022 (S.I. 306 of 2022) were introduced in response to the emerging Ukrainian crisis. The Regulations give effect to Council Directive No 2001/55 EC and Council Implementing Decision EU 2022/382 of 4 March 2022 (European Council Decision) to provide immediate protection in EU countries for persons displaced by the Russian invasion of Ukraine, including the need to provide emergency accommodation and support to these displaced persons.  The Regulations provide that the provisions of the Planning and Development Act 2000 (other than the environmental considerations in Sections 181A to 181C) will not apply to certain classes of development by or on behalf of a State Authority for the purposes of providing temporary protection to displaced persons as specified in the Regulations.  The specified development classes will not require planning permission for the period that the regulations are in place and will not be subject to the various restrictions that would normally apply to classes of exempted development.  The classes of development comprise of the following:  • Reception and integration facilities;  • Residential accommodation, including ancillary recreational and sporting facilities;  • Medical and other health and social care accommodation;  • Education and childcare facilities, including ancillary recreational and sporting facilities;  • Emergency management coordination facilities;  • Structures or facilities ancillary to development referred to above, including administration and storage facilities; and  • Infrastructure and other works ancillary to the above development.  The classes of development listed may include the change of use and repurposing of existing buildings and facilities, and temporary new-build accommodation and structures to address the urgent need to provide emergency accommodation and support to displaced persons from the conflict in Ukraine.  The duration of the Regulations is linked to the duration of temporary protection provided by European Council Implementing Decision EU 2022/382 of 4 March 2022. Accordingly, the regulations will be in force for an initial period of one year with a maximum extended total period of three years from 4 March 2022.  The temporary exemptions from the Planning and Development Act will only apply while the regulations are in force. After this time the removal, demolition or alteration of any temporary structure and the discontinuance of any temporary use and, in so far as is practicable, the restoration of the land to its condition prior to the commencement of the development, will be required, unless the development is permitted, exempted or otherwise regularised by the Planning and Development Act 2000, or the Planning and Development Regulations 2001-2023. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-20",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-03-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/mul@/dbsect_879.xml"
            }
          },
          "debateSectionId": "dbsect_879",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/dbsect_879",
          "showAs": "Wildlife Protection"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-20/pq_1032",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1032,
        "showAs": " 1032. Deputy Peter Burke asked the Minister for Agriculture, Food and the Marine the measures he is taking to restrict the importation of non-native sub-species, hybrid honeybees and queens into the State; what strategies are being devised to protect the Irish honey business and keep the native species free from disease; and if he will make a statement on the matter. [12758/24] ",
        "answerText": " Minister for Agriculture, Food and the Marine  The movement of bees within the Union is governed by Regulation (EU) 2016/429 (the Animal Health Law) which is supplemented by Commission Implementing and Delegated Regulations (Regulation (EU) 2020/688 and 2021/403). These EU regulations contain specific provisions to safeguard the health of bees located in the territory of the Union. The importation of honeybees into Ireland is allowed under these Regulations and a statutory ban on non-native bee imports into Ireland may constitute a restriction on trade.  Import data from the past three years shows a decline in the number of honey bees imported into Ireland from 1285 in 2021 to 388 in 2023.  In October 2023 my Department entered into a 12 month research contract with the National University of Ireland, Galway to provide an independent scientific assessment to investigate the threat to and adverse impact upon biodiversity and the ecosystem arising from the introgression/crossing/cross-breeding of the native Irish Honey Bee, Apis mellifera mellifera with non-native species or sub-species of and/or strains derived from Apis mellifera imported to Ireland. It is important that this work concludes before deciding whether or not to introduce legislation banning the importation of non-native honey bees into Ireland.  My Department provides a range of supports and initiatives to encourage and assist beekeepers and the national beekeeping associations. These supports include funding to carry out applied research through the National Apiculture Programme, grants to national beekeeping associations and grant aid to fund capital investments for beekeepers.  My Department provides a bee health service, free of charge, which facilitates the early detection of pests and pathogens which is key to maintaining healthy stock of bees in Ireland. My Department also operates the Sentinel Apiary Programme along with volunteer beekeepers throughout Ireland. The aim of the programme is to ensure the early detection of three exotic pests, Small Hive beetle (SHB), Tropilaelaps spp . and the Asian Hornet. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-20",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-03-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/mul@/dbsect_1026.xml"
            }
          },
          "debateSectionId": "dbsect_1026",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/dbsect_1026",
          "showAs": "Emergency Accommodation"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-20/pq_1193",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1193,
        "showAs": " 1193. Deputy Peter Burke asked the Minister for Children, Equality, Disability, Integration and Youth if he can advise what plans are in place for demountable dwellings to be installed at a location in County Westmeath (details supplied); the number of occupants planned for this location; the timescale for their arrival; and if he will make a statement on the matter. [13114/24] ",
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  I thank the Deputy for this question. A response will be provided directly to the Deputy in the coming days.  The Deputy may wish to be aware that the Community Engagement Team has been established within my Department which stands ready to respond to queries of this nature, and they may be contacted directly at community@equality.gov.ie ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-20",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-03-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/mul@/dbsect_1323.xml"
            }
          },
          "debateSectionId": "dbsect_1323",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/dbsect_1323",
          "showAs": "Health Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-20/pq_1490",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1490,
        "showAs": " 1490. Deputy Peter Burke asked the Minister for Health when funding issues will be resolved at a Section 39 organisation (details supplied); and if he will make a statement on the matter. [12916/24] ",
        "answerText": " Minister for Health  I wish to advise the Deputy that this is a matter for the Department of Children, Equality, Disability, Integration and Youth. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-20",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-03-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/mul@/dbsect_1421.xml"
            }
          },
          "debateSectionId": "dbsect_1421",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-20/writtens/dbsect_1421",
          "showAs": "Departmental Policies"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-20/pq_1588",
        "to": {
          "roleType": null,
          "showAs": "Rural",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1588,
        "showAs": " 1588. Deputy Peter Burke asked the Minister for Rural and Community Development if a Pobal deprivation index could be reviewed; if there is a process for appeal (details supplied); and if she will make a statement on the matter. [12280/24] ",
        "answerText": " Minister of State at the Department of Social Protection  The Pobal HP Deprivation Index is Ireland's primary social gradient tool, commissioned by Pobal every five years following the completion of the national census. The most recent deprivation index was published in November 2023, using data 2022 census data.  The index provides a deprivation score for each of Ireland's 18,919 Small Areas, ranging from Extremely Disadvantaged to Very Affluent. The primary purpose of the index is to support Government Departments and state agencies to direct services and resources to the most disadvantaged communities on an objective basis, underpinned by robust data.  In respect of the organisation referred to, I understand that this query relates to the Sports Capital Grant administered by the Department of Tourism, Culture, Arts, Gaeltacht, Sport & Media.  I have been informed that under Sports Capital, an organisation is not simply scored based on the deprivation score of the Small Area in which they are located, but rather a wider catchment area is considered, by virtue of a bespoke radius drawn around the facility, with the average Deprivation score of all Small Areas within that area calculated.  For the purposes of appraisal under the Sports Capital Grant, the organisation will be scored on this bespoke radial score which considers close by areas of disadvantage, or the original Small Area score, whichever is lower (i.e. more advantageous to the applicant).  The Deputy might contact the Department of Tourism, Culture, Arts, Gaeltacht, Sport & Media if any further clarity is required. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-20",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-03-07",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-07/writtens/mul@/dbsect_413.xml"
            }
          },
          "debateSectionId": "dbsect_413",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-07/writtens/dbsect_413",
          "showAs": "General Practitioner Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-07/pq_432",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 432,
        "showAs": " 432. Deputy Peter Burke asked the Minister for Health for an update on the appointment of a new GP (details supplied); and if he will make a statement on the matter. [11466/24] ",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible.  As the Deputy may be aware, management and administrative grade staff in the Fórsa union in the HSE commenced industrial action on Friday, 6 October. As a consequence of this industrial action, members in these grades are not engaging with political forums or processes. As a result, the question asked by the Deputy may be delayed in receiving a response directly from the HSE. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-07",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-03-06",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-06/writtens/mul@/dbsect_68.xml"
            }
          },
          "debateSectionId": "dbsect_68",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-06/writtens/dbsect_68",
          "showAs": "Housing Schemes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-06/pq_31",
        "to": {
          "roleType": null,
          "showAs": "Environment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 31,
        "showAs": " 31. Deputy Peter Burke asked the Minister for the Environment, Climate and Communications when the new low-cost home energy loan scheme will be in operation; the expected timescale for same; and if he will make a statement on the matter. [10909/24] ",
        "answerText": " Minister for the Environment, Climate and Communications  In order to assist with the achievement of our retrofit targets, the Programme for Government, Climate Action Plan and the National Retrofit Plan committed to the introduction of a new residential retrofit low-cost loan scheme.  The Home Energy Upgrade Loan Scheme was developed by my Department in conjunction with the Department of Finance, the Strategic Banking Corporation of Ireland, the Sustainable Energy Authority of Ireland, the European Investment Bank and the European Investment Fund. An agreement with the European Investment Bank (EIB) Group underpinning the new Home Energy Upgrade Loan Scheme was announced in October 2023.  The €500 million scheme is the first of its kind for both Ireland and the EIB. Homeowners will be able to borrow from €5,000 to €75,000 on an unsecured basis for a term of up to 10 years. The interest rates will be significantly lower than those currently available on the market as a result of the combination of the EIB Group loan guarantee and a Government-funded interest rate subsidy.  The Home Energy Upgrade loans will help reduce the financial challenges for many homeowners and will play a crucial role in helping homeowners to invest in energy efficiency, making their homes warmer, cheaper to run and helping to lower emissions. It will also signal to the banking sector, new sustainable business opportunities associated with retrofit and the transition to a low carbon economy.  It is anticipated that the loans will be available in the coming weeks through participating retail lenders. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-06",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-03-06",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-06/writtens/mul@/dbsect_128.xml"
            }
          },
          "debateSectionId": "dbsect_128",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-06/writtens/dbsect_128",
          "showAs": "School Uniforms"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-06/pq_91",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 91,
        "showAs": " 91. Deputy Peter Burke asked the Minister for Education if in relation to Circular 0032/2017 she envisioned that schools would undertake to sell school uniforms directly to families and to take away the element of choice from parents who are now compelled to purchase from the school and not avail of other available retailers; and if she will make a statement on the matter. [10977/24] ",
        "answerText": " Minister for Education  Ultimately, decisions on school uniforms are a matter for individual schools and Boards of Management.  Taking the above into account, the Department’s Circular 0032/2017, was issued to the Boards of Management of all recognised primary and post-primary schools and to the Chief Executives of the Education and Training Boards. This Circular sets out the principles of cost-effective practice to be adopted by schools to reduce the cost of returning to school.  Under these measures, schools should select school uniform items which are generic and can be purchased from an array of retailers. Only \"iron on\" or \"sew on\" crests should be used.  Schools should also consult with parents as to their views on how to reduce costs.  The Education (Student and Parent Charter) Bill is currently before Dáil Éireann. When enacted, it will improve how schools engage with students and their parents by requiring each school to consult with students and their parents on individual school plans, policies and activities, including school costs.  The Bill is awaiting an order for Committee Stage and officials in my Department are working to progress the Bill which will ensure that the various views of students and parents are heard and responded to by schools. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-06",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-03-05",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-05/writtens/mul@/dbsect_133.xml"
            }
          },
          "debateSectionId": "dbsect_133",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-05/writtens/dbsect_133",
          "showAs": "Public Transport"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-05/pq_160",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 160,
        "showAs": " 160. Deputy Peter Burke asked the Minister for Transport the up-to-date position regarding the provision of flexi tax saver tickets for commuters; and if he will make a statement on the matter. [10182/24] ",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport, nor decisions on fares. It is the National Transport Authority (NTA) that has responsibility for the regulation of fares charged to passengers in respect of public transport services, provided under public service obligation (PSO) contracts.  In light of the NTA's responsibility in this area, I have forwarded the Deputy's question to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-05",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-03-05",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-05/writtens/mul@/dbsect_248.xml"
            }
          },
          "debateSectionId": "dbsect_248",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-05/writtens/dbsect_248",
          "showAs": "Special Educational Needs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-05/pq_284",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 284,
        "showAs": " 284. Deputy Peter Burke asked the Minister for Education if an application for an ASD class in a Westmeath school (details supplied) could be urgently considered; and if she will make a statement on the matter. [10097/24] ",
        "answerText": " Minister for Education  Enabling children with special educational needs to receive an education is a priority for this government. It is also a key priority for me as Minister for Special Education & Inclusion, for my department and for the National Council for Special Education (NCSE).  The vast majority of children with special educational needs are supported to attend mainstream classes with their peers. Where children with more complex needs require additional supports, special classes and special school places are provided.  In 2023, my department spent over €2.6 billion on special education and further progress will be made this year as an additional €113 million will be dedicated to providing supports for children with special educational needs.  This includes funding to support children with special educational needs in mainstream classes; funding for new special classes and new special school places; additional special educational teachers, special needs assistants (SNAs) and funding for the National Educational Psychological Service (NEPS).  In 2024, the number of teaching and SNA posts in our schools will increase with an additional 744 teachers and 1,216 SNAs added to deliver up to 2,700 new places for children with special educational needs. This will mean we will have over 41,500 qualified and committed people in our schools who are focused wholly and exclusively on supporting children with special educational needs.  The NCSE has the responsibility for planning and coordinating school supports for children with special educational needs.  Over the last number of years, my department and the NCSE have introduced a number of strategic initiatives to plan for and provide sufficient special class and special school places.  These initiatives are bearing fruit with almost 1,300 new special classes sanctioned and seven new special schools established over the last four years.  My department engage intensely with the NCSE in relation to the forward planning of new special classes and additional special school places. This forward planning work is well underway ahead of the 2024/25 school year. This work involves a detailed review of statistical data in relation to forecasting demand for special class places, an analysis of available school accommodation, consideration of improved data sharing arrangements and a particular focus on the provision of special classes at post-primary level.  As a result of this forward planning, two new special schools have been established for this current school year in Cork and Dublin, with further capacity being expanded in 11 other special schools.  In December 2023, I was also very happy to announce with my colleague Minister Foley, the establishment of a further four new special schools for the 2024/25 school year in Meath, Kildare, Wexford and Limerick. This will bring to 11 the number of new special schools established in recent years.  Along with the two new special schools opening this school year, 390 new special classes – 254 at primary and 136 at post-primary level – have been sanctioned by the NCSE for opening this current school year.  Of these 6 are in Westmeath, 4 at primary and 2 at post-primary level. This brings to 59 the number of special classes in County Westmeath, 39 at primary level and 20 at post-primary level. The vast majority of these classes are autism classes and have a teacher/student ratio of 1:6.  In relation to the school referred to by the Deputy, the NCSE has advised my department that they received an expression of interest for the establishment of an autism class from the school. It is of course open to any school to do so and every school who express such an interest is to be commended.  However, it may not be possible for the NCSE to sanction a new special class in every school that expresses an interest.  The department and the NCSE are currently reviewing the overall demand for such provision in the area alongside the availability of space in local schools. The local special educational needs officer (SENO) remains in contact with the principal of the school and with the parents of children in the area. Parents will be duly notified as new special class placements become available and are sanctioned for the 2024/25 school year.  When assessing the needs in the local area, the NCSE identify schools in the neighbouring vicinity with available special class vacancies and assess their capability with consideration to demographical and statistical data.  Planning for special classes and special school places in Co. Westmeath and nationwide is currently underway ahead of the 2024/25 school year.  Parents seeking special class placements for their children are advised to contact the NCSE locally so that their needs can be taken into account for planning purposes. The SENOs remain available to assist and advise parents of children with special educational needs. Parents may contact SENOs directly using the contact details available at: www.ncse.ie/regional-services-contact-list  Information on the list of schools with special classes, the types and locations of these classes is published on the NCSE website and is available at: www.ncse.ie/special-classes  My department will continue to support the NCSE and schools through the provision of the necessary funding and capital investment to ensure all children are successful in accessing an education. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-05",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-03-05",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-05/writtens/mul@/dbsect_254.xml"
            }
          },
          "debateSectionId": "dbsect_254",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-05/writtens/dbsect_254",
          "showAs": "Mental Health Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-05/pq_290",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 290,
        "showAs": " 290. Deputy Peter Burke asked the Minister for Education when a pilot scheme for larger primary schools in a region (details supplied) will be functional and providing counselling services. [10124/24] ",
        "answerText": " Minister for Education  The Department of Education is committed to supporting the emotional wellbeing of our children and I have secured funding in Budget 2023 and 2024 to pilot for the first time the provision of direct counselling and wellbeing supports in almost 650 primary schools across the country. This complements the excellent work that schools already undertake in respect of wellbeing, as well as other services provided by the state, such as the National Educational Psychologists Service and by the HSE.  The Counselling in Primary Schools Pilot 2023-25 (CPS-P) includes two Strands. Strand 1 is the provision of one-to-one counselling to support a small number of children in all primary schools in counties Cavan, Laois, Leitrim, Longford, Mayo, Monaghan and Tipperary. Strand 2 of the pilot is the establishment of a new type of support to schools from Education Wellbeing Teams and the introduction of Education Wellbeing Practitioners to support clusters of schools in Cork, Carlow, Dublin 7 and Dublin 16.  Under Strand 1, panels of counsellors have been established for the seven pilot counties.  Counsellors on the panel are currently providing counselling sessions to a number of children in primary schools in the pilot counties. There are currently 29 counsellors on panels across the seven counties. This is below the anticipated number of counsellors that we expected to apply to work on the pilot. NEPS continue to accept and process applications from counsellors on an ongoing basis. The six accrediting bodies for counsellors who have been supporting this work, have contacted their membership in order to encourage recruitment of additional counsellors to the panels.  NEPS on behalf of the Department of Education progressed the first phase of the pilot in November 2023, when a letter was sent to the first number of schools in Cavan, Laois, Leitrim, Longford, Mayo, Monaghan, and Tipperary advising them of their allocation of blocks of counselling sessions for children. In the first instance an allocation of blocks of counselling was given to the larger schools in selected counties.    NEPS psychologist made contact with all the schools that were allocated blocks of counselling to agree with the school, the pupils to prioritise for counselling and a suggested counsellor to contact from the panel, based on location and counsellor’s availability. Schools then commissioned the counsellors directly to provide the service, which children in a number of schools have already benefitted from. Blocks with eight counselling sessions in each block, were allocated to 246 of schools in the pilot counties.  We are looking at the next allocation to schools, which includes an allocation to smaller schools in the pilot counties    Guidelines for Schools have been provided to support schools in the implementation of Strand 1 of the pilot. A dedicated webpage with information for parents, information for counsellors and information for schools is also available on gov.ie.    Strand 2 of the pilot is the establishment of a new type of support to schools from Education Wellbeing Teams and the introduction of Education Wellbeing Practitioners to support clusters of schools in Cork, Carlow, Dublin 7 and Dublin 16. The Education Wellbeing Practitioner is a new role in schools being introduced as part of this pilot to provide enhanced in-school support. The practitioners are graduates from psychology, education and social science. The recruitment process for the practitioners is complete, and they have undergone an intensive training programme provided by NEPS and have commenced visiting and supporting schools in recent weeks. NEPS psychologists are providing oversight and professional supervision to support and maintain the work undertaken by the practitioners. This will ensure safe practice and the use of evidence-informed programmes and supports in schools.  The focus of the support to be provided under Strand 2 is on strengthening whole school approaches to promoting wellbeing, in line with the Department of Education’s Wellbeing Policy and Framework for Practice. This includes offering psycho-educational support for parents and teachers, and the delivery of evidence-based interventions to children to promote resilience and coping strategies and to maintain and develop wellbeing.  NEPS has met with officials from the Department of Education in Northern Ireland in relation to the Healthy Happy Minds Pilot, which was the provision of counselling in schools. NEPS have also met with the Education Authority in Dorset in the UK and with a Mental Health Support Team in West Sussex in relation to the Mental Health Support Teams model. A team from NEPS visited Dorset and West Sussex last December to meet with Mental Health leads, Education Mental Health Practitioners, and counsellors involved in the project. The NEPS team also visited schools in the project to learn from how the project was implemented.  Through this existing pilot programme and subsequent evaluation we are confident that we will gather valuable learning that will inform future policy and provision in this area. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-05",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-03-05",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-05/writtens/mul@/dbsect_428.xml"
            }
          },
          "debateSectionId": "dbsect_428",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-05/writtens/dbsect_428",
          "showAs": "Naturalisation Applications"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-05/pq_474",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 474,
        "showAs": " 474. Deputy Peter Burke asked the Minister for Justice if she will consider an amendment to fees charged for naturalisation for UK citizens who are resident in the State for a particular time period and if the naturalisation fees could be graduated (details supplied); and if she will make a statement on the matter. [10051/24] ",
        "answerText": " Minister for Justice  The fees to be paid by an applicant for a certificate of naturalisation are governed by the provisions of the Irish Nationality and Citizenship Regulations 2011 (S.I. No. 569 of 2011). The application fee is €175.  A certification fee of €950 is then required following a positive decision being reached on the naturalisation application.  The standard certification fee is set at €950, while a reduced fee of €200 applies in the case of an application made on behalf of a minor or in certain cases where the application is made by a widow, widower or surviving civil partner of an Irish citizen. In the case of recognised refugees and stateless persons, there is no certification fee.  The State has not increased the fees for naturalisation applications since 2011.  There is no provision in the Regulations for a discretionary waiver or reduction of fees, or for differing fees to apply to different nationalities, or based on the length of residency in the State.  All of the fees payable under the Irish Nationality and Citizenship Act 1956, as amended, are kept under ongoing review by my Department. However, there are no current plans to amend the fees. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-05",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-03-05",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-05/writtens/mul@/dbsect_550.xml"
            }
          },
          "debateSectionId": "dbsect_550",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-05/writtens/dbsect_550",
          "showAs": "Family Reunification"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-05/pq_599",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 599,
        "showAs": " 599. Deputy Peter Burke asked the Minister for Children, Equality, Disability, Integration and Youth if he will review a case for family reunification (details supplied); and if he will make a statement on the matter. [10791/24] ",
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  In relation to this case, I am advised by my officials that an application for exceptional reunification was considered by the Ukrainian Crisis Temporary Accommodation Team (UCTAT), which evaluates applications for exceptional reunification on a case by case basis. A refusal notification was issued accordingly by the UCTAT team.  A further review of this case was considered by my officials in line with the Absence Protocol and concluded with no change in their decision.  Their decision is final on these matters.  Beneficiaries of Temporary Protection are entitled to make their own private arrangements for accommodation using supports provided by the Department of Social Protection or by asking their Local Authority or Irish Red Cross for pledged accommodation. Those wishing to avail of pledged accommodation in any given area should contact the Local Authority in that area or the Irish Red Cross pledge process. The Irish Red Cross can be contacted by email at registerofpledges@redcross.ie or by phoning 1800 50 70 70. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-05",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-03-05",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-05/writtens/mul@/dbsect_577.xml"
            }
          },
          "debateSectionId": "dbsect_577",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-05/writtens/dbsect_577",
          "showAs": "Health Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-05/pq_627",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 627,
        "showAs": " 627. Deputy Peter Burke asked the Minister for Health if he will consider reimbursement for a procedure (details supplied). [9997/24] ",
        "answerText": " Minister for Health (Deputy Stephen Donnelly)  The HSE funds and operates the public healthcare system in Ireland. Private Hospitals and healthcare providers are independent organisations. In general, patients use their private health insurance when accessing healthcare in the private sector, while some patients who do not have private health insurance may opt to pay privately for the treatment.  Treatment accessed in the independent private healthcare system is not eligible for reimbursement by the HSE or the Department of Health. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-05",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-03-05",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-05/writtens/mul@/dbsect_707.xml"
            }
          },
          "debateSectionId": "dbsect_707",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-05/writtens/dbsect_707",
          "showAs": "Student Accommodation"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-05/pq_752",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 752,
        "showAs": " 752. Deputy Peter Burke asked the Minister for Health in light of the Department of Health Circular 4/2023 issued to the HSE on 27 February 2023, if a case for student accommodation (details supplied) will be refunded; and if he will make a statement on the matter. [10636/24] ",
        "answerText": " Minister for Health  As the Deputy may be aware, following approval by Government on 13 December 2022, I was pleased to announce €9 million in additional supports for student nurses and midwives. €5.4m of this funding provides for an enhanced Travel and Subsistence Scheme for eligible students in publicly funded undergraduate nursing and midwifery courses while attending their supernumerary clinical practice placements. Supernumerary students in midwifery, general, combined children's and general, intellectual disability and psychiatric nursing all have the same entitlement.  The Department of Health Circular 4/2023 issued to the HSE on 27 February 2023, set out revised arrangements to apply. This scheme provides a targeted and more equitable approach to supporting these students and its main features are set out hereunder: -  • Eligible student nurses and midwives in years 1 to 3 of their studies will each receive €500 per year as a targeted measure to contribute towards meeting the extra costs of meals associated with practice placements outside the student’s core placement site;  • a new rate of €80 for overnight accommodation along with an increased weekly cap of €300, (for those eligible supernumerary students who require accommodation away from their normal place of residence while attending practice placements). This weekly cap is almost six times the previous cap and three times the cap introduced on 1st January 2022;  • supernumerary students requiring overnight accommodation will also be able to avail of, on a vouched basis, the reasonable cost of uniform laundry services;  • supernumerary students on the undergraduate nursing/midwifery programme continue to be entitled to claim for payment of travel expenses necessarily incurred while attending placements, on the basis of receipts provided by the student and certified by the Student Allocation Liaison Officer (SALO) in the clinical partner site. Public transport should be used wherever possible. Where public transport is not available and the use of private transport is necessary to attend placements, a supernumerary student is entitled to claim for payment of these necessarily incurred travel expenses. These should be paid on the same basis as that which applies generally in the public sector.  • the enhanced Travel and Subsistence Scheme is backdated to the start of the 2022/2023 academic year, and additional once off funding of €2.4m was allocated to cover arrears arising from September to December 2022.  Payment of allowances to eligible students is a priority for me. I would like these payments to students, particularly those in respect of the 2022/2023 academic year, to have been made long ago. While the HSE has advised that payments have commenced in a number of areas, I remain concerned at the slow pace of payments. I have therefore asked my Department to pursue the matter with the HSE and keep me informed.  In relation to the question asked by the Deputy, payments to eligible students covered by Circular 4/2023 are a matter for the HSE and individual hospitals and I have asked the HSE to respond directly to the Deputy on this issue. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-05",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-03-05",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-05/writtens/mul@/dbsect_712.xml"
            }
          },
          "debateSectionId": "dbsect_712",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-03-05/writtens/dbsect_712",
          "showAs": "Hospital Staff"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-03-05/pq_758",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 758,
        "showAs": " 758. Deputy Peter Burke asked the Minister for Health when an audiologist will be appointed for Midlands Regional Hospital, Mullingar, County Westmeath. [10680/24] ",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-03-05",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-02-29",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-29/writtens/mul@/dbsect_169.xml"
            }
          },
          "debateSectionId": "dbsect_169",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-29/writtens/dbsect_169",
          "showAs": "Broadband Infrastructure"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-02-29/pq_156",
        "to": {
          "roleType": null,
          "showAs": "Environment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 156,
        "showAs": " 156. Deputy Peter Burke asked the Minister for the Environment, Climate and Communications if he will provide an update on the provision of broadband to a location (details supplied). [9870/24] ",
        "answerText": " Minister of State at the Department of the Environment, Climate and Communications (Deputy Ossian Smyth)  In December 2022, my Department published Ireland's Digital Connectivity Strategy which supports the ambition outlined in the National Digital Strategy and sets out a number of ambitious targets, including that:  • all Irish households and businesses will be covered by a Gigabit network no later than 2028  • all populated areas will be covered by 5G no later than 2030, and  • digital connectivity will be delivered to all schools and broadband connection points by 2023  These targets will be achieved through commercial operators investing in their networks, complemented by the State’s National Broadband Plan intervention. When taken together, all premises in the State will have access to high-speed broadband in every part of the country no matter how remote.  The premises in question is in the BLUE area on the broadband map. The BLUE area represents those areas where commercial providers are either currently delivering or have plans to deliver high-speed broadband services. The Department defines high-speed broadband as a connection with minimum speeds of 30Mbps download and 6Mbps upload. The activities of commercial operators delivering high-speed broadband within BLUE areas are not planned or funded by the State and the Department has no statutory authority to intervene in that regard. There may be a choice of operators offering this service in any given area. Further information in this regard is available at www.comreg.ie/compare/#/services.  If a person lives in the BLUE area and after contacting their Retail Service Provider are told they cannot get access to greater than 30Mbps, they should raise a query via the DECC webform at secure.dccae.gov.ie/forms/NBP-Customer-Service.aspx and DECC will escalate with open eir to investigate this matter further.  The Department expects that the majority of the Blue area of the NBP Map will be served with high-speed broadband from commercial operators. The European Electronics Communications Code (EECC) requires a broadband Universal Service Obligation (USO) to be implemented by Member States, which provides an assurance that all premises can access a high-speed broadband connection. This provides another tool to help deliver upon the NBP’s policy objectives that every home and business in the country will have access to high-speed broadband.  Commercial operators’ fibre rollouts are progressing at pace. Open eir have already passed over over 1.1 million homes. SIRO has recently reached a milestone of enabling over 545,000 premises for full fibre and is on track to reach 700,000 premises by 2026. Virgin Media recently announced a €200 million investment plan to upgrade its cable network to bring full fibre to up to 1 million premises over the next three years, to date it has passed 252,000 premises with full fibre.  Recent ComReg data shows that Quarter 2 of 2023 saw a 7.4% increase in fibre broadband subscriptions compared to the first 3 months of the year, and a 33.7% increase when compared to Quarter 2 of 2022. This demonstrates that take-up of fibre connectivity for homes and businesses is increasing substantially as it is deployed to areas where it had previously been unavailable. The same ComReg data also indicates that c. 40% of homes and business throughout the State now have access to gigabit services through either fibre (576,856) or cable (359,669) infrastructure. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-02-29",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-02-29",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-29/writtens/mul@/dbsect_190.xml"
            }
          },
          "debateSectionId": "dbsect_190",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-29/writtens/dbsect_190",
          "showAs": "Early Childhood Care and Education"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-02-29/pq_176",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 176,
        "showAs": " 176. Deputy Peter Burke asked the Minister for Education if a query from persons (details supplied) in relation to a childcare provider will be examined; and her plans to assist these children. [9776/24] ",
        "answerText": " Minister for Education  Regional Education and Language Teams, or REALTs, were established as part of the Department of Education’s response to the humanitarian crisis arising from the war in Ukraine.  REALTs assist Ukrainian families in securing school places.  Families who have recently moved into the accommodation referred to by the Deputy are currently being assisted by the REALT coordinator to locate school places.  If the nearest schools do not have capacity, then transport will be sought to other schools with available capacity within the locality. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-02-29",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-02-29",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-29/writtens/mul@/dbsect_246.xml"
            }
          },
          "debateSectionId": "dbsect_246",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-29/writtens/dbsect_246",
          "showAs": "Social Welfare Benefits"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-02-29/pq_234",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 234,
        "showAs": " 234. Deputy Peter Burke asked the Minister for Social Protection if there are  plans to extend illness benefit to the self-employed (details supplied). [9828/24] ",
        "answerText": " Minister for Social Protection  Illness benefit is the primary short term income support provided by my Department to those who are unable to work due to illness of any type and who are covered by social insurance.  Eligibility for illness benefit depends on the person’s PRSI record and class.  The person must have made the required number of contributions under class A, E, H or P to qualify.  In general, self-employed people make PRSI contributions at Class S which does not provide entitlement for illness benefit.  Illness benefit is funded by the Social Insurance Fund through PRSI contributions.  The Fund is central to our social protection system and the Government needs to ensure that it can provide adequate and sustainable social insurance pensions and benefits for a growing and ageing population.  Self-employed people pay contributions to the Fund at a lower rate of 4%.  This is 11 percentage points lower than the combined employer and employee contribution of 15.05% made in respect of employed contributors.  However, self-employed contributors do have access to over 90% of benefits available to employed contributors. including;  • Adoptive Benefit;  • Guardian's Payment (Contributory);  • Invalidity Pension;  • Jobseeker's Benefit (Self-Employed);  • Maternity Benefit;  • Parent's Benefit;  • Partial Capacity Benefit (where in receipt of Invalidity Pension);  • Paternity Benefit;  • State Pension (Contributory);  • Benefit Payment for 65 year olds;  • Treatment Benefit; and  • Widow's, Widower's or Surviving Civil Partner's (Contributory) Pension.  The only benefits that class S PRSI does not provide access to are carer's benefit, health and safety benefit, illness benefit, and occupational injuries benefits.  In circumstances where people are ill but do not qualify for illness benefit, my Department provides means tested supports under the supplementary welfare allowance scheme.  An additional needs payment may also be available to people who have expenses that they cannot pay from their weekly income.  Any changes to the illness benefit scheme would need to be considered in an overall policy and budgetary context, including the contribution rates for self-employed contributors.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-02-29",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-02-29",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-29/writtens/mul@/dbsect_272.xml"
            }
          },
          "debateSectionId": "dbsect_272",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-29/writtens/dbsect_272",
          "showAs": "Early Childhood Care and Education"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-02-29/pq_259",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 259,
        "showAs": " 259. Deputy Peter Burke asked the Minister for Children, Equality, Disability, Integration and Youth if a query from persons (details supplied) in relation to a childcare provider will be examined; and his plans to assist these children. [9776/24] ",
        "answerText": " Minister for Education  Regional Education and Language Teams, or REALTs, were established as part of the Department of Education’s response to the humanitarian crisis arising from the war in Ukraine.  REALTs assist Ukrainian families in securing school places.  Families who have recently moved into the accommodation referred to by the Deputy are currently being assisted by the REALT coordinator to locate school places.  If the nearest schools do not have capacity, then transport will be sought to other schools with available capacity within the locality. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-02-29",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "question": {
        "debateSection": {
          "showAs": "Asylum Seekers",
          "debateSectionId": "dbsect_136",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-28/writtens/mul@/dbsect_136.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-28/writtens/dbsect_136"
        },
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  My Department has updated its reunification protocol due to the mounting challenges in procuring additional accommodation places for new arrivals into Ireland. The updated reunification protocol seeks to maximise the availability of beds in the system while also acknowledging the exceptional need of certain individuals. People can request to move into a room of existing contacts if there is a bed available in the room that is already being occupied. If an additional room is required for reunification this will only be possible when someone is joining a close family member and the reunification is required for caring or support reasons.  The Ukrainian Crisis Temporary Accommodation Team (UCTAT), which can be contacted at ukrainetempaccom@equality.gov.ie,  evaluates applications for exceptional reunification on a case by case basis.  I am advised by my officials that the person referred to by the Deputy has been in contact with UCTAT and that their application for exceptional reunification is currently being evaluated.  Beneficiaries of Temporary Protection are entitled to make their own private arrangements for accommodation using supports provided by the Department of Social Protection or by asking their Local Authority or Irish Red Cross for pledged accommodation. Those wishing to avail of pledged accommodation in any given area should contact the Local Authority in that area or the Irish Red Cross pledge process. The Irish Red Cross can be contacted by email at registerofpledges@redcross.ie or by phoning 1800 50 70 70. ",
        "date": "2024-02-28",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        },
        "questionType": "written",
        "showAs": " 109. Deputy Peter Burke asked the Minister for Children, Equality, Disability, Integration and Youth if he could intervene in a case of a person who recently arrived from Ukraine (details supplied) and wishes to be reunited with her family, who are already in sponsored accommodation. [9549/24] ",
        "to": {
          "showAs": "Children",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 109,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-02-28/pq_109"
      },
      "contextDate": "2024-02-28"
    },
    {
      "contextDate": "2024-02-27",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-27/writtens/mul@/dbsect_214.xml"
            }
          },
          "debateSectionId": "dbsect_214",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-27/writtens/dbsect_214",
          "showAs": "Special Educational Needs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-02-27/pq_195",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 195,
        "showAs": " 195. Deputy Peter Burke asked the Minister for Education if she will acknowledge the concern of parents of children with special needs following the issuing of circular 0002/24 regarding special education teacher hours (details supplied); if the category of complex educational needs is to be removed from the special education teacher hours; and if she will make a statement on the matter. [8704/24] ",
        "answerText": " Minister of State at the Department of Education  I want to thank the Deputy for raising this issue and for giving me the opportunity to clarify some of the concerns that have been raised regarding the Special Education Teacher Allocations for mainstream schools which issued on the 6th February.  At the outset, I would like to clarify  complex needs have not been removed – the data which was used since 2017 from the children's disability network team (CDNT) and which is no longer routinely available is being  replaced by high quality, verifiable education data.  To ensure that schools  and pupils are not negatively impacted all existing hours assigned for complex needs are being maintained for each school.  Children with complex needs are supported in the model by now using school-level data from standardised tests in order to reflect relative levels of overall needed.  In the review of the model consideration was given to those students with multiple needs and who may not have undertaken standardised testing and this has been incorporated in the model.  The allocation model for 2024/25 distributes the total available number of SET posts in line with each school’s profile of need. It seeks to distribute teaching resources in the fairest possible manner, taking into account quality, robust evidence in respect of individual schools. This ensures that resources are in the right place at the right time to meet the needs of children in mainstream.  There will more Special Education Teachers in our schools in September 2024 than ever before – an increase of 1,000 from 2020/21 school year. This is in addition to a significant reduction in class teachers sizes at primary level over three budgets to where our PTR at primary level is now 23:1. This means, more than ever, children with SEN in our mainstream schools are best supported to meet their needs. In addition the model will now be run annually in line with general teacher allocations. This allows schools to better plan their staffing structures and gives them time to arrange clusters in areas where schools share an SET teacher.  There has been a limited change to the method used to allocate SET to mainstream classes. This review involved extensive consultation and visits to schools by the NCSE to look at the strengths and shortcomings of the allocation model. The feedback has been incorporated into the revised model for 2024/25.  The review of the SET model focused on ensuring that we had the best possible data available to inform the distribution of resources to our schools. Our policy relating to supporting all of our children in our schools based on their level of need remains.  The policy that individual schools are required to adhere to is the principle that the allocation is utilised to ensure that those pupils with the greatest level of need receive the greatest level of support and this remains unchanged.  Therefore the revised profiles are directly correlated to, and focused on, pupils with the greatest level of need in the areas of literacy and numeracy.  The Department acknowledges that every school is different, and that schools can experience unique circumstances that may be difficult to reflect in any standardised method. This is always a challenge when making allocations in respect of 4,000 schools. It is for this reason that the Department, working with the NCSE has streamlined the review process for special education teachers and schools who have any concerns can engage with the NCSE on their allocation. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-02-27",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-02-21",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-21/writtens/mul@/dbsect_143.xml"
            }
          },
          "debateSectionId": "dbsect_143",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-21/writtens/dbsect_143",
          "showAs": "International Protection"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-02-21/pq_136",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 136,
        "showAs": " 136. Deputy Peter Burke asked the Minister for Children, Equality, Disability, Integration and Youth if he will advise on a case (details supplied). [8268/24] ",
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  My Department has been at the forefront of the cross-governmental response to the displacement of Ukrainian people caused by the 2022 invasion. As of February, we are proving accommodation to over 56,000 people in short term accommodation and over 17,000 people in pledged accommodation and the offer a home scheme.  The accommodation provided to people fleeing the conflict in Ukraine by my Department is mainly temporary in nature and given the number of people that are being accommodated it is not possible to develop tailored solutions for individuals or families, unless it is for a serious medical need as agreed with the HSE. In seeking to address immediate accommodation needs, safety and security are the paramount considerations.  Outside of State funded temporary accommodation, Beneficiaries of Temporary Protection (BOTPs) are entitled to make their own private arrangements including potentially availing of pledged accommodation, and can avail of some supports to do so. Those wishing to avail of pledged accommodation in any given area should contact the Local Authority in that area or the Irish Red Cross pledge process. The Irish Red Cross can be contacted by email at registerofpledges@redcross.ie or by phoning 1800 50 70 70. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-02-21",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-02-21",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-21/writtens/mul@/dbsect_160.xml"
            }
          },
          "debateSectionId": "dbsect_160",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-21/writtens/dbsect_160",
          "showAs": "Nursing Education"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-02-21/pq_154",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 154,
        "showAs": " 154. Deputy Peter Burke asked the Minister for Health the reason a student nurse (details supplied) is not entitled to the accommodation allowance to facilitate their work placement; and if he will make a statement on the matter. [8172/24] ",
        "answerText": " Minister for Health  As the Deputy may be aware, following approval by Government on 13 December 2022, I was pleased to announce €9 million in additional supports for student nurses and midwives. €5.4m of this funding provides for an enhanced Travel and Subsistence Scheme for eligible students in publicly funded undergraduate nursing and midwifery courses while attending their supernumerary clinical practice placements. Supernumerary students in midwifery, general, combined children's and general, intellectual disability and psychiatric nursing all have the same entitlement.  The Department of Health Circular 4/2023 issued to the HSE on 27 February 2023, set out the revised arrangements.The scheme provides a targeted and more equitable approach to supporting these students and two of it's main features are:  • a new rate of €80 for overnight accommodation along with an increased weekly cap of €300, (for those eligible supernumerary students who require accommodation away from their normal place of residence while attending practice placements)  • supernumerary students on the undergraduate nursing/midwifery programme continue to be entitled to claim for payment of travel expenses necessarily incurred while attending placements, on the basis of receipts provided by the student and certified by the Student Allocation Liaison Officer (SALO) in the clinical partner site. Public transport should be used wherever possible. Where public transport is not available and the use of private transport is necessary to attend placements, a supernumerary student is entitled to claim for payment of these necessarily incurred travel expenses. These should be paid on the same basis as that which applies generally in the public sector.  As individual cases in individual sites are the responsibility of the HSE, I have asked the HSE to respond directly to the Deputy on this matter. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-02-21",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-02-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-20/writtens/mul@/dbsect_290.xml"
            }
          },
          "debateSectionId": "dbsect_290",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-20/writtens/dbsect_290",
          "showAs": "Hedge Cutting"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-02-20/pq_333",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 333,
        "showAs": " 333. Deputy Peter Burke asked the Minister for Housing, Local Government and Heritage if he will extend the tree/hedge cutting deadline which is due to expire shortly. [8004/24] ",
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  I propose to take Questions Nos. 332 and 333 together.  The dates for the cutting of hedges are set down in primary legislation. Section 40 of the Wildlife Act prohibits the cutting of vegetation, with certain strict exemptions, from 1 March to 31 August.  There is provision in the legislation for certain exemptions in respect of cutting vegetation in the ordinary course of agriculture or forestry, for health and safety reasons, the destruction of noxious weeds and for cutting roadside hedges for road safety reasons.  As the dates are set out in primary legislation, I have no power or discretion to vary these dates. The season may only be extended by primary legislation enacted by the Oireachtas. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-02-20",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-02-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-20/writtens/mul@/dbsect_456.xml"
            }
          },
          "debateSectionId": "dbsect_456",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-20/writtens/dbsect_456",
          "showAs": "Childcare Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-02-20/pq_507",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 507,
        "showAs": " 507. Deputy Peter Burke asked the Minister for Children, Equality, Disability, Integration and Youth when grants will be available for childcare providers to extend their premises; the details of the scheme; and if he will make a statement on the matter. [7934/24] ",
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  €69 million has been allocated over the period 2023-2025 to the early learning and childcare sector under the revised National Development Plan (NDP). This will enable significant capital investment in early learning and childcare across three pillars:  • Building Blocks - Improvement Grant;  • Building Blocks - Capacity Grant; and  • Building Blocks - Innovation Grant.  Some €45 million has been set aside for early learning and childcare capital projects over 2024 and 2025. On 7th December last, I announced details of the Building Blocks - Capacity Grant scheme, to be operated over 2024 and 2025, which is aimed at addressing capacity gaps by expanding existing provision through internal renovations and extensions where most needed. Funding will be split into two strands.  The Building Blocks Expansion Grant Scheme is due to open for applications in the coming weeks. The scheme will provide grants for the renovation or reconfiguration of existing Early Learning and Care facilities. Applicant Guidelines will be provided this month, outlining the rules and requirements of the scheme along with the eligibility criteria and a further Press Release will issue announcing the opening of the application process.  Further details of the Building Blocks Extension Grant Scheme will be announced later this year. This strand will provide grants for larger scale extension projects.  In the case of both the Expansion Grant Scheme and the Extension Grant Scheme, priority will be given to the extension of full-time and part-time places within the 1 - 3-year-old (pre-ECCE) age groups, within areas of identified undersupply. Both schemes will be open to early learning and childcare services that are Tusla registered and are in contract with Core Funding, at the time of application. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-02-20",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-02-07",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-07/writtens/mul@/dbsect_208.xml"
            }
          },
          "debateSectionId": "dbsect_208",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-07/writtens/dbsect_208",
          "showAs": "Schools Building Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-02-07/pq_203",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 203,
        "showAs": " 203. Deputy Peter Burke asked the Minister for Education if an application for a school extension (details supplied) will be considered favourably; and if she will make a statement on the matter. [5414/24] ",
        "answerText": " Minister for Education  I can confirm to the Deputy, that there is no current Additional School Accommodation (ASA) scheme application on hand, from the school in question.  The purpose of the Additional School Accommodation scheme is to ensure that essential mainstream and special education classroom accommodation is available to cater for pupils enrolled each year and where the need cannot be met by the school’s existing accommodation or by other schools in the area.  However, I am pleased to state that approval was given to the school for a significant project in 2021.  The approval includes the provision of:  3x General Classrooms,  1x Textiles room,  1x Science lab/Prep Area,  1x Graphics room,  1x Art room, 1x Art Project store,  2 Special Education Classrooms  1x WC for Assisted users.  This project has been devolved to the school authorities and it is currently at Stage 1. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-02-07",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-02-01",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-01/writtens/mul@/dbsect_181.xml"
            }
          },
          "debateSectionId": "dbsect_181",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-02-01/writtens/dbsect_181",
          "showAs": "Driver Licences"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-02-01/pq_181",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 181,
        "showAs": " 181. Deputy Peter Burke asked the Minister for Transport if he could advise on a driving licence (details supplied). [4745/24] ",
        "answerText": " Minister of State at the Department of Transport  A driving licence can be renewed up to 10 years after its expiry. After that time, a person is no longer considered a qualified driver and must complete the driving licence process (pass the theory test, complete 12 Essential Driver Training lessons, and pass a practical driving test) to obtain a new licence.  A valid in-date driving licence is required to drive legally in Ireland and must be carried when driving. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-02-01",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-01-31",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-31/writtens/mul@/dbsect_87.xml"
            }
          },
          "debateSectionId": "dbsect_87",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-31/writtens/dbsect_87",
          "showAs": "School Curriculum"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-01-31/pq_38",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 38,
        "showAs": " 38. Deputy Peter Burke asked the Minister for Education if she will review the well-being element of the secondary school curriculum, as advocated by Cycle Against Suicide; if she will reshape and resource it to improve the outcome for students; and if she will make a statement on the matter. [4334/24] ",
        "answerText": " Minister for Education  As Minister, I am committed to inclusive education for all. My Department is fully committed to creating safe and supportive environments in schools that are welcoming and inclusive for every student.  The area of wellbeing and the promotion of positive mental health is a priority for my Department. This includes promoting emotional wellbeing, resilience and positive coping skills, which support children and young people to manage the complexities of modern life.  My Department’s approach to supporting wellbeing and mental health is set out in its Wellbeing Policy Statement and Framework for Practice, which informs the ongoing work in the area of student wellbeing and mental health. The approach in the Wellbeing Policy is founded on research and best international practice in relation to how schools can best support the wellbeing and mental health of children and young people.  Social, Personal and Health Education (SPHE) is a mandatory part of the Primary and Junior Cycle curriculum, which provide vital opportunities for the development of children’s wellbeing in the physical, social, emotional and intellectual domains.  An updated Junior Cycle SPHE specification was published by the National Council for Curriculum and Assessment (NCCA) in May 2023 and was rolled out for first years in all schools from last September.  The updated Junior Cycle specification provides clear direction on the knowledge, skills, and dispositions that all students should gain during the three years of Junior Cycle SPHE. It places a strong focus on the development of important life skills that young people need growing up in a fast changing and complex world. The SPHE specification is grounded in values of respect, equality, inclusivity, responsibility, dignity, compassion and empathy.  The updated Junior Cycle SPHE specification consists of four strands: ‘Understanding Myself and Others’, ‘Making Healthy Choices’, ‘Relationships and Sexuality’, and ‘Emotional Wellbeing’.  The learning outcomes of the ‘Emotional Wellbeing’ Strand include that students should be able to ‘discuss the fluid nature of emotional wellbeing and ways to nurture and protect it’, to ‘consider the impact of stress and draw upon a variety of techniques to help self-regulate emotions and cope with the day-to-day stresses of life’, and to ‘discuss ways to support themselves and others in challenging times and where/how/when to seek support, if needed’.  Work is ongoing to update the SPHE specification for Senior Cycle and a draft specification was published for consultation in July 2023, with the consultation running until 3rd November last.  The draft specification includes a strand called ‘Health and Wellbeing’. The learning outcomes of this strand include that students should be able to explore the factors that influence mental health and wellbeing, to recognise unhelpful thinking patterns and negative self-talk, to recognise the signs and symptoms of stress and anxiety in themselves and others and recognise when help should be sought, where to go and how to access help if needed.  Also, in March 2022, I announced an ambitious programme of work for a reimagined Senior Cycle of education where the student is at the centre of their Senior Cycle experience.  These reforms include initiatives to spread the assessment load for students and do so in a way that enhances student wellbeing, to ensure that students and their wellbeing are at the forefront of everything we do.  For this reason I have decided that, Additional Assessment Components (AACs) will be introduced across all new and revised subjects to spread the assessment load more evenly. AACs will be worth a minimum of 40% of the overall available mark, and will be different to a terminal written examination. They will be externally assessed by the State Examinations Commission  These components will also allow for a greater range of students’ skills and competences to be assessed, and will enable the assessment load experienced by Senior Cycle students to be spread more evenly, with a reduced emphasis on the final examinations in June of Sixth Year.  In relation to primary schools, work to develop a draft updated specification for Wellbeing, including SPHE, at Primary level, is being undertaken currently by the National Council for Curriculum and Assessment, or NCCA. This work follows on from the publication of the Primary Curriculum Framework in March 2023, which set out proposals for the redevelopment of the primary curriculum. It is intended that public consultation on a draft specification will happen this year, with the intention of introducing in schools in 2025. There will be an opportunity for anyone with an interest in this area, including issues relating to healthy and unhealthy behaviours, to make their views known and give their input and I strongly encourage you to do so.  Schools are encouraged to use a reflective, school self-evaluation approach to identify and prioritise the needs of its own school community in relation to the promotion of wellbeing and mental health, and to respond to meeting those needs. To support schools in this work the Department funded Teacher Education Support Service, Oide, provides training to schools to ensure that the promotion of wellbeing is at the core of the ethos of every school. The role of Oide’s Health and Wellbeing teams is to support leaders, teachers and schools in the development and promotion of students’ emotional, social, personal and physical health and wellbeing in the context of a positive health-promoting school environment.  In addition, the National Educational Psychological Service (NEPS) of my Department provides a comprehensive, school-based psychological service to all primary and post primary schools through the application of psychological theory and practice to support the wellbeing, academic, social and emotional development of all learners. NEPS have lead responsibility for Wellbeing Policy Implementation and NEPS teams offer training and guidance for teachers in the provision of universal and targeted evidence-informed approaches and early intervention to promote children’s wellbeing, social, emotional and academic development.  A dedicated wellbeing portal is also available, bringing together all the wellbeing supports and resources that have been developed by the Department and the Department’s support services, which is available under ‘Wellbeing for Education’ on gov.ie. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-01-31",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-01-31",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-31/writtens/mul@/dbsect_97.xml"
            }
          },
          "debateSectionId": "dbsect_97",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-31/writtens/dbsect_97",
          "showAs": "School Accommodation"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-01-31/pq_47",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 47,
        "showAs": " 47. Deputy Peter Burke asked the Minister for Education if an application for additional space by a school (details supplied) for a special unit providing leaving certificate applied tuition can be considered in light of increased roll numbers; and if she will make a statement on the matter. [4446/24] ",
        "answerText": " Minister for Education  I wish to advise the Deputy that in order to plan for school provision and analyse the relevant demographic data, my Department divides the country into 314 school planning areas and uses a Geographical Information System, using data from a range of sources, including Child Benefit and school enrolment data, to identify where the pressure for school places across the country will arise, and where additional school accommodation is needed at primary and post-primary level.  The main focus of my Department’s resources over the last decade and for the coming period is on provision of critical additional capacity to cater for increasing demographics.  The Department is required to manage the overall school building programme so that we target and prioritise areas that are under greatest pressure for additional school places.  This reflects our fundamental objective of ensuring the availability of a school place for every child.  I can confirm that an application for additional school accommodation (ASA) was received in the Department and based on the school having sufficient permanent and temporary accommodation in place, the ASA was refused.  The purpose of the ASA scheme is to ensure that essential mainstream classroom and Special Education Needs, or SEN, accommodation is available to cater for pupils enrolled each year, where the need cannot be met by the school’s existing accommodation.  It is open to the school in question to submit an application for the Department's ASA scheme if there is a change to their enrolments which cannot be managed within the existing building.  Any application will be considered by my officials and a decision conveyed directly to the school authorities. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-01-31",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-01-31",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-31/writtens/mul@/dbsect_100.xml"
            }
          },
          "debateSectionId": "dbsect_100",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-31/writtens/dbsect_100",
          "showAs": "Schools Building Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-01-31/pq_51",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 51,
        "showAs": " 51. Deputy Peter Burke asked the Minister for Education when a building project will be progressed (details supplied); and if she will make a statement on the matter. [4464/24] ",
        "answerText": " Minister for Education  The project to which the Deputy refers was approved a project under the Additional School Accommodation Scheme (ASA) for the provision of one Mainstream Classroom.  The school authority was notified of this approval and agreed to adhere to the mandatory procedures and requirements for each stage of the architectural process in order to ensure the project meets my Department’s published standards in design, planning and funding. Unfortunately, these requirements were not adhered to in this instance.  My Department is engaging closely with the school authority in order to resolve any outstanding issues as part of its assessment of the project and will advise the school authority shortly on the outcome of this review. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-01-31",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-01-31",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-31/writtens/mul@/dbsect_113.xml"
            }
          },
          "debateSectionId": "dbsect_113",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-31/writtens/dbsect_113",
          "showAs": "Sports Funding"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-01-31/pq_64",
        "to": {
          "roleType": null,
          "showAs": "Tourism",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 64,
        "showAs": " 64. Deputy Peter Burke asked the Minister for Tourism, Culture, Arts, Gaeltacht, Sport and Media if she will advise when the sports capital grants that were submitted in September 2023 will be allocated. [4453/24] ",
        "answerText": " Minister of State at the Department of Tourism, Culture, Arts, Gaeltacht, Sport and Media  The Sports Capital and Equipment Programme (SCEP) is the primary vehicle for Government support for the development of sports and recreation facilities and the purchase of non-personal sports equipment throughout the country. Over 13,000 projects have now benefited from sports capital funding since 1998 bringing the total allocations in that time to over €1.15 billion. The Programme for Government commits to continuing the SCEP and to prioritising investment in disadvantaged areas.  The latest round of the SCEP (2023) closed for applications on Friday 8 September, 2023. A preliminary examination of the submitted applications demonstrates that the Programme has again generated a very large number of applications. The total number of 3,210 applications, exceeds the record number submitted under the last (2020) round.  The \"Scoring System and Assessment Manual\" for the 2023 round has been finalised and published. Also published, is the full list of all applications received by county including the relevant sport type for each application received. The detailed assessment work has commenced and it is planned to assess the \"equipment-only\" applications first and announce these grants in the coming months. Work will then commence on assessing the capital applications with the allocations likely to be announced later. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-01-31",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-01-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-30/writtens/mul@/dbsect_164.xml"
            }
          },
          "debateSectionId": "dbsect_164",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-30/writtens/dbsect_164",
          "showAs": "Primary Medical Certificates"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-01-30/pq_221",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 221,
        "showAs": " 221. Deputy Peter Burke asked the Minister for Finance when the qualifying criteria for the primary medical certificate will be reviewed; and if he will make a statement on the matter. [4207/24] ",
        "answerText": " Minister for Finance  The final report of the NDIS Transport Working Group's review of mobility and transport supports including the Disabled Drivers and Disabled Passengers Scheme (DDS), endorsed proposals for a modern, fit-for-purpose vehicle adaptation scheme in line with international best practice that would replace the DDS, as it is no longer fit-for-purpose on any and all aspects.  The proposals note this was a clear deliverable for the near future.  The NDIS TWG was chaired by Minister Anne Rabbitte and led by the Department of Children, Equality, Disability, Integration and Youth (DCEDIY).Access to transport for people with disabilities is a multifaceted issue that involves work carried out by multiple Government departments and agencies. Under the aegis of the Department of Taoiseach officials from relevant Departments and agencies are meeting to discuss the issues arising from the NDIS report and to map a way forward. My officials are proactively engaging with this Senior Officials Group work as an important step in considering ways to replace the DDS, as one specific personal transport response, in the context of broader Government consideration of holistic, multifaceted and integrated transport and mobility supports for those with a disability. Three meetings of the SOG have been held, in July, November and December 2023.  In that context, any further changes to the existing DDS would run counter to NDIS proposals to entirely replace the scheme with a modern, fit-for-purpose vehicular adaptation scheme. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-01-30",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-01-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-30/writtens/mul@/dbsect_197.xml"
            }
          },
          "debateSectionId": "dbsect_197",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-30/writtens/dbsect_197",
          "showAs": "Special Educational Needs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-01-30/pq_258",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 258,
        "showAs": " 258. Deputy Peter Burke asked the Minister for Education if she will advise if a project for a second ASD unit in a school (details supplied) will continue to progress; and if she will make a statement on the matter. [3733/24] ",
        "answerText": " Minister of State at the Department of Education  Enabling children with special educational needs to receive an education is a priority for this government. It is also a key priority for me as Minister for Special Education & Inclusion, for my department and for the National Council for Special Education (NCSE).  The vast majority of children with special educational needs are supported to attend mainstream classes with their peers. Where children with more complex needs require additional supports, special classes and special school places are provided.  In 2023, my department spent over €2.6 billion on special education and further progress will be made this year as an additional €113m will be dedicated to providing supports for children with special educational needs.  This includes funding to support children with special educational needs in mainstream classes; funding for new special classes and new special school places; additional special educational teachers, special needs assistants (SNAs) and funding for the National Educational Psychological Service (NEPS).  In 2024, the number of teaching and SNA posts in our schools will increase with an additional 744 teachers and 1,216 SNAs added to deliver up to 2,700 new places for children with special educational needs. This will mean we will have over 41,500 qualified and committed people in our schools who are focused wholly and exclusively on supporting children with special educational needs.  The NCSE has the responsibility for planning and coordinating school supports for children with special educational needs.  Over the last number of years, my department and the NCSE have introduced a number of strategic initiatives to plan for and provide sufficient special class and special school places.  These initiatives are bearing fruit with almost 1,300 new special classes sanctioned and seven new special schools established over the last four years.  My department engage intensely with the NCSE in relation to the forward planning of new special classes and additional special school places. This forward planning work is well underway ahead of the 2024/25 school year. This work involves a detailed review of statistical data in relation to forecasting demand for special class places, an analysis of available school accommodation, consideration of improved data sharing arrangements and a particular focus on the provision of special classes at post-primary level.  As a result of this forward planning, Minister Foley and l announced the establishment of two special schools for this current 2023/2024 school year, with further capacity being expanded in 11 other special schools and that a further four special schools for the 2024/25 school year will be established.  Along with the two new special schools, 389 new special classes – 253 at primary and 136 at post-primary level – have been sanctioned by the NCSE for opening this current 2023/2024 school year.  Of these 6 are in Westmeath, 4 at primary and 2 at post-primary level. This brings to 59 the number of special classes in County Westmeath, 39 at primary level and 20 at post-primary level.  As demand for new special classes at post-primary level is expected to increase significantly over the next few years, due to increasing demographics and increasing prevalence rates, my department and the NCSE have engaged with post-primary stakeholders in relation to the provision of special classes.  My department has communicated to all post-primary schools of the need to begin planning to provide additional special classes. It is envisaged that all post-primary schools will be required to provide special classes over the next 2 to 4 years, with an approximate average of 4 special classes in each school.  Parents seeking special class placements for their children are advised to contact the NCSE locally so that their needs can be taken into account for planning purposes. Local SENOs are available to assist and advise parents of children with special educational needs. Parents may contact SENOs directly using the contact details available on the NCSE's website at: www.ncse.ie/regional-services-contact-list.  My department and the NCSE are committed to ensuring that sufficient special education placements will be available for children for this school year and future years.  As your question relates to a specific school, my department will ask the NCSE to consider the matter and provide a direct response. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-01-30",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-01-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-30/writtens/mul@/dbsect_217.xml"
            }
          },
          "debateSectionId": "dbsect_217",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-30/writtens/dbsect_217",
          "showAs": "Teaching Council of Ireland"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-01-30/pq_277",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 277,
        "showAs": " 277. Deputy Peter Burke asked the Minister for Education if an application for registration for the Teaching Council will be considered (details supplied); and if she will make a statement on the matter. [3964/24] ",
        "answerText": " Minister for Education  The Teaching Council registers teachers under the Teaching Council Act 2001-2015 and in line with the Teaching Council Registration Regulations, 2016. As set out in the Schedule of the Regulations, the Council registers teachers under five routes of registration: Route 1 - Primary, Route 2 - Post-primary, Route 3 - Further Education, Route 4 - Other and Route 5 - Student Teacher. The registration requirements for each route is set out in the Teaching Council [Registration] Regulations 2016.  The Minister has no role in the registration of individual teachers, and the Teaching Council as the statutory body is the point of contact for applicants seeking information as to the status of their registration.  However, the Teaching Council has informed me that the person that the Deputy is referring to in this query has been registered in accordance with their recent application to the Teaching Council. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-01-30",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-01-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-23/writtens/mul@/dbsect_99.xml"
            }
          },
          "debateSectionId": "dbsect_99",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-23/writtens/dbsect_99",
          "showAs": "Recycling Policy"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-01-23/pq_142",
        "to": {
          "roleType": null,
          "showAs": "Environment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 142,
        "showAs": " 142. Deputy Peter Burke asked the Minister for the Environment, Climate and Communications if consideration has been given to a mobile app which will streamline the process in relation to the deposit return scheme; and if he will make a statement on the matter. [2844/24] ",
        "answerText": " Minister for the Environment, Climate and Communications (Deputy Eamon Ryan)  A national Deposit Return Scheme (DRS) is being introduced to encourage more people to recycle plastic bottles and aluminium cans and to ensure we meet our ambitious EU targets for the recycling of those containers under EU Single Use Plastics and Packaging legislation.  Mobile apps, to scan a barcode and verify that the product is registered with DRS, are being considered by Re-turn, the DRS operator, but the use of such apps would be supplementary to existing labelling requirements.  Under the DRS Regulations, all DRS products must be labelled in the manner prescribed by the DRS operator. DRS operate successfully in over 40 countries around the world, including 15 in Europe, and the inclusion of mandatory, labelling requirements is a key design feature of these schemes.  Clear labelling makes it easier for consumers and retailers to identify products which are covered by DRS and it reduces the risk of deposit fraud (e.g. where a beverage is purchased in one jurisdiction without a deposit and returned in a neighbouring jurisdiction where a refund is obtained). The risk of this type of fraud is much higher where there is a jurisdiction in close proximity which does not have a DRS, as is the case here with Northern Ireland.  Guidelines on the use of a national logo were published by Re-Turn in February 2023, followed by a Labelling Manual in April 2023. This provided all operators with easy access to Re-Turn’s design and printing specifications to enable them to update their packaging in advance of the introduction of DRS. An alternative option is available, in the form of a sticker, to supplement rather than replace existing packaging, for small-scale operators or operators who do not have control over their packaging. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-01-23",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-01-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-23/writtens/mul@/dbsect_100.xml"
            }
          },
          "debateSectionId": "dbsect_100",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-23/writtens/dbsect_100",
          "showAs": "Recycling Policy"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-01-23/pq_143",
        "to": {
          "roleType": null,
          "showAs": "Environment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 143,
        "showAs": " 143. Deputy Peter Burke asked the Minister for the Environment, Climate and Communications what supports are available for small and medium sized businesses to implement the deposit return scheme. [2845/24] ",
        "answerText": " Minister for the Environment, Climate and Communications (Deputy Eamon Ryan)  A national Deposit Return Scheme (DRS) is being introduced to encourage more people to recycle plastic bottles and aluminium cans and to ensure we meet our ambitious EU targets for the recycling of those containers under EU Single Use Plastics and Packaging legislation.  The DRS Regulations also place obligations on retailers to charge their customers a deposit for every in-scope drink sold, to take back the empty drink container and to refund the deposit when it is returned for recycling.  All retailers will receive a handling fee from Re-turn (the DRS operator) for providing a take-back service. Handling fees are intended to offset the cost of collection infrastructure, retail floor space, staff costs and security. The level of handling fee payable is determined by Re-turn and is subject to independent, third-party verification.  In addition to handling fees, a number of other supports are in place to assist small retailers, including exemptions from take-back services and financial support for the installation of Reverse Vending Machines. Details of these supports, as well as other useful information to help retailers prepare for DRS, is available on Re-turn’s at https://re-turn.ie/retailer/ or by contacting Re-turn at retailer@re-turn.ie. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-01-23",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-01-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-23/writtens/mul@/dbsect_247.xml"
            }
          },
          "debateSectionId": "dbsect_247",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-01-23/writtens/dbsect_247",
          "showAs": "Special Educational Needs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-01-23/pq_295",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 295,
        "showAs": " 295. Deputy Peter Burke asked the Minister for Education when a school place in second-level education for a child with special needs will be confirmed (details supplied); and if she will make a statement on the matter. [2771/24] ",
        "answerText": " Minister of State at the Department of Education and Skills  Enabling children with special educational needs to receive an education is a priority for this government. It is also a key priority for me as Minister for Special Education & Inclusion, for my department and for the National Council for Special Education (NCSE).  The vast majority of children with special educational needs are supported to attend mainstream classes with their peers. Where children with more complex needs require additional supports, special classes and special school places are provided.  In 2023, my department spent over €2.6 billion on special education and further progress will be made this year as an additional €113m will be dedicated to providing supports for children with special educational needs.  This includes funding to support children with special educational needs in mainstream classes; funding for new special classes and new special school places; additional special educational teachers, special needs assistants (SNAs) and funding for the National Educational Psychological Service (NEPS).  In 2024, the number of teaching and SNA posts in our schools will increase with an additional 744 teachers and 1,216 SNAs added to deliver up to 2,700 new places for children with special educational needs. This will mean we will have over 41,500 qualified and committed people in our schools who are focused wholly and exclusively on supporting children with special educational needs.  The NCSE has the responsibility for planning and coordinating school supports for children with special educational needs.  Over the last number of years, my department and the NCSE have introduced a number of strategic initiatives to plan for and provide sufficient special class and special school places.  These initiatives are bearing fruit with almost 1,300 new special classes sanctioned and seven new special schools established over the last four years.  My department engage intensely with the NCSE in relation to the forward planning of new special classes and additional special school places. This forward planning work is well underway ahead of the 2024/25 school year. This work involves a detailed review of statistical data in relation to forecasting demand for special class places, an analysis of available school accommodation, consideration of improved data sharing arrangements and a particular focus on the provision of special classes at post-primary level.  As a result of this forward planning, Minister Foley and l announced the establishment of two special schools for this current 2023/2024 school year, with further capacity being expanded in 11 other special schools and that a further four special schools for the 2024/25 school year will be established.  Along with the two new special schools, 389 new special classes – 253 at primary and 136 at post-primary level – have been sanctioned by the NCSE for opening this current 2023/2024 school year.  Of these 6 are in Westmeath, 4 at primary and 2 at post-primary level. This brings to 59 the number of special classes in County Westmeath, 39 at primary level and 20 at post-primary level.  As demand for new special classes at post-primary level is expected to increase significantly over the next few years, due to increasing demographics and increasing prevalence rates, my department and the NCSE have engaged with post-primary stakeholders in relation to the provision of special classes.  My department has communicated to all post-primary schools of the need to begin planning to provide additional special classes. It is envisaged that all post-primary schools will be required to provide special classes over the next 2 to 4 years, with an approximate average of 4 special classes in each school.  In relation to the student referred to by the Deputy, the NCSE has advised my department that the family have been in contact with the local special educational needs organiser (SENO) in relation to a secondary-level placement. The SENO has advised the family of available autism classes in the area and a particular school with available capacity are aware of the transition documents that are required and have liaised with NEPS in order to support this transition.  The SENO remains available to the family to provide further support and advice.  Parents seeking special class placements for their children are advised to contact the NCSE locally so that their needs can be taken into account for planning purposes. Local SENOs are available to assist and advise parents of children with special educational needs. Parents may contact SENOs directly using the contact details available on the NCSE's website at: www.ncse.ie/regional-services-contact-list  My department and the NCSE are committed to ensuring that sufficient special education placements will be available for children for this school year and future years. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-01-23",
        "by": {
          "showAs": "Peter Burke",
          "memberCode": "Peter-Burke.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Burke.D.2016-10-03"
        }
      }
    }
  ]
}