{
  "head": {
    "counts": {
      "questionCount": 22,
      "resultCount": 22
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  By way of background for the Deputy, Youthreach provides a two-year education and training pathway for young people who have left mainstream education with limited qualifications. The programme supports learners in gaining the skills, knowledge, and confidence to progress to further education, training, or employment. Certification is typically achieved at Levels 3 and 4 on the National Framework of Qualifications (NFQ).  In 2023, the Teachers’ Union of Ireland (TUI) requested that the Workplace Relations Commission (WRC) recommence conciliation on a previously submitted claim that sought alignment of the 225-day Youthreach calendar with that of the post-primary school calendar.  My Department has been engaging with the TUI on this and agreed on a structured approach to consider the proposal. As part of this process, officials have undertaken a comprehensive data collection exercise, consulted with key stakeholders, and analysed the data gathered. I expect to receive a paper for consideration in the coming weeks. This paper examines TUI’s proposal in terms of potential industrial relations implications, impacts on learners, value for money, and other relevant factors.  Given the significance of the proposed changes to the delivery of this important national programme, I am sure the Deputy will agree that, in considering TUI’s proposal, a thorough and evidence-informed process is essential. ",
        "to": {
          "showAs": "Further and Higher Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Kevin Boxer Moran",
          "memberCode": "Kevin-Boxer-Moran.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kevin-Boxer-Moran.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_1005.xml"
            }
          },
          "debateSectionId": "dbsect_1005",
          "showAs": "Youth Work Supports",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_1005"
        },
        "questionNumber": 1162,
        "date": "2025-11-12",
        "showAs": " 1162. Deputy Kevin Boxer Moran asked the Minister for Further and Higher Education, Research, Innovation and Science when discussions regarding the alignment of the Youthreach calendar year with the second level calendar year will be concluded; when an announcement will be made; and if he will make a statement on the matter. [62221/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_1162"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "date": "2017-05-23",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-05-23/writtens/dbsect_252",
          "showAs": "Local Authority Housing Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-05-23/writtens/mul@/dbsect_252.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_252"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kevin-Boxer-Moran.D.2016-10-03",
          "memberCode": "Kevin-Boxer-Moran.D.2016-10-03",
          "showAs": "Kevin Boxer Moran"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Housing",
          "roleType": null
        },
        "showAs": " 302. Deputy Kevin Boxer Moran asked the Minister for Housing, Planning, Community and Local Government the number of proceedings for possession that were undertaken by local authorities in each of the years 2010 to 2016, respectively, relating to local authority tenancies; the number of local authority low cost home ownership schemes; and the number of evictions that were executed for each category in each of the years 2010 to 2016, respectively; and if he will make a statement on the matter. [24650/17] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2017-05-23/pq_302",
        "questionNumber": 302,
        "answerText": " Minister for Housing, Planning, Community and Local Government  Information in relation to evictions of local authority tenants, as supplied by local authorities for my Department’s Housing Statistics, is available on my Department’s website at the following link:   http://www.housing.gov.ie/housing/statistics/house-prices-loans-and-profile-borrowers/local-authority-loan-activity.   Information in relation to local authority loans is also available at the link above.  Information on tenant purchase is available at the link below:   http://www.housing.gov.ie/housing/statistics/social-and-affordble/other-local-authority-housing-scheme-statistics.   Information on Affordable Housing Schemes can be accessed at the link below:   http://www.housing.gov.ie/housing/statistics/affordable-housing/affordable-housing-and-part-v-statistics.  "
      },
      "contextDate": "2017-05-23"
    },
    {
      "question": {
        "date": "2017-05-02",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-05-02/writtens/dbsect_418",
          "showAs": "Homeless Persons Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-05-02/writtens/mul@/dbsect_418.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_418"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kevin-Boxer-Moran.D.2016-10-03",
          "memberCode": "Kevin-Boxer-Moran.D.2016-10-03",
          "showAs": "Kevin Boxer Moran"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Housing",
          "roleType": null
        },
        "showAs": " 454. Deputy Kevin Boxer Moran asked the Minister for Housing, Planning, Community and Local Government the reasons for homelessness of each household accepted by local authorities as homeless over the past two years; the type of accommodation previously occupied by each such household before becoming homeless (details supplied); and if he will make a statement on the matter. [19570/17] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2017-05-02/pq_454",
        "questionNumber": 454,
        "answerText": " Minister for Housing, Planning, Community and Local Government  The assessment of households for social housing support, including homeless households, is a matter for individual housing authorities in accordance with the Housing (Miscellaneous Provisions) Act 2009 and associated regulations. The results of the statutory Summary of Social Housing Assessments carried out in 2016 provide updated figures on the number of households who qualified for social housing support across each housing authority, including the number of qualified households whose housing need arose from homelessness. The full results of the 2016 Summary are available on my Department’s website at the following link: http://www.housing.gov.ie/sites/default/files/publications/files/summary_of_social_housing_assessments_2016.pdf.  Homelessness is a complex phenomenon which is usually the result of a number of inter-related issues, often including complex personal problems, mental health, addiction, relationship breakdown, family issues, domestic violence, financial loss, economic insecurity, rent arrears, tenancy issues, anti-social behaviour, the vulnerability of migrants, etc. The myriad of issues contributing to homelessness mean that it is of limited value to attempt to classify incidence of homeless presentation to a single causative factor. It is generally accepted that the supply shortage across the housing sector, which in turn is a result of the economic collapse and the associated contraction in the construction sector, has been a driving force behind the increased number of families and individuals presenting as homeless in recent times.  Recent housing authority analysis into reasons for homeless presentations by families identifies two broad categories: departure from private rented accommodation, primarily following receipt of a ‘notice to quit’, and family circumstances which includes both relationship breakdown and overcrowding. As noted, it is overly simplistic to classify presentation by a single causative factor and it is likely in many cases that underlying reasons overlap. This analysis corresponds with recent independent surveys carried out by homeless service providers. "
      },
      "contextDate": "2017-05-02"
    },
    {
      "question": {
        "date": "2017-04-04",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-04-04/writtens/dbsect_521",
          "showAs": "Beef Imports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-04-04/writtens/mul@/dbsect_521.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_521"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kevin-Boxer-Moran.D.2016-10-03",
          "memberCode": "Kevin-Boxer-Moran.D.2016-10-03",
          "showAs": "Kevin Boxer Moran"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Agriculture",
          "roleType": null
        },
        "showAs": " 594. Deputy Kevin Boxer Moran asked the Minister for Agriculture, Food and the Marine the action taken by his Department in view of the Brazilian beef and poultry producer scandal which has seen allegations of shipment of adulterated meat, allegations of shady practices and allegations of endemic corruption within the Brazilian beef and poultry sectors; if Ireland will be joining the growing number of countries which have banned meat imports from Brazil following the scandal; if Ireland will advocate for beef to be taken off the agenda in the Mercosur talks; and if he will make a statement on the matter. [16324/17] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2017-04-04/pq_594",
        "questionNumber": 594,
        "answerText": " Minister for Agriculture, Food and the Marine  Brazilian police announced on 17 March that, after a two-year probe, they had discovered evidence that a number of beef and poultry plants allegedly bribed inspectors to overlook improper practices. This facilitated the export of meat unfit for human consumption. 21 Brazilian establishments are concerned. Most of them produce for the domestic market and only 4 of them are approved for meat export to the EU.  My Department is closely monitoring this case through our Embassy in Brasilia who are in direct contact with the Brazilian authorities, and through the European Commission.  As soon as the story broke on Saint Patricks Day, the European Commission asked for clarification from the Brazilian authorities. It is the Commission which approves the Third Countries for export of meat into the EU on behalf of MS.  On 19 March the Brazilian authorities (MAPA) confirmed that they had been informed of the Federal Police Operation on 17 March. Based on information received, they suspended certification from the 4 establishments under investigation that were approved for export to the EU.  On 20 March the Commission requested full information on all exports to the EU from the 4 establishments since 1 January 2017, and asked the Brazilian authorities to recall any consignments in transit. The Commission also suggested the suspension of certification from all other establishments approved for export to the EU, pending the outcome of a full investigation.  On 21 March I wrote to Commissioner Andriukaitis, supporting the suggestion to suspend certification from all other establishments approved for export to the EU.  Food safety is a shared responsibility between national and EU authorities. Food business operators in the EU also carry out their own quality and safety checks in line with their responsibilities to ensure that their products are safe.  My Department is in charge of carrying out controls on imports (at Border Inspection Posts – BIPs). The EU imposes strict hygiene and safety controls on food imports, and in particular on animal products for which documentary, identity and physical checks are compulsory for meat products imports. These are implemented here in Ireland by veterinary staff from my Department at the Border Inspection Posts.  The checks on all Brazilian product are now being intensified in light of current developments.  Following on from a meeting of the Chief Veterinary Officers of the EU on 24 March it was unanimously decided at the Standing Committee on Plants, Animals, Food and Feed that there would now be 100% physical checks on all Brazilian shipments presented for import to the EU as well as 20% microbiological checks on said consignments.  On the subject of removing beef from the EU-Mercosur FTA talks, I have been very active in highlighting the potentially damaging impact of a Mercosur deal on the European agriculture sector, and on the beef sector in particular. Following intense lobbying from Ireland and other EU Member states, the Commission decided to exclude a TRQ for beef when it exchanged offers with Mercosur on 11 May 2016.   I will continue to raise the issue with Commissioners Malmström and Hogan, both within and outside the Council of Agriculture Ministers. I will also continue to monitor the situation closely in co-operation with my Member State colleagues, as well as with my Government colleagues. "
      },
      "contextDate": "2017-04-04"
    },
    {
      "question": {
        "date": "2017-03-21",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/dbsect_95",
          "showAs": "Community Policing",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/mul@/dbsect_95.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_95"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kevin-Boxer-Moran.D.2016-10-03",
          "memberCode": "Kevin-Boxer-Moran.D.2016-10-03",
          "showAs": "Kevin Boxer Moran"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Justice",
          "roleType": null
        },
        "showAs": " 112. Deputy Kevin Boxer Moran asked the Tánaiste and Minister for Justice and Equality her plans to increase the number of community gardaí based at Lucan, Ronanstown, Ballyfermot, Leixlip and Clondalkin Garda stations; and if she will make a statement on the matter. [13014/17] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2017-03-21/pq_112",
        "questionNumber": 112,
        "answerText": " Tánaiste and Minister for Justice and Equality  As the Deputy will appreciate, the Garda Commissioner is responsible for the distribution of resources, including personnel, among the various Garda Divisions and I, as Minister, have no direct role in the matter. Garda management keeps this distribution of resources under continual review in the context of crime trends and policing priorities so as to ensure that the optimum use is made of these resources.  I am informed by the Garda Commissioner that in regard to the deployment of Garda personnel, a distribution model is used which takes into account all relevant factors including population, crime trends and the policing needs of each individual Garda Division. It is the responsibility of the Divisional Officer to allocate personnel within his/her Division.  The Commissioner has advised that it is the case that all Gardaí have a role to play in addressing community policing issues as and when the need arises. In that sense, community policing involves far more than a single unit within An Garda Síochána.  Community policing is at the heart of An Garda Síochána. It provides a means of recognising that every community – both urban and rural – has its own concerns and expectations. In this regard I welcome the strong emphasis placed by the Garda Commissioner's Modernisation and Renewal Programme 2016-2021 on further developing and supporting the community policing ethos of the organisation so that Gardaí spend more time in the community, gaining public confidence and trust and providing a greater sense of security. Proposed initiatives include the establishment of local Community Policing Teams (CPTs) headed by an Inspector and made up of Gardaí from across a range of areas to proactively work with the community to prevent and detect crime; and the establishment of Community Safety Fora in every District comprising local Gardaí, local communities and key stakeholders.  This Government is committed to ensuring a strong and visible police presence throughout the country in order to maintain and strengthen community engagement, provide reassurance to citizens and deter crime. To make this a reality for all, the Government has in place a plan to achieve an overall Garda workforce of 21,000 personnel by 2021 comprising 15,000 Garda members, 2,000 Reserve members and 4,000 civilians. This year, funding has been provided for the recruitment of 800 Garda recruits and up to 500 civilians to support the wide ranging reform plan in train in An Garda Síochána. Funding has also been provided for the recruitment of 300 Garda Reserves.  I am informed by the Commissioner that, since the reopening of the Garda College in September 2014, some 838 recruits have attested as members of An Garda Síochána and have been assigned to mainstream duties nationwide. I am also informed that another 750 trainee Garda are scheduled to attest this year which will see Garda numbers, taking account of projected retirements, increase to around the 13,500 mark by year end.  This focus on investment in personnel is critical. The moratorium on recruitment introduced in 2010 resulted in a significant reduction in the strength of An Garda Síochána. We are now rebuilding the organisation and providing the Commissioner with the resources she needs to allow her to deploy increasing numbers of Community Gardaí across every Garda Division.  This investment in personnel is complemented by substantial investment in resources across the board for An Garda Síochána. The Deputy will be aware of the significant resources that have been made available to An Garda Síochána under the Government's Capital Plan 2016 - 2021. In particular, some €205 million in additional funding for Garda ICT and €46 million for new Garda vehicles has been allocated over the lifetime of the plan. This investment will facilitate the provision of more effective policing services and I have no doubt that the new resources now coming on stream will see an increase in Garda visibility in our communities.  The following table shows the number of Community Gardaí assigned to Lucan, Ronanstown, Ballyfermot, Leixlip and Clondalkin Garda stations on the 31 January 2017, the latest date for which figures are readily available, as provided by the Commissioner.     Garda Station    Number of Community Gardaí      Lucan    6      Ronanstown    7      Ballyfermot    4      Leixlip    0      Clondalkin    7    "
      },
      "contextDate": "2017-03-21"
    },
    {
      "question": {
        "date": "2017-03-21",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/dbsect_96",
          "showAs": "Community Policing",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/mul@/dbsect_96.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_96"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kevin-Boxer-Moran.D.2016-10-03",
          "memberCode": "Kevin-Boxer-Moran.D.2016-10-03",
          "showAs": "Kevin Boxer Moran"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Justice",
          "roleType": null
        },
        "showAs": " 113. Deputy Kevin Boxer Moran asked the Tánaiste and Minister for Justice and Equality if discussions have taken place with An Garda Síochána and the Garda Commissioner regarding the importance of community gardaí as a knowledge base for tackling drug-related crime, identifying potential flashpoints and providing positive and trusted engagement with local communities; and if she will make a statement on the matter. [13015/17] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2017-03-21/pq_113",
        "questionNumber": 113,
        "answerText": " Tánaiste and Minister for Justice and Equality  The Deputy will be aware that the Government has, in its Programme for a Partnership Government, recognised the importance of community policing. It commits the Government to ensuring visible, effective and responsive policing in every community throughout the country in order to provide reassurance to citizens and prevent crime. This commitment is underlined by very significant investments in Garda resources.  However, as the Deputy will appreciate, the specific policing and investigative strategies which may be employed in particular circumstances are a matter for the Commissioner and her management team and I do not have a direct role in this regard. In this regard, the Policing Plan of An Garda Síochána sets out the continued commitment of An Garda Síochána to pro-actively target groups and individuals engaged in organised crime activity including drug crime. I am advised that the National Drugs and Organised Crime Bureau continues to lead out the policing strategy for tackling drugs by demand reduction and supply reduction strategies. The Bureau continues its policy of working with Divisional Drug Units nationwide in tackling supply reduction at local level.  I am advised that community policing continues to be a key aspect of the Garda approach to the prevention and detection of crime. Gardaí engage with a wide range of community based groups, as well in more formal settings such as Joint Policing Committees, to ensure that local issues can be aired and appropriate partnerships formed with communities to address matters of concern. Gardaí also support over 3,700 Community Alert and Neighbourhood Watch Schemes nationwide, and these form an important partnership with An Garda Síochána to prevent crime and protect communities, especially the elderly and more vulnerable persons. In addition, the Garda Text Alert Scheme provides an effective means for Gardaí to communicate crime prevention information to local communities.  On 9 June 2016, the Garda Commissioner launched a five year programme to professionalise, modernise and renew An Garda Síochána, to ensure that it can meet present and future policing and security challenges. An important principle included in the plan is increased Garda visibility, with crime prevention being the number one priority. The Garda modernisation plan was developed with the benefit of inputs from Garda personnel and community stakeholders, as well as the experience of police forces in other jurisdictions. The measures in the plan also respond to reports and recommendations of the Garda Inspectorate and the Garda Síochána Ombudsman Commission.  In conclusion, all Garda activities, including community policing, will undoubtedly benefit from the resources now coming on stream through the Garda recruitment programme, and in particular the Government's commitment to increase Garda numbers to 15,000, so that An Garda Síochána has the capacity to address the needs of communities throughout the country and into the future. "
      },
      "contextDate": "2017-03-21"
    },
    {
      "question": {
        "date": "2017-03-21",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/dbsect_97",
          "showAs": "Garda Equipment",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/mul@/dbsect_97.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_97"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kevin-Boxer-Moran.D.2016-10-03",
          "memberCode": "Kevin-Boxer-Moran.D.2016-10-03",
          "showAs": "Kevin Boxer Moran"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Justice",
          "roleType": null
        },
        "showAs": " 114. Deputy Kevin Boxer Moran asked the Tánaiste and Minister for Justice and Equality her plans to replace or upgrade the PULSE system (details supplied); and if she will make a statement on the matter. [13016/17] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2017-03-21/pq_114",
        "questionNumber": 114,
        "answerText": " Tánaiste and Minister for Justice and Equality  As the Deputy will appreciate, decisions in relation to the provision and allocation of Garda equipment and resources, including ICT, are a matter for the Garda Commissioner and I, as Minister, have no direct role in the matter.  The Deputy will be aware that the Garda Síochána Modernisation and Renewal Programme 2016-2021 is intended to professionalise, modernise and renew An Garda Síochána to ensure that the organisation can meet present and future challenges. I am informed by the Garda authorities that the Programme prioritises ICT projects with the aim of fully embedding technology initiatives to improve the services delivered to communities by An Garda Síochána. Key outputs from the Programme include:  - the introduction of mobile technology solutions to enable operational Gardaí to access core information systems, including PULSE, while on duty and away from Garda stations;  - providing members with real-time information on mobile devices, as well as enabling investigation teams to collect and share information digitally;  - the continued extension of the Garda network throughout 2017 to ensure that non-networked stations gain access to relevant systems;  - modernisation of Garda information systems, such as PULSE, to ensure that members have quick access to timely and accurate information.  In addition, I understand that the following key projects have commenced and will see delivery across 2017:  - Investigations Management System which will support the management of activities completed as part of an investigation, maintain a full history of the chain of events in an investigation, manage information gathered, decisions made and actions taken;  - Property and Exhibit Management System which will be used to record all property and exhibits which come into Garda possession and manage them throughout their life cycle within the organisation from crime scene to court;  - Enterprise Content Management system which will provide An Garda Síochána with a single enterprise content repository for all documentation and multimedia content created (for example CCTV clips); and  - Rosters and Duty Management system.  The Programme is being supported by significant Government investment of some €330 million, including €205 million under the Capital Plan, in Garda ICT infrastructure over the period 2016 to 2021. This major investment will allow An Garda Síochána to deploy the latest cutting edge technologies in the fight against crime and will facilitate progress on important reforms arising from the Garda Inspectorate's report on Crime Investigation. "
      },
      "contextDate": "2017-03-21"
    },
    {
      "question": {
        "date": "2017-03-21",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/dbsect_161",
          "showAs": "Tax Collection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/mul@/dbsect_161.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_161"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kevin-Boxer-Moran.D.2016-10-03",
          "memberCode": "Kevin-Boxer-Moran.D.2016-10-03",
          "showAs": "Kevin Boxer Moran"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Finance",
          "roleType": null
        },
        "showAs": " 180. Deputy Kevin Boxer Moran asked the Minister for Finance if the Revenue Commissioners have discretion to allow tax defaulters who have built up debts to some extent due to mental illness or addiction to alcohol or drugs but who are now recovering, subject to independent medical assessment and verification, to be able to repay their liabilities to an agreed programme and timescale without necessarily being loaded with sometimes punitive levels of interest; if not, if he will examine this matter; and if he will make a statement on the matter. [13030/17] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2017-03-21/pq_180",
        "questionNumber": 180,
        "answerText": " Minister for Finance  I am advised by Revenue that as regards any element of tax default, details of how a taxpayer can correct any errors that have been made in or remedy any omissions from any tax return they have filed are set out in Revenue's Code of Practice for Revenue Audit and other Compliance Interventions (the Code), which has recently been updated. More details, including the full Code are available on the Revenue website at www.revenue.ie.  Revenue will work with taxpayers towards dealing with tax debts, no matter how they might arise, in a way that has regard to the need to support a strong voluntary tax compliance culture, the need to ensure a level playing field for all taxpayers and has appropriate regard for the circumstances of the taxpayer in any given situation. In this latter context I am further advised that it is Revenue practice to respond sensitively to the type of circumstances outlined by the Deputy.  Revenue's ability to arrive at a mutually acceptable arrangement will be predicated on open and honest engagement by the taxpayer and by timely compliance for future tax debts as they arise. Payment of arrears of tax or payment by way of a phased payment arrangement will include interest, which is a statutory charge legislated for by the Oireachtas and provided for in Section 1080 of the Taxes Consolidation Act 1997. I am satisfied that collection of interest by Revenue is a key element in reflecting the value of money forgone by the Exchequer where a taxpayer does not pay what is due on time and is also vital in supporting the efforts of the vast majority of taxpayers who are voluntarily and fully compliant. "
      },
      "contextDate": "2017-03-21"
    },
    {
      "question": {
        "date": "2017-03-21",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/dbsect_182",
          "showAs": "Revenue Commissioners Enforcement Activity",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/mul@/dbsect_182.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_182"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kevin-Boxer-Moran.D.2016-10-03",
          "memberCode": "Kevin-Boxer-Moran.D.2016-10-03",
          "showAs": "Kevin Boxer Moran"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Finance",
          "roleType": null
        },
        "showAs": " 208. Deputy Kevin Boxer Moran asked the Minister for Finance the number of taxpayers who have been prosecuted by reason of delivering to the Revenue Commissioners incorrect income tax returns in circumstances where the taxpayer has zero liability for income tax arising from these returns since the enactment of the Taxes Consolidation Act 1997; the number of these prosecutions that have proceeded summarily in the District Court; the number of these prosecutions that have proceeded upon indictment in the Circuit Criminal Court; and if he will make a statement on the matter.  [13397/17] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2017-03-21/pq_208",
        "questionNumber": 208,
        "answerText": " Minister for Finance  I propose to take Questions Nos. 208 to 210, inclusive, together.  It is an offence, under section 1078(2)(a) of the Taxes Consolidation Act 1997, to knowingly or wilfully deliver an incorrect return, statement or accounts or knowingly or wilfully furnish any incorrect information in connection with any return.  I am advised by Revenue that their records relating to prosecutions are not maintained in a format that would support the provision of information of the extent requested by the Deputy. It is not possible, therefore, given the amount of research that would be required to compile it, to provide the information sought.  I would draw to the Deputy's attention that, in my reply to Question No. 98 of 22 February 2017, I indicated that I had been advised by Revenue that, between the years 2007 and 2016, no prosecutions were instituted for the delivery of an incorrect income tax return where no liability to income tax arose from that return. In replying to Questions Nos. 117 and 118 on 23 February, I said that there were no prosecutions in respect of the delivery of incorrect accounts in connection with corporation tax during those years. "
      },
      "contextDate": "2017-03-21"
    },
    {
      "question": {
        "date": "2017-03-21",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/dbsect_182",
          "showAs": "Revenue Commissioners Enforcement Activity",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/mul@/dbsect_182.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_182"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kevin-Boxer-Moran.D.2016-10-03",
          "memberCode": "Kevin-Boxer-Moran.D.2016-10-03",
          "showAs": "Kevin Boxer Moran"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Finance",
          "roleType": null
        },
        "showAs": " 209. Deputy Kevin Boxer Moran asked the Minister for Finance the number of companies or officers of companies that have been prosecuted by reason of such companies making incorrect returns in connection with corporation tax and in circumstances where these returns attempted to correct omissions from previous returns made by these companies in connection with corporation tax since the enactment of the Taxes Consolidation Act 1997; the number of these prosecutions that have proceeded summarily in the District Court; the number of these prosecutions that have proceeded upon indictment in the Circuit Criminal Court; and if he will make a statement on the matter.  [13398/17] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2017-03-21/pq_209",
        "questionNumber": 209,
        "answerText": " Minister for Finance  I propose to take Questions Nos. 208 to 210, inclusive, together.  It is an offence, under section 1078(2)(a) of the Taxes Consolidation Act 1997, to knowingly or wilfully deliver an incorrect return, statement or accounts or knowingly or wilfully furnish any incorrect information in connection with any return.  I am advised by Revenue that their records relating to prosecutions are not maintained in a format that would support the provision of information of the extent requested by the Deputy. It is not possible, therefore, given the amount of research that would be required to compile it, to provide the information sought.  I would draw to the Deputy's attention that, in my reply to Question No. 98 of 22 February 2017, I indicated that I had been advised by Revenue that, between the years 2007 and 2016, no prosecutions were instituted for the delivery of an incorrect income tax return where no liability to income tax arose from that return. In replying to Questions Nos. 117 and 118 on 23 February, I said that there were no prosecutions in respect of the delivery of incorrect accounts in connection with corporation tax during those years. "
      },
      "contextDate": "2017-03-21"
    },
    {
      "question": {
        "date": "2017-03-21",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/dbsect_182",
          "showAs": "Revenue Commissioners Enforcement Activity",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/mul@/dbsect_182.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_182"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kevin-Boxer-Moran.D.2016-10-03",
          "memberCode": "Kevin-Boxer-Moran.D.2016-10-03",
          "showAs": "Kevin Boxer Moran"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Finance",
          "roleType": null
        },
        "showAs": " 210. Deputy Kevin Boxer Moran asked the Minister for Finance the number of companies or officers of companies that have been prosecuted for delivering to the Revenue Commissioners incorrect accounts in connection with corporation tax whereby a period of six years has expired from the date of the delivery of these accounts to the date of the commencement of this prosecution since the enactment of the Taxes Consolidation Act 1997; the number of these prosecutions that have proceeded summarily in the District Court; the number of these prosecutions that have proceeded upon indictment in the Circuit Criminal Court; and if he will make a statement on the matter. [13399/17] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2017-03-21/pq_210",
        "questionNumber": 210,
        "answerText": " Minister for Finance  I propose to take Questions Nos. 208 to 210, inclusive, together.  It is an offence, under section 1078(2)(a) of the Taxes Consolidation Act 1997, to knowingly or wilfully deliver an incorrect return, statement or accounts or knowingly or wilfully furnish any incorrect information in connection with any return.  I am advised by Revenue that their records relating to prosecutions are not maintained in a format that would support the provision of information of the extent requested by the Deputy. It is not possible, therefore, given the amount of research that would be required to compile it, to provide the information sought.  I would draw to the Deputy's attention that, in my reply to Question No. 98 of 22 February 2017, I indicated that I had been advised by Revenue that, between the years 2007 and 2016, no prosecutions were instituted for the delivery of an incorrect income tax return where no liability to income tax arose from that return. In replying to Questions Nos. 117 and 118 on 23 February, I said that there were no prosecutions in respect of the delivery of incorrect accounts in connection with corporation tax during those years. "
      },
      "contextDate": "2017-03-21"
    },
    {
      "question": {
        "date": "2017-03-21",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/dbsect_232",
          "showAs": "Schools Building Projects Status",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/mul@/dbsect_232.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_232"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kevin-Boxer-Moran.D.2016-10-03",
          "memberCode": "Kevin-Boxer-Moran.D.2016-10-03",
          "showAs": "Kevin Boxer Moran"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Education",
          "roleType": null
        },
        "showAs": " 263. Deputy Kevin Boxer Moran asked the Minister for Education and Skills if a school (details supplied) will be able to open its extension by September 2019; and if approval to proceed to stage 2B will be forthcoming in order that a planning application can be submitted in the coming weeks; and if he will make a statement on the matter. [13012/17] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2017-03-21/pq_263",
        "questionNumber": 263,
        "answerText": " Minister for Education and Skills  The school authority (Dublin and Dún Laoghaire Educational Training Board) was advised by my Department last week, following a review of it’s Stage 2A (Developed Design Stage) submission, that it may now proceed to Stage 2B (Detail Design Stage) which includes the seeking of all statutory approvals including Planning Permission, Fire Safety Certificate and the Disability Access Certificate and the preparation of tender documents.  The timeframe for the further progression of the project through the tender and construction stages will necessarily be dependent on the timeframe for the school authority and its design team successfully completing stage 2B.  Until such time as planning permission has been secured and the project has progressed to and completed tender stage and the appointment of a building contractor, it will not be possible to provide an indicative timeframe for the completion of the construction stage of this project. "
      },
      "contextDate": "2017-03-21"
    },
    {
      "question": {
        "date": "2017-03-21",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/dbsect_233",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/mul@/dbsect_233.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_233"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kevin-Boxer-Moran.D.2016-10-03",
          "memberCode": "Kevin-Boxer-Moran.D.2016-10-03",
          "showAs": "Kevin Boxer Moran"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Education",
          "roleType": null
        },
        "showAs": " 264. Deputy Kevin Boxer Moran asked the Minister for Education and Skills his plans to rectify the situation whereby school secretaries not being employed directly by his Department have generally not received a pay rise in many years with the exception of a single 1% increase; if a small increase in capitation grants to schools directed specifically towards the employment costs of non-teaching staff will be considered; and if he will make a statement on the matter.  [13013/17] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2017-03-21/pq_264",
        "questionNumber": 264,
        "answerText": " Minister for Education and Skills  I propose to take Questions Nos. 264, 352 and 353 together.  Schemes were initiated in 1978 and 1979 for the employment of Clerical Officers and Caretakers in primary and secondary schools. Staff employed on these schemes are paid directly by my Department and are not paid via grant funding. Currently there are a total of 420 people employed on these schemes. The 1978 and 1979 schemes are being phased out and have been superseded by a more extensive capitation grant scheme.  The majority of primary and voluntary secondary schools in the Free Education Scheme now receive capitation grant assistance to provide for secretarial, caretaking and cleaning services. Capitation related grants are issued to the majority of primary and post-primary schools to employ such staff. Within the capitation grant schemes, it is a matter for each individual school to decide how best to apply the grant funding to suit its particular needs. Where a school uses the capitation grant funding to employ a secretary, such staff are employees of individual schools. My Department has no plans to develop an alternative scheme for schools to employ secretaries separate to the current system of capitation grant assistance.  Notwithstanding the above, in 2015 my Department agreed to engage with the union side in relation to the pay of School Secretaries and Caretakers who are employed using grant funding and to enter an arbitration process. The Arbitrator recommended a cumulative pay increase of 10% between 2016 and 2019 for School Secretaries and Caretakers comprehended by the terms of the arbitration process and that a minimum hourly pay rate of €13 for such staff be phased in over the period 2016 to 2019. My Department recently published circular letter 0080/2016 for primary schools and circular letter 0081/2016 for voluntary secondary schools, setting out the application of the second phase increases of the Arbitrator’s recommendations. The circulars are available at:  Circular 0080/2016 http://www.education.ie/en/Circulars-and-Forms/Active-Circulars/cl0080_2016.pdf.  Circular 0081/2016 http://www.education.ie/en/Circulars-and-Forms/Active-Circulars/cl0081_2016.pdf.  The increases recommended by the Arbitrator are binding and must be applied by all schools who employ staff to whom the Arbitrators recommendation applies. The circulars issued by my Department set out the revised rates of grant funding for schools and an application process by which schools can apply for additional funding in order to enable schools to pay the revised rates set out in the circulars. "
      },
      "contextDate": "2017-03-21"
    },
    {
      "question": {
        "date": "2017-03-21",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/dbsect_352",
          "showAs": "Housing Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/mul@/dbsect_352.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_352"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kevin-Boxer-Moran.D.2016-10-03",
          "memberCode": "Kevin-Boxer-Moran.D.2016-10-03",
          "showAs": "Kevin Boxer Moran"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Housing",
          "roleType": null
        },
        "showAs": " 410. Deputy Kevin Boxer Moran asked the Minister for Housing, Planning, Community and Local Government if he has analysed the optimum mix of social and private housing dwellings in large scale developments such as strategic development zones in terms of social cohesion, the tipping point for private buyers to purchase in such schemes, the average income levels sufficient to attract retail and other pull services; if his attention has been drawn to international evidence in this regard; and if he will make a statement on the matter. [13020/17] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2017-03-21/pq_410",
        "questionNumber": 410,
        "answerText": " Minister for Housing, Planning, Community and Local Government  Part V of the Planning and Development Act 2000, as amended, will apply to each individual application or applications for permission for housing in a Strategic Development Zone (SDZ), or any other large development, which should lead to 10% social housing in the development in question.  The acquisition of further social housing units, beyond the Part V requirement, in an SDZ or other development is a matter for the relevant housing authority in the first instance, subject to the policy of sustainable communities, which aims to ensure the provision of a choice of house type, size and tenure within a single neighbourhood.  The objective of this policy is to avoid the significant effects of social isolation and limiting of opportunities that can occur with large mono - tenure estates, frequently necessitating significant regeneration and remediation proposals at a later stage, at considerable cost. This policy approach was reaffirmed in the Social Housing Strategy 2020 published in November 2014 which further defined sustainable neighbourhoods as “areas where an efficient use of land, high quality urban design and effective integration in the provision of physical and social infrastructure such as public transport, schools, amenities and other facilities combine to create places people want to live”.  My Department has produced considerable planning guidance, including Sustainable Residential Development in Urban Areas (2010) and the Manual for Urban Roads and Streets (2013), to assist local authorities to promote sustainable communities. In addition, the Department guidance document, Quality Housing for Sustainable Communities, seeks to promote quality and value for money in publicly funded housing. "
      },
      "contextDate": "2017-03-21"
    },
    {
      "question": {
        "date": "2017-03-21",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/dbsect_353",
          "showAs": "Social and Affordable Housing Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/mul@/dbsect_353.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_353"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kevin-Boxer-Moran.D.2016-10-03",
          "memberCode": "Kevin-Boxer-Moran.D.2016-10-03",
          "showAs": "Kevin Boxer Moran"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Housing",
          "roleType": null
        },
        "showAs": " 411. Deputy Kevin Boxer Moran asked the Minister for Housing, Planning, Community and Local Government his plans to review the 10% social mix in housing developments provided for under current legislation; his plans to facilitate ancillary schemes such as shared ownership as an additional option (details supplied); and if he will make a statement on the matter. [13021/17] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2017-03-21/pq_411",
        "questionNumber": 411,
        "answerText": " Minister for Housing, Planning, Community and Local Government  The Urban Regeneration and Housing Act 2015 made a number of amendments to Part V of the Planning and Development Act 2000, effective from 1 September 2015, following the outcome of an independent review of Part V, which included a consultation process.  The amendments sought to maximise the contribution Part V can make to social housing supply and sustainable mixed-tenure communities across the country. The amendments reduced the overall requirement for social and affordable housing in private developments from 20% to 10% of the total, but also removed the option of a cash payment by the developer in lieu of units, or the transfer of sites or parts of sites. The options remaining are focused on the delivery of completed units. The operation of Part V is kept under review by my Department.  I have currently no plans to re-introduce a Shared Ownership Scheme. However, a range of measures are being taken under the Rebuilding Ireland Action Plan for Housing and Homelessness to increase housing supply overall, with the aim of creating a functioning and sustainable housing system which can meet housing demand at more affordable prices.  The plan is divided into five pillars, with each targeting a specific area of the housing system. Pillar 3, entitled Build More Homes, has a key objective of increasing the output of private housing to meet demand at affordable prices, including by  - Opening up land supply and State lands, including the Major Urban Housing Development Sites initiative, which identified large-scale sites in the main cities that are capable of delivering significant homes in the short to medium term to boost overall housing supply;  - €200m Local Infrastructure Housing Activation Fund;  - National Treasury Management Agency financing of large-scale “on-site” infrastructure;  - Planning Reforms;  - Putting in place a National Planning Framework and land management actions;  - Efficient design and delivery methods to lower housing delivery costs;  - Measures to support construction innovation and skills.  Pillar 4 of the Plan, entitled Improve the Rental Sector, provided for the introduction of an affordable rental scheme to enhance the capacity of the private rented sector to provide quality and affordable accommodation for households currently paying a disproportionate amount of disposable income on rent. As set out in the recently published Strategy for the Rental Sector, this commitment is now being progressed through kick-starting supply in rent pressure zones.  Other measures taken to increase the supply of housing include -  - The enhanced supply of more affordable starter homes in key locations through a targeted rebate of development contributions in Dublin and Cork for housing supplied under certain price levels;  - New National Apartment Planning Guidelines, reducing the cost of apartment building;  - Changes to aspects of the operation of Strategic Development Zones to enable swifter adjustments to meet market requirements;  - A vacant sites levy.  In relation to assistance to purchase, the Help to Buy incentive is designed to assist first-time buyers with obtaining the deposit required to purchase or self-build a new home. The incentive provides for a refund of Income Tax and Deposit Interest Retention Tax (DIRT) paid over the previous four tax years to first-time buyers. Further information on this Scheme can be found on the Revenue Commissioners' website at the following link: http://www.revenue.ie/en/tax/it/reliefs/htb/index.html.  It might also be noted that a first time buyer who is unable to get a loan from a building society or bank may be eligible for a mortgage from their local authority, in cases where the gross income (before tax) is €50,000 or less for a single income household or €75,000 or less in the case of a double income household. The loan can be up to 97% of the price of the house subject to a maximum loan of €200,000. Also first time buyers can apply for a Home Choice Loan to purchase a new or second hand property or build their own home. Home Choice Loan provides up to 92% of the market value of a property purchased, subject to a maximum loan amount of €285,000. Further information is available at www.homechoiceloan.ie. "
      },
      "contextDate": "2017-03-21"
    },
    {
      "question": {
        "date": "2017-03-21",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/dbsect_436",
          "showAs": "Social Welfare Offices",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/mul@/dbsect_436.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_436"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kevin-Boxer-Moran.D.2016-10-03",
          "memberCode": "Kevin-Boxer-Moran.D.2016-10-03",
          "showAs": "Kevin Boxer Moran"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Social",
          "roleType": null
        },
        "showAs": " 495. Deputy Kevin Boxer Moran asked the Minister for Social Protection if plans are in place to securely share information in real time within Intreo and related Departments in order that hours of individual staff productivity are not wasted requesting the same information repeatedly; and if he will make a statement on the matter. [13027/17] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2017-03-21/pq_495",
        "questionNumber": 495,
        "answerText": " Minister for Social Protection  My Department is working towards consolidation on a single ICT ‘platform’ - the Business Object Model implementation - BOMi. This work is carried out as part of my Department’s continuous Service Delivery Modernisation programme.  As this programme progresses, all of my Department’s customer and claim-related systems will be integrated on the BOMi platform, ensuring that all customer and claim information is fully and automatically available across all of my Department’s schemes and places of business.  Separately, my Department continues to move towards having all customer documentation scanned and therefore immediately available to all staff, irrespective of location. "
      },
      "contextDate": "2017-03-21"
    },
    {
      "question": {
        "date": "2017-03-21",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/dbsect_437",
          "showAs": "Supplementary Welfare Allowance",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/mul@/dbsect_437.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_437"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kevin-Boxer-Moran.D.2016-10-03",
          "memberCode": "Kevin-Boxer-Moran.D.2016-10-03",
          "showAs": "Kevin Boxer Moran"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Social",
          "roleType": null
        },
        "showAs": " 496. Deputy Kevin Boxer Moran asked the Minister for Social Protection if there are discretionary payments available for families with wheelchair users that need access to a suitably adapted car in view of the fact that this would save on taxi fares in the long term; and if he will make a statement on the matter. [13028/17] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2017-03-21/pq_496",
        "questionNumber": 496,
        "answerText": " Minister for Social Protection  Under the supplementary welfare allowance (SWA) scheme, the Department may make a single exceptional needs payment (ENP) to help meet essential, once-off and unforeseen expenditure which a person could not reasonably be expected to meet out of their weekly income. The Government has provided €31.5 million for exceptional and urgent needs payments in 2017.  There is no automatic entitlement to a payment. The ENP scheme is demand led and payments are made at the discretion of the officers administering the scheme taking into account the requirements of the legislation and all the relevant circumstances of the case in order to ensure that the payments target those most in need of assistance.  Also under the SWA scheme, the Department may award a travel supplement in any case where the circumstances of the case so warrant. The supplement is intended to assist with ongoing or recurring travel costs that cannot be met from the client’s own resources and are deemed to be necessary. Every decision is based on consideration of the circumstances of the case, taking account of the nature and extent of the need and of the resources of the person concerned.  The Disabled Drivers and Disabled Passengers Scheme, operated by Revenue, provides a range of tax reliefs linked to the purchase and use of specially constructed or adapted vehicles by drivers and passengers with a disability. Further information is provided on the Revenue website at http://www.revenue.ie.  The Government decided that the detailed preparatory work required for a new Transport Support Scheme and associated statutory provisions should be progressed by the Minister for Health. I am informed that the Minister for Health is seeking a solution which would best meet the aim of supporting people with severe disabilities who require additional income to contribute towards the cost of their mobility needs, while remaining within the available budget and satisfying all legal and equality concerns. "
      },
      "contextDate": "2017-03-21"
    },
    {
      "question": {
        "date": "2017-03-21",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/dbsect_577",
          "showAs": "Turf Cutting Compensation Scheme Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/mul@/dbsect_577.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_577"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kevin-Boxer-Moran.D.2016-10-03",
          "memberCode": "Kevin-Boxer-Moran.D.2016-10-03",
          "showAs": "Kevin Boxer Moran"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Arts",
          "roleType": null
        },
        "showAs": " 650. Deputy Kevin Boxer Moran asked the Minister for Arts, Heritage, Regional, Rural and Gaeltacht Affairs the reason for the delay in providing already approved compensation to a person (details supplied) and others in similar situations who have given a commitment to cease cutting of turf on sensitive sites; and if she will make a statement on the matter. [13022/17] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2017-03-21/pq_650",
        "questionNumber": 650,
        "answerText": " Minister for Arts, Heritage, Regional, Rural and Gaeltacht Affairs  The individual referred to in the Deputy’s Question applied to sell her interest in land in a raised bog natural heritage area under the voluntary bog purchase scheme, administered by my Department.  The 2014 Review of Raised Bog Natural Heritage Area Network concluded that Ireland could more effectively achieve conservation of threatened raised bog habitat through focused protection and restoration of a reconfigured network. Arising from this review, 46 raised bog natural heritage areas (including parts of 7 sites) are scheduled for de-designation. The Wildlife (Amendment) Bill 2016 provides for the de-designation of these sites.  The raised bog natural heritage area referred to in the Deputy’s Question is scheduled for de-designation. Domestic turf cutting may continue on this site, while large scale or commercial turf cutting will continue to be regulated through other consent systems.  The position of applications under the voluntary bog purchase scheme, with plots in the sites scheduled for de-designation, is being considered within my Department. "
      },
      "contextDate": "2017-03-21"
    },
    {
      "question": {
        "date": "2017-03-21",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/dbsect_672",
          "showAs": "Accident and Emergency Departments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/mul@/dbsect_672.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_672"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kevin-Boxer-Moran.D.2016-10-03",
          "memberCode": "Kevin-Boxer-Moran.D.2016-10-03",
          "showAs": "Kevin Boxer Moran"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Health",
          "roleType": null
        },
        "showAs": " 775. Deputy Kevin Boxer Moran asked the Minister for Health his plans to liaise with the Ministers for Finance and Social Protection regarding penalties or programmes for otherwise healthy persons who cost the State money by repeatedly clogging up accident and emergency services through multiple cases of injuries and incoherence arising out of intoxication, which is leading to a reduced service for other more vulnerable persons; if such penalties could include the docking of a portion of social welfare payments or an increased income tax surcharge; and if he will make a statement on the matter. [13023/17] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2017-03-21/pq_775",
        "questionNumber": 775,
        "answerText": " Minister for Health  Emergency Departments (ED) provide a 24 hour healthcare service for people, irrespective of the nature of their problem or their social circumstances. ED staff adopt a non-judgmental approach to patients who are intoxicated, misuse substances, have social problems or who may be temporarily unable to look after themselves.  A key challenge in dealing with undiagnosed and acutely distressed patients in an Emergency Department environment is to distinguish between distress that is the result of illness and that which is due to anxiety. This challenge is greater in the case of deciding if someone is simply intoxicated or has a serious medical problem that became manifest after they have been drinking alcohol. The management of patients who have a head injury but also happen/appear to be intoxicated is just one example of why extreme caution and diligence is needed in this area.  It must always be remembered that people who have taken alcohol or other drugs often require medical assistance, either as a direct result of the substances they have taken or because they are more likely to be injured or develop an acute medical complaint.  The docking of social welfare payments or increase tax surcharges as identified by the Deputy are not within the remit of the Department of Health. "
      },
      "contextDate": "2017-03-21"
    },
    {
      "question": {
        "date": "2017-03-21",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/dbsect_1046",
          "showAs": "Swimming Pool Programme Status",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/mul@/dbsect_1046.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_1046"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kevin-Boxer-Moran.D.2016-10-03",
          "memberCode": "Kevin-Boxer-Moran.D.2016-10-03",
          "showAs": "Kevin Boxer Moran"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Transport",
          "roleType": null
        },
        "showAs": " 1182. Deputy Kevin Boxer Moran asked the Minister for Transport, Tourism and Sport the status of funding for the Lucan swimming pool project; if draft architectural plans have been received and a final timescale given for the delivery of same; and if he will make a statement on the matter. [13017/17] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2017-03-21/pq_1182",
        "questionNumber": 1182,
        "answerText": " Minister of State at the Department of Transport, Tourism and Sport  The Local Authority Swimming Pool Programme (LASPP) provides grant aid to local authorities towards the capital costs of new swimming pools or the refurbishment of existing pools. There are four stages in the development of a project under the Local Authority Swimming Pool Programme, namely Preliminary Report, Contract Documents, Tender and Construction.  In January of 2016, my Department contacted local authorities and sought expressions of interest in a limited round of swimming pool allocations. There were three expressions of interest received for new pools, two of which were valid and both in Dublin. Having assessed existing commitments and the funding available, it was decided to include the proposal from South Dublin County Council (SDCC) for a new swimming pool in Lucan in the LASPP.  My Department wrote to SDCC in April 2016 advising the Council to undertake the Preliminary Report stage (which includes the Feasibility Study, Appointment of Consultants for Preliminary Proposals and Design Brief). Documentation in this regard was received from SDCC in July 2016. Following examination by my Department's technical advisor and my officials, SDCC was given approval in October 2016 to appoint the recommended design team and proceed to the design brief. SDCC was also asked to provide outstanding material relating to the feasibility study and the site location map. A reminder in this regard was issued to SDCC in January 2017. No draft architectural plans have yet been received as designing such plans normally takes a number of months. I understand from SDCC however, that work is ongoing in relation to these plans. Once the required documentation is received from the Council, there will be no undue delay in terms of my Department assessing the material in order to move to the next stage of the process. "
      },
      "contextDate": "2017-03-21"
    },
    {
      "question": {
        "date": "2017-03-21",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/dbsect_1047",
          "showAs": "Public Transport Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/mul@/dbsect_1047.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_1047"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kevin-Boxer-Moran.D.2016-10-03",
          "memberCode": "Kevin-Boxer-Moran.D.2016-10-03",
          "showAs": "Kevin Boxer Moran"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Transport",
          "roleType": null
        },
        "showAs": " 1183. Deputy Kevin Boxer Moran asked the Minister for Transport, Tourism and Sport the Government policy regarding the provision of public transport infrastructure along existing transport corridors designated as strategic for the development of future housing (details supplied), in order that these lands can be sustainably developed and public transport solutions put in place alongside the first housing provision; if this policy has been clearly communicated to the semi-autonomous agencies and State companies charged with ensuring the deliverability of such a network; if these agencies will provide a timeline for same as part of any public consultation process for such developments; and if he will make a statement on the matter. [13018/17] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2017-03-21/pq_1183",
        "questionNumber": 1183,
        "answerText": " Minister for Transport, Tourism and Sport  The National Transport Authority (NTA) has statutory responsibility for the planning and development of public transport infrastructure in the Greater Dublin Area (GDA).  The statutory objective of the NTA's Transport Strategy for the Greater Dublin Area 2016 - 2035 is to provide a long-term strategic planning framework for the integrated development of transport infrastructure and services in the GDA. The development of the Strategy was informed by a full public consultation and is required by legislation to have regard to national, regional and local planning policies for the GDA. The NTA is currently in the process of preparing an Implementation Plan for the delivery of the strategy for the period 2017-2022.  I am aware that the NTA is working closely with South Dublin County Council in the preparation of the transport proposals to be included in the draft planning scheme for the Strategic Development Zone referred to by the Deputy.  Noting the NTA's responsibility in the matter, I have referred your question to the NTA for a more detailed reply. Please advise my private office if you do not receive a reply within 10 working days.   The referred reply under Standing Order 42A was forwarded to the Deputy.  "
      },
      "contextDate": "2017-03-21"
    },
    {
      "question": {
        "date": "2017-03-21",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/dbsect_1049",
          "showAs": "Sports Facilities Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2017-03-21/writtens/mul@/dbsect_1049.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_1049"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Kevin-Boxer-Moran.D.2016-10-03",
          "memberCode": "Kevin-Boxer-Moran.D.2016-10-03",
          "showAs": "Kevin Boxer Moran"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "showAs": "32nd Dáil",
          "chamberType": "house",
          "houseNo": "32"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Transport",
          "roleType": null
        },
        "showAs": " 1184. Deputy Kevin Boxer Moran asked the Minister for Transport, Tourism and Sport if his attention has been drawn to calls for a nationwide audit of sports facilities and the benefits of providing same in terms of more efficient use of resources and targeting of facilities in areas of real demand; if his attention has been further drawn to the fact that some local authorities have already made efforts to obtain such information in their own areas; if such information could be obtained and made publicly available in the near future; and if he will make a statement on the matter. [13019/17] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2017-03-21/pq_1184",
        "questionNumber": 1184,
        "answerText": " Minister of State at the Department of Transport, Tourism and Sport  I am aware of views expressed regarding the need for, and benefits of, a nationwide audit of sports facilities as this issue, along with the need for a more efficient use of resources and facility allocation generally, was raised in a number of submissions received during the National Sports Policy Consultation Process, which was launched in November last. Over 50 submissions have been received during this consultation process, including a number from the Local Sports Partnership Network. My officials are currently examining all of these submissions. It is expected that the new National Sports Policy Framework will be published in mid-2017. The matter of a nationwide audit of sports facilities is being considered in that context. I should also highlight the 'Get Ireland Active' database operated by the HSE and available online, which contains important and useful information on places to get active around Ireland, including sports facilities. "
      },
      "contextDate": "2017-03-21"
    }
  ]
}