{
  "head": {
    "counts": {
      "questionCount": 3561,
      "resultCount": 3561
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 195 and 198 together.  The credit union sector is an important supporter of housing delivery through the provision of mortgages directly to members, and investment in social housing via the Credit Union Approved Housing Body (AHB) Fund, known as the Credit Union AHB Fund.  Investment in the Credit Union AHB Fund is permitted under Central Bank regulations, introduced in March 2018. Under these regulations, over €1 billion can be invested by credit unions in the Credit Union AHB Fund.  The Credit Union AHB Fund is a fund that all credit unions can invest their members savings in. The Credit Union AHB Fund will then provide loan financing to AHBs in respect of completed social housing units.  The Minister of State has engaged with the Credit Union AHB Fund and credit union sector stakeholders to discuss the levels of investment in the fund.  I am informed that credit unions have invested €43 million in the fund as at 30 November 2025. The Credit Union AHB Fund has/will finance 175 homes in the following counties; Dublin, Cork, Wicklow and Galway.  It is important to note that both I and the Minister of State recognise that the decision to invest in the CU AHB Fund is a commercial matter for each independent credit union and their respective boards. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 198. Deputy Seán Ó Fearghaíl asked the Tánaiste and Minister for Finance the role credit unions play in supporting the delivery of social housing through the Credit Union Approved Housing Body Fund; and if he will make a statement on the matter. [72868/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_209",
          "debateSectionId": "dbsect_209",
          "showAs": "Credit Unions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_209.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_198",
        "questionNumber": 198
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 216, 348, 353 and 356 together.  The November Exchequer returns showed that, at a headline level, our public finances are in reasonably good shape.  Of course, tax revenues last year were heavily distorted by the once-off proceeds arising from the Court of Justice of the European Union decision, so for clarity I will exclude those receipts from the figures.  Tax revenues of €19.9 billion were collected in the month. That is up by €3½ billion or over 20 per cent on last year.  For the year to date, receipts amounted to €97 billion, up on last year by €7.3 billion, or a little over 8 per cent. Growth has been strong across almost all revenue streams, but particularly in the largest tax heads: income tax, VAT and corporation tax.  Income tax receipts to end-November stood at €33.7 billion, up by €1½ billion or just over 4½ per cent. This is a reflection of the continued resilience in our labour market.  November was the final VAT-due month of the year, with receipts standing at €22½ billion, which is €1.1 billion, or 5 per cent, up on last year – another demonstration of the fundamental strength of our economy.  The total amount of corporation tax received in November amounted to €10 billion. To put this in context, that is around the same amount we received in an entire year in 2018, just seven years ago. For the year to date, receipts stand at €29.4 billion, up by €3.8 billion or just under 15 per cent.  In Budget 2026 my Department projected a headline Exchequer tax revenue yield of €106.3 billion this year, rising to €109.2 billion next year. This was consistent with a projected Exchequer balance on Budget Day of just shy of €1 billion this year, and a deficit of €1.8 billion next year.  The Government Expenditure Ceiling has since been raised for 2025: all else equal this would result in a lower Exchequer position than set out on Budget Day. Nonetheless the General Government position, which is a more comprehensive metric, is expected to remain in surplus in both 2025 and 2026.  Taken as a whole, the tax performance to end-November was very much in line with expectations and consistent with the revised Budget 2026 revenue projections, suggesting we remain on track to reach around €106 billion in tax receipts this year. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 216. Deputy Seán Ó Fearghaíl asked the Tánaiste and Minister for Finance if he will report on corporation tax receipts, to date in 2025; and if he will make a statement on the matter. [69656/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_229",
          "debateSectionId": "dbsect_229",
          "showAs": "Tax Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_229.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_216",
        "questionNumber": 216
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  2025 has been a year marked by global economic uncertainty and a rapidly evolving international trading landscape. As a small open economy, Ireland is vulnerable to these external developments. My Department, together with Team Ireland colleagues across Government, have taken a number of initiatives to support Ireland’s trading position over the course of 2025, which will continue into 2026.  In February, the Government Trade Forum, which I chair, was established to facilitate engagement with key stakeholders on trade issues, including across Government, business organisations, trade unions and other representative groups. Discussions at the trade forum have helped shape the national, multifaceted response to the trade challenges facing the country and the business sector. The Forum was convened nine times in 2025. A work plan for 2026 is under preparation.  A consistent message from the Forum was the need for a strategic approach to support businesses' market diversification ambitions. In August, my Department and the Department of Enterprise, Tourism and Employment published the Government Action Plan on Market Diversification. The objective of the Action Plan is - through concerted action by the Government Departments and State Agencies - to support Irish businesses in core markets and exploring new partnerships in high-growth regions. There are over 100 actions in that Plan, implementation of which will continue in 2026.  Priority actions for my Department in 2026, working closely with other Government Departments and State Agencies include the review of Ireland’s trade & investment strategy, ensuring there is a strong economic focus in Global Ireland 2040 and a related strategies, and mapping Ireland's global economic footprint.  My Department will also support an ambitious programme of global engagement in support of Ireland's trade, tourism and investment objectives, including a programme of trade and tourism missions, a Taoiseach-led Team Ireland Trade Mission Week, and an ambitious St Patrick’s Day Programme for 2026. We will also continue to enhance our approach to strategic economic initiatives and partnerships building on the strong track record of delivery in 2025 on initiatives such as Ireland House at SXSW, the inaugural Ireland - Ukraine, Economic Forum, Ireland's new Joint Economic Commission with the UAE, the first Ireland - France Economic Forum held in Ireland and the Africa Ireland Trade Horizons conference.  The new global trading context brings into focus the imperative for Ireland and the EU to diversify our markets with reliable global partners. That is why Ireland will continue to support the European Commission to secure new trade and investment opportunities. We will also continue to build upon the EU-US Joint Statement towards a new mutually beneficial transatlantic trade and investment relationship in 2026. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 265. Deputy Seán Ó Fearghaíl asked the Minister for Foreign Affairs and Trade the main initiatives taken to support Ireland’s trading position during 2025; her priorities for 2026; and if she will make a statement on the matter. [73558/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_273",
          "debateSectionId": "dbsect_273",
          "showAs": "Trade Promotion",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_273.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_265",
        "questionNumber": 265
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  Ireland will hold the Presidency of the Council of the European Union for the eighth time from 1 July to 31 December 2026. This will be an important opportunity for Ireland to lead and shape the European agenda, and the Government has made a firm commitment to resource and deliver a successful Presidency in 2026.  Preparations are well underway, led by my Department, in close coordination with the Department of the Taoiseach, and with the active participation of all Departments across Government.  The priorities and policy programme for our EU Presidency are currently being developed, and will take into account the EU’s Strategic Agenda for 2024-29 and the legislative work programme of the European Commission, as well as the evolution of the Council's agenda over the coming months. They will also be shaped by our own priorities across an array of areas, including but far from limited to the protection of EU values at home and abroad, the enlargement of the Union, European security, and the competitiveness and simplification agenda, which covers a wide range of areas including housing and the delivery of infrastructure.  The Government recognises the importance of ensuring that stakeholder groups also have their voices heard as we prepare our Presidency priorities. A series of consultation meetings with stakeholders from across business, civil society, trade unions and other interest groups has recently taken place. A call for written submissions on the development of Ireland’s policy priorities, hosted on gov.ie, closed on 12 December, with over 450 submissions received. This process will allow consideration to be given to a broad range of different policy issues, from diverse voices throughout Ireland, as our Presidency policy programme is developed.  The Government is also consulting with other EU Member States and stepping up engagement with the EU institutions as the process of programme development continues.  Our policy programme will be finalised and published in June 2026, shortly before the start of our Presidency term.  Work is also underway to prepare for more than 250 meetings to be hosted in Ireland during the Presidency. These will include a summit of the European Political Community, an informal meeting of the European Council, and up to 22 informal Ministerial meetings.  My Department and the Department of the Taoiseach are taking forward preparatory work, in coordination with other relevant Departments and agencies, on the practical arrangements for all summits and meetings that may be held in Ireland during our Presidency term. These will be further developed, both in logistical and policy terms, in the coming period, including following consultations in due course with European partners. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 266. Deputy Seán Ó Fearghaíl asked the Minister for Foreign Affairs and Trade for a report on preparations for Ireland’s preparations for the Presidency of the European Council in 2026; her priorities for the first half of 2026; and if she will make a statement on the matter. [73559/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_274",
          "debateSectionId": "dbsect_274",
          "showAs": "EU Presidency",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_274.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_266",
        "questionNumber": 266
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  In the context of the more challenging and uncertain international environment, it has never been more important for Ireland to sustain a constructive and ambitious engagement in European and international affairs. The Programme for Government commits to further strengthening Ireland’s place in the world, building on the significant investment in Ireland's global footprint under Global Ireland 2025, and to develop a new Global Ireland 2040 strategy, work on which will begin early next year.  This was the final year of the Global Ireland 2025 strategy and there was significant delivery throughout the year, which served to enhanced Ireland's diplomacy capacity and impact.  The State expanded its mission network by opening three Embassies in Belgrade, Chișinău and Sarajevo. There was significant preparatory work undertaken to open new Consulates General in Malaga and Melbourne and these will become operational in early 2026. We also continued the reinforcement of staff in key locations, not least in Brussels as part of our preparations for our presidency of the European Council in the second semester of 2026.  In August, the Government launched the new Action Plan on Market Diversification, with over 100 actions across Government Departments and State Agencies, with the ultimate objective of supporting businesses to achieve their market diversification ambitions. The actions in this plan will be a core element of our programming around St Patrick’s Day in 2026.  Ireland participated in the G20 this year as a guest country of South Africa’s Presidency. Our participation has been a strong example of our global engagement in action. The Ministerial-level participation, across 18 ministerial meetings as well as the Taoiseach's attendance at the Leaders' Summit, also resulted in significant opportunities for wider bilateral engagements in South Africa.  The Government published the new International Sports Diplomacy Framework in May with the purpose of setting out a vision for Ireland’s approach to international sports diplomacy. A new International Sports Diplomacy Strategy is under development, which will identify time-bound actions to deliver on the commitments of the Framework.  The Ireland-Japan 2025 programme brought new momentum our relations with Japan with the Taoiseach and seven other Ministers visiting Japan, the opening of Ireland House in Tokyo, and Ireland’s successful participation in Expo 2025 in Osaka. Expo attracted over 29 million visitors. Ireland’s Pavilion left a lasting impact and proved immensely popular, operating at maximum capacity on a daily basis.  An important aspect of Global Ireland is the more strategic focus on communicating Ireland to the world. In 2025, we launched the St. Patrick’s Day video campaign, which focused on the theme of “change-makers” within our global diaspora. There was a record 170 million global impressions for our ‘Bloomsday and Beyond’ video campaign. There was extensive communications support for Ireland-Japan 2025, Ireland at the UN and Ireland's participation at the G20. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 267. Deputy Seán Ó Fearghaíl asked the Minister for Foreign Affairs and Trade for a report on how Ireland has enhanced its diplomatic capacity in 2025; her priorities for 2026; and if she will make a statement on the matter. [73560/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_275",
          "debateSectionId": "dbsect_275",
          "showAs": "Diplomatic Representation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_275.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_267",
        "questionNumber": 267
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the operation and management of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals.  In 2025, a number of major new national road projects continued to progress. Construction continued on the N5 Ballaghaderreen to Scramoge, and main construction contracts were signed for the M28 Cork to Ringaskiddy and Adare Bypass projects. Together with the progression of projects at an earlier stage of the development lifecycle, and measures to safeguard the existing national road network, this demonstrates the commitment of Government to ensuring the network can continue to meet the needs of all road users.  Noting the above position, I have referred your question to TII for a detailed reply detailing measures taken in 2025. Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 322. Deputy Seán Ó Fearghaíl asked the Minister for Transport the key measures taken to increase national road capacity during 2025; his priorities for 2026; and if he will make a statement on the matter. [73570/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_326",
          "debateSectionId": "dbsect_326",
          "showAs": "Road Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_326.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_322",
        "questionNumber": 322
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Transport  The improvement and maintenance of regional and local roads is the statutory responsibility of each local authority, in accordance with the provisions of Section 13 of the Roads Act 1993. Works on those roads are funded from Councils' own resources supplemented by State road grants. The initial selection and prioritisation of works to be funded is a matter for the local authority.  As outlined in the 2025 Regional and Local Roads Grant Programme which I announced on the 14th of February this year, the Government is strongly committed to protecting the existing regional and local road network. This network is fundamental in maintaining social and economic connectivity, linking people and places across the country.  Irelands regional and local road network spans over 96,000kms. The network requires significant funding to ensure it remains fit for purpose, safe and resilient. As such, €713 million was allocated to regional and local road grants in 2025, with approximately 90% of this funding being directed towards maintenance and renewal works. This represents an overall increase of over 8% in funding this year.  This funding has supported local authorities in carrying out an extensive 2025 programme of maintenance and restoration works. Funding also supported various safety improvement works, bridge rehabilitation schemes, drainage works, climate adaptation measures, community involvement projects and the maintenance of former national roads.  In addition to maintenance, targeted improvements are a priority. In 2025, €47.8 million was allocated to investing in developing and upgrading this infrastructure through vital Strategic Grant projects which are continuing to be progressed. These include projects identified for development under the National Development Plan such as the Tralee Northern Relief Road and the Coonagh to Knockalisheen Distributor Road.  An additional €22.2 million was allocated for smaller-scale road improvements under the Specific Grant category.  As regards 2026, regional and local road grant allocations will be finalised following the publication of the Revised Estimates Volume and will take into account the expenditure outturn on projects and programmes in the preceding year. The main focus of the grants continues to be the protection and renewal of the regional and local road network. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 323. Deputy Seán Ó Fearghaíl asked the Minister for Transport the key measures taken to support the local and regional road network during 2025; his priorities for 2026; and if he will make a statement on the matter. [73571/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_327",
          "debateSectionId": "dbsect_327",
          "showAs": "Road Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_327.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_323",
        "questionNumber": 323
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to Active Travel. Funding is administered through the National Transport Authority (NTA), who, in partnership with local authorities, have responsibility for the selection and development of specific projects in each local authority area.  The Government is committed to the provision of improved and expanded walking and cycling infrastructure both in our urban centres and in towns and villages across Ireland. In 2021, the Active Travel Infrastructure Programme was expanded to include the 19 local authority areas outside the Greater Dublin Area (GDA) and the regional cities. Since then, over €1 billion has been invested in walking and cycling projects across the country.  €290 million was allocated to the NTA's Active Travel and Sustainable Transport Investment Programme alone in 2025 with actual spend reaching over €296 million invested in around 1,000 projects nationwide. Key projects completed this year include two phases of the Royal Canal Greenway, the Bray DART Interchange, the Battery Road Active Travel Scheme in Longford and the Marina Promenade and Mahon Active Travel scheme in Cork. In addition, the funding supported numerous junction upgrades and the installation of new pedestrian crossings, all of which improve pedestrian and cyclists safety.  I was delighted to secure a similar funding for Active Travel in Budget 2026, meaning that we can continue to progress walking and cycling projects around Ireland into next year. Projects due to be completed in 2026 include the Glanmire Urban Greenway in Cork, the Kilmacrennan Road Active Travel Scheme in Donegal and the Ballybane and Castlepark Cycle Network in Galway City. Work is expected to start on a number of key Active Travel schemes next year such as the Finglas Village Improvement Scheme, Living Streets Phase 2 in Dun Laoghaire and Sarsfield Road to MTU in Cork.  As part of the allocations determination, the NTA liaises with each local authority to fully understand the projects being proposed by the local authority and its considerations in terms of priorities. In general, the main focus of active travel investment will be to support high quality walking and cycling infrastructure, for everyday trips, in villages, towns and cities, particularly in designated growth settlements, with a view to promoting the greatest potential modal shift to active travel.  Given the ramping up of activities over the last few years in the Active Travel area, the number of projects being progressed now exceeds the level of funding made available to the NTA. Accordingly, the NTA is unable to fully fund all proposed Active Travel projects and has to prioritise certain projects over others in order to remain within its allocated budget. While a project may not be selected by the NTA for funding in a particular year, it may be funded in subsequent years. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 324. Deputy Seán Ó Fearghaíl asked the Minister for Transport the key measures taken to develop active travel during 2025; his priorities for 2026; and if he will make a statement on the matter. [73572/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_328",
          "debateSectionId": "dbsect_328",
          "showAs": "Active Travel",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_328.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_324",
        "questionNumber": 324
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 325, 326 and 328 together.  My Department is responsible for implementing a wide range of commitments in the Programme for Government: Securing Our Future and plays a crucial role in supporting other cross-government commitments. We continue to make steady progress in our ambitious infrastructure and service delivery plans. I wish to reassure the Deputy that improving the accessibility, reliability, and affordability of public transport, while ensuring the system remains well-funded and responsive to passenger needs, is a core priority under the Programme for Government.  The National Transport Authority (NTA) plays a central role in achieving this, as they have statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators.  As Minister for Transport, my Department sets the overall policy direction and funding framework for the delivery of public transport services nationwide. The 2026 PSO funding allocation of c. €940 million represents a significant 43% uplift in the allocation from 2025. This reflects the Government’s commitment to ensuring that public transport services can continue to operate reliably and sustainably in the face of growing passenger demand and increased operational costs.  This allocation will also allow for the continued delivery of targeted fare initiatives, this year I introduced free travel for all children up to the age of 9 and continued the Young Adult Card for those aged 19–25, as part of the NTA’s National Fares Strategy. These measures, which will be continued in 2026, help ensure that public transport remains accessible and affordable for families, students, and young workers across the country.  €31 million has been secured for rural transport in 2026 – a 38% increase on last year’s funding. This ensures the continued delivery of vital services across rural Ireland, to meet demand in communities that depend on these services most.  In parallel, investment has continued to support the rollout of planned improvements within the existing network, such as the recently launched F Spine under Phase 7 of BusConnects. This phase introduces high-frequency, 24-hour bus services on key corridors, including routes F1, F2, and F3, enhancing connectivity between areas such as Tallaght, Finglas, Charlestown, and the city centre. The redesign also includes new radial and local routes to streamline and make the network more efficient.  Regarding bus infrastructure, construction on the Liffey Valley to City Centre Core Bus Corridor scheme will commence this month with a view to full completion by 2028. In addition, following the approval of the Ballymun/Finglas to City Centre Core Bus Corridor scheme at Approval Gate 3 under the Infrastructure Guidelines in November and the signing of the construction contract in December, construction is expected to commence in 2026.  Regarding rail, in April, a new ‘through’ platform at Kent station in Cork opened, which was a key landmark in the delivery of the Cork Commuter Rail Project. The public consultation on Phase 2 of the Programme launched in June, including proposals for eight new stations, a new fleet maintenance depot and full electrification of the network to support more frequent, reliable and sustainable rail transport for Cork. A public consultation for the emerging preferred route for Luas Cork was launched on 14th April. The newest DART station, Woodbrook, opened in August.  The All-Island Strategic Rail Review was undertaken in co-operation with the Department for Infrastructure in Northern Ireland. Following two public consultations, the Review’s Final Report was published in July 2024. The Review's Final Report sets out 32 strategic recommendations to enhance and expand the rail system in Ireland and Northern Ireland up to 2050, aligning with net carbon zero commitments in both jurisdictions.  Assisted by the European Investment Bank (EIB) Advisory Services, the Department of Transport and Department for Infrastructure, and agencies across the island, are working to progress the Report’s recommendations in the years ahead. As part of this work, a Project Prioritisation Strategy was developed and published on 15 December.  The Strategy outlines how to best sequence and optimise the recommendations of the All-Island Strategic Rail Review, and specifies short-term rail infrastructure investments, referred to as Early Interventions, to be delivered in the coming years. These include a series of new track passing loops and platforms to boost the rail network’s resilience and capacity. Work on these projects in Ireland will start next year, for full delivery by 2030 with funding provided in the National Development Plan (NDP) Sectoral Investment Plan for Transport, which was published by the Department of Transport in November.  The Strategy also identifies Major Projects to be progressed for the longer-run, involving intercity electrification and significant capacity upgrades on the rail network. These Major Projects include “FourNorth”, to add track capacity on the busy Northern line north of Connolly station; electrification and line speed improvements on the Dublin-Cork and Dublin-Belfast routes, and reinstatement of lines including the Western Rail Corridor between Claremorris to Athenry. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 325. Deputy Seán Ó Fearghaíl asked the Minister for Transport the key measures taken to support and develop bus services during 2025; his priorities for 2026; and if he will make a statement on the matter. [73573/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_329",
          "debateSectionId": "dbsect_329",
          "showAs": "Bus Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_329.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_325",
        "questionNumber": 325
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 325, 326 and 328 together.  My Department is responsible for implementing a wide range of commitments in the Programme for Government: Securing Our Future and plays a crucial role in supporting other cross-government commitments. We continue to make steady progress in our ambitious infrastructure and service delivery plans. I wish to reassure the Deputy that improving the accessibility, reliability, and affordability of public transport, while ensuring the system remains well-funded and responsive to passenger needs, is a core priority under the Programme for Government.  The National Transport Authority (NTA) plays a central role in achieving this, as they have statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators.  As Minister for Transport, my Department sets the overall policy direction and funding framework for the delivery of public transport services nationwide. The 2026 PSO funding allocation of c. €940 million represents a significant 43% uplift in the allocation from 2025. This reflects the Government’s commitment to ensuring that public transport services can continue to operate reliably and sustainably in the face of growing passenger demand and increased operational costs.  This allocation will also allow for the continued delivery of targeted fare initiatives, this year I introduced free travel for all children up to the age of 9 and continued the Young Adult Card for those aged 19–25, as part of the NTA’s National Fares Strategy. These measures, which will be continued in 2026, help ensure that public transport remains accessible and affordable for families, students, and young workers across the country.  €31 million has been secured for rural transport in 2026 – a 38% increase on last year’s funding. This ensures the continued delivery of vital services across rural Ireland, to meet demand in communities that depend on these services most.  In parallel, investment has continued to support the rollout of planned improvements within the existing network, such as the recently launched F Spine under Phase 7 of BusConnects. This phase introduces high-frequency, 24-hour bus services on key corridors, including routes F1, F2, and F3, enhancing connectivity between areas such as Tallaght, Finglas, Charlestown, and the city centre. The redesign also includes new radial and local routes to streamline and make the network more efficient.  Regarding bus infrastructure, construction on the Liffey Valley to City Centre Core Bus Corridor scheme will commence this month with a view to full completion by 2028. In addition, following the approval of the Ballymun/Finglas to City Centre Core Bus Corridor scheme at Approval Gate 3 under the Infrastructure Guidelines in November and the signing of the construction contract in December, construction is expected to commence in 2026.  Regarding rail, in April, a new ‘through’ platform at Kent station in Cork opened, which was a key landmark in the delivery of the Cork Commuter Rail Project. The public consultation on Phase 2 of the Programme launched in June, including proposals for eight new stations, a new fleet maintenance depot and full electrification of the network to support more frequent, reliable and sustainable rail transport for Cork. A public consultation for the emerging preferred route for Luas Cork was launched on 14th April. The newest DART station, Woodbrook, opened in August.  The All-Island Strategic Rail Review was undertaken in co-operation with the Department for Infrastructure in Northern Ireland. Following two public consultations, the Review’s Final Report was published in July 2024. The Review's Final Report sets out 32 strategic recommendations to enhance and expand the rail system in Ireland and Northern Ireland up to 2050, aligning with net carbon zero commitments in both jurisdictions.  Assisted by the European Investment Bank (EIB) Advisory Services, the Department of Transport and Department for Infrastructure, and agencies across the island, are working to progress the Report’s recommendations in the years ahead. As part of this work, a Project Prioritisation Strategy was developed and published on 15 December.  The Strategy outlines how to best sequence and optimise the recommendations of the All-Island Strategic Rail Review, and specifies short-term rail infrastructure investments, referred to as Early Interventions, to be delivered in the coming years. These include a series of new track passing loops and platforms to boost the rail network’s resilience and capacity. Work on these projects in Ireland will start next year, for full delivery by 2030 with funding provided in the National Development Plan (NDP) Sectoral Investment Plan for Transport, which was published by the Department of Transport in November.  The Strategy also identifies Major Projects to be progressed for the longer-run, involving intercity electrification and significant capacity upgrades on the rail network. These Major Projects include “FourNorth”, to add track capacity on the busy Northern line north of Connolly station; electrification and line speed improvements on the Dublin-Cork and Dublin-Belfast routes, and reinstatement of lines including the Western Rail Corridor between Claremorris to Athenry. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 326. Deputy Seán Ó Fearghaíl asked the Minister for Transport the key measures taken to support and develop rail services during 2025; his priorities for 2026; and if he will make a statement on the matter. [73574/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_329",
          "debateSectionId": "dbsect_329",
          "showAs": "Bus Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_329.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_326",
        "questionNumber": 326
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Transport  The Government recognises the crucial role of international air connectivity and is committed to fostering an environment that supports the aviation sector's development. The Programme for Government (PfG) acknowledges that as an island nation with a dispersed population and an open economy, good connectivity within the country and with the rest of the world is essential to foster continued economic growth, for communities, and our tourism industry.  The 2015 National Aviation Policy (NAP) established a policy framework for the development of the aviation sector in Ireland. While the principal goals of the 2015 NAP remain valid, and it continues to guide decision-making, the Department of Transport has commenced preparatory work on revising the NAP, with a view to progressing same in 2026. The revised NAP will update existing policy in response to developments in the aviation sector since 2015 and will include a focus on maximising use of our regional airports, in line with commitments made in the Programme for Government (PfG).  The NAP recognises the role of regional airports in supporting connectivity and regional development and commits to encouraging airports to attract new business, to achieve excellence in the delivery of service and value for passengers and airlines, and to make a sustainable contribution to their respective local economies and communities. Government recognises that as employers, airports contribute to the local economy, employment is also supported through the various ancillary services that are provided to airports.  In line with this, Government has provided significant supports to regional airports under the Regional Airports Programme 2021-2025, with €17million in combined current and capital supports made available in 2025. Funding under this Programme is targeted at safety and security related activities and operations. Projects with a sustainability focus are also supported, encouraging airports meet their carbon emission reduction targets and build resilience against the likely impacts of climate change. A Public Service Obligation (PSO) air service between Donegal and Dublin airports is also supported under this Programme.  While the current Regional Airports Programme will expire at the end of 2025, the PfG commits to continue to invest in the Regional Airports Programme and to develop a new Regional Airports Programme 2026-2030. This work is progressing as a matter of priority, with a view to the new Programme being in place early in the new year. A further €17million in combined current and capital supports will support continued investment in regional airports under this new Programme in 2026.  In addition, the PfG includes a commitment to engage with relevant stakeholders to establish air connectivity between Dublin and City of Derry airports. As part of the objectives of Building a Shared Island, my Department is progressing the preparatory work necessary to establish a Dublin-Derry PSO air service in 2026. Stakeholder engagement is also vital and in this regard a market sounding exercise is being finalised by my Department for publication shortly. I look forward to the delivery of this new service, which will provide subsidised transport connectivity for Derry and North East Donegal and complement the Donegal-Dublin PSO air service which serves the West Donegal region.  The Government is in favour of increasing the capacity of Dublin Airport, in line with the NAP, which recognises the strategic importance of Dublin Airport to meeting national social and economic policy goals. The PfG includes a clear commitment to working with stakeholders to achieve the objective of lifting the passenger cap at Dublin Airport as soon as possible. In this regard, I secured support from my colleagues in Cabinet to pursue a legislative course of action to address the passenger cap in line with that commitment. Work has commenced on the preparation of legislation to address this, and I intend to bring Heads of a Bill to Cabinet shortly to seek agreement on the proposed legislative approach and to progress to formal drafting.  I am committed to introducing the legislation as soon as possible to ensure that it can be prioritised both in terms of drafting and then in terms of its passage through the Oireachtas, to ensure continued sustainable growth in connectivity for the benefit of our economy.  Continuing with the theme of sustainability, 2025 saw the publication of Ireland’s first Sustainable Aviation Fuel (SAF) Policy Roadmap, fulfilling a clear commitment in the PfG. The Roadmap represents an important first step in developing Ireland’s national SAF policy, identifying a number of actions which will be built upon in future iterations, and setting a path for future SAF policy development.  A significant milestone was the publication in August 2025 of our National Policy Framework for Unmanned Aircraft Systems, or UAS, commonly referred to as drones. The Policy Framework focusses on focus on i) the use of the airspace and planning, ii) compliance and enforcement, and iii) enterprise and innovation.  While the operation of any scheduled air service is a commercial decision for airlines, it is the responsibility of my Department to ensure that the appropriate frameworks are in place to facilitate such operations. Work has advanced in 2025 at official level with a number of third country partners towards the development of new bilateral air service agreements which will provide the framework to underpin the operation of air services to/from these third countries. In 2026, I expect a number of these international agreements to be brought to Government for consideration, while in other cases, negotiations will continue at a technical level.  In terms of EU policy, a revision of EU Regulation 261 of 2004 on the rights of air passengers in the event of denied boarding, cancellation and long delay of flights was progressed significantly in 2025. A \"general approach\" text of a revised regulation was agreed by EU Transport Ministers at a Transport Council meeting in June 2025. The text is now undergoing trilogue negotiations with the European Parliament, with the aim of reaching a final compromise. Ireland is supportive of the Council-approved text, which strengthens passengers’ rights while also keeping the industry competitive and innovative.  Ireland will assume the Presidency of the Council of the European Union on 1 July 2026 and my Department is engaged in the whole-of-government effort to deliver a successful Irish Presidency. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 327. Deputy Seán Ó Fearghaíl asked the Minister for Transport the key measures taken to support and develop aviation services during 2025; his priorities for 2026; and if he will make a statement on the matter. [73575/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_330",
          "debateSectionId": "dbsect_330",
          "showAs": "Air Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_330.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_327",
        "questionNumber": 327
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 325, 326 and 328 together.  My Department is responsible for implementing a wide range of commitments in the Programme for Government: Securing Our Future and plays a crucial role in supporting other cross-government commitments. We continue to make steady progress in our ambitious infrastructure and service delivery plans. I wish to reassure the Deputy that improving the accessibility, reliability, and affordability of public transport, while ensuring the system remains well-funded and responsive to passenger needs, is a core priority under the Programme for Government.  The National Transport Authority (NTA) plays a central role in achieving this, as they have statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators.  As Minister for Transport, my Department sets the overall policy direction and funding framework for the delivery of public transport services nationwide. The 2026 PSO funding allocation of c. €940 million represents a significant 43% uplift in the allocation from 2025. This reflects the Government’s commitment to ensuring that public transport services can continue to operate reliably and sustainably in the face of growing passenger demand and increased operational costs.  This allocation will also allow for the continued delivery of targeted fare initiatives, this year I introduced free travel for all children up to the age of 9 and continued the Young Adult Card for those aged 19–25, as part of the NTA’s National Fares Strategy. These measures, which will be continued in 2026, help ensure that public transport remains accessible and affordable for families, students, and young workers across the country.  €31 million has been secured for rural transport in 2026 – a 38% increase on last year’s funding. This ensures the continued delivery of vital services across rural Ireland, to meet demand in communities that depend on these services most.  In parallel, investment has continued to support the rollout of planned improvements within the existing network, such as the recently launched F Spine under Phase 7 of BusConnects. This phase introduces high-frequency, 24-hour bus services on key corridors, including routes F1, F2, and F3, enhancing connectivity between areas such as Tallaght, Finglas, Charlestown, and the city centre. The redesign also includes new radial and local routes to streamline and make the network more efficient.  Regarding bus infrastructure, construction on the Liffey Valley to City Centre Core Bus Corridor scheme will commence this month with a view to full completion by 2028. In addition, following the approval of the Ballymun/Finglas to City Centre Core Bus Corridor scheme at Approval Gate 3 under the Infrastructure Guidelines in November and the signing of the construction contract in December, construction is expected to commence in 2026.  Regarding rail, in April, a new ‘through’ platform at Kent station in Cork opened, which was a key landmark in the delivery of the Cork Commuter Rail Project. The public consultation on Phase 2 of the Programme launched in June, including proposals for eight new stations, a new fleet maintenance depot and full electrification of the network to support more frequent, reliable and sustainable rail transport for Cork. A public consultation for the emerging preferred route for Luas Cork was launched on 14th April. The newest DART station, Woodbrook, opened in August.  The All-Island Strategic Rail Review was undertaken in co-operation with the Department for Infrastructure in Northern Ireland. Following two public consultations, the Review’s Final Report was published in July 2024. The Review's Final Report sets out 32 strategic recommendations to enhance and expand the rail system in Ireland and Northern Ireland up to 2050, aligning with net carbon zero commitments in both jurisdictions.  Assisted by the European Investment Bank (EIB) Advisory Services, the Department of Transport and Department for Infrastructure, and agencies across the island, are working to progress the Report’s recommendations in the years ahead. As part of this work, a Project Prioritisation Strategy was developed and published on 15 December.  The Strategy outlines how to best sequence and optimise the recommendations of the All-Island Strategic Rail Review, and specifies short-term rail infrastructure investments, referred to as Early Interventions, to be delivered in the coming years. These include a series of new track passing loops and platforms to boost the rail network’s resilience and capacity. Work on these projects in Ireland will start next year, for full delivery by 2030 with funding provided in the National Development Plan (NDP) Sectoral Investment Plan for Transport, which was published by the Department of Transport in November.  The Strategy also identifies Major Projects to be progressed for the longer-run, involving intercity electrification and significant capacity upgrades on the rail network. These Major Projects include “FourNorth”, to add track capacity on the busy Northern line north of Connolly station; electrification and line speed improvements on the Dublin-Cork and Dublin-Belfast routes, and reinstatement of lines including the Western Rail Corridor between Claremorris to Athenry. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 328. Deputy Seán Ó Fearghaíl asked the Minister for Transport the key measures taken to support affordability in public transport during 2025; his priorities for 2026; and if he will make a statement on the matter. [73576/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_329",
          "debateSectionId": "dbsect_329",
          "showAs": "Bus Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_329.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_328",
        "questionNumber": 328
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 216, 348, 353 and 356 together.  The November Exchequer returns showed that, at a headline level, our public finances are in reasonably good shape.  Of course, tax revenues last year were heavily distorted by the once-off proceeds arising from the Court of Justice of the European Union decision, so for clarity I will exclude those receipts from the figures.  Tax revenues of €19.9 billion were collected in the month. That is up by €3½ billion or over 20 per cent on last year.  For the year to date, receipts amounted to €97 billion, up on last year by €7.3 billion, or a little over 8 per cent. Growth has been strong across almost all revenue streams, but particularly in the largest tax heads: income tax, VAT and corporation tax.  Income tax receipts to end-November stood at €33.7 billion, up by €1½ billion or just over 4½ per cent. This is a reflection of the continued resilience in our labour market.  November was the final VAT-due month of the year, with receipts standing at €22½ billion, which is €1.1 billion, or 5 per cent, up on last year – another demonstration of the fundamental strength of our economy.  The total amount of corporation tax received in November amounted to €10 billion. To put this in context, that is around the same amount we received in an entire year in 2018, just seven years ago. For the year to date, receipts stand at €29.4 billion, up by €3.8 billion or just under 15 per cent.  In Budget 2026 my Department projected a headline Exchequer tax revenue yield of €106.3 billion this year, rising to €109.2 billion next year. This was consistent with a projected Exchequer balance on Budget Day of just shy of €1 billion this year, and a deficit of €1.8 billion next year.  The Government Expenditure Ceiling has since been raised for 2025: all else equal this would result in a lower Exchequer position than set out on Budget Day. Nonetheless the General Government position, which is a more comprehensive metric, is expected to remain in surplus in both 2025 and 2026.  Taken as a whole, the tax performance to end-November was very much in line with expectations and consistent with the revised Budget 2026 revenue projections, suggesting we remain on track to reach around €106 billion in tax receipts this year. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 356. Deputy Seán Ó Fearghaíl asked the Tánaiste and Minister for Finance if he will report on income tax receipts, to date in 2025; and if he will make a statement on the matter. [69655/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_229",
          "debateSectionId": "dbsect_229",
          "showAs": "Tax Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_229.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_356",
        "questionNumber": 356
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 368 and 369 together.  Despite trade, geopolitical and other headwinds, incoming data confirms that the Irish economy has continued to perform well in 2025. National Accounts data published by the CSO earlier this month show that in the first three quarters of the year Modified Domestic Demand – a proxy for domestic economic activity – grew by over 4 per cent on an annual basis. Over the same period, consumer spending grew by almost 3 per cent.  Employment reached a record high of over 2.82 million in the third quarter of 2025 with over 30,000 jobs created on an annual basis. However, the pace of growth has eased in recent quarters.  My Department expects growth in the Irish economy to remain relatively solid in 2026. Modified Domestic Demand is expected to grow by 2.3 per cent next year. Strong momentum in consumer spending is projected to continue into 2026 with annual growth of 2.3 per cent also forecast. Employment is projected to expand by 1.5 per cent next year with unemployment expected to remain relatively low and broadly consistent with 'full employment'.  Beyond 2026, the economy and labour market are expected to continue to record solid growth, albeit at a more moderate pace than in recent years.  My Department has worked to support and sustain economic activity through inter alia the introduction of measures announced in Budget 2026 . For businesses, these include the enhancement of the Research and Development Tax Credit and Capital Gains Tax Revised Entrepreneur Relief relief, as well as the reduction of the VAT rate to 9 per cent for the hospitality sector. Households will benefit from measures such as the extension of the reduced VAT rate for electricity and gas, with renters benefiting from the extension of the rent tax credit for a further three years.  Government continues to be in a position to support households and businesses because of the prudent management of the public finances. For 2025, we are on track to run a headline budget surplus and have continued to invest in the Future Ireland Fund and Infrastructure, Climate and Nature Fund . The total combined value of these funds will be approximately €17 billion by end-2025.  More generally, Government has been proactive in its response to the more challenging external environment. Indeed, the Government Action Plan on Market Diversification , the Action Plan on Competitiveness and Productivity , as well as the revised National Development Plan will help boost competitiveness and ensure the resilience of our economy over the coming years.  My overarching priority for next year is to continue to deliver on the commitments set out in the Programme for Government . In relation to the economy and public finances, it is essential that we continue to run headline budgetary surpluses, protect jobs, as well as invest ‘windfall’ tax receipts into our long-term savings funds to prepare for future structural costs. In addition, Ireland’s Presidency of the Council of the European Union in the second half of 2026 is a key priority for Government, which offers enormous opportunities for Ireland to show leadership on the European and global stages. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 368. Deputy Seán Ó Fearghaíl asked the Tánaiste and Minister for Finance the key measures his Department has taken to support and sustain the economy during 2025; his priorities for 2026; and if he will make a statement on the matter. [73577/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_364",
          "debateSectionId": "dbsect_364",
          "showAs": "Economic Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_364.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_368",
        "questionNumber": 368
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 368 and 369 together.  Despite trade, geopolitical and other headwinds, incoming data confirms that the Irish economy has continued to perform well in 2025. National Accounts data published by the CSO earlier this month show that in the first three quarters of the year Modified Domestic Demand – a proxy for domestic economic activity – grew by over 4 per cent on an annual basis. Over the same period, consumer spending grew by almost 3 per cent.  Employment reached a record high of over 2.82 million in the third quarter of 2025 with over 30,000 jobs created on an annual basis. However, the pace of growth has eased in recent quarters.  My Department expects growth in the Irish economy to remain relatively solid in 2026. Modified Domestic Demand is expected to grow by 2.3 per cent next year. Strong momentum in consumer spending is projected to continue into 2026 with annual growth of 2.3 per cent also forecast. Employment is projected to expand by 1.5 per cent next year with unemployment expected to remain relatively low and broadly consistent with 'full employment'.  Beyond 2026, the economy and labour market are expected to continue to record solid growth, albeit at a more moderate pace than in recent years.  My Department has worked to support and sustain economic activity through inter alia the introduction of measures announced in Budget 2026 . For businesses, these include the enhancement of the Research and Development Tax Credit and Capital Gains Tax Revised Entrepreneur Relief relief, as well as the reduction of the VAT rate to 9 per cent for the hospitality sector. Households will benefit from measures such as the extension of the reduced VAT rate for electricity and gas, with renters benefiting from the extension of the rent tax credit for a further three years.  Government continues to be in a position to support households and businesses because of the prudent management of the public finances. For 2025, we are on track to run a headline budget surplus and have continued to invest in the Future Ireland Fund and Infrastructure, Climate and Nature Fund . The total combined value of these funds will be approximately €17 billion by end-2025.  More generally, Government has been proactive in its response to the more challenging external environment. Indeed, the Government Action Plan on Market Diversification , the Action Plan on Competitiveness and Productivity , as well as the revised National Development Plan will help boost competitiveness and ensure the resilience of our economy over the coming years.  My overarching priority for next year is to continue to deliver on the commitments set out in the Programme for Government . In relation to the economy and public finances, it is essential that we continue to run headline budgetary surpluses, protect jobs, as well as invest ‘windfall’ tax receipts into our long-term savings funds to prepare for future structural costs. In addition, Ireland’s Presidency of the Council of the European Union in the second half of 2026 is a key priority for Government, which offers enormous opportunities for Ireland to show leadership on the European and global stages. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 369. Deputy Seán Ó Fearghaíl asked the Tánaiste and Minister for Finance his assessment of the performance of the economy during 2025; the outlook for 2026 and subsequent years; and if he will make a statement on the matter. [73578/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_364",
          "debateSectionId": "dbsect_364",
          "showAs": "Economic Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_364.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_369",
        "questionNumber": 369
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Maintaining Ireland’s tax competitiveness is a key objective particularly in the context of economic uncertainty globally and the evolving international tax reforms.  Budget 2026 and Finance Bill 2025 introduced a range of measures designed to support competitiveness, sustain Ireland’s attractiveness for foreign direct investment, support domestic businesses and promote innovation. Some relevant measures provided for in Finance Bill 2025 include:  • A number of enhancements to the R&D tax credit regime, including increase in the rate of the credit from 30 per cent to 35 per cent. The primary policy objective of the credit is to increase business R&D in Ireland, as R&D can contribute to higher innovation and productivity. I will also publish a Research and Development Compass in the coming weeks, setting out potential pathways for future development of the credit and for new a innovation support to be developed in 2026.  • The update and enhancement of the participation exemption for foreign dividends. The participation exemption provides an alternative, much simplified mechanism for double tax relief for multi-national businesses by reducing the complexity and administrative burden of the current system.  • Measures to strengthen the competitiveness of Ireland’s audiovisual sector. An enhanced rate of 40% has been introduced under the Section 481 Film Tax credit for qualifying VFX work. In addition, the Digital Games Tax credit has been extended for a period of 6 years and further enhanced to allow for claims in respect of expenditure incurred on the development of post release content.  • To support opportunities for growth in the funds industry, specifically in the private assets space, a discrete but important tax change in Finance Bill 2025 provided for a Dividend Withholding Tax exemption for Investment Limited Partnerships and equivalent EEA partnerships. This measure is intended to increase the attractiveness of the Investment Limited Partnership as a fund structure and to help cement Ireland’s position as a desirable location for regulated investment funds.  • An increase in the Revised Entrepreneur Relief lifetime limit from €1 million to €1.5 million for disposals made from the 1st of January 2026.  With regard to other ongoing work, my Department is also undertaking a review of the tax treatment of interest in Ireland, which seeks to deliver a simplified and competitive taxation regime for interest which is aligned with international best practice. The taxation of interest is complex and is governed by Irish and EU legislation, and the proposed reform is intended to help safeguard Ireland’s competitiveness by providing a sound and stable interest deduction basis for both domestic businesses and inward investment in Ireland. Following extensive consultation with stakeholders, an Action Plan for reform of Ireland’s taxation regime for interest was published as part of Budget 2026 which sets out a phased approach to progressing reforms. A Feedback Statement for phase one of reform was published on 21 November 2025 and further public consultation will be carried out over the course of the next year.  To support broader housing policy objectives and to address complexity in the Irish Real Estate Fund (IREF) regime, which may be acting as barrier to investment for international investors, it was announced as part of Budget 2026 that a public consultation on proposals to simplify the IREF regime, without limiting its effectiveness, will also be held in 2026.  At an EU level, simplification of EU tax law has been identified as a key enabler of enhancing EU competitiveness. In this regard, Ireland is actively engaging with the Commission and Member States ahead of the expected publication of legislative proposals in June 2026. The proposals will seek to simplify several of the EU’s corporate tax Directives, including the several iterations of the Directive on Administrative Cooperation, and both my officials and I are committed to progressing them during Ireland’s Presidency of the Council in the second half of next year.  At OECD level, Ireland has consistently approached ongoing negotiations on the OECD Pillar Two Agreement with the aim of ensuring a level playing field for all stakeholders and maintaining Irish and European competitiveness. We remain committed to participating constructively in discussions to provide certainty and stability to the business community and avoid further fragmentation of the international tax architecture.  This is a high-level overview of some of the work ongoing in my Department, recognising the need to protect Ireland's competitiveness to support continuing investment and employment in our economy. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 370. Deputy Seán Ó Fearghaíl asked the Tánaiste and Minister for Finance the key measures taken to support Ireland’s tax competitiveness during 2025; his priorities for 2026; and if he will make a statement on the matter. [73579/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_365",
          "debateSectionId": "dbsect_365",
          "showAs": "Economic Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_365.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_370",
        "questionNumber": 370
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 371 and 372 together.  As the Deputy will be aware, the Future Ireland Fund (FIF) and the Infrastructure, Climate and Nature Fund (ICNF) are the two new long-term savings funds established by the Future Ireland Fund and Infrastructure, Climate and Nature Fund Act 2024 (‘the Act’).  The FIF received its annual transfer of 0.8% GDP in 2025 in line with Section 8 of the Act. The value of this transfer was approximately €4.08 billion. This transfer builds on the transfers made in 2024, consisting of the initial annual transfer and monies transferred to the FIF from the National Reserve Fund (NRF). This brings the total value of transfers to the FIF by year-end 2025 to approximately €12.5 billion.  The ICNF, received a transfer of €2 billion from the NRF in 2024, and received its first annual transfer of €2 billion in 2025. This brings the total value of transfers to the ICNF by year-end 2025 to €4 billion.  Annual transfers are subject to an economic and fiscal assessment process carried out by the Irish Fiscal Advisory Council and my Department. Transfers to each of the funds in 2026 were approved as part of Budget 2026. The 2025 assessment is available on the Department of Finance website: www.gov.ie/en/department-of-finance/publications/budget-2026-transfers-to-the-fif-and-icnf-economic-assessment-in-accordance-with-the-act/  Responsibility for the investment of each of the two funds lies with the National Treasury Management Agency (NTMA). The NTMA publishes information and financial accounts in respect of the Future Ireland Fund, the Infrastructure, Climate and Nature Fund and the Ireland Strategic Investment Fund (ISIF) in its Annual Report. The 2024 Annual Report is available here: www.ntma.ie/annualreport2024/documents/NTMA-Annual-Report-2024.pdf  Drawdown from the ICNF for the purposes of funding ‘designated environmental projects’ may begin from 2026. Designated environmental projects are those projects which are likely to contribute to the reduction of greenhouse gas emissions, the improvement of water quality or the improvement of habitats in line with Section 20 of the Act. The process of drawing down funding for designated environmental projects, is managed by the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitisation. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 371. Deputy Seán Ó Fearghaíl asked the Tánaiste and Minister for Finance if he will report on the Future Ireland Fund during 2025; his priorities for 2026; and if he will make a statement on the matter. [73580/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_366",
          "debateSectionId": "dbsect_366",
          "showAs": "Fiscal Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_366.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_371",
        "questionNumber": 371
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 371 and 372 together.  As the Deputy will be aware, the Future Ireland Fund (FIF) and the Infrastructure, Climate and Nature Fund (ICNF) are the two new long-term savings funds established by the Future Ireland Fund and Infrastructure, Climate and Nature Fund Act 2024 (‘the Act’).  The FIF received its annual transfer of 0.8% GDP in 2025 in line with Section 8 of the Act. The value of this transfer was approximately €4.08 billion. This transfer builds on the transfers made in 2024, consisting of the initial annual transfer and monies transferred to the FIF from the National Reserve Fund (NRF). This brings the total value of transfers to the FIF by year-end 2025 to approximately €12.5 billion.  The ICNF, received a transfer of €2 billion from the NRF in 2024, and received its first annual transfer of €2 billion in 2025. This brings the total value of transfers to the ICNF by year-end 2025 to €4 billion.  Annual transfers are subject to an economic and fiscal assessment process carried out by the Irish Fiscal Advisory Council and my Department. Transfers to each of the funds in 2026 were approved as part of Budget 2026. The 2025 assessment is available on the Department of Finance website: www.gov.ie/en/department-of-finance/publications/budget-2026-transfers-to-the-fif-and-icnf-economic-assessment-in-accordance-with-the-act/  Responsibility for the investment of each of the two funds lies with the National Treasury Management Agency (NTMA). The NTMA publishes information and financial accounts in respect of the Future Ireland Fund, the Infrastructure, Climate and Nature Fund and the Ireland Strategic Investment Fund (ISIF) in its Annual Report. The 2024 Annual Report is available here: www.ntma.ie/annualreport2024/documents/NTMA-Annual-Report-2024.pdf  Drawdown from the ICNF for the purposes of funding ‘designated environmental projects’ may begin from 2026. Designated environmental projects are those projects which are likely to contribute to the reduction of greenhouse gas emissions, the improvement of water quality or the improvement of habitats in line with Section 20 of the Act. The process of drawing down funding for designated environmental projects, is managed by the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitisation. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 372. Deputy Seán Ó Fearghaíl asked the Tánaiste and Minister for Finance if he will report on the Infrastructure, Climate and Nature Fund during 2025; his priorities for 2026; and if he will make a statement on the matter. [73581/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_366",
          "debateSectionId": "dbsect_366",
          "showAs": "Fiscal Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_366.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_372",
        "questionNumber": 372
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 256 and 373 together.  One of key priorities for credit unions in 2026 is the Programme for Government commitment, to draft a five-year strategy for the sector. Both I and the Minister of State with responsibility for credit unions intend to co-sponsor with the credit union sector a plan to determine the sector's strategy. Agreement on a sector strategy and a focused deployment of credit union resources will support the expansion of financial services to all credit union members.  I expect that in early 2026, both I and the Minister of State will have the opportunity to approve and launch the work plan to deliver this strategy, in conjunction with the sector.  My officials, together with credit union stakeholders worked collaboratively to deliver the Credit Union (Amendment) Act 2023. The Act represents a very significant piece of legislation that will have far reaching positive implications for the credit union sector in the years to come.  The majority of provisions of the 2023 Act have commenced and progress is being monitored and reported to me by the Credit Union Advisory Committee (CUAC). Provisions yet to be commenced are in relation to Credit Union Service Organisations (CUSOs) and a corporate credit union. It is intended that the Central Bank of Ireland will publish a consultation paper during H1 2026 which will set out their proposals for the regulatory framework for investment by credit unions in CUSOs.  A statutory consultation will then be undertaken, as required under section 84A of the Credit Union Act, 1997 on draft amending regulations which will give effect to the regulatory framework for investment by credit unions in CUSOs.  In August 2025, the previous Minister for Finance and the Minister of State published recommendations on the Credit Union Resolution and Stabilisation Funds (the Funds). This followed a review and public consultation on the future use and structure of the Funds for the credit union sector.  Following the recommendations and statutory consultations, the levy rate for Funds has been set at 0% until October 2029, subject to certain conditions prevailing. This represents a considerable reduction from the €5.3 million that was collected by levy in respect of these Funds in 2023.  One very important Programme for Government commitment was to engage with the Central Bank of Ireland to review credit union lending limits. I am pleased to confirm that this work has been completed and revised lending limits are now in place.  Amending regulations commenced on 30 September 2025, permitting the sector to advance up to €6.75 billion in house lending and €3.375 billion in business lending, based on sector total assets of €22.5 billion as at 30 September 2025. This is a significant increase from previous permitted lending limits of €2.9 billion at 30 June 2024.  The amendment of these regulations reflects the competence and capability of credit unions to grow their respective loan books in a prudent manner, and to futureproof their offering to support homeowners and businesses.  I welcome the amended regulations as it will allow credit unions to compete more effectively in the mortgage and business lending market. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 373. Deputy Seán Ó Fearghaíl asked the Tánaiste and Minister for Finance the key measures taken to support the credit union sector during 2025; his priorities for 2026; and if he will make a statement on the matter. [73582/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_265",
          "debateSectionId": "dbsect_265",
          "showAs": "Credit Unions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_265.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_373",
        "questionNumber": 373
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Neither I, as Tánaiste and Minister for Finance, nor the Central Bank, can intervene directly in pricing of insurance under the Solvency II Directive. However, ensuring that consumers have access to affordable insurance cover is a key priority for this Government.  A key development in addressing the cost of insurance in 2025 was the publication of the new Action Plan for Insurance Reform 2025-2029 in July 2025. The plan sets out twenty-six actions being led across a number of Departments to address transparency, affordability and availability of insurance. There are ten priority actions and of these priority actions, one has been completed, and the remaining nine actions are currently on track to be completed within their respective timeframes.  My Department, through the Office to Promote Competition in the Insurance Market (OPCIM), also continues to prioritise increased competition and capacity across the insurance sector. The OPCIM plays an important role in engaging with insurers, brokers and a wide range of sectoral representatives to address gaps in insurance availability and encourage new market entrants. These efforts have led to a significant reduction in the number of insurance “pinch-points” faced by consumers and businesses. The OPCIM is also working closely with IDA Ireland to attract new international insurers to the Irish market. This work helps to broaden the supply base, diversify risk appetite and encourage more competitive pricing.  Priorities being led by my Department in relation to the Action Plan for Insurance Reform in 2026 include the publication and implementation of a Transparency Code for the insurance industry, progressing the Central Bank Amendment Bill 2025, a review of the price walking ban and actions relating to the affordability and availability of flood insurance.  The Government remains fully committed to the continued reform of the insurance sector and will continue to monitor the progress of measures to reduce the cost of insurance via the Cabinet Sub Group on Insurance Reform and work to secure a fair and transparent insurance market in Ireland. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 374. Deputy Seán Ó Fearghaíl asked the Tánaiste and Minister for Finance the key measures taken under the remit of his Department to control insurance costs during 2025; his priorities for 2026; and if he will make a statement on the matter. [73583/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_367",
          "debateSectionId": "dbsect_367",
          "showAs": "Insurance Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_367.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_374",
        "questionNumber": 374
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I thank the Deputy for his question.  This year I published Circular 18/2025 which set out the value for money obligation on all civil and public servants. This emphasised that value for money must be sought by civil and public servants at all levels and all stages of policy development. It highlighted the roles and responsibilities in the delivery of value for money, as well as the robust guidance, codes of practice, and circulars underpinned by legislation and informed by best practice in the pursuit of value for money.  In August this year, my Department also published the Medium Term Expenditure Framework, which is based on the three pillars of fiscal sustainability, spending adequacy, and spending efficiency. The third pillar of spending efficiency is focused on promoting value for money and ensuring that the government’s investment delivers tangible results. The Medium-Term Expenditure Framework will be used to inform future budgetary requirements.  Budget 2026 also placed a particular emphasis on achieving value for money. The budget strategy was developed using a whole of budget approach, which placed a strong emphasis on the totality of expenditure are clearly linking expenditure and investment to improved outcomes. A focus on reform was central in my Ministerial bilateral engagements as part of the Estimates process and in settling allocations. Chapter 3 of the Expenditure Report sets out a series of reform proposals to be implemented by Departments in 2026. Further detail, outlining reforms sector-by-sector, is presented in Part II of the Expenditure Report.  My Department is currently carrying out a review of the Public Financial Procedures (PFP) with a view to further enhancing accountability requirements in terms of providing value for money. The PFP sets out the principles of government accounting and is a practical guide to assist all officials in their day-to-day decision making on financial management issues. The review process is targeted at providing tools to support improvements in budgetary discipline within the limits voted by Dáil Éireann, and evidence-based expenditure decisions. The review group will produce recommendations for a redesign and modernisation of PFP for implementation in 2026. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 389. Deputy Seán Ó Fearghaíl asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the new initiatives taken to ensure value for money in public expenditure; his priorities for 2026; and if he will make a statement on the matter. [73556/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_379",
          "debateSectionId": "dbsect_379",
          "showAs": "Public Expenditure Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_379.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_389",
        "questionNumber": 389
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Enterprise, Tourism and Employment  Responsibility for policy on insurance matters lies with the Department of Finance and my colleague Minister Troy, in his capacity as Minister of State with special responsibility for Financial Services, Credit Unions and Insurance. My Department has responsibility for personal injuries policy, governance and oversight of the Injuries Resolution Board and the legislation underpinning it.  The Action Plan for Insurance Reform 2025-2029 ‘A Stronger Market, a Fairer Market’ published on 24 July this year, takes an all-of-Government approach to reform in the insurance sector and I am working closely with colleagues across Government on the implementation of the Plan.  The Action Plan contains 26 actions across a range of Departments which aim to increase insurance affordability, transparency and availability. My own Department and its agencies are leading on 11 of the actions. The Action Plan is available on the gov.ie portal.  On 16 October this year, I published the independent report, ‘Review of Compensation of Minor Soft Tissue Injuries in Ireland and the UK’ , which examines compensation awards for minor soft-tissue injuries between the jurisdictions in line with priority Action 4 ‘to provide necessary and relevant information to support a review of the Personal Injuries Guidelines'.  Undertaken by the Injuries Resolution Board and Deloitte, the report provides evidence that Ireland’s award levels for these categories of injuries remain significantly higher than that in England and Wales.  Priority Action 9 includes a commitment to bring stakeholders and enterprise fora together on issues relating to the availability and affordability of insurance. I established the Cost of Business Advisory Forum under the remit of my Department this year with the objectives of reducing the costs of running a business and addressing delays which can impact operations.  On 22 September, the Forum hosted a dedicated session on Insurance, attended by representatives of business and the insurance sector, along with Departmental Officials and the Injuries Resolution Board. The Forum will be undertaking further thematic sessions and will report on its work in the new year.  I have engaged with the Minister for Justice, Migration and Home Affairs to address concerns raised by business relating to the review process for the Personal Injuries Guidelines as provided for under priority Action 21.  I very much welcome the Government decision to approve a draft general scheme of a Bill to amend the Judicial Council Act 2019 to make future reviews of the Guidelines more comprehensive and transparent. Officials of my Department are working closely with the Department of Justice on the development of the Bill.  I also published the Action Plan on Competitiveness and Productivity in September which outlines 85 actions to enhance Ireland’s economy, with 26 priority measures and which highlights the importance of the delivery of the Action Plan on Insurance Reform.  The Injuries Resolution Board, an Agency of my Department, has since its establishment delivered major benefits for Ireland. In the period 2019 to 2024, there has been a substantial reduction in both the cost and volume of injury claims, down 39% and 33% respectively.  In 2024 alone, €76 million was saved through the work of the Injures Resolution Board from the avoided legal costs associated with litigation, with a similar figure expected in respect of 2025.  Looking to 2026, a key component of the Action Plan on Insurance Reform for my Department will be further strengthening of the Injuries Resolution Board. To that end, the Action Plan will see the Injuries Resolution Board undertake research on the non-acceptance of its awards to inform policy to maximise the number of claims it resolves, thereby reducing the number of claims entering the costly and time-consuming litigation process.  Both Minister Smyth and I will continue to attend meetings of the Cabinet Committee Subgroup on Insurance Reform to drive progress on the Action Plan for Insurance Reform, working on behalf of business and consumers to drive the insurance reform agenda taking account of the wider issue of competitiveness and impacts on our economy. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 397. Deputy Seán Ó Fearghaíl asked the Minister for Enterprise, Tourism and Employment the key measures taken under the remit of his Department to control insurance costs during 2025; his priorities for 2026; and if he will make a statement on the matter. [73554/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_385",
          "debateSectionId": "dbsect_385",
          "showAs": "Insurance Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_385.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_397",
        "questionNumber": 397
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  As the Deputy is aware, my colleague the Minster for Social Protection is the policy owner for the School Meals Programme and provides the funding for the meals directly to the school.  The objective of the School Meals Programme is to provide regular, nutritious food to children to support them in taking full advantage of the education provided to them. The programme is an important component of policies to encourage school attendance and extra educational achievement. My Department took the lead in relation to supporting schools in meeting their obligations to public procurement of school meals.  The primary relationship is between the school and supplier. It is the responsibility of each school board to select a supplier on the open market, in a fair and transparent manner in accordance with public procurement rules. These rules clearly define the successful tenderer’s responsibilities and obligations, including in relation to compliance with Nutritional Standards for School Meals and Nutritional Standards for Hot School Meals.  The programme is designed so that meals are provided by contracted food business operators, with the responsibility for food safety and compliance with relevant legislative obligations placed on these professional providers and not on the schools themselves. This ensures children benefit from a reliable, high-quality service, while schools are protected from having to take on responsibilities more appropriate to the providers, who will have the necessary expertise and experience in food provision.  The School Meals Programme is open to all Food Business Operators who meet the selection criteria and mandatory requirements set out in the tender documents.  No new legislation has been introduced nor has there been a change in the application of the law in respect of the provision of schools meals. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 441. Deputy Seán Ó Fearghaíl asked the Minister for Education and Youth if she has concerns regarding aspects of the tendering process (details supplied) for the provision of free school meals; and if she will make a statement on the matter. [73453/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_420",
          "debateSectionId": "dbsect_420",
          "showAs": "School Meals Programme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_420.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_441",
        "questionNumber": 441
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 442, 443 and 459 together.  School secretaries and caretakers are at the heart of the school and are the key interface between students, parents, school leaders and other staff. Without them, our schools would be unsustainable. In supporting these vital school staff members, we also support the school community as a whole.  My Department has been engaging with Fórsa and the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation over the past number of weeks under the auspices of the Workplace Relations Commission in relation to a number of claims including a claim for a comparable pension entitlement.  The matter has now been referred to the Labour Court, and a hearing will take place on 12th January 2026. The parties remain in process, and my department remains committed and ready to engage with Fórsa to reach a resolution on this important matter.  As with any industrial relations process, where engagement is sensitive and complex, the matters under discussion are confidential until this process concludes. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 459. Deputy Seán Ó Fearghaíl asked the Minister for Education and Youth the progress made to date on discussions between her Department, the Workplace Relations Commission and other relevant stakeholders to find a resolution to the school secretaries and caretakers dispute; and if she will make a statement on the matter. [73496/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_421",
          "debateSectionId": "dbsect_421",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_421.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_459",
        "questionNumber": 459
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  Affordability and the chance to own a home is at the heart of Government’s housing policy, as embodied within the new housing plan, Delivering Homes, Building Communities 2025 – 2030. The plan reinforces and expands the range of existing measures being implemented by Government to tackle the issues of supply and affordability, thereby supporting the increased provision of new homes to purchase and rent.  Government is investing an unprecedented level of funding to support housing supply, which will underpin, inter alia, the new Starter Homes Programme, delivering an average of 15,000 affordable housing supports annually to 2030.  In addition to a keen focus on tackling vacancy and dereliction, the plan provides for an expanded remit for the Land Development Agency, work to further extend the First Home and Help to Buy Schemes to 2030, an increase in affordable tenancies and an expanded local authority delivered starter homes for purchase programme.  With a strong focus on deliverability, the Plan will enable housing delivery partners to accelerate the supply of new starter home supports, providing thousands of individuals and families with increased access to secure and affordable housing solutions nationwide.  Information and guidance on the affordable housing supports in place for First Time Buyers, fresh starters and other eligible applicants is available at the following link: www.gov.ie/en/campaigns/0d279-doors-open/, and includes information on the schemes below.  • Local Authority Affordable Purchase Scheme  Local authorities make newly built homes available at a reduced price for first-time and other eligible buyers who cannot afford to purchase these homes at open market value with a maximum mortgage and 10% deposit. The local authority takes a percentage equity share in the home equal to the difference between the open market value of the home and the reduced price paid. This means that if a home is purchased at a 20% reduction on the open market value, the local authority will have a 20% equity share in the home. For more information visit: www.affordablehomes.ie  • First Home Scheme  The First Home Scheme provides finance to help first time buyers, self-builders or those making a fresh start to bridge the gap between a deposit and mortgage, and the price of a new home. This Scheme takes a percentage ownership of your home, which you can buy back later. For more information on the scheme visit: www.firsthomescheme.ie  • Local Authority Home Loan  The Local Authority Home Loan is a Government-backed mortgage for first-time buyers and certain other eligible applicants who have been refused a mortgage through a regular mortgage lender. The scheme is for the purchase of new or second-hand residential properties and for self-builds. It also includes the purchase of homes through Affordable Housing Schemes, with the exception of the First Home Scheme.  The Local Authority Home Loan is available nationwide from all local authorities. More information on the Local Authority Home Loan is available at the following link: localauthorityhomeloan.ie/  • Local Authority Purchase and Renovation Loan  The Local Authority Purchase and Renovation Loan is a Government backed mortgage and loan for the purchase and renovation of derelict and non-habitable homes. The property must be eligible for the Vacant Property Refurbishment Grant, whether derelict, non-habitable or simply vacant. For more information visit: purchaseandrenovationloan.ie/  • Vacant Property Refurbishment Grant  The Vacant Property Refurbishment Grant is available for turning a vacant house or building into a permanent home or a rental property. A grant of up to €50,000 is available. If the refurbishment costs exceed the standard grant of up to €50,000, a top-up grant amount of up to €20,000 is available. For more information: www.gov.ie/en/service/f8f1b-vacant-property-refurbishment-grant/  • Help to Buy  The Help to Buy scheme can help with a deposit for a new or self-build home. It is a refund on income and DIRT tax paid in Ireland in the last four-years. The scheme comes under the remit of Revenue and the Department of Finance. Information on Help to Buy is available at the following link:  www.revenue.ie/en/property/help-to-buy-incentive/index.aspx  A number of the above schemes can be combined, thereby providing additional affordability support. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 501. Deputy Seán Ó Fearghaíl asked the Minister for Housing, Local Government and Heritage the guidance available to a person (details supplied) attempting to buy a modest home, who works full time and holds significant savings, but finds themselves priced out of the market; and if he will make a statement on the matter. [73455/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_472",
          "debateSectionId": "dbsect_472",
          "showAs": "House Prices",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_472.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_501",
        "questionNumber": 501
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  Since the beginning of 2022, Government has supported the delivery of 35,163 new social homes across thousands of individual projects funded through build, acquisition and leasing programmes.  Building on progress made to date the new Housing Plan, Delivering Homes, Building Communities aims to deliver 300,000 new homes in the period to 2030, including 72,000 social homes and 90,000 starter home supports. The Plan seeks to significantly scale-up delivery of new build social homes over the coming years, increasing from an average of 8,000 or so homes a year at present to an average of 12,000 per year.  In 2025, Government has allocated almost €7.5 billion in capital investment for Housing, inclusive of Land Development Agency investment and Housing Finance Agency (HFA) lending. The 2025 capital funding is supplemented by €1.93 billion in current funding to address housing needs.  This record level of investment for the delivery of housing will continue in 2026 with €5.2bn in Exchequer capital funding complemented by investment through the Land Development Agency (LDA) and lending from the Housing Finance Agency (HFA), bringing the total capital funding for housing in 2026 to over €9 billion.  The Government remains committed to increasing social housing delivery and a key focus of the social housing programme is to increase the number of new-build homes.  To incentivise local authorities to deliver more ‘own build’ projects, a new performance fund will be established. Where a local authority exceeds their ‘own build’ target they will receive additional discretionary funding for the delivery of community and placemaking initiatives and projects. In addition, ring-fenced 'new-build' housing delivery teams in each local authority dedicated to own build new social and affordable housing delivery will be fully funded by my Department through reimbursement to local authorities on a performance pay basis.  Delivering Homes, Building Communities will further support additional social housing delivery by mandating the use of standard house layouts and specifications as part of the new approval process and facilitate the use of Modern Methods of Construction (MMC) through a standardised design approach. To further promote the delivery of social housing I will embed the use of a Design and Build contract approach in all local authorities and the AHB sector in order to expedite the delivery of social housing.  Additionally, the new ‘single approval’ process for all new build social housing projects up to a value of €200m will support local authorities to streamline processes and encourage delivery of larger new build social housing developments.  Furthermore, the Land Acquisition Fund will be reformed, streamlined and expanded to ensure it is fit for purpose and can support the level of ambition in the Plan. To this end, the fund will also be increased from the current €239m to at least €500m.  The newly established Housing Activation Office (HAO) will identify and seek to address barriers to the delivery of public infrastructure projects required to enable housing development, through the alignment of funding; and co-ordination of infrastructure providers.  In addition to these measures, Government will establish a revamped contractor-led renewal programme focused on tackling dereliction and vacancy.  In 2025, my Department has provided €375 million to support a second-hand acquisitions programme. The programme supports priority categories of need, including exits from homeless services, tenancy sustainment (tenant in situ), people with a disability and older persons requiring urgent housing responses, and Buy and Renew acquisitions tackling vacancy. €50 million of this funding was ring fenced to target acquisitions that support households, primarily larger families with children, to exit long-term emergency accommodation arrangements.  I expect the 2026 programme to maintain support for the priority categories and individual local authority allocations, will be agreed and notified to local authorities early next year.  My Department publishes comprehensive programme-level statistics on a quarterly basis on social and affordable housing delivery activity by local authorities and Approved Housing Bodies (AHBs) in each local authority. This data is available to the end of Q2 2025 and is published on the statistics page of my Department’s website (www.gov.ie/en/collection/6060e-overall-social-housing-provision/).  These figures show that from the beginning of 2020 to the end of Q2 2025, over 35,000 new homes have been delivered under social housing build programmes.  In the first six months of 2025, 1,804 new build social homes were delivered. This is an increase of almost 54% on the same period in 2024 (1,174).  The latest Construction Status Report shows that the social housing pipeline is strong and continues to grow with 11,557 social homes currently onsite with an additional 15,127 homes at design and tender stage. In Quarter 2 2025, 141 new construction schemes (2,478 homes) were added to the pipeline. The most recent publication was for Quarter 2 2025. All CSRs are available at the following link: www.gov.ie/en/collection/cb885-social-housing-construction-projects-status-reports/ ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 504. Deputy Seán Ó Fearghaíl asked the Minister for Housing, Local Government and Heritage the key measures taken to expand social housing provision during 2025; his priorities for 2026; and if he will make a statement on the matter. [73534/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_476",
          "debateSectionId": "dbsect_476",
          "showAs": "Housing Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_476.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_504",
        "questionNumber": 504
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 505 and 510 together.  The Government’s new housing plan, Delivering Homes, Building Communities 2025-2030, sets out a broad range of measures that will accelerate new homes delivery and provide affordable housing supports, thereby assisting first time buyers and renters all over the country.  The new plan prioritises deliverability, removing structural barriers to homebuilding by unlocking land, reforming planning, delivering infrastructure and creating conditions for investment.  A key component of this plan, the new Starter Homes Programme, will deliver an average of 15,000 affordable housing supports annually to 2030, while at the same time having a keen focus on vacancy and dereliction.  The Plan supports homeownership and secure rental —while revitalising villages, towns and cities.  In particular, the plan provides for an expanded remit for the Land Development Agency, extends the First Home and Help to Buy Schemes to 2030 and expands the local authority delivered starter homes for purchase programme, which will see an increase in affordable homes for purchase nationwide.  It also creates a new support for those creating Living over the Shop homes.  Since 2021, Government has introduced several schemes to help first time home seekers to buy or rent homes, with close to 16,900 affordable housing supports having been provided via these measures, nationwide.  My Department proactively engages with the housing delivery partners, on a regular basis, to monitor and support their delivery of affordable housing.  Scheme criteria and support levels for affordable purchase schemes are kept under regular review, taking account of developments in the housing market. I will continue engaging with all delivery partners, to ensure that the Starter Homes Programme delivers a strong pipeline of affordable housing supports, over the lifetime of the plan. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 505. Deputy Seán Ó Fearghaíl asked the Minister for Housing, Local Government and Heritage the key measures taken to expand affordable housing provision during 2025; his priorities for 2026; and if he will make a statement on the matter. [73535/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_477",
          "debateSectionId": "dbsect_477",
          "showAs": "Housing Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_477.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_505",
        "questionNumber": 505
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 506. Deputy Seán Ó Fearghaíl asked the Minister for Housing, Local Government and Heritage the key measures taken to tackle homelessness during 2025; his priorities for 2026; and if he will make a statement on the matter. [73536/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_478",
          "debateSectionId": "dbsect_478",
          "showAs": "Homeless Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_478.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_506",
        "questionNumber": 506
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  Working to end dereliction and vacancy is a key priority in the Government's new housing plan, Delivering Homes, Building Communities. The Plan will ensure that the activities and resources used to address vacancy and dereliction are co-ordinated, and that legislative powers are used proactively to work to bring dereliction and vacancy to an end.  The range of initiatives and funding mechanisms introduced in recent years are set out in the Vacant Homes Action Plan and they are successfully reducing the levels of vacancy and dereliction right across the country.  A key measure is the Vacant Property Refurbishment Grant, introduced in July 2022. The grant provides up to €70,000 for the refurbishment of vacant and derelict properties for occupation as a principal private residence and for properties which will be made available for rent. There has been significant interest in the grant since its launch, with over 15,600 applications made to local authorities to date and over €230 million of grant funding paid out across the country.  This week I announced a new enhanced support package of up to €140,000 to bring vacant ‘above shop’ space in our cities, towns and villages into use as homes, which will be made available in Q1 next year.  This year, my Department has been engaging with the national statistical institute, the Central Statistics Office, which has recently developed a new statistical release on residential vacancy.  The release, published in September, provides information on the extent of residential vacancy in 2022 and 2023, using ESB data on residential electricity consumption, with future regular publications planned. In the release, the CSO note a national vacancy rate of 3.3% at the end of 2023, down from 3.6% at the end of 2022. Local authority and local electoral level breakdowns are also included.  The CPO Activation Programme, launched in 2023, requires local authorities to take a proactive, systematic approach to identifying and activating vacant and derelict properties. It includes use of their compulsory purchase powers under the Derelict Sites Act and the Housing Act, when engagement with the owners of these properties is not successful in bringing them back into use.  In October, my Department published data for 2023 and 2024 on the CPO Activation Programme on its website, which includes the number of properties that entered the Programme, the number of compulsory purchase/acquisitions commenced and the number of compulsory purchase/acquisitions completed per local authority. This data can be accessed at the following link: assets.gov.ie/static/documents/bdfef028/CPO_Activation_Programme_-_LA_use_of_CPO_powers.pdf  Call 3 of the Urban Regeneration and Development Fund (URDF), as well as Social Housing Investment Programme funding, is able to provide the finance required to compulsorily acquire properties in support of the local authority’s wider CPO Activation Programme targets. To date, over 1,370 properties have now been approved for local authority's URDF Call 3 programmes, with an estimated residential yield of over 5,600 homes.  Delivering Homes, Building Communities reinforces and expands the range of measures being implemented by Government to work to end dereliction and long term vacancy.  As well as the new Above the Shop Grant and other measures, a new Derelict Property Tax will be introduced, to be administered and collected by the Revenue Commissioners, to bring derelict properties back into use.  Under the Living City Initiative, a tax incentive scheme to encourage people to live in ‘special regeneration areas’, tax relief can be claimed for money spent on refurbishing or converting residential or commercial buildings. The aim of the initiative is to bring back life into the heart of the relevant cities and towns by encouraging people to convert suitable properties. Budget 2026 extended the Living City Initiative to 2030, and expanded it to include residential properties built before 1975 and the towns of Athlone, Drogheda, Dundalk, Letterkenny and Sligo.  I firmly believe the commitment Government has made to addressing vacancy and dereliction and the actions under Delivering Homes, Building Communities will play a vital role in delivering homes across the country. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 507. Deputy Seán Ó Fearghaíl asked the Minister for Housing, Local Government and Heritage the key measures taken to tackle vacancy and dereliction during 2025; his priorities for 2026; and if he will make a statement on the matter. [73537/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_479",
          "debateSectionId": "dbsect_479",
          "showAs": "Vacant Properties",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_479.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_507",
        "questionNumber": 507
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  Affordability and the chance to own a home is at the heart of Government’s housing policy, as embodied within the new housing plan, Delivering Homes, Building Communities 2025 – 2030. The plan reinforces and expands the range of existing measures being implemented by Government to tackle the issues of supply and affordability, thereby supporting the increased provision of new homes to purchase and rent.  Cost Rental is a key element of the Government's strategy to improve affordability in the rental sector and to provide secure, long-term homes for moderate-income households above the income limits for social housing. The core principle is that rents cover the development, management, and maintenance costs of the homes, so that their long-term future is secure, without rents being subject to the pressures of the open market.  As rents depend on actual delivery costs, various Cost Rental homes will have different degrees of affordability for the range of potential applicants. My Department is supporting the delivery of homes at a range of cost and rent levels, depending on factors like location and the size or type of home, and affordability is always a key consideration. By providing significant capital funding, my Department helps to drive down the rents that must be paid by tenants. This funding comes as low-cost loans, capital grants, and State investment. All supported Cost Rental projects must achieve starting rents that are at least 25% (and often significantly more) below comparable local market levels.  The 2025 Programme for Government includes a commitment to target Cost Rental homes at key local workers, and my Department is working to explore all options for achieving this.  In the meantime, we are working to implement certain changes which were made to Part 3 of the Affordable Housing Act 2021 late last year. The Housing (Miscellaneous Provisions) Act 2024 included new provisions related to the Cost Rental sector which are likely to improve access for certain cohorts.  On 2 July this year I made the Affordable Housing Act 2021 (Cost Rental Allocation Plan) Regulations 2025. These Regulations allow for Cost Rental landlords to employ Allocation Plans which may prioritise particular homes for those with a link to an area though residence, employment, or children’s education. This will support people to live and work in their local area.  The Programme for Government also includes a commitment to introduce a cost rental version of the Repair and Lease scheme on a pilot basis. This is aimed both at tackling vacancy and dereliction and providing affordable housing. The new housing plan contains a commitment to develop a pathfinder project for an affordable rental version of the repair and lease scheme and my Department is working with Local Authorities to develop a viable scheme to achieve these aims.  My Department continues to review the operation of the Cost Rental housing tenure. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 508. Deputy Seán Ó Fearghaíl asked the Minister for Housing, Local Government and Heritage the key measures taken to expand cost rental during 2025; his priorities for 2026; and if he will make a statement on the matter. [73538/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_480",
          "debateSectionId": "dbsect_480",
          "showAs": "Housing Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_480.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_508",
        "questionNumber": 508
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  Government is acutely aware of the viability gap which has emerged between the cost of delivering apartment developments and their market price and has taken a range of measures to incentivise development in this critically important area.  Measures taken in 2025 include: enabling the extension of un-commenced residential planning permissions nearing the end of their duration; rental regulation reforms including measures to boost investment in new apartments; a fourth call for the Croí Cónaithe Cities scheme which aims to bridge the viability gap for new apartments for sale; new apartment guidelines with greater flexibility vis-à-vis the size and mix of apartments; Budget 2026 taxation measures aimed at stimulating the supply of new apartments including a reduced VAT rate on the sale of new apartments and an enhanced Corporation Tax deduction for apartment construction costs.  Taken together, these measures have the potential to result in significant savings in the range of €88,000 to €160,000 per unit for new apartment developments.  The focus for 2026 will be on the implementation of these measures and closely monitoring apartment investment, planning and commencement activity to inform ongoing policy consideration. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 509. Deputy Seán Ó Fearghaíl asked the Minister for Housing, Local Government and Heritage the key measures taken to support apartment building during 2025; his priorities for 2026; and if he will make a statement on the matter. [73539/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_481",
          "debateSectionId": "dbsect_481",
          "showAs": "Housing Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_481.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_509",
        "questionNumber": 509
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 505 and 510 together.  The Government’s new housing plan, Delivering Homes, Building Communities 2025-2030, sets out a broad range of measures that will accelerate new homes delivery and provide affordable housing supports, thereby assisting first time buyers and renters all over the country.  The new plan prioritises deliverability, removing structural barriers to homebuilding by unlocking land, reforming planning, delivering infrastructure and creating conditions for investment.  A key component of this plan, the new Starter Homes Programme, will deliver an average of 15,000 affordable housing supports annually to 2030, while at the same time having a keen focus on vacancy and dereliction.  The Plan supports homeownership and secure rental —while revitalising villages, towns and cities.  In particular, the plan provides for an expanded remit for the Land Development Agency, extends the First Home and Help to Buy Schemes to 2030 and expands the local authority delivered starter homes for purchase programme, which will see an increase in affordable homes for purchase nationwide.  It also creates a new support for those creating Living over the Shop homes.  Since 2021, Government has introduced several schemes to help first time home seekers to buy or rent homes, with close to 16,900 affordable housing supports having been provided via these measures, nationwide.  My Department proactively engages with the housing delivery partners, on a regular basis, to monitor and support their delivery of affordable housing.  Scheme criteria and support levels for affordable purchase schemes are kept under regular review, taking account of developments in the housing market. I will continue engaging with all delivery partners, to ensure that the Starter Homes Programme delivers a strong pipeline of affordable housing supports, over the lifetime of the plan. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 510. Deputy Seán Ó Fearghaíl asked the Minister for Housing, Local Government and Heritage the key measures taken to support first time buyers during 2025; his priorities for 2026; and if he will make a statement on the matter. [73540/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_477",
          "debateSectionId": "dbsect_477",
          "showAs": "Housing Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_477.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_510",
        "questionNumber": 510
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 511. Deputy Seán Ó Fearghaíl asked the Minister for Housing, Local Government and Heritage the key measures taken to enhance water services during 2025; his priorities for 2026; and if he will make a statement on the matter. [73541/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_482",
          "debateSectionId": "dbsect_482",
          "showAs": "Water Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_482.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_511",
        "questionNumber": 511
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 512. Deputy Seán Ó Fearghaíl asked the Minister for Housing, Local Government and Heritage the key measures taken to support rightsizing during 2025; his priorities for 2026; and if he will make a statement on the matter. [73542/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_483",
          "debateSectionId": "dbsect_483",
          "showAs": "Housing Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_483.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_512",
        "questionNumber": 512
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The Government is focused on increasing the national housing stock and ensuring a suitable range of housing is available to all. Activating housing supply is multifaceted, requiring a concerted effort across a number of policy areas and a range of measures were taken in 2025 to boost overall housing supply.  The Planning and Development Act 2024 represents the most comprehensive review of planning since 2000 and a detailed plan for the implementation of the Act was published in March 2025. The first phase of commencements has provided for the establishment of An Coimisiún Pleanála and introduced provisions for reformed planning judicial review. New tools such as Urban Development Zones and Urban and Priority Area Plans will support faster, more responsive delivery of housing and infrastructure, where it is needed most.  The Planning and Development (Amendment) Bill 2025 was approved, published and enacted before the summer recess to deal with expiring planning permissions and to encourage activation of housing, while the new Housing Activation Office will work to address barriers to the delivery of infrastructure projects needed to enable housing development.  The revised National Planning Framework (NPF) approved in April is a major step forward, and will help increase capacity and accelerate home building across the country. In July, I issued Guidelines instructing local authorities to update housing targets in line with the revised NPF. The new Guidelines set out the need to plan for approximately 55,000 additional households per annum on average to 2040, enabling zoning for a total of 83,000 units per annum.  In June, Government also agreed to amend the rent pressure zone framework, which will help stimulate increased development of apartments over the longer-term.  A fourth call for expressions of interest under the Croí Cónaithe Cities scheme was issued over the summer with submitted schemes now currently being assessed. The scheme will help activate the thousands of planning permissions for apartments in our cities. Furthermore, an enhanced Land Development Agency is working to deliver more private housing as well as social, affordable and cost rental homes.  The delivery of housing is at the centre of the updated National Development Plan, published in July, which provides for unprecedented levels of investment for housing and water infrastructure with overall investment of €40.5bn provided for housing and related water services to 2030. Furthermore, a record level of investment is being provided for the delivery of housing in 2026 with overall capital funding of over €9 billion announced in Budget 2026.  Government also announced in Budget 2026 reduced VAT on sale of apartments from 13.5% to 9%, Enhanced Corporation Tax Deductions on Construction Expenses to improve the viability of apartment building, and a Corporation Tax Exemption for Cost Rental Income to encourage delivery and increase viability of cost rental units.  The Government’s new plan Delivering Homes, Building Communities was published on 13 November 2025. The implementation of the actions set out in the plan, will see the delivery of 300,000 new homes over its lifetime, including 72,000 social homes, and provide 90,000 affordable supports to help people who are struggling to have a home of their own.  Pillar 1 of the new plan focuses on activating the supply of 300,000 homes. This will be achieved through a range of actions aimed at activating more land, providing more housing-related infrastructure, securing more development finance for home building, addressing viability challenges, particularly in apartment delivery, increasing the adoption of Modern Methods of Construction, improving labour skills in the residential construction sector, and working towards ending dereliction and vacancy.  These actions will be progressed in 2026 and further information is available at the following link:  www.gov.ie/en/department-of-housing-local-government-and-heritage/publications/enabling-more-housing/#activating-supply ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 513. Deputy Seán Ó Fearghaíl asked the Minister for Housing, Local Government and Heritage the key measures taken to boost overall housing supply during 2025; his priorities for 2026; and if he will make a statement on the matter. [73543/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_484",
          "debateSectionId": "dbsect_484",
          "showAs": "Housing Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_484.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_513",
        "questionNumber": 513
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 514. Deputy Seán Ó Fearghaíl asked the Minister for Housing, Local Government and Heritage for a report on the work of the Housing Activation Office during 2025; his priorities for 2026; and if he will make a statement on the matter. [73544/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_485",
          "debateSectionId": "dbsect_485",
          "showAs": "Departmental Functions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_485.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_514",
        "questionNumber": 514
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 549. Deputy Seán Ó Fearghaíl asked the Minister for Social Protection the key measures taken to tackle poverty during 2025; his priorities for 2026; and if he will make a statement on the matter. [73561/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_521",
          "debateSectionId": "dbsect_521",
          "showAs": "Social Welfare Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_521.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_549",
        "questionNumber": 549
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 550. Deputy Seán Ó Fearghaíl asked the Minister for Social Protection the key measures taken to support carers during 2025; his priorities for 2026; and if he will make a statement on the matter. [73562/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_522",
          "debateSectionId": "dbsect_522",
          "showAs": "Social Welfare Benefits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_522.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_550",
        "questionNumber": 550
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  My Department is actively contributing to a programme of insurance reform which is being implemented on a whole-of-government basis.  There are clear signs that the market is responding to the Government’s actions, with insurers moving into previously challenging areas such as childcare, leisure activities and sports. We have also seen that incumbent providers are expanding their product offerings into areas such as SMEs, hospitality, agriculture, and energy, and there has been renewed international interest in Ireland as an insurance destination.  The Occupiers Liability Act 1995 was amended in 2023 with a view to making insurance more affordable for consumers, businesses and community groups. The amendments to the Act:   inserted into primary law a number of recent court decisions which rebalance the duty of care owed by occupiers to visitors and recreational users;   changed the standard to clarify that when the occupier of a property has acted with reckless disregard for a visitor or customer, it is the standard of reckless disregard rather than reasonable grounds which should apply in relation to any consideration of liability;   limited the circumstances in which a court can impose liability on the occupier of a premises where a person has entered onto premises for the purpose of committing an offence; and  allowed for a broader range of scenarios where it can be shown that a visitor or customer has voluntarily assumed a risk resulting in harm.  The amendments contained in the Act were designed to strike the right balance between ensuring businesses, community groups and organisers of events fulfil their duty of care responsibilities, while also acknowledging the importance of personal responsibility of visitors, recreational users and trespassers. The impact of these changes will be assessed over time.  As the Deputy will be aware, the first iteration of the Personal Injury Guidelines came into effect in April 2021 and have had a clear and significant cost saving impact since their introduction. On the 17 September, as required by section 7 of the Judicial Council Act 2019, I laid revised personal injury guidelines before the Houses of the Oireachtas. Prior to the laying of the documents, I consulted Ministerial colleagues and the Attorney General in relation to the proposed increase in award amounts contained in the Judicial Council’s proposals.  While there were concerns that any delay in the adoption of new guidelines could lead to the courts being invited to depart from the guidelines and to seek higher awards reflecting the effect of inflation, to be applied at the discretion of the Court, I was also conscious of concerns raised in relation to potential inflationary pressures. Therefore, it is my intention not to bring a Resolution before the Houses seeking the approval of the guidelines at this time. In effect, this means that the amended Guidelines cannot come into effect and the existing Guidelines will remain in place.  In addition, I have received Government approval to draft a general scheme of a Bill to amend the Judicial Council Act 2019 to make reviews of the Personal Injuries Guidelines more comprehensive and transparent. I intend to bring the General Scheme of the Bill to Government early in the New Year, after which it will be referred for Pre-Legislative Scrutiny.  The Government is conscious that further work needs to be done to compel insurance companies to lower their premia, a point that has been frequently made by the Taoiseach, Tánaiste and Minister of State Robert Troy, who has published a new Action Plan for Insurance Reform.  I am also conscious of the impact legal costs can have on insurance premia. I have received government approval to draft a Civil Reform Bill which among other matters will see the monetary jurisdiction of the District Court increase from €15,000 to €20,000 while in the Circuit Court it will increase from €75,000 to €100,000. The lower limit for personal injury cases in the Circuit Court will also increase from €60,000 to €100,000. These changes will result in a higher proportion of civil actions being heard in the District and Circuit Courts, leading to lower legal costs for all parties involved ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 564. Deputy Seán Ó Fearghaíl asked the Minister for Justice, Home Affairs and Migration the key measures taken under the remit of his Department to control insurance costs during 2025; his priorities for 2026; and if he will make a statement on the matter. [73548/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_537",
          "debateSectionId": "dbsect_537",
          "showAs": "Insurance Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_537.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_564",
        "questionNumber": 564
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 670 and 671 together.  It is recognised that endometriosis is a significant health issue for women in Ireland today and the HSE acknowledges that it is a difficult condition to diagnose and treat because of the variation of presentations which can impact the physical and mental wellbeing of patients. Endometriosis is a chronic disease with high recurrence rates, for which there is no definitive cure.  On 18 October I launched the National Framework for the management of Endometriosis. The Framework sets out for the first time in Ireland a defined clinical pathway for women with endometriosis, which spans primary to secondary care to specialist complex care in tertiary settings.  Most women experiencing signs and symptoms of endometriosis present to their local GP in the community. In line with clinical guidelines, GPs are encouraged to initiate treatment for suspected endometriosis and may refer women with suspected endometriosis to general gynaecology services in their local hospital.  Regional Specialist Centres for moderate cases have been established in the Rotunda, the Coombe, and Limerick, with clinics under further development in Galway and the National Maternity Hospital.  Two supra-regional specialist centres, in Tallaght and Cork, have been established for the management of complex endometriosis cases.  All endometriosis sites are operational and taking referrals. Treatment including surgical intervention is being provided across the network.  Additional funding has been provided this year to expand these services through the recruitment of more personnel to provide multidisciplinary care at both supra-regional and regional level.  The Framework was officially published in October of this year. Funding of over €5 million has already been invested in specialist endometriosis services since 2021. In addition, endometriosis surgeries have been and continue to be performed in other acute gynaecology services.  The HSE has carried out an analysis of the short term and medium-term requirements to build adequate capacity, improve clinical pathways and increase expertise within our endometriosis services. The HSE’s budget for 2026 will be €27.4 billion, an increase of 6.2% on 2025. This investment will enable expansion and improvement in our health services, including endometriosis.  The Endometriosis Surgery Abroad Interim Scheme commenced from the 18 October and will operate in addition to the existing treatment abroad pathways, including the EU Treatment Abroad Scheme, the EU Cross Border Directive and Northern Ireland Planned Healthcare Schemes. The interim scheme will cover costs for the transport abroad and for healthcare provided, paid directly to the hospital.  Where a person accesses private healthcare in Ireland there is no facility for the cost of that care to be reimbursed by the public health system. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 670. Deputy Seán Ó Fearghaíl asked the Minister for Health if she will address the concerns regarding the treatment of women with endometriosis raised in correspondence (details supplied); and if she will make a statement on the matter. [73493/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_644",
          "debateSectionId": "dbsect_644",
          "showAs": "Healthcare Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_644.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_670",
        "questionNumber": 670
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 670 and 671 together.  It is recognised that endometriosis is a significant health issue for women in Ireland today and the HSE acknowledges that it is a difficult condition to diagnose and treat because of the variation of presentations which can impact the physical and mental wellbeing of patients. Endometriosis is a chronic disease with high recurrence rates, for which there is no definitive cure.  On 18 October I launched the National Framework for the management of Endometriosis. The Framework sets out for the first time in Ireland a defined clinical pathway for women with endometriosis, which spans primary to secondary care to specialist complex care in tertiary settings.  Most women experiencing signs and symptoms of endometriosis present to their local GP in the community. In line with clinical guidelines, GPs are encouraged to initiate treatment for suspected endometriosis and may refer women with suspected endometriosis to general gynaecology services in their local hospital.  Regional Specialist Centres for moderate cases have been established in the Rotunda, the Coombe, and Limerick, with clinics under further development in Galway and the National Maternity Hospital.  Two supra-regional specialist centres, in Tallaght and Cork, have been established for the management of complex endometriosis cases.  All endometriosis sites are operational and taking referrals. Treatment including surgical intervention is being provided across the network.  Additional funding has been provided this year to expand these services through the recruitment of more personnel to provide multidisciplinary care at both supra-regional and regional level.  The Framework was officially published in October of this year. Funding of over €5 million has already been invested in specialist endometriosis services since 2021. In addition, endometriosis surgeries have been and continue to be performed in other acute gynaecology services.  The HSE has carried out an analysis of the short term and medium-term requirements to build adequate capacity, improve clinical pathways and increase expertise within our endometriosis services. The HSE’s budget for 2026 will be €27.4 billion, an increase of 6.2% on 2025. This investment will enable expansion and improvement in our health services, including endometriosis.  The Endometriosis Surgery Abroad Interim Scheme commenced from the 18 October and will operate in addition to the existing treatment abroad pathways, including the EU Treatment Abroad Scheme, the EU Cross Border Directive and Northern Ireland Planned Healthcare Schemes. The interim scheme will cover costs for the transport abroad and for healthcare provided, paid directly to the hospital.  Where a person accesses private healthcare in Ireland there is no facility for the cost of that care to be reimbursed by the public health system. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 671. Deputy Seán Ó Fearghaíl asked the Minister for Health if she will address the request for reimbursement of costs incurred for endometriosis treatment raised in correspondence (details supplied); and if she will make a statement on the matter. [73494/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_644",
          "debateSectionId": "dbsect_644",
          "showAs": "Healthcare Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_644.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_671",
        "questionNumber": 671
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  As I'm sure the Deputy is aware, the breath and scope of the Higher Education sector across Ireland is significant, as too is the work of my Department in supporting the sector. Consequently I will focus my response on key highlights from 2025 and high level priorities for 2026.   Measures taken in 2025 to support the Higher Education sector. Supporting Students and Families:   • I secured a €500 reduction in the student contribution fee – the first permanent reduction since free fees were introduced in 1995. Apprentices in higher education will also see an up to 17% cut to their contribution, applied on a pro-rata basis.  • More families will qualify for student grants - the income threshold to receive a SUSI student contribution grant will rise to €120,000 – the highest ever. This change could benefit thousands of additional undergraduate students.  • 30,000 students to get more support when living or travelling away from home - from September 2026, SUSI non-adjacent payments will rise by €200–€430, with a pro-rata increase this academic year - helping students who live 30km or more from their college campus with the cost of rent, travel, and day-to-day living.  • Postgraduate support boosted - the SUSI postgraduate fee contribution grant is rising from €4,000 to €4,500, backed by a €1 million investment.   Supporting Teaching and Learning in Higher Education   • I am supporting the enhancement of teaching and learning in Higher Education through the Strategic Alignment of Teaching and Learning Enhancement (SATLE) funding. Higher education institutions collectively received €5 million in SATLE funding in the 2024/25 academic year. This is used to fund initiatives in the areas of digital transformation, Education for Sustainable Development and academic integrity.  • I am also supporting the HEA in their policy work regarding teaching and learning, including the forthcoming national policy framework on generative AI, due to be published in the coming weeks.  • In November, my department held a consultation with the further and higher education sector and other stakeholders which explored the potential for greater embedding of creativity across third level education and research.   Continued Support for the Technological Sector:   • Investment of €65.8m over three years for the Technological sector and specialist colleges.  • On foot of intensive work by my Department, I have now secured the introduction of Professorship grades into the Technological University sector . The grade will see the approval for 50 professors in technological universities and the technology sector, with an initial rollout of 25 across the system through the Targeted Enhancement Fund. My Department will continue to engage with colleagues on this matter and will consult with key stakeholders on the introduction of this new grade to Technological Universities.   Expanding Access to key skills areas - Health Workforce Planning:   • In the area of Health Workforce Planning, a new dentistry programme and two new pharmacy programmes successfully commenced in September.  • An additional pharmacy programme, two veterinary programmes and new medicine programme are on the CAO for 2026, and on track to take in students.  • An expansion of existing nursing programmes has been approved and communicated to HEIs with this expansion due to come on stream in 2026.  • An additional 300 Health and Social Care Professional places commenced in September as planned and further places to be made available in 2026.   Support for learners to upskill in key priority areas through Springboard+   • Springboard+ 2025 launched in May 2025 provides 7,719 places on 249 courses, including 26 micro-credentials providing 752 places for the 2025/2026 academic year. Funding for Springboard+ in the 2025 financial year is secured from the National Training Fund (NTF), with €34.438 million allocated.  • The Micro-Credentials Learner Fee Subsidy was launched in March 2024 to subsidise fees for 13,763 learners across 650 micro-credential courses, with an 80% subsidy rate for key priority areas including artificial intelligence, cyber security and ICT (and 50% for other courses). The scheme is running until the end of the 2025/2026 academic year and learners could avail of the subsidy up until 31 October 2025.   Record investment in Apprenticeships, Skills and Research:   • In budget 2026, I allocated a record €79 million investment in apprenticeships – funding has more than doubled since 2020, rising from €184 million to over €400 million by 2026.  • Increase in the Research and Development Tax Credit from 30% to 35% – demonstrating our commitment to the research sector, promoting collaboration between industry and academia, and positioning ourselves as a competitive destination for innovative companies and startups.   Working towards Funding Reform   • In the area of funding reform, an HEA-led sectoral working group has been established and first two meetings held, with my Department to attend the group in an advisory capacity. The group will meet for two years, delivering an interim report next summer and final recommendations in 2027.   Building Confidence and Trust   • Quality and Qualifications Ireland (QQI), an agency under the remit of my Department, is currently introducing TrustEd Ireland – a new international education quality mark. TrustEd Ireland is a key pillar of the Government’s policy for international education, as set out in Global Citizens 2030: Ireland’s International Talent and Innovation Strategy to 2030. The TrustEd Ireland Mark will be awarded by QQI to higher education and English language education providers who have demonstrated that they meet new national standards to ensure a quality experience for international learners.   Higher Education Infrastructure   • My Department works collaboratively, through the HEA and higher education institutions, on the development and delivery of capital infrastructure projects. Almost €255m in capital funding was disbursed to the higher education sector during the course of 2025 to progress existing capital projects and support devolved funding mechanisms.  • As part of the National Development Plan 2025 review, I secured a capital allocation of €4.55bn over the next 5-years 2026 - 2030 for DFHERIS. Over half of this allocation €2.45 billion is targeted at strengthening Ireland’s research and Innovation capacity; this investment will support world-class research facilities, new research centres, advanced equipment and major international collaborations, while also enabling the continued delivery of significant investment in higher and further education.  • In November 2025 I announced INSPIRE, a landmark €750m research infrastructure programme for Ireland’s research and innovation system. It will support Ireland’s High-Performance Computing capacity and Tyndall National Institute. At least €500m will be invested over the lifetime of the NDP in two funding streams:  • Local institutional infrastructure, routine research equipment used within higher education institution for both teaching and research purposes, and  • Shared advanced infrastructures, major equipment that is appropriately shared across a number of institutions and is accessible to external users.  • This programme will be administered by the HEA and Research Ireland, and it will open for applications in Q1 2026.   My Priorities for 2026:Continued support for Technological Universities   • Support the implementation of the Targeted Enhancement Fund and in particular the first phase of Professorships in the Technological University sector.  • Support continued reform of academic staffing in the Technological University sector as recommended in the 2022 OECD report.   Generation investments in Research Infrastructure   • €2.1 billion will be provided for the development and enhancement of higher and further education infrastructure over the period 2026 to 2030. Of this, DFHERIS will have a total capital allocation of €311m in 2026, for further and higher education capital infrastructure investment. A programmatic approach to capital investment ensures strategic delivery of multiple projects as cohesive programmes, aligned with Infrastructure Guidelines. This investment will deliver new and upgraded facilities, modernised campuses with modern equipment and additional capacity to meet growing regional and national demand, focusing on a range of key higher and further education programmes. Specifically on the higher education side, it will focus on key higher education programmes, including, the Higher Education Strategic Infrastructure Programme, the Infrastructure Upgrade and Refurbishment Programme, the Technological Sector Strategic Projects Programme and the Public Private Partnership Programme.   Continued Expansion of places in Healthcare Education   • Over 1,100 additional healthcare course places will be created - backed by a €23.5 million investment, this major expansion includes medicine, nursing, disability therapies and social care - a 27% increase in capacity to train the next generation of healthcare professionals.   Strong focus on Inclusion and Wellbeing on Higher Education Campus   • €1 million in Budget 2026 for student mental health and healthy campus initiatives - supporting wellbeing across higher education institutions.  • €3 million boost for students with disabilities - includes €1 million for higher education and €2 million for further education and training colleges – supporting over 22,000 students and building a more inclusive education system. Included in the additional funding for further education and training is the provision to cover transport costs for learners with intellectual disabilities. This is part of our wider commitment to building a more inclusive and accessible education system.  • Ensuring that students are able to access quality information about their course, attendant qualifications and career prospects. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 779. Deputy Seán Ó Fearghaíl asked the Minister for Further and Higher Education, Research, Innovation and Science the measures taken to support the higher education sector during 2025; his priorities for 2026; and if he will make a statement on the matter. [73564/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_745",
          "debateSectionId": "dbsect_745",
          "showAs": "Further and Higher Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_745.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_779",
        "questionNumber": 779
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 780. Deputy Seán Ó Fearghaíl asked the Minister for Further and Higher Education, Research, Innovation and Science the measures taken to support the further education sector during 2025; his priorities for 2026; and if he will make a statement on the matter. [73565/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_746",
          "debateSectionId": "dbsect_746",
          "showAs": "Further and Higher Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_746.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_780",
        "questionNumber": 780
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  A key achievement in 2025 was the delivery of additional purpose-built student accommodation under the Short-Term Activation Programme. Through robust due diligence and value-for-money assessments, investment decisions were refined to ensure sustainability, resulting in 967 additional student beds either delivered or actively progressing by year-end.  Significant institutional milestones were achieved, with Maynooth University completing a 116-bed project, University College Dublin advancing a 493-bed development with approval to proceed to construction in September 2025, and Trinity College Dublin progressing its project. Together, these projects will deliver meaningful short-term accommodation capacity in high-demand locations.  The decision not to proceed with the Dublin City University 405-bed project further demonstrated strong governance and a commitment to ensuring all developments meet cost and value-for-money standards. Parallel progress was achieved through the Technological Sector Student Accommodation Programme (TSSAP), which is laying the foundations for longer-term, regionally balanced delivery. Phase 1 of the programme, completed in 2025, generated 53 strategic proposals from Technological Universities nationwide. These proposals now inform Phase 2, which is developing preliminary business cases, including financial and operational models, to ensure future projects are evidence-based, financially viable, and aligned with local student demand. 2025 also saw positive outcomes from targeted student supports.  The Student Accommodation Assistance Scheme, funded through Dormant Accounts, continued to support Traveller, Roma, and care-experienced students to access and remain in higher education. In the 2024/25 academic year, 29 students graduated, including two who progressed to Master’s programmes, while 47 students continued on their courses. These outcomes underline the tangible impact of targeted accommodation support on student retention, progression, and success.  The Student Accommodation Strategy (2025- 2035) will be brought to Government in the coming weeks, The strategy sets out a clear vision to improve access to higher education by addressing accommodation affordability and viability. Through targeted student supports and accelerated delivery of purpose-built student accommodation, it removes barriers to participation, supports student aspirations, and strengthens Ireland’s knowledge economy. Collaboration with higher education institutions, developers, and Government partners will enable a sustainable, inclusive approach that supports long-term economic growth. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 781. Deputy Seán Ó Fearghaíl asked the Minister for Further and Higher Education, Research, Innovation and Science the measures taken to support and expand student accommodation during 2025; his priorities for 2026; and if he will make a statement on the matter. [73566/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_747",
          "debateSectionId": "dbsect_747",
          "showAs": "Further and Higher Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_747.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_781",
        "questionNumber": 781
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  My Department remains firmly committed to expanding apprenticeship opportunities as a central part of Ireland’s skills strategy. The Government invested €79 million through Budget 2026, bringing the total apprenticeship budget to over €410 million, more than double the level in 2020. In addition, I recently announced €20.5 million to fund the delivery of 99 craft training blocks and 8 consortium-led equipment projects, creating almost 1,600 additional apprenticeship places, many in construction-related trades.  The range of programmes has grown significantly, increasing from 54 in 2020 to 78 by the end of 2025. These now include areas such as Digital Marketing, Wind Turbine Maintenance, and Advanced Manufacturing Engineering. In October, I launched the Level 8 Accounting Technologist apprenticeship alongside the Taoiseach, the Tánaiste, Minister Lawless, and the Minister for the Economy in Northern Ireland. This is the first apprenticeship developed on an all-island basis, and it was designed specifically to respond to the impact of digitisation on the accounting profession. Building on this progress, next year I will launch the Action Plan for Apprenticeship 2026–2030, setting a target to increase annual apprentice registrations from 9,352 in 2024 to 12,500 by 2030, with two-thirds in craft and construction-related areas. My department will also continue to promote the value and visibility of apprenticeships through initiatives such as WorldSkills Ireland and the annual Apprentice of the Year and Apprentice Employer of the Year awards. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 782. Deputy Seán Ó Fearghaíl asked the Minister for Further and Higher Education, Research, Innovation and Science the measures taken to enhance and expand apprenticeships during 2025; his priorities for 2026; and if he will make a statement on the matter. [73567/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_748",
          "debateSectionId": "dbsect_748",
          "showAs": "Further and Higher Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_748.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_782",
        "questionNumber": 782
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  In 2025, I continued to realise the ambitions laid out in the Programme for Government and the Impact 2030 Strategy, with a view to securing Ireland’s future prosperity, our wellbeing and our ability to compete globally as a small, advanced knowledge-based economy. This year we made significant progress towards acquiring a new national high-performance supercomputer, CASPIr, to be hosted by the University of Galway. 2026 will see the acquisition of this new national research resource. Once operational, CASPIr will benefit stakeholders across the broad spectrum of Ireland’s research and innovation ecosystem. In June, I signed the European Quantum Pact, joining other EU Member States in committing to the development of a world-class quantum technology ecosystem. This complements Ireland’s existing national strategy, Quantum 2030, which recognises the importance of fundamental research in quantum science and technology, talent development, international engagement and industry developments. An expert group, drawn from academia, industry, and the public sector has been established to implement Ireland’s quantum strategy.  In 2026, my Department will coordinate and support Ireland’s quantum technology initiatives in alignment with Europe’s growing quantum technology ecosystem. October saw the finalisation of a significant piece of work which saw Ireland join CERN as an Associate Member State, providing opportunity for our research community and Irish enterprises to access contracts and engage in knowledge transfer activity with this world leading research and engineering site. In November, I announced funding of over €3.5 million for 16 research projects under Research Ireland’s COALESCE (Collaborative Alliances for Societal Challenges) programme. This supports excellent, interdisciplinary research that addresses national and global societal challenges by fostering collaboration between researchers and policymakers, civil society, and enterprise. Also in November, I announced €34.5 million in funding for Research Ireland’s Frontiers for the Future Programme. This supports 39 cutting-edge research projects spanning 12 research institutions, investing in cutting-edge, curiosity-driven research and empowering individual researchers in the exploration of high-risk, high-reward ideas.  This year the programme was co-funded by the Children’s Health Foundation, Breakthrough Cancer Research, and the Sustainable Energy Authority of Ireland and will be supporting 66 PhD students, 47 postdoctoral researchers, and 13 other research positions.Three new Research Ireland Accelerating Research to Commercialisation (ARC) Hubs were launched this year – the ARC Hub for Therapeutics (led by TCD), the ARC Hub for ICT (led by TUD) and the ARC Hub for HealthTech (led by University of Galway). These are supported by €98m co-funded by the Government of Ireland and the European Union under two European Regional Development Fund (ERDF) Programmes - the Southern, Eastern and Midland Regional Programme 2021-2027 and the Northern and Western Regional Programme 2021-2027. The ARC Hubs drive regional development by accelerating novel, cutting-edge research, towards commercial impact readiness, in areas aligned with Ireland’s Smart Specialisation Strategy for Innovation 2022-2027 and respective regional strategic priorities.  In December, I was proud to launch INSPIRE, a transformative €750 million investment in research infrastructure equipment – the largest in the history of the State. This programme will deliver cutting-edge equipment to our universities and attract world-class talent, cementing Ireland’s position as a global leader in research and innovation. Backed by the recent €4.55 billion capital allocation to my Department under the National Development Plan, INSPIRE will invest €750 million between 2026 and 2031, starting with €100 million in 2026, aligned with priorities such as competitiveness, digitalisation, and decarbonisation. Launched in September, the Action Plan for Competitiveness and Productivity recognises the centrality of research and innovation to Ireland's future economic performance.  My Department together with its agencies, Taighde Éireann – Research Ireland and the Higher Education Authority (HEA), are working with the higher education institutions and Enterprise Ireland to ensure that commercialisation opportunities for researchers are valued and incentivised in terms of academic progression. Ireland’s competitiveness depends on our ability to adapt. In 2026 I will continue to strengthen tertiary education, training, and research to build a sustainable, vibrant society. We want our citizens to be provided with the education that they need to succeed in today's world, and that is why we are aligning our skills offering with modern needs to ensure Ireland remains competitive in a rapidly evolving world.  The National Training Fund is central to this mission and enables us to invest in upskilling, reskilling, and lifelong learning to meet the demands of digitalisation, technological change, and the green transition. Through the Further Education and Training sector, we deliver flexible, industry-aligned micro-qualifications that respond quickly to emerging needs. The legislation to unlock the National Training Fund to enable this provision is nearing completion, and this work will continue across next year.Technology and labour markets are evolving rapidly. Government, through partnerships like the National Skills Council and Regional Skills Fora, is committed to ensuring access to high-quality learning for all. Guided by real-time insights from enterprise, we will continue driving this agenda because skills are the foundation of growth.  Through the continued implementation of Impact 2030: Ireland's Research and Innovation Strategy, we are strengthening our national research system to drive excellence and foster innovation. This whole-of-government approach is enhancing Ireland’s capacity at both researcher and institutional levels, through targeted actions on infrastructure, skills development and career pathways. These measures will assist researchers to conduct, manage, disseminate and apply their work more effectively. Impact 2030 also emphasises the vital role of talent and diversity in building and sustaining a dynamic Irish research and innovation ecosystem.  Earlier this year, through Taighde Éireann – Research Ireland, I was pleased to launch the Global Talent Ireland initiative. This capacity building measure is designed to bring the brightest minds from around the world to our universities and public research bodies. The programme will begin with a preliminary budget of €8 million per year and will be complementary to our broader commitment under Impact 2030 to strengthen and support Irish research and innovation, in this increasingly competitive global landscape.These strategic investments reflect Government’s unwavering commitment to talent, innovation, and opportunity, ensuring Ireland thrives in the decades ahead. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 783. Deputy Seán Ó Fearghaíl asked the Minister for Further and Higher Education, Research, Innovation and Science the measures taken to boost Ireland’s research capacity during 2025; his priorities for 2026; and if he will make a statement on the matter. [73568/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_749",
          "debateSectionId": "dbsect_749",
          "showAs": "Further and Higher Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_749.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_783",
        "questionNumber": 783
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  I am conscious of financial challenges facing students and the need for the progressive implementation of measures to address costs as a barrier to education. It is a priority for me to explore the most effective and sustainable ways to support students in managing the cost of education. I also recognise that costs are not limited to fees. Students encounter additional expenses such as fuel, food, and accommodation, as well as specific course-related costs like books and materials.  Financial supports, such as the Free Fees Initiative and the SUSI student grant scheme are critical to supporting learners. In recent Budgets we have made significant improvements to the support framework. This has included restoration of SUSI Postgraduate supports and a new Part-Time Fee Scheme for Specified Undergraduate Courses. Students this academic year are also benefiting from the Budget 2025 decision to increase all income thresholds to avail of a student grant including increasing all standard rate thresholds by at least 15%.We have made further improvements in Budget 2026. For this academic year I have permanently reduced the Student Contribution charge by €500. This is the first such reduction since the scheme's introduction in 1995. It is expected to benefit around 108,000 undergraduate students with a further 14,000 apprentices benefitting from a 17% pro-rata reduction in their fees.  Other Budget 2026 SUSI measures include:  • An increase in the income threshold for the €500 student contribution grant form €115,000 to €120,000 from next year;  • Increases of €200–€430 in the maintenance grant rates; and  • A €500 increase in the postgraduate fee grant.  These changes are meaningful steps toward a fairer, more affordable system.I am conscious that not all students may avail of fee or grant supports. Last week, I announced that there will be €19.35m available under the Student Assistance Fund in the 2025/26 academic year. The funding includes €9.1m in core funding and additional funding of over €10.2m. This funding will benefit the most vulnerable students, who may be struggling with financial costs associated with attending college. Looking ahead to future Budget decisions, I will continue to consider all options available to me to reduce the cost of education for students and their families. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 784. Deputy Seán Ó Fearghaíl asked the Minister for Further and Higher Education, Research, Innovation and Science the measures taken to make higher education more affordable during 2025; his priorities for 2026; and if he will make a statement on the matter. [73569/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_750",
          "debateSectionId": "dbsect_750",
          "showAs": "Further and Higher Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_750.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_784",
        "questionNumber": 784
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  Protecting our environment remains a key priority for the Government. My Department is responsible for setting the policy and legislative framework within which the key environmental regulators, including the Environmental Protection Agency and the local authorities, discharge their functions.  The EPA noted in the 2025 Industrial and Waste Licence Enforcement Summary Report (www.epa.ie/publications/compliance--enforcement/licensees/performance/FINAL-2024-EPA-Industrial-Waste-Licence-Enforcement-Summary-Report.pdf) that 1,309 inspections of industrial and waste facilities were carried out in the previous year and that 96% of such inspections which were unannounced.  The Environment (Miscellaneous Provisions) Bill 2025 was published in August 2025 and has completed Dáil Éireann, Third Stage. The proposals in the Bill aim to facilitate:  • the timely development of critical infrastructure in the energy sector, which will facilitate the transition to renewables;  • the deployment of better emissions abatement and other progressive environmental protection technologies which require amendments to licences; and  • securing of investment in infrastructure (including circular economy infrastructure) which will in turn stimulate significant sustainable economic activity within a well-regulated environmental licensing regime.  The EPA also noted in the Local Authority Environmental Enforcement Performance Report 2024 (www.epa.ie/publications/compliance--enforcement/public-authorities/Local-Authority-Environmental-Enforcement-Performance-Report-2024.pdf) that local authorities improved their environmental enforcement performance by 20% over the past three years, with 79% of the National Enforcement Priority (NEP) assessments meeting the required standard in 2024.  A key priority for 2026 is the progression of the Environment (Miscellaneous Provisions) Bill 2025 and the development of the supporting secondary legislation as well as the transposition of the revised Industrial Emissions Directive.  In relation to air quality, the 2025 progress report on the implementation of Ireland’s Clean Air Strategy noted that Ireland is compliant with all current EU ambient air quality standards and that Ireland came back into compliance with the National Emissions Reduction Commitment Directive (NECD) during 2023. The Air Pollution (Amendment) Bill was published in July 2025 and has completed Seanad Éireann, Second Stage. This Bill aims to further support enforcement action by the local authorities to protect our air quality and improve the registration and compliance systems in relation to the commercial sale and supply of solid fuels. As Minister, my priorities for 2026 include: progressing the Air Pollution (Amendment) Bill 2025 and the development of the supporting secondary legislation; transposing the revised EU Ambient Air Quality Directive; and accelerating pollutant emissions reductions through the further implementation of the Clean Air Strategy.  In relation to the circular economy, the Deposit and Return Scheme has collected over 2 billion containers since its introduction in February 2024, achieving an average return rate of 76%. Circular economy priorities for 2026 include:  • Transposition and implementation of EU circular economy legislation applying to textiles, packaging, batteries, plastic pellets and end of life vehicles.  • Supporting further progress in establishing Ireland’s Deposit and Return Scheme.  • Supporting the installation of a further 84 public drinking water fountains.  • Ensuring the efficient and effective delivery of producer responsibility obligations under EU and national law for the following material streams: packaging, batteries, waste electronic and electrical equipment, tyres, end-of-life vehicles, farm plastics, items containing plastics such as tobacco products and fishing gear. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 110. Deputy Seán Ó Fearghaíl asked the Minister for Climate, Energy and the Environment the key measures taken to enhance environmental protection during 2025; his priorities for 2026; and if he will make a statement on the matter. [73128/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_108",
          "debateSectionId": "dbsect_108",
          "showAs": "Environmental Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_108.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_110",
        "questionNumber": 110
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  This Government is committed to delivering measures and actions to achieve Ireland’s national and EU targets and ultimately climate neutrality by 2050. The Environmental Protection Agency's recent reporting confirms that Ireland’s overall GHG emissions reduced for a third consecutive year, and are now at their lowest level in 35 years.  Under the Climate Action Plan 2025 (CAP), and previous CAPs, there is an extensive programme of policies and measures that aim to achieve significant progress towards emission reductions with notable progress as follows:  • Ireland currently has 7.7 GW of renewable generation capacity. New records were broken in 2025 as Ireland reached 7 GW of renewable generation, 5 GW of wind generation, and 2 GW of solar PV generation for the first time. Renewables provided 41.1% of our electricity demand in 2024.  • On solar, 155,000 homes received grants to install rooftop solar, and free solar panels have been provided to 2,000 schools across Ireland to date.  • To end November this year, over 52,416 upgrades have been completed across SEAI’s residential and community energy upgrade schemes representing sustained and significant increases on the same period in each year since 2020.  • Private wires legislation is advancing to facilitate private sector investment in the grid and in renewable energy.  In 2026, progress will continue supported by:  • The Offshore Wind Delivery Taskforce (OWDT), led by me as Minister and including 16 Government Departments and State Agencies, will work together to deliver our offshore ambitions.  • Extensive grid investment overseen by the CRU, projected at almost €19 billion for the 2026-2030 period, will support the renewables led energy transformation.  • Budget 2026 includes a record capital allocation of €558 million from carbon tax revenue for the SEAI residential and community energy upgrade schemes. This is an €89 million increase on the corresponding Budget 2025 allocation. This funding is expected to be further supplemented with additional funding from the European Regional Development Fund (ERDF).  • The governance arrangements for the Climate Action Plan Programme Board will continue to be strengthened. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 111. Deputy Seán Ó Fearghaíl asked the Minister for Climate, Energy and the Environment the key measures taken on climate action during 2025; his priorities for 2026; and if he will make a statement on the matter. [73129/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_109",
          "debateSectionId": "dbsect_109",
          "showAs": "Climate Action Plan",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_109.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_111",
        "questionNumber": 111
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  The key measures which have been taken to enhance energy security and production capacity during 2025 as well as actions for each year up to 2030 are outlined in the Energy Security in Ireland to 2030 report which  was published in November 2023.  This report outlines a strategy to ensure energy security in Ireland for this decade, while also ensuring a sustainable transition to a carbon neutral energy system by 2050.  The report was published as part of an Energy Security Package, containing a range of supplementary analyses, consultations, and reviews, which have informed the recommendations and actions related to energy security.  The 28 actions outlined in Energy Security in Ireland to 2030 are overseen by the Energy Security Group (ESG), which is chaired by the Secretary General of my Department and attended by officials from relevant Government Departments and Agencies. My priority for 2026 is to see all outstanding actions progressed and timelines adhered to.  The table at the link below provides an update of the actions to end Q3 2025.   Actions on Energy Security  ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 112. Deputy Seán Ó Fearghaíl asked the Minister for Climate, Energy and the Environment the key measures taken on enhance energy security and production capacity during 2025; his priorities for 2026; and if he will make a statement on the matter. [73130/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Ó-Fearghaíl.S.2000-06-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Ó-Fearghaíl.S.2000-06-09",
          "showAs": "Seán Ó Fearghaíl"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_110",
          "debateSectionId": "dbsect_110",
          "showAs": "Energy Production",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_110.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_112",
        "questionNumber": 112
      },
      "contextDate": "2025-12-17"
    }
  ]
}