{
  "head": {
    "counts": {
      "questionCount": 160,
      "resultCount": 160
    }
  },
  "results": [
    {
      "contextDate": "2010-11-04",
      "question": {
        "answerText": " Minister for Agriculture, Fisheries and Food (Deputy Brendan Smith)  The annual consultations between EU and Norway  on a bilateral  fisheries agreement for 2011 will commence on 15 November 2010.  At the last Fisheries Council meeting,  held  on 26 October 2010 in Luxembourg, the fisheries agenda item of particular importance for Ireland was the discussion regarding these negotiations between the EU and Norway on a bilateral fisheries agreement for 2011.  These negotiations are held annually,  whereby  Norway and the Community routinely swap fishing opportunities in each others waters as part of the agreement each year.  As Ireland receives very limited fishing opportunities from the fish stocks received from Norway, our main interest relates to eliminating or, as a minimum, reducing to the lowest possible level the transfers to Norway from stocks in Western Waters which we fish.  In the past a significant share of the blue whiting stock in Western Waters, in which Ireland has a share, has formed part of the transfers to Norway.  Ireland has consistently opposed what has to date been an unfair and inequitable process which results in a Member State, like Ireland which does not benefit, paying for the fishing opportunities of other Member States.  At the Fisheries Council, Minister Connick reminded the Commissioner and  his fellow Ministers of the Commissions statement from last Decembers Fisheries Council which provides that  \" Bearing in mind that Member States benefit to a different degree from the exchange of fishing opportunities with Norway, the Commission  shall endeavour to ensure that the costs and benefits for individual Member States of the annual arrangements with Norway should be as balanced as possible.” Minister Connick strongly defended Ireland’s position, opposing the transfer of these fish quotas to Norway to pay for cod and other stocks which do not benefit Ireland.  In particular the Minister made it abundantly clear that  Ireland will totally oppose any moves to include stocks that the Irish fleet fishes in the waters off the west coast, such as horse mackerel and mackerel, in the balance.  It is very clear that there will be a major problem balancing the quota exchanges in any EU-Norway agreement this year especially as the TAC for blue whiting which was used to partly meet the balance in the transfers has been cut  by some 90%.   Ireland has called on the Commission to bring forward a new framework whereby Member States that want to avail of the Cod being offered by Norway can contribute to a communal EU pool of quotas to be exchanged with Norway.  In this way those Member States that want the cod can avail of it, but not to the detriment of Member States who do not benefit.  Minister Connick will be keeping in close contact with the negotiations and will be working to deliver an agreement  which will protect the fishing opportunities for our fishermen in 2011. ",
        "by": {
          "memberCode": "Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06"
        },
        "to": {
          "showAs": "Minister for Agriculture, Fisheries and Food",
          "uri": null,
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2010-11-04",
        "house": {
          "houseNo": "30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "30th Dáil"
        },
        "debateSection": {
          "showAs": "Fishing Industry Development",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2010-11-04/writtens/dbsect_65",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2010-11-04/writtens/mul@/dbsect_65.xml"
            }
          },
          "debateSectionId": "dbsect_65"
        },
        "showAs": " 32 Deputy Niall Blaney asked the Minister for Agriculture, Fisheries and Food his views regarding the possible transfer of fish quotas to Norway; and if he will make a statement on the matter. \n        [40763/10] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2010-11-04/pq_32",
        "questionNumber": 32
      }
    },
    {
      "contextDate": "2010-11-04",
      "question": {
        "answerText": " Minister for Agriculture, Fisheries and Food (Deputy Brendan Smith)  At the last Fisheries Council meeting, held  on 26 October 2010 in Luxembourg, the fisheries agenda item of particular importance for Ireland was the discussion regarding the upcoming negotiations between the EU and Norway on a bilateral fisheries agreement for 2011.  These negotiations are held annually, and Norway and the Community routinely swap fishing opportunities in each others waters as part of the agreement each year.  As Ireland receives very limited fishing opportunities from the fish stocks received from Norway, our main interest relates to eliminating or, as a minimum, reducing to the lowest possible level the transfers to Norway from stocks in Western Waters which we fish.  In the past a significant share of the blue whiting stock in Western Waters, in which Ireland has a share, has formed part of the transfers to Norway.  Ireland has consistently opposed what has to date been an unfair and inequitable process which results in a Member State, like Ireland which does not benefit, paying for the fishing opportunities of other Member States.  At the Council, Minister Connick reminded the Commissioner and  his fellow Ministers of the Commissions statement from last Decembers Fisheries Council which provides that: \"Bearing in mind that Member States benefit to a different degree from the exchange of fishing opportunities with Norway, the Commission shall endeavour to ensure that the costs and benefits for individual Member States of the annual arrangements with Norway should be as balanced as possible.\"  Minister Connick strongly defended Ireland's position, opposing the transfer of these fish quotas to Norway to pay for cod and other stocks which do not benefit Ireland.  In particular the Minister made it abundantly clear that  Ireland will totally oppose any moves to include stocks that the Irish fleet fishes in the waters off the west coast, such as horse mackerel and mackerel, in the balance.  It is very clear that there will be a major problem balancing the quota exchanges in any EU-Norway agreement this year especially as the TAC for blue whiting which was used to partly meet the balance in the transfers has been cut  by some 90%.  Ireland has called on the Commission to bring forward a new framework whereby Member States that want to avail of the Cod being offered by Norway can contribute to a communal EU pool of quotas to be exchanged with Norway.  In this way those Member States that want the Cod can avail of it, but not to the detriment of Member States who do not benefit.  On a side topic, Minister Connick also referred to the ongoing negotiations between the EU, Norway, the Faroe Islands and Iceland on arrangements for the management of the mackerel stock which is so important economically to Ireland.  The Minister restated Ireland's support of the Commission's efforts to bring about an agreement but not at any cost. ",
        "by": {
          "memberCode": "Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06"
        },
        "to": {
          "showAs": "Minister for Agriculture, Fisheries and Food",
          "uri": null,
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2010-11-04",
        "house": {
          "houseNo": "30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "30th Dáil"
        },
        "debateSection": {
          "showAs": "EU Council Meetings",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2010-11-04/writtens/dbsect_85",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2010-11-04/writtens/mul@/dbsect_85.xml"
            }
          },
          "debateSectionId": "dbsect_85"
        },
        "showAs": " 53 Deputy Niall Blaney asked the Minister for Agriculture, Fisheries and Food the outcome of the recent EU Fisheries Council; and if he will make a statement on the matter. \n        [40764/10] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2010-11-04/pq_56",
        "questionNumber": 56
      }
    },
    {
      "contextDate": "2010-06-22",
      "question": {
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2010-06-22/writtens/dbsect_117",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2010-06-22/writtens/mul@/dbsect_117.xml"
            },
            "pdf": null
          },
          "showAs": "Tax Code",
          "debateSectionId": "dbsect_117"
        },
        "house": {
          "committeeCode": "",
          "houseNo": "30",
          "showAs": "30th Dáil",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "houseCode": "dail"
        },
        "date": "2010-06-22",
        "by": {
          "memberCode": "Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2010-06-22/pq_121",
        "answerText": " Minister for Finance (Deputy Brian Lenihan)  I announced in the Budget that a carbon tax at a rate of €15 per tonne is being introduced on fossil fuels. The tax was applied to petrol and auto-diesel with effect from midnight, 9 December 2009; and applied from 1 May 2010 to kerosene, marked gas oil (also known as ‘green diesel' or ‘agricultural diesel'), liquid petroleum gas (LPG), fuel oil and natural gas. The application of the tax to coal and commercial peat is subject to a Commencement Order.  Solid fuels as indicated above are subject to a commencement order; this is to allow time for issues such as fuel poverty and the sourcing of coal of a lower environmental standard from Northern Ireland to be addressed.  A number of Government Departments, including the Department of Finance are exploring options for how best to offset the impact of the carbon tax on low-income households.  With regard to the sourcing of coal from Northern Ireland, work has already commenced on this matter within the Department of Environment, Heritage and Local Government. In addition, the Department of Environment, my Department and the Revenue Commissioners have met with the Solid Fuel Trade Group in this regard. ",
        "questionNumber": 121,
        "showAs": " 145 Deputy Niall Blaney asked the Minister for Finance the progress of work in relation to carbon tax on solid fuels, that is, coal and commercial peat; and if he will make a statement on the matter. \n        [26233/10] ",
        "to": {
          "uri": null,
          "showAs": "Minister for Finance",
          "roleType": null,
          "roleCode": null
        }
      }
    },
    {
      "question": {
        "questionType": "oral",
        "showAs": " 34 Deputy Niall Blaney asked the Minister for Agriculture; Fisheries and Food his views on whether decoupled direct payments remain the best way of underpinning the incomes of small family farms; and if he will make a statement on the matter. \n        [21856/10] ",
        "debateSection": {
          "debateSectionId": "dbsect_27",
          "showAs": "Common Agricultural Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2010-05-26/debate/dbsect_27",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2010-05-26/debate/mul@/dbsect_27.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2010-05-26/pq_22",
        "questionNumber": 22,
        "answerText": " Deputy Brendan Smith  At a recent special debate in the Seanad on the future of the CAP post-2013, I set out some of my views on the need to ensure security of food supply and to maintain family farming in Europe.  It must be borne in mind that negotiations on the future on the CAP post-2013 are taking place against the background of an EU budget review and a new EU financial perspective for the period 2014 to 2020.  Ireland will play a central and very active role in these negotiations and will be stressing the importance of a strong and properly resourced CAP in the future.  The major issue at present is the amount of funding that will be available for the CAP after 2013, which in turn will put pressure on the share of the EU budget going to agriculture and the share going to Irish agriculture.  With regard to the single farm payment system, I do not see any compelling reason to change from the current historic model for determining single payments.  The historical model has a distinct advantage in linking the payment with the level of farming activity, albeit farming activity in 2000 to 2002.  I have made my views on the benefits of the historic model clear at meetings of the Council of Ministers and in bilateral discussions with other member states and the Commission.  However, Ireland is in a small minority of member states who take this view while I am prepared to look at alternatives, particularly if other countries move from the historic camp.  There is a need, however, to find a basis that is acceptable and fair to all member states and one which meets our objectives of improved competitiveness and sustainability.  I consider that maintaining a strong decoupled direct payments system is fundamental to maintaining and stabilising farm incomes, especially at times of increased market volatility.  Direct payments remain the best way of underpinning the incomes of small family farms, while allowing them respond to market opportunities.  However, there is also a need to retain the capacity and flexibility to react promptly and effectively to market instability and price volatility and therefore to maintain some level of market supports.  The core purpose of rural development policy is to support farmers in developing their productive capacity while securing the environment and ensuring the well-being of the wider rural society.  The continuation of a two-pillar system includes the recently revised rural development programme which focuses on competitiveness in the form of targeted investments and sustainability in the form of an agri-environment scheme with benefits for all. \n Deputy Niall Blaney  I thank the Minister for his reply.  What timeframe does he envisage for the current CAP negotiations?  I ask him to outline Ireland's role in those discussions.  What are the main issues in these negotiations? \n Deputy Brendan Smith  With regard to timing, the Commission is expected to issue a formal communication later this year.  Prior to the formation of the new Commission, it was expected during the time of Commissioner Mariann Fischer Boel that the communication would issue in the middle of this year.  However, the Commission was delayed in being established by a number of months.  It was expected to take office in the middle of November but it took office on 15 February, therefore, the timeline has been delayed by a few months.  Therefore, we are talking about having a formal communication from the Commission later this year.  The formal legal text will follow in mid-2011.  Based on previous negotiations, we can be certain that those communications will not be issued in advance of the expected deadlines.  They generally run much later.  With regard to the discussions to date, the last four EU Presidencies have held policy debates on the future of the Common Agricultural Policy.  France had a general discussion in September 2008 on policy orientation.  The Czech Republic focused on the single payment issues, while Sweden dealt with rural development.  Meanwhile, Spain — the current holders of the Presidency, up to the end of June — dealt with market management.  Ireland has been active in all the negotiations.  In mid-December 2009, we were one of the leading members in putting together a group of 22 member states who signed a declaration in Paris.  At that time, we outlined our determination to ensure that the CAP would be adequately resourced.  In the meantime, I have had several bilateral discussions with other agriculture Ministers.  There will be an important official meeting to discuss those issues in my Department tomorrow, featuring the most senior civil servants from five member states. \n Deputy Michael Creed  The Minister will be aware that 90,000 farmers in Ireland receive a payment of €10,000 or less.  For example, last year, the average beef income was approximately €13,000.  Therefore, about 75% of income is coming from the single farm payment. \n An Leas-Cheann Comhairle  The Deputy is supposed to be asking the question, not answering it. \n Deputy Michael Creed  In that context, has the Minister given any thought to establishing a minimum payment?  The Commissioner's view is that the historical model is unsustainable, which suggests that we at least need to tweak, modify or change the current model in some way.  Does the Minister support the principle of a minimum payment to retain as many farmers as possible on the land?  What is his view on that? \n Deputy Brendan Smith  I share the view that we should be supporting active farmers.  Whatever about drawing a minimum, I know where I would draw a maximum line.  I am not going to say where, however. \n Deputy Michael Creed  The Minister cannot tease us like that. \n Deputy Brendan Smith  I said we would have discussions in regard to models that we have done, so we will let the Deputy in on some of the thinking.  However, there are always calls to public representatives' offices when the figures are published, which include some people with very large payments.  I believe there should be a cut-off point and it should be directed more towards active farmers.  There is a good case to be made for orienting it towards the lower-income farmer. \n Deputy Seán Sherlock  Earlier, the Minister referred to the consultation process and said that the Commission will publish documentation.  Can Members of this House be provided with an insight into the views of the Irish permanent representation in Brussels?  In that way we could be made aware of how the process is progressing. \n Deputy Brendan Smith  There is absolutely no problem with that.  The Irish permanent representation in Brussels will be echoing our views.  On both ministerial and official level, the Department has ongoing contacts, including dialogue and briefings, with MEPs of all parties on a weekly basis.  In addition, there is interaction between our MEPs and our permanent representatives in Brussels.  I understand that our officials provide useful material to all MEPs concerning debates in the European Parliament.  That material is readily available. \n Deputy Seymour Crawford  Does the Minister accept that without the single payment area aid, farmers in constituencies such as ours would have little income, if any?  This is an extremely serious issue.  The Minister said he has met other EU Ministers for agriculture, but will he make every effort to form a group to guarantee the single premium, rather than some other funding that would not be as beneficial to Irish farmers? \n Deputy Brendan Smith  As I said earlier in response to Deputy Blaney's question, Ireland was one of the very active members in putting this particular group together, along with France, Germany and Austria.  Last December, we got 22 of the 27 member states to sign up to the need for proper CAP resources.  Within that group of 22 not everyone shares the same view on the direct payments system, but we are working on this with a number of countries.  I mentioned earlier that an official meeting is taking place tomorrow, in which I will be participating.  Apart from Council of Ministers meetings, I have had numerous bilateral meetings with other Ministers.  Such meetings will continue in June, as well as in July when the Dáil is in recess. \n Deputy Seymour Crawford  The Minister will not get all of it. \n Deputy Brendan Smith  Neither will the Deputy, but he should. ",
        "date": "2010-05-26",
        "to": {
          "roleCode": null,
          "roleType": null,
          "showAs": "Minister for Agriculture, Fisheries and Food",
          "uri": null
        },
        "house": {
          "chamberType": "house",
          "houseNo": "30",
          "showAs": "30th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30"
        },
        "by": {
          "showAs": "Niall Blaney",
          "memberCode": "Niall-Blaney.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06"
        }
      },
      "contextDate": "2010-05-26"
    },
    {
      "question": {
        "questionType": "written",
        "showAs": " 61 Deputy Niall Blaney asked the Minister for Agriculture, Fisheries and Food his views on whether there is a compelling case to change the current historical model of determining single payments; and if he will make a statement on the matter. \n        [21855/10] ",
        "debateSection": {
          "debateSectionId": "dbsect_67",
          "showAs": "Single Payment Scheme",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2010-05-26/writtens/dbsect_67",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2010-05-26/writtens/mul@/dbsect_67.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2010-05-26/pq_50",
        "questionNumber": 50,
        "answerText": " Minister for Agriculture, Fisheries and Food (Deputy Brendan Smith)  My starting point is that I see no compelling reason to change from the current historical model for determining single payments.  I believe that the historical model has a distinct advantage in linking the payment with level of farming activity, albeit activity in 2000-2002. I have made my views on the benefits of the historic model clear at meetings of the Council of Ministers and in bilateral discussions with other member states and the Commission.  That having been said, it would appear that Ireland is in a very small minority of Member States that hold this view.  Many of our partners in Europe are now questioning the credibility of this system for determining direct payments.   We need, therefore, to be open to looking at alternative models that might command the support of a larger number of Member States, but would be beneficial to Ireland.   While I am prepared to look at the alternatives, particularly if other countries move from the \"historic camp\", there is a need to find a basis that is acceptable and fair to all Member States and that meets Irish objectives of improved competitiveness and sustainability.  There are no concrete proposals as yet on this matter but it is clear that most Member States, including ourselves, are carrying out analysis to determine which system might suit us best.  From our analysis so far, we know that Ireland would lose out under a simple EU-wide flat rate by nearly 20%, based on current EU SPS funding levels.  We also know that movement to a regional or national flat rate in Ireland, based on our current national envelope, would broadly have the effect of shifting funding from farmers in the east to the west and from cattle fattening and tillage farms to cattle rearing and sheep farms with little change on dairy farms.  It is clear that there is a long way to go in this debate.  I will be seeking to have the option to maintain our current system and, failing that, to ensure that there is a fair and equitable division of funds that supports family farm incomes in Ireland and allows our farmers to get on with the business of farming. ",
        "date": "2010-05-26",
        "to": {
          "roleCode": null,
          "roleType": null,
          "showAs": "Minister for Agriculture, Fisheries and Food",
          "uri": null
        },
        "house": {
          "chamberType": "house",
          "houseNo": "30",
          "showAs": "30th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30"
        },
        "by": {
          "showAs": "Niall Blaney",
          "memberCode": "Niall-Blaney.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06"
        }
      },
      "contextDate": "2010-05-26"
    },
    {
      "question": {
        "to": {
          "roleType": null,
          "showAs": "Minister for Agriculture, Fisheries and Food",
          "uri": null,
          "roleCode": null
        },
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "houseNo": "30",
          "showAs": "30th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "committeeCode": ""
        },
        "answerText": " Minister for Agriculture, Fisheries and Food (Deputy Brendan Smith)  As part of proposals in relation to the use of unspent Single Payment Scheme and Modulation funds and the European Economic Recovery Programme, I announced in 2009 that, subject to the receipt of EU Commission approval, I intended to introduce support for a number of specific categories of farmers which would be focused on supporting productive investment.   The measures include:  A scheme for dairy farmers to make the necessary investment to adjust to expanding dairy opportunities and promote the operation of cost-effective commercial operations;  Aid for sheep fencing and handling facilities to assist sheep farmers in reducing labour input in a vulnerable sector;  Aid for farmers for water harvesting and conservation equipment, which will reduce water costs on farms;  Animal welfare grants (a) for pig producers to assist in the conversion to loose housing for sows; and (b) for poultry producers to assist in the conversion to enriched cages, free range or barn systems.  EU Commission approval for the above-mentioned schemes has recently been received and, due to the relatively short time-frames for completion of the investment works concerned, my priority is to introduce the Sow Welfare and Poultry Welfare Schemes first.   Arrangements will then be made to introduce the three remaining Schemes.  Discussions are ongoing with the relevant farming organizations in regard to the terms and conditions of the Schemes concerned.   These should be completed in the near future and I hope to be in a position to make an announcement regarding the Sow Welfare and Poultry Welfare Schemes at that stage. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2010-04-29/pq_11",
        "date": "2010-04-29",
        "showAs": " 11 Deputy Niall Blaney asked the Minister for Agriculture, Fisheries and Food when he expects to be in a position to announce details of on-farm investment schemes for the pig and poultry sectors; and if he will make a statement on the matter. \n        [16791/10] ",
        "by": {
          "showAs": "Niall Blaney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "memberCode": "Niall-Blaney.D.2002-06-06"
        },
        "questionType": "written",
        "debateSection": {
          "showAs": "On-farm Investment Schemes.",
          "debateSectionId": "dbsect_32",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2010-04-29/writtens/mul@/dbsect_32.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2010-04-29/writtens/dbsect_32"
        },
        "questionNumber": 11
      },
      "contextDate": "2010-04-29"
    },
    {
      "question": {
        "to": {
          "roleType": null,
          "showAs": "Minister for Agriculture, Fisheries and Food",
          "uri": null,
          "roleCode": null
        },
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "houseNo": "30",
          "showAs": "30th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "committeeCode": ""
        },
        "answerText": " Minister for Agriculture, Fisheries and Food (Deputy Brendan Smith)  My Department recently received EU Commission approval for the various targeted on-farm investment schemes announced by my Department in 2009.   Due to the relatively short time-frames for completion of the investment works concerned, my priority is to introduce the Sow Welfare and Poultry Welfare Schemes first.   Arrangements will then be made to introduce the three remaining schemes, including the Sheep Handling/Fencing Scheme.  Discussions are ongoing with the relevant farming organizations in regard to the terms and conditions of the Schemes concerned.  These should be completed in the near future and I hope to be in a position to make an announcement regarding the new Schemes at that stage. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2010-04-29/pq_72",
        "date": "2010-04-29",
        "showAs": " 64 Deputy Niall Blaney asked the Minister for Agriculture, Fisheries and Food when he expects to be in a position to announce details of the various on-farm investment measures, which will be funded by unspent funds from the single payment scheme; and if he will make a statement on the matter. \n        [16790/10] ",
        "by": {
          "showAs": "Niall Blaney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "memberCode": "Niall-Blaney.D.2002-06-06"
        },
        "questionType": "written",
        "debateSection": {
          "showAs": "On-farm Investment Schemes.",
          "debateSectionId": "dbsect_81",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2010-04-29/writtens/mul@/dbsect_81.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2010-04-29/writtens/dbsect_81"
        },
        "questionNumber": 72
      },
      "contextDate": "2010-04-29"
    },
    {
      "contextDate": "2010-03-11",
      "question": {
        "showAs": " 37 Deputy Niall Blaney asked the Minister for Agriculture, Fisheries and Food the negotiating process in relation to the future of the CAP after 2013; and if he will make a statement on the matter. \n        [11857/10] ",
        "to": {
          "roleCode": null,
          "showAs": "Minister for Agriculture, Fisheries and Food",
          "uri": null,
          "roleType": null
        },
        "date": "2010-03-11",
        "house": {
          "houseCode": "dail",
          "houseNo": "30",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "showAs": "30th Dáil"
        },
        "questionNumber": 46,
        "answerText": " Minister for Agriculture, Fisheries and Food (Deputy Brendan Smith)  I propose to take Questions Nos. 37, 67 and 77 together.  Broad discussions on the future of the CAP have been underway since the second half of 2008 when the French Presidency held a first policy debate at the Informal Agriculture Council. Since then, every Presidency has contributed to the debate with the Czech Presidency focusing, in particular, on the issue of direct payments to farmers and the Swedish Presidency on rural development issues. The Spanish Presidency is taking the debate forward with discussions on the role of market management measures.  In addition to these discussions at Council, both I and my officials continue to engage with other Member States and the Commission bilaterally on the future of the CAP. In this regard I met recently with the new Commissioner for Agriculture and Rural Development Dacian Ciolos, and outlined my objectives including the need for a robust and properly funded CAP.  Notwithstanding the discussions to date, concrete proposals have yet to emerge on the shape of EU agriculture policy beyond 2013.  The Commission is expected to bring forward a formal Communication later this year on the future of the CAP, followed by legislative proposals in mid 2011.  A first round of formal negotiations will commence on the Communication, leading possibly to the agreement of Council Conclusions, while the more intense phase of formal negotiations will commence once the legal proposals are tabled.  I launched a consultation process in July last year with stakeholders to obtain their views on what EU agriculture policies would serve Ireland and the EU best in the years to come.  I am very pleased with the responses received.  These responses will help to inform our position in the very important negotiations that lie ahead.  Even though no formal proposals have been tabled a number of issues are already emerging, including:  CAP as a guarantor of food security, income supports and EU family farming and/or a supplier of environmental and other public goods,  Equalisation of payment rates between and within Member States and/or differentiating according to historical uptake, land use, land quality, land value, production costs etc.  Keeping rural development as a pillar of CAP or integration with cohesion policy, and  EU and/or national funding  My overarching view, which I have expressed at meetings of the Council and bilaterally to my Ministerial colleagues, is that we need a strong and adequately resourced CAP after 2013.  This is a point I have pressed strongly in discussions to date and for which there is good support in the Agriculture Council. We must maintain a strong agricultural production base in the European Union in the future to take account of the challenges ahead in meeting increased demands for food.  Any reduction in food production in the EU would be taken up elsewhere, where less efficient production systems exist, and would result in a heavier carbon footprint.   We must also undertake food production and distribution in a manner that is sustainable in all its dimensions — economically, socially and environmentally.  I am realistic about the pressure for redistribution of funds between Member States.  I am prepared to look at all options on this, but I will also require our partners in Europe to be equally realistic in their expectations.  The current debate, which focuses solely on the distribution of direct payments, without any reference to other EU funding, is not balanced.  As regards rural development I support the continuation of the current two-pillar structure . The core purpose of rural development policy is to support farmers in developing their productive capacity while securing the environment and ensuring the well being of the wider rural society. The recent revised RDP from Ireland showed a clear focus on competitiveness in the form of targeted investments and sustainability  in the form of an agri-environment scheme with clear benefits for all.  This points the way forward for that pillar.  I have a particular concern at the notion of co-financing of direct payments.  In current circumstances, this would obviously be unaffordable for Ireland, and also for many other Member States. More fundamentally, it would arguably represent re-nationalisation of the only real common policy of the EU. ",
        "by": {
          "memberCode": "Niall-Blaney.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney"
        },
        "debateSection": {
          "debateSectionId": "dbsect_59",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2010-03-11/writtens/mul@/dbsect_59.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2010-03-11/writtens/dbsect_59",
          "showAs": "Common Agricultural Policy."
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2010-03-11/pq_46",
        "questionType": "written"
      }
    },
    {
      "contextDate": "2010-03-11",
      "question": {
        "showAs": " 77 Deputy Niall Blaney asked the Minister for Agriculture, Fisheries and Food the position regarding the emerging issues in relation to the negotiations of the CAP post-2013; and if he will make a statement on the matter. \n        [11856/10] ",
        "to": {
          "roleCode": null,
          "showAs": "Minister for Agriculture, Fisheries and Food",
          "uri": null,
          "roleType": null
        },
        "date": "2010-03-11",
        "house": {
          "houseCode": "dail",
          "houseNo": "30",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "showAs": "30th Dáil"
        },
        "questionNumber": 48,
        "answerText": " Minister for Agriculture, Fisheries and Food (Deputy Brendan Smith)  I propose to take Questions Nos. 37, 67 and 77 together.  Broad discussions on the future of the CAP have been underway since the second half of 2008 when the French Presidency held a first policy debate at the Informal Agriculture Council. Since then, every Presidency has contributed to the debate with the Czech Presidency focusing, in particular, on the issue of direct payments to farmers and the Swedish Presidency on rural development issues. The Spanish Presidency is taking the debate forward with discussions on the role of market management measures.  In addition to these discussions at Council, both I and my officials continue to engage with other Member States and the Commission bilaterally on the future of the CAP. In this regard I met recently with the new Commissioner for Agriculture and Rural Development Dacian Ciolos, and outlined my objectives including the need for a robust and properly funded CAP.  Notwithstanding the discussions to date, concrete proposals have yet to emerge on the shape of EU agriculture policy beyond 2013.  The Commission is expected to bring forward a formal Communication later this year on the future of the CAP, followed by legislative proposals in mid 2011.  A first round of formal negotiations will commence on the Communication, leading possibly to the agreement of Council Conclusions, while the more intense phase of formal negotiations will commence once the legal proposals are tabled.  I launched a consultation process in July last year with stakeholders to obtain their views on what EU agriculture policies would serve Ireland and the EU best in the years to come.  I am very pleased with the responses received.  These responses will help to inform our position in the very important negotiations that lie ahead.  Even though no formal proposals have been tabled a number of issues are already emerging, including:  CAP as a guarantor of food security, income supports and EU family farming and/or a supplier of environmental and other public goods,  Equalisation of payment rates between and within Member States and/or differentiating according to historical uptake, land use, land quality, land value, production costs etc.  Keeping rural development as a pillar of CAP or integration with cohesion policy, and  EU and/or national funding  My overarching view, which I have expressed at meetings of the Council and bilaterally to my Ministerial colleagues, is that we need a strong and adequately resourced CAP after 2013.  This is a point I have pressed strongly in discussions to date and for which there is good support in the Agriculture Council. We must maintain a strong agricultural production base in the European Union in the future to take account of the challenges ahead in meeting increased demands for food.  Any reduction in food production in the EU would be taken up elsewhere, where less efficient production systems exist, and would result in a heavier carbon footprint.   We must also undertake food production and distribution in a manner that is sustainable in all its dimensions — economically, socially and environmentally.  I am realistic about the pressure for redistribution of funds between Member States.  I am prepared to look at all options on this, but I will also require our partners in Europe to be equally realistic in their expectations.  The current debate, which focuses solely on the distribution of direct payments, without any reference to other EU funding, is not balanced.  As regards rural development I support the continuation of the current two-pillar structure . The core purpose of rural development policy is to support farmers in developing their productive capacity while securing the environment and ensuring the well being of the wider rural society. The recent revised RDP from Ireland showed a clear focus on competitiveness in the form of targeted investments and sustainability  in the form of an agri-environment scheme with clear benefits for all.  This points the way forward for that pillar.  I have a particular concern at the notion of co-financing of direct payments.  In current circumstances, this would obviously be unaffordable for Ireland, and also for many other Member States. More fundamentally, it would arguably represent re-nationalisation of the only real common policy of the EU. ",
        "by": {
          "memberCode": "Niall-Blaney.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney"
        },
        "debateSection": {
          "debateSectionId": "dbsect_59",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2010-03-11/writtens/mul@/dbsect_59.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2010-03-11/writtens/dbsect_59",
          "showAs": "Common Agricultural Policy."
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2010-03-11/pq_48",
        "questionType": "written"
      }
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2010-02-03/pq_244",
        "showAs": " 304 Deputy Niall Blaney asked the Minister for Social and Family Affairs the number of persons that have used the Monetary Advice Budgeting Services in County Donegal in 2009; and if she will make a statement on the matter. \n        [5434/10] ",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney",
          "memberCode": "Niall-Blaney.D.2002-06-06"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2010-02-03/writtens/dbsect_205",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2010-02-03/writtens/mul@/dbsect_205.xml"
            },
            "pdf": null
          },
          "showAs": "Money Advice and Budgeting Service.",
          "debateSectionId": "dbsect_205"
        },
        "house": {
          "showAs": "30th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "chamberType": "house",
          "houseCode": "dail",
          "houseNo": "30"
        },
        "questionNumber": 244,
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Minister for Family",
          "roleType": null
        },
        "date": "2010-02-03",
        "questionType": "written",
        "answerText": " Minister for Social and Family Affairs (Deputy Mary Hanafin)  In the time available it is not possible to provide the information requested. "
      },
      "contextDate": "2010-02-03"
    },
    {
      "question": {
        "debateSection": {
          "debateSectionId": "dbsect_37",
          "showAs": "Fisheries Protection.",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2010-01-27/writtens/dbsect_37",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2010-01-27/writtens/mul@/dbsect_37.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "showAs": " 101 Deputy Niall Blaney asked the Minister for Agriculture, Fisheries and Food if he is satisfied with the outcome of the December 2009 EU Fisheries’ Council; and if he will make a statement on the matter. \n        [3700/10] ",
        "questionNumber": 14,
        "date": "2010-01-27",
        "to": {
          "roleType": null,
          "showAs": "Minister for Agriculture, Fisheries and Food",
          "uri": null,
          "roleCode": null
        },
        "house": {
          "committeeCode": "",
          "houseNo": "30",
          "showAs": "30th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "chamberType": "house"
        },
        "answerText": " Minister for Agriculture, Fisheries and Food (Deputy Brendan Smith)  The package of fish quotas and other conservation measures for 2010 were agreed at the December 2009 Fisheries Council after a marathon 36 hours of intensive negotiations.  Tony Killeen T.D., Minister of State at this Department, represented Ireland at those negotiations.  I welcome the agreement reached and I am satisfied that it provides a balanced and fair outcome for Irish fishermen.  The ongoing disagreement between the EU and Norway in respect of mackerel fishing overshadowed this year's meeting.  It made the job of setting quotas for EU fishermen even more difficult than normal, and Minister Killeen had to fight to ensure that the lack of an EU-Norway agreement did not adversely impact on the Irish mackerel fleet.  There was a real danger that our fleet would be severely limited in terms of the amount of the mackerel it would be permitted to fish.  However, Minister Killeen secured a provisional mackerel quota that allows our fleet to fish up to 65% of last year's quota level in the first months of this year, pending any final agreement being reached with Norway on 2010 fishing opportunities.  He also secured assurances from the Council that any new agreement with Norway will be fairer in balancing the benefits with the costs for Member States.  Ireland has in the past been a net contributor to the agreement, providing more to the transfer of fishing quotas to Norway than it gained from access to fish stocks in Norwegian waters.  In respect of whitefish stocks, Minister Killeen fought the now annual action to ensure that the commitment of Ireland's hard pressed fishermen — the Hague Agreement — was fully honored by my European counterparts.  This was particularly important this year as major reductions in the total allowed catch (TAC) of a number of key fish stocks were proposed by the EU Commission for 2010.  Stocks of cod, haddock and prawns — amongst the most important to the whitefish fleet — were all in line for big reductions.  It was proposed, for instance, to reduce the prawn quota by up to 50%.  Given that prawns are the most important stock for our whitefish fleet, this cut would have had severe consequences for our vessels.  Minister Killeen argued instead that new management measures were needed to ensure the long-term sustainability of this stock.  He successfully gathered support amongst his colleagues in the Council for a plan — originally proposed by the Federation of Irish Fishermen — to implement a seasonal closure off the southwest coast in the summer months when the stock is most vulnerable to over-fishing.  On the basis of this plan, he was able to get the proposed cut in the prawn TAC reduced from 50% to 9%.  This new arrangement delivers effective measures where conservation is required, while still providing a realistic prawn quota where science has shown the stock is healthy.  We achieved a similar result for the haddock fishery.  There, the recommendation was for a 54% cut in the TAC.  We accept a reduction in the catch of haddock off Ireland's northwest coast was necessary, but Minister Killeen effectively argued for a more balanced approach.  This saw the scale of the TAC cut reduced to a more reasonable 25%, along with agreement on a new long-term management plan for the haddock stock.  In addition, the harsh restrictions put in place last year on whitefish fishing off Donegal will be reviewed early this year with the aim of making changes as early as possible.  Although the Commission also proposed a 25% cut in the very important Celtic Sea cod TAC , Minister Killeen secured a rollover of the 2009 TAC to reflect recent catches.  He successfully argued that we need new and better data on the state of this stock, as fishermen say it is in better shape than other cod stocks around the coast.  One of the brighter aspects of the agreement for Irish fishermen was in the TAC increase of 71% for the important Celtic Sea herring stock for 2010.  This is effectively an Irish stock, as we receive the bulk of the quota, and it was nearing collapse two years ago.  However,  fishermen in the southwest, working together with the Marine Institute scientists, developed a long term plan for this stock.  These fishermen had the courage to take the very difficult decisions required to rebuild the stock, and I am delighted that their efforts yielded such positive results.  This is a fine example of how working together and taking strong action can pay dividends .  ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2010-01-27/pq_14",
        "by": {
          "memberCode": "Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06"
        }
      },
      "contextDate": "2010-01-27"
    },
    {
      "question": {
        "debateSection": {
          "debateSectionId": "dbsect_109",
          "showAs": "Fisheries Protection.",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2010-01-27/writtens/dbsect_109",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2010-01-27/writtens/mul@/dbsect_109.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "showAs": " 188 Deputy Niall Blaney asked the Minister for Agriculture, Fisheries and Food the position regarding the restrictions on whitefish fishing off County Donegal, introduced at the December 2008 fisheries council meeting; and if he will make a statement on the matter. \n        [3701/10] ",
        "questionNumber": 101,
        "date": "2010-01-27",
        "to": {
          "roleType": null,
          "showAs": "Minister for Agriculture, Fisheries and Food",
          "uri": null,
          "roleCode": null
        },
        "house": {
          "committeeCode": "",
          "houseNo": "30",
          "showAs": "30th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "chamberType": "house"
        },
        "answerText": " Minister for Agriculture, Fisheries and Food (Deputy Brendan Smith)  A variety of new rules restricting fishing vessels' days at sea in the Irish Sea and the waters to the northwest of Ireland and Scotland were introduced as part of the EU's revised Cod Recovery Plan in December 2008.  The plan introduced a new system of effort management that sets effort ceilings (expressed in kilowatt-days) for groups of vessels or fleet segments. In addition to the restriction on the effort, there is also a restriction in relation to kilowatt capacity and the effect of this is to restrict the kw capacity of the vessels to be granted an authorisation in 2010 to the same level as the total kw capacity of those vessels that were active using the regulated gear and had an authorisation in 2006 or 2007.  The management of the fishing effort ceilings has been devolved to the national level.  Member States have received annual allocations of fishing effort for the areas covered by the Plan, which include the Irish Sea (ICES area VIIa) and the waters to the northwest of Ireland and Scotland (ICES area VIa).  The effort allocation levels were established by the EU Fisheries Council on the basis of an EU Commission proposal.  They were calculated by averaging the fishing activity levels of each Member State in the areas during a reference period of 2004-2006 or 2005-2007 and then reducing that effort by 25% for 2009.   A further reduction of effort by 25% is to be implemented in 2010.   This methodology means there is now limited fishing effort available for all Community vessels, including Irish vessels, fishing in the designated areas.  Under the plan, each Member State was required to introduce a licensing regime to manage its effort allocations.  Any vessel longer than 10 metres overall must have an authorisation from its Member State in order to operate in one of the designated areas using the fishing gears covered by the plan.  Member States can decide on the method of allocating their national pools of fishing effort, which are broken down by fishing gear type.  Following consultations with representatives of the Irish fishing industry, a pilot system of authorisations and allocations of fishing effort was introduced for the period from 1 February to 30 April 2009.    Minister Killeen also established a Steering Group in February 2009 consisting of representatives of the Irish fishing industry, with input from the Marine Institute, the Sea Fisheries Protection Authority, Bord Iascaigh Mhara and the Department to advise on how the Pilot Scheme might be revised.    Minister Killeen approved two further pilot schemes from 1 May 2009 – 31 October 2010 and from 1 November – 31 January 2010.  Following extensive consultations and meetings of the Steering Group since November 2009, I am pleased to confirm that a new pilot scheme for the period 1 February 2010 – 30 April 2010 has been agreed and approved by Minster Killeen.  I appreciate that the introduction of these new conservation measures are a challenge and present difficulties for fishermen.  Bearing in mind the difficulties posed by this regulation, I can assure the house that Minister Killeen, the Department and its agencies will continue to provide support to the industry in relation to the practical implementation of these new measures.  Minister Killeen regularly meets fishing industry representatives and fishermen and every effort is made to alleviate the impact of the Cod Recovery Plan in as far as practicable and within the legal framework that has been established. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2010-01-27/pq_101",
        "by": {
          "memberCode": "Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06"
        }
      },
      "contextDate": "2010-01-27"
    },
    {
      "question": {
        "questionNumber": 17,
        "debateSection": {
          "debateSectionId": "dbsect_36",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-11-26/writtens/dbsect_36",
          "showAs": "Milk Quota.",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-11-26/writtens/mul@/dbsect_36.xml"
            }
          }
        },
        "to": {
          "roleType": null,
          "uri": null,
          "roleCode": null,
          "showAs": "Minister for Agriculture, Fisheries and Food"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2009-11-26/pq_17",
        "date": "2009-11-26",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney",
          "memberCode": "Niall-Blaney.D.2002-06-06"
        },
        "showAs": " 17 Deputy Niall Blaney asked the Minister for Agriculture, Fisheries and Food the measures that he has put in place to support young farmers, both in terms of on-farm investment and the allocation of milk quota to new entrants; and if he will make a statement on the matter. \n        [43452/09] ",
        "answerText": " Minister for Agriculture, Fisheries and Food (Deputy Brendan Smith)  I have made provision of €9.75 million in 2009 to meet existing commitments under the Young Farmers' Installation Scheme and the preceding equivalent schemes.   In addition, I have recently announced my intention to introduce a new range of aid measures in relation to on-farm investments, some of which will be particularly targeted at young farmers.   These measures will be introduced as soon as EU approval is received for the measures in question and following agreement on the specific cash-limits available for each measure.  The allocation of milk quota to new entrants to dairying has been a key component of milk policy for some time, and I am glad to say that the long-standing arrangements for making quota available to new entrants under the Milk Quota Trading Scheme have been significantly enhanced recently with the allocation of 200,000 litres of milk quota to 70 new entrants to dairying.  As the Deputy will be aware, the first of five annual one per cent increases in quota agreed under last November's Health Check of the CAP reform became available on 1 April of this year. In addition to using three-quarters of this increase to boost the quotas of active milk producers, I decided that, at a time when the dairy sector is facing many serious challenges, it was more important than ever to make every effort to encourage new thinking and new methods. All in the industry are agreed on the importance of attracting new blood, so I decided to introduce a new scheme, on a pilot basis, that would make a serious effort to identify people who have a future in dairying and can demonstrate not just their potential but also their commitment to the sector. While the amount of quota that was available was limited, I am satisfied that the 14 million litres that has been allocated under the scheme has gone to high quality applicants, and I look forward to learning of the positive impact they will have on the sector in the coming years. I have also stated my intention to consider, in the context of the availability of a further one per cent of additional quota in 2010, what further potential may be available to expand the eligibility for the scheme to new and recent entrants next year following a review of this scheme.  I should also take the opportunity to emphasise what I alluded to earlier, namely, that the allocation of milk quota to new entrants continues under the Milk Quota Trading Scheme, as it did previously under the Restructuring Scheme. Since the inception of the Trading Scheme in 2007 alone, more than 60 million litres of milk quota has made its way into the hands of young farmers, and they currently have an opportunity to further augment that figure under the latest phase of the Trading Scheme, which I intend to have completed shortly. ",
        "house": {
          "houseCode": "dail",
          "chamberType": "house",
          "houseNo": "30",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "showAs": "30th Dáil"
        }
      },
      "contextDate": "2009-11-26"
    },
    {
      "question": {
        "questionNumber": 54,
        "debateSection": {
          "debateSectionId": "dbsect_66",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-11-26/writtens/dbsect_66",
          "showAs": "Common Agricultural Policy.",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-11-26/writtens/mul@/dbsect_66.xml"
            }
          }
        },
        "to": {
          "roleType": null,
          "uri": null,
          "roleCode": null,
          "showAs": "Minister for Agriculture, Fisheries and Food"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2009-11-26/pq_54",
        "date": "2009-11-26",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney",
          "memberCode": "Niall-Blaney.D.2002-06-06"
        },
        "showAs": " 49 Deputy Niall Blaney asked the Minister for Agriculture, Fisheries and Food his views on where there is further scope for the allocation of additional quota to young farmers as a result of the outcome of the Common Agricultural Policy health check; and if he will make a statement on the matter. \n        [43453/09] ",
        "answerText": " Minister for Agriculture, Fisheries and Food (Deputy Brendan Smith)  The Deputy will be aware that at the end of September I announced the allocation of milk quota to 70 new entrants to dairying. The opportunity to introduce this scheme arose from the availability of the first of five annual increases of one per cent in milk quotas agreed under the CAP Health Check. I was delighted to be able to avail of this opportunity and I was equally delighted with the success of the scheme. When I announced the results I stated my intention to consider what further scope might be available to allocate quota to young farmers when the next one per cent falls due for allocation in 2010. This process will be informed by a full review of the operation of this year's scheme, which will be conducted shortly. ",
        "house": {
          "houseCode": "dail",
          "chamberType": "house",
          "houseNo": "30",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "showAs": "30th Dáil"
        }
      },
      "contextDate": "2009-11-26"
    },
    {
      "question": {
        "questionNumber": 222,
        "debateSection": {
          "debateSectionId": "dbsect_188",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-11-17/writtens/dbsect_188",
          "showAs": "Citizenship Applications.",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-11-17/writtens/mul@/dbsect_188.xml"
            }
          }
        },
        "to": {
          "roleType": null,
          "uri": null,
          "roleCode": null,
          "showAs": "Minister for Justice, Equality and Law Reform"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2009-11-17/pq_222",
        "date": "2009-11-17",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney",
          "memberCode": "Niall-Blaney.D.2002-06-06"
        },
        "showAs": " 265 Deputy Niall Blaney asked the Minister for Justice, Equality and Law Reform the options available to a person (details supplied), currently living in Northern Ireland on a UK visa, to become an Irish citizen; and if he will make a statement on the matter. \n        [41428/09] ",
        "answerText": " Minister for Justice, Equality and Law Reform (Deputy Dermot Ahern)  In the absence of more specific information,  I can only set out the position generally.  The statutory requirements for naturalisation are set out in the Irish Nationality and Citizenship Act 1956, as amended.  This provides that applicants for naturalisation, other than spouses of Irish citizens, must have been resident in the State for five years of the nine year period prior to the date of application.  Resident in this context means residence for which the applicant had the permission of the Minister for Justice, Equality and Law Reform and where such permission was not granted for the purposes of study or seeking asylum.  A foreign national married to an Irish citizen for at least three years may apply for naturalisation under section 15A of the Irish Naturalisation and Citizenship Act 1956, as amended, where they have been continuously resident in the island of Ireland for the year immediately prior to the date of their application and for two out of the four years prior to that year.  The marriage concerned must be recognised under the laws of the State as subsisting. ",
        "house": {
          "houseCode": "dail",
          "chamberType": "house",
          "houseNo": "30",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "showAs": "30th Dáil"
        }
      },
      "contextDate": "2009-11-17"
    },
    {
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney",
          "memberCode": "Niall-Blaney.D.2002-06-06"
        },
        "house": {
          "committeeCode": "",
          "houseNo": "30",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "showAs": "30th Dáil",
          "houseCode": "dail"
        },
        "answerText": " Minister for Agriculture, Fisheries and Food (Deputy Brendan Smith)  I have made provision of €9.75 million in 2009 to meet existing commitments under the Young Farmers' Installation Scheme and the preceding equivalent schemes.  In addition, I have recently announced my intention to introduce a new range of aid measures in relation to on-farm investments, some of which will be particularly targeted at young farmers.  These measures will be introduced as soon as EU approval is received for the measures in question and following agreement on the specific cash-limits available for each measure.  The allocation of milk quota to new entrants to dairying has been a key component of milk policy for some time, and I am glad to say that the long-standing arrangements for making quota available to new entrants under the Milk Quota Trading Scheme have been significantly enhanced recently with the allocation of 200,000 litres of milk quota to 70 new entrants to dairying.  As the Deputy will be aware, the first of five annual one per cent increases in quota agreed under last November's Health Check of the CAP reform became available on 1 April of this year. In addition to using three-quarters of this increase to boost the quotas of active milk producers, I decided that, at a time when the dairy sector is facing many serious challenges, it was more important than ever to make every effort to encourage new thinking and new methods.  All in the industry are agreed on the importance of attracting new blood, so I decided to introduce a new scheme, on a pilot basis, that would make a serious effort to identify people who have a future in dairying and can demonstrate not just their potential but also their commitment to the sector. While the amount of quota that was available was limited, I am satisfied that the 14 million litres that has been allocated under the scheme has gone to high quality applicants, and I look forward to learning of the positive impact they will have on the sector in the coming years. I have also stated my intention to consider, in the context of the availability of a further one per cent of additional quota in 2010, what further potential may be available to expand the eligibility for the scheme to new and recent entrants next year following a review of this scheme.  I should also take the opportunity to emphasise what I alluded to earlier, namely, that the allocation of milk quota to new entrants continues under the Milk Quota Trading Scheme, as it did previously under the Restructuring Scheme. Since the inception of the Trading Scheme in 2007 alone, more than 60 million litres of milk quota has made its way into the hands of young farmers, and they currently have an opportunity to further augment that figure under the latest phase of the Trading Scheme, which closes for applications on 23 October. ",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Minister for Agriculture, Fisheries and Food",
          "roleType": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2009-10-15/pq_21",
        "questionNumber": 21,
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-10-15/writtens/dbsect_36",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-10-15/writtens/mul@/dbsect_36.xml"
            },
            "pdf": null
          },
          "showAs": "Supports for Young Farmers.",
          "debateSectionId": "dbsect_36"
        },
        "showAs": " 21 Deputy Niall Blaney asked the Minister for Agriculture, Fisheries and Food the measures he has put in place to support young farmers, both in terms of on-farm investment and the allocation of milk quota to new entrants; and if he will make a statement on the matter. \n        [36066/09] ",
        "questionType": "written",
        "date": "2009-10-15"
      },
      "contextDate": "2009-10-15"
    },
    {
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney",
          "memberCode": "Niall-Blaney.D.2002-06-06"
        },
        "house": {
          "committeeCode": "",
          "houseNo": "30",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "showAs": "30th Dáil",
          "houseCode": "dail"
        },
        "answerText": " Minister for Agriculture, Fisheries and Food (Deputy Brendan Smith)  When I announced recently the allocation of milk quota to 70 new entrants to dairying, which arose from the first of five annual increases of one per cent in milk quotas agreed under the CAP Health Check, I stated my intention to consider what further scope might be available to allocate quota to young farmers when the next one per cent falls due for allocation in 2010. This process will be informed by a full review of the operation of this year's scheme, which will be conducted in the coming months. ",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Minister for Agriculture, Fisheries and Food",
          "roleType": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2009-10-15/pq_39",
        "questionNumber": 39,
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-10-15/writtens/dbsect_52",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-10-15/writtens/mul@/dbsect_52.xml"
            },
            "pdf": null
          },
          "showAs": "Milk Quota.",
          "debateSectionId": "dbsect_52"
        },
        "showAs": " 37 Deputy Niall Blaney asked the Minister for Agriculture, Fisheries and Food his views on whether there is further scope for the allocation of additional quota to young farmers as a result of the outcome of the Common Agricultural Policy health check; and if he will make a statement on the matter. \n        [36067/09] ",
        "questionType": "written",
        "date": "2009-10-15"
      },
      "contextDate": "2009-10-15"
    },
    {
      "question": {
        "date": "2009-06-30",
        "to": {
          "roleType": null,
          "showAs": "Minister for Agriculture, Fisheries and Food",
          "roleCode": null,
          "uri": null
        },
        "by": {
          "memberCode": "Niall-Blaney.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney"
        },
        "questionType": "written",
        "questionNumber": 66,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2009-06-30/pq_66",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "houseNo": "30",
          "showAs": "30th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "chamberType": "house"
        },
        "debateSection": {
          "debateSectionId": "dbsect_76",
          "showAs": "Fishing Industry Development.",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-06-30/writtens/dbsect_76",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-06-30/writtens/mul@/dbsect_76.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Agriculture, Fisheries and Food (Deputy Brendan Smith)  Oil prices have, in recent months, started to rise again and though they remain far below last year's all time high levels, they are a cause of concern for the Irish fishing fleet particularly in the current situation where fish prices are also depressed.  Minister of State, Deputy Tony Killeen, at the Department of Agriculture, Fisheries and Food had a meeting with European Commissioner Joe Borg on 23 June.  He took the opportunity to highlight the current economic problems facing Irish fishermen.  He put Ireland's submission 12 September 2008 for an emergency aid package back on the table.   We firmly believe that these proposals are the needed and are the most appropriate to assist the Irish fishing industry in the current situation.  We will continue to push Ireland's case at every available forum with a view to the EU Commission bringing forward firm proposals to provide additional EU funds that will enable the full implementation of the plan. ",
        "showAs": " 84 Deputy Niall Blaney asked the Minister for Agriculture, Fisheries and Food his views on the case for an emergency aid package to assist the fishing industry here; and if he will make a statement on the matter.   \n        [25942/09] "
      },
      "contextDate": "2009-06-30"
    },
    {
      "question": {
        "questionNumber": 82,
        "debateSection": {
          "debateSectionId": "dbsect_78",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-05-20/writtens/mul@/dbsect_78.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-05-20/writtens/dbsect_78",
          "showAs": "Animal Diseases."
        },
        "date": "2009-05-20",
        "showAs": " 106 Deputy Niall Blaney asked the Minister for Agriculture, Fisheries and Food the progress being made to implement the commitment in the programme for Government to introduce a herd health initiative to deal with non-regulated diseases and conditions; and if he will make a statement on the matter. \n        [20319/09] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Minister for Agriculture, Fisheries and Food"
        },
        "house": {
          "chamberType": "house",
          "houseNo": "30",
          "showAs": "30th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "committeeCode": ""
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2009-05-20/pq_82",
        "by": {
          "memberCode": "Niall-Blaney.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney"
        },
        "answerText": " Minister for Agriculture, Fisheries and Food (Deputy Brendan Smith)  Significant progress has been made regarding this initiative since the beginning of the year. Animal Health Ireland is now a legal entity with its own Board of Directors, having recently been incorporated as a company limited by guarantee.  A specialist recruitment company has been engaged by Animal Health Ireland to proceed with the recruitment of a Chief Executive Officer for the organization a process that is now underway.  Animal Health Ireland hosted a very well attended information seminar for its stakeholders on the 6th March 2009, at which issues such as the current situation regarding non-regulatory diseases in Ireland and in competitor countries were considered and a realistic assessment of the scale of the challenges ahead was made. Similar seminars  focusing on those individual diseases and conditions that come to be prioritised for action are planned for the future. The Animal Health Ireland website, which will go live within the coming days, will facilitate the communication process.  The Chairman and others associated with Animal Health Ireland have conducted a wide-ranging consultation with a large cross-section of stakeholders in recent weeks.  Work is underway to identify and prioritise a definitive ranking of disease priorities to be addressed by Animal Health Ireland. An extensive survey of expert opinion is due to be completed by mid-June. In addition to the expert opinion, the opinion of farmers has been sought through a survey and the deliberations of Farmer Focus Groups established by Animal Health Ireland. Technical Working Groups will be created to establish nationally-agreed protocols for the prioritised diseases.  I understand that the feedback from the stakeholder group to this initiative has been very positive and this is confirmed by their willingness to commit funds to Animal Health Ireland. I believe Animal Health Ireland provides a unique opportunity to develop an improved understanding of current practices and future trends in international best practice in the area of herd health. It affords those organisations — including farmers, producers, processors, and support/advisory service — actively participating in the project to build on the significant resources, informational infrastructure, capabilities and expertise already available within the range of organisations. It also offers an opportunity to develop a national strategy to take appropriate action in the area of non-regulatory animal health which in effect will allow industry to a large extent shape its own future. ",
        "questionType": "written"
      },
      "contextDate": "2009-05-20"
    },
    {
      "question": {
        "questionNumber": 99,
        "debateSection": {
          "debateSectionId": "dbsect_94",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-05-20/writtens/mul@/dbsect_94.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-05-20/writtens/dbsect_94",
          "showAs": "Bovine Disease."
        },
        "date": "2009-05-20",
        "showAs": " 129 Deputy Niall Blaney asked the Minister for Agriculture, Fisheries and Food his estimate of the savings that can be achieved by securing brucellosis free status for Ireland; and if he will make a statement on the matter. \n        [20320/09] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Minister for Agriculture, Fisheries and Food"
        },
        "house": {
          "chamberType": "house",
          "houseNo": "30",
          "showAs": "30th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "committeeCode": ""
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2009-05-20/pq_99",
        "by": {
          "memberCode": "Niall-Blaney.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney"
        },
        "answerText": " Minister for Agriculture, Fisheries and Food (Deputy Brendan Smith)  Brucellosis is now at an historically low level in Ireland. The last confirmed case was disclosed in April 2006.  My Department applied to the European Commission on 31 March last for formal recognition of Officially Brucellosis Free status (OBF) for Ireland.  I am hopeful that a decision on our application will be taken in July at the latest.  Achievement of OBF status would allow the relaxation of some of the programme's control measures over the coming years and this will reduce the burden on farmers of testing and movement controls.  However, as Brucellosis continues to exist in Northern Ireland, my Department will be adopting a cautious approach to reducing controls and any change to existing controls will be based on risk assessment. Some consultations have already taken place with representatives of the farming bodies on the testing regime for the future.  With regard to possible savings arising from the attainment of Officially Brucellosis Free status, the position is that the cost of the Brucellosis eradication programme has been falling progressively over the last number of years in line with the reduction in the incidence of the disease. In particular, the cost of compensation paid by my Department to farmers in respect of Brucellosis reactors fell from €24.2m in 2002 to €280,000 in 2008. Since the cost of compensation has fallen to very low levels and, as a general rule, farmers themselves pay for Brucellosis testing, the savings for my Department will not be significant in the short-term, particularly in view of the fact that the reduction in control measures will be gradual, based on risk assessment in the context of the disease still being present on the island. However, over time there will be significant benefits to farmers in terms of reduced testing costs and the relaxation of restrictions on cattle movements and trade. ",
        "questionType": "written"
      },
      "contextDate": "2009-05-20"
    },
    {
      "question": {
        "questionNumber": 578,
        "debateSection": {
          "debateSectionId": "dbsect_412",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-05-06/writtens/mul@/dbsect_412.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-05-06/writtens/dbsect_412",
          "showAs": "School Transport."
        },
        "date": "2009-05-06",
        "showAs": " 629 Deputy Niall Blaney asked the Minister for Education and Science if a bus route will be extended approximately one mile to accommodate a person (details supplied) in County Donegal; and if he will make a statement on the matter. \n        [17979/09] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Minister for Education and Science"
        },
        "house": {
          "chamberType": "house",
          "houseNo": "30",
          "showAs": "30th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "committeeCode": ""
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2009-05-06/pq_578",
        "by": {
          "memberCode": "Niall-Blaney.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney"
        },
        "answerText": " Minister of State at the Department of Education and Science (Deputy Seán Haughey)  The School Transport Section of my Department, has requested Bus Éireann which operates the school transport scheme, to examine the background to the case referred to by the Deputy, in the details supplied and to liaise directly with the Deputy and the family concerned. ",
        "questionType": "written"
      },
      "contextDate": "2009-05-06"
    },
    {
      "contextDate": "2009-04-22",
      "question": {
        "date": "2009-04-22",
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "houseCode": "dail",
          "houseNo": "30",
          "showAs": "30th Dáil",
          "committeeCode": ""
        },
        "answerText": " Minister for Health and Children (Deputy Mary Harney)  As this is a service matter it has been referred to the HSE for direct reply. \n Minister for Health and Children (Deputy Mary Harney)  As the Deputy's question relates to service matters I have arranged for the question to be referred to the Health Service Executive for direct reply. ",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_188",
          "showAs": "Health Services.",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-04-22/writtens/dbsect_188",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-04-22/writtens/mul@/dbsect_188.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Minister for Health and Children"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2009-04-22/pq_238",
        "by": {
          "showAs": "Niall Blaney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "memberCode": "Niall-Blaney.D.2002-06-06"
        },
        "questionNumber": 238,
        "showAs": " 286 Deputy Niall Blaney asked the Minister for Health and Children when the report on the national review of the Health Service Executive funded adult day services 2007 to 2008 will be published; and if she will make a statement on the matter. \n        [15311/09] "
      }
    },
    {
      "contextDate": "2009-03-24",
      "question": {
        "showAs": " 73 Deputy Niall Blaney asked the Minister for Agriculture, Fisheries and Food if he is satisfied that his Department’s contingency arrangements are adequate to deal with an outbreak of bluetongue; and if he will make a statement on the matter. \n        [11868/09] ",
        "questionType": "written",
        "house": {
          "showAs": "30th Dáil",
          "houseCode": "dail",
          "houseNo": "30",
          "committeeCode": "",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30"
        },
        "by": {
          "showAs": "Niall Blaney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "memberCode": "Niall-Blaney.D.2002-06-06"
        },
        "debateSection": {
          "showAs": "Bovine Diseases.",
          "debateSectionId": "dbsect_44",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-03-24/writtens/dbsect_44",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-03-24/writtens/mul@/dbsect_44.xml"
            }
          }
        },
        "to": {
          "showAs": "Minister for Agriculture, Fisheries and Food",
          "uri": null,
          "roleCode": null,
          "roleType": null
        },
        "date": "2009-03-24",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2009-03-24/pq_42",
        "answerText": " Minister for Agriculture, Fisheries and Food (Deputy Brendan Smith)  My Department's contingency arrangements to mitigate the risk of the introduction of the bluetongue virus into the country are based on existing EU legislation and an ongoing assessment of the risk to Ireland.  In terms of my Department's overall contingency arrangements, we have produced a comprehensive Bluetongue Contingency Plan for Ireland.  Information and advice leaflets on Bluetongue were sent to every farmer in the country, as well as specifically tailored advisory material to all members of the Veterinary Profession.  My Departments contingency arrangements are kept under constant review and revised as appropriate by reference to the developing disease situation or in the light of legal or other developments, particularly at EU level. In addition, we are also refining arrangements for delivery of a vaccination programme in the event that it becomes necessary to vaccinate here.  In the meantime, I strongly urge Irish farmers and others not to import livestock from affected zones under any circumstances as this represents the biggest risk of the introduction of the disease.  I have made this clear to the farming organisations during the many briefings on bluetongue and have asked that they too use their influence accordingly.  I wish to re-iterate that any such animal found BTV positive to a PCR (virus) test on arrival here will be immediately slaughtered.  There are no compensation arrangements in place in the case of such slaughter.  Consequently, farmers and others should be aware of the possible financial risks that they may be exposed to in addition to the risk that such imports may pose to the national herd. ",
        "questionNumber": 42
      }
    },
    {
      "contextDate": "2009-03-24",
      "question": {
        "showAs": " 80 Deputy Niall Blaney asked the Minister for Agriculture, Fisheries and Food the discussions there have been at the EU Agriculture Council regarding the future of the CAP post 2013; and if he will make a statement on the matter. \n        [11867/09] ",
        "questionType": "written",
        "house": {
          "showAs": "30th Dáil",
          "houseCode": "dail",
          "houseNo": "30",
          "committeeCode": "",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30"
        },
        "by": {
          "showAs": "Niall Blaney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "memberCode": "Niall-Blaney.D.2002-06-06"
        },
        "debateSection": {
          "showAs": "Common Agricultural Policy.",
          "debateSectionId": "dbsect_49",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-03-24/writtens/dbsect_49",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-03-24/writtens/mul@/dbsect_49.xml"
            }
          }
        },
        "to": {
          "showAs": "Minister for Agriculture, Fisheries and Food",
          "uri": null,
          "roleCode": null,
          "roleType": null
        },
        "date": "2009-03-24",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2009-03-24/pq_53",
        "answerText": " Minister for Agriculture, Fisheries and Food (Deputy Brendan Smith)  At the outset I should state that a full screening Regulatory Impact Analysis has been carried out by my Department on the CAP Health Check and the report is available on the Department's website.  That report outlines in some detail the expected impact of the Health Check proposals.   The final deal secured last November differs in some respects from the original proposals.  In summary, the deal I secured is worth a potential €80 million in additional payments to farmers over the coming years.  In addition, the increase in milk quota will deliver some €100 million worth of additional milk production by 2014.  As regards market support schemes, in essence, the key market management mechanisms that are most important to Ireland have been protected and are left unchanged.  Good progress was also achieved as regards simplification and a commitment was secured from the Commission and the Council as regards further simplification.  As to modulation, the rate was increased by 5% as opposed to the 8% originally proposed.  I am satisfied that we succeeded in getting the rate of additional modulation considerably reduced from the original proposals.  It is worth noting that over 50,000 Irish farmers will be exempt from this increase.  I can confirm that there will be a budget neutral effect in respect of the 70,000 farmers affected by the change as I have ensured that all the funds raised can be passed straight back to Irish farmers. \n Minister for Agriculture, Fisheries and Food (Deputy Brendan Smith)  A first policy debate on the future of the CAP after 2013 took place at the informal meeting of Agriculture Ministers in Annecy in September last.  In the initial debate, there was general agreement on the global context in which policy thinking must be developed.  All the ministers present were concerned about global food security, increasing environmental pressures and the impact of climate change, factors which have been reflected in recent food price volatility.  While a large majority of Member States favoured maintaining a strong EU agriculture policy, there were differences in emphasis from different Member States.  The French Presidency took the discussion forward at a specially convened Council in November 2008 at which it presented a series of draft conclusions for discussion by Ministers.  The draft brought together aspirations on a number of broad challenges and generally understood principles on future CAP policy.  It took on board the commitments made in the final Health Check negotiations to further simplification and to address the differing levels of direct payments between Member States.  It also pledged that the conclusions were without prejudice to discussions on the Financial Perspectives.  Unanimous agreement could not be reached on the conclusions put forward by the Presidency and they were therefore agreed as Presidency, rather than Council, conclusions.  The Czech Presidency has signalled that its main priority will be to continue discussions on the future of the CAP including an examination of direct payments with a particular focus on the differences between Member States and the system of payments.  It intends to hold a full discussion on this topic at the Informal Agriculture Council meeting in May.  My own view, which I have expressed at meetings of the Council and bilaterally to my Ministerial colleagues, is that we must maintain a strong agricultural production base in the European Union in the future to take account of the challenges ahead in meeting increased demands for food.  Any reduction in food production in the EU would be taken up elsewhere where less efficient production systems exist and would result in a heavier carbon footprint.   We must also undertake food production and distribution in a manner that is sustainable in all its dimensions — economically, socially and environmentally.  There will be major challenges ahead from climate change, increased competition on world and EU markets, the financial crunch and other factors. We must ensure that we have the capacity to cope with the challenges and fully exploit the opportunities as they emerge.  To do so our whole sector, from farm to fork, must be highly efficient and competitive.  It must also be innovative, producing the products that changing consumer tastes demand, and it must be relentlessly focused on quality and safety.  To achieve these objectives, there is a continuing need for an active and appropriately resourced European agricultural policy.  That policy needs to recognise the role that a cohesive agriculture & rural development policy can play in addressing future energy needs, addressing environmental concerns and providing a secure and sustainable food supply in Europe. ",
        "questionNumber": 53
      }
    },
    {
      "contextDate": "2009-03-12",
      "question": {
        "showAs": " 139 Deputy Niall Blaney asked the Minister for Justice, Equality and Law Reform the guidelines followed by immigration officers at Irish airports in making a decision as to whether to allow somebody enter the country if they have already obtained a visa (details supplied); and if he will make a statement on the matter. \n        [10749/09] ",
        "questionType": "written",
        "house": {
          "showAs": "30th Dáil",
          "houseCode": "dail",
          "houseNo": "30",
          "committeeCode": "",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30"
        },
        "by": {
          "showAs": "Niall Blaney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "memberCode": "Niall-Blaney.D.2002-06-06"
        },
        "debateSection": {
          "showAs": "Visa Applications.",
          "debateSectionId": "dbsect_116",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-03-12/writtens/dbsect_116",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-03-12/writtens/mul@/dbsect_116.xml"
            }
          }
        },
        "to": {
          "showAs": "Minister for Justice, Equality and Law Reform",
          "uri": null,
          "roleCode": null,
          "roleType": null
        },
        "date": "2009-03-12",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2009-03-12/pq_140",
        "answerText": " Minister for Justice, Equality and Law Reform (Deputy Dermot Ahern)  It is necessary for a non-national in the circumstances set out by the Deputy to apply for a visa at the Irish Embassy or consular office nearest to where he/she resides.  Such matters as ability to be able to support himself/herself and provide accommodation for himself/herself without working in Ireland will be part of the assessment procedure in deciding whether to grant or refuse the visa.  It should be noted that a visa only entitles the holder to present himself/herself to an immigration officer at a port of entry.  Section 4 of the Immigration Act, 2004 provides that an immigration officer may, on behalf of the Minister, give to a non-national a document, or place on his or her passport, or other equivalent document, an inscription authorising the non-national to land or be in the State.  This is effectively permission to remain and reside in the State.  Section 4 also provides that an immigration officer may, on behalf of the Minister, refuse to give a permission to a non-national, if the officer is satisfied:  (a) that the non-national is not in a position to support himself or herself and any accompanying dependants;  (b) that the non-national intends to take up employment in the State, but is not in possession of a valid employment permit;  (c) that the non-national suffers from a condition specified in First Schedule accompanying the Act;  (d) that the non-national has been convicted (whether in this State or elsewhere) of an offence that may be punished under the law of the place of conviction by imprisonment for a period of one year or by a more severe penalty;  (e) that the non-national, not being exempt from the requirement to have an Irish visa, is not the holder of a valid Irish visa;  (f) that the non-national is the subject of a deportation order, exclusion order or a determination by the Minister that it is conducive to the public good that the person remains outside the State;  (g) that the non-national is not in possession of a valid passport or other equivalent document;  (h) that the non-national intends to travel to Great Britain or Northern Ireland and would not qualify for admission to those places;  (i) that the non-national, having arrived as a seaman, has remained on after the ship's departure without the leave of an immigration officer;  (j) that the non-national's entry into, or presence in, the State could pose a threat to national security or be contrary to public policy, and  (k) that there is reason to believe that the non-national intends to enter the State for the purposes other than those expressed by the non-national.  A non-national will be interviewed by the Immigration Officer on arrival at the frontier of the State and the above legal provisions are effectively the guidelines applied by an immigration officer to assess a person who seeks permission to enter the State.  It is, therefore, a matter for such a person, prior to making a reservation to travel here, to satisfy himself/herself that he/she will be in a position to satisfy the immigration officer that he/she meets the above conditions. \n Minister for Justice, Equality and Law Reform (Deputy Dermot Ahern)  It is not possible, based on the information provided, to state what the person referred to by the Deputy is required, by law, to do to fulfil his obligations to the Immigration Laws of this State.  The person concerned should write to the General Immigration Division of my Department, which is located at 13-14 Burgh Quay, Dublin 2, providing full details and documentation of his/her plans to stay in Ireland to enable my officials to decide on the application. ",
        "questionNumber": 140
      }
    },
    {
      "contextDate": "2009-03-10",
      "question": {
        "showAs": " 429 Deputy Niall Blaney asked the Minister for Communications, Energy and Natural Resources when the proposed Broadcasting Bill is expected to be through the Houses of the Oireachtas; and if he will make a statement on the matter. \n        [9991/09] ",
        "questionType": "written",
        "house": {
          "showAs": "30th Dáil",
          "houseCode": "dail",
          "houseNo": "30",
          "committeeCode": "",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30"
        },
        "by": {
          "showAs": "Niall Blaney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "memberCode": "Niall-Blaney.D.2002-06-06"
        },
        "debateSection": {
          "showAs": "Proposed Legislation.",
          "debateSectionId": "dbsect_303",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-03-10/writtens/dbsect_303",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-03-10/writtens/mul@/dbsect_303.xml"
            }
          }
        },
        "to": {
          "showAs": "Minister for Communications, Energy and Natural Resources",
          "uri": null,
          "roleCode": null,
          "roleType": null
        },
        "date": "2009-03-10",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2009-03-10/pq_397",
        "answerText": " Minister for Communications, Energy and Natural Resources (Deputy Eamon Ryan)  The timing of the passing of the Broadcasting Bill 2008 by the Houses of the Oireachtas is a matter to be determined by the Houses of the Oireachtas.  I have no direct function in the matter. ",
        "questionNumber": 397
      }
    },
    {
      "contextDate": "2009-02-11",
      "question": {
        "showAs": " 108 Deputy Niall Blaney asked the Minister for Agriculture, Fisheries and Food if he is satisfied with the outcome of the December 2008 EU Fisheries Council. \n        [4924/09] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2009-02-11/pq_69",
        "answerText": " Minister for Agriculture, Fisheries and Food (Deputy Brendan Smith)  I propose to take Questions Nos. 108 and 131 together.  The package of measures agreed at the December 2008 EU Fisheries Council were in my opinion the best possible deal available to Ireland in what were very challenging circumstances.  The main elements of the package include an increase of 5% in the value of quotas available to Ireland from €194m to €200m and the successful defence of the Hague Preferences against determined opposition from some Member States.  The EU Commission's proposals for complete closure of all whitefish fisheries in the waters off Donegal were successfully renegotiated and agreement was reached on a package of measures which both delivers strong conservation measures for the cod, whiting and haddock stocks in decline while facilitating the continuation of important fishing activities for the Irish fleet in the area.  In addition, the Council established effort limits under the EU Cod Recovery Plan Regulation (Council 1342/2008) for the Irish Sea and for the waters off Donegal.  I appreciate that the introduction of these new conservation measures are a challenge and I have established a Steering Group involving the  Federation of Irish Fishermen (FIF), the Department and agencies to provide support to the industry in relation to the practical implementation of these new measures. ",
        "questionNumber": 69,
        "debateSection": {
          "showAs": "Fishing Industry Development.",
          "debateSectionId": "dbsect_75",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-02-11/writtens/mul@/dbsect_75.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-02-11/writtens/dbsect_75"
        },
        "to": {
          "showAs": "Minister for Agriculture, Fisheries and Food",
          "uri": null,
          "roleType": null,
          "roleCode": null
        },
        "questionType": "written",
        "date": "2009-02-11",
        "house": {
          "showAs": "30th Dáil",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "30"
        },
        "by": {
          "showAs": "Niall Blaney",
          "memberCode": "Niall-Blaney.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06"
        }
      }
    },
    {
      "contextDate": "2009-02-11",
      "question": {
        "showAs": " 131 Deputy Niall Blaney asked the Minister for Agriculture, Fisheries and Food if he will quantify the value of the increased quota secured at the December 2008 EU Fisheries Council. \n        [4925/09] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2009-02-11/pq_70",
        "answerText": " Minister for Agriculture, Fisheries and Food (Deputy Brendan Smith)  I propose to take Questions Nos. 108 and 131 together.  The package of measures agreed at the December 2008 EU Fisheries Council were in my opinion the best possible deal available to Ireland in what were very challenging circumstances.  The main elements of the package include an increase of 5% in the value of quotas available to Ireland from €194m to €200m and the successful defence of the Hague Preferences against determined opposition from some Member States.  The EU Commission's proposals for complete closure of all whitefish fisheries in the waters off Donegal were successfully renegotiated and agreement was reached on a package of measures which both delivers strong conservation measures for the cod, whiting and haddock stocks in decline while facilitating the continuation of important fishing activities for the Irish fleet in the area.  In addition, the Council established effort limits under the EU Cod Recovery Plan Regulation (Council 1342/2008) for the Irish Sea and for the waters off Donegal.  I appreciate that the introduction of these new conservation measures are a challenge and I have established a Steering Group involving the  Federation of Irish Fishermen (FIF), the Department and agencies to provide support to the industry in relation to the practical implementation of these new measures. ",
        "questionNumber": 70,
        "debateSection": {
          "showAs": "Fishing Industry Development.",
          "debateSectionId": "dbsect_75",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-02-11/writtens/mul@/dbsect_75.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2009-02-11/writtens/dbsect_75"
        },
        "to": {
          "showAs": "Minister for Agriculture, Fisheries and Food",
          "uri": null,
          "roleType": null,
          "roleCode": null
        },
        "questionType": "written",
        "date": "2009-02-11",
        "house": {
          "showAs": "30th Dáil",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "30"
        },
        "by": {
          "showAs": "Niall Blaney",
          "memberCode": "Niall-Blaney.D.2002-06-06",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06"
        }
      }
    },
    {
      "question": {
        "questionNumber": 192,
        "questionType": "written",
        "answerText": " Minister of State at the Department of Health and Children (Deputy Barry Andrews)  As the Deputy will be aware, I have responsibility for the National Childcare Investment Programme 2006 -2010 (NCIP), which will invest €575 million over 5 years, with €358 million of this in capital grant aid for childcare services.  I understand that the service in question was initially approved capital grant funding under the Equal Opportunities Childcare Programme (EOCP) 2000 — 2006 in November 2005.   This grant was decommitted and transferred to the NCIP as the applicant could not proceed to contract at that time.  As the applicant could not secure a lease agreement in the time required under the NCIP, the funding was decommitted again in August 2008.  This decision was appealed however, given that the applicant had not secured a lease for the project, the original decision to decommit funding was deemed appropriate.  I also understand that Greencastle Community Childcare Centre has submitted a further capital grant application for €680,821 and that this application is currently in the appraisal process. A decision on this application will be made in due course following which the applicant will be notified of the outcome. ",
        "date": "2008-12-17",
        "by": {
          "memberCode": "Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06"
        },
        "house": {
          "houseNo": "30",
          "committeeCode": "",
          "showAs": "30th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "chamberType": "house"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2008-12-17/pq_192",
        "to": {
          "roleCode": null,
          "roleType": null,
          "showAs": "Minister for Health and Children",
          "uri": null
        },
        "debateSection": {
          "debateSectionId": "dbsect_161",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2008-12-17/writtens/mul@/dbsect_161.xml"
            },
            "pdf": null
          },
          "showAs": "Child Care Services.",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2008-12-17/writtens/dbsect_161"
        },
        "showAs": " 226 Deputy Niall Blaney asked the Minister for Health and Children the position in regard to an application to Pobal by a committee (details supplied); and if she will make a statement on the matter. \n        [46517/08] "
      },
      "contextDate": "2008-12-17"
    },
    {
      "question": {
        "questionNumber": 262,
        "questionType": "written",
        "answerText": " Minister for Community, Rural and Gaeltacht Affairs (Deputy Éamon Ó Cuív)  As the Deputy will be aware, my Department administers a scheme in the Gaeltacht under which community groups may apply for funding for local projects, subject to certain criteria.  The maximum assistance that can be given under this scheme is 80% of the admissible costs and this percentage would include any assistance given by other organisations out of public funds.  My Department received an application from the group referred to by the Deputy during 2007.  The works involved and the costing of the project were evaluated by the engineering staff of my Department.  Based on that evaluation and taking account of assistance that had been sanctioned from other public funds, it was deemed that grant assistance of over 80% had already been approved.  In the circumstances, therefore, it was not possible for my Department to grant further State assistance to the project. ",
        "date": "2008-12-02",
        "by": {
          "memberCode": "Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06"
        },
        "house": {
          "houseNo": "30",
          "committeeCode": "",
          "showAs": "30th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "chamberType": "house"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2008-12-02/pq_262",
        "to": {
          "roleCode": null,
          "roleType": null,
          "showAs": "Minister for Community, Rural and Gaeltacht Affairs",
          "uri": null
        },
        "debateSection": {
          "debateSectionId": "dbsect_212",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2008-12-02/writtens/mul@/dbsect_212.xml"
            },
            "pdf": null
          },
          "showAs": "Community Development.",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2008-12-02/writtens/dbsect_212"
        },
        "showAs": " 319 Deputy Niall Blaney asked the Minister for Community, Rural and Gaeltacht Affairs the funding avenues available to a group (details supplied) in County Donegal; and if he will make a statement on the matter. \n        [43772/08] "
      },
      "contextDate": "2008-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Communications, Energy and Natural Resources (Deputy Eamon Ryan)  The Broadcasting Bill has been referred to the Select Committee following the completion of Second Stage in Dáil Éireann on 6 November, 2008 and having been passed by Seanad Éireann on 25 June 2008.  The Select Committee on Communications, Energy and Natural Resources will commence in Dáil Éireann on 25 November, 2008. ",
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Minister for Communications, Energy and Natural Resources"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2008-11-25/writtens/dbsect_351",
          "showAs": "Proposed Legislation.",
          "debateSectionId": "dbsect_351",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2008-11-25/writtens/mul@/dbsect_351.xml"
            },
            "pdf": null
          }
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "memberCode": "Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney"
        },
        "showAs": " 488 Deputy Niall Blaney asked the Minister for Communications, Energy and Natural Resources when the proposed Broadcasting Bill will be complete; and if he will make a statement on the matter. \n        [42281/08] ",
        "date": "2008-11-25",
        "questionNumber": 425,
        "questionType": "written",
        "house": {
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "30",
          "showAs": "30th Dáil",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2008-11-25/pq_425"
      },
      "contextDate": "2008-11-25"
    },
    {
      "question": {
        "to": {
          "roleType": null,
          "showAs": "Minister for Education and Science",
          "roleCode": null,
          "uri": null
        },
        "showAs": " 342 Deputy Niall Blaney asked the Minister for Education and Science if he will give consideration to approving a reader for a person (details supplied) in County Donegal for their leaving certificate examination. \n        [20566/08] ",
        "house": {
          "houseNo": "30",
          "showAs": "30th Dáil",
          "chamberType": "house",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30"
        },
        "debateSection": {
          "showAs": "Special Educational Needs.",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2008-05-27/writtens/mul@/dbsect_207.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2008-05-27/writtens/dbsect_207",
          "debateSectionId": "dbsect_207"
        },
        "date": "2008-05-27",
        "questionNumber": 275,
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2008-05-27/pq_275",
        "answerText": " Minister for Education and Science (Deputy Batt O’Keeffe)  The State Examinations Commission has statutory responsibility for operational matters relating to the certificate examinations including organising the holding of examinations and determining procedures in places where examinations are conducted including the supervision of examinations.  In view of this I have forwarded the Deputy's query to the State Examinations Commission for direct reply to him. ",
        "by": {
          "memberCode": "Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06"
        }
      },
      "contextDate": "2008-05-27"
    },
    {
      "question": {
        "to": {
          "roleType": null,
          "showAs": "Minister for Health and Children",
          "roleCode": null,
          "uri": null
        },
        "showAs": " 240 Deputy Niall Blaney asked the Minister for Health and Children if departmental guidelines have been produced under the Health (Amendment) (No. 3) Act 1996 or the Health Act 2004 relevant to the sale of land vested in the Health Service Executive; and if she will make a statement on the matter. \n        [19731/08] ",
        "house": {
          "houseNo": "30",
          "showAs": "30th Dáil",
          "chamberType": "house",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30"
        },
        "debateSection": {
          "showAs": "Departmental Properties.",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2008-05-20/writtens/mul@/dbsect_144.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2008-05-20/writtens/dbsect_144",
          "debateSectionId": "dbsect_144"
        },
        "date": "2008-05-20",
        "questionNumber": 162,
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2008-05-20/pq_162",
        "answerText": " Minister for Health and Children (Deputy Mary Harney)  I propose to take Questions Nos. 240 and 241 together.  The provisions of Part 5 of the Code of Practice for the Governance of State Bodies (2001) sets out requirements in relation to the disposal of assets by the state bodies, including the HSE.  The Board of the HSE has put in place a set of guidelines titled \"Protocol for the Acquisition and Disposal of Property\" which are consistent with and meet the requirements of Part 5 of the Code of Practice.  The detailed protocol adopted by the HSE Board governs the sale of land vested in the HSE.   No specific regulations relevant to property disposals have been made under the Health Act, 2004.  I am satisfied that the requirements and protocols set out above deal adequately with the matter. ",
        "by": {
          "memberCode": "Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06"
        }
      },
      "contextDate": "2008-05-20"
    },
    {
      "question": {
        "to": {
          "roleType": null,
          "showAs": "Minister for Health and Children",
          "roleCode": null,
          "uri": null
        },
        "showAs": " 241 Deputy Niall Blaney asked the Minister for Health and Children if departmental guidelines have been issued under the Health (Amendment) (No.3) Act 1996 or the Health Act 2004 which both referred to general directions as opposed to consent for the sale of Health Service Executive land (details supplied); and if she will make a statement on the matter. \n        [19732/08] ",
        "house": {
          "houseNo": "30",
          "showAs": "30th Dáil",
          "chamberType": "house",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30"
        },
        "debateSection": {
          "showAs": "Departmental Properties.",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2008-05-20/writtens/mul@/dbsect_144.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2008-05-20/writtens/dbsect_144",
          "debateSectionId": "dbsect_144"
        },
        "date": "2008-05-20",
        "questionNumber": 163,
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2008-05-20/pq_163",
        "answerText": " Minister for Health and Children (Deputy Mary Harney)  I propose to take Questions Nos. 240 and 241 together.  The provisions of Part 5 of the Code of Practice for the Governance of State Bodies (2001) sets out requirements in relation to the disposal of assets by the state bodies, including the HSE.  The Board of the HSE has put in place a set of guidelines titled \"Protocol for the Acquisition and Disposal of Property\" which are consistent with and meet the requirements of Part 5 of the Code of Practice.  The detailed protocol adopted by the HSE Board governs the sale of land vested in the HSE.   No specific regulations relevant to property disposals have been made under the Health Act, 2004.  I am satisfied that the requirements and protocols set out above deal adequately with the matter. ",
        "by": {
          "memberCode": "Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06"
        }
      },
      "contextDate": "2008-05-20"
    },
    {
      "question": {
        "to": {
          "roleType": null,
          "showAs": "Minister for Education and Science",
          "roleCode": null,
          "uri": null
        },
        "showAs": " 168 Deputy Niall Blaney asked the Minister for Education and Science if he will give approval for the extension of a bus route to a school (details supplied) in County Donegal by 1.5 miles in order that the children of Churchill can access their closest Gaeltacht school; and if he will make a statement on the matter. \n        [18979/08] ",
        "house": {
          "houseNo": "30",
          "showAs": "30th Dáil",
          "chamberType": "house",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30"
        },
        "debateSection": {
          "showAs": "School Transport.",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2008-05-15/writtens/mul@/dbsect_141.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2008-05-15/writtens/dbsect_141",
          "debateSectionId": "dbsect_141"
        },
        "date": "2008-05-15",
        "questionNumber": 170,
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2008-05-15/pq_170",
        "answerText": " Minister of State at the Department of Education and Science (Deputy Seán Haughey)  Bus Éireann operates the school transport services on behalf of my Department.  Bus routes are planned in such a way as to ensure that, as far as possible, eligible pupils have a reasonable level of service, while, at the same time, ensuring that school transport vehicles are fully utilised in an efficient and effective manner.  My Department has requested Bus Éireann to investigate the background to the case, referred to in the details supplied, and to respond directly to the Deputy. ",
        "by": {
          "memberCode": "Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06"
        }
      },
      "contextDate": "2008-05-15"
    },
    {
      "contextDate": "2008-04-29",
      "question": {
        "to": {
          "roleCode": null,
          "roleType": null,
          "showAs": "Minister for Education and Science",
          "uri": null
        },
        "date": "2008-04-29",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2008-04-29/pq_345",
        "questionNumber": 345,
        "by": {
          "showAs": "Niall Blaney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "memberCode": "Niall-Blaney.D.2002-06-06"
        },
        "answerText": " Minister for Education and Science (Deputy Mary Hanafin)  An application for capital funding towards the provision of an extension has been received from the school referred to by the Deputy. An assessment of projected enrolment trends, demographic trends and housing developments in the area was carried out in order to inform the determination of the long term projected staffing on which the school's accommodation needs will be based. This has been finalised and notified to the school. The progression of all large scale building projects, including this project, from initial design stage through to construction phase will be considered on an on-going basis in the context of my Department's multi-annual School Building and Modernisation Programme. \n Minister for Education and Science (Deputy Mary Hanafin)  The development of a building project for the school in question is at an early stage. The commencement and progression of all large scale building projects from initial design stage through to construction phase, including this project, will be considered on an on-going basis in the context of my Department's Multi-annual School Building and Modernisation Programme. ",
        "showAs": " 345 Deputy Niall Blaney asked the Minister for Education and Science the reason a school (details supplied) in County Cavan are still waiting for the approval of a new school; and if she will make a statement on the matter. \n        [16063/08] ",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_280",
          "showAs": "Schools Building Projects.",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2008-04-29/writtens/dbsect_280",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2008-04-29/writtens/mul@/dbsect_280.xml"
            }
          }
        },
        "house": {
          "houseNo": "30",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "30th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30"
        }
      }
    },
    {
      "contextDate": "2008-04-29",
      "question": {
        "to": {
          "roleCode": null,
          "roleType": null,
          "showAs": "Minister for Education and Science",
          "uri": null
        },
        "date": "2008-04-29",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2008-04-29/pq_368",
        "questionNumber": 368,
        "by": {
          "showAs": "Niall Blaney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "memberCode": "Niall-Blaney.D.2002-06-06"
        },
        "answerText": " Minister for Education and Science (Deputy Mary Hanafin)  The project to which the Deputy refers is currently at an early stage of the architectural planning process.  The progression of all large scale building projects, including this project, from initial design stage through to construction phase will be considered on an on-going basis in the context of my Department's multi-annual School Building and Modernisation Programme. ",
        "showAs": " 368 Deputy Niall Blaney asked the Minister for Education and Science if she will give approval for a school (details supplied) to proceed with a new school; and if she will make a statement on the matter. \n        [16437/08] ",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_299",
          "showAs": "Schools Building Projects.",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2008-04-29/writtens/dbsect_299",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2008-04-29/writtens/mul@/dbsect_299.xml"
            }
          }
        },
        "house": {
          "houseNo": "30",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "30th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30"
        }
      }
    },
    {
      "contextDate": "2008-02-13",
      "question": {
        "by": {
          "showAs": "Niall Blaney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "memberCode": "Niall-Blaney.D.2002-06-06"
        },
        "showAs": " 243 Deputy Niall Blaney asked the Minister for Enterprise, Trade and Employment his views on abolishing capping on community, employment schemes in view of the fact that participants wish to be treated in a similar fashion to those in the rural social scheme where there are no limits on time spent on schemes; and if he will make a statement on the matter. \n        [5388/08] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2008-02-13/pq_149",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2008-02-13/writtens/dbsect_116",
          "showAs": "Community Employment Schemes.",
          "debateSectionId": "dbsect_116",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2008-02-13/writtens/mul@/dbsect_116.xml"
            },
            "pdf": null
          }
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "houseCode": "dail",
          "showAs": "30th Dáil",
          "houseNo": "30",
          "committeeCode": "",
          "chamberType": "house"
        },
        "date": "2008-02-13",
        "answerText": " Minister for Enterprise, Trade and Employment (Deputy Micheál Martin)  Community Employment (CE) is an active labour market programme designed to provide eligible long term unemployed people and other disadvantaged persons with an opportunity to engage in useful work within their communities on a fixed term basis.  The programme helps unemployed people to progress to the open labour market by breaking their experience of unemployment through a return to work routine and assists them in enhancing/developing both their technical and personal skills.  To cater for older workers in particular, in November 2004 I revised the 3 year CE capping to allow those of 55 years of age and over to avail of a 6-year period on CE (based on participation since 3rd April, 2000). Subsequently, the participation limit for persons eligible for CE based on a Social Welfare disability linked payment was increased by 1 year.  These measures were introduced in recognition of the fact that older participants and people with disabilities may find it more difficult to progress into the open labour market. I am informed that the primary purpose of the Rural Social Scheme, under the aegis of the Department of Community, Rural and Gaeltacht Affairs, is to provide income support to low-income farmers and fishermen and to provide certain services of benefit to local communities.  The aim of CE still remains as an active labour market programme with the emphasis on progression into employment.  The programme is managed within this context, with consideration to the availability of resources and the needs of participants and the community.  However, it should be remembered that, in so far as participants remain on CE, they are precluding someone else from benefiting from the programme.  FÁS makes every effort to ensure that differing levels of demand between neighbouring schemes are equalised.  FÁS also operates the programme flexibly as far as possible to ensure the continuation of community projects. In conclusion then, I would say that this Government will continue to support the positive role of CE in meeting the needs of long-term unemployed persons while at the same time providing essential services to communities. In this regard, we are keeping the operation of the Scheme under constant review. ",
        "questionType": "written",
        "to": {
          "showAs": "Minister for Enterprise, Trade and Employment",
          "uri": null,
          "roleType": null,
          "roleCode": null
        },
        "questionNumber": 149
      }
    },
    {
      "contextDate": "2008-02-06",
      "question": {
        "by": {
          "showAs": "Niall Blaney",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "memberCode": "Niall-Blaney.D.2002-06-06"
        },
        "showAs": " 171 Deputy Niall Blaney asked the Minister for Health and Children if she will approve the necessary funding required to allow Letterkenny General Hospital, County Donegal, to expand their existing new renal dialysis facility to furnish four extra stations and revenue costs to staff it; and if she will make a statement on the matter. \n        [3936/08] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2008-02-06/pq_99",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2008-02-06/writtens/dbsect_86",
          "showAs": "Hospital Services.",
          "debateSectionId": "dbsect_86",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2008-02-06/writtens/mul@/dbsect_86.xml"
            },
            "pdf": null
          }
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "houseCode": "dail",
          "showAs": "30th Dáil",
          "houseNo": "30",
          "committeeCode": "",
          "chamberType": "house"
        },
        "date": "2008-02-06",
        "answerText": " Minister for Health and Children (Deputy Mary Harney)  Operational responsibility for the management and delivery of health and personal social services is a matter for the Health Service Executive and funding for all health services has been provided as part of its overall Vote.  Therefore, the Executive is the appropriate body to consider the particular issue raised by the Deputy. My Department has requested the Parliamentary Affairs Division of the Executive to arrange to have the matter investigated and to have a reply issued directly to the Deputy. ",
        "questionType": "written",
        "to": {
          "showAs": "Minister for Health and Children",
          "uri": null,
          "roleType": null,
          "roleCode": null
        },
        "questionNumber": 99
      }
    },
    {
      "contextDate": "2007-12-12",
      "question": {
        "answerText": " Minister of State at the Department of Health and Children (Deputy Máire Hoctor)  Operational responsibility for the management and delivery of health and personal social services was assigned to the Health Service Executive under the Health Act 2004 and funding for all health services has been provided as part of its overall vote.  Therefore, the Executive is the appropriate body to consider the particular matter raised by the Deputy.  My Department has requested the Parliamentary Affairs Division of the Executive to arrange to have the matter investigated and to have a reply issued directly to the Deputy. ",
        "questionType": "written",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "memberCode": "Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney"
        },
        "date": "2007-12-12",
        "questionNumber": 83,
        "to": {
          "roleType": null,
          "uri": null,
          "roleCode": null,
          "showAs": "Minister for Health and Children"
        },
        "debateSection": {
          "debateSectionId": "dbsect_80",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2007-12-12/writtens/dbsect_80",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2007-12-12/writtens/mul@/dbsect_80.xml"
            }
          },
          "showAs": "Voluntary Sector Funding."
        },
        "showAs": " 121 Deputy Niall Blaney asked the Minister for Health and Children if she will intervene on behalf of the Donegal branch of the Alzheimer Society of Ireland in securing appropriate funding from the Health Service Executive to continue its work in helping 1,700 Alzheimer sufferers and their carers in County Donegal; and if she will make a statement on the matter.  \n        [34490/07] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2007-12-12/pq_83",
        "house": {
          "houseNo": "30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "chamberType": "house",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "30th Dáil"
        }
      }
    },
    {
      "contextDate": "2007-12-12",
      "question": {
        "answerText": " Minister for Education and Science (Deputy Mary Hanafin)  The project to which the Deputy refers to is currently at an early stage of architectural planning.  A meeting was held on 29 November 2007 with the school authorities and their Design Team to review the stage 3 submission (developed sketch scheme).  At the meeting further information was sought from the Design Team before the stage could be cleared.  When this is received further progression of the project can be considered.  The progression of all large scale building projects from initial design stage through to construction phase, including this project, is considered on an on-going basis in the context of my Department's Multi-Annual School Building and Modernisation Programme.  The Deputy can be assured that my Department will continue to ensure that building projects are delivered within the earliest possible timeframes. \n Minister for Education and Science (Deputy Mary Hanafin)  An application for capital funding towards the provision of an extension at the school referred to by the Deputy has been assessed and the long term projected enrolments has been determined.  In order to determine how best to provide for the school's future accommodation needs, a technical assessment of the existing school buildings will have to be carried out in order to finalise the schedules of accommodation. The building project required to meet the school's accommodation needs will be considered in the context of the multi-annual School Building and Modernisation Programme. \n Minister for Education and Science (Deputy Mary Hanafin)  While almost €600 million has been provided in the Budget for school buildings next year, given the priorities facing my Department, it would not be feasible to make funding available for the type of project to which the Deputy refers. ",
        "questionType": "written",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "memberCode": "Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney"
        },
        "date": "2007-12-12",
        "questionNumber": 118,
        "to": {
          "roleType": null,
          "uri": null,
          "roleCode": null,
          "showAs": "Minister for Education and Science"
        },
        "debateSection": {
          "debateSectionId": "dbsect_106",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2007-12-12/writtens/dbsect_106",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2007-12-12/writtens/mul@/dbsect_106.xml"
            }
          },
          "showAs": "Schools Building Projects."
        },
        "showAs": " 156 Deputy Niall Blaney asked the Minister for Education and Science if she will expedite an application by a school (details supplied) in County Donegal for an extension; and if she will make a statement on the matter. \n        [34488/07] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2007-12-12/pq_118",
        "house": {
          "houseNo": "30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "chamberType": "house",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "30th Dáil"
        }
      }
    },
    {
      "contextDate": "2007-12-12",
      "question": {
        "answerText": " Minister for Education and Science (Deputy Mary Hanafin)  The project to which the Deputy refers to is currently at an early stage of architectural planning.  A meeting was held on 29 November 2007 with the school authorities and their Design Team to review the stage 3 submission (developed sketch scheme).  At the meeting further information was sought from the Design Team before the stage could be cleared.  When this is received further progression of the project can be considered.  The progression of all large scale building projects from initial design stage through to construction phase, including this project, is considered on an on-going basis in the context of my Department's Multi-Annual School Building and Modernisation Programme.  The Deputy can be assured that my Department will continue to ensure that building projects are delivered within the earliest possible timeframes. \n Minister for Education and Science (Deputy Mary Hanafin)  An application for capital funding towards the provision of an extension at the school referred to by the Deputy has been assessed and the long term projected enrolments has been determined.  In order to determine how best to provide for the school's future accommodation needs, a technical assessment of the existing school buildings will have to be carried out in order to finalise the schedules of accommodation. The building project required to meet the school's accommodation needs will be considered in the context of the multi-annual School Building and Modernisation Programme. \n Minister for Education and Science (Deputy Mary Hanafin)  While almost €600 million has been provided in the Budget for school buildings next year, given the priorities facing my Department, it would not be feasible to make funding available for the type of project to which the Deputy refers. ",
        "questionType": "written",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "memberCode": "Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney"
        },
        "date": "2007-12-12",
        "questionNumber": 119,
        "to": {
          "roleType": null,
          "uri": null,
          "roleCode": null,
          "showAs": "Minister for Education and Science"
        },
        "debateSection": {
          "debateSectionId": "dbsect_106",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2007-12-12/writtens/dbsect_106",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2007-12-12/writtens/mul@/dbsect_106.xml"
            }
          },
          "showAs": "Schools Building Projects."
        },
        "showAs": " 157 Deputy Niall Blaney asked the Minister for Education and Science the position regarding the proposed new building project at a school (details supplied) in County Donegal; and if she will make a statement on the matter. \n        [34489/07] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2007-12-12/pq_119",
        "house": {
          "houseNo": "30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "chamberType": "house",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "30th Dáil"
        }
      }
    },
    {
      "contextDate": "2007-12-05",
      "question": {
        "answerText": " Minister for Health and Children (Deputy Mary Harney)  The Health Service Executive has responsibility for administering the Repayment Scheme and the information sought by the Deputy relates to matters within the area of responsibility of the Executive.  My Department has requested the Parliamentary Affairs Division of the Executive to arrange to have the matter investigated and to have a reply issued to the Deputy. ",
        "questionType": "written",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "memberCode": "Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney"
        },
        "date": "2007-12-05",
        "questionNumber": 95,
        "to": {
          "roleType": null,
          "uri": null,
          "roleCode": null,
          "showAs": "Minister for Health and Children"
        },
        "debateSection": {
          "debateSectionId": "dbsect_99",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2007-12-05/writtens/dbsect_99",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2007-12-05/writtens/mul@/dbsect_99.xml"
            }
          },
          "showAs": "Nursing Homes Repayment Scheme."
        },
        "showAs": " 134 Deputy Niall Blaney asked the Minister for Health and Children if she will expedite an application submitted under the health repayment scheme for a person (details supplied) in County Donegal; and if she will make a statement on the matter. \n        [32810/07] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2007-12-05/pq_95",
        "house": {
          "houseNo": "30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "chamberType": "house",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "30th Dáil"
        }
      }
    },
    {
      "contextDate": "2007-11-13",
      "question": {
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Minister for Education and Science"
        },
        "answerText": " Minister for Education and Science (Deputy Mary Hanafin)  The building project for the School referred to by the Deputy is at an early stage of architectural planning.  The School authorities have recently been requested to submit an addendum to the original stage 2 report (developed sketch scheme). When this information is received in my Department it will be evaluated by my Department's technical team.  Progression of all building projects will be considered in the context of my Department's multi-annual Schools Building and Modernisation programme. ",
        "debateSection": {
          "debateSectionId": "dbsect_245",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2007-11-13/writtens/dbsect_245",
          "showAs": "Schools Building Projects.",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2007-11-13/writtens/mul@/dbsect_245.xml"
            },
            "pdf": null
          }
        },
        "house": {
          "chamberType": "house",
          "houseNo": "30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "houseCode": "dail",
          "committeeCode": "",
          "showAs": "30th Dáil"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2007-11-13/pq_312",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney",
          "memberCode": "Niall-Blaney.D.2002-06-06"
        },
        "date": "2007-11-13",
        "questionNumber": 312,
        "showAs": " 345 Deputy Niall Blaney   asked the Minister for Education and Science if she will assist in progressing a proposed building project for a school (details supplied) in County Donegal; and if she will make a statement on the matter. \n        [28181/07] "
      }
    },
    {
      "contextDate": "2007-11-13",
      "question": {
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Minister for Justice, Equality and Law Reform"
        },
        "answerText": " Minister for Justice, Equality and Law Reform (Deputy Brian Lenihan)  The experience of the Visa Office in processing applications for D-type visas is that applicants often overlook to include all the documents required to accompany such applications.  This can lead to refusal of the application or, at the very least, a substantial delay in processing.  The website of the Irish Naturalisation and Immigration Service www.inis.gov.ie lists the documentation required to accompany visa applications. \n Minister for Justice, Equality and Law Reform (Deputy Brian Lenihan)  The person in question entered the State on 16 November, 2002 on foot of a work permit.  He resigned from his employment in October, 2005 and therefore had no legal reason to remain in the State.  On 4 October, 2006 the person in question signed a declaration of consent to deportation which was witnesses by a member of An Garda Síochána. A request was then made to my Department by An Garda Síochána requesting the making of a deportation order.  On receipt of this request the case of the person concerned was examined under section 3(6) of the Immigration Act,1999 as amended, and section 5 of the Refugee Act, 1996 on the Prohibition of Refoulement. On 25th November, 2006 my predecessor refused temporary leave to remain in the State and a deportation order was signed in respect of the person concerned. Notice of this order was subsequently served by members of An Garda Síochána by hand on the person concerned in Castlerea Prison, in order for him to make travel arrangements for his deportation from the State.  A consent for deportation order as served on the person concerned is only valid for 3 months pursuant to section 3 subsection 8 of the Immigration Act 1999. This deportation order has since expired. A fresh notice to deport letter was issued by An Garda Síochána by hand to the person concerned in Castlerea Prison on 14th March 2007. Fresh representations were received from the person concerned by my Department on 26th March 2007.  As the case of the person concerned is still under consideration under Section 3 of the Immigration Act 1999 his passport cannot be returned at this stage.  This person's case file will be examined under Section 3 of the Immigration Act 1999 and Section 5 of the Refugee Act 1996.  I expect the file to be submitted to me for a decision in due course. \n Minister for Justice, Equality and Law Reform (Deputy Brian Lenihan)  The person in question made an application for residence in the State on the basis of a proposal to operate a software business in the State in September 2007 and was refused by letter of the 16 October 2007.  Among the criteria for obtaining permission to operate a viable trading concern in the State is, (a) that the proposed business must result in the transfer to the State of a minimum capital investment of €300,000 and (b) the proposed business must create employment for at least two EEA nationals for a new project. The applicant did not provide any supporting documentation to show he meets with (a) or (b) above. The Immigration Operations Section of my Department has reviewed this application and is of the view that on the basis of the information supplied that the person in question remains a student and does not meet the criteria for residence in the State on the basis of the Business Permission Scheme as currently constituted. ",
        "debateSection": {
          "debateSectionId": "dbsect_334",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2007-11-13/writtens/dbsect_334",
          "showAs": "Visa Applications.",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2007-11-13/writtens/mul@/dbsect_334.xml"
            },
            "pdf": null
          }
        },
        "house": {
          "chamberType": "house",
          "houseNo": "30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "houseCode": "dail",
          "committeeCode": "",
          "showAs": "30th Dáil"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2007-11-13/pq_438",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney",
          "memberCode": "Niall-Blaney.D.2002-06-06"
        },
        "date": "2007-11-13",
        "questionNumber": 438,
        "showAs": " 471 Deputy Niall Blaney   asked the Minister for Justice, Equality and Law Reform if he will intervene on behalf of a person (details supplied) in County Donegal; and if he will make a statement on the matter. \n        [28450/07] "
      }
    },
    {
      "contextDate": "2007-11-08",
      "question": {
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Minister for Education and Science"
        },
        "answerText": " Minister for Education and Science (Deputy Mary Hanafin)  The tender report for the school referred to by the Deputy is under examination in my Department at present. The school's Board of Management will be kept advised of developments when the examination is complete. \n Minister for Education and Science (Deputy Mary Hanafin)  The building project for the school in question will be considered in the context of the multi-annual School Building and Modernisation Programme. ",
        "debateSection": {
          "debateSectionId": "dbsect_123",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2007-11-08/writtens/dbsect_123",
          "showAs": "Schools Building Projects.",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2007-11-08/writtens/mul@/dbsect_123.xml"
            },
            "pdf": null
          }
        },
        "house": {
          "chamberType": "house",
          "houseNo": "30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "houseCode": "dail",
          "committeeCode": "",
          "showAs": "30th Dáil"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2007-11-08/pq_151",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney",
          "memberCode": "Niall-Blaney.D.2002-06-06"
        },
        "date": "2007-11-08",
        "questionNumber": 151,
        "showAs": " 146 Deputy Niall Blaney asked the Minister for Education and Science if she will expedite an application by a school (details supplied) in County Donegal for a new eight classroom school. \n        [27907/07] "
      }
    },
    {
      "contextDate": "2007-11-06",
      "question": {
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Minister for Education and Science"
        },
        "answerText": " Minister of State at the Department of Education and Science (Deputy Seán Haughey)  I propose to take Questions Nos. 344, 366, 367, 370, 371, 373, 398 and 420 together.  The Vocational Training Opportunities Scheme (VTOS) is a second chance education initiative for unemployed persons,  who are at least 21 years of age and in receipt of specified social welfare payments for at least six months, which is funded by my Department. It is operated through the Vocational Education Committees.  The aims of the Scheme are to give unemployed people education and training opportunities which will develop and prepare them to go into paid employment or on to further education opportunities leading to paid employment.  A training allowance is paid by the VECs to students who previously drew unemployment benefit or assistance. The student ceases to receive an unemployment payment and, instead, receives a VTOS training allowance at a rate equivalent to the maximum rate of unemployment benefit, plus a payment for an adult or child dependant, if appropriate. VTOS students also retain their social welfare secondary benefits.  The allowances for VTOS students, for meals and travel, referred to in the questions are equivalent to these paid to participants on FÁS training courses. VTOS students may be entitled to a travel allowance if they reside more than 3 miles from a centre. These allowances are increased periodically in line with increases in FÁS rates. The current rates are in operation since 2002. There are no plans to increase them in the near future. ",
        "debateSection": {
          "debateSectionId": "dbsect_232",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2007-11-06/writtens/dbsect_232",
          "showAs": "Vocational Training Opportunities Scheme.",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2007-11-06/writtens/mul@/dbsect_232.xml"
            },
            "pdf": null
          }
        },
        "house": {
          "chamberType": "house",
          "houseNo": "30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "houseCode": "dail",
          "committeeCode": "",
          "showAs": "30th Dáil"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2007-11-06/pq_313",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney",
          "memberCode": "Niall-Blaney.D.2002-06-06"
        },
        "date": "2007-11-06",
        "questionNumber": 313,
        "showAs": " 371 Deputy Niall Blaney asked the Minister for Education and Science her views on increasing meal and travel allowance for VTOS learners with meal allowance currently only €4 per week and travel allowance also being substandard; and if she will make a statement on the matter. \n        [27040/07] "
      }
    },
    {
      "question": {
        "questionType": "written",
        "answerText": " Minister for Enterprise, Trade and Employment (Deputy Micheál Martin)  I understand from IDA Ireland that Boston Scientific recently announced a head count and expense reduction plan which is part of the company's overall plan to bring expenses in line with revenues and restore competitiveness.  The company confirmed that the vast majority of the cuts announced will be in non-manufacturing jobs in the United States.  The process of deciding the exact rationalisation plans in each Boston Scientific plant worldwide has only just commenced.  Donegal is a key target location for IDA and the County is now competing for a different type of business to labour intensive manufacturing, on which it relied so heavily in the past.  Investors are, in the main, seeking a large urban base with third level education facilities, well developed infrastructure as well as top quality business services that are international in focus.  In line with this, IDA Ireland has adopted a focused approach in the County with Letterkenny as the main location for IDA development efforts.  The IDA strategy fits with the National Spatial Strategy, which sets out a framework for use in planning and investment in the public and private sectors.  The Strategy seeks to enhance the performance of strategically placed ‘Gateways', in Donegal's case the linked gateway of Letterkenny and Derry.  This Gateway will create the conditions necessary to drive economic growth and will be at the heart of extending balanced regional development to the region.  Progress has been made by IDA in securing new investments from Pacificare, Pramerica, SITA and Abbott Diabetes with approximately 1,200 new jobs being added in the County by overseas firms over the last five years.  These companies continue to recruit and are actively seeking new staff.  I can assure the Deputy that enterprise development in County Donegal is, and will remain, a priority for the State development agencies under the auspices of my Department. ",
        "questionNumber": 266,
        "to": {
          "uri": null,
          "showAs": "Minister for Enterprise, Trade and Employment",
          "roleType": null,
          "roleCode": null
        },
        "house": {
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "chamberType": "house",
          "houseNo": "30",
          "showAs": "30th Dáil"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2007-10-31/pq_266",
        "date": "2007-10-31",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "memberCode": "Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2007-10-31/writtens/dbsect_197",
          "showAs": "Job Losses.",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2007-10-31/writtens/mul@/dbsect_197.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_197"
        },
        "showAs": " 303 Deputy Niall Blaney asked the Minister for Enterprise, Trade and Employment the position in relation to the loss of jobs (details supplied) in County Donegal; the measures that have been or will be put in place for those that are laid off in relation to redundancy plans or training opportunities; and if he will make a statement on the matter. \n        [25979/07] "
      },
      "contextDate": "2007-10-31"
    },
    {
      "question": {
        "questionType": "written",
        "answerText": " Minister for Education and Science (Deputy Mary Hanafin)  The process of appointing a Design Team to the school building project referred to by the Deputy is at an advanced stage.  Progression of all projects through the architectural planning process will be considered in the context of my Department's multi-annual School Building and Modernisation programme. ",
        "questionNumber": 397,
        "to": {
          "uri": null,
          "showAs": "Minister for Education and Science",
          "roleType": null,
          "roleCode": null
        },
        "house": {
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "chamberType": "house",
          "houseNo": "30",
          "showAs": "30th Dáil"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2007-10-31/pq_397",
        "date": "2007-10-31",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "memberCode": "Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2007-10-31/writtens/dbsect_296",
          "showAs": "School Accommodation.",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2007-10-31/writtens/mul@/dbsect_296.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_296"
        },
        "showAs": " 441 Deputy Niall Blaney asked the Minister for Education and Science the position in relation to an application for additional accommodation at a school (details supplied); if she will have it expedited; and if she will make a statement on the matter. \n        [26394/07] "
      },
      "contextDate": "2007-10-31"
    },
    {
      "question": {
        "questionType": "written",
        "answerText": " Minister of State at the Department of Enterprise, Trade and Employment (Deputy Billy Kelleher)  I can confirm that the person (details supplied by the Deputy) has been summonsed to appear at Carndonagh District Court on the 20th of November 2007.  As the matter is effectively sub-judice, it would be inappropriate for me to comment any further. ",
        "questionNumber": 98,
        "to": {
          "uri": null,
          "showAs": "Minister for Enterprise, Trade and Employment",
          "roleType": null,
          "roleCode": null
        },
        "house": {
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/30",
          "chamberType": "house",
          "houseNo": "30",
          "showAs": "30th Dáil"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2007-10-25/pq_98",
        "date": "2007-10-25",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Blaney.D.2002-06-06",
          "memberCode": "Niall-Blaney.D.2002-06-06",
          "showAs": "Niall Blaney"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2007-10-25/writtens/dbsect_97",
          "showAs": "Employment Rights.",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2007-10-25/writtens/mul@/dbsect_97.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_97"
        },
        "showAs": " 96 Deputy Niall Blaney asked the Minister for Enterprise, Trade and Employment the position in relation to a person (details supplied) in County Donegal who has been summonsed to appear in the District Court Office, Carndonagh; and if he will make a statement on the matter. \n        [25826/07] "
      },
      "contextDate": "2007-10-25"
    }
  ]
}