{
  "head": {
    "counts": {
      "questionCount": 2022,
      "resultCount": 2022
    }
  },
  "results": [
    {
      "contextDate": "2020-06-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/mul@/dbsect_147.xml"
            }
          },
          "debateSectionId": "dbsect_147",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/dbsect_147",
          "showAs": "Special Educational Needs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-23/pq_157",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 157,
        "showAs": " 157. Deputy Darragh O'Brien asked the Minister for Education and Skills the status of progress in providing additional accommodation at a school (details supplied) to cater for the increased demand for special needs education and for additional places for children to attend the ASD units; and if he will make a statement on the matter. [11935/20] ",
        "answerText": " Minister for Education and Skills  I am pleased to inform the Deputy that funding was approved under the Additional Accommodation Scheme to enable the school in question to build a four classroom SEN base.  The project has been devolved for delivery to Louth & Meath ETB. The next step will be for the ETB to procure a consultant. This consultant will lead the project through the various stages of architectural planning and onwards through the statutory planning process and construction. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-23",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-06-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/mul@/dbsect_610.xml"
            }
          },
          "debateSectionId": "dbsect_610",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/dbsect_610",
          "showAs": "Covid-19 Pandemic"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-23/pq_669",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 669,
        "showAs": " 669. Deputy Darragh O'Brien asked the Minister for Transport, Tourism and Sport if his Department has produced a set of guidelines for taxi drivers to return to work safely as the country leaves lockdown; and if he will make a statement on the matter. [11947/20] ",
        "answerText": " Minister for Transport, Tourism and Sport  I propose to take Questions Nos. 669 and 671 together.  The National Transport Authority (NTA), as the statutory regulator for the SPSV sector, has published information for the SPSV industry which includes guidelines, based on the latest available public health advice, on how to keep vehicles clean to reduce the spread of COVID-19. This document is available on the NTA's website. The NTA is also engaging with public transport operators to determine the practical implications for public transport provision as COVID-19 restrictions are eased in Ireland.  Given the role of the NTA as regulator, I have referred your question to the Authority for direct reply to you. Please advise my private office if you do not receive a response within 10 working days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-23",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_16.xml"
            }
          },
          "debateSectionId": "dbsect_16",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_16",
          "showAs": "Naval Service"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_14",
        "to": {
          "roleType": null,
          "showAs": "Defence",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 14,
        "showAs": " 14. Deputy Darragh O'Brien asked the Taoiseach and Minister for Defence his plans for the purchase of a multirole vessel for the Naval Service in view of the contribution by the Naval Service vessels during the Covid-19 crisis; when the tender competition will be held; and if he will make a statement on the matter. [11385/20] ",
        "answerText": " Minister of State at the Department of Defence  My priority as Minister with Responsibility for Defence is to ensure that the operational capability of the Army, Air Corps and Naval Service is maintained to the greatest extent possible so as to enable the Defence Forces to carry out their roles as assigned by Government both at home and overseas.  The acquisition of new equipment for the Defence Forces remains a clear focus for me. Future equipment priorities for the Army, Air Corps and Naval Service are being considered in the context of the White Paper on Defence as part of the capability development and equipment priorities planning process.  The principal aim over the period of the White Paper will be to replace and upgrade, as required, existing capabilities in order to retain a flexible response for a wide range of operational requirements, including response to security risks and other emergencies, both at home and overseas.  The current capital allocation for Defence is €113 million for 2020, an increase of €7 million on National Development Plan 2019 allocation.  The NDP - Project Ireland 2040 - provides financial allocations for a total of €541 million for Defence over the period 2018-2022. This level of capital funding will allow the Defence Organisation to undertake a programme of sustained equipment replacement and infrastructural development across the Army, Air Corps and Naval Service as identified and prioritised in the Defence White Paper and builds on the significant investment programme over recent years.  However, in light of the unexpected level of expenditure linked to the Covid crisis this may be the subject of review.  The White Paper underpins the ongoing replacement of the Naval Service fleet. A significant investment over recent years has been on the procurement of new Off-Shore Patrol Vessels (OPVs) for the Naval Service. The fourth ship in the programme, LÉ George Bernard Shaw, was commissioned into service in May 2019 reflecting an investment by the Government of over €250 million in the new ships programme since 2010. The four ships are performing well in operational service.  In addition, works on the mid life refit of LÉ Roisín are underway and this will be followed by mid life refit works on LÉ Niamh.  Further to the Off-Shore Patrol Vessels Project, the White Paper also provides for the replacement of the current Naval Service flagship LÉ Eithne with a multi role vessel (MRV). Planning is underway on this project and it is intended to hold a public tender competition to cover the supply of the MRV.  As with the purchase of any major defence platform and complex project, it requires the finalisation of required capabilities to enable a specification of requirements  to be defined before a tender competition can  can go to the market and work is ongoing in this regard. In addition, the timing and scope of the project will be subject to the public funding available within the overall Defence capital funding envelope The cost of the MRV will only be known once a tender competition is concluded. It is important to note that while the MRV will operate as naval asset, its role is very much a whole of defence one with the capacity to contribute to the wider maritime domain.  I am satisfied that the Defence Forces have the necessary resources available to them, including a modern and effective range of equipment which is line with best international standards in order to fulfil all roles assigned to them by Government.  The Naval Service made a significant positive contribution to the Covid 19 crisis with its existing flotilla. It participated in Operation Fortitude in support of the Defence Forces response to Covid 19. It has supplied six ships, to support the interagency response to Covid 19 in Dublin, Cork and Galway.  The six ships were  - LÉ Samuel Beckett  - LÉ James Joyce  - LÉ William Butler Yeats  - LÉ George Bernard Shaw  - LÉ Niamh  - LÉ Eithne. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_53.xml"
            }
          },
          "debateSectionId": "dbsect_53",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_53",
          "showAs": "Mortgage Lending"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_59",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 59,
        "showAs": " 59. Deputy Darragh O'Brien asked the Minister for Finance if his attention has been drawn to cases in which persons are availing of the temporary wage subsidy scheme which is then having negative implications on their ability to draw down mortgage offers from banks; the actions he has taken to counteract this; and if he will make a statement on the matter. [10588/20] ",
        "answerText": " Minister for Finance  The European Union (Consumer Mortgage Credit Agreements) Regulations 2016 (CMCAR) provide that, before concluding a mortgage credit agreement, a lender must make a thorough assessment of the consumer’s creditworthiness. That assessment must take appropriate account of factors relevant to verifying the prospect of the consumer being able to meet his or her obligations under the credit agreement. The CMCAR also provide that a lender should only make credit available to a consumer where the result of the creditworthiness assessment indicates that the consumer’s obligations resulting from the credit agreement are likely to be met in the manner required under that agreement. The assessment of creditworthiness must be carried out on the basis of information on the consumer’s income and expenses and other financial and economic circumstances which is necessary, sufficient and proportionate. In addition, the Central Bank’s Consumer Protection Code 2012 imposes ‘Knowing the Consumer and Suitability’ requirements on lenders. Under these requirements, lenders are required to assess affordability of credit and the suitability of a product or service based on the individual circumstances of each borrower.  Within the parameters of this regulatory framework, the decision to grant or refuse an individual application for mortgage credit is a commercial decision to be made by the regulated entity. Where a formal loan offer is made by a lender, the loan offer may contain a condition that may allow the lender to withdraw or vary the offer if in the lender’s opinion there is any material change in circumstances prior to drawdown. In such cases, the decision to withdraw or vary the loan offer is also a commercial decision for the lender.  Lenders continue to process mortgage applications and have supports in place to assist customers impacted by COVID-19. The Banking & Payments Federation Ireland (BPFI) has published a Covid-19 Support FAQ which customers can consult, or customers can contact their lender directly, if they have any queries or concerns about the impact of COVID-19 on their mortgage application. In addition, the Central Bank has indicated that it expects all regulated firms to take a consumer-focused approach and to act in their customers’ best interests at all times, including during the COVID-19 pandemic. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_209.xml"
            }
          },
          "debateSectionId": "dbsect_209",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_209",
          "showAs": "English Language Training Organisations"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_230",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 230,
        "showAs": " 230. Deputy Darragh O'Brien asked the Minister for Education and Skills if he has published guidelines for the reopening of English language schools following the phased reopening of society; if so, if the guidelines will be provided; and if he will make a statement on the matter.  [10989/20] ",
        "answerText": " Minister for Education and Skills  I am aware of the challenges that are being encountered in the English language education sector and the substantial impact that the Covid-19 outbreak has had on students, teachers and providers in this sector.  The timeline and arrangements for the safe re-opening of English language education providers will be guided by public health advice applicable at a given time. The Government's roadmap for the gradual lifting of the current Covid-19 restrictions has set out a number of phases with the re-opening of the wider education system contained in the later phases to coincide broadly with the beginning of the new academic year.  While my Department will not be issuing guidelines specifically for the re-opening of the English language education sector, guidance to assist the tertiary education sector more generally in planning for reopening is being prepared at present and will be available shortly.  My Department will also engage with provider representatives within the English language education sector as they develop more detailed plans for the re-opening of their premises. It is to be expected that ensuring the health and safety of staff and students will be central to the provider's plans and that necessary consultations will be undertaken as part of their development. It is anticipated that the \"Return to Work Safely Protocol\" recently published jointly by the Department of Health and the Department of Enterprise, Business & Innovation, and designed to support measures being put in place that will prevent the spread of COVID-19 in the workplace will be used to inform these plans and will be supplemented by the guidance for the tertiary sector.  The protocol envisions close engagement between staff and their employers during the planning, development and implementation of these new workplace measures.  The experience of the re-opening of educational facilities in other areas and jurisdictions will also be relevant as part of this process. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_220.xml"
            }
          },
          "debateSectionId": "dbsect_220",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_220",
          "showAs": "Schools Building Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_243",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 243,
        "showAs": " 243. Deputy Darragh O'Brien asked the Minister for Education and Skills the status of progress on the extension of a school (details supplied); if the school will be ready for the beginning of the academic school year in September 2020; and if he will make a statement on the matter. [11090/20] ",
        "answerText": " Minister for Education and Skills  I wish to advise the Deputy that my Department is in receipt of an application, for additional school accommodation, from the school authority in question. The assessment process to determine the school’s permanent accommodation needs is nearing completion. The school will be informed of the decision in due course.  In the meantime, interim temporary accommodation has been approved to cater for the schools need in the short term.  The school authority has advised that they have accommodation to cater for the start of the next academic year. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_221.xml"
            }
          },
          "debateSectionId": "dbsect_221",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_221",
          "showAs": "Schools Building Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_244",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 244,
        "showAs": " 244. Deputy Darragh O'Brien asked the Minister for Education and Skills the status of the new school building for a school (details supplied); and if he will make a statement on the matter. [11091/20] ",
        "answerText": " Minister for Education and Skills  I am pleased to inform the Deputy that funding was approved under my Department's Additional Accommodation Scheme to enable the school in question to build 2 mainstream classrooms and 1 WC for assisted users.  In addition, 4 mainstream classrooms and 2 resource rooms to replace existing prefabs were approved.  The project has been devolved for delivery to the School Authority.  The next step will be for the school to procure a consultant. This consultant will lead the project through the various stages of architectural planning and onwards through the statutory planning process and construction stages. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_222.xml"
            }
          },
          "debateSectionId": "dbsect_222",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_222",
          "showAs": "Schools Building Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_245",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 245,
        "showAs": " 245. Deputy Darragh O'Brien asked the Minister for Education and Skills if the extension and refurbishment of a school (details supplied) will proceed to the tender and build stage by granting the school rapid-build status; and if he will make a statement on the matter.  [11092/20] ",
        "answerText": " Minister for Education and Skills  As the Deputy is aware, the project to which he refers has been devolved to Dublin & Dún Laoghaire Education and Training Board (DDLETB) for delivery.  My Department is fully aware of the need to urgently progress this project. However, it is of the utmost importance that the final outcome will be the correct one for both the school authority and the pupils. In that regard, I would like to inform the Deputy that, arising from its due diligence in respect of the preparation of the revised pre-qualification process for this project, DDLETB has carried out a review of the project which puts forward an alternative option for progressing it. A report has been received from DDLETB in that respect. This report is being reviewed by my Department and due consideration given to the proposals set out therein.  In any event, I can advise the Deputy that as the delivery method for the project has already been determined, it is not possible to consider inclusion of the project in the Department's Design and Build Programme or, indeed, any other alternative method of delivery. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_223.xml"
            }
          },
          "debateSectionId": "dbsect_223",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_223",
          "showAs": "Schools Building Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_246",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 246,
        "showAs": " 246. Deputy Darragh O'Brien asked the Minister for Education and Skills the status of the new school building project for a school (details supplied); if the acquisition of a new site for the school has been completed; and if he will make a statement on the matter.  [11093/20] ",
        "answerText": " Minister for Education and Skills  I propose to answer Questions Nos. 246 and 254 together.  As the Deputy is aware, a building project for the school in question is included on my Department's school building programme to be delivered under the National Development Plan (NDP).  I am pleased to inform the Deputy that the acquisition of a site to facilitate the construction of a new school building has closed.  This site will will accommodate this school as well as a primary school and will act as a campus arrangement.  My Department is currently finalising the accommodation brief with the aim of progressing the project into the architectural planning process. My Department will be in direct contact with the school authority at that point. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_224.xml"
            }
          },
          "debateSectionId": "dbsect_224",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_224",
          "showAs": "Schools Building Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_247",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 247,
        "showAs": " 247. Deputy Darragh O'Brien asked the Minister for Education and Skills the status of the refurbishment and provision of an extension for a school (details supplied); and if he will make a statement on the matter. [11094/20] ",
        "answerText": " Minister for Education and Skills  The building project for the school referred to by the Deputy is included in My Department’s Construction Programme which is being delivered under the National Development Plan.  This project is one of the school building projects on my Department’s ADAPT 2 Programme. My Department has appointed a Project Manager for the ADAPT 2 Programme, which contains 18 school building projects.  The appointment of a Design Team (Architect, Quantity Surveyor, Civil & Structural Engineer, Mechanical & Electrical Engineer and Project Supervisor for the Design Process) for the school in question has been completed.  The Design Team is currently working on Stage 1 of Architectural Planning which includes Site Report, Site Suitability and producing Initial Sketch Schemes. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_225.xml"
            }
          },
          "debateSectionId": "dbsect_225",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_225",
          "showAs": "Schools Building Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_248",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 248,
        "showAs": " 248. Deputy Darragh O'Brien asked the Minister for Education and Skills the commencement date for the prefab replacement for a school (details supplied); and if he will make a statement on the matter. [11095/20] ",
        "answerText": " Minister for Education and Skills  The building project for the school referred to by the Deputy is included in My Department’s Construction Programme which is being delivered under the National Development Plan.  This project is one of the school building projects on my Department’s ADAPT 2 Programme. My Department has appointed a Project Manager for the ADAPT 2 Programme, which contains 18 school building projects.  The appointment of a Design Team (Architect, Quantity Surveyor, Civil & Structural Engineer, Mechanical & Electrical Engineer and Project Supervisor for the Design Process) for the school in question has been completed.  The Design Team is currently working on Stage 1 of Architectural Planning which includes Site Report, Site Suitability and producing Initial Sketch Schemes. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_226.xml"
            }
          },
          "debateSectionId": "dbsect_226",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_226",
          "showAs": "Schools Building Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_249",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 249,
        "showAs": " 249. Deputy Darragh O'Brien asked the Minister for Education and Skills the status of progress in the delivery of a new school building for a school (details supplied); and if he will make a statement on the matter.  [11096/20] ",
        "answerText": " Minister for Education and Skills  The building project for the school referred to by the Deputy is included in my Department’s Construction Programme which is being delivered under the National Development Plan.  This project is one of the school building projects on my Department’s ADAPT 2 Programme. My Department has appointed a Project Manager for the ADAPT 2 Programme, which contains 18 school building projects.  A Design Team – (Architect, Quantity Surveyor, Civil & Structural Engineer, Mechanical & Electrical Engineer and Project Supervisor for the Design Process) has also been appointed for the school in question.  The appointed Design Team has commenced work on Stage 1 (Site Suitability, Site Report, Initial Sketch Scheme) of Architectural planning. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_227.xml"
            }
          },
          "debateSectionId": "dbsect_227",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_227",
          "showAs": "Schools Building Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_250",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 250,
        "showAs": " 250. Deputy Darragh O'Brien asked the Minister for Education and Skills the position regarding progress on a permanent school building project for a school (details supplied); and if he will make a statement on the matter.  [11097/20] ",
        "answerText": " Minister for Education and Skills  The major building project for the school referred to by the Deputy is included in the Department’s Construction Programme which is being delivered under the National Development Plan.  The project is currently at an advanced stage of architectural planning, Stage 2(b) - Detailed Design, which includes the application for statutory approvals and the preparation of tender documents. Statutory approvals in relation to the permanent new school build have been secured.  Following the appointment of a replacement consultant architect, the Design Team has reviewed the previous Stage 2(b) documentation and is currently upgrading the design to ensure that the new school building is a Near Zero Energy Building (NZEB) in compliance with the 2017 amendment to Part L of the Building Regulations.  The Design Team is also finalising the detail in relation to the provision of temporary accommodation and playground facilities during the construction of the new school building. Statutory approvals in relation to these are currently being prepared by the Design Team.  Upon  receipt and review of the Stage 2(b) submission, my Department will revert to the Board of Management regarding the further progression of the project at that time. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_229.xml"
            }
          },
          "debateSectionId": "dbsect_229",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_229",
          "showAs": "Schools Site Acquisitions"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_251",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 251,
        "showAs": " 251. Deputy Darragh O'Brien asked the Minister for Education and Skills the status of the provision of a new secondary school for the Swords area of County Dublin as announced in November 2015; if locations have been identified for the proposed school; and if he will make a statement on the matter. [11098/20] ",
        "answerText": " Minister for Education and Skills  I am pleased to advise the Deputy that planning permission has been secured for a Post-Primary school (Swords Community College RN 76475D) on a site in North Swords (Mooretown).  A building contractor was appointed and construction commenced in April 2019. The anticipated handover of the school is Q3 2020. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_230.xml"
            }
          },
          "debateSectionId": "dbsect_230",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_230",
          "showAs": "Schools Site Acquisitions"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_252",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 252,
        "showAs": " 252. Deputy Darragh O'Brien asked the Minister for Education and Skills the status of the provision of a new secondary school for the Malahide and Portmarnock areas of County Dublin as announced in November 2015; if locations for the proposed schools have been identified; and if he will make a statement on the matter. [11099/20] ",
        "answerText": " Minister for Education and Skills  The building project for the school referred to by the Deputy is being delivered under my Department's Design & Build Programme. This delivery programme uses a professional external Project Management team to progress the project through the stages of architectural planning, tendering and construction  It is anticipated that the project will proceed to tender shortly as part of a larger bundle of projects. My Department is working to have the first phase of the school's permanent accommodation handed over for occupation as early as possible in the 2021/22 school year. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_231.xml"
            }
          },
          "debateSectionId": "dbsect_231",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_231",
          "showAs": "Schools Site Acquisitions"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_253",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 253,
        "showAs": " 253. Deputy Darragh O'Brien asked the Minister for Education and Skills the status of the provision of a permanent site for a school (details supplied); and if he will make a statement on the matter. [11100/20] ",
        "answerText": " Minister for Education and Skills  As the Deputy is aware, the building project for the school in question is included in my Department's capital programme.  Officials in my Department are progressing the acquisition of a suitable site where the school will be permanently accommodated.  While a site acquisition process is underway, due to commercial sensitivities associated with land acquisitions generally I am not in a position to comment further at this time. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_223.xml"
            }
          },
          "debateSectionId": "dbsect_223",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_223",
          "showAs": "Schools Building Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_254",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 254,
        "showAs": " 254. Deputy Darragh O'Brien asked the Minister for Education and Skills the position regarding progress on a new school building project for a school (details supplied); and if he will make a statement on the matter. [11101/20] ",
        "answerText": " Minister for Education and Skills  I propose to answer Questions Nos. 246 and 254 together.  As the Deputy is aware, a building project for the school in question is included on my Department's school building programme to be delivered under the National Development Plan (NDP).  I am pleased to inform the Deputy that the acquisition of a site to facilitate the construction of a new school building has closed.  This site will will accommodate this school as well as a primary school and will act as a campus arrangement.  My Department is currently finalising the accommodation brief with the aim of progressing the project into the architectural planning process. My Department will be in direct contact with the school authority at that point. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_232.xml"
            }
          },
          "debateSectionId": "dbsect_232",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_232",
          "showAs": "Schools Site Acquisitions"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_255",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 255,
        "showAs": " 255. Deputy Darragh O'Brien asked the Minister for Education and Skills the status of the provision of a new site for a school (details supplied) as announced in November 2015; and if he will make a statement on the matter. [11102/20] ",
        "answerText": " Minister for Education and Skills  As the Deputy is aware, a building project for the school in question is included on my Department's school building programme to be delivered under the National Development Plan (NDP).  I am pleased to inform the Deputy that the acquisition of a site to facilitate the construction of a new school building has closed.  This site will will accommodate this school as well as a post primary school and will act as a campus arrangement.  My Department is currently finalising the accommodation brief with the aim of progressing the project into the architectural planning process. My Department will be in direct contact with the school authority at that point. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_233.xml"
            }
          },
          "debateSectionId": "dbsect_233",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_233",
          "showAs": "Schools Building Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_256",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 256,
        "showAs": " 256. Deputy Darragh O'Brien asked the Minister for Education and Skills if the works to provide a new school building for a school (details supplied) along with the associated refurbishment works will be expedited; and if he will make a statement on the matter. [11103/20] ",
        "answerText": " Minister for Education and Skills  The building project for the school referred to by the Deputy is included in My Department’s Construction Programme which is being delivered under the National Development Plan.  This project is one of the school building projects on my Department’s ADAPT 2 Programme. My Department has appointed a Project Manager for the ADAPT 2 Programme, which contains 18 school building projects.  A Design Team – (Architect, Quantity Surveyor, Civil & Structural Engineer, Mechanical & Electrical Engineer and Project Supervisor for the Design Process) has also been appointed for the school in question. The appointed Design Team is currently working through Stage 1 (Site Suitability, Site Report, Initial Sketch Scheme) of Architectural planning. A number of surveys have been approved by the Department and have been carried out at the school site. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_234.xml"
            }
          },
          "debateSectionId": "dbsect_234",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_234",
          "showAs": "Schools Building Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_257",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 257,
        "showAs": " 257. Deputy Darragh O'Brien asked the Minister for Education and Skills the status of the provision of a new school for a school (details supplied); the stage at which the project is at; when construction will commence on the school; and if he will make a statement on the matter. [11104/20] ",
        "answerText": " Minister for Education and Skills  The major building project for the school referred to by the Deputy is included in the Department’s Construction Programme which is being delivered under the National Development Plan.  The project is currently at an advanced stage of architectural planning, Stage 2(b) - Detailed Design, which includes the application for statutory approvals and the preparation of tender documents. All statutory approvals have been secured.  A revised Stage 2(b) report was submitted by the Design Team to my Department for review in November 2019. Upon commencement of the review my Department deemed it necessary to request further documentation from the Design Team in order that the report could be fully reviewed. The Design Team has since completed an Addendum report which has been received by my Department.  Upon review of the revised Stage 2(b) report and addendum documentation, my Department will be in contact with the school regarding the further progression of this project. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_235.xml"
            }
          },
          "debateSectionId": "dbsect_235",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_235",
          "showAs": "Special Educational Needs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_258",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 258,
        "showAs": " 258. Deputy Darragh O'Brien asked the Minister for Education and Skills the primary schools in Kinsealy, Malahide and Portmarnock, County Dublin that have ASD units; and if he will make a statement on the matter. [11105/20] ",
        "answerText": " Minister for Education and Skills  I propose to take Questions Nos. 258 and 259 together.  Ensuring that every child has a suitable school placement is a key objective of my Department.  Significant resources are allocated each year to ensure that appropriate supports are available for children with special educational needs.  Since 2011, the number of special classes in mainstream schools has increased almost threefold, from 548 to 1,618 for the 2019/2020 school year; with 1,353 of these catering for children with autism.  A list of special classes for the current school year, including special classes for children with autism, is available on the NCSE website.  Budget 2020 provided for an additional 265 special class teachers in 2020, which will allow for the opening of additional classes where required.  The National Council for Special Education has responsibility for coordinating and advising on the education provision for children nationwide; has well established structures in place for engaging with schools and parents; and seeks to ensure that schools in an area can, between them, cater for all children who have been identified as needing special class placements.  The NCSE is planning a further expansion of special class and school places national to meet identified need for next year. This process is ongoing.  It is open to any school to make an application to the NCSE for the establishment of a specialised provision and where sanctioned, a range of supports, including capital funding, is made available to the school. My Department works closely with the NCSE in this regard.  Normally, special class and school places are established with the full cooperation of the schools in areas where they are required.  However there are some parts of the country where the NCSE has faced challenges in getting schools and their patrons to voluntarily agree to provide special class or school places. I know this can cause much anguish for parents and families involved.  As Minister, I have power under Section 37A of the Education Act 1998 to direct a school to provide additional provision where all reasonable efforts have failed. This legislation has been used to good effect in the recent past. This experience  shows that real and practical challenges can be addressed by working together to provide additional special class and special school places.  I would prefer to see schools volunteer to provide more places rather than places being secured on the back of an order or a direction from me. It is the right thing for the children in a community.  The NCSE's local Special Education Needs Organisers (SENOs) are available to assist and advise both schools and the parents of children with special educational needs.  Parents may contact SENOs directly using the contact details available at: https://ncse.ie/regional-services-contact-list ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_235.xml"
            }
          },
          "debateSectionId": "dbsect_235",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_235",
          "showAs": "Special Educational Needs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_259",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 259,
        "showAs": " 259. Deputy Darragh O'Brien asked the Minister for Education and Skills his plans to establish needed additional ASD units in primary schools in Kinsealy, Malahide and Portmarnock, County Dublin; and if he will make a statement on the matter. [11106/20] ",
        "answerText": " Minister for Education and Skills  I propose to take Questions Nos. 258 and 259 together.  Ensuring that every child has a suitable school placement is a key objective of my Department.  Significant resources are allocated each year to ensure that appropriate supports are available for children with special educational needs.  Since 2011, the number of special classes in mainstream schools has increased almost threefold, from 548 to 1,618 for the 2019/2020 school year; with 1,353 of these catering for children with autism.  A list of special classes for the current school year, including special classes for children with autism, is available on the NCSE website.  Budget 2020 provided for an additional 265 special class teachers in 2020, which will allow for the opening of additional classes where required.  The National Council for Special Education has responsibility for coordinating and advising on the education provision for children nationwide; has well established structures in place for engaging with schools and parents; and seeks to ensure that schools in an area can, between them, cater for all children who have been identified as needing special class placements.  The NCSE is planning a further expansion of special class and school places national to meet identified need for next year. This process is ongoing.  It is open to any school to make an application to the NCSE for the establishment of a specialised provision and where sanctioned, a range of supports, including capital funding, is made available to the school. My Department works closely with the NCSE in this regard.  Normally, special class and school places are established with the full cooperation of the schools in areas where they are required.  However there are some parts of the country where the NCSE has faced challenges in getting schools and their patrons to voluntarily agree to provide special class or school places. I know this can cause much anguish for parents and families involved.  As Minister, I have power under Section 37A of the Education Act 1998 to direct a school to provide additional provision where all reasonable efforts have failed. This legislation has been used to good effect in the recent past. This experience  shows that real and practical challenges can be addressed by working together to provide additional special class and special school places.  I would prefer to see schools volunteer to provide more places rather than places being secured on the back of an order or a direction from me. It is the right thing for the children in a community.  The NCSE's local Special Education Needs Organisers (SENOs) are available to assist and advise both schools and the parents of children with special educational needs.  Parents may contact SENOs directly using the contact details available at: https://ncse.ie/regional-services-contact-list ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_117.xml"
            }
          },
          "debateSectionId": "dbsect_117",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_117",
          "showAs": "Schools Building Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_134",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 134,
        "showAs": " 134. Deputy Darragh O'Brien asked the Minister for Education and Skills when works will commence on a new school building for a school (details supplied); when the construction of same will be completed; and if he will make a statement on the matter. [9926/20] ",
        "answerText": " Minister for Education and Skills  The Deputy will be aware that a building project for the school in question is included on the Department's Capital Programme to be delivered as part of the National Development Plan (NDP).  My Department is currently finalising the accommodation brief for the school in question and will be in further contact with the school authority when this process has been completed. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_499.xml"
            }
          },
          "debateSectionId": "dbsect_499",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_499",
          "showAs": "Sports Organisations"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_545",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 545,
        "showAs": " 545. Deputy Darragh O'Brien asked the Minister for Transport, Tourism and Sport his views on whether it is appropriate that an organisation (details supplied) does not operate on an all-island basis. [9766/20] ",
        "answerText": " Minister for Transport, Tourism and Sport (Shane Ross)  I propose to take Questions Nos. 545 and 546 together.  The organisation and delivery of sport in Ireland is mainly a matter for the National Governing Bodies of Sport (NGBs). NGBs, including the one mentioned by the Deputy, are independent, autonomous bodies and are responsible for their own governance procedures and competition rules for their sports.  I understand that the organisation mentioned by the Deputy operates on an all-island basis in relation to the development of the sport and that under the statutes of its international federation the organisation's jurisdiction at international events covers the 26 counties of the Republic of Ireland.  I also understand that there is a Memorandum of Understanding in place which reflects the shared goals of the relevant bodies. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_499.xml"
            }
          },
          "debateSectionId": "dbsect_499",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_499",
          "showAs": "Sports Organisations"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_546",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 546,
        "showAs": " 546. Deputy Darragh O'Brien asked the Minister for Transport, Tourism and Sport his views on the 1999 agreement between organisations (details supplied); and his further views on whether in the context of this agreement that an organisation should operate on an all-island basis. [9767/20] ",
        "answerText": " Minister for Transport, Tourism and Sport (Shane Ross)  I propose to take Questions Nos. 545 and 546 together.  The organisation and delivery of sport in Ireland is mainly a matter for the National Governing Bodies of Sport (NGBs). NGBs, including the one mentioned by the Deputy, are independent, autonomous bodies and are responsible for their own governance procedures and competition rules for their sports.  I understand that the organisation mentioned by the Deputy operates on an all-island basis in relation to the development of the sport and that under the statutes of its international federation the organisation's jurisdiction at international events covers the 26 counties of the Republic of Ireland.  I also understand that there is a Memorandum of Understanding in place which reflects the shared goals of the relevant bodies. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_103.xml"
            }
          },
          "debateSectionId": "dbsect_103",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_103",
          "showAs": "Coastal Erosion"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_126",
        "to": {
          "roleType": null,
          "showAs": "Public",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 126,
        "showAs": " 126. Deputy Darragh O'Brien asked the Minister for Public Expenditure and Reform if the necessary financial assistance will be provided to Fingal County Council to tackle the alarming rate of coastal erosion that is occurring at the Burrow, Portrane, County Dublin; and if he will make a statement on the matter. [8578/20] ",
        "answerText": " Minister of State at the Department of Public Expenditure and Reform (Kevin Boxer Moran)  I am advised, in respect of coastal erosion at the Burrow, Portrane, County Dublin, that Fingal County Council is leading on this issue, as it is a matter for Local Authorities in the first instance to assess and address problems of coastal erosion in their areas.  Where necessary, Local Authorities may put forward proposals to relevant central Government Departments, including the OPW, for funding of appropriate measures depending on the infrastructure or assets under threat.  In 2018, in response to serious coastal erosion problems at The Burrow, Portrane, Fingal County Council implemented temporary interim emergency measures to protect properties at risk.  Funding of €456,464 was approved under the OPW Minor Flood Mitigation Works and Coastal Protection Scheme for these works.  A further extension to these interim emergency measures along the Burrow, Portrane is now being progressed, in two phases, with total additional funding of nearly EUR 1m to be provided by the OPW under the Minor Flood Mitigation Works and Coastal Protection Scheme.  Consultants appointed by Fingal County Council have prepared a draft plan to address significant and medium- to long-term coastal change in the Portrane Peninsula/ Rogerstown Outer Estuary area. Fingal County Council has advised that due to the ecological sensitivity of the site and the complexity of the issues involved, it is likely that the assessment of this plan, which will include extensive public consultation, environmental assessment and the relevant consent processes, will take over a year to complete.  My Office continues to co-operate and assist Fingal County Council in every way and if a viable option is identified, the Council may submit a further application for funding to the OPW or other Government Departments as appropriate. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_104.xml"
            }
          },
          "debateSectionId": "dbsect_104",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_104",
          "showAs": "Coastal Erosion"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_127",
        "to": {
          "roleType": null,
          "showAs": "Public",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 127,
        "showAs": " 127. Deputy Darragh O'Brien asked the Minister for Public Expenditure and Reform the progress in the preparation of a national coastal erosion strategy and plan in view of the gravity of the situation; and if he will make a statement on the matter. [8579/20] ",
        "answerText": " Minister of State at the Department of Public Expenditure and Reform (Kevin Boxer Moran)  The Government has agreed to the establishment of an Inter-Departmental Group to scope out an approach for the development of an integrated, whole of Government coastal strategy, for managing our changing coast and to report back to Government within a period of 6 months with its initial findings and recommendations.  The Inter-Departmental Group will be jointly chaired by the Department of Housing, Planning and Local Government and the Office of Public Works. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_371.xml"
            }
          },
          "debateSectionId": "dbsect_371",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_371",
          "showAs": "Covid-19 Pandemic Supports"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_451",
        "to": {
          "roleType": null,
          "showAs": "Business",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 451,
        "showAs": " 451. Deputy Darragh O'Brien asked the Minister for Business, Enterprise and Innovation the reason sports clubs cannot apply for the restart grant even though they pay commercial rates like other businesses; and if she will make a statement on the matter. [8822/20] ",
        "answerText": " Minister for Business, Enterprise and Innovation  On Friday, 15 May, 2020 the Government announced details of the new €250m Restart Grant providing direct grant aid to micro and small businesses. The grant is a contribution towards the cost of re-opening or keeping a business operational and re-connecting with employees and customers.  The Restart Grant support is just one part of the wider €12bn package of supports for commercial firms of all sizes, which includes the wage subsidy scheme, grants, low-cost loans, write-off of commercial rates and deferred tax liabilities, all of which will help those businesses to continue trading and to maintain employment.  To avail of the Restart Grant, applicants must be a commercial business and be in the Local Authorities’ Commercial Rates Payment System, and:  - have a turnover of less than €5m and have 50 or less employees.  - have suffered a projected 25%+ loss in revenue from 1 April 2020 to 30th June 2020.  - commit to remain open or to reopen if it was closed.  - declare the intention to retain employees that are benefitting from the Temporary Wage Subsidy Scheme (TWSS).  The primary objective, therefore, is to get funding into small businesses that:  - Are reliant solely on local trading income;  - Are financially independent from any group structure;  - Have suffered significant financial losses;  - Have had to bear ongoing fixed costs or faced costs associated with re- opening the business;  - Provide local paid employment.  In that context, sporting organisations are not eligible because they are not primarily commercial organisations and have sources of income other than commercial sales. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-05-27",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/mul@/dbsect_783.xml"
            }
          },
          "debateSectionId": "dbsect_783",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/dbsect_783",
          "showAs": "Covid-19 Pandemic"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-27/pq_871",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 871,
        "showAs": " 871. Deputy Darragh O'Brien asked the Minister for Children and Youth Affairs the membership of her advisory group on reopening early learning and care and school-age childcare services; and the process by which the members of the working group were selected. [7649/20] ",
        "answerText": " Minister for Children and Youth Affairs (Katherine Zappone)  The members of the Advisory Group on the phased re-opening of childcare services are the Association of Childhood Professionals, the Community Forum, Early Childhood Ireland, National Childhood Network, PLÉ and Seas Suas, Childminding Ireland and SIPTU. Pobal and Tusla are also members of the Advisory Group.  In establishing the Advisory Group, I provided six places for sectoral representatives. The sector itself decided on the nominees and these include representatives from the Association of Childhood Professionals, PLÉ, Seas Suas, Early Childhood Ireland, the National Childhood Network and the National Community Forum. Many of these groups represent providers. I included Childminding Ireland and SIPTU as members of the group, as they represent key parts of the early years sector not included in the list above, ie childcare staff and childminders.  A number of additional provider representative groups have contacted my Department seeking to be added to the membership of the Advisory Group. In response to such requests, I have established a Reference Group, to supplement the work of the Advisory Group. The Reference Group includes representatives from the Federation of Early Childhood, the Association of Full-time Day care Providers, St Nicholas Montessori and a number of service providers. I will chair the first meeting of the Reference Group on 28 May.  In addition to the above, my officials are also engaging directly with all 4,500 providers across the country through regular emails, and are seeking their input to COVID related challenges through a survey of all providers and an open call for submissions. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-27",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-05-27",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/mul@/dbsect_784.xml"
            }
          },
          "debateSectionId": "dbsect_784",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/dbsect_784",
          "showAs": "Covid-19 Pandemic"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-27/pq_872",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 872,
        "showAs": " 872. Deputy Darragh O'Brien asked the Minister for Children and Youth Affairs if issues raised in correspondence (details supplied) will be considered in relation to the advisory group on reopening early learning and care and school-age childcare services; and if she will make a statement on the matter. [7650/20] ",
        "answerText": " Minister for Children and Youth Affairs (Katherine Zappone)  The Deputy is aware that the Covid-19 pandemic has resulted in an unprecedented situation that has required a series of emergency responses from the Government and my Department.  My Department and I are engaging extensively with stakeholders in the Early Learning and Care (ELC) and School-Age (SAC) sector, including the representative groups referred to by the Deputy.  Consultation with stakeholders has always been central to the work of my Department, and the Early Years Forum (EY Forum) is a key part of this. The EY Forum meets several times a year and includes representatives of providers, parents and academics with an interest in the ELC and SAC sector. I established the ‘EY Forum Plus’ in March 2020 to widen representation by the sector, to aid my Department in developing a response to Covid-19. The representative groups referred to by the Deputy are members of the EY Forum Plus, which has met on a number of occasions over the past three months. Additionally there has been several more informal interactions between the representative groups and my officials where their points of view were listened to and information shared with them.  I recently established an Advisory Group on the phased re-opening of childcare services. It had its first meeting on 13 May and has met 3 times since. In establishing the group, I provided six places for sectoral representatives. The sector itself decided on the nominees and these include representatives from the Association of Childhood Professionals, PLÉ, Seas Suas, Early Childhood Ireland, the National Childhood Network and the National Community Forum. Many of these groups represent providers. Childminding Ireland and SIPTU are also members of the group.  A number of additional provider representative groups have contacted my Department seeking to be added to the membership of the Advisory Group, including the groups referred to by the Deputy. In response to such requests, I have established a Reference Group, to supplement the work of the Advisory Group. I will chair the first meeting of the Reference Group on 28 May. The representative groups referred to by the Deputy has accepted my invitation to join the Reference Group and I have made clear that I welcome any submissions any of the representative groups may wish to make at any time.  In addition to the above, my officials are also engaging directly with all 4,500 providers across the country through regular emails, and are seeking their input to COVID related challenges through a survey of all providers and an open call for submissions. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-27",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-05-27",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/mul@/dbsect_785.xml"
            }
          },
          "debateSectionId": "dbsect_785",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/dbsect_785",
          "showAs": "Covid-19 Pandemic"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-27/pq_873",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 873,
        "showAs": " 873. Deputy Darragh O'Brien asked the Minister for Children and Youth Affairs if research has been undertaken by her Department in order to determine the possible impact of Covid-19 on capacity within the ECCE system in terms of crèche closures and the reduction in capacity associated with social distancing measures; and if she will make a statement on the matter. [7656/20] ",
        "answerText": " Minister for Children and Youth Affairs (Katherine Zappone)  I propose to take Questions Nos. 873 and 877 together.  On Friday 1 May, the Government released its Roadmap for Reopening Society and Business, which sets out Ireland's plan for lifting COVID-19 restrictions through five phases. The re-opening of Early Learning and Care and School-Age Childcare (ELC and SAC) services will be guided by this framework and will be underpinned by the Government's Return to Work Safely Protocol, expert advice, available evidence and consultation with ELC and SAC stakeholder representatives and providers themselves.  The sector has many questions regarding how the Roadmap will be implemented to enable services to re-open. While the COVID-19 emergency called for overnight action on closures, it is my ambition that the phased re-opening will enable sufficient time and planning to re-open in an orderly, safe and sustainable manner. I would like to reassure providers, practitioners, parents and children that I will be doing my utmost to support the sector in offering as smooth a transition as possible to the phased and restricted re-opening of ELC and SAC services.  My Department is currently working with the sector to answer the many questions that exist, including, as referred to by the Deputy, the issues around capacity and how for example the ECCE programme may operate from September. This is complex work and must balance a number of important issues. My Department has sought public health advice in relation to the plans being put forward. Informed by this advice, consideration is being given to a range of these issues, including:  - Minimising the public health risk, especially given the difficulty of maintaining social distancing among young children and those caring for them,  - Ensuring the need for any restrictions to be consistent with young children’s well-being and development needs and for ELC and SAC provision at each phase to be child-centred  - Providing ELC for pre-school children, meeting parental demand for ELC and SAC as the economy reopens, and meeting the commitment to retain places for families who paid for ELC and SAC before COVID-19, all while restricting capacity and thereby reducing adult-child ratios.  - Ensuring financial sustainability of the sector when capacity restrictions limit income and parents cannot afford to cover any higher costs with higher fees.  - Ensuring a sufficient number of qualified ELC and SAC practitioners, given likelihood of reduced adult-child ratios and existing challenges with recruitment and retention.  I am actively engaging with key stakeholders in the sector to make sure that the work on re-opening services is informed by the practical reality across the country. I have established and Chair an Advisory Group that includes representatives chosen by the sector, specifically the Association of Childhood Professionals, Community Forum, Early Childhood Ireland, National Childhood Network, PLÉ and Seas Suas. The group also includes Tusla, Pobal, SIPTU and Childminding Ireland. The first meeting of this Advisory Group took place on 13 May and I held follow up meetings on 15, 19 and 26 May. A schedule of weekly meetings has also been agreed.  I am also establishing a Reference Group to widen the scope of consultation with the ELC and SAC sector, to supplement the work of the Advisory Group and to give an opportunity to provider representatives who are not represented on this group to make their views known to me and my officials. I hope to hold periodic meetings of the Group as we work through the phased reopening of the ELC and SAC sector. The first meeting of the Reference Group will be held on Thursday, 28 May 2020.  In collaboration with this Advisory Group, officials in my Department are undertaking primary research which is currently being rolled out in order to help us forecast supply and demand in the sector for safely delivering early learning and care and school age childcare in the coming months. Arising from that work, my Department will seek to identify ways to maximise capacity in the best interests of children and parents, while meeting the need to ensure that services re-open safely.  The proposals for re-opening which are in development will have due regard to public health guidance over the phases of easing of restrictions. I am conscious that the proposed timelines are subject to further NPHET advice, and decisions from Government.  There are a number of key decisions to be made across Government that will impact significantly on the ELC and SAC sector, including the future of emergency measures such as the Revenue operated Temporary Wage Subsidy Scheme, the Department of Employment Affairs and Social Protection operated Pandemic Unemployment Payment, and other business supports. The proposals for re-opening ELC and SAC services necessarily interact with these schemes and so I will be relying on whole of Government plans, which impact the ELC and SAC sector.  It is my fervent hope that every ELC and SAC service around the country is currently considering how it can be part of helping Ireland get back to work, and how it can support children from 29 June in the very difficult circumstances they have experienced in recent months.  I will undertake to update the Deputy as soon as the work on re-opening services is at a more advanced stage. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-27",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-05-27",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/mul@/dbsect_786.xml"
            }
          },
          "debateSectionId": "dbsect_786",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/dbsect_786",
          "showAs": "Childcare Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-27/pq_874",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 874,
        "showAs": " 874. Deputy Darragh O'Brien asked the Minister for Children and Youth Affairs if ECCE services will be able to operate at full capacity in September 2020; and if not, the percentage of their previous capacity they will be able to operate. [7657/20] ",
        "answerText": " Minister for Children and Youth Affairs (Katherine Zappone)  I propose to take Questions Nos. 874 and 876 together.  On Friday 1 May, the Government released its Roadmap for Reopening Society and Business, which sets out Ireland's plan for lifting COVID-19 restrictions through five phases. The re-opening of Early Learning and Care and School-Age Childcare (ELC and SAC) services will be guided by this framework and will be underpinned by the Government's Return to Work Safely Protocol, expert advice, available evidence and consultation with ELC and SAC stakeholder representatives and providers themselves.  The sector has many questions regarding how the Roadmap will be implemented to enable services to re-open. While the COVID-19 emergency called for overnight action on closures, it is my ambition that the phased re-opening will enable sufficient time and planning to re-open in an orderly, safe and sustainable manner. I would like to reassure providers, practitioners, parents and children that I will be doing my utmost to support the sector in offering as smooth a transition as possible to the phased and restricted re-opening of ELC and SAC services.  My Department is currently working with the sector to answer the many questions that exist, including, as referred to by the Deputy, the issues around capacity and how for example the ECCE programme may operate from September. This is complex work and must balance a number of important issues. My Department has sought public health advice in relation to the plans being put forward. Informed by this advice, consideration is being given to a range of these issues, including:  - Minimising the public health risk, especially given the difficulty of maintaining social distancing among young children and those caring for them,  - Ensuring the need for any restrictions to be consistent with young children’s well-being and development needs and for ELC and SAC provision at each phase to be child-centred  - Providing ELC for pre-school children, meeting parental demand for ELC and SAC as the economy reopens, and meeting the commitment to retain places for families who paid for ELC and SAC before COVID-19, all while restricting capacity and thereby reducing adult-child ratios.  - Ensuring financial sustainability of the sector when capacity restrictions limit income and parents cannot afford to cover any higher costs with higher fees.  - Ensuring a sufficient number of qualified ELC and SAC practitioners, given likelihood of reduced adult-child ratios and existing challenges with recruitment and retention.  I am actively engaging with key stakeholders in the sector to make sure that the work on re-opening services is informed by the practical reality across the country. I have established and Chair an Advisory Group that includes representatives chosen by the sector, specifically the Association of Childhood Professionals, Community Forum, Early Childhood Ireland, National Childhood Network, PLÉ and Seas Suas. The group also includes Tusla, Pobal, SIPTU and Childminding Ireland. The first meeting of this Advisory Group took place on 13 May and I held follow up meetings on 15, 19 and 26 May. A schedule of weekly meetings has also been agreed.  I am also establishing a Reference Group to widen the scope of consultation with the ELC and SAC sector, to supplement the work of the Advisory Group and to give an opportunity to provider representatives who are not represented on this group to make their views known to me and my officials. I hope to hold periodic meetings of the Group as we work through the phased reopening of the ELC and SAC sector. The first meeting of the Reference Group will be held on Thursday, 28 May 2020.  In collaboration with this Advisory Group, officials in my Department are undertaking primary research which is currently being rolled out in order to help us forecast supply and demand in the sector for safely delivering early learning and care and school age childcare in the coming months. Arising from that work, my Department will seek to identify ways to maximise capacity in the best interests of children and parents, while meeting the need to ensure that services re-open safely.  The proposals for re-opening in Phase 3, which are at an advanced stage, will have due regard to public health guidance over the phases of easing of restrictions. I am conscious that the proposed timelines are subject to further NPHET advice, and decisions from Government. Once the plans for Phase 3 and 4 are finalised, my Department will place a greater focus on resumption of ECCE.  There are a number of key decisions to be made across Government that will impact significantly on the ELC and SAC sector, including the future of emergency measures such as the Revenue operated Temporary Wage Subsidy Scheme, the Department of Employment Affairs and Social Protection operated Pandemic Unemployment Payment, and other business supports. The proposals for re-opening ELC and SAC services necessarily interact with these schemes and so I will be relying on whole of Government plans, which impact the ELC and SAC sector.  It is my fervent hope that every ELC and SAC service around the country is currently considering how it can be part of helping Ireland get back to work, and how it can support children from 29 June in the very difficult circumstances they have experienced in recent months.  I will undertake to update the Deputy as soon as the work on re-opening services is at a more advanced stage. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-27",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-05-27",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/mul@/dbsect_787.xml"
            }
          },
          "debateSectionId": "dbsect_787",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/dbsect_787",
          "showAs": "Childcare Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-27/pq_875",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 875,
        "showAs": " 875. Deputy Darragh O'Brien asked the Minister for Children and Youth Affairs the number of children expected to enrol in ECCE services from September 2020, by county. [7658/20] ",
        "answerText": " Minister for Children and Youth Affairs (Katherine Zappone)  The COVID-19 Pandemic has created major challenges for Ireland. The closure of centre-based Early Learning and Care (ELC) and School Age Childcare (SAC) services including those providing Early Childhood Care and Education (ECCE) services on 12 March was an unexpected but necessary move to safeguard public health in Ireland.  On Friday 1 May, the Government published the Roadmap for Reopening Society and Business, which sets out Ireland's plan for lifting COVID-19 restrictions. The re-opening of Early Learning and Care and School-Age Childcare (ELC and SAC) services will be guided by this framework and will be underpinned by the Government's Return to Work Safely Protocol, expert advice, available evidence and consultation with ELC and SAC stakeholder representatives and providers themselves. I am conscious that the proposed timelines in the Roadmap are subject to further NPHET advice, and decisions from Government.  My Department is not in a position, at this time, to give a figure for enrolment in ECCE services in September 2020. However, the enrolment figures for the 2019/20 ECCE programme year are an indication of potential numbers. The following table sets out these figures, on a per county basis. Additionally, some ECCE eligible children will be enrolled on other DCYA schemes, but avail of the ECCE programme through those schemes.     County    ECCE Children 2019/20      Carlow    1180      Cavan    1934      Clare    2561      Cork    13002      Donegal    3443      Dublin    27385      Galway    5890      Kerry    3031      Kildare    5841      Kilkenny    2108      Laois    2095      Leitrim    710      Limerick    4332      Longford    828      Louth    2901      Mayo    2797      Meath    5407      Monaghan    1328      Offaly    1796      Roscommon    1287      Sligo    1292      Tipperary    3486      Waterford    2427      Westmeath    2295      Wexford    3427      Wicklow    3615      Totals    106398     ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-27",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-05-27",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/mul@/dbsect_786.xml"
            }
          },
          "debateSectionId": "dbsect_786",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/dbsect_786",
          "showAs": "Childcare Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-27/pq_876",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 876,
        "showAs": " 876. Deputy Darragh O'Brien asked the Minister for Children and Youth Affairs if she has considered introducing temporary measures in order to bring additional ECCE capacity on stream more quickly in view of the possible deficit of places which may arise as a result of Covid-19. [7659/20] ",
        "answerText": " Minister for Children and Youth Affairs (Katherine Zappone)  I propose to take Questions Nos. 874 and 876 together.  On Friday 1 May, the Government released its Roadmap for Reopening Society and Business, which sets out Ireland's plan for lifting COVID-19 restrictions through five phases. The re-opening of Early Learning and Care and School-Age Childcare (ELC and SAC) services will be guided by this framework and will be underpinned by the Government's Return to Work Safely Protocol, expert advice, available evidence and consultation with ELC and SAC stakeholder representatives and providers themselves.  The sector has many questions regarding how the Roadmap will be implemented to enable services to re-open. While the COVID-19 emergency called for overnight action on closures, it is my ambition that the phased re-opening will enable sufficient time and planning to re-open in an orderly, safe and sustainable manner. I would like to reassure providers, practitioners, parents and children that I will be doing my utmost to support the sector in offering as smooth a transition as possible to the phased and restricted re-opening of ELC and SAC services.  My Department is currently working with the sector to answer the many questions that exist, including, as referred to by the Deputy, the issues around capacity and how for example the ECCE programme may operate from September. This is complex work and must balance a number of important issues. My Department has sought public health advice in relation to the plans being put forward. Informed by this advice, consideration is being given to a range of these issues, including:  - Minimising the public health risk, especially given the difficulty of maintaining social distancing among young children and those caring for them,  - Ensuring the need for any restrictions to be consistent with young children’s well-being and development needs and for ELC and SAC provision at each phase to be child-centred  - Providing ELC for pre-school children, meeting parental demand for ELC and SAC as the economy reopens, and meeting the commitment to retain places for families who paid for ELC and SAC before COVID-19, all while restricting capacity and thereby reducing adult-child ratios.  - Ensuring financial sustainability of the sector when capacity restrictions limit income and parents cannot afford to cover any higher costs with higher fees.  - Ensuring a sufficient number of qualified ELC and SAC practitioners, given likelihood of reduced adult-child ratios and existing challenges with recruitment and retention.  I am actively engaging with key stakeholders in the sector to make sure that the work on re-opening services is informed by the practical reality across the country. I have established and Chair an Advisory Group that includes representatives chosen by the sector, specifically the Association of Childhood Professionals, Community Forum, Early Childhood Ireland, National Childhood Network, PLÉ and Seas Suas. The group also includes Tusla, Pobal, SIPTU and Childminding Ireland. The first meeting of this Advisory Group took place on 13 May and I held follow up meetings on 15, 19 and 26 May. A schedule of weekly meetings has also been agreed.  I am also establishing a Reference Group to widen the scope of consultation with the ELC and SAC sector, to supplement the work of the Advisory Group and to give an opportunity to provider representatives who are not represented on this group to make their views known to me and my officials. I hope to hold periodic meetings of the Group as we work through the phased reopening of the ELC and SAC sector. The first meeting of the Reference Group will be held on Thursday, 28 May 2020.  In collaboration with this Advisory Group, officials in my Department are undertaking primary research which is currently being rolled out in order to help us forecast supply and demand in the sector for safely delivering early learning and care and school age childcare in the coming months. Arising from that work, my Department will seek to identify ways to maximise capacity in the best interests of children and parents, while meeting the need to ensure that services re-open safely.  The proposals for re-opening in Phase 3, which are at an advanced stage, will have due regard to public health guidance over the phases of easing of restrictions. I am conscious that the proposed timelines are subject to further NPHET advice, and decisions from Government. Once the plans for Phase 3 and 4 are finalised, my Department will place a greater focus on resumption of ECCE.  There are a number of key decisions to be made across Government that will impact significantly on the ELC and SAC sector, including the future of emergency measures such as the Revenue operated Temporary Wage Subsidy Scheme, the Department of Employment Affairs and Social Protection operated Pandemic Unemployment Payment, and other business supports. The proposals for re-opening ELC and SAC services necessarily interact with these schemes and so I will be relying on whole of Government plans, which impact the ELC and SAC sector.  It is my fervent hope that every ELC and SAC service around the country is currently considering how it can be part of helping Ireland get back to work, and how it can support children from 29 June in the very difficult circumstances they have experienced in recent months.  I will undertake to update the Deputy as soon as the work on re-opening services is at a more advanced stage. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-27",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-05-27",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/mul@/dbsect_785.xml"
            }
          },
          "debateSectionId": "dbsect_785",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/dbsect_785",
          "showAs": "Covid-19 Pandemic"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-27/pq_877",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 877,
        "showAs": " 877. Deputy Darragh O'Brien asked the Minister for Children and Youth Affairs if her Department has undertaken research in order to determine the possible impact of Covid-19 on capacity within the full-day childcare system in terms of crèche closures and the reduction in capacity associated with social distancing measures; and if she will make a statement on the matter. [7660/20] ",
        "answerText": " Minister for Children and Youth Affairs (Katherine Zappone)  I propose to take Questions Nos. 873 and 877 together.  On Friday 1 May, the Government released its Roadmap for Reopening Society and Business, which sets out Ireland's plan for lifting COVID-19 restrictions through five phases. The re-opening of Early Learning and Care and School-Age Childcare (ELC and SAC) services will be guided by this framework and will be underpinned by the Government's Return to Work Safely Protocol, expert advice, available evidence and consultation with ELC and SAC stakeholder representatives and providers themselves.  The sector has many questions regarding how the Roadmap will be implemented to enable services to re-open. While the COVID-19 emergency called for overnight action on closures, it is my ambition that the phased re-opening will enable sufficient time and planning to re-open in an orderly, safe and sustainable manner. I would like to reassure providers, practitioners, parents and children that I will be doing my utmost to support the sector in offering as smooth a transition as possible to the phased and restricted re-opening of ELC and SAC services.  My Department is currently working with the sector to answer the many questions that exist, including, as referred to by the Deputy, the issues around capacity and how for example the ECCE programme may operate from September. This is complex work and must balance a number of important issues. My Department has sought public health advice in relation to the plans being put forward. Informed by this advice, consideration is being given to a range of these issues, including:  - Minimising the public health risk, especially given the difficulty of maintaining social distancing among young children and those caring for them,  - Ensuring the need for any restrictions to be consistent with young children’s well-being and development needs and for ELC and SAC provision at each phase to be child-centred  - Providing ELC for pre-school children, meeting parental demand for ELC and SAC as the economy reopens, and meeting the commitment to retain places for families who paid for ELC and SAC before COVID-19, all while restricting capacity and thereby reducing adult-child ratios.  - Ensuring financial sustainability of the sector when capacity restrictions limit income and parents cannot afford to cover any higher costs with higher fees.  - Ensuring a sufficient number of qualified ELC and SAC practitioners, given likelihood of reduced adult-child ratios and existing challenges with recruitment and retention.  I am actively engaging with key stakeholders in the sector to make sure that the work on re-opening services is informed by the practical reality across the country. I have established and Chair an Advisory Group that includes representatives chosen by the sector, specifically the Association of Childhood Professionals, Community Forum, Early Childhood Ireland, National Childhood Network, PLÉ and Seas Suas. The group also includes Tusla, Pobal, SIPTU and Childminding Ireland. The first meeting of this Advisory Group took place on 13 May and I held follow up meetings on 15, 19 and 26 May. A schedule of weekly meetings has also been agreed.  I am also establishing a Reference Group to widen the scope of consultation with the ELC and SAC sector, to supplement the work of the Advisory Group and to give an opportunity to provider representatives who are not represented on this group to make their views known to me and my officials. I hope to hold periodic meetings of the Group as we work through the phased reopening of the ELC and SAC sector. The first meeting of the Reference Group will be held on Thursday, 28 May 2020.  In collaboration with this Advisory Group, officials in my Department are undertaking primary research which is currently being rolled out in order to help us forecast supply and demand in the sector for safely delivering early learning and care and school age childcare in the coming months. Arising from that work, my Department will seek to identify ways to maximise capacity in the best interests of children and parents, while meeting the need to ensure that services re-open safely.  The proposals for re-opening which are in development will have due regard to public health guidance over the phases of easing of restrictions. I am conscious that the proposed timelines are subject to further NPHET advice, and decisions from Government.  There are a number of key decisions to be made across Government that will impact significantly on the ELC and SAC sector, including the future of emergency measures such as the Revenue operated Temporary Wage Subsidy Scheme, the Department of Employment Affairs and Social Protection operated Pandemic Unemployment Payment, and other business supports. The proposals for re-opening ELC and SAC services necessarily interact with these schemes and so I will be relying on whole of Government plans, which impact the ELC and SAC sector.  It is my fervent hope that every ELC and SAC service around the country is currently considering how it can be part of helping Ireland get back to work, and how it can support children from 29 June in the very difficult circumstances they have experienced in recent months.  I will undertake to update the Deputy as soon as the work on re-opening services is at a more advanced stage. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-27",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-05-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/mul@/dbsect_224.xml"
            }
          },
          "debateSectionId": "dbsect_224",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/dbsect_224",
          "showAs": "School Accommodation Provision"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-20/pq_249",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 249,
        "showAs": " 249. Deputy Darragh O'Brien asked the Minister for Education and Skills the progress on the extension of a school (details supplied); if it will be ready for the beginning of the academic school year in September 2020; and if he will make a statement on the matter. [6233/20] ",
        "answerText": " Minister for Education and Skills  I wish to advise the Deputy that my Department is in receipt of an application, for additional school accommodation, from the school authority in question. The assessment process to determine the school’s permanent accommodation needs is nearing completion. The school will be informed of the decision in due course.  In the meantime, interim temporary accommodation has been approved to cater for the schools need in the short term.  The school authority has advised that they have accommodation to cater for the start of the next academic year. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-20",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-05-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/mul@/dbsect_341.xml"
            }
          },
          "debateSectionId": "dbsect_341",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/dbsect_341",
          "showAs": "Maternity Leave"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-20/pq_411",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 411,
        "showAs": " 411. Deputy Darragh O'Brien asked the Minister for Justice and Equality if consideration has been given to extending paid maternity leave due to the impact of the Covid-19 pandemic; and if he will make a statement on the matter. [5752/20] ",
        "answerText": " Minister of State at the Department of Justice and Equality (Deputy David Stanton)  I propose to take Questions Nos. 408 to 413, inclusive, 415 to 418, inclusive, 421, 423, 425, 426 and 445 together.  I am conscious of demands on parents at this time and hope that the additional measures to support working parents that I have introduced in recent years, including the new parent’s leave scheme and an extension of parental leave, are helping to ease some of these demands. These matters are being examined by Government.  As the law now stands, a mother is entitled to this leave irrespective of the duration of her current employment. The mother can take maternity leave from casual or part-time employment. She can take up to 26 weeks of paid maternity leave, and up to a further 16 weeks of unpaid leave. Two weeks must be taken before the baby is due, and at least four weeks must be taken after the birth. As Minister of State for Justice and Equality, the legislation that governs the provision of maternity leave is my responsibility. The provision of maternity benefit is under the remit of the Minister for Employment Affairs and Social Protection.  In addition to maternity leave, each parent may also avail of two weeks of parent’s leave during the first year of a child’s life and may qualify for parent’s benefit during this period.  Parental leave is also available which entitles parents to take unpaid leave from work to spend time looking after their children. Parents can take up to 22 weeks of parental leave for each eligible child before their 12th birthday. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-20",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-05-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/mul@/dbsect_388.xml"
            }
          },
          "debateSectionId": "dbsect_388",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/dbsect_388",
          "showAs": "Garda Stations"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-20/pq_485",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 485,
        "showAs": " 485. Deputy Darragh O'Brien asked the Minister for Justice and Equality the status of the works on Rush Garda station; the date the station is scheduled to be reopened; and if he will make a statement on the matter. [6706/20] ",
        "answerText": " Minister for Justice and Equality  First it is important to note that the Office of Public Works has responsibility for the provision and maintenance of Garda accommodation. Works in relation to Garda accommodation are therefore progressed by the Garda authorities working in close cooperation with the Office of Public Works (OPW).  I am advised that the works required to reopen Rush Garda station have been completed and that the building has been handed over by the OPW to the Garda authorities.  I am informed however, that in light of the current Covid-19 pandemic, the IT works which will be required prior to Rush station becoming operational have not yet been carried out.  More generally and as the Deputy may be aware, as part of its action to mitigate the risks around the transmission of Covid-19 between Garda personnel and/or members of the public, Garda management has identified a range of alternative accommodation including educational institutions, local community facilities and so on, which are available to Garda management across the country in order to assist in protecting members and staff against Covid-19.  I understand that these facilities, where in use, are acting as a facility supplementary to the local Garda Station, to ensure compliance with social distancing guidelines, minimising the concentration of personnel in a particular location.  This contributes to the protection of Garda members and staff and to the organisational resilience of An Garda Síochána.  I am informed that, in a similar context, Rush station is currently being held as a contingency building, in the event other stations become impacted by Covid-19 infection.  I am further advised that when the public health situation allows, Rush Garda station will reopen to the public. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-20",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-05-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/mul@/dbsect_1060.xml"
            }
          },
          "debateSectionId": "dbsect_1060",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/dbsect_1060",
          "showAs": "Covid-19 Pandemic Unemployment Payment"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-20/pq_1210",
        "to": {
          "roleType": null,
          "showAs": "Employment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1210,
        "showAs": " 1210. Deputy Darragh O'Brien asked the Minister for Employment Affairs and Social Protection if the Covid-19 pandemic unemployment payment for those aged 66 years of age and over who are excluded from receiving it will be extended; and if she will make a statement on the matter. [5740/20] ",
        "answerText": " Minister for Employment Affairs and Social Protection  I propose to take Questions Nos. 1194, 1210, 1211 and 1248 together.  The COVID-19 Pandemic Unemployment Payment was introduced as a time-limited, emergency income support measure to meet the dramatic surge in unemployment as a consequence of the pandemic.  This emergency payment supports people of working age from 18 and up to 66 years old who became unemployed on or after the 6th March as a result of the pandemic and are not being paid by their employer.  This age range is consistent with other Social Protection income supports paid to working age persons.  The primary State income support in respect of people who are aged 66 years or over is the State Pension – either the contributory State pension or the non-contributory pension, which is means tested.  A person in receipt of Contributory State Pension can retain all of their pension as well as their employment income and retain that pension if they lose employment, thus guaranteeing an income support.  People in receipt of a reduced rate of non-contributory or means tested pension who are also in receipt of an employment income may have their pension payment increased if they lose that employment income or if it is reduced.  The weekly rate of the Covid-19 payment is €350 and is aligned with the jobseeker payment for a person with an adult dependant.  The rate of payment for a State Contributory pensioner in a two person household with an adult dependant who is over 66 years is €470.80, significantly higher than the temporary Covid-19 payment.  The maximum rate of payment for the non-contributory pension for a two person household is €393.60.  Recipients of State pension payments may, subject to satisfying eligibility conditions, have access to a range of supports not available to unemployed people aged under 66.  These include living alone increase, household benefits, telephone support allowance, free travel and free TV licence.  Additionally, as part of the Department’s response to the COVID-19 emergency, the Fuel Allowance season has been extended by four weeks.  It should also be noted that there is no requirement for people aged over 66 to pay PRSI.  PRSI contributions are payable by employees and self-employed persons between the ages of 16 years and pensionable age which is 66 years.  It is important to note that where a person, of any age, is experiencing financial hardship they can apply for financial support Supplementary Welfare Allowance scheme.  I trust this clarifies my position. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-20",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-05-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/mul@/dbsect_1181.xml"
            }
          },
          "debateSectionId": "dbsect_1181",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/dbsect_1181",
          "showAs": "Pyrite Remediation Programme"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-20/pq_1348",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1348,
        "showAs": " 1348. Deputy Darragh O'Brien asked the Minister for Housing, Planning and Local Government the progress of the pyrite remediation applications for residents in an area (details supplied); and if he will make a statement on the matter. [6182/20] ",
        "answerText": " Minister for Housing, Planning and Local Government  The Pyrite Resolution Act 2013 provides the statutory framework for the Pyrite Remediation Scheme. The Pyrite Resolution Board, with the support of the Housing Agency, is responsible for the implementation of the pyrite remediation scheme.  In accordance with the provisions of the Act, the Board is independent in the performance of its functions, and as Minister, I have no role in the operational matters pertaining to the implementation of the scheme. The Board may be contacted by phone at Lo call 1890 252842 or by email to info@pyriteboard.ie or alternatively at oireachtasinfo@pyriteboard.ie. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-20",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-05-13",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-13/writtens/mul@/dbsect_130.xml"
            }
          },
          "debateSectionId": "dbsect_130",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-13/writtens/dbsect_130",
          "showAs": "Coastal Erosion"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-13/pq_123",
        "to": {
          "roleType": null,
          "showAs": "Public",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 123,
        "showAs": " 123. Deputy Darragh O'Brien asked the Minister for Public Expenditure and Reform if the necessary financial assistance will be provided to Fingal County Council to tackle the alarming rate of coastal erosion that is occurring at Rush, County Dublin; and if he will make a statement on the matter. [4166/20] ",
        "answerText": " Minister of State at the Department of Public Expenditure and Reform (Kevin Boxer Moran)  I am advised that the issue of coastal erosion at Rush, County Dublin is a matter for Fingal County Council, who are working to address this issue in consultation with all relevant bodies including the Office of Public Works (OPW) and the National Parks and Wildlife Service (NPWS).  Consultants appointed by Fingal County Council have prepared a plan to address significant and long-term coastal change in the Rogerstown Outer Estuary including the Rush coastline. Fingal County Council has advised that due to the ecological sensitivity of the site and the complexity of the issues involved, it is likely that the assessment of this plan, which will include extensive public consultation, environmental assessment and the relevant consent processes, will take over a year to complete.  My Office continues to co-operate and assist Fingal County Council and if a viable option to address this issue is approved, the Council may submit an application for funding to OPW or other central Government Departments as appropriate. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-13",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-05-13",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-13/writtens/mul@/dbsect_186.xml"
            }
          },
          "debateSectionId": "dbsect_186",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-13/writtens/dbsect_186",
          "showAs": "Schools Building Projects Status"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-13/pq_184",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 184,
        "showAs": " 184. Deputy Darragh O'Brien asked the Minister for Education and Skills the status of the new school building for a school (details supplied); and if he will make a statement on the matter. [4167/20] ",
        "answerText": " Minister for Education and Skills  I can confirm to the Deputy that the school to which he refers has been approved funding for a project, under my Department's Additional Accommodation Scheme 2019, for six mainstream classrooms including en-suite WCs, two SET rooms, and one Assisted Users WC.  I can further advise the Deputy that this project has been devolved for delivery to the school authority and is currently at the design stage. It is now a matter for the Board of Management to advance this project in that context. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-13",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-05-13",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-13/writtens/mul@/dbsect_213.xml"
            }
          },
          "debateSectionId": "dbsect_213",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-13/writtens/dbsect_213",
          "showAs": "Schools Building Projects Status"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-13/pq_210",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 210,
        "showAs": " 210. Deputy Darragh O'Brien asked the Minister for Education and Skills the position regarding the provision of a new school building for a school (details supplied); and if he will make a statement on the matter. [4454/20] ",
        "answerText": " Minister for Education and Skills  A building project for the school referred to by the Deputy is included in my Department's Construction Programme which is being delivered under the National Development Plan.  This project will be delivered via the ADAPT Programme, and is currently at an advanced Stage of the Tender Process. A Stage 3 Tender Report is currently with my Department for assessment. Subject to no issues arising, it is envisaged that construction will commence in the 2nd quarter of 2020, with a construction period of approximately 20 months. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-13",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-05-13",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-13/writtens/mul@/dbsect_214.xml"
            }
          },
          "debateSectionId": "dbsect_214",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-13/writtens/dbsect_214",
          "showAs": "Special Educational Needs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-13/pq_211",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 211,
        "showAs": " 211. Deputy Darragh O'Brien asked the Minister for Education and Skills the position regarding the provision of special needs places once the new school building is constructed for a school (details supplied); and if he will make a statement on the matter. [4455/20] ",
        "answerText": " Minister for Education and Skills  Ensuring that every child has a suitable school placement is a key objective of my Department. Significant resources are allocated each year to ensure that appropriate supports are available for children with special educational needs.  Since 2011, the number of special classes in mainstream schools has increased almost threefold, from 548 to 1,618 for the 2019/2020 school year.  167 new special classes have been established nationally for 2019/20 school yea, of which 55 are post primary and 111 are primary.  A list of special classes for September 2019 is available on the NCSE website at:  https://ncse.ie/wp-content/uploads/2019/05/NCSE-List-of-Special-Classes-for-September-2019.pdf  Budget 2020 provided for an additional 265 special class teachers in 2020, which will allow for the opening of additional classes where required.  The NCSE has responsibility for coordinating and advising on the education provision for children nationwide; has well established structures in place for engaging with schools and parents; and seeks to ensure that schools in an area can, between them, cater for all children who have been identified as needing special class placements.  It is open to any school to make an application to the NCSE for the establishment of a specialised provision and where sanctioned, a range of supports, including capital funding, is made available to the school. In considering these applications, however, the NSCE, in conjunction with the school buildings unit of my Department, will be required to take into account the capacity of a school to establish such a class, including the provision of sufficient accommodation space within the school.  The NCSE is planning a further expansion of special class and school places nationally to meet identified need for next year. This process is ongoing.  The building project for the school referred to by the Deputy which is at tender stage, will include as part of the accommodation, a 2 classroom Special Education Needs Base.  The NCSE's Local Special Education Needs Organisers (SENOs) are available to assist and advise both schools and the parents of children with special educational needs in relation to specialised provision. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-13",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-05-13",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-13/writtens/mul@/dbsect_1048.xml"
            }
          },
          "debateSectionId": "dbsect_1048",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-13/writtens/dbsect_1048",
          "showAs": "Covid-19 Pandemic Unemployment Payment"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-13/pq_1122",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1122,
        "showAs": " 1122. Deputy Darragh O'Brien asked the Minister for Children and Youth Affairs the supports that will be available for childcare and crèche workers as a result of the decision to close crèches and childcare facilities; and if she will make a statement on the matter. [5038/20] ",
        "answerText": " Minister for Children and Youth Affairs (Katherine Zappone)  The COVID-19 pandemic has resulted in an unprecedented situation that has required a series of emergency responses from the Government.  I am acutely aware of the particular impact the pandemic and the emergency measures have had on Early Learning and Care (ELC) and School Age Childcare (SAC) providers. I am also very conscious of the importance of the ELC and SAC sector, particularly in the context of the current conditions and with a view to supporting the economy as we move beyond this crisis.  Recognising this, DCYA has introduced the Temporary Wage Subsidy Childcare Scheme (TWSCS) to support the childcare sector during the closure period. The Temporary Wage Subsidy Childcare Scheme was launched on 15 April. The TWSCS operates in conjunction with the Revenue Temporary Wage Subsidy Scheme (TWSS), which is expected to last up to 12 weeks from 26 March 2020.  The aim of the Temporary Wage Subsidy Childcare Scheme is threefold:  - to support the sustainability of the Early Learning and Care (ELC) and School Age Childcare (SAC) sector so that it is in a position to reopen after COVID-19;  - to provide parents with a reassurance that they are not required to pay fees during this COVID-19 crisis, while providing them with reassurance that they will maintain places for their children; and  - to give members of the ELC and SAC workforce security and retain these vital Educators in the sector.  To achieve this there are three key elements to the new Scheme:  (i) In addition to the wage subsidy provided by Revenue’s TWSS, DCYA is topping-up wages of eligible ELC and SAC staff by the maximum additional payment an employer can make to receive full wage subsidy under the Revenue and DCYA schemes combined, to a limit of €586 weekly pay in line with the Revenue scheme.  (ii) Where a staff member’s pre-12 March weekly wage was below the DEASP set rate for temporary Pandemic Unemployment Payment (PUP; currently €350 per week), DCYA is, on a temporary basis, providing funding to be used to top-up eligible employees’ wages to the DEASP rate set for the PUP, meaning that all staff are encouraged to remain with their employer rather than sign on with the DEASP.  (iii) To reflect the unique circumstances of the sector, in addition to funding eligible staff wages up to the maximum additional payment an employer can make to receive the full wage subsidy under the Revenue and DCYA schemes combined up to the cap, services are receiving a further payment which is based on a percentage of their total eligible staff gross weekly pay to be used towards ongoing / non-deferrable operational costs  To date, three preliminary TWSCS payments have been made under the scheme on 24 April, 1 May and 8 May to all providers who had signed up the scheme and backdated to 6 April. Details of how to sign up have been made available through the Pobal programme platform used by ELC and SAC providers. Prior to the introduction of the scheme, DCYA had continued to fund childcare providers under the existing subsidy schemes, including ECCE (free pre-school) and the National Childcare Scheme on an ex-gratia basis to 10 April. Funding under these schemes has now been suspended.  It was important to move to this new temporary funding model to support as many of the 4500 services as possible, not just those in receipt of significant State funding under the beneficiary schemes. The TWSCS repurposes existing ELC and SAC monies to layer on top of the Revenue Temporary Wage Subsidy Scheme (TWSS) and to support the multiplicity of ELC and SAC provider types with varying ratios of State income and parental contribution.  By 10 May over 3,700 childcare services, 82% of the total number, had signed up the TWSCS. The scheme remains open for late entrants.  Administration of the scheme is being managed by Pobal. DCYA has issued comprehensive FAQs on the scheme to providers and their representative bodies. The TWSCS builds on the wider provisions by Government and also recognises the unique place and importance of the early education and childcare sector.  Expert advice and support is available generally to services across the country through the 30 City and County Childcare Committees, Pobal and a number of funded Childcare Organisations. The Department continues to work intensively with the sector. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-13",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-03-05",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-03-05/writtens/mul@/dbsect_66.xml"
            }
          },
          "debateSectionId": "dbsect_66",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-03-05/writtens/dbsect_66",
          "showAs": "Sale of Aer Lingus"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-03-05/pq_63",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 63,
        "showAs": " 63. Deputy Darragh O'Brien asked the Minister for Finance the way in which his Department has used the moneys the State received from the sale of its stake in Aer Lingus; and if he will make a statement on the matter. [2943/20] ",
        "answerText": " Minister for Finance  The proceeds of the sale of the state's shareholding in Aer Lingus have been used to establish the Connectivity Fund which is managed by the Ireland Strategic Investment Fund (ISIF). The Connectivity Fund is being invested on a commercial basis as a sub portfolio of the ISIF, and consistent with the overall ISIF double bottom line mandate which is to invest for both commercial return and economic impact.  ISIF have advised me that it has completed four investments under the Connectivity Fund, namely:  - A $28 million co-investment in Aqua Comms DAC, a company that has developed fibre optic cables linking the USA, Ireland (Killala, Mayo) and the UK.  - A €35 million investment as a strategic domestic partner for daa plc long-term bond issuance, supporting construction of a new runway at Dublin Airport.  - Provision of a long term €14 million debt facility to finance a runway surfacing project at Shannon Airport - a crucial regional and national infrastructure asset. This debt facility was signed in early 2017 and the runway resurfacing project has been completed on time and within budget.  - An €18 million Junior Debt facility to support the relocation of the Port of Cork from Tivoli to Ringaskiddy. The ISIF debt facility was provided alongside senior debt from Allied Irish Banks and the European Investment Bank and was structured to ensure certainty of funding for the Port Company. It also has tailored flexibility to meet the requirements of this nationally and regionally significant project.  These investments bring the total deployed under the Connectivity Fund to over €90 million. ISIF have informed me that there are a range of further pipeline connectivity-based investments on which it is currently working.  ISIF’s refocused strategy targets five priority themes, one of which is investment to support regional development. As such, the ISIF have advised that the Connectivity Fund will henceforth be focused on commercial investments that support improved regional connectivity. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-03-05",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-03-05",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-03-05/writtens/mul@/dbsect_149.xml"
            }
          },
          "debateSectionId": "dbsect_149",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-03-05/writtens/dbsect_149",
          "showAs": "Coastal Erosion"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-03-05/pq_153",
        "to": {
          "roleType": null,
          "showAs": "Public",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 153,
        "showAs": " 153. Deputy Darragh O'Brien asked the Minister for Public Expenditure and Reform if all necessary financial assistance will be provided to Fingal County Council to tackle the alarming rate of coastal erosion that is occurring at The Burrow, Portrane, County Dublin; and if he will make a statement on the matter. [3345/20] ",
        "answerText": " Minister of State at the Department of Public Expenditure and Reform (Kevin Boxer Moran)  I am advised, in respect of coastal erosion at the Burrow, Portrane, County Dublin, that Fingal County Council is leading on this issue, as it is a matter for local authorities in the first instance to assess and address problems of coastal erosion in their areas.  Where necessary, local authorities may put forward proposals to relevant central Government Departments, including the OPW, for funding of appropriate measures depending on the infrastructure or assets under threat.  In 2018, in response to serious coastal erosion problems at The Burrow, Portrane, Fingal County Council implemented temporary interim emergency measures to protect properties at risk.  Funding of €456,464 was approved under the OPW Minor Flood Mitigation Works and Coastal Protection Scheme for these works.  Consultants appointed by Fingal County Council are currently assessing options for a longer term permanent solution for the Portrane Peninsula/Rogerstown Outer Estuary area. My Office continues to co-operate and assist Fingal County Council in every way and if a viable option is identified, the Council may submit a further application for funding to the OPW or other Government Departments as appropriate. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-03-05",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-03-05",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-03-05/writtens/mul@/dbsect_150.xml"
            }
          },
          "debateSectionId": "dbsect_150",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-03-05/writtens/dbsect_150",
          "showAs": "Coastal Protection"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-03-05/pq_154",
        "to": {
          "roleType": null,
          "showAs": "Public",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 154,
        "showAs": " 154. Deputy Darragh O'Brien asked the Minister for Public Expenditure and Reform the progress in the preparation of a national coastal erosion strategy and plan in view of the fact the situation has become grave; and if he will make a statement on the matter. [3346/20] ",
        "answerText": " Minister of State at the Department of Public Expenditure and Reform (Kevin Boxer Moran)  The Government agreed to the establishment of an Inter-Departmental Group to scope out an approach for the development of an integrated, whole of Government coastal strategy, for managing our changing coast and to report back to Government within a period of 6 months with its initial findings and recommendations.  The Inter-Departmental Group will be established shortly and will be jointly chaired by the Department of Housing, Planning and Local Government and the Office of Public Works. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-03-05",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-03-05",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-03-05/writtens/mul@/dbsect_225.xml"
            }
          },
          "debateSectionId": "dbsect_225",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-03-05/writtens/dbsect_225",
          "showAs": "Schools Refurbishment"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-03-05/pq_226",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 226,
        "showAs": " 226. Deputy Darragh O'Brien asked the Minister for Education and Skills his plans to ensure the extension and refurbishment of a school (details supplied) proceeds to the tender and build stage without further delay by granting the school rapid build status; and if he will make a statement on the matter. [3026/20] ",
        "answerText": " Minister for Education and Skills  As the Deputy is aware, the project to which he refers has been devolved to Dublin and Dún Laoghaire Education and Training Board (DDLETB) for delivery.  My Department is fully aware of the need to urgently progress this project. However, it is of utmost importance that the final outcome for this project will be the correct one for both the entire school community. In that regard, I would like to inform the Deputy that DDLETB has recently completed a review of the project which put forward an alternative option for progressing it and a report in respect of same has been provided. This report is currently under active consideration by officials in my Department.  Finally, I would like to advise the Deputy that, as the delivery method for the project has already been determined, it is not possible to consider an alternative. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-03-05",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    },
    {
      "contextDate": "2020-03-05",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-03-05/writtens/mul@/dbsect_226.xml"
            }
          },
          "debateSectionId": "dbsect_226",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-03-05/writtens/dbsect_226",
          "showAs": "Schools Building Projects Status"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-03-05/pq_227",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 227,
        "showAs": " 227. Deputy Darragh O'Brien asked the Minister for Education and Skills the status of the provision of a new school building project for a school (details supplied); if the acquisition of a new site for the school has been completed; and if he will make a statement on the matter. [3027/20] ",
        "answerText": " Minister for Education and Skills  As the Deputy is aware the building project for the school in question is included on my Department's capital programme.  The acquisition of a site for this school is at an advanced stage in the conveyancing process and my officials are working to bring it to conclusion at the earliest possible date. Due to the commercially sensitive nature of site acquisitions, it is not possible to comment further at this time. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-03-05",
        "by": {
          "showAs": "Darragh O'Brien",
          "memberCode": "Darragh-O'Brien.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Darragh-O'Brien.D.2007-06-14"
        }
      }
    }
  ]
}