{
  "head": {
    "counts": {
      "questionCount": 2313,
      "resultCount": 2313
    }
  },
  "results": [
    {
      "contextDate": "2025-07-08",
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-08/pq_695",
        "house": {
          "chamberType": "house",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "showAs": "34th Dáil"
        },
        "questionNumber": 695,
        "date": "2025-07-08",
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 695 and 696 together.  Bovine TB is a challenging disease to control and eradicate. In recent years, bTB levels have continued to deteriorate, herd incidence has increased from 4.94% in 2023 to 6.04% in 2024. As of 29th June 2025, over a 12-month period we had a herd incidence of 6.40% with over 43,290 reactors. This disease is having an impact on our farmers and their families emotionally and financially throughout rural Ireland.  When cattle are slaughtered as reactors under the TB Eradication Programme, it is because they have tested positive for infection with TB. It is not routine to perform culture or other laboratory tests on all TB reactors, and such tests are generally less sensitive than the skin test and other ante-mortem tests.  Visual inspection of reactor carcases at post-mortem finds that, on average, over the last three years from 2024 to 2022 a range of 24-36% of such reactors had visible lesions of tuberculosis, meaning the infection has progressed to a stage where the disease process has caused such significant tissue damage that it can be seen with the naked eye.  The table below shows Total Reactors, Number Lesions and Lesion % rate over the last 3 years 2024 – 2022. Generally lower lesion rates indicate a higher proportion of new infections relative to older infections and earlier detection of positive animals overall.  If a reactor does not have visible disease lesions, it does not mean it is not infected; visual inspection cannot detect the presence of microscopic lesions and bacteria within the tissues of such animals. Most TB reactors have “no visible lesion” (NVL) when the routine postmortem examination is carried out by veterinary staff at slaughter plants.  The majority of such NVL animals are in fact infected with TB- they have just been detected sufficiently early that lesions have not become apparent to the naked eye.  My Department has produced leaflets and videos to explain how the tests work and what to expect from them and are available on www.bovinetb.ie/.  Table of TB Reactors and Lesions 2024 - 2022     Year    Total Reactors    No. Lesions    Lesion %      2024    41,682    9,931    24%      2023    28,901    8,011    28%      2022    23,393    8,391    36%      ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "debateSection": {
          "showAs": "Animal Diseases",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-08/writtens/dbsect_562",
          "debateSectionId": "dbsect_562",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-08/writtens/mul@/dbsect_562.xml"
            },
            "pdf": null
          }
        },
        "showAs": " 695. Deputy James Lawless asked the Minister for Agriculture, Food and the Marine to provide comparative data between the number of cattle that fail the bovine TB skin test and the number of cattle subsequently confirmed to have TB lesions at slaughter; if he will review current testing methodologies for accuracy in light of these figures; and if he will make a statement on the matter. [37145/25] ",
        "questionType": "written",
        "by": {
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "showAs": "James Lawless"
        }
      }
    },
    {
      "contextDate": "2025-07-08",
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-08/pq_696",
        "house": {
          "chamberType": "house",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "showAs": "34th Dáil"
        },
        "questionNumber": 696,
        "date": "2025-07-08",
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 695 and 696 together.  Bovine TB is a challenging disease to control and eradicate. In recent years, bTB levels have continued to deteriorate, herd incidence has increased from 4.94% in 2023 to 6.04% in 2024. As of 29th June 2025, over a 12-month period we had a herd incidence of 6.40% with over 43,290 reactors. This disease is having an impact on our farmers and their families emotionally and financially throughout rural Ireland.  When cattle are slaughtered as reactors under the TB Eradication Programme, it is because they have tested positive for infection with TB. It is not routine to perform culture or other laboratory tests on all TB reactors, and such tests are generally less sensitive than the skin test and other ante-mortem tests.  Visual inspection of reactor carcases at post-mortem finds that, on average, over the last three years from 2024 to 2022 a range of 24-36% of such reactors had visible lesions of tuberculosis, meaning the infection has progressed to a stage where the disease process has caused such significant tissue damage that it can be seen with the naked eye.  The table below shows Total Reactors, Number Lesions and Lesion % rate over the last 3 years 2024 – 2022. Generally lower lesion rates indicate a higher proportion of new infections relative to older infections and earlier detection of positive animals overall.  If a reactor does not have visible disease lesions, it does not mean it is not infected; visual inspection cannot detect the presence of microscopic lesions and bacteria within the tissues of such animals. Most TB reactors have “no visible lesion” (NVL) when the routine postmortem examination is carried out by veterinary staff at slaughter plants.  The majority of such NVL animals are in fact infected with TB- they have just been detected sufficiently early that lesions have not become apparent to the naked eye.  My Department has produced leaflets and videos to explain how the tests work and what to expect from them and are available on www.bovinetb.ie/.  Table of TB Reactors and Lesions 2024 - 2022     Year    Total Reactors    No. Lesions    Lesion %      2024    41,682    9,931    24%      2023    28,901    8,011    28%      2022    23,393    8,391    36%      ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "debateSection": {
          "showAs": "Animal Diseases",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-08/writtens/dbsect_562",
          "debateSectionId": "dbsect_562",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-08/writtens/mul@/dbsect_562.xml"
            },
            "pdf": null
          }
        },
        "showAs": " 696. Deputy James Lawless asked the Minister for Agriculture, Food and the Marine the percentage of animals slaughtered with TB actually have TB; if he will review current testing methodologies for accuracy in light of these figures; and if he will make a statement on the matter. [37146/25] ",
        "questionType": "written",
        "by": {
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "showAs": "James Lawless"
        }
      }
    },
    {
      "contextDate": "2025-03-06",
      "question": {
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  Improving access to quality and affordable Early Learning and Care and School Age Childcare is a key priority of Government.  Early learning and childcare capacity is increasing.  An annual sector profile demonstrates an 8% increase in enrolments between 2021/22 and 2022/23. Core Funding application data shows that between Year 1 and Year 2 of the scheme, annual place hours increased by almost 8%. The Tusla register of services demonstrates a net increase in the numbers of registered early learning and childcare services in 2024. However, it appears that demand for Early Learning and Care and School Age Childcare remains higher than available supply, particularly for younger children and in certain parts of the country.  Demand for early learning and childcare beyond sessional preschool provision is highly elastic and shaped very substantially by families' individual composition, circumstances, and preferences; employment patterns and income; and the price and availability of services.  Last year, a Supply Management Unit within the Early Learning and Care and School Age Childcare Division was established, and the Programme for Government articulates an intention that the unit be resourced and transformed into a Forward Planning and Delivery Unit to identify areas of need, forecast demand, and deliver public supply within the childcare sector where required.  A forward planning model is in development which will be central to my Department's plans to achieve the policy goals set out in the Programme for Government to build an affordable, high-quality, accessible early childhood education and care system, with State-led facilities adding capacity.  My Department continues to support the ongoing development and resourcing of Core Funding which has given rise to a significant expansion of places since the scheme was first introduced. Core Funding, which is in its third programme year, funds services based on the number of places available, whether or not they are filled.  This provides stability to services, and reduces the risk associated with opening a new service or expanding an already existing service. For the current programme year, the allocation for Core Funding would be able to capture almost a 6% increase in capacity. Additional funding was secured in Budget 2025 to facilitate a further 3.5% increase from September 2025, in the fourth programme year.  The Government is also supporting the expansion of capacity through capital funding. The Building Blocks Extension Grant Scheme was launched on the 4th of November 2024. Applications for this scheme have now closed and an appraisal process has begun. The primary focus of the Extension Grant Scheme is to increase capacity in the 1–3-year-old, pre–Early Childhood Care and Education, age range for full day care.  Appraisal of applications for this scheme will consider the supply and demand in the area around the proposed projects and seeks to prioritise funding for areas with the biggest supply/demand mismatch. €25m will be made available this year to deliver additional capacity under the Scheme and I expect to announce the outcome of the application process in March.  My Department funds 30 City/County Childcare Committees, which provide support and assist families and early learning and childcare providers. The network of 30 City/County Childcare Committees across the country can assist in identifying vacant places in services for children and families who need them and engage proactively with services to explore possibilities for expansion among services, particularly where there is unmet need. Contact details for County Kildare Childcare Committee may be found at www.kccc.ie ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-06/pq_370",
        "questionNumber": 370,
        "showAs": " 370. Deputy James Lawless asked the Minister for Children, Equality, Disability, Integration and Youth to examine the issue of childcare shortages (details supplied); her plans to resolve this matter; and if she will make a statement on the matter. [10363/25] ",
        "questionType": "written",
        "date": "2025-03-06",
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-06/writtens/mul@/dbsect_377.xml"
            }
          },
          "showAs": "Departmental Inquiries",
          "debateSectionId": "dbsect_377",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-06/writtens/dbsect_377"
        },
        "by": {
          "memberCode": "James-Lawless.D.2016-10-03",
          "showAs": "James Lawless",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03"
        },
        "to": {
          "showAs": "Children",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "house": {
          "committeeCode": "",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "houseNo": "34",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        }
      }
    },
    {
      "question": {
        "questionNumber": 408,
        "debateSection": {
          "showAs": "Special Educational Needs",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-04/writtens/mul@/dbsect_324.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-04/writtens/dbsect_324",
          "debateSectionId": "dbsect_324"
        },
        "to": {
          "showAs": "Education",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister of State at the Department of Education  This government is fully committed to supporting children with special educational needs to fulfil their full potential and the Programme for Government makes a number of commitments to deliver on this objective.  The National Council for Special Education (NCSE) has responsibility for coordinating and advising on the education provision for children with special educational needs. They advise that the local special educational needs organiser (SENO) is working closely with the student’s family regarding options for school placements and other special education supports for the coming academic year.  Through the accelerated provision of additional special class and special school places over recent years, there are now just over 28,000 students enrolled in special classes and special schools. Budget 2025 provides for an additional 2,700 specialist places, made up of 400 new special classes, for on average six children each and 300 additional special school places. On top of this, there will be well over 1,000 places available through the normal annual movement of students progressing from primary to post-primary and students graduating from post-primary or special schools. There are also existing special class vacancies in some areas of the country.  Of the 400 new special classes places provided for in Budget 2025, the NCSE has advised that 209 of these classes have already been sanctioned for the 2025/26 school year. Of these nine are in County Kildare, six at primary and three at post primary level. This will add to the 131 special classes currently in operation in the county. There are also six special schools in Kildare with approximately 360 students enrolled.  In County Kildare and indeed nationwide, the NCSE continue to engage intensely with schools and school patron bodies to confirm further new special classes. As the NCSE progress the sanctioning of the remaining special classes they will inform parents.  Where new special classes have been sanctioned, I would urge schools to progress the admission of students as soon as possible to ensure that the NCSE can continue to evaluate demand in local areas, sanction classes as required and assist parents in securing a school place.  My department and the NCSE are committed to ensuring that sufficient special education placements remain available for children with special educational needs. ",
        "showAs": " 408. Deputy James Lawless asked the Minister for Education to provide an update on the provision of extra ASD school places in north County Kildare (details supplied); and if she will make a statement on the matter. [9793/25] ",
        "questionType": "written",
        "house": {
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-04/pq_408",
        "by": {
          "showAs": "James Lawless",
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03"
        },
        "date": "2025-03-04"
      },
      "contextDate": "2025-03-04"
    },
    {
      "question": {
        "questionNumber": 629,
        "debateSection": {
          "showAs": "Childcare Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-04/writtens/mul@/dbsect_530.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-03-04/writtens/dbsect_530",
          "debateSectionId": "dbsect_530"
        },
        "to": {
          "showAs": "Children",
          "roleType": null,
          "uri": null,
          "roleCode": null
        },
        "answerText": "",
        "showAs": " 629. Deputy James Lawless asked the Minister for Children, Equality, Disability, Integration and Youth if he will examine timelines for the further reductions in child care costs under the national childcare scheme (details supplied); and if she will make a statement on the matter. [9792/25] ",
        "questionType": "written",
        "house": {
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-03-04/pq_629",
        "by": {
          "showAs": "James Lawless",
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03"
        },
        "date": "2025-03-04"
      },
      "contextDate": "2025-03-04"
    },
    {
      "contextDate": "2025-02-26",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-26/writtens/mul@/dbsect_142.xml"
            }
          },
          "debateSectionId": "dbsect_142",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-26/writtens/dbsect_142",
          "showAs": "School Accommodation"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-26/pq_135",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 135,
        "showAs": " 135. Deputy James Lawless asked the Minister for Education for an update on the progression of matters regarding the sign off on temporary accommodation for a school (details supplied) in order for the school to accommodate additional students due to the school being oversubscribed; and if she will make a statement on the matter. [8343/25] ",
        "answerText": " Minister for Education  I propose to take Questions Nos. 135, 163 and 164 together.  My Department is in the process of arranging interim accommodation for the school referred to by the Deputy in order to facilitate the school's immediate requirements pending delivery of their major building project. My officials are aware of the urgency associated with this accommodation and are working closely with the school authority and its design team to ensure the project is expediated.  The Department can also confirm that the school's major project which is devolved to Kildare and Wicklow Education and Training Board is currently at stage 2b of the architectural planning process. This stage allows for detailed design/planning, obtaining the necessary statutory permissions and preparation of tender documents.  The planning application was lodged in quarter 1 2024. A Request for Further Information (RFI) was subsequently received. The Design Team has submitted a response to the RFI and subject to any further issues arising during the planning process, the project will proceed to tender and construction in due course. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail"
        },
        "date": "2025-02-26",
        "by": {
          "showAs": "James Lawless",
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2025-02-25",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-25/writtens/mul@/dbsect_586.xml"
            }
          },
          "debateSectionId": "dbsect_586",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-25/writtens/dbsect_586",
          "showAs": "Animal Diseases"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-25/pq_721",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 721,
        "showAs": " 721. Deputy James Lawless asked the Minister for Agriculture, Food and the Marine what actions are being taken to mitigate the prevalence of TB in the cattle population, considering the traumatic effect is has to livelihoods and the beef industry; and if he will make a statement on the matter. [8092/25] ",
        "answerText": " Minister for Agriculture, Food and the Marine  Bovine tuberculosis (bTB) is a challenging disease to control and eradicate. I am committed to making real progress in eradicating TB because I am acutely aware of the emotional and financial trauma associated with a TB breakdown for farmers, most especially the impact it has on the livelihoods of those in both the beef and dairy industries.  The implementation of the Bovine TB Eradication Strategy 2021-2030 is overseen by the Bovine TB Stakeholders Forum along with support from three working groups – a Scientific group, an Implementation Working Group and a Finance Group to ensure all aspects of the Strategy are addressed. The Bovine TB Stakeholders Forum and its working groups comprise of representatives from across the agri-food sector, leading researchers, farming organisations and my Department.  I am committed to reducing TB incidence rates across the country. Recent years has unfortunately seen a deterioration in the incidence of this disease, however all stakeholders and I are working collaboratively to ensure that we all ensure all steps necessary to control this disease are taken. We must keep this going with the ultimate aim of eradicating TB from the herd.  The details of the TB Strategy along with details of TB Forum and working groups are available on www.bovinetb.ie ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail"
        },
        "date": "2025-02-25",
        "by": {
          "showAs": "James Lawless",
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2025-02-19",
      "question": {
        "by": {
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "showAs": "James Lawless"
        },
        "date": "2025-02-19",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-19/pq_146",
        "answerText": " Minister for Social Protection  Disability Allowance (DA) is a means-tested payment for people with a specified disability whose income falls below certain limits and who are aged between 16 and are under 66.  The Department periodically reviews claims in payment to ensure that there is a continued entitlement. In this case the means of the person concerned were reviewed in line with DA eligibility. On 27th February 2024, the person concerned was notified in writing that that he no longer had an entitlement to DA from 6th March 2024, as his weekly means of €438.00 exceeded the statutory limit of €232.00 in his case.  Following a review of the means calculation in this case, there was no change to the original decision to disallow on means in excess grounds. The person concerned was notified on 9th November 2024 of this decision, the reason for it and his right of review and/or appeal.  As no new evidence relating to the assessment of the means of person concerned has been submitted, it has been determined that the decision of 4th November 2024 remains unchanged.  As he does not meet the criteria for receipt of DA, backdating of a claim can not be considered. Currently the person concerned is unlikely to qualify for other illness-based payments, either Illness Benefit or Invalidity Pension, due to the PRSI contribution criteria for entitlement of same.  Should this person's circumstances change, he can contact the Disability Allowance section.  I trust this clarifies the position for the Deputy. ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 146. Deputy James Lawless asked the Minister for Social Protection further to Parliamentary Question No. 842 of 22 January 2025, if the case of a person (details supplied) will be examined further; and if he will make a statement on the matter. [6772/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_172",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-19/writtens/mul@/dbsect_172.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-19/writtens/dbsect_172",
          "showAs": "Social Welfare Eligibility"
        },
        "questionNumber": 146,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-19",
      "question": {
        "by": {
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "showAs": "James Lawless"
        },
        "date": "2025-02-19",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-19/pq_186",
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  The Accommodation Recognition Payment (ARP) was introduced to recognise the generosity of people who have opened their homes to provide accommodation to Beneficiaries of Temporary Protection (BOTPs) who arrived in Ireland after fleeing the war in Ukraine.  The ARP scheme is provided in Part 2 of the Civil Law (Miscellaneous Provisions) Act 2022 and is administered by the Department of Social Protection on my behalf. In line with extensions of the EU Temporary Protection Directive (TPD), the ARP scheme was initially extended to 31 March 2024 and then to 31 March 2025.  As the TPD is now extended to March 2026, consideration is being given to the extension of the ARP scheme. Resolutions must be passed by both Houses of the Oireachtas before this Order is made. A decision will be reached in respect of the ARP shortly. ",
        "to": {
          "uri": null,
          "showAs": "Children",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 186. Deputy James Lawless asked the Minister for Children, Equality, Disability, Integration and Youth for an update on the accommodation recognition payment scheme; and if she will make a statement on the matter. [6773/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_203",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-19/writtens/mul@/dbsect_203.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-19/writtens/dbsect_203",
          "showAs": "International Protection"
        },
        "questionNumber": 186,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-18",
      "question": {
        "by": {
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "showAs": "James Lawless"
        },
        "date": "2025-02-18",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-18/pq_511",
        "answerText": " Minister for Justice  I am happy to inform the Deputy that following full consideration by a Visa Officer the Visa was issued on 10 February 2025.The person concerned can now directly check the status of their immigration application on the Immigration Service’s new Digital Contact Centre. They can register for, or log in to their existing account, at: https://portal.irishimmigration.ie/en/ as an Oireachtas member, you can also request the status of individual immigration cases by e-mail, using the Oireachtas Mail facility at: IMoireachtasmail@justice.ie, which has been specifically established for this purpose. This service enables up to date information on such cases to be obtained without the need to seek information by way of the Parliamentary Question process.   ",
        "to": {
          "uri": null,
          "showAs": "Justice",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 511. Deputy James Lawless asked the Minister for Justice to review the case of a person (details supplied); and if he will make a statement on the matter. [5670/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_404",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-18/writtens/mul@/dbsect_404.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-18/writtens/dbsect_404",
          "showAs": "Departmental Correspondence"
        },
        "questionNumber": 511,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-11",
      "question": {
        "by": {
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "showAs": "James Lawless"
        },
        "date": "2025-02-11",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-11/pq_627",
        "answerText": " Minister for Health  As the Deputy may be aware, the Model of Care for Fertility was developed by the Department of Health in conjunction with the HSE’s National Women & Infants Health Programme (NWIHP) in order to ensure that fertility-related issues are addressed through the public health system at the lowest level of clinical intervention necessary.  This Model of Care comprises three stages, starting in primary care (i.e., GPs) and extending into secondary care (i.e., the six Regional Fertility Hubs located across the country) and then, where necessary, AHR (assisted human reproduction) treatment (e.g., IVF (in-vitro fertilisation) and ICSI (intra-cytoplasmic sperm injection)), with patients being referred onwards through structured pathways.  Phase One of the roll-out of the Model of Care has involved the establishment, at secondary care level, of six Regional Fertility Hubs within maternity networks covering the entire country, in order to facilitate the management of a significant proportion of patients presenting with fertility-related issues at this level of intervention. Patients are referred by their GPs to their local Regional Fertility Hub, which provides a range of treatments and interventions.  Phase Two of the roll-out of the Model of Care relates to the introduction of AHR treatment, including IVF, provided through the public health system at tertiary level.  Appropriate funding has been made available to support access to AHR treatment via HSE-approved private providers. As well as IVF and ICSI, this allocation is also being used to provide, initially through private clinics, IUI (intrauterine insemination), which can, for certain cohorts of patients, be a potentially effective, yet less complex and less intrusive form of treatment.  Referrals for AHR treatment by private providers commenced in September 2023. Criteria prospective patients should meet in order to access fully-funded AHR services and the services to be initially funded were agreed by the Department and the HSE and subsequently approved by Government in July 2023. More details on public fertility services, including information on the publicly-funded AHR treatment initiative, are available from the HSE at: www2.hse.ie/conditions/fertility-problems-treatments/fertility-treatment/  This scheme has proven to be very successful overall. As of the end of January, just over 1,800 couples have been referred by a Reproductive Specialist Consultant for AHR treatment following extensive investigations and/or secondary level treatment within the Regional Fertility Hubs.  Furthermore, the Hubs have successfully and directly managed numerous other patients presenting with fertility-related issues who have been referred by their GP. Not all couples experiencing fertility challenges actually require such advanced and invasive interventions as IVF.  The access criteria for public patients to avail of services provided at a Regional Fertility Hub are less stringent than those required to be met in order to avail of free AHR treatment. For example, there is no limit as to the number of children a couple may already have. Further details are available at the link above.  Therefore, it is advised that if a couple is experiencing fertility challenges, and they meet the access criteria for care and management at Regional Fertility Hub level, then they should seek a referral from their GP. Each Regional Fertility Hub is positioned to provide a suite of investigations and tests free of charge and can commence working with the couple to identify next appropriate clinical steps, many of which may be available within the Hub itself or by means of a referral to another public service, for example, endocrinology or urology.  The access criteria and the AHR treatment scheme generally are being kept under ongoing review as new evidence becomes available and an understanding of how the service provision is working in practice emerges. The details in respect of any agreed changes to the access criteria or the scheme more broadly require further extensive consultation between my officials, colleagues in the HSE and also with relevant specialists in the field of reproductive medicine.  I want to reassure the Deputy that my Department and the Government are focused, through the full implementation of the Model of Care for Fertility, on ensuring that patients receive care at the appropriate level of clinical intervention and then those requiring, and eligible for, advanced AHR treatment such as IVF will be able to access same through the public health system. ",
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 627. Deputy James Lawless asked the Minister for Health to examine the case of a person (details supplied) regarding IVF programme changes; and if she will make a statement on the matter. [4286/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_610",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-11/writtens/mul@/dbsect_610.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-11/writtens/dbsect_610",
          "showAs": "Assisted Human Reproduction"
        },
        "questionNumber": 627,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "showAs": "James Lawless"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_324",
        "answerText": " Minister of State at the Department of Public Expenditure, National Development Plan Delivery and Reform  The progression of Chapter 4 (188) of the Historic and Archaeological Heritage and Miscellaneous Provisions Act 2023 would be a matter for the Department of Housing, Heritage and Local Government.  It should be noted, however, that Castletown House is not designated as a National Monument so would not fall under the remit of this Act. It should also be further noted, that the State has its own access to Castletown House via the Celbridge Gate and therefore does not need to rely on this legislation to legally access this important national heritage site. ",
        "to": {
          "uri": null,
          "showAs": "Public Expenditure",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 324. Deputy James Lawless asked the Minister for Public Expenditure, National Development Plan Delivery and Reform to examine the case of a property in County Kildare (details supplied); and if he will make a statement on the matter. [2711/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_314",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_314.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_314",
          "showAs": "Departmental Schemes"
        },
        "questionNumber": 324,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-02-05",
      "question": {
        "by": {
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "showAs": "James Lawless"
        },
        "date": "2025-02-05",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-02-05/pq_359",
        "answerText": " Minister for Public Expenditure, National Development Plan Delivery and Reform  Responsibility for the administration of sectoral pension schemes and the processing of individual pension cases resides with the relevant Government Department or public body in the first instance, subject to the overarching policy framework set out by my Department.  Circular 12/2024 was published last year to clarify and standardise the policy with regard to occupational supplementary pensions. Per this circular, as of 1st August 2024 occupational supplementary pensions are uprated to take account of any pay increases which apply to public service pensions after the date of retirement, subject to the occupational supplementary pension not exceeding the maximum rate of the contributory state pension.  The calculation and application of any such increases within individual schemes is an operational matter for the relevant pension paying authority, and my Department remains available to provide any additional advice or guidance that they may require in order to implement this policy. ",
        "to": {
          "uri": null,
          "showAs": "Public Expenditure",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 359. Deputy James Lawless asked the Minister for Public Expenditure, National Development Plan Delivery and Reform to examine the case of pension arrears affecting a person (details supplied); and if he will make a statement on the matter. [3556/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_341",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/mul@/dbsect_341.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-02-05/writtens/dbsect_341",
          "showAs": "Public Sector Pensions"
        },
        "questionNumber": 359,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "showAs": "James Lawless"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_331",
        "answerText": " Minister for Finance  Creditors have the general right to assign or sell their benefits and rights under an existing credit agreement to another creditor, without changing the debtor's obligations and rights as also set out in the particular agreement or as subsequently agreed.  Therefore, when a creditor's benefits under a credit agreement are sold to another entity, the terms of that particular agreement remain in place and do not change, subject to any relevant modifications such as in relation to scheduled repayments or the overall repayment amount as may be agreed with the creditor prior to the sale.  In addition, the entity which acquires the legal rights of creditor under a credit contract with a consumer or who services such an agreement will also fall within the regulatory remit of the Central Bank. This is set out in the Consumer Protection (Regulation of Credit Servicing Firms) Acts 2015 to 2022 and the European Union (Credit Servicers and Credit Purchasers) Regulations 2023.  Accordingly the various Central Bank consumer protection codes, such as the Code of Conduct on Mortgage Arrears (CCMA) and other regulatory protections will also apply after the loan sale.  Separately, in line with accountancy and regulatory requirements, a company is required to keep proper books of account which give a true and fair view of its financial affairs, including the value of its revenue and assets such as where applicable its loan receivables.  Therefore, if an entity considers that it may not recover the full amount of the benefits due to it under a particular agreement, or if it has no further legal right to repayments under the agreement due to, for example, its sale of the loan to another creditor, it may, for financial reporting purposes, be obliged to ‘write down’ the loan or ‘write off’ the amount it considers it will not be repaid.  However, that does not of itself affect the legal rights and obligations of either the creditor or the debtor, including the debtor’s obligation to repay the loan in line with the current contractual terms or other outstanding legal obligations. Therefore, unless any such ‘write off’ also involves an express agreement between the debtor and the relevant creditor for a reduction in the amount of debt owed, the ‘write off’ of debt for accountancy purposes will not impact on the debtor’s liability to repay the outstanding debt amount to the particular creditor which is entitled to receive that amount. ",
        "to": {
          "uri": null,
          "showAs": "Finance",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 331. Deputy James Lawless asked the Minister for Finance to examine a matter affecting Irish mortgage holders (details supplied); and if he will make a statement on the matter. [46779/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_325",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_325.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_325",
          "showAs": "Banking Sector"
        },
        "questionNumber": 331,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "showAs": "James Lawless"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_379",
        "answerText": " Minister for Public Expenditure, National Development Plan Delivery and Reform  I am advised by the Public Appointments Service (PAS) that the original decision taken in this case was subject to formal review.  This review was carried out by a formal reviewer from the Compliance function in PAS, which operates independently of recruitment. The formal reviewer issued the outcome to the candidate on 5th December 2024.  The candidate raised issues in relation to his previous employment and was advised that the focus of the review was on the decision made by PAS and the evidence for that decision. He was advised that any grievances, complaints or issues he might have had with his employer were outside of the scope of the review, as was his request that PAS review his employer’s PMDS process.  All of the relevant information provided by the candidate was considered in the course of this review.  The candidate was also advised that, as the Section 7 review is final, there is no recourse to further review by PAS. Section 7.3 of the Code of Practice for Appointments to the Civil Service and Public Service published by the Commission for Public Service Appointments states that:  “Where a formal review of a recruitment and selection process has taken place under Section 7 of this Code of Practice, a complainant may not seek a further review of the same process under Section 8, other than in the most exceptional circumstances that will be determined by the Commission at its sole discretion.”  Outside of this, the candidate was also informed that candidates are also free to exercise their rights as they see fit and that PAS would fully engage with any enquiries that may arise from such processes. ",
        "to": {
          "uri": null,
          "showAs": "Public Expenditure",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 379. Deputy James Lawless asked the Minister for Public Expenditure, National Development Plan Delivery and Reform if he will examine the case of a person (details provided); and if he will make a statement on the matter. [46849/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_373",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_373.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_373",
          "showAs": "Public Appointments Service"
        },
        "questionNumber": 379,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "showAs": "James Lawless"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_380",
        "answerText": " Minister for Public Expenditure, National Development Plan Delivery and Reform  The Single Public Service Pension Scheme was introduced in 2013 to place publicly-funded retirement benefits on a more sustainable footing. The Single Scheme is the default public service pension scheme for all new entrant public servants since 1 January 2013.  While all public servants recruited after 2013 are enrolled in the Single Scheme, uniformed staff such as firefighters, members of An Garda Síochána and the Defence Forces, have certain enhanced benefits that other members of the Single Scheme do not have, in recognition of their earlier retirement age, such as additional early payment of scheme benefits. This enables them to accrue more Single Scheme benefits over the expected shorter public service careers in these roles. When uniformed staff reach their normal retirement age, they can retire at that earlier age and receive their occupational retirement benefits accrued at a higher rate, including their retirement lump-sum and the commencement of their pension benefit payments.  In the period between a uniformed member's retirement and the State pension age of 66, they receive benefits under the Single Scheme. These benefits are separate, and in addition, to any future entitlement that they may have to the State Pension (Contributory) administered by the Department of Social Protection.  A Supplementary Pension has never been a feature of the Single Scheme, nor was it ever envisaged that it would be. It is not intended that the Single Scheme would be amended to provide a Supplementary Pension to uniformed staff.  An increased mandatory retirement age of 62 for Gardaí was introduced by Government in September 2024 via the Garda Síochána (Retirement) Regulations 2024. This followed the commencement of the relevant Part 11 provisions of the Courts, Civil Law, Criminal Law and Superannuation (Miscellaneous Provisions) Act 2024. This legislative change facilitates an increase in the number of years over which Gardaí, and other Uniformed Accrual members, can accrue pension benefits, should they choose to do so. Individuals can continue to retire at age 55 or at any age up to 62 and avail of their lump sum and the commencement of their pension payment. This option is available to Uniformed Accrual members of the Single Scheme as well as those in pre-existing public service pension schemes. ",
        "to": {
          "uri": null,
          "showAs": "Public Expenditure",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 380. Deputy James Lawless asked the Minister for Public Expenditure, National Development Plan Delivery and Reform if he will examine the case of a person (details supplied); and if he will make a statement on the matter. [46859/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_374",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_374.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_374",
          "showAs": "An Garda Síochána"
        },
        "questionNumber": 380,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "showAs": "James Lawless"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_539",
        "answerText": " Minister for Education  The provision of school places to meet the needs of children and young people at primary and post-primary level, including children and young people with special educational needs is an absolute priority for the Department.  As the Deputy may be aware, in order to plan for school place needs, my Department divides the country into 314 school planning areas and utilises a Geographical Information System to anticipate school place demand. Information from a range of sources, including Child Benefit data, school enrolment data and information on residential development activity is used for this purpose. Additionally, Project Ireland 2040 population and housing targets inform my Department's projections of school place requirements.  It is important to note that where enrolment pressures arise, it may not always be as a result of lack of accommodation but may be driven by the following factors:  Duplication of applications;  School of choice;  Single sex schools; and  External draw.  Notwithstanding the above, in some areas demographic pressures and other factors are driving a requirement for additional school places.  Kill is located in the Naas School Planning area. Having considered the projected requirements in each school planning area, my Department then makes an assessment of the existing capacity and identifies any requirement for additional provision. Where demographic data indicates that additional provision is required, the delivery of such additional provision is dependent on the particular circumstances of each case and may, be provided through:  Utilising existing unused capacity within a school or schools;  Extending the capacity of a school or schools;  Provision of a new school or schools.  My Department's main responsibility is to ensure that schools in an area can, between them, cater for all pupils seeking school places in the area. In relation to school admissions, it is the responsibility of the managerial authorities of all schools to implement an enrolment policy in accordance with the Education Act, 1998.  Parents have the right to choose which school to apply to and where the school has places available the pupil should be admitted. However, in schools where there are more applicants than places available, a selection process will be necessary. This selection process and the enrolment policy on which it is based must be non-discriminatory and must be applied fairly in respect of all applicants. However, this may result in some pupils not obtaining a place in the school of their first choice.  All schools must clearly set out their selection criteria in their admission policies. Schools have discretion in relation to their admission criteria and how they are applied. The criteria to be applied by schools and the order of priority are a matter for the schools themselves. My Department does not seek to intervene in the selection criterion that is applied by schools.  Section 29 of the Education Act, 1998 provides for an appeal where a board of management, or a person acting on behalf of the board of management (normally the school principal) refuses to admit a student to a school. Where the decision to refuse admission is due to the school being oversubscribed, a review of the decision by the board of management must be sought in the first instance. Following a review it is open to the parent to appeal to the independent appeals committee.  As the Deputy may be aware, the Educational Welfare Services of the Child and Family Agency, Tusla, is the statutory agency that can assist parents who are experiencing difficulty in securing a school place for their child. The local service is delivered through the national network of Educational Welfare Officers. Contact details are available on Tusla’s website.  I want to assure the Deputy that my Department will continue to work to ensure a school place for every child throughout the Naas School Planning Area including Kill. ",
        "to": {
          "uri": null,
          "showAs": "Education",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 539. Deputy James Lawless asked the Minister for Education to examine the issue of school places in Kill, County Kildare for the next academic year (details supplied); and if she will make a statement on the matter. [46702/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_518",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_518.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_518",
          "showAs": "School Enrolments"
        },
        "questionNumber": 539,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "showAs": "James Lawless"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_577",
        "answerText": " Minister of State at the Department of Education  Under the Assistive Technology Scheme, as set out in my Department’s Circular 0010/2013, funding is provided to schools towards the cost of computers and specialist equipment, which are required for educational purposes.  All equipment provided under this scheme supports children with more complex disabilities who, in order to access the school curriculum, require essential specialist equipment. It must be clear that the existing I.T. equipment in the school is insufficient to meet the child's needs. Where necessary, schools may also purchase new or additional equipment or software for students from normal school resources or funds.  An application for assistive technology was submitted by the primary school in May 2024. Based on the professional information provided to the SENO and in line with criteria set out in Circular 10/2013, the SENO was not in a position to recommend an assistive technology grant for the school concerned on behalf of the student.  An appeal was subsequently submitted in June 2024. After examination by officials within my Department, it was determined that the application did not meet the terms of the scheme.  It is open to parents to contact SENOs directly to discuss their child’s special educational needs, using the contact details available at: ncse.ie/seno-contact-information. ",
        "to": {
          "uri": null,
          "showAs": "Education",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 577. Deputy James Lawless asked the Minister for Education for an update on the refusal of an assistant technology grant for a person (details supplied); and if she will make a statement on the matter. [1065/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_555",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_555.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_555",
          "showAs": "Special Educational Needs"
        },
        "questionNumber": 577,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "showAs": "James Lawless"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_720",
        "answerText": " Minister for Housing, Local Government and Heritage  The interest rate policy of the  Housing Finance Agency (HFA) is a matter for the management and board of that organisation. However, the HFA has advised my Department that the HFA approach to amending variable interest rates depends on the contractual arrangements with each individual customer.  The HFA advises that for some customers, the rate is linked to six-month Euribor and therefore the interest rate on those loans changes in line with the movements in Euribor, when the interest rate is set at the beginning of each six-month interest period.  They further advise that for all other HFA customers who have variable rate loans, the interest rate is determined by reference to the HFA’s cost of funds, which is the rate at which the HFA can borrow, at variable rates, under its Guaranteed Note Programme.  The HFA monitors its customers' variable interest rates on a quarterly basis against its variable rate cost of funds.  Any further information can be requested at the HFA's dedicated Oireachtas email address:  oireachtas.enquiries@hfa.ie ",
        "to": {
          "uri": null,
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 720. Deputy James Lawless asked the Minister for Housing, Local Government and Heritage to examine the case of the Housing Finance Agency interest rate adjustments (details supplied); and if he will make a statement on the matter. [46536/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_693",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_693.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_693",
          "showAs": "Interest Rates"
        },
        "questionNumber": 720,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "showAs": "James Lawless"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_842",
        "answerText": " Minister for Social Protection  Disability Allowance (DA) is a means-tested payment for people with a specified disability whose income falls below certain limits and who are aged between 16 and are under 66.  The Department periodically reviews claims in payment to ensure that there is continued entitlement to that payment. In this case the means of the person concerned were reviewed in line with DA eligibility. All other qualifying conditions for this person are deemed eligible.  Means are any income belonging to the person in receipt of DA and their spouse, civil partner, or cohabitant, a property (except their own home), or an asset that may provide them with income. Where there are multiple income sources or assets an assessment may be complex and may require clarifications to be sought to ensure an individual receives their exact entitlements.  When assessing the means of the person concerned for DA, a property was not assessed.  The person concerned provided the annual balancing statement from Standard Life. When assessing the means belonging to the person concerned the Transfer Value (the amount of the pension fund accessible to the customer adjusted for any early encashment) was used. This is the amount to be assessed in accordance with Rule 1(1) of Part 5 Schedule 3 of the Social Welfare Consolidation Act 2005 (as amended).  These funds reported and held within his Approved Retirement Fund (ARF) are fully assessable on a capital basis for DA means purposes. Approved Minimum Retirement Funds (AMRFs) and Approved Retirement Fund (ARF) pension funds are deemed similar to funds in a bank account in terms of accessibility. Therefore, the current value of the AMRF/ARF is treated as capital for means assessment purposes for DA means purposes.  As no new evidence relating to the assessment of the means of person concerned have been submitted it has been determined that the decision of 4th November 2024 remains unchanged.  The person concerned was notified on 9th November 2024 of this decision, the reason for it and his right of review and/or appeal.  I trust this clarifies the position for the Deputy. ",
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 842. Deputy James Lawless asked the Minister for Social Protection if the case of a person (details supplied) will be examined; and if she will make a statement on the matter. [46264/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_787",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_787.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_787",
          "showAs": "Social Welfare Eligibility"
        },
        "questionNumber": 842,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "showAs": "James Lawless"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_955",
        "answerText": " Minister for Justice  I propose to take Questions Nos. 955, 971 and 1065, inclusive, together.  At the outset, it is important to note that, as Minister, I do not comment on individual Immigrant Investor Programme (IIP) applications.  I can, however, inform the Deputy that my Department does not receive or hold funds at any stage in the IIP process; this is a private matter between a potential investor(s) and a potential project concerned.  The IIP Unit of my Department communicates with projects seeking to benefit from investments made in connection with an IIP application in relation to how the terms of the programme apply to their particular project. The Unit also engages with projects and monitors them for their compliance with the IIP requirements.  If the project owner has any queries they can contact the IIP Unit who will engage directly with them.  The question of alternative sources of funding for this project is not a matter for my Department. ",
        "to": {
          "uri": null,
          "showAs": "Justice",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 955. Deputy James Lawless asked the Minister for Justice the reason funding was refused for the child development centre in Kildare; whether this can be funded in another way; and if she will make a statement on the matter. [46489/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_887",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_887.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_887",
          "showAs": "Departmental Funding"
        },
        "questionNumber": 955,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "showAs": "James Lawless"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_1007",
        "answerText": " Minister for Justice  The visa application referred to by the Deputy was refused by the Visa Office in Dublin on 11 March 2024. The reasons for this decision were set out in the refusal letter sent to the applicant at that time. An appeal of this decision was launched on 10 May 2024.  Appeals for applications of this type are processed in the order in which they are received, to be fair to all applicants. While every effort is made to process these applications as soon as possible, processing times will vary having regard to the volume of appeals received, their complexity, the possible need for the visa office to seek further information in relation to certain appeals and the resources available to process them.  All visa applicants are advised that the onus is on them to provide as much information in support of their application as they feel is necessary. Guidelines in this regard are posted on the Immigration Service website. When making an appeal, the applicant should take into account the reasons for refusal listed in the refusal letter. The appeal should include any further information or additional documentation they wish to have considered, and should be sent for the attention of the Visa Appeals Officer, in the relevant Visa Office, where the matter will be considered afresh.  Full consideration will be given to any appeals received on behalf of the applicants, however the onus is on applicants to satisfy the Visa Officer that visas should be granted.  Processing times and decisions at the Overseas Visa Offices can be checked at the following link:   www.irishimmigration.ie/visa-decisions/#decisions   The person concerned can now directly check the status of their immigration application on the Immigration Service’s new Digital Contact Centre (DCC). They can register for, or log in to their existing account, at:  portal.irishimmigration.ie/en/  As an Oireachtas member, you can also request the status of individual immigration cases by e-mail, using the Oireachtas Mail facility at: IMoireachtasmail@justice.ie , which has been specifically established for this purpose. This service enables up to date information on such cases to be obtained without the need to seek information by way of the Parliamentary Question process. ",
        "to": {
          "uri": null,
          "showAs": "Justice",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 1007. Deputy James Lawless asked the Minister for Justice for an urgent update on the status of a visa application by a person (details supplied); and if she will make a statement on the matter. [1378/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_939",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_939.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_939",
          "showAs": "Visa Applications"
        },
        "questionNumber": 1007,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "showAs": "James Lawless"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_1137",
        "answerText": " Minister of State at the Department of Children, Equality, Disability, Integration and Youth  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "uri": null,
          "showAs": "Children",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 1137. Deputy James Lawless asked the Minister for Children, Equality, Disability, Integration and Youth to examine a matter regarding a delay in an assessment of needs assessment for a child (details supplied); what plans are in place to address this issue; and if he will make a statement on the matter. [46275/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_1068",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_1068.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_1068",
          "showAs": "Disabilities Assessments"
        },
        "questionNumber": 1137,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "showAs": "James Lawless"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_1142",
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  The Accommodation Recognition Payment is a tax-free monthly payment available to those providing accommodation to people who arrived in Ireland under the EU Temporary Protection Directive since March 2022. The scheme is provided for under Part 2 of the Civil Law (Miscellaneous Provisions) Act 2022 and is administered by the Department of Social Protection on behalf of my Department.  The scheme is currently due to end on 31 March 2025. However, it may be extended by Order in accordance with the governing legislation.  The future of the Accommodation Recognition Payment will be considered in the context of the continued whole of Government response to the war in Ukraine. ",
        "to": {
          "uri": null,
          "showAs": "Children",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 1142. Deputy James Lawless asked the Minister for Children, Equality, Disability, Integration and Youth for an update on the accommodation recognition payment scheme; and if he will make a statement on the matter. [46381/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_1074",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_1074.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_1074",
          "showAs": "International Protection"
        },
        "questionNumber": 1142,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "showAs": "James Lawless"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_1315",
        "answerText": " Minister for Health  In the public health sector, a temporary Special Scheme was put in place for 12 months in July 2022 to support eligible staff who were impacted by Long-Covid. At the request of the Department of Health, approval to extend the Special Scheme was granted by the Department of Public Expenditure, NDP and Reform (DPENDPR) a number of times, most recently at the end of June 2024 when it was extended for a further 12 months on the existing terms for the existing cohort of employees already being supported by it.  The Department of Public Expenditure, NDP and Reform (DPENDPR) have been very clear that this was the final extension that would be granted, and as such, the Special Scheme will conclude on 30th June 2025.  Any employee of the public health sector remaining unwell beyond that date, may utilise the full provisions of the Public Service Sick Leave Scheme which will provide further support.  Employees who did not qualify for the Special Scheme but are also impacted by Long-Covid may also utilise the supports of the sick leave scheme.  The sick leave scheme provides full pay for three months, followed by half pay for three months, and after that, Temporary Rehabilitative Remuneration may be applied for, which, if granted, provides up to a further 547 days of paid leave. The Critical Illness Protocol that forms part of the sick leave scheme may also provide additional supports if granted.  The eligibility criteria set when the Special Scheme was first introduced were designed to ensure that employees supported by the Special Scheme included those working in a COVID exposed environment in the period before PPE and vaccinations were readily available, and before community transmission became more prevalent.  It was not possible, nor would it have been appropriate to provide access to the Special Scheme to all employees of the public health service who contracted COVID, as the contraction of COVID is a public health issue, and not an occupational issue, and as it is not possible to separate with absolute certainty, those who contracted COVID in the workplace from those who contracted COVID generally.  Further to this, my colleague, the Minister for Social Protection has reviewed the EU recommendation in respect of the recognition of Covid (not long Covid) as an occupational illness, however she has determined that Covid does not meet the criteria required for recognition in respect of the Social Welfare Acts. ",
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 1315. Deputy James Lawless asked the Minister for Health to examine a matter (details supplied); and if he will make a statement on the matter. [46272/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_1235",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_1235.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_1235",
          "showAs": "Health Services Staff"
        },
        "questionNumber": 1315,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "showAs": "James Lawless"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_1726",
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  In October 2022, an independent and comprehensive National Review of State Supports for PhD Researchers was announced; the first time that this issue has been considered holistically in this manner.  The first report of the Co-Chairs, Dr Andrea Johnson and Mr David Cagney, was published in summer 2023.  In it they recommended an increase towards an optimum PhD stipend level of €25,000, subject to funding availability.  In Budget 2024, funding was secured to increase the PhD stipend offered by this Department's competitive research funding agency (now Research Ireland), from €19,000 to €22,000 annually. Furthermore, as part of Budget 2025, I announced an additional €9 million package to raise PhD stipends from €22,000 to €25,000 per annum.? This was part of a major capital and funding package for tertiary education to reduce the cost of education and tackle cost-of-living pressures.? This builds on the previous increases, demonstrating my Department's clear and consistent commitment to this issue.  Regarding the timeline for this increase, Research Ireland has confirmed to all higher education institutions that funds are available to uplift students to €25,000 per annum. Research Ireland has directly engaged with the finance offices in the institutions, who will be commencing payment to PhD students at the €25,000 level from January this year. ",
        "to": {
          "uri": null,
          "showAs": "Further and Higher Education",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 1726. Deputy James Lawless asked the Minister for Further and Higher Education, Research, Innovation and Science to detail the recent and scheduled payment rise for PhD students (details supplied); and if he will make a statement on the matter. [1568/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_1634",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_1634.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_1634",
          "showAs": "Grant Payments"
        },
        "questionNumber": 1726,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2024-11-07",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-07/writtens/mul@/dbsect_249.xml"
            }
          },
          "debateSectionId": "dbsect_249",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-07/writtens/dbsect_249",
          "showAs": "Pension Provisions"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-07/pq_250",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 250,
        "showAs": " 250. Deputy James Lawless asked the Minister for Social Protection the reason a disability pension has been stopped for a person (details supplied); and if she will make a statement on the matter. [45529/24] ",
        "answerText": " Minister for Social Protection (Deputy Heather Humphreys)  Disability Allowance (DA) is a means-tested payment for people with a specified disability whose income falls below certain limits and who are aged between 16 and are under 66.  This disability must be expected to last for at least one year and the allowance is subject to medical assessment, means test and habitual residency conditions.  The Department periodically reviews claims in payment to ensure that there is continued entitlement.  In this case the means of the person concerned were reviewed.  Income from a compensation claim was not considered when determining the means of the person concerned for this DA assessment.  However, Approved Minimum Retirement Funds (AMRFs) and Approved Retirement Fund (ARF) pension funds are similar to funds in a bank account in terms of accessibility.  Therefore, the current value of the AMRF/ARF is treated as capital for means assessment purposes.  The annual balancing statement shows the amount of the pension fund accessible to the customer.  This is the current value of the AMRF/ARF, adjusted for any early encashment.  This is the amount to be assessed in accordance with Rule 1(1) of Part 5 Schedule 3 of the Social Welfare Consolidation Act 2005 (as amended).  The evidence relied upon by the deciding officer included a statement from Standard Life with policy Value and a Transfer Value.  Upon review it was determined that rather than using the current policy value of the ARF, the overall transfer value of the ARF belonging to the person concerned (which is the lower of the two) was used.  Following a means review, it was determined that although the means of the person concerned have reduced, they are still over the statutory limit for DA.  The person concerned was notified on 4th November 2024 of this decision, the reason for it and his right of review and/or appeal.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-11-07",
        "by": {
          "showAs": "James Lawless",
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 150,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_150",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_147",
          "showAs": "Defence Forces",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_147",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_147.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Defence",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Defence (Deputy Micheál Martin)  As a critical component of the measures taken to ensure the security of Óglaigh na hÉireann, security vetting, for both Permanent Defence Forces (PDF) and Reserve Defence Forces (RDF) applicants, is conducted to ensure the suitability of candidates to occupy the role for which they have applied. This vetting is conducted with the assistance of An Garda Síochána (AGS).  The duration of the process can depend upon many factors, including the volume of applicants and the information provided by the candidate during the application process. In addition, should applicants provide information with an associated external/non-national component, this necessitates engagement with international vetting authorities. This process and the timelines associated with it, is completely outside the capacity and authority of Defence Forces control, and can invariably result in significant delays. Once security clearance has been confirmed however, applications proceed without delay to attestation stage.  It should be noted that for the RDF, regardless of clearance status, all applicants engaged in the induction process are included in Phase 1 training which has been specifically introduced in an effort to provide meaningful activity for prospective inductees at the earliest possible juncture, and to reduce the training time to be observed once the applicant is inducted. ",
        "showAs": " 150. Deputy James Lawless asked the Tánaiste and Minister for Defence to examine a matter (details supplied); and if he will make a statement on the matter. [44144/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "James Lawless",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "memberCode": "James-Lawless.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 303,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_303",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_294",
          "showAs": "Public Sector Pay",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_294",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_294.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Public Expenditure",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Public Expenditure, National Development Plan Delivery and Reform  The issue outlined in your correspondence regarding when the arrears/rises to the occupational supplementary pension (OSP) will be paid to post 1995 Garda pensioners, is an operational matter for the Garda Pension Section. However, I can confirm that we are in discussions with the Garda Pensions Section in order to provide clarification on the OSP increase policy, in order to ensure that the correct increases are applied. ",
        "showAs": " 303. Deputy James Lawless asked the Minister for Public Expenditure, National Development Plan Delivery and Reform to examine a pay query (details supplied); and if he will make a statement on the matter. [44138/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "James Lawless",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "memberCode": "James-Lawless.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 305,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_305",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_295",
          "showAs": "Flood Relief Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_295",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_295.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Public Expenditure",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister of State at the Department of Public Expenditure, National Development Plan Delivery and Reform  I propose to take Questions Nos. 305 and 306 together.  The Government has committed €1.3 billion to the delivery of flood relief schemes over the lifetime of the National Development Plan 2021 – 2030 to protect approximately 23,000 properties in communities that are under threat from river and coastal flood risk. Since 2018, as part of a phased approach to scheme delivery, this funding has allowed the OPW, in partnership with local authorities throughout the country, to treble the number of schemes at design, planning and construction to some 100 schemes at this time.  Nationally, 55 schemes have been completed to date which are providing protection to over 13,000 properties and an economic benefit to the State in damages and losses avoided estimated to be in the region of €2 billion. Consequently, work to protect 80% of all at-risk properties nationally is completed or underway.  The OPW has completed four major flood relief schemes in County Kildare: the Lower Morrell (Turnings), Morrell Johnstown, Rye Water (Leixlip) and Shinkeen Stream (Hazelhatch) flood relief schemes. The Shinkeen Stream (Hazelhatch) Scheme is comprised of channel widening and deepening along the Shinkeen Stream and provides protection against a 100-Year fluvial flood (1% Annual Exceedance Probability) for 26 properties.  The scheme is maintained by the OPW.  Currently, there are three major flood relief schemes underway in County Kildare. Two projects, at Athy and Naas, are at Stage I: Scheme Development and Preliminary Design.  The Morell River Flood Management Scheme is also underway and is at Stage IV: Implementation / Construction.  The scheme includes embankments and flood defence walls along the Morell and Painstown Rivers. The catchment study area begins south of Straffan, includes Killeenmore, and extends to the North of Sallins.  Construction began on 1st September 2020, with works being undertaken by the OPW East Region Construction team. Some 74.5% of the construction works are now complete, and completed works are in the process of being handed back to Kildare County Council.  The Scheme is programmed for completion in Q4 2025.  There is also a further Small Project at commencement stage at Leixlip, which is being progressed by Kildare County Council with funding being provided by the OPW.  Once completed, these four projects will provide protection to a further 677 properties, with an economic benefit to the State in damage and losses avoided estimated to be in the region of €74m.  The Flood Risk Management Plans included the recommendation to undertake a review of potential schemes to confirm in greater detail the likely viability of a scheme for each community. The OPW is progressing a scheme viability review for Celbridge and will liaise with Kildare County Council in relation to the outcome.  Local flooding issues are a matter, in the first instance, for each Local Authority to investigate and address, and Kildare County Council may carry out flood mitigation works using its own resources.  Kildare County Council may also apply to the OPW for funding of flood mitigation works under the Minor Flood Mitigation Works and Coastal Protection Scheme.  The purpose of this scheme is to provide funding to Local Authorities to undertake minor flood mitigation works or studies to address localised flooding and coastal protection problems within their administrative areas.  The scheme generally applies to relatively straightforward cases where a solution can be readily identified and achieved in a short time frame.  Under the scheme, applications are considered for projects that are estimated to cost not more than €750,000 in each instance.  Funding of up to 90% of the cost is available for approved projects, with the balance being funded by the Local Authority concerned.  Any application received will be considered in accordance with the scheme eligibility criteria, which comprise economic, social and environmental criteria, including a requirement that any measures are cost beneficial, and having regard to the overall availability of resources for flood risk management.  Since 2009, the OPW has approved funding under the Minor Flood Mitigation Works and Coastal Protection Scheme of €1.78 million to County Kildare for some 7 projects. This includes a Minor Works project in respect of which the OPW provided funding of €500,000 to Kildare County Council to undertake relevant works in Sallins. ",
        "showAs": " 305. Deputy James Lawless asked the Minister for Public Expenditure, National Development Plan Delivery and Reform for an update from the Office of Public Works on a flood relief scheme (details supplied); and if he will make a statement on the matter. [44193/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "James Lawless",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "memberCode": "James-Lawless.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 306,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_306",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_295",
          "showAs": "Flood Relief Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_295",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_295.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Public Expenditure",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister of State at the Department of Public Expenditure, National Development Plan Delivery and Reform  I propose to take Questions Nos. 305 and 306 together.  The Government has committed €1.3 billion to the delivery of flood relief schemes over the lifetime of the National Development Plan 2021 – 2030 to protect approximately 23,000 properties in communities that are under threat from river and coastal flood risk. Since 2018, as part of a phased approach to scheme delivery, this funding has allowed the OPW, in partnership with local authorities throughout the country, to treble the number of schemes at design, planning and construction to some 100 schemes at this time.  Nationally, 55 schemes have been completed to date which are providing protection to over 13,000 properties and an economic benefit to the State in damages and losses avoided estimated to be in the region of €2 billion. Consequently, work to protect 80% of all at-risk properties nationally is completed or underway.  The OPW has completed four major flood relief schemes in County Kildare: the Lower Morrell (Turnings), Morrell Johnstown, Rye Water (Leixlip) and Shinkeen Stream (Hazelhatch) flood relief schemes. The Shinkeen Stream (Hazelhatch) Scheme is comprised of channel widening and deepening along the Shinkeen Stream and provides protection against a 100-Year fluvial flood (1% Annual Exceedance Probability) for 26 properties.  The scheme is maintained by the OPW.  Currently, there are three major flood relief schemes underway in County Kildare. Two projects, at Athy and Naas, are at Stage I: Scheme Development and Preliminary Design.  The Morell River Flood Management Scheme is also underway and is at Stage IV: Implementation / Construction.  The scheme includes embankments and flood defence walls along the Morell and Painstown Rivers. The catchment study area begins south of Straffan, includes Killeenmore, and extends to the North of Sallins.  Construction began on 1st September 2020, with works being undertaken by the OPW East Region Construction team. Some 74.5% of the construction works are now complete, and completed works are in the process of being handed back to Kildare County Council.  The Scheme is programmed for completion in Q4 2025.  There is also a further Small Project at commencement stage at Leixlip, which is being progressed by Kildare County Council with funding being provided by the OPW.  Once completed, these four projects will provide protection to a further 677 properties, with an economic benefit to the State in damage and losses avoided estimated to be in the region of €74m.  The Flood Risk Management Plans included the recommendation to undertake a review of potential schemes to confirm in greater detail the likely viability of a scheme for each community. The OPW is progressing a scheme viability review for Celbridge and will liaise with Kildare County Council in relation to the outcome.  Local flooding issues are a matter, in the first instance, for each Local Authority to investigate and address, and Kildare County Council may carry out flood mitigation works using its own resources.  Kildare County Council may also apply to the OPW for funding of flood mitigation works under the Minor Flood Mitigation Works and Coastal Protection Scheme.  The purpose of this scheme is to provide funding to Local Authorities to undertake minor flood mitigation works or studies to address localised flooding and coastal protection problems within their administrative areas.  The scheme generally applies to relatively straightforward cases where a solution can be readily identified and achieved in a short time frame.  Under the scheme, applications are considered for projects that are estimated to cost not more than €750,000 in each instance.  Funding of up to 90% of the cost is available for approved projects, with the balance being funded by the Local Authority concerned.  Any application received will be considered in accordance with the scheme eligibility criteria, which comprise economic, social and environmental criteria, including a requirement that any measures are cost beneficial, and having regard to the overall availability of resources for flood risk management.  Since 2009, the OPW has approved funding under the Minor Flood Mitigation Works and Coastal Protection Scheme of €1.78 million to County Kildare for some 7 projects. This includes a Minor Works project in respect of which the OPW provided funding of €500,000 to Kildare County Council to undertake relevant works in Sallins. ",
        "showAs": " 306. Deputy James Lawless asked the Minister for Public Expenditure, National Development Plan Delivery and Reform for an update from the Office of Public Works on a flood relief scheme (details supplied); and if he will make a statement on the matter. [44194/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "James Lawless",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "memberCode": "James-Lawless.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 372,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_372",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_356",
          "showAs": "Special Educational Needs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_356",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_356.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister of State at the Department of Education  Enabling children with special educational needs to receive an education is a priority for this government. It is also a key priority for my department and for the National Council for Special Education (NCSE).  The vast majority of children with special educational needs are supported to attend mainstream classes with their peers. Where children with more complex needs require additional supports, special classes and special school places are provided.  Classes are established under a particular designation of student need, e.g., Mild/Moderate/Severe to Profound Learning Disability or for particular conditions e.g. Autism or Deaf/Hard or Hearing. Enrolment into these classes is closely linked to its designation. This ensures that these classes continue to meet the needs of the students for which they were intended. For this reason a diagnosis and/or professional report is required in order for students to be enrolled.  The NCSE has the responsibility for planning and coordinating school supports for children with special educational needs. They have advised my department that the local special educational needs organiser (SENO) has had some correspondence from the parent and they have provided them with information in relation to eligibility for enrolment in a special class.  Where there is no class and there is known demand in a local area the NCSE will work with local schools to sanction a class. The NCSE actively encourages expressions of interest from schools to open special classes, and the efforts taken by boards of management in expressing an interest is to be commended. Any school who wishes to do so should contact the NCSE locally.  It is important to note that a continuum of support is provided in our education system. The allocation of special education teachers allows schools to provide additional teaching support for all students who require such support in their schools and for schools to deploy resources based on each student’s individual learning needs.  In addition, special needs assistants (SNAs) play a central role in the successful inclusion of students with additional and significant care needs into mainstream education, special classes and special schools ensuring that these students can access an education to enable them to achieve their best outcomes and reach their full potential.  The NCSE provides support for teachers with additional training needs in the area of special education, through the NCSE support service which manages, co-ordinates and develops a range of supports in response to identified teacher training needs.  This support service provides Teacher Professional Learning (TPL) to teachers of students with a variety of special educational needs. The NCSE continues to update current TPL courses for teachers and design new TPL courses in response to the needs of teachers.  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential.  I will ask the NCSE to keep in contact with the parent here and to keep my Department updated in relations to developments on this matter. ",
        "showAs": " 372. Deputy James Lawless asked the Minister for Education if the matters raised (details below) can be examined; and if she will make a statement on the matter. [44057/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "James Lawless",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "memberCode": "James-Lawless.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 556,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_556",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_525",
          "showAs": "Housing Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_525",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_525.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Housing, Local Government and Heritage  I refer to the reply to Question No. 430 of 22 October 2024, which sets out the position in this matter. ",
        "showAs": " 556. Deputy James Lawless asked the Minister for Housing, Local Government and Heritage to examine a matter (details supplied); and if he will make a statement on the matter. [44220/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "James Lawless",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "memberCode": "James-Lawless.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 1042,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_1042",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_991",
          "showAs": "Insurance Industry",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_991",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_991.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  Ireland has a voluntary community rated private health insurance market. One of its key principles is minimum benefit, whereby insurers are required, under the Health Insurance Act 1994 (Minimum Benefit) Regulations 1996, to offer a minimum level of cover in every insurance policy. This approach ensures that all consumers obtain an appropriate minimum level of health insurance cover, regardless of what plan they purchase.  Health insurance companies are free to impose certain terms and conditions in their policies, provided that they comply with these Regulations. Beyond this, I have no role to play in the commercial decisions of any health insurer and so am not in a position to direct any insurer to provide cover for any procedure, service or treatment, or how that cover is to be provided. I am not currently considering plans to make changes to the Regulations.  In general, an insurer may refuse to cover any care or treatment if it does not deem it to be medically necessary. If a claim is declined by an insurer, the insured person should initially avail of the insurer’s complaints process and if they are not satisfied with the outcome, they can take a case to the Financial Services Pensions Ombudsman (FSPO).  The issue raised by Deputy Lawless has been examined by my Department and a written reply has also been provided to correspondence I received from the individual concerned. ",
        "showAs": " 1042. Deputy James Lawless asked the Minister for Health to examine an issue (details supplied); and if he will make a statement on the matter. [44060/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "James Lawless",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "memberCode": "James-Lawless.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-10-24",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-24/writtens/mul@/dbsect_330.xml"
            }
          },
          "debateSectionId": "dbsect_330",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-24/writtens/dbsect_330",
          "showAs": "Hospital Waiting Lists"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-24/pq_320",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 320,
        "showAs": " 320. Deputy James Lawless asked the Minister for Health to examine an issue where a person has been waiting for a hip replacement surgery for an extended period of time (details supplied); and if he will make a statement on the matter. [43609/24] ",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-10-24",
        "by": {
          "showAs": "James Lawless",
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-10-24",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-24/writtens/mul@/dbsect_333.xml"
            }
          },
          "debateSectionId": "dbsect_333",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-24/writtens/dbsect_333",
          "showAs": "General Practitioner Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-24/pq_323",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 323,
        "showAs": " 323. Deputy James Lawless asked the Minister for Health to examine a major lack in GPs in the Naas area (details supplied); and if he will make a statement on the matter. [43618/24] ",
        "answerText": " Minister for Health  GPs are self-employed practitioners and therefore may establish practices at a place of their own choosing. There is no prescribed ratio of GPs to patients and the State does not regulate the number of GPs that can set up in a town or community.  Under the GMS scheme, the HSE contracts GPs to provide medical services without charge to medical card and GP visit card holders. Currently there are 2,544 GPs contracted to provide services under the GMS Scheme. Where a vacancy arises in a practice with a GMS contract, the HSE becomes actively involved in the recruitment process to find a replacement GP. As of the start of the October, there are no GMS vacancies in the Naas area.  Where a person who holds a medical card or GP visit card, experiences difficulty in finding a GP to accept them as a patient, that person having unsuccessfully applied to at least three GPs in the area (or fewer if there are fewer GPs there) can apply to the HSE National Medical Card Unit which has the power to assign a GMS patient to a GP's GMS patient list in accordance with the GMS contract. People who do not hold a medical card or GP visit card access GP services on a private basis and can make enquiries directly to any GP practice they wish to register with.  The Government is actively working to increase the number of GPs practising in the State and thereby improve access to GP services for all patients across the country.  Under the 2019 GP Agreement additional annual expenditure provided for general practice was increased by €211.6m. This provided for significant increases in capitation fees for participating GMS GPs, and new fees for additional services and increased practice supports. The GP Agreement 2023 further increased GP capitation fees, increased the existing subsidy rates for practice staff, and introduced a grant support for additional staff capacity as well a practice staff maternity leave support. These measures make general practice in Ireland a more attractive career choice for doctors.  Annual intake to the GP training scheme has been increased by approximately 80% over the last 5 years. 347 new entrants commenced training this year, a 21% increase on last year’s intake of 286. Furthermore, the recruitment of GPs from abroad is ongoing under the International Medical Graduate (IMG) Rural GP Programme. 75 IMG GPs commenced in practice under the programme in 2023; recruitment is continuing this year and funding has been provided to recruit up to 250 more GPs from outside Ireland to the country next year.  Lastly, a Strategic Review of General Practice is underway. The review, with input from key stakeholders, is examining the broad range of issues affecting general practice including issues related to GP capacity. When completed, the review will set out the measures necessary to deliver a more sustainable general practice into the future. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-10-24",
        "by": {
          "showAs": "James Lawless",
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 673,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_673",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_623",
          "showAs": "Medical Cards",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_623",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_623.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  Eligibility for a Medical Card is primarily based on a financial assessment which is conducted by the HSE in accordance with the Health Act 1970 (as amended). The HSE assesses each medical card application on a qualifying financial threshold. This is the amount of money that an individual can earn a week and still qualify for a card. It is specific to the individual’s own financial circumstances.  Persons under 70 are assessed under the general means tested medical card thresholds which are based on an applicant’s household income after tax and the deduction of PRSI and the Universal Social Charge. Certain expenses are also taken into account. Examples of allowable expenses include rent, mortgage, certain insurance costs, childcare, maintenance, nursing home net costs which help to increase the amount a person can earn and still qualify for a medical card. Detailed guidelines are available at: Assessment for a medical card - HSE.ie.  Persons aged 70 or older are assessed under medical card income thresholds which are based on gross income. The weekly gross medical card income thresholds for people aged 70 and over are currently €550 per week for a single person and €1050 for a couple. Furthermore, the Deputy may be aware that, since 2015, every individual aged 70 and over has automatic eligibility for a GP visit card. However, it should be noted that those aged over 70 can also be assessed under the general means tested scheme where there are particularly high costs, e.g., medication, nursing home fees. .  Every effort is made by the HSE, within the framework of the legislation, to support applicants in applying for a medical card - in particular, to take full account of difficult circumstances in the case of applicants who may be in excess of the income guidelines. In such circumstances, the HSE may exercise discretion and grant a medical card, for example:  • Discretionary medical cards issued to patients with significant medical expenses but who do not satisfy the means test.  • Emergency medical cards are issued to patients that are terminally ill, or are seriously ill, and in urgent need of medical care that they cannot afford.  • Medical cards issued to patients who are terminally ill with a prognosis of 24 months or less do not require subsequent means assessment and are not reviewed.  It should also be noted that where a person's sole income is derived from a social protection payment, even where this is more than the current means threshold, he/she will be awarded a medical card.  I can assure the Deputy that my Department keeps medical card issues under review in order to ensure the medical card system is responsive and sensitive to people's needs. Over the course of 2024 and 2025, we will review the existing eligibility framework to clearly assess what is working well and to inform policy proposals to enhance eligibility and access to services based on robust evidence. This is an important step towards delivering on universal healthcare in Ireland. ",
        "showAs": " 673. Deputy James Lawless asked the Minister for Health to examine the case of over 70’s medical card holders (details supplied); and if he will make a statement on the matter. [42975/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "James Lawless",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "memberCode": "James-Lawless.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 676,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_676",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_627",
          "showAs": "General Practitioner Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_627",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_627.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "showAs": " 676. Deputy James Lawless asked the Minister for Health to examine the fact there will no longer be a doctor available in Prosperous, County Kildare, following the retirement of the previous doctor; whether there are plans in place to address this issue; and if he will make a statement on the matter. [42408/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "James Lawless",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "memberCode": "James-Lawless.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 784,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_784",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_736",
          "showAs": "Dental Services ",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_736",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_736.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly. ",
        "showAs": " 784. Deputy James Lawless asked the Minister for Health the number of dentists currently operating in County Kildare (details supplied); and if he will make a statement on the matter. [43002/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "James Lawless",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "memberCode": "James-Lawless.D.2016-10-03"
        }
      }
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03",
          "showAs": "James Lawless"
        },
        "questionNumber": 361,
        "showAs": " 361. Deputy James Lawless asked the Minister for Housing, Local Government and Heritage if the local development levy waiver on new houses has been extended beyond December 2024. [41238/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_361",
        "debateSection": {
          "debateSectionId": "dbsect_321",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_321",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_321.xml"
            },
            "pdf": null
          },
          "showAs": "Development Contributions"
        },
        "answerText": " Minister for Housing, Local Government and Heritage  On 25 April 2023, the Government approved additional measures under the Housing for All Action Plan to incentivise the activation of increased housing supply and help reduce housing construction costs, including the introduction of temporary time-limited arrangements for the waiving of local authority “section 48” development contributions and the refunding of Uisce Éireann water and waste water connection charges.  The schemes originally applied for one year to all permitted residential development that commenced on site between 25 April 2023 (the date of the Government Decision approving the measure) and 24 April 2024, and that are completed not later than 31 December 2025. On 23 April 2024, the Government approved an extension for the waiving of local authority “section 48” development contributions in respect of residential development commenced not later than 31 December 2024 and the refunding of Uisce Éireann water and waste water connection charges in respect of residential development commenced not later than 30 September 2024.  The date for the completion of development works on qualifying houses under the schemes has been extended from 31 December 2025 to 31 December 2026.  It is not proposed to extend the terms or timeline of the scheme beyond those as approved by the Government in its Decision of 23 April 2024. ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "contextDate": "2024-10-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-09/writtens/mul@/dbsect_162.xml"
            }
          },
          "debateSectionId": "dbsect_162",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-09/writtens/dbsect_162",
          "showAs": "Social Welfare Eligibility"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-09/pq_134",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 134,
        "showAs": " 134. Deputy James Lawless asked the Minister for Social Protection to examine a matter regarding means tests for carers (details supplied); and if she will make a statement on the matter. [40477/24] ",
        "answerText": " Minister for Social Protection  The main income supports to carers provided by my department are Carer’s Allowance, Carer’s Benefit, Domiciliary Care Allowance and the Carer’s Support Grant. Spending on these payments is expected to amount to over €1.7 billion this year.  The Carer’s Allowance is the main scheme by which the Department provides income support to carers in the community. In 2024, expenditure on the Carer’s Allowance scheme is estimated to be over €1.1 billion.Eligibility for Carer’s Allowance involves satisfying a means test. Means assessments take both household income and capital (such as savings, investments and property other than the family home) into consideration. For social assistance schemes, income and capital belonging to the claimant and his or her partner, where applicable, is generally assessable for means purposes. Means tests are an essential component of our social welfare system - they help to direct scarce resources to where they are needed most.  Abolition of the means test for Carer's Allowance as proposed would give rise to additional costs of at least €600m per year based on current claim numbers. Taking account of estimates of inflows, this could increase to €2bn a year. At this level, the removal of the means test would have a significant impact on the funding available for other schemes and services. It is also worth noting that abolition of the means test would be of no benefit to those carers who rely solely on the payment and have no additional income. Nevertheless, taking account of the important role of Carers in our society, I have, since my appointment as Minister, made a number of significant improvements to the means test for Carer's Allowance.  • Budget 2022 saw the first changes to the means test in 14 years when the income disregards were increased from €332.50 to €350 for a single person, and from €665 to €750 for carers with a spouse/partner. The capital and savings disregard for the Carer’s Allowance means assessment was also increased from €20,000 to €50,000. It is important to note that this equates to €100,000 in the case of a couple.  • As part of Budget 2024, the weekly income disregards were further increased from €350 to €450 for a single person, and from €750 to €900 for carers with a spouse/partner.  As part of Budget 2025, I further increased the income disregards to €625 for a single person and to €1,250 for carers with a spouse/partner.Since June 2022, this amounts to cumulative increases to the disregards of €292.50 for a single carer and €585.00 for a carer who is part of couple.  These recent changes to the means test will enable more carers on a reduced rate to move to a higher payment. Additionally, many carers who previously did not qualify for a payment due to their means will be brought into the Carer's Allowance system for the first time.  I have also established an Interdepartmental Working Group with the Department of Health and the Department of Children, Equality, Disability, Integration and Youth to examine and review the system of means testing for carer payments. This work is ongoing, and I expect the Group is due to report back to me later this year.  It is also important to acknowledge that there are a range of other supports for carers provided by my department which are not based on a means assessment.  The Carer’s Support Grant is a payment for all carers, even those not in receipt of Carer’s Allowance. It can be claimed by carers regardless of their means or social insurance contributions. It is paid in respect of each care recipient. I increased this grant as part of Budget 2021 to €1,850 and announced a further increase in Budget 2025 of €150 bringing it to €2,000, its highest ever rate. Over 132,000 carers received the grant on Thursday 6 June at a cost of €275 million.  Carer's Benefit is based on social insurance contributions and does not require a means test. It is payable for a period of up to 2 years for each care recipient and is estimated to cost almost €58 million in 2024. In Budget 2025, I have extended eligibility for this payment to the self-employed for the first time.  Domiciliary Care Allowance is payable to a parent or guardian in respect of a child who has a severe disability and requires continual or continuous care and attention substantially over and above the care and attention usually required by a child of the same age. Domiciliary Care Allowance does not require a means test. As part of Budget 2025, I’ve increased this payment by a further €20 bringing it to €360 per month. This monthly payment has increased cumulatively by €50.50 under this Government. Expenditure in 2024 is estimated to be almost €274 million.  I can assure the Deputy that I am very aware of the key role that family carers play in Irish society and the challenges they face, and I will continue to keep the range of income supports provided to family carers by my department under review.  However, any further changes or improvements to the carer payments provided by my department, including the Carer’s Allowance payment, would need to be considered in an overall budgetary and policy context. I trust that this clarifies the issue for the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-10-09",
        "by": {
          "showAs": "James Lawless",
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-10-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-08/writtens/mul@/dbsect_244.xml"
            }
          },
          "debateSectionId": "dbsect_244",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-08/writtens/dbsect_244",
          "showAs": "Special Educational Needs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-08/pq_219",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 219,
        "showAs": " 219. Deputy James Lawless asked the Minister for Education to examine a matter regarding extra time in second-level examinations for students with dyslexia, dyscalculia and other learning difficulties (details supplied); and if she will make a statement on the matter. [40325/24] ",
        "answerText": " Minister for Education  The State Examinations Commission has statutory responsibility for operational matters relating to the state examinations.  In view of this I have forwarded your query to the State Examinations Commission for direct reply to you. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-10-08",
        "by": {
          "showAs": "James Lawless",
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-10-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-08/writtens/mul@/dbsect_491.xml"
            }
          },
          "debateSectionId": "dbsect_491",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-08/writtens/dbsect_491",
          "showAs": "Health Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-08/pq_486",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 486,
        "showAs": " 486. Deputy James Lawless asked the Minister for Health to examine a matter regarding funding for an occupational therapy vocational rehabilitation service (details supplied).  [39903/24] ",
        "answerText": " Minister for Health (Deputy Stephen Donnelly)  I propose to take Questions Nos. 486, 593 and 603 together.  The Sláintecare Integration Innovation Fund (SIIF), a ring-fenced multi-annual fund supporting projects with a focus on delivering the Right Care, in the Right Place, at the Right Time by the Right Team, is fostering a culture of innovation to support the delivery of health service reform. Its aim is to test and evaluate projects that serve as a ‘proof of concept’ with a view to mainstreaming and scaling successful projects.  Since 2019, SIIF has funded and tested over 130 projects that serve as a “proof of concept”, for innovative and integrated models of care, which led to the mainstreaming & scaling of successful projects.  The “Work-Able Solutions” project is one of a number of SIIF projects currently being evaluated. Once that evaluation is complete, the decision on the future of the project will be communicated to the Project. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-10-08",
        "by": {
          "showAs": "James Lawless",
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-10-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-08/writtens/mul@/dbsect_563.xml"
            }
          },
          "debateSectionId": "dbsect_563",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-08/writtens/dbsect_563",
          "showAs": "Health Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-08/pq_559",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 559,
        "showAs": " 559. Deputy James Lawless asked the Minister for Health the measures his Department is undertaking to assist individuals with long Covid, particularly financially (details supplied); and if he will make a statement on the matter. [39887/24] ",
        "answerText": " Minister for Health  In the public health sector, a temporary Special Scheme was put in place for 12 months in July 2022 to support eligible staff who were impacted by Long-Covid. At the request of my Department, approval to extend the Special Scheme was granted by the Department of Public Expenditure, NDP and Reform (DPENDPR) a number of times, most recently at the end of June when it was extended for a further 12 months on the existing terms for the existing cohort of employees already being supported by it. The Department of Public Expenditure, NDP and Reform (DPENDPR) have been very clear that this was the final extension that would be granted, and as such, the Special Scheme will conclude on 30th June 2025. Any employee of the public health sector remaining unwell beyond that date, may utilise the full provisions of the Public Service Sick Leave Scheme which will provide further support. Employees who did not qualify for the Special Scheme but are also impacted by Long-Covid may also utilise the supports of the sick leave scheme.The sick leave scheme provides full pay for three months, followed by half pay for three months, and after that, Temporary Rehabilitative Remuneration may be applied for, which, if granted, provides up to a further 547 days of paid leave. The Critical Illness Protocol that forms part of the sick leave scheme may also provide additional supports if granted.The eligibility criteria set when the Special Scheme was first introduced were designed to ensure that employees supported by the Special Scheme included those working in a COVID exposed environment in the period before PPE and vaccinations were readily available, and before community transmission became more prevalent.It was not possible, nor would it have been appropriate to provide access to the Special Scheme to all employees of the public health service who contracted COVID, as the contraction of COVID is a public health issue, and not an occupational issue.  It is also not possible to separate with absolute certainty, those who contracted COVID in the workplace from those who contracted COVID generally, and as such, while the above referenced supports are available to employees, there is no provision to cover the costs of any health expenses arising.Further to this, my colleague, the Minister for Social Protection has reviewed the EU recommendation in respect of the recognition of Covid (not long Covid) as an occupational illness, however she has determined that Covid does not meet the criteria required for recognition in respect of the Social Welfare Acts. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-10-08",
        "by": {
          "showAs": "James Lawless",
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-10-02",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-02/writtens/mul@/dbsect_71.xml"
            }
          },
          "debateSectionId": "dbsect_71",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-02/writtens/dbsect_71",
          "showAs": "Passport Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-02/pq_60",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 60,
        "showAs": " 60. Deputy James Lawless asked the Tánaiste and Minister for Foreign Affairs to examine the request for a passport (details supplied); and if he will make a statement on the matter. [39346/24] ",
        "answerText": " Tánaiste and Minister for Foreign Affairs  All passport applications are subject to the provisions of the Passports Act, 2008 (the Act). The Act provides that a person must, among other things, be an Irish citizen before a passport can be issued to him or her. Entitlement to Irish citizenship is, in turn, subject to the terms of the Irish Nationality and Citizenship Act, 1956, as amended.  Prior to 29 November 2005, spouses of Irish citizens had the option of completing a post-nuptial declaration in order to be recognised as Irish citizens. The Passport Service will accept a valid post-nuptial declaration (i.e. dated on or before 29 November 2005) as evidence of citizenship.  Since 30 November 2005, spouses of Irish citizens without any other claim to Irish citizenship (such as, for example, citizenship by descent) may apply for naturalisation if they wish to establish Irish citizenship. Naturalisation comes under the jurisdiction of the Irish Naturalisation and Immigration Service within the Department of Justice.  In this particular case, if the individual concerned cannot provide evidence of Irish citizenship, the Passport Service will not be in a position to approve any passport application made by them. It is open to the person to make enquiries with regard to their eligibility for Irish citizenship to the Department of Justice. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-10-02",
        "by": {
          "showAs": "James Lawless",
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-09-24",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-24/writtens/mul@/dbsect_290.xml"
            }
          },
          "debateSectionId": "dbsect_290",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-24/writtens/dbsect_290",
          "showAs": "Personal Public Service Numbers"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-09-24/pq_287",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 287,
        "showAs": " 287. Deputy James Lawless asked the Minister for Social Protection to examine the current issues with the provision of PPS numbers (details supplied); and if she will make a statement on the matter. [37880/24] ",
        "answerText": " Minister for Social Protection  A Personal Public Service (PPS) Number is a unique reference number that helps a person access social welfare benefits and public services in Ireland. To get a PPS Number, a person is asked to provide evidence of their identity, why they need a PPS Number and their address.  A person living in Ireland who is 18 or over and needs a PPSN can apply at MyWelfare.ie. The person completes an online application in full and is then given an in-person appointment. Upon successful completion of the appointment, a PPS Number will issue to the person immediately.  Some examples of why a person may apply for a PPS Number are:  • To take up work  • to apply for a social welfare payment  • to apply for or exchange a driver’s licence  • to access other public services  • to register for a course in a school or college  A person applying for a PPS Number to take up work in Ireland is asked to provide a signed offer of employment from their employer confirming when the job is due to start or when it started. A person does not need a PPS Number to look for work or for an employer to make an offer of employment.  A person must also show evidence of their address to get a PPS Number. The document must show their name and address and not be older than 3 months. If the person is staying with friends or relatives, an original household bill plus a note from the bill holder confirming that the person lives at the bill address is acceptable. This note can be written on the bill itself.  The person concerned applied to my Department for a PPS Number. However this application could not be processed as the documents provided relating to employment require further clarification.  My officials are contacting the person in relation to the clarifications required and will arrange a PPS Number appointment. Upon the successful completion of the appointment, a PPS Number will issue to the person immediately.  Any enquiries pertaining to the matter of tax credits can be clarified by my colleague, the Minister for Finance.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-09-24",
        "by": {
          "showAs": "James Lawless",
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-09-18",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-18/writtens/mul@/dbsect_308.xml"
            }
          },
          "debateSectionId": "dbsect_308",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-18/writtens/dbsect_308",
          "showAs": "School Staff"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-09-18/pq_336",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 336,
        "showAs": " 336. Deputy James Lawless asked the Minister for Education to examine a case of incorrect ASC contributions causing debt issues for a person (details supplied); and if she will make a statement on the matter. [36814/24] ",
        "answerText": " Minister for Education  I refer to the Deputy’s question regarding one of your constituents and the incorrect application of ASC to their pay.My officials have made enquiries with KWETB and I am informed that the following is the position in respect of this matter.The Teacher’s employment commenced with KWETB on 1 Sept 2019. On commencement of her employment with KWETB, the Teacher was put into the Single Pension Scheme and charged the rate of ASC appropriate to that scheme. Subsequent to the commencement of her employment with KWETB, the teacher submitted a statement of service, with past teaching experience, and her pay was increased by placing her on a higher point of the incremental teacher payscale.However, KWETB made an error in not moving the teacher to the correct pension scheme commensurate with her previous teaching experience i.e. the pre-April 2004 pension scheme at that time.This error was not realised by KWETB until late 2023, when the teacher made enquiries regarding her pension. Once the error came to light, the teacher was moved into the correct pension scheme and this pension scheme attracts a higher rate of ASC to be paid by the teacher through their payroll. Accordingly, the Teacher’s ASC charge immediately increased in her ongoing salary payments and KWETB then calculated the amount of ASC which had been underpaid from 1 September 2019. Following detailed calculations by KWETB, these calculations showed that the total underpayment of ASC for this period was € 11,497.90. The HR Manager in KWETB met with the teacher on two occasions and outlined the position and also outlined that the ETB were legally obliged to recoup this underpayment of ASC from the teacher. The HR Manager in KWETB apologised profusely to the teacher for the error that was made and for the hardship that this was causing for the teacher. This apology was made both verbally and in writing to the teacher.KWETB outlined to the teacher that the ETB were obliged to recoup this money from the teacher, as it is a statutory charge and a benefit is accruing to the teacher in the form of their salary and future pension payments including their future pension lump sum payment. KWETB engaged with the Teacher to confirm this and laid out a number of flexible options on how the recoupment could be made to reduce the financial hardship for the teacher. I am informed by my officials that KWETB and the teacher have now come to an agreement on how this recoupment will be made, and the duration of this recoupment, and this process of recoupment has now commenced. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-09-18",
        "by": {
          "showAs": "James Lawless",
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-09-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-09/writtens/mul@/dbsect_15.xml"
            }
          },
          "debateSectionId": "dbsect_15",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-09/writtens/dbsect_15",
          "showAs": "Passport Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-09-09/pq_25",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 25,
        "showAs": " 25. Deputy James Lawless asked the Tánaiste and Minister for Foreign Affairs if a passport application for a person (details provided) will be expedited; and if he will make a statement on the matter. [34147/24] ",
        "answerText": " Tánaiste and Minister for Foreign Affairs  I propose to take Questions Nos. 14, 25, 37, 38 and 48 together.  With regard to the specific applications about which the Deputies have enquired, the Passport Service has issued passports to the applicants. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-09-09",
        "by": {
          "showAs": "James Lawless",
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-09-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-09/writtens/mul@/dbsect_30.xml"
            }
          },
          "debateSectionId": "dbsect_30",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-09/writtens/dbsect_30",
          "showAs": "Passport Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-09-09/pq_30",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 30,
        "showAs": " 30. Deputy James Lawless asked the Tánaiste and Minister for Foreign Affairs to expedite a passport application (details supplied); and if he will make a statement on the matter. [34248/24] ",
        "answerText": " Tánaiste and Minister for Foreign Affairs  With regard to the specific application about which the Deputy has enquired, the Passport Service has issued the passport to the applicant through the Urgent Appointment Service. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-09-09",
        "by": {
          "showAs": "James Lawless",
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-09-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-09/writtens/mul@/dbsect_15.xml"
            }
          },
          "debateSectionId": "dbsect_15",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-09/writtens/dbsect_15",
          "showAs": "Passport Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-09-09/pq_48",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 48,
        "showAs": " 48. Deputy James Lawless asked the Tánaiste and Minister for Foreign Affairs if a passport application (details supplied) will be expedited; and if he will make a statement on the matter. [34885/24] ",
        "answerText": " Tánaiste and Minister for Foreign Affairs  I propose to take Questions Nos. 14, 25, 37, 38 and 48 together.  With regard to the specific applications about which the Deputies have enquired, the Passport Service has issued passports to the applicants. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-09-09",
        "by": {
          "showAs": "James Lawless",
          "memberCode": "James-Lawless.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/James-Lawless.D.2016-10-03"
        }
      }
    }
  ]
}