{
  "head": {
    "counts": {
      "questionCount": 2684,
      "resultCount": 2684
    }
  },
  "results": [
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "showAs": "Michael Moynihan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26"
        },
        "showAs": " 119. Deputy Michael Moynihan asked the Minister for Climate, Energy and the Environment the expected timeframe for the enactment of the Electricity (Supply) (Amendment) Bill 2025; and if he will make a statement on the matter. [48007/25] ",
        "to": {
          "roleType": null,
          "showAs": "Climate",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_71.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_71",
          "showAs": "Legislative Measures",
          "debateSectionId": "dbsect_71"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_119",
        "answerText": " Minister for Climate, Energy and the Environment  The Heads of the Electricity (Supply) (Amendment) Bill 2025 were approved by Government along with priority drafting on the 29 of July.  The unprecedented outages caused by Storm Éowyn exposed critical vulnerabilities arising from unmanaged vegetation and commercial forestry close to electricity infrastructure. Accordingly, the Bill will provide for the establishment and maintenance of forestry corridors (areas within a given distance of the electricity network within which forestry vegetation and related activities can be restricted by law), and includes a number of other provisions to enable the creation of these corridors.  The Department is engaging with the Office of Parliamentary Counsel to draft the bill as quickly as possible. The Department will engage with all relevant stakeholders to expedite delivery of this legislation. ",
        "questionNumber": 119
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "showAs": "Michael Moynihan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26"
        },
        "showAs": " 120. Deputy Michael Moynihan asked the Minister for Climate, Energy and the Environment the action being taken to prepare for the coming winter period to reduce power outages across the country caused by fallen trees; the steps being taken regarding power lines passing through forestry; and if he will make a statement on the matter. [48008/25] ",
        "to": {
          "roleType": null,
          "showAs": "Climate",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_72.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_72",
          "showAs": "Energy Policy",
          "debateSectionId": "dbsect_72"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_120",
        "answerText": " Minister for Climate, Energy and the Environment  Following Storm Éowyn, I asked ESB Networks to prepare as a priority a Winter 2025 Resilience Plan to enhance the resilience of the grid in the most vulnerable locations for the upcoming winter. It was published by ESB Networks in April (copy attached) and sets out several actions to build resilience in the electricity network ahead of Winter 2025. ESB has reported strong progress to my Department on the actions to date:  1. ESB-N undertook a survey of the electricity network following the storm, making hazards safe and identifying remedial works needed to refurbish network weakened by the recent storms.  2. ESB-N continues to work with Coillte and the Department of Agriculture, Food and the Marine to identify segments of the network at highest future risk. Analysis of customers most affected by windfall has identified priority areas for remediation. Timber harvesters have been procured and during the summer began to cut timber according to this prioritisation.  3. Emergency stocks of spare parts and materials are to be replenished and doubled in size by October 2025. This replenishment is on schedule for completion and is now 80% complete.  4. Staffing levels and available contractor resources are to be increased through provision of targeted training programmes via the Education and Training Boards. In conjunction with the Department of Enterprise, Tourism and Employment, my Department has progressed the issue of permits for skilled workers from outside the EU to advance urgent forestry work.  5. ESB-N is seeking to capitalise on the support received from other utilities across Europe in assisting with Storm Éowyn restoration. ESB-N is leading a working group to establish formal arrangements for mutual aid during extreme weather events via the European Distribution System Operators body.  6. ESB-N is currently concluding a formal Storm Review to identify additional recommendations to be implemented in advance of future storms, including learning from international experiences. My Department continues to engage with ESB Networks on challenges to grid resilience in advance of winter 2025.  ESB-N is also increasing the number of access officers who manage engagement with landowners on forestry work.  My Department is preparing legislation to enhance ESB-N’s powers to manage vegetation, place the dimensions and conditions of corridors through forestry on a statutory footing, and establish principles for the compensation of affected landowners. Cabinet approved the Heads of this Bill on 29 July, and work on advancing the legislation continues.   Winter 2025 Resilience Plan  ",
        "questionNumber": 120
      },
      "contextDate": "2025-09-17"
    },
    {
      "contextDate": "2025-05-13",
      "question": {
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-13/writtens/mul@/dbsect_279.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-05-13/writtens/dbsect_279",
          "showAs": "Bus Éireann",
          "debateSectionId": "dbsect_279"
        },
        "questionType": "written",
        "questionNumber": 414,
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Transport",
          "roleType": null
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "showAs": "Michael Moynihan",
          "memberCode": "Michael-Moynihan.D.1997-06-26"
        },
        "showAs": " 414. Deputy Michael Moynihan asked the Minister for Transport for an update on the enactment of the revised services on Bus Éireann route 243 covering Bweeng and Grenagh; and if he will make a statement on the matter. [24196/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-05-13/pq_414",
        "answerText": " Minister of State at the Department of Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators, in this case, Bus Éireann.  In light of the NTA and Bus Eireann’s responsibility in this area, I have forwarded the Deputy's question to them both for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "date": "2025-05-13"
      }
    },
    {
      "question": {
        "house": {
          "houseNo": "34",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil"
        },
        "by": {
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "showAs": "Michael Moynihan"
        },
        "questionNumber": 473,
        "showAs": " 473. Deputy Michael Moynihan asked the Minister for Transport if the Local Link Service in County Cork will be extended to provide a direct service between the towns of Buttevant and Doneraile; and if he will make a statement on the matter. [20174/25] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-04-29/pq_473",
        "debateSection": {
          "debateSectionId": "dbsect_396",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-29/writtens/dbsect_396",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-04-29/writtens/mul@/dbsect_396.xml"
            },
            "pdf": null
          },
          "showAs": "Bus Services"
        },
        "answerText": " Minister of State at the Department of Transport (Deputy Jerry Buttimer)  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. In the new Programme for Government, Securing Ireland's Future, this Government has committed to increasing Local Link services in rural areas to better connect villages, towns and cities.  The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally. The NTA also has national responsibility for integrated local and rural transport, including delivering the Connecting Ireland Rural Mobility Plan and New Town Services.  In light of the NTA's responsibilities for the rollout of new and enhanced services, including in County Cork, I have referred your question to the NTA for direct reply to you. Please advise my private office if you do not receive a reply within ten working days. ",
        "date": "2025-04-29"
      },
      "contextDate": "2025-04-29"
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 835,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_835",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_789",
          "showAs": "Agriculture Supports",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_789",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_789.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Agriculture, Food and the Marine  The group commonly referred to as forgotten farmers comprises young farmers who were under the age of 40 in 2015, had established their holdings prior to 2008 and held no or low value payment entitlements.  I was pleased to be able to confirm that as part of Budget 2025 my Department secured an allocation of €5 million for 2025 to support this group of farmers.  Work continues on addressing a number of remaining issues, including state aid considerations, before the details of the eligibility requirements and benefits to successful applicants under the scheme can be finalised.  Details of the scheme will be made available as soon as this process has been completed.  I am committed to delivering for these farmers, many of whom find themselves in this situation through no fault of their own, at the earliest opportunity in 2025. ",
        "showAs": " 835. Deputy Michael Moynihan asked the Minister for Agriculture, Food and the Marine if his Department will re-examine the cases of young farmers who were established prior to 2008 and were not eligible for the new supports introduced at this time for young farmers; and if he will make a statement on the matter. [44326/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Michael Moynihan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "memberCode": "Michael-Moynihan.D.1997-06-26"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 1107,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_1107",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_1055",
          "showAs": "Dental Services ",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_1055",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_1055.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  There are challenges in the provision of oral healthcare services, including orthodontics, and patients are waiting longer than they should have to, to access care. Therefore, in addition to the over €200m that the Government invests in public oral healthcare services annually, an additional €17m in one-off funding has been invested since 2019/2020 to address orthodontics treatment waiting lists. This funding has supported a reduction in the total number waiting to commence orthodontic treatment, by 43% between end-March 2019 and end-June 2024.  However, I acknowledge that we need to do more. From 2025, €8.4 million is being provided on an ongoing basis to continue initiatives aimed at addressing primary care waiting lists for children. This ongoing funding will provide an opportunity to drive innovative solutions built on the learnings from previous successful Waiting List Action Plan initiatives to address the increasing level of demand for primary care services.  Once the allocation of this funding across primary care is finalised for 2025, the proportion assigned to orthodontics will be applied across the various available orthodontics waiting list initiatives in a manner that best addresses the current waiting lists, in terms of both specific clinical need and geographic spread.  Implementation of the National Oral Health Policy is proceeding and a plan for the first phase of implementation is being finalised between my Department and the HSE. The plan will set out a phased approach to the reform of public oral healthcare services, including orthodontics, along with the associated strategic workforce planning elements. ",
        "showAs": " 1107. Deputy Michael Moynihan asked the Minister for Health what action is being taken to address the extremely long waiting times for orthodontic treatment; if he would accept that these long waiting times place an enormous burden on the patients affected; and if he will make a statement on the matter. [44347/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Michael Moynihan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "memberCode": "Michael-Moynihan.D.1997-06-26"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 1308,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_1308",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_1242",
          "showAs": "Grant Payments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_1242",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_1242.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Further and Higher Education",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  Officials from my Department will contact the Deputy for further information in respect of the question posed and will revert to the Deputy directly upon receipt of this further information. ",
        "showAs": " 1308. Deputy Michael Moynihan asked the Minister for Further and Higher Education, Research, Innovation and Science if higher education grants have been awarded to post-graduate students who were in receipt of a stipend or bursary that included the payment of fees to the relevant third level institution on behalf of the student (details supplied); and if he will make a statement on the matter. [44328/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Michael Moynihan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "memberCode": "Michael-Moynihan.D.1997-06-26"
        }
      }
    },
    {
      "contextDate": "2024-10-24",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-24/writtens/mul@/dbsect_332.xml"
            }
          },
          "debateSectionId": "dbsect_332",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-24/writtens/dbsect_332",
          "showAs": "Medicinal Products"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-24/pq_322",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 322,
        "showAs": " 322. Deputy Michael Moynihan asked the Minister for Health if a person in County Cork (details supplied) can continue to be reimbursed for the same medication under the GMS rather than changing to generic medication; and if he will make a statement on the matter. [43616/24] ",
        "answerText": " Minister for Health  The Health (Pricing and Supply of Medical Goods) Act 2013 permits community pharmacists to dispense generic medicines where a brand name medicine has been prescribed, provided they have been designated as interchangeable by the Health Products Regulatory Authority (HPRA).  Generic medicines must meet the same standards of quality and safety and have the same effect as the original medicine. All generic medicines on the Irish market are required to be properly licensed and meet the requirements of the HPRA.  Reference pricing means a single reimbursement price, or reference price, for a group of interchangeable medicines. This is the maximum price that the HSE will pay community pharmacies for all medicines in this group, regardless of the price of the individual medicine.  Section 13 (1) of the 2013 Act allows a prescriber to indicate on a prescription that a branded medicine should, for clinical reasons, not be substituted.  Therefore, if a patient wishes to remain on a particular branded medicine, they should discuss this with their clinician in the first instance who may, for clinical reasons, write ‘do not substitute’ on the prescription. If the clinician decides to write ‘do not substitute’, then the patient will not have to pay the difference between the reference price and the branded product price. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-10-24",
        "by": {
          "showAs": "Michael Moynihan",
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26"
        }
      }
    },
    {
      "question": {
        "by": {
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "showAs": "Michael Moynihan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-23/writtens/dbsect_189",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-23/writtens/mul@/dbsect_189.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_189",
          "showAs": "Disability Services"
        },
        "showAs": " 154. Deputy Michael Moynihan asked the Minister for Children, Equality, Disability, Integration and Youth if a disability services project in County Cork (details supplied) can draw down funding for the costs associated with the project to date; and if he will make a statement on the matter. [43351/24] ",
        "questionNumber": 154,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-23/pq_154",
        "date": "2024-10-23",
        "answerText": " Minister of State at the Department of Children, Equality, Disability, Integration and Youth  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "house": {
          "chamberType": "house",
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "to": {
          "roleCode": null,
          "roleType": null,
          "showAs": "Children",
          "uri": null
        }
      },
      "contextDate": "2024-10-23"
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 129,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_129",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_105",
          "showAs": "Post Office Network",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_105",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_105.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Environment",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for the Environment, Climate and Communications (Deputy Eamon Ryan)  There are no plans to establish an Ombudsman for the Post Office network. An Post is a commercial State body with a mandate to act commercially.  The operation of the post office network and the terms under which Postmasters contract with An Post is a matter between the Postmasters and An Post and any negotiations are a matter for both parties directly and I, as Minister, have no function. ",
        "showAs": " 129. Deputy Michael Moynihan asked the Minister for the Environment, Climate and Communications to consider appointing an ombudsman to deal with issues between An Post and Postmasters; and if he will make a statement on the matter. [42746/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Michael Moynihan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "memberCode": "Michael-Moynihan.D.1997-06-26"
        }
      }
    },
    {
      "contextDate": "2024-10-22",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 351,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-22/pq_351",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_319",
          "showAs": "Special Educational Needs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/dbsect_319",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-22/writtens/mul@/dbsect_319.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Education  The State Examinations Commission has statutory responsibility for operational matters relating to the state examinations.  In view of this I have forwarded your query to the State Examinations Commission for direct reply to you. ",
        "showAs": " 351. Deputy Michael Moynihan asked the Minister for Education if additional time will be provided to students with dyslexia sitting second level exams; and if she will make a statement on the matter. [42747/24] ",
        "date": "2024-10-22",
        "by": {
          "showAs": "Michael Moynihan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "memberCode": "Michael-Moynihan.D.1997-06-26"
        }
      }
    },
    {
      "contextDate": "2024-10-17",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 12,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-17/pq_12",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_42",
          "showAs": "Defence Forces",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-17/writtens/dbsect_42",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-17/writtens/mul@/dbsect_42.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Defence",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Tánaiste and Minister for Defence  I wish to reassure the Deputy that, as Minister of Defence, I am fully committed to the removal of the blanket exemption which currently applies to the Defence Forces in the 1997 Organisation of Working Time Act.  As the Deputy is aware, working time legislation falls under the remit of my colleague, the Minister for Enterprise, Trade and Employment (DETE), Peter Burke. Following my approval earlier this year of a management position, and extensive formal engagement thereafter, the Department of Enterprise, Trade and Employment are currently working to develop the appropriate legislative mechanism to bring the Defence Forces within the scope of the 1997 Act.  The drafting of such legislation on such matters is complex, however, I want to be clear that this is a priority for both Minister Burke, Minister Higgins, myself and indeed for the wider Government.  My colleague, Minister Burke advised last month that a decision has been made to amend the Organisation of Working Time Act, by way of Regulation under the European Communities Act 1972 and it is expected that a Statutory Instrument can be finalised by the end of the year.  The Military Authorities have previously determined that the vast majority of activities are compliant with the Directive. However, in tandem with the drafting of the Statutory Instrument, my officials are actively progressing the necessary underpinning required for those agreed health and safety protections associated with military activities deemed to be exempt from the scope of the Directive due to their specific nature.  These measures will come into effect in parallel with the enactment of the Statutory Instrument to remove the blanket exemption and provide for these specific exemptions.  Another critical enabler in taking forward the implementation of the Directive is a robust Time and Attendance system. Following the pilot Time and Attendance system undertaken by the military authorities last year, a follow-on procurement process is now underway, for a long-term electronic solution, which will lead to the development a system to record the daily working hours of every member of the Defence Forces.  I am delighted that this very significant piece of work is now about to come to fruition. It is a key development for each and every member of the Defence Forces, and is correctly seen as an important retention measure which will ensure that health and safety protections as prescribed in the Directive, are afforded to serving personnel. ",
        "showAs": " 12. Deputy Michael Moynihan asked the Tánaiste and Minister for Defence for a report on the implementation of the Working Time Directive 2003 in the Defence Forces; and if he will make a statement on the matter. [42010/24] ",
        "date": "2024-10-17",
        "by": {
          "showAs": "Michael Moynihan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "memberCode": "Michael-Moynihan.D.1997-06-26"
        }
      }
    },
    {
      "contextDate": "2024-10-17",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 21,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-17/pq_21",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_50",
          "showAs": "Defence Forces",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-17/writtens/dbsect_50",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-17/writtens/mul@/dbsect_50.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Defence",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Tánaiste and Minister for Defence  Retention, of course, as the Deputy will be aware, is not influenced by a single factor, but rather that there are multiple, interconnected factors, which are responsible for retaining people in any organisation. In common with other international militaries and while in a buoyant economy, the Defence Forces is facing a challenging environment at present.  Pension entitlements cannot be viewed solely as a retention measure; they are in place primarily to support the Defence Forces manpower policy and operational requirements.  Defence Forces pension arrangements differ in a number of key respects to the wider public service. These distinctions include earlier ages with entitlement to immediate pension benefit, and atypical faster rates of benefit accrual, similar to other uniformed services.  Pension entitlements for members of the Defence Forces are split over 3 main pension schemes, depending on when a member joined the Defence Forces. In the round, Defence Forces pension schemes compare very favourably to the generality of pension arrangements applicable across our public service  As Minister for Defence, in addition to a programme of cultural transformation, my focus has been on stabilising the numbers of personnel and facilitating the capacity for further increases.  A number of specific actions in the area of retention have already been delivered:  • Significant progress on pay in recent years;  • Increase in the mandatory retirement age to 62 years of age for all personnel  • Increase in the maximum recruitment age to 39;  • Increases to Patrol Duty Allowance to incentivise sea-going in the Naval Service;  • The extension of a Naval Service personnel tax credit for a further five years;  • The extension of private healthcare to all ranks in the Defence Forces;  • Access to free medical, physiotherapy and dental care;  • Provision of fitness, training and sports facilities across its installations;  • Provision of fully funded opportunities to continue education to gain professional and academic qualifications;  • Progress on the 2023-2027 Defence Forces Infrastructure Development Plan (IDP) with the highest level of financial resources in the State’s history;  • A revised policy on maternity and associated protected leave which is fully aligned with national legislation;  • A new policy on personal appearance standards;  • Significant progress on the removal of the blanket exemption for the Defence Forces, from the provisions of the Organisation of Working Time Act following my approval earlier this year of a management position.  • The implementation of a range of work-life balance and 'harmony’ initiatives.  I would like to assure the Deputy that the recruitment and retention of Defence Forces Personnel continues to be a key priority for me. ",
        "showAs": " 21. Deputy Michael Moynihan asked the Tánaiste and Minister for Defence if he has examined the extent to which pension entitlements are hampering retention levels in the Defence Forces; and if he will make a statement on the matter. [42011/24] ",
        "date": "2024-10-17",
        "by": {
          "showAs": "Michael Moynihan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "memberCode": "Michael-Moynihan.D.1997-06-26"
        }
      }
    },
    {
      "contextDate": "2024-10-17",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 348,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-17/pq_348",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_358",
          "showAs": "Apprenticeship Programmes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-17/writtens/dbsect_358",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-17/writtens/mul@/dbsect_358.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Further and Higher Education",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  The Apprenticeship Employer Grant provides financial support from the State to apprenticeship employers who employ apprentices on one of the 52 consortia-led apprenticeships which have been established since 2016. The grant is funded through the National Training Fund and came into effect on the 1st of January, 2022.  Apprenticeship employers are eligible to receive a €2,000 grant annually for each registered apprentice. The grant is paid in arrears in two payments annually, with €1,000 payable in May-June and a further €1,000 in November-December.  In the last full year, 2023, just over 3,000 apprentices positions were eligible for the €2,000 grant and a total €5.4 million was paid out to employers. Based on these figures the table sets out the projected costs at the different rates set out in the question.     Grant Value    Cost      €5,000    €15.8 million      €7,000    €22.1 million      €10,000    €31.6 million     However, it should be noted that these figures are based on all eligible apprentices, but not all claims received resulted in a payment as some may have been rejected for a number of reasons, e.g. lack of a tax clearance. In addition, not all eligible employers would have submitted a claim.  This Government is committed to growing apprenticeship and my Department secured a significant investment of €77.4m into the apprenticeship system in Budget 2025. Of this, €5.9 million has been specifically allocated to the Consortia-led apprenticeships.  It remains a priority for my Department to maintain this momentum, to continue growing the apprenticeship system, and ensure that there are enough training places for current and future skills needs. ",
        "showAs": " 348. Deputy Michael Moynihan asked the Minister for Further and Higher Education, Research, Innovation and Science the estimated full-year cost to the Exchequer of increasing the training grant per apprentice for employers to €5,000, €7,000 and €10,000. [42240/24] ",
        "date": "2024-10-17",
        "by": {
          "showAs": "Michael Moynihan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "memberCode": "Michael-Moynihan.D.1997-06-26"
        }
      }
    },
    {
      "contextDate": "2024-10-16",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 216,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-16/pq_216",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_264",
          "showAs": "Disability Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-16/writtens/dbsect_264",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-16/writtens/mul@/dbsect_264.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister of State at the Department of Children, Equality, Disability, Integration and Youth  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "showAs": " 216. Deputy Michael Moynihan asked the Minister for Children, Equality, Disability, Integration and Youth the details of the increase in funding for specialist community based disability services (details supplied) in each CHO area since 2020; the estimated funding to be provided for each CHO area in 2025; the new and additional services provided in each CHO area since 2020; the new and additional services to be provided in each CHO area in 2025; and if he will make a statement on the matter. [41898/24] ",
        "date": "2024-10-16",
        "by": {
          "showAs": "Michael Moynihan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "memberCode": "Michael-Moynihan.D.1997-06-26"
        }
      }
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "showAs": "Michael Moynihan"
        },
        "questionNumber": 490,
        "showAs": " 490. Deputy Michael Moynihan asked the Minister for Agriculture, Food and the Marine the full-year cost of all poultry sector supports in 2024 and 2025, in tabular form; and the breakdown per scheme. [41050/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_490",
        "debateSection": {
          "debateSectionId": "dbsect_442",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_442",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_442.xml"
            },
            "pdf": null
          },
          "showAs": "Agriculture Supports"
        },
        "answerText": " Minister for Agriculture, Food and the Marine  The poultry sector continues to make a valuable contribution to Irish agrifood sector, supporting approximately 5,000 jobs in direct and indirect employment. The CSO valued the output of the poultry meat sector at €225.7 million for 2023.  As in other meat sectors, global trade conditions will be crucial in determining the outlook for the Irish poultry sector over the medium to longer term. 2024 has shown signs of growth in overall poultry production with slaughter figures, as of Week 38 of 2024, up by 2.5% on the same period of 2023.  My Department co-funded with the Department of Enterprise, Trade and Employment a substantial €100m Capital Investment Scheme for the Processing and Marketing of Agriculture products, administered by Enterprise Ireland, which opened in January of 2021 and closed in November of 2022. The scheme offered transformational capital investment in SME’s & Large companies, including in the poultry sector, to enable them pursue product and market diversification strategies to achieve greater value add.  The current main supports provided by my Department to the sector are:  The Targeted Advisory Service on Animal Health (TASAH). Over €126,000 was spent in 2024 with a similar figure being made available in 2025.  Under the Targeted Agriculture Modernisation Scheme (TAMS), and specifically the Pig and Poultry Capital Investment Scheme (PPIS), the Poultry Sector has seen almost €3.77 million paid towards eligible applications. The total amount committed, based on approved applications, for the remainder of 2024 and 2025 is just over € 2.13 million. The actual expenditure will depend on the number of claims submitted in respect of completed investments.  The Department also allocates funding annually for the compensation of Zoonotic Salmonella in poultry via a Scheme of financial assistance in cases of Salmonella outbreaks in poultry flocks, on an ex gratia basis. The Scheme applies only to suspected or confirmed outbreaks of Salmonella Enteriditis and Salmonella Typhimurium. In 2024 the allocation was € 135,000 with a similar allocation envisaged for 2025. ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "showAs": "Michael Moynihan"
        },
        "questionNumber": 491,
        "showAs": " 491. Deputy Michael Moynihan asked the Minister for Agriculture, Food and the Marine the full-year cost of all agri-environmental schemes in 2024 and 2025, in tabular form; and the breakdown per scheme. [41051/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_491",
        "debateSection": {
          "debateSectionId": "dbsect_443",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_443",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_443.xml"
            },
            "pdf": null
          },
          "showAs": "Agriculture Schemes"
        },
        "answerText": " Minister for Agriculture, Food and the Marine  The 2024 allocations for my department's agri-environmental schemes is set out in the following table.     Subhead    2024 Allocation €000      B.3 - AGRI-ENVIRONMENTAL SCHEMES    92,499      B.4 - AREAS OF NATURAL CONSTRAINT SCHEME    247,000      B.10 - FORESTRY & BIO ENERGY*    115,000      B.14 - AGRI-CLIMATE RURAL ENVIRONMENT SCHEME    200,000      B.15 - ORGANIC FARMING SCHEME    47,000      Total    701,499     *2024 forestry allocation includes €18 million of the Department's 2023 deferred capital surrender.  Subhead B.3 Agri-Environmental Schemes consists of a number of schemes including:  • GLAS  • Locally led Agri-Environmental Schemes  • Traditional Buildings  • Other Agri Environmental Initiatives (e.g. Soil Sampling, Multi-species Sward Measure and Red Clover Silage Measure)  • An agri-environment Targeted Agricultural Modernisation Scheme (TAMS) and an Organic Farming scheme. These schemes will ultimately be funded from the European Union Recovery Instrument  • Straw Incorporation Measure  The 2025 definitive allocations will be set out in the 2025 Revised Estimates Volume (REV) which will be published later this year.  In addition to the measures outlined above the Suckler Carbon Efficiency Programme (SCEP) provides support to beef farmers to improve the environmental sustainability of the national beef herd. The programme aims to build on the gains delivered in recent years through the Beef Data and Genomics Programme (BDGP) and the Beef Environmental Efficiency Programme (BEEP) by improving the genetic merit of the Irish suckler herd, to reduce the carbon footprint of Irish beef. ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "showAs": "Michael Moynihan"
        },
        "questionNumber": 492,
        "showAs": " 492. Deputy Michael Moynihan asked the Minister for Agriculture, Food and the Marine the full-year cost of all animal welfare supports in 2024 and 2025, in tabular form; and the breakdown per scheme. [41052/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_492",
        "debateSection": {
          "debateSectionId": "dbsect_444",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_444",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_444.xml"
            },
            "pdf": null
          },
          "showAs": "Agriculture Supports"
        },
        "answerText": " Minister for Agriculture, Food and the Marine  Animal welfare is a key priority for me as Minister and for the Government and Department provides considerable funding to support animal welfare. In December 2023, under the Animal Welfare grants programme I announced the record allocation of €6 million in funding to 101 animal welfare charities throughout the country. This marks the largest ever award of grant funding to animal welfare charities by my Department.  Currently, the figures for the full cost of animal welfare supports in 2024 are not finalised and the 2025 definitive allocations have yet to be decided. They will be set out in the 2025 Revised Estimates Volume (REV) which will be published later this year. ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "showAs": "Michael Moynihan"
        },
        "questionNumber": 493,
        "showAs": " 493. Deputy Michael Moynihan asked the Minister for Agriculture, Food and the Marine the full-year cost of all farm safety supports in 2024 and 2025, in tabular form; and the breakdown per scheme. [41053/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_493",
        "debateSection": {
          "debateSectionId": "dbsect_445",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_445",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_445.xml"
            },
            "pdf": null
          },
          "showAs": "Agriculture Supports"
        },
        "answerText": " Minister for Agriculture, Food and the Marine  My Department is implementing a series of farm safety, health and well-being initiatives in 2024 through dedicated funding of €2.5m. These initiatives promote farm safety practices and risk awareness and encourage behavioural change around farm safety from a young age, while also supporting those who have been impacted by fatal and non-fatal incidents.  The main initiatives in 2024 are outlined in the following table:     Farm Safety Health and Wellbeing Initiatives 2024           Open Call for Farm Safety, Health and Wellbeing Projects           A series of four joint DAFM/Health and Safety Authority farm safety media campaigns           Agri Aware’s school children's farm safety initiative           On Feirm Ground 2           National Farm Safety Measure 2024           Agricultural simulators for use in agricultural colleges and Teagasc research centres.           Farm safety Hi-Viz vests for children           Farm safety content for the Suckler Carbon Efficiency Programme (SCEP) training course          Dedicated funding of €2.5m was also secured in Budget 2025 to continue to support existing initiatives and the introduction of new initiatives in support of farm safety, health and well-being.  The Accelerated Capital Allowances for Farm Safety Equipment, which allows for the Accelerated Capital Allowances of 50% per annum over two years on qualifying farm safety and adaptive equipment, was expanded in Budget 2025.  In addition to the dedicated funding mentioned, the tables below outline the expenditure to date and anticipated expenditure in 2024 on farm safety related investments under the Targeted Agriculture Modernisation Schemes (TAMS).  Table 1: TAMSII     Scheme    Number of Sub Investments    Sub Claimed Reference Cost    Calculated Grant Value      TAMS II Payments 2024    456    €1,076,375.21    €483,843.93      TAMS II - Safety Investments Approved but NOT yet claimed    420    €768,515.24    €354,710.46     Table 2: TAMS3 Farm Safety Capital Investment Scheme - Applications Received 2024     Number    Commitment Amount    Grant at 60 %      3719    €23,043,915.30    €13,826,349.18    ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "showAs": "Michael Moynihan"
        },
        "questionNumber": 494,
        "showAs": " 494. Deputy Michael Moynihan asked the Minister for Agriculture, Food and the Marine the full-year cost of all forestry supports in 2024 and 2025, in tabular form; and the breakdown per scheme. [41062/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_494",
        "debateSection": {
          "debateSectionId": "dbsect_446",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_446",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_446.xml"
            },
            "pdf": null
          },
          "showAs": "Agriculture Supports"
        },
        "answerText": " Minister for Agriculture, Food and the Marine  The Forestry Programme for the period 2023-2027 aims to encourage a substantial increase in afforestation by offering attractive and diverse options for planting. This Government has committed €1.3 billion of funding to the Programme in order to support our national ambition of 8,000 hectares of afforestation per year. It also provides for a range of schemes to support the maintenance and sustainable management of forests.  Funding of €110 million and €91 million has been allocated to date, within Budget 2024 and 2025, respectively. This underpins the diverse range of measures offered within the Forestry Programme 2023 - 2027. This includes, among others, the broad range of tree planting options on offer and also provides for the Ash Dieback Reconstitution Scheme and the new Ash Dieback Climate Action Performance Payment, which was approved by Cabinet on 30 April this year.  I can confirm that, in the year to date, there has been 1,302 hectares of new forests planted (this means planted and first payments issued). The 2024 expenditure to date, relating to forestry scheme supports, are detailed within the following table.  Year to date spend for the week ending 10th October 2024     Afforestation, including Native Tree Area Scheme    €52,413,853      Forest Roads    €2,871,936      Reconstitution Schemes    €2,809,105      Woodland Improvement Scheme    €133,669              Year to date spend    €58,228,562    ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "showAs": "Michael Moynihan"
        },
        "questionNumber": 495,
        "showAs": " 495. Deputy Michael Moynihan asked the Minister for Agriculture, Food and the Marine the total annual funding being invested in incentivising the use of genetically enhanced beef AI/stock bulls. [41063/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_495",
        "debateSection": {
          "debateSectionId": "dbsect_447",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_447",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_447.xml"
            },
            "pdf": null
          },
          "showAs": "Agriculture Supports"
        },
        "answerText": " Minister for Agriculture, Food and the Marine  My Department's investment in improving the genetic merit of beef sires in the national herd is spread across three separate measures as described below.  The national Bovine Genotyping Programme, which commenced in 2023 for a five year period, is open to both dairy and beef breeding herds. The programme through the genotyping of the calf crop each year in the participating herds provides the building blocks for breeding decisions and strategies.  The year one cost of €10.7m was fully funded by my Department. The total estimated cost of €15m for each subsequent year will be funded using a strategic public/private cost sharing model between my Department, Industry (milk and dairy processors) and participating farmers. My Department's contribution will amount to €5m per year over that period.  The CAP Strategic Plan (CSP) Suckler Carbon Efficiency Programme (SCEP) supports farmers in improving the environmental sustainability of the Irish beef production system by incentivising participants to undertake mandatory actions that will improve the overall genetic merit of the suckler herd. One of these actions is the use of eligible (higher genetic merit) bull/AI.  To date, total payments of €56.5m were issued to almost 17,000 participants in respect of year one of the SCEP, which equates to an average payment of approximately €3,300 per beneficiary. A similar payment run is envisaged in subsequent years.  The CSP Dairy Beef Welfare Scheme provides support to dairy farmers to improve the animal health and welfare of the national herd by using better genetic merit beef sires. The scheme runs from 2024 to 2027 and has a budget allocation of €6.25m annually.  The latest scheme data indicates that approximately 10,500 participants with over 286,000 calves are currently eligible for payment. The actual number of animals on which farmers will ultimately be paid cannot yet be determined because the scheme year coincides with the calendar year. Payments for scheme year one will be made in March 2025 and annually thereafter until 2028. ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "showAs": "Michael Moynihan"
        },
        "questionNumber": 496,
        "showAs": " 496. Deputy Michael Moynihan asked the Minister for Agriculture, Food and the Marine the current funding provided for the Women in Agriculture Action Plan. [41064/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_496",
        "debateSection": {
          "debateSectionId": "dbsect_448",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_448",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_448.xml"
            },
            "pdf": null
          },
          "showAs": "Agriculture Supports"
        },
        "answerText": " Minister for Agriculture, Food and the Marine  Gender equality in agriculture is a key priority of mine. It is also a core principle of the European Union. The Common Agriculture Policy (CAP) Regulations place particular focus on promoting women’s participation in the development of rural areas, with special attention to farming. Good progress has been made in this area, and under Ireland’s CAP Strategic Plan (CSP) I am actively promoting gender equality, through several new initiatives, such as:  • An increased grant rate of 60% under the Women Farmer Capital Investment Scheme to fund on-farm investments by trained women farmers.An increased grant rate of 60% under the Women Farmer Capital Investment Scheme to fund on-farm investments by trained women farmers.  • The inclusion of an option to establish women-only groups in the current Knowledge Transfer Programme.  • Improved recording and reporting of gender data and the leveraging of the National CAP Network to increase the involvement of all women in the implementation of CAP.  • A European Innovation Partnership open call in April 2024 for proposals on “innovative approaches to support greater gender balance in farming in Ireland”.  Additionally, I support rural female entrepreneurs by funding the ACORNS programme providing tailored support to early-stage female entrepreneurs living in rural Ireland. Up to 50 new female entrepreneurs can participate in ACORNS annually and I launched the current ACORNS 10 programme in August.  Food Vision 2030, Ireland’s stakeholder-led strategy for the agrifood sector has environmental, economic and social sustainability at its core. Food Vision aims for Ireland to be “A World Leader in Sustainable Food Systems”. Food Vision was designed using a food systems approach, and recognises the importance of gender balance to the long-term sustainable future for primary producers. Food Vision includes actions to promote and improve gender balance at all levels within the sector, and included a commitment to host a National Dialogue on Women in Agriculture.  The Dialogue was held in February 2023 and explored gender equality in farming and the agrifood sector generally. The outcomes and recommendations were compiled into a report and action plan, which were published earlier this year. A working group has been established to oversee implementation of the action plan.  Many of the actions will not require direct funding as they will be carried out with existing resources within my Department, for example an internal review of DAFM scheme eligibility and educational requirements to ensure maximum opportunities are available to women farmers; and a dedicated “Women in Agriculture” space on the DAFM website. Others, such as funding for webinars & local events and a dedicated women in agriculture award will come from the overall Food Vision administrative budget, as required. Other actions such as the specific research on women in agriculture will be funded from the Research budget within my Department.  I will continue to liaise with the relevant stakeholders to promote and support gender balance in agriculture and will ensure funding for the Women in Agriculture Action Plan, where required. ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "showAs": "Michael Moynihan"
        },
        "questionNumber": 497,
        "showAs": " 497. Deputy Michael Moynihan asked the Minister for Agriculture, Food and the Marine the estimated annual cost of supports currently provided for an initiative (details supplied). [41065/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_497",
        "debateSection": {
          "debateSectionId": "dbsect_449",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_449",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_449.xml"
            },
            "pdf": null
          },
          "showAs": "Agriculture Supports"
        },
        "answerText": " Minister for Agriculture, Food and the Marine  The Targeted Agriculture Modernisation Scheme (TAMS 3) provides grants to farmers to build and/or improve a specified range of farm buildings and equipment on their holdings. The Solar Capital Investment scheme is a measure in TAMS, which provides support to farmers wishing to invest in renewable energy, thereby reducing their dependence on fossil fuels.  Payments are based on payment claims submitted in respect of completed approved investments. To date, over €1.7 million has been paid in grant aid under the Solar Capital Investment Scheme in 2024, with a further €484,546 paid for solar investments in TAMS II in 2024.  A total of over €34 million has been approved for solar investments under the first three tranches of TAMS 3. Applicants have 12 months from their date of approval to complete their investments and submit payment claims to my Department. In certain circumstances applicants may seek an extension of six months to complete investments and lodge their payment claims. Therefore the overall approved investment of in excess of €34 million could be drawn down over the next 18 months. ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "showAs": "Michael Moynihan"
        },
        "questionNumber": 658,
        "showAs": " 658. Deputy Michael Moynihan asked the Minister for Health if a glucose monitor (details supplied) is approved under the GMS or long-term illness scheme; and if he will make a statement on the matter. [41348/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_658",
        "debateSection": {
          "debateSectionId": "dbsect_604",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_604",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_604.xml"
            },
            "pdf": null
          },
          "showAs": "Medicinal Products"
        },
        "answerText": " Minister for Health  Under the Health (Pricing and Supply of Medical Goods) Act 2013, the HSE has statutory responsibility for decisions on the pricing and reimbursement of medicines and devices; therefore, the matter has been referred to the HSE for attention and direct reply to the Deputy. ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "showAs": "Michael Moynihan"
        },
        "questionNumber": 659,
        "showAs": " 659. Deputy Michael Moynihan asked the Minister for Health if a glucose monitor (details supplied) is approved under the GMS or long-term illness scheme; and if he will make a statement on the matter. [41349/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_659",
        "debateSection": {
          "debateSectionId": "dbsect_605",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_605",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_605.xml"
            },
            "pdf": null
          },
          "showAs": "Medicinal Products"
        },
        "answerText": " Minister for Health  Under the Health (Pricing and Supply of Medical Goods) Act 2013, the HSE has statutory responsibility for decisions on the pricing and reimbursement of medicines and devices; therefore, the matter has been referred to the HSE for attention and direct reply to the Deputy. ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "showAs": "Michael Moynihan"
        },
        "questionNumber": 660,
        "showAs": " 660. Deputy Michael Moynihan asked the Minister for Health the action that has been taken to provide a multidisciplinary specialist functional neurological disorder clinic in Ireland; and if he will make a statement on the matter.  [41356/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_660",
        "debateSection": {
          "debateSectionId": "dbsect_606",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_606",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_606.xml"
            },
            "pdf": null
          },
          "showAs": "Hospital Services"
        },
        "answerText": "",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "showAs": "Michael Moynihan"
        },
        "questionNumber": 707,
        "showAs": " 707. Deputy Michael Moynihan asked the Minister for Rural and Community Development to provide, since the formation of this Government, the total funding (EU and Exchequer) allocated to the LEADER programme over the 2021-2027 period inclusive of transitional finding in 2021-2022, in tabular form; and to outline Exchequer funding allocated to the programme in 2024 and 2025. [41246/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_707",
        "debateSection": {
          "debateSectionId": "dbsect_655",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_655",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_655.xml"
            },
            "pdf": null
          },
          "showAs": "Rural Schemes"
        },
        "answerText": " Minister for Rural and Community Development  The LEADER Programme is a key intervention of Our Rural Future, the Government’s Policy for rural development which aims to deliver a range of actions to rural communities over the lifetime of the policy. It supports a broad range of activities which aim to respond to the diversity of the local needs of our rural areas.  It is delivered through Local Action Groups (LAGs) across rural Ireland. A feature of the LEADER programme is that it is based on a community-led, bottom-up approach to rural development.  The total amount of funding allocated to the LEADER programme for the period of 2021-2027 is €250 million. This funding is made up of €70 million for the Transitional LEADER programme for the years 2021 and 2022, with the remaining €180 million allocated for the period 2023-2027 maintaining the level of funding for the programme in line with the corresponding 7 year programming period of the 2014-2020 LEADER programme. The funding is allocated to the LAGs at the outset of the programme to provide them with greater flexibility managing their budgets over the programming period. Funding is paid by my Department as costs are incurred and claims for payment submitted. I am confident that the level of funding allocated for the 2021-2027 programming period will be sufficient to meet the demand for grant funding from rural communities and businesses.  Table 1 below provides details of all LEADER expenditure under the 2014-2020 programme, the transitional programme and to date on the 2023-2027 LEADER programme. This relates to project funding, administration costs of the LAGs, including engagement with communities and their general running costs and the overhead supports to administer the programme at national level.  A provision of €44 million has been made in my Department’s Vote for 2024 for the delivery of the LEADER programme. In Budget 2025, €42 million has been allocated to the delivery of the programme.  I am satisfied that this level of funding will adequately cover all aspects of implementing the programme next year as the 2014-2022 programmes close and projects approved under the 2023-2027 programme complete and drawdown funding.  Table 1 – LEADER expenditure 2021 – October 2024     2021    2022    2023    2024 (to date)      €55,891,108    € 51,957,390    € 51,018,578    € 37,735,728    ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "question": {
        "house": {
          "houseNo": "33",
          "chamberType": "house",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil"
        },
        "by": {
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "showAs": "Michael Moynihan"
        },
        "questionNumber": 708,
        "showAs": " 708. Deputy Michael Moynihan asked the Minister for Rural and Community Development the Exchequer amount allocated between current and capital allocations in 2024 and 2025 to schemes and programmes (details supplied) in her Department, in tabular form. [41247/24] ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-15/pq_708",
        "debateSection": {
          "debateSectionId": "dbsect_656",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/dbsect_656",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-15/writtens/mul@/dbsect_656.xml"
            },
            "pdf": null
          },
          "showAs": "Departmental Expenditure"
        },
        "answerText": " Minister for Rural and Community Development  The Exchequer funding allocations provided to my Department are detailed each year in the Revised Estimate Volume. The 2024 Revised Estimate, which presents the figures in tabular form, is available here: www.gov.ie/en/collection/e20037-revised-estimates/ . It should be noted that the announcement of funding under each scheme takes place in the context of our multiannual funding envelopes, with funding announced in one year often being paid out in subsequent years as projects are delivered on the ground. The allocations made in the Revised Estimate for each year reflect expected demands under each area during the year, with funding potentially being moved between schemes depending on demand as the year progresses. Furthermore, as actual expenditure levels materialise, funding may be re-allocated across sub-heads through either virement or technical supplementary to deal with emerging priorities.  Budget 2025 saw my Department’s overall budget increase from €431 million in 2024 to €472 million in 2025. This represents a 9% increase on the previous year and demonstrates the Government’s continued commitment to both Our Rural Future, and to supporting vital programmes which address social exclusion and community development needs. This €472 million in funding for 2025 will provide €212 million for rural development and €260 million for community development activities, continuing to breathe new life into towns and villages and support the social and economic development of rural and urban communities. The Revised Estimate 2025, which will be published in December 2025, will provide the voted allocations for each funding areas. However, indicative plans for 2025 funds are available here: www.gov.ie/en/press-release/ab0cf-budget-2025-ministers-humphreys-and-joe-obrien-deliver-472-million-for-rural-and-community-development/ . These funding plans remain subject to change until the Revised Estimate 2025 is published and voted upon.  With regard to 2024 funding allocations for the specific schemes referenced:  • The A.4 Rural and Regional Supports sub-head has total funding of €17 million in current funding and €22.82 million in capital funding. This includes indicative capital funding of €13 million for LIS in 2024 and €8.7 million for CLAR in 2024. Within the current funding available, €8 million is provided for the walks scheme and related supports. Funding of €1 million was announced to support Agricultural shows.  • The A.5 LEADER sub-head has a capital allocation of €44 million for 2024.  • The A.6 Rural Regeneration and Development sub-head has total capital funding of €95 million for 2024, with indicative allocations of €60 million for the Rural Regeneration and Development Fund, €19 million for Town and Village Renewal, and €16 million for the Outdoor Recreation Infrastructure Scheme. Exact expenditure on each scheme will reflect progress on the projects approved over recent years.  • The B.11 sub-head has an allocation of €21 million with an indicative €16 million for the Community Centre Investment Fund and €5 million for small capital grants under the Community Enhancement/Local Enhancement Programme. Again final expenditure may differ from these estimates.  • The B.10 Library Development sub-head has an allocation of €1.1 million in current funding and €6.6 million in capital funding for 2024.  • The B.8 PEACE programme subhead has an allocation of €4.3m in current funding and €1.5m in capital funding.  • The B.14 Community Recognition Fund sub-head has an allocation of €10 million in capital funding for 2024, which is in addition to €20 million carried forward from 2023 for use in 2024.  • The B.12 Community Services Programme sub-head has a current allocation of €52.4 million for 2024.  • The B.4 Social Inclusion and Community Activation Programme and other supports sub-head mainly funds the SICAP programme, but with funding for other social inclusion initiatives and dog control is also within that area. For 2024 the SICAP programme has €51 million in core funding allocated, with an additional €10 million in non-core funding in the context of supporting new arrivals and the communities welcoming those arrivals. The dog control area has €0.6 million in current funding allocated from this sub-head.  • The B.3 subhead is for Supports for the Community and Voluntary Sectors, with €21 million available in 2024.  The overall allocations for 2024 and 2025, across the three high level programmes for my Department, are provided in the table below.     REV 2024 Allocations by Programme Area for DRCD (€m)    Current    Capital    Total      A - RURAL DEVELOPMENT, REGIONAL AFFAIRS & ISLANDS    38.533    166.887    205.420      B - COMMUNITY DEVELOPMENT    177.407    43.114    220.521      C - CHARITIES REGULATORY AUTHORITY    5.418    0.000    5.418      GROSS TOTAL FOR V42 - DRCD    221.358    210.001    431.359        Budget 2025 Indicative Allocations by Programme Area for DRCD (€m)    Current    Capital    Total      A - RURAL DEVELOPMENT, REGIONAL AFFAIRS & ISLANDS    42.330    170.384    212.714      B - COMMUNITY DEVELOPMENT    189.051    64.476    253.527      C - CHARITIES REGULATORY AUTHORITY    5.936    0.140    6.076      GROSS TOTAL FOR V42 - DRCD    237.317    235.000    472.317    ",
        "date": "2024-10-15"
      },
      "contextDate": "2024-10-15"
    },
    {
      "contextDate": "2024-10-10",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-10/writtens/mul@/dbsect_50.xml"
            }
          },
          "debateSectionId": "dbsect_50",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-10/writtens/dbsect_50",
          "showAs": "Ukraine War"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-10/pq_31",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 31,
        "showAs": " 31. Deputy Michael Moynihan asked the Tánaiste and Minister for Foreign Affairs if he will report on the full extent of Ireland’s support for Ukraine since Russia’s illegal invasion of February 2022; and if he will make a statement on the matter. [40321/24] ",
        "answerText": " Tánaiste and Minister for Foreign Affairs  I propose to take Questions Nos. 24, 31 and 42 together.  Ireland has been providing support to Ukraine both bilaterally and through the EU budget since the launch of the Russian full-scale invasion. Ireland makes extensive use of the multilateral system, and works with trusted partners on the ground to ensure a harmonised approach and enable the fast delivery of sustainable support.  On 4 September, I announced with the Taoiseach a significant new package of supports for Ukraine and its neighbours, worth €36 million. This will help provide essential humanitarian assistance, support rehabilitation and eventual reconstruction, and contribute to Ukraine's longer term goals, including peace, stability and political aspirations.  Partners to be supported include UN OCHA’s Ukraine Humanitarian Fund, which has reach across all regions of Ukraine, including significant funding to national Ukrainian organisations, and UNHCR for the provision of shelter and protection to millions of displaced people.  Financial commitments to the UN Population Fund and the World Health Organisation will contribute to work on health infrastructure and in the provision of support to vulnerable women. Ireland will also support the Red Cross family.  Ireland will contribute to the World Bank crisis facility special programme for Ukraine and Moldova, which is aimed at addressing urgent needs, and to the IMF Ukraine Capacity Development Fund supporting the Ukraine policy and reform agenda including EU accession.  A partnership with Lithuania will provide for the construction of bomb shelters in schools in Ukraine.  This announcement brings Ireland’s total support to Ukraine since February 2022 to over €380 million, including approximately €130 million in stabilisation and humanitarian supports and commitments of approximately €250 million of non-lethal military assistance under the European Peace Facility. Our military assistance to Ukraine is fully aligned with Ireland’s policy of military neutrality, and the commitment in the Programme for Government to the provision of non-lethal support.  Ireland has also been participating directly in the EU Military Assistance Mission in support of Ukraine (EUMAM Ukraine) following Government approval in February 2023. Through Ireland’s participation in EUMAM Ukraine, the Defence Forces have delivered training to over 600 Ukrainian Armed Forces personnel in training modules which include tactical combat casualty care/combat lifesaver, demining/mine clearance, and drill instruction training. The Defence Forces currently have one officer deployed in a senior staff position in the mission’s Operational Headquarters, which operates within the EU’s Military Planning and Conduct Capability in Brussels, while a further three Defence Forces personnel have also been deployed to the multi-national Special Training Command in Germany. Ireland, through the Department of Defence and the Defence Forces, has donated equipment which includes ready to eat meals and body armour from Defence Forces stocks, demining equipment (mine flails) and associated training, and 30 vehicles, consisting of pickup trucks, logistics vehicles and ambulances to the Ukrainian Armed Forces in June and July of this year.  Ireland is also supporting civilian security sector reform through the provision of eight civilian experts to the EU Advisory Mission in Ukraine.  Ireland has also welcomed over 110,000 Ukrainians under the Temporary Protection Directive.  Additionally, a number of significant decisions have been taken at EU level in recent months on opening accession negotiations, establishing the Ukraine Facility, creating a dedicated Ukraine Assistance Fund under the European Peace Facility, agreeing to use the profits from immobilised Russian sovereign assets to further support Ukraine, and on a 14th package of sanctions targeting Russia.  The Taoiseach visited Ukraine on 4 September. While in Kyiv, he met with President Zelenskyy and Prime Minister Shmyhal, and signed a comprehensive bilateral agreement on support and cooperation between Ireland and Ukraine. This new Agreement is a political and practical declaration of Ireland’s support to Ukraine as it defends its sovereignty and territorial integrity.  Together with our EU partners, Ireland is committed to supporting Ukraine for as long as it takes as it defends itself against Russian aggression. We will also continue to build support among global partners for a comprehensive, just and lasting peace in Ukraine, based on respect for the principles of the UN Charter and international law, and with justice and accountability at its heart. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-10-10",
        "by": {
          "showAs": "Michael Moynihan",
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26"
        }
      }
    },
    {
      "contextDate": "2024-10-10",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-10/writtens/mul@/dbsect_75.xml"
            }
          },
          "debateSectionId": "dbsect_75",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-10/writtens/dbsect_75",
          "showAs": "Ukraine War"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-10/pq_56",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 56,
        "showAs": " 56. Deputy Michael Moynihan asked the Tánaiste and Minister for Foreign Affairs the action he is taking in the context of the particularly horrific impact of Russia’s war on Ukraine on women and children; and if he will make a statement on the matter. [40320/24] ",
        "answerText": " Tánaiste and Minister for Foreign Affairs  Russia’s illegal and unprovoked war of aggression against Ukraine continues to cause devastating consequences for the Ukrainian people. Recognising the disproportionate impact of the war on women and children, Ireland will continue to prioritise the protection of all vulnerable groups and the prevention of sexual and gender based violence. Ireland also supports a gender-responsive and inclusive recovery effort in Ukraine.  Approximately 20,000 children have been identified by Ukraine as having been forcibly deported from their homes. The European Council has strongly condemned these actions. At the Summit on Peace in Ukraine, the Taoiseach joined calls for their return. As a member of the International Coalition for the Return of Ukrainian Children, we are engaging in discussions on how we can support its important work. Ireland is committed to working with partners, such as UNICEF and the ICRC, who play a key role in supporting the re-integration of children and wider family reunification. In 2024 Ireland is providing €23.5 million in humanitarian assistance for Ukraine, including €5 million to the ICRC, €3 million to the UNFPA and €2 million to UNICEF.  Ireland has consistently supported strong sanctions against Russia in response to its aggression in Ukraine, including a range of measures targeting individuals and entities involved in the forced transfer, deportation, and military indoctrination of children.  I note that such alleged crimes are the subject of arrest warrants issued by the International Criminal Court. Ireland has raised this issue in multilateral forums, in our national capacity and as part of the EU. We co-sponsored a resolution of Human Rights Council establishing a commission of inquiry to investigate all alleged violations and abuses of human rights, and violations of international humanitarian law in the context of Russia's aggression against Ukraine. We will continue to support accountability for Russia’s crimes in Ukraine. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-10-10",
        "by": {
          "showAs": "Michael Moynihan",
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26"
        }
      }
    },
    {
      "contextDate": "2024-10-08",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-08/writtens/mul@/dbsect_586.xml"
            }
          },
          "debateSectionId": "dbsect_586",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-08/writtens/dbsect_586",
          "showAs": "Health Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-08/pq_582",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 582,
        "showAs": " 582. Deputy Michael Moynihan asked the Minister for Health to provide an overview of funding, initiatives and capital works that have been approved and delivered in County Kerry since the current Government took up office in 2020; and if he will make a statement on the matter. [39953/24] ",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-10-08",
        "by": {
          "showAs": "Michael Moynihan",
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26"
        }
      }
    },
    {
      "contextDate": "2024-10-01",
      "question": {
        "by": {
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "showAs": "Michael Moynihan"
        },
        "date": "2024-10-01",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-01/pq_280",
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 265 and 280 together.  My Department is currently undertaking a focused review of the 2006 Wind Energy Development Guidelines. The review is addressing a number of key aspects of the Guidelines including noise, setback distance, shadow flicker, community obligation, community dividend and grid connections.  My Department, in conjunction with the Department of the Environment, Climate and Communications (DECC) which has primary responsibility for environmental noise matters, has been working to advance guidance on the noise aspect of Guidelines, which is highly technical in nature. The two Departments have been engaging on proposals regarding the measurement and assessment of noise from wind turbines to ensure they are robust and fit for purpose having regard to, inter alia, the revised 2030 target to generate up to 80% of our electricity from renewable sources.  Further to this engagement, DECC appointed noise consultants in May 2023 to inform any amendments to the noise aspect of the Guidelines. This work is substantially complete. My Department, in conjunction with DECC in respect of its environmental noise remit, will make any further changes to the draft Guidelines which are deemed necessary or appropriate in the wake of this work to ensure that the finalised Guidelines, once issued, are fit for purpose to provide guidance in line with renewable energy and climate targets, whilst having appropriate regard to the impacts of wind energy development, including in relation to noise annoyance.  In addition to work on the noise aspects of the Guidelines, the evolving policy and technical context including the new Planning and Development Bill 2023, which is expected to be enacted in the coming weeks, and the revision of the National Planning Framework reinforces the need to ensure that the finalised Guidelines, once issued, are fit for purpose.  As part of the review process, and in line with EU Directive requirements, a strategic environmental assessment (SEA) is being carried out on the draft Guidelines. As part of the SEA process, my Department intends to undertake a public consultation on updated draft Guidelines whereby all interested parties will have an opportunity to submit observations on the draft Guidelines. Finalised Guidelines will be prepared following detailed analysis and consideration of the submissions received during the consultation phase.  With regard to the finalisation of the review of the Wind Energy Development Guidelines, the Climate Action Plan 2024 - Annex of Actions sets out a timeline of Q1 2025 for publication of the final updated Guidelines. My Department is working towards meeting this commitment, having regard to the intended public consultation and the finalisation of associated reforms and reviews including the revision of the National Planning Framework. When finalised, the revised Guidelines will be issued under section 28 of the Planning and Development Act 2000, as amended or, subject to enactment of the Planning and Development Bill 2023, as a National Planning Statement, as appropriate. The current 2006 Wind Energy Development Guidelines remain in force, pending the finalisation of the review. ",
        "to": {
          "uri": null,
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 280. Deputy Michael Moynihan asked the Minister for Housing, Local Government and Heritage when he expects the new guidelines for wind farms to be published and enacted; and if he will make a statement on the matter. [39150/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_279",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-01/writtens/mul@/dbsect_279.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-01/writtens/dbsect_279",
          "showAs": "Wind Energy Guidelines"
        },
        "questionNumber": 280,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2024-10-01",
      "question": {
        "by": {
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "showAs": "Michael Moynihan"
        },
        "date": "2024-10-01",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-01/pq_567",
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  The Apprenticeship Incentivisation Scheme (AIS) was a measure implemented to assist apprentices due to the particular challenges caused by the Covid-19 pandemic. Similar to other Covid-19 measures, the AIS has ceased.  Under the Action Plan for Apprenticeship 2021 to 2025, all employers of apprentices receive financial support either through the direct payment of training allowances to craft apprentices during periods of off-the-job training or, in the case of Consortia-led apprenticeship, via the annual €2,000 training grant per apprentice provided to employers. ",
        "to": {
          "uri": null,
          "showAs": "Further and Higher Education",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 567. Deputy Michael Moynihan asked the Minister for Further and Higher Education, Research, Innovation and Science the estimated annual cost to the Exchequer of increasing the apprenticeship incentivisation scheme for employers to €5,000, €7,000 and €10,000. [38889/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_569",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-01/writtens/mul@/dbsect_569.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-01/writtens/dbsect_569",
          "showAs": "Apprenticeship Programmes"
        },
        "questionNumber": 567,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2024-10-01",
      "question": {
        "by": {
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "showAs": "Michael Moynihan"
        },
        "date": "2024-10-01",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-01/pq_568",
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  Apprenticeship funding is determined as a part of the annual Estimates process and is provided from the National Training Fund.  As part of the implementation of the national Action Plan for Apprenticeship 2021-2025, a €2,666 grant was available to employers in January 2022 on any national apprenticeship programme with a greater than 80% representation of a single gender who employ apprentices on the under-represented gender. It is paid directly to employers in two instalments. €1,333 is payable following completion of 6 months training by the apprentice. The second payment of €1,333 is payable following completion of 18 months training by the apprentice, eligibility is dependent on the gender profile represented by the previous year.  The Department is advised by the National Apprenticeship office who hold the data and administer the bursary that, based on a complete set of 2023 figures and registration, if a 50% threshold was applied, then 65 apprenticeship programmes would be eligible for females and 7 apprenticeship programmes for males.  This would total 1,545 individuals eligible to apply (1,118 female and 427 male based 2023 registrations) for the gender-based bursary for apprenticeship.  Applying an increase from €2,666 to €3,000 and assuming all those eligible applying, then this would pose a cost of c.€4.6 million to the National Training Fund. ",
        "to": {
          "uri": null,
          "showAs": "Further and Higher Education",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 568. Deputy Michael Moynihan asked the Minister for Further and Higher Education, Research, Innovation and Science the estimated annual cost to the Exchequer of raising the gender-based apprenticeship bursary to €3,000 and lowering the representation threshold to 50%. [38890/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_570",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-01/writtens/mul@/dbsect_570.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-01/writtens/dbsect_570",
          "showAs": "Apprenticeship Programmes"
        },
        "questionNumber": 568,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2024-10-01",
      "question": {
        "by": {
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "showAs": "Michael Moynihan"
        },
        "date": "2024-10-01",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-01/pq_569",
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  In 2024, funding of €500,000 has been provided for a bursary for underrepresented apprentices in education and training boards and in higher education institutes. This is called the Access and Inclusion bursary and is administered by the National Apprenticeship Office.  As of April, of this year, the National Apprenticeship Office has paid the Access and Inclusion bursary (€3,000 to each learner) to 42 recipients in the Technological University of the Shannon (TUS), Limerick, who attended 12-week full-time Access to Apprenticeship programme.  16 further learners on the TUS, Limerick programme and 16 to those on the TUS, Athlone, programme are expected to be paid this year, with Munster Technological University planning to commence the rollout of an Access to Apprenticeship programme in January 2025.  This is a significant part of achieving Action 8.3 of the the Action Plan for Apprenticeship 2021-2025 \"Apprenticeship for All”, one of the plans's five overarching objectives, which commits to deliver a bursary programme for apprentices who are experiencing socioeconomic disadvantage and who are from target groups, including lone parents, people with disabilities, Travellers and Roma. ",
        "to": {
          "uri": null,
          "showAs": "Further and Higher Education",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 569. Deputy Michael Moynihan asked the Minister for Further and Higher Education, Research, Innovation and Science the estimated annual cost to the Exchequer of boosting bursary funding to €500,000 for underrepresented apprentices in education and training boards and technical universities. [38891/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_571",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-01/writtens/mul@/dbsect_571.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-01/writtens/dbsect_571",
          "showAs": "Apprenticeship Programmes"
        },
        "questionNumber": 569,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2024-10-01",
      "question": {
        "by": {
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "showAs": "Michael Moynihan"
        },
        "date": "2024-10-01",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-01/pq_570",
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  Higher Education Institutions (HEIs) are autonomous institutions responsible for their own academic affairs including the curriculum and student numbers on individual courses. The costs incurred by a HEI in increasing student places on a particular course or establishing an additional course can vary depending on a variety factors including the type of course and the individual circumstances of the relevant HEI.Where additionally is required on courses or a new course is required, specific engagement with the sector and external stakeholders is very often required. This process allows for a deeper consideration of wider issues such as capacity, staffing, other supports, availability of placements, capital investment in buildings and equipment etc. It is therefore, not possible to definitively calculate the costs sought in the absence of a specific engagement with the sector.  The delivery of healthcare programmes is complex and requires multiple parts of the health and education systems working together.  It should be noted that in recent years there has been a substantial expansion of therapy and key healthcare places in Higher Education Institutions in Ireland. In July, Government approved the prioritisation of funding to support the expansion of training places in priority healthcare areas including Speech and Language Therapy and Occupational Therapy, as well as Physiotherapy.  From September this year additional places on Speech and Language Therapy and Occupational Therapy programmes in University of Galway have been created, and an undergraduate Occupational Therapy programme is also being introduced at University of Limerick. Further expansion next year will result in an overall 35% increase in places on therapy discipline programmes.  Additionality has been delivered in recent years with over 460 permanent new higher education healthcare places created in September 2023 in Irish HEIs, and further capacity created in Northern Ireland, where an additional 80 places in allied healthcare disciplines in Ulster University in September 2023 were created for students from this jurisdiction. These places include 28 in Occupational Therapy and 10 in Speech and Language Therapy. A similar arrangement is in train for September 2024.  Enhancing student capacity to meet projected workforce demand is a key consideration of workforce planning and is key to enabling further expansion on these programmes. Practice education placements are essential to support clinical skills development and the application of theory to patient care and attainment of regulatory required standards of proficiency where applicable.  Extensive engagement is ongoing between officials in the Department of Further and Higher Education, Research, Innovation and Science, and officials in the Department of Health, as well as the HSE and higher education sector. Work is underway on the oversight and infrastructure for clinical placements to enable further expansion. ",
        "to": {
          "uri": null,
          "showAs": "Further and Higher Education",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 570. Deputy Michael Moynihan asked the Minister for Further and Higher Education, Research, Innovation and Science the estimated annual cost to the Exchequer of doubling the number of speech and language therapy training places in third level; and the cost of doubling the number of occupational training places in third level. [38892/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_572",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-01/writtens/mul@/dbsect_572.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-01/writtens/dbsect_572",
          "showAs": "Third Level Costs"
        },
        "questionNumber": 570,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2024-10-01",
      "question": {
        "by": {
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "showAs": "Michael Moynihan"
        },
        "date": "2024-10-01",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-01/pq_571",
        "answerText": " Minister of State at the Department of Further and Higher Education, Research, Innovation and Science  I thank the Deputy for his question.  Based on latest data available, the cost of reducing the staff/student ratio in the higher education sector by one point is estimated at €77.5m. The cost of reducing the ratio by two and three points is estimated at €166m and €267m respectively. Calculations are based on the 2022/23 higher education sector enrolment figures for full time equivalent students (full and part-time) to all academic staff with an average salary figure of €100,000 used.  Further Education and Training (FET), on the other hand, encompasses a wide range of courses and programmes, ranging from Level 1 to Level 6 on the National Framework of Qualifications, i.e., from basic literacy programmes to apprenticeships. Different levels of engagement are required for the learner depending on their needs and the course requirements, e.g., full-time, part-time, short-term courses etc.  Consequently, it is not possible to give an accurate annual cost of reducing the staff/student ratios in further and higher education by one point, two points and three points.  However, as a high-level exercise and for illustrative purposes only, SOLAS have estimated that the cost of reducing the staff/student ratio in the FET sector by one point is estimated at €40m. The cost of reducing the ratio by two and three points is estimated at €85m and €150m respectively. This is based on PLC/Apprenticeship provision, the latest data available and prior to any further pay increases or back monies. In addition, costs will increase significantly if additional capacity and equipment is required to facilitate the changes in ratios. ",
        "to": {
          "uri": null,
          "showAs": "Further and Higher Education",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 571. Deputy Michael Moynihan asked the Minister for Further and Higher Education, Research, Innovation and Science the estimated annual cost to the Exchequer of reducing the staff/student ratios in further and higher education by one point, two points and three points. [38893/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_573",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-01/writtens/mul@/dbsect_573.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-01/writtens/dbsect_573",
          "showAs": "Third Level Staff"
        },
        "questionNumber": 571,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2024-10-01",
      "question": {
        "by": {
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "showAs": "Michael Moynihan"
        },
        "date": "2024-10-01",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-01/pq_572",
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  In 2023, my Department provided €2.2 million to Higher Education Institutions and Regional Colleges in Northern Ireland to fund mobilities for their full-time higher education students. ",
        "to": {
          "uri": null,
          "showAs": "Further and Higher Education",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 572. Deputy Michael Moynihan asked the Minister for Further and Higher Education, Research, Innovation and Science the estimated annual cost to the Exchequer of increasing funding for Northern Ireland students' EU mobilities to €4 million, €6 million and €8 million. [38894/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_574",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-01/writtens/mul@/dbsect_574.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-01/writtens/dbsect_574",
          "showAs": "Education Schemes"
        },
        "questionNumber": 572,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2024-10-01",
      "question": {
        "by": {
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "showAs": "Michael Moynihan"
        },
        "date": "2024-10-01",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-01/pq_573",
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  The Co-Centres Programme was established with the ambition of creating a dynamic research network across Ireland, Great Britain, and Northern Ireland, to deliver economic, societal, health and environmental impacts. Two Co-Centres are being funded by Taighde Eireann / Research Ireland, Northern Ireland’s Department of Agriculture, Environment and Rural Affairs (DAERA) and UK Research and Innovation (UKRI) – a Co-Centre for Sustainable Food Systems and a Co-Centre for Climate + Biodiversity + Water.  The Co-Centres, through co-operation and collaboration with industry and other key stakeholders, will bring scale, standing and cohesion to the research and innovation ecosystem across jurisdictions to facilitate a STEM-led multi-disciplinary programme of research and innovation. The Co-Centre Programme’s research may involve an inter-disciplinary approach across the Arts, Humanities and Social Sciences and shall be informed by a process of stakeholder engagement (including with end-users, policy makers and civil society).  Currently the Irish Exchequer has committed up to €35 million to the Co-Centres to be spent over a 6 year term, which commenced on the 1st January 2024. The Northern Ireland Department of Agriculture, Environment and Rural Affairs has committed up to £17m and UK Research and Innovation has committed up to £12m. A total of €74m has therefore been allocated to this initiative.  To bring the programme to a total spend of €100m would require an additional €26m. However, as this would be subject to negotiation with the other jurisdictions participating in the project, as well as industry co-funders, it is not possible to specify the quantum of funding that would be required of the State of such a change. ",
        "to": {
          "uri": null,
          "showAs": "Further and Higher Education",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 573. Deputy Michael Moynihan asked the Minister for Further and Higher Education, Research, Innovation and Science the estimated annual cost to the Exchequer of increasing co-centres programme funding to €100 million for all-island research and innovation hubs. [38895/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_575",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-01/writtens/mul@/dbsect_575.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-01/writtens/dbsect_575",
          "showAs": "Research Funding"
        },
        "questionNumber": 573,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2024-10-01",
      "question": {
        "by": {
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26",
          "showAs": "Michael Moynihan"
        },
        "date": "2024-10-01",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-10-01/pq_574",
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  The North South Research Programme (NSRP) is funded by the Government’s Shared Island initiative and delivered by the HEA on behalf of Department of Further and Higher Education, Research, Innovation and Science.  The first round under the North South Research Programme was allocated in October 2022. Funding, amounting to €37.28 million, was awarded on the basis of excellence, assessed through a rigorous and independent international peer-review process. 62 projects were awarded funding across three programme strands.  Arrangements for a second round of funding under the NSRP is currently being finalised. ",
        "to": {
          "uri": null,
          "showAs": "Further and Higher Education",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 574. Deputy Michael Moynihan asked the Minister for Further and Higher Education, Research, Innovation and Science the estimated annual cost to the Exchequer of increasing the North-South research programme and shared island fund to €50 million. [38898/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_576",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-01/writtens/mul@/dbsect_576.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-10-01/writtens/dbsect_576",
          "showAs": "Research Funding"
        },
        "questionNumber": 574,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2024-09-24",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-24/writtens/mul@/dbsect_403.xml"
            }
          },
          "debateSectionId": "dbsect_403",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-24/writtens/dbsect_403",
          "showAs": "Health Services Staff"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-09-24/pq_400",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 400,
        "showAs": " 400. Deputy Michael Moynihan asked the Minister for Children, Equality, Disability, Integration and Youth the progress of pay increases for section 39 employees following the pay agreement reached in October 2023; and if he will make a statement on the matter. [37957/24] ",
        "answerText": " Minister of State at the Department of Health  This government acknowledges the roles provided by essential workers in community and voluntary organisations who deliver health and social care services to many people across the country.  To support the sustainability of services, including the ability of organisations to recruit and retain staff, the government is proactively engaging with a Workplace Relations Commission (WRC) process, with unions representing various organisations across these sectors.  The agreement reached last October committed to a significant increase of investment in the sectors, amounting to a phased 8% increase in funding for pay for staff in Section 39, Section 56 and Section 10 voluntary organisations.  Significant interim payments were made to qualifying organisations in late January/early February 2024 and the HSE is currently in the process of administering the balance of funding to eligible organisations.  According to the HSE:  At 03 September, of 1,166 organisations with whom communication was made, 680 have made submissions; 333 organisations (including the largest organisations in the sector) have exited the process; so far, additional funding equating to a cumulative value of €69.62m, relating to uplifts for 29,998 workers has been approved.  It is the objective of the HSE to make all due payments without delay so that employees of these service provider organisations can access their entitlements as soon as possible. Employers may only use the additional funding to increase pay of their staff. The responsibility is on employers to apply for this available funding and pass on increases to eligible staff. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-09-24",
        "by": {
          "showAs": "Michael Moynihan",
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26"
        }
      }
    },
    {
      "contextDate": "2024-09-24",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-24/writtens/mul@/dbsect_408.xml"
            }
          },
          "debateSectionId": "dbsect_408",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-24/writtens/dbsect_408",
          "showAs": "Departmental Policies"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-09-24/pq_405",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 405,
        "showAs": " 405. Deputy Michael Moynihan asked the Minister for Health to provide an update on the implementation of the Law Reform Commission report on a framework for adult safeguarding; and if he will make a statement on the matter. [37881/24] ",
        "answerText": " Minister of State at the Department of Health  Safeguarding at-risk adults against abuse is of paramount importance and is taken very seriously by the Government. I have welcomed the independent Law Reform Commission’s Report on ‘A Regulatory Framework for Adult Safeguarding’ published in April. The Report sets out comprehensive and wide-ranging recommendations that have relevance across a range of Government Departments, including but not exclusive to the Department of Health. I anticipate that the Commission's Report will be carefully considered by all relevant Departments in relation to their respective functions. The Department of Health will continue to work in partnership with other relevant Departments in this regard.  Separately, the Department of Health, in liaison with the Department of Children, Equality, Disability, Integration and Youth, is at an advanced stage of developing a national policy on adult safeguarding specifically in respect of the health and social care sector, in order to further strengthen existing protections in this sector. A public consultation closed in April and the consultation feedback report is currently being prepared by the Institute of Public Health. It is expected that these sectoral policy proposals will be finalised and brought before Government around the end of this year, informed by the consultation process and also the Law Reform Commission’s report. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-09-24",
        "by": {
          "showAs": "Michael Moynihan",
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26"
        }
      }
    },
    {
      "contextDate": "2024-09-19",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-19/writtens/mul@/dbsect_79.xml"
            }
          },
          "debateSectionId": "dbsect_79",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-19/writtens/dbsect_79",
          "showAs": "Housing Policy"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-09-19/pq_63",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 63,
        "showAs": " 63. Deputy Michael Moynihan asked the Minister for Housing, Local Government and Heritage the measures he is taking to help first-time house buyers; the impact of these over the past twelve months; and if he will make a statement on the matter. [36748/24] ",
        "answerText": " Minister for Housing, Local Government and Heritage  First-time buyers are being supported under Housing for All and activity is continuing to strengthen, with the number of first-time buyers in the year to June 2024 some 28% higher than the same period in 2021 when Housing for All was introduced.  A number of key measures have been put in place under the Plan, including, for example, the First Home Scheme which supports first time buyers who wish to purchase new homes anywhere in the country, with 4,856 families and individuals approved for funding since the launch of the Scheme to end Quarter 2 2024.  In addition, the Local Authority Affordable Purchase Scheme assists first-time buyers in purchasing Local Authority delivered new homes, with approval already given for more than three thousand affordable purchase homes across 21 local authorities and with 854 homes already delivered to the end of the first quarter in 2024.  The government has also extended the Help to Buy scheme which has been a significant support for first time buyers of new homes. To 31 August 2024, 49,684 first-time buyers have benefited from the scheme.  For those who need help accessing a mortgage, the Local Authority Home Loan is a Government-backed mortgage, available to first time buyers and fresh start applicants, who cannot get sufficient funding from commercial banks to purchase or build a home.  The Vacant Property Refurbishment Grant, offers supports to those bringing vacant and derelict properties back into use as homes, including for first-time buyers. To date 9,600 applications have been received and 6,400 approved for this Scheme.  The suite of measures under the Plan are directly supporting first time buyers to access homeownership. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-09-19",
        "by": {
          "showAs": "Michael Moynihan",
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26"
        }
      }
    },
    {
      "contextDate": "2024-09-19",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-19/debate/mul@/dbsect_21.xml"
            }
          },
          "debateSectionId": "dbsect_21",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-19/debate/dbsect_21",
          "showAs": "Vacant Properties"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-09-19/pq_110",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 110,
        "showAs": " 110. Deputy Michael Moynihan asked the Minister for Housing, Local Government and Heritage if he will report on the operation of the Croí Cónaithe scheme; the uptake of the scheme in County Cork; and if he will make a statement on the matter.  [36749/24] ",
        "answerText": " Deputy David Stanton  This is an opportunity for the Minister to give some information to Members of the House on the number of vacant properties that could be used for housing in this State, or an estimation to that effect. That includes commercial properties. Second, how is the Department working with the Department of Finance on the administration of the vacant property tax? Is there an overall view of what the figures are to date? \n Minister of State at the Department of Housing, Local Government and Heritage (Deputy Malcolm Noonan)  I propose to take Questions Nos. 54 , 66 and 110 together.  Tackling vacancy is a key priority for this Government. The vacant homes action plan, which was published in January 2023, built on pathway 4 of Housing for All and set out the various actions that were being pursued to return vacant properties back into use as homes. Earlier this year, the Minister published an update on the action plan, which shows the significant progress that is being made. Data regarding vacant properties is available from a number of sources such as census and GeoDirectory publications. More recently, the CSO has published an indicator of residential vacancy using electricity consumption data. My Department has engaged with the CSO regarding this indicator. While varying levels and rates of vacancy are indicated in the different data sources, the overall trend is downwards and vacancy levels in residential properties are reducing. It is a very different picture in terms of vacant commercial properties. A vacancy survey project, supported by my Department, commenced in December 2022. Its objective is to provide local authorities with a database of vacant and derelict properties in their administrative area, which they can update on an ongoing basis and use to engage with property owners to bring them back into use as homes. This also supports local authorities in taking a proactive, systematic and co-ordinated approach to the activation of vacant and derelict properties, which is required under the new compulsory purchase order, CPO, activation programme, which my Department launched in April 2023. The programme includes guidance and supports for local authorities to actively use their legislative powers to compulsorily acquire vacant and derelict properties where engagement with owners has been unsuccessful in activating the return of the property to use. It is a complex process, but good progress is certainly being made across all local authorities in this regard.  Another one of the suite of measures introduced to address vacancy by this Government is the vacant home tax introduced in budget 2023. The tax applies to residential properties that are occupied for less than 30 days in a 12-month period. The tax aims to increase the supply of homes for rent or purchase, rather than focusing on simply raising revenue. As is the case for other taxes, the vacant home tax is administered and collected by the Office of the Revenue Commissioners. My Department does not have a role in the administration of this tax. However, my officials are in regular contact with the Department of Finance regarding policy on addressing vacancy and the vacant homes action plan.  The vacant property refurbishment grant, under the Croí Cónaithe towns fund, is another important measure in supporting the return of vacant and derelict properties into use. A grant to the value of €50,000 is available for the refurbishment of vacant properties into a home or rental property, with a top-up grant of €20,000 available for derelict properties. More than 9,600 grant applications have been received to date with more than 6,400 approved. The number of grants drawn down has increased significantly this year and more than 737 grants have been paid nationwide. We expect that to ramp up significantly toward the end of this year.  The level of interest in the grant in Cork has been significant, with the county having the highest number of applications received nationally. Between Cork city and county, in excess of 1,100 applications have been received, more than 820 applications approved and 66 grants paid to date. This number of grants issued is expected to increase significantly in the coming months as refurbishment works are completed. My Department publishes data on the grant on its website on a quarterly basis, which includes breakdowns by local authority. I will arrange for the relevant web link to be circulated with the Official Record. The grant is making a real impact in addressing vacancy and is making the purchase and refurbishment of these properties a more affordable option for those seeking to purchase their own home. I will come back in with a supplementary reply on the local authority purchase and renovation loan, which again, is another measure that is proving to be transformative. \n Deputy David Stanton  I thank the Minister of State for his response and recognise the work that is being carried out here. Does he have any figures with respect of how many actual properties are vacant in the State in the moment that could be used for housing from this database? Is that database publicly available? Will he comment on the top-up grant for derelict properties? We have numbers for the vacant property refurbishment grant, but how many of those also include the top-grant? How many applications are for the vacant property refurbishment grant on its own? Will the Minister of State please get those figures per county for me? Could he comment on the role of the vacant homes officers? The Oireachtas is making money available to fund those at local authority level. Is there a condition attached to that funding that those roles will be exclusively focused on vacant properties and nothing else? \n Deputy Malcolm Noonan  The GeoDirectory database for quarter 2 2024 classifies 82,031 dwellings as vacant on a national vacancy rate of 3.9%. This remains a record low. The report showed that vacancy rates had decreased in 19 counties.  The database published worrying figures for commercial vacancy. There are crisis levels of vacancy in many towns and villages across the country. In County Sligo, it is 20.5%; County Donegal, 19.4%; County Galway, 18.5%; County Limerick, 17.5%; and County Leitrim 17.5%. This is of real concern and this is something that local authorities, collectively with town teams, need to get a handle on, along with the town centre first officers that have been put in place, as well as vacancy officers. That is a hugely important piece of work that needs to be addressed. If that requires using a bit of creativity around bring commercial premises back into full occupancy and looking at returning shops to full occupancy, issues like that should be given consideration. We see pilots but that needs to be ramped up. We are seeing huge changes across retail and these are the resulting figures.  Separately, on the rural vacant properties, we will get back to the Deputy on that. I do not have the data relating to the top-up grant but as I said, the 730 grants have been paid out and we anticipate a very significant level of drawdown. The heritage side of our Department has put an additional grant in place with regard to conservation advice, particularly for older, traditional buildings. \n Deputy David Stanton  Could the Minister of State let me know at some stage which local authorities are using the funding provided by the Oireachtas to fund vacant homes officers? Which of those are doing that exclusively so that, for example, the vacant homes job is not number ten on a list of other works they have got to do? Is that a condition attached to the funding we are providing to the local authorities? My sense is that these vacant homes officers are doing ten other jobs as well, and that should not be the case.  The Minister of State mentioned that his Department works with Revenue and the Department of Finance. Could he comment on the response I received from the Minister for Finance, Deputy Chambers in June? He told me that 6,400 properties have been declared vacant, and approximately 3,700 of those have a liability to the vacant homes tax. That is a long way away from the 82,000 that the Minister of State just commented on there, which I assume are just homes. Why is there such a huge discrepancy? I know it is self-declared but surely we are missing a trick in this regard in that if we had a link between the two Departments, we could actually gather more tax and encourage people to carry out work. \n Deputy Violet-Anne Wynne  The Minister of State has pointed to a reduction in other counties. That is not the case in Clare, which has a huge vacancy rate. Shannon, once again, had the highest rate of commercial vacancy in the county at 29.8%, which is the highest in Munster and the third highest nationwide. It is unchanged again for a second year in Kilrush at 24.5%. There is no hotel there and has not been for many years. GeoDirectory shows that both towns are well above average when it comes to empty industrial buildings. Shannon and Dublin are at the national average of 14%, and Kilrush is at 10%. Meanwhile, Clare County Council will say that there is too much competition for accommodation in the county to source and create, for example, emergency accommodation or the likes of Clann Nua for the likes of Kilrush town. \n Deputy Malcolm Noonan  I note the comments made by Deputy Wynne.  On the figures I have for Cork city and county, Cork county has 747 applications received for the vacant property refurbishment grant, with 478 approved and 76 rejected, and 26 grants have been paid out on completion of works. The figures for Clare are 401 received, 234 approved, 31 rejected and 16 paid out on completion of works. Again, I wish to highlight the local authority purchase and renovation loan, which gives a bridging loan to make up the difference of the grant that can be paid back on completion of works.  Specifically on the question raised by Deputy Stanton, the vacant homes officer role is in every local authority and is a full-time, exclusive role to work specifically on vacant homes. The Deputy is shaking his head but that is the job description and that is their job. It is an important job. Their role is to work with the town centre first officer and the town teams, if the town team is established in each local authority area. It is vitally important that the role is specifically for that purpose in each local authority. It is critically important that this be their job because there is a huge task of work ahead in that regard. ",
        "questionType": "oral",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-09-19",
        "by": {
          "showAs": "Michael Moynihan",
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26"
        }
      }
    },
    {
      "contextDate": "2024-09-18",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-18/writtens/mul@/dbsect_103.xml"
            }
          },
          "debateSectionId": "dbsect_103",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-18/writtens/dbsect_103",
          "showAs": "Bus Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-09-18/pq_115",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 115,
        "showAs": " 115. Deputy Michael Moynihan asked the Minister for Transport for an update on revised services on Bus Éireann route 243, covering Bweeng and Grenagh; and if he will make a statement on the matter. [36006/24] ",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  The query raised by the Deputy is an operational matter for Bus Éireann. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-09-18",
        "by": {
          "showAs": "Michael Moynihan",
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26"
        }
      }
    },
    {
      "contextDate": "2024-09-18",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-18/writtens/mul@/dbsect_594.xml"
            }
          },
          "debateSectionId": "dbsect_594",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-18/writtens/dbsect_594",
          "showAs": "Assisted Human Reproduction"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-09-18/pq_640",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 640,
        "showAs": " 640. Deputy Michael Moynihan asked the Minister for Health if he will consider changing the criteria for publicly funded IVF treatment, to allow couples with a child to avail of this service; the reasons for the criteria currently in place; and if he will make a statement on the matter. [36007/24] ",
        "answerText": " Minister for Health  As the Deputy may be aware, a commitment to “introduce a publicly funded model of care for fertility treatment” is included in the Programme for Government.  The Model of Care for Fertility was developed by the Department of Health in conjunction with the HSE’s National Women & Infants Health Programme (NWIHP) in order to ensure that fertility-related issues are addressed through the public health system at the lowest level of clinical intervention necessary.  This Model of Care comprises three stages, starting in primary care (i.e., GPs) and extending into secondary care (i.e., the six Regional Fertility Hubs located across the country) and then, where necessary, AHR (assisted human reproduction) treatment (e.g., IVF (in-vitro fertilisation) and ICSI (intra-cytoplasmic sperm injection)), with patients being referred onwards through structured pathways.  Phase One of the roll-out of the Model of Care has involved the establishment, at secondary care level, of six Regional Fertility Hubs within maternity networks covering the entire country, in order to facilitate the management of a significant proportion of patients presenting with fertility-related issues at this level of intervention. Patients are referred by their GPs to their local Regional Fertility Hub, which provides a range of treatments and interventions.  Phase Two of the roll-out of the Model of Care relates to the introduction of AHR treatment, including IVF, provided through the public health system at tertiary level.  Funding of €30m was made available in 2024 to support access to AHR treatment via HSE-approved private providers. As well as IVF and ICSI, this allocation is also being used to provide, initially through private clinics, IUI (intrauterine insemination), which can, for certain cohorts of patients, be a potentially effective, yet less complex and less intrusive form of treatment.  Referrals for AHR treatment by private providers commenced in the week beginning September 25th 2023. Criteria prospective patients should meet in order to access fully-funded AHR services and the services to be initially funded were agreed by the Department and the HSE and subsequently approved by Government in July 2023. They are very much in keeping with those applied in other jurisdictions, even though in most European countries, for instance, such treatments are only partially funded and require often significant out-of-pocket payments by patients. More details on public fertility services, including information on the publicly-funded AHR treatment initiative, are available from the HSE at: www2.hse.ie/conditions/fertility-problems-treatments/fertility-treatment/   It was proposed that, in order to be eligible for public funding, at least one intending parent must have no living child, in respect of which he or she is officially recognised by the State as being the parent. This would include both biological and adopted children, for instance, but not necessarily children born through surrogacy or a donor-assisted human reproduction procedure.  The rationale for limiting treatment at the initial stage to couples/individuals who have no existing children is based largely on the concept on prioritising the utilisation of finite resources on those who have hitherto been unable to start a family. This type of criterion is used in a number of jurisdictions.  It was pragmatic to allow the service to operate for a period of time before considering any changes to existing criteria. Now that the service has been in operation for almost one year, it will afford us the opportunity to take stock and review the initiative, in the context of determining if there are to be changes to the access criteria, the specific services being provided, or any other aspect of the current system.  I want to reassure the Deputy that my Department and the Government are focused, through the full implementation of the Model of Care for Fertility, on ensuring that patients receive care at the appropriate level of clinical intervention and then those requiring, and eligible for, advanced AHR treatment such as IVF will be able to access same through the public health system. The underlying aim of the policy is to provide a model of funding for AHR, within the broader new AHR regulatory framework, is to improve accessibility to AHR treatments, while at the same time embedding safe and appropriate clinical practice and ensuring the cost-effective use of public resources. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-09-18",
        "by": {
          "showAs": "Michael Moynihan",
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26"
        }
      }
    },
    {
      "contextDate": "2024-09-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-09/writtens/mul@/dbsect_79.xml"
            }
          },
          "debateSectionId": "dbsect_79",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-09/writtens/dbsect_79",
          "showAs": "Energy Infrastructure"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-09-09/pq_81",
        "to": {
          "roleType": null,
          "showAs": "Environment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 81,
        "showAs": " 81. Deputy Michael Moynihan asked the Minister for the Environment, Climate and Communications the steps being taken to alleviate and respond to concerns about battery energy storage systems and the long term safety and security of these projects; and if he will make a statement on the matter. [34057/24] ",
        "answerText": " Minister for the Environment, Climate and Communications  I propose to take Questions Nos. 81 to 83, inclusive, and 128 together.  The Electricity Storage Policy Framework for Ireland was published on my departments website on Thursday the 4th of July. The Policy Framework addresses the role of grid-scale electricity storage on the grid network in the immediate and near term, outlining the present roles, technical processes, market positions and regulatory structures of electricity storage in Ireland.  Chapter 4 of the Policy Framework provides an overview of the existing safety and regulatory framework in place for grid scale electricity storage systems, including battery electricity storage systems (BESS) in the European and Irish contexts. The chapter also provides the roles and remits of various regulatory authorities and organisations in relation to standards, planning, construction, licensing, and safety of grid scale electricity storage systems in Ireland.  It is important to note that different aspects of the safety of (battery) electricity storage systems are handled by different sets of regulations, agencies and Departments. While the policy framework delivers an overview it does not address the specifics of how each institution or Department implements their remits, this is a matter for each institution, their governing legislation and the relevant Department, not the Department of the Environment, Climate and Communications.  For product standards, Ireland conforms to the European (EN) standards as set out by the European committee for standardisation (CEN), the European committee for electrotechnical standardisation (CENELEC) and the European telecommunication standards institute (ETSI). The National Standards Authority Ireland (NSAI) works to ensure the adoption of European standards and to ensure suitable standards across the entire value chain of all electricity storage system technologies in Ireland. The National Standards Authority Ireland (NSAI) is under the remit of the Department of Enterprise, Trade and Employment, as too is the Health and Safety Authority.  Battery electricity storage systems are subject to the same environmental controls as any other industrial or technical activity. The planning, construction and operation of these installations is subject to EU and Irish environmental rules enforced by the Environmental Protection Agency (EPA) and the planning authorities, either the relevant local authority or An Bord Pleanála.  Where an installation which holds an EPA licence proposes to install a battery electricity storage system, the installation should contact the EPA and may require a licence alteration or licence review. Licensable activities which also propose installation of battery electricity storage system will have the storage infrastructure assessed as part of the licence assessment and the conditions of any licence granted will apply to the licensable activity and the electricity storage infrastructure.  Battery electricity storage systems are also subject to the requirement for planning permission under the Planning and Development Act 2000 and associated regulations. The planning authorities ensure that battery electricity storage installations are planning legislation compliant. The local/planning authority plays a significant role in relation to electricity storage facility developments in its capacity as planning authority, building authority and fire authority.  The planning authorities assess individual electricity storage planning applications with recourse to all relevant documentation, including regional spatial and economic strategies and development plans, in line with the National Planning Framework. Principal assessment criteria, in addition to compliance with national, regional and local policies, will depend on the specific electricity storage project under review and the proposed location but considerations include: the most efficient use of land and infrastructure; the visual impacts of storage units as well as potential environmental / ecological and fire safety risks posed by electricity storage projects in the proposed location.  The National Directorate for Fire and Emergency Management (NDFEM) and County Fire Officers work with planning authorities to ensure that Battery storage installations are designed and built in a way the ensures fire safety. Under Section 13 of the Fire Services Acts 1981 & 2003, Fire Authorities may advise a planning authority in relation applications for planning permission for development and permission for the retention of structures, under Section 34 (which relates to permission for development and for the retention of structures) of the Planning and Development Act 2000.  Engagement with regard to the National Directorate for Fire and Emergency Management (NDFEM) as well as matters for Local (planning) authorities and An Bord Pleanála should in the first instance be addressed to the Department of Housing, Local Government and Heritage.  The Commission for the Regulation of Utilities (CRU) established by the 1999 Electricity Regulation Act, has regarding licensing, charging and market incentives for electricity undertakings, commenced a review of the regulatory treatment of electricity storage systems. The CRU is responsible inter alia, for the licensing of electricity storage, the regulation of electricity storage in the electricity market, electricity storage grid connections, including Hybrid co-location of electricity storage assets with renewable generation assets. Under Section 14(1)(n) (as amended by the Renewable Energy Regulation S.I. 20/2022) CRU are now authorised to license electricity storage systems. Further, service providers of electricity storage systems (in their capacity as generators) are also required to apply for an Authorisation to Construct (under Section 16).  Public confidence in our electricity grid system and the electricity storage systems which serve the grid infrastructure are paramount to this Government. To that end there is ongoing engagement between Government departments and relevant stakeholders on the implementation of any new regulation relevant to the safety of (battery) electricity storage systems. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-09-09",
        "by": {
          "showAs": "Michael Moynihan",
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26"
        }
      }
    },
    {
      "contextDate": "2024-09-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-09/writtens/mul@/dbsect_79.xml"
            }
          },
          "debateSectionId": "dbsect_79",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-09/writtens/dbsect_79",
          "showAs": "Energy Infrastructure"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-09-09/pq_82",
        "to": {
          "roleType": null,
          "showAs": "Environment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 82,
        "showAs": " 82. Deputy Michael Moynihan asked the Minister for the Environment, Climate and Communications to detail the monitoring and regulation of battery energy storage systems; who has ultimate responsibility for the safe management of these systems and if the appropriate equipment and facilities are available to deal with fires of this nature; and if he will make a statement on the matter. [34058/24] ",
        "answerText": " Minister for the Environment, Climate and Communications  I propose to take Questions Nos. 81 to 83, inclusive, and 128 together.  The Electricity Storage Policy Framework for Ireland was published on my departments website on Thursday the 4th of July. The Policy Framework addresses the role of grid-scale electricity storage on the grid network in the immediate and near term, outlining the present roles, technical processes, market positions and regulatory structures of electricity storage in Ireland.  Chapter 4 of the Policy Framework provides an overview of the existing safety and regulatory framework in place for grid scale electricity storage systems, including battery electricity storage systems (BESS) in the European and Irish contexts. The chapter also provides the roles and remits of various regulatory authorities and organisations in relation to standards, planning, construction, licensing, and safety of grid scale electricity storage systems in Ireland.  It is important to note that different aspects of the safety of (battery) electricity storage systems are handled by different sets of regulations, agencies and Departments. While the policy framework delivers an overview it does not address the specifics of how each institution or Department implements their remits, this is a matter for each institution, their governing legislation and the relevant Department, not the Department of the Environment, Climate and Communications.  For product standards, Ireland conforms to the European (EN) standards as set out by the European committee for standardisation (CEN), the European committee for electrotechnical standardisation (CENELEC) and the European telecommunication standards institute (ETSI). The National Standards Authority Ireland (NSAI) works to ensure the adoption of European standards and to ensure suitable standards across the entire value chain of all electricity storage system technologies in Ireland. The National Standards Authority Ireland (NSAI) is under the remit of the Department of Enterprise, Trade and Employment, as too is the Health and Safety Authority.  Battery electricity storage systems are subject to the same environmental controls as any other industrial or technical activity. The planning, construction and operation of these installations is subject to EU and Irish environmental rules enforced by the Environmental Protection Agency (EPA) and the planning authorities, either the relevant local authority or An Bord Pleanála.  Where an installation which holds an EPA licence proposes to install a battery electricity storage system, the installation should contact the EPA and may require a licence alteration or licence review. Licensable activities which also propose installation of battery electricity storage system will have the storage infrastructure assessed as part of the licence assessment and the conditions of any licence granted will apply to the licensable activity and the electricity storage infrastructure.  Battery electricity storage systems are also subject to the requirement for planning permission under the Planning and Development Act 2000 and associated regulations. The planning authorities ensure that battery electricity storage installations are planning legislation compliant. The local/planning authority plays a significant role in relation to electricity storage facility developments in its capacity as planning authority, building authority and fire authority.  The planning authorities assess individual electricity storage planning applications with recourse to all relevant documentation, including regional spatial and economic strategies and development plans, in line with the National Planning Framework. Principal assessment criteria, in addition to compliance with national, regional and local policies, will depend on the specific electricity storage project under review and the proposed location but considerations include: the most efficient use of land and infrastructure; the visual impacts of storage units as well as potential environmental / ecological and fire safety risks posed by electricity storage projects in the proposed location.  The National Directorate for Fire and Emergency Management (NDFEM) and County Fire Officers work with planning authorities to ensure that Battery storage installations are designed and built in a way the ensures fire safety. Under Section 13 of the Fire Services Acts 1981 & 2003, Fire Authorities may advise a planning authority in relation applications for planning permission for development and permission for the retention of structures, under Section 34 (which relates to permission for development and for the retention of structures) of the Planning and Development Act 2000.  Engagement with regard to the National Directorate for Fire and Emergency Management (NDFEM) as well as matters for Local (planning) authorities and An Bord Pleanála should in the first instance be addressed to the Department of Housing, Local Government and Heritage.  The Commission for the Regulation of Utilities (CRU) established by the 1999 Electricity Regulation Act, has regarding licensing, charging and market incentives for electricity undertakings, commenced a review of the regulatory treatment of electricity storage systems. The CRU is responsible inter alia, for the licensing of electricity storage, the regulation of electricity storage in the electricity market, electricity storage grid connections, including Hybrid co-location of electricity storage assets with renewable generation assets. Under Section 14(1)(n) (as amended by the Renewable Energy Regulation S.I. 20/2022) CRU are now authorised to license electricity storage systems. Further, service providers of electricity storage systems (in their capacity as generators) are also required to apply for an Authorisation to Construct (under Section 16).  Public confidence in our electricity grid system and the electricity storage systems which serve the grid infrastructure are paramount to this Government. To that end there is ongoing engagement between Government departments and relevant stakeholders on the implementation of any new regulation relevant to the safety of (battery) electricity storage systems. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-09-09",
        "by": {
          "showAs": "Michael Moynihan",
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26"
        }
      }
    },
    {
      "contextDate": "2024-09-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-09/writtens/mul@/dbsect_79.xml"
            }
          },
          "debateSectionId": "dbsect_79",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-09/writtens/dbsect_79",
          "showAs": "Energy Infrastructure"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-09-09/pq_83",
        "to": {
          "roleType": null,
          "showAs": "Environment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 83,
        "showAs": " 83. Deputy Michael Moynihan asked the Minister for the Environment, Climate and Communications if he is satisfied that there is a robust safety framework and system of regulation in place for battery energy storage systems; if any action is being taken to address the concerns of residents living close to these projects, to provide reassurance about the safety of these projects; and if he will make a statement on the matter. [34059/24] ",
        "answerText": " Minister for the Environment, Climate and Communications  I propose to take Questions Nos. 81 to 83, inclusive, and 128 together.  The Electricity Storage Policy Framework for Ireland was published on my departments website on Thursday the 4th of July. The Policy Framework addresses the role of grid-scale electricity storage on the grid network in the immediate and near term, outlining the present roles, technical processes, market positions and regulatory structures of electricity storage in Ireland.  Chapter 4 of the Policy Framework provides an overview of the existing safety and regulatory framework in place for grid scale electricity storage systems, including battery electricity storage systems (BESS) in the European and Irish contexts. The chapter also provides the roles and remits of various regulatory authorities and organisations in relation to standards, planning, construction, licensing, and safety of grid scale electricity storage systems in Ireland.  It is important to note that different aspects of the safety of (battery) electricity storage systems are handled by different sets of regulations, agencies and Departments. While the policy framework delivers an overview it does not address the specifics of how each institution or Department implements their remits, this is a matter for each institution, their governing legislation and the relevant Department, not the Department of the Environment, Climate and Communications.  For product standards, Ireland conforms to the European (EN) standards as set out by the European committee for standardisation (CEN), the European committee for electrotechnical standardisation (CENELEC) and the European telecommunication standards institute (ETSI). The National Standards Authority Ireland (NSAI) works to ensure the adoption of European standards and to ensure suitable standards across the entire value chain of all electricity storage system technologies in Ireland. The National Standards Authority Ireland (NSAI) is under the remit of the Department of Enterprise, Trade and Employment, as too is the Health and Safety Authority.  Battery electricity storage systems are subject to the same environmental controls as any other industrial or technical activity. The planning, construction and operation of these installations is subject to EU and Irish environmental rules enforced by the Environmental Protection Agency (EPA) and the planning authorities, either the relevant local authority or An Bord Pleanála.  Where an installation which holds an EPA licence proposes to install a battery electricity storage system, the installation should contact the EPA and may require a licence alteration or licence review. Licensable activities which also propose installation of battery electricity storage system will have the storage infrastructure assessed as part of the licence assessment and the conditions of any licence granted will apply to the licensable activity and the electricity storage infrastructure.  Battery electricity storage systems are also subject to the requirement for planning permission under the Planning and Development Act 2000 and associated regulations. The planning authorities ensure that battery electricity storage installations are planning legislation compliant. The local/planning authority plays a significant role in relation to electricity storage facility developments in its capacity as planning authority, building authority and fire authority.  The planning authorities assess individual electricity storage planning applications with recourse to all relevant documentation, including regional spatial and economic strategies and development plans, in line with the National Planning Framework. Principal assessment criteria, in addition to compliance with national, regional and local policies, will depend on the specific electricity storage project under review and the proposed location but considerations include: the most efficient use of land and infrastructure; the visual impacts of storage units as well as potential environmental / ecological and fire safety risks posed by electricity storage projects in the proposed location.  The National Directorate for Fire and Emergency Management (NDFEM) and County Fire Officers work with planning authorities to ensure that Battery storage installations are designed and built in a way the ensures fire safety. Under Section 13 of the Fire Services Acts 1981 & 2003, Fire Authorities may advise a planning authority in relation applications for planning permission for development and permission for the retention of structures, under Section 34 (which relates to permission for development and for the retention of structures) of the Planning and Development Act 2000.  Engagement with regard to the National Directorate for Fire and Emergency Management (NDFEM) as well as matters for Local (planning) authorities and An Bord Pleanála should in the first instance be addressed to the Department of Housing, Local Government and Heritage.  The Commission for the Regulation of Utilities (CRU) established by the 1999 Electricity Regulation Act, has regarding licensing, charging and market incentives for electricity undertakings, commenced a review of the regulatory treatment of electricity storage systems. The CRU is responsible inter alia, for the licensing of electricity storage, the regulation of electricity storage in the electricity market, electricity storage grid connections, including Hybrid co-location of electricity storage assets with renewable generation assets. Under Section 14(1)(n) (as amended by the Renewable Energy Regulation S.I. 20/2022) CRU are now authorised to license electricity storage systems. Further, service providers of electricity storage systems (in their capacity as generators) are also required to apply for an Authorisation to Construct (under Section 16).  Public confidence in our electricity grid system and the electricity storage systems which serve the grid infrastructure are paramount to this Government. To that end there is ongoing engagement between Government departments and relevant stakeholders on the implementation of any new regulation relevant to the safety of (battery) electricity storage systems. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-09-09",
        "by": {
          "showAs": "Michael Moynihan",
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26"
        }
      }
    },
    {
      "contextDate": "2024-09-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-09/writtens/mul@/dbsect_80.xml"
            }
          },
          "debateSectionId": "dbsect_80",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-09/writtens/dbsect_80",
          "showAs": "Energy Infrastructure"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-09-09/pq_84",
        "to": {
          "roleType": null,
          "showAs": "Environment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 84,
        "showAs": " 84. Deputy Michael Moynihan asked the Minister for the Environment, Climate and Communications if new electricity storage technologies are being considered as an alternative to lithium battery systems; if the potential for new technologies which may have less safety concerns will be given priority for future projects; and if he will make a statement on the matter. [34060/24] ",
        "answerText": " Minister for the Environment, Climate and Communications  This Government intentionally follows a ‘Technology neutral’ approach to electricity storage systems. This means that this Government neither favours nor discourages one technology over another.  The Government believes that in order to achieve Ireland’s electricity transition to renewable energy, electricity storage systems will be required to provide services of differing speeds, durations, emission limits etc. This Government also recognises that electricity storage systems have many types and varied roles. While the types of electricity storage technologies available and their individual uses is a broad area, it is clear that at present no one technology is successful in all roles.  It is believed that a balanced portfolio of technologies, including storage technologies of various durations, will be required to support the transformation of the electricity system as the level of renewable penetration increases, and rather than limiting any future procurement processes to specific electricity storage technology types, the Government promotes the incorporation of electricity storage technology, through technology neutral market products, depending on their capability to meet the requirements and service characteristics of the System Operators and the regulatory requirements of the Commission for Regulation of Utilities (CRU).  In this way, the Government supports the potential for industry to develop a portfolio of electricity storage technologies capable of being incorporated into the grid system, based on system needs and the capacity to meet established minimal grid requirements, as well as technical standard thresholds, emission targets and lower costs to the bill payer. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-09-09",
        "by": {
          "showAs": "Michael Moynihan",
          "memberCode": "Michael-Moynihan.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Moynihan.D.1997-06-26"
        }
      }
    }
  ]
}