{
  "head": {
    "counts": {
      "questionCount": 7301,
      "resultCount": 7301
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The purpose of my Department's School Transport Scheme is, having regard to available resources, to support the transport to and from school of children who reside remote from their nearest school.  In accordance with the terms of my Department's School Transport Scheme, school transport services operate during the standard school year and facilitate a child's attendance during normal school opening and closing times. Transport to the facility as outlined by the Deputy would not come under the remit of the scheme.  The pupil to whom the Deputy refers to is eligible for school transport under the Scheme for Children with Special Educational Needs and the family receive the Special Transport Grant in lieu of a school transport service. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 415. Deputy Niall Collins asked the Minister for Education and Youth if a grant is available for a school (details supplied) to assist with wheelchair transport; and if she will make a statement on the matter. [71322/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_311",
          "debateSectionId": "dbsect_311",
          "showAs": "School Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_311.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_415",
        "questionNumber": 415
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I can confirm to the Deputy that the school in question applied for a PE Hall in 2023 and were advised that there was no capital funding available for GP/PE halls as the priority for the Department was ensuring the availability of school places. Though the funding position remains the same the school in question have not applied to the Department since that time.  The Department recognises the limitations that a lack of indoor PE facilities places on the delivery of the PE curricula. However, it is important to note that almost 95% of the post primary schools, and over 70% of the primary schools that made 2020 Annual Schools Returns have indicated to the department that they either have a PE Hall, access to a nearby PE Hall, or a project in train that will deliver a new PE Hall. Practically all schools have outdoor play areas and many schools use adjacent local facilities, including community halls, public parks, playing fields and swimming pools.  Investment and expenditure on PE Halls is an element of the overall School Building Programme. The provision of GP rooms and PE Halls, at primary and post primary level respectively, and outdoor hard play areas, form part of the accommodation brief for all new school buildings. This is also the case where a major building or refurbishment project is being delivered for an existing school.  The main focus of the Department’s capital funding over the last decade and for the coming period is on provision of critical additional capacity to cater for increasing demographics and children with special education needs.  Since 2020, my Department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In addition, repurposing and optimisation of existing accommodation capacity across the school estate has been a key enabler of timely, local provision of special class capacity in a way that supports best practice in inclusion and integration. Circa 80% of new special classes in 2025/26 are being facilitated in repurposed classroom accommodation.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my Department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published shortly and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 446. Deputy Niall Collins asked the Minister for Education and Youth for an update on a proposed project by a school (details supplied); and if she will make a statement on the matter. [71625/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_336",
          "debateSectionId": "dbsect_336",
          "showAs": "School Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_336.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_446",
        "questionNumber": 446
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 (the Act) was commenced on 22 June 2023 which contains the enhanced grant scheme and adopted the related Regulations on 29 June 2023.  An Appeals Panel has been established to assess appeals made under the Remediation of Dwellings Damaged by the use of Defective Concrete (DCB) Blocks Grant Scheme. The Panel offers those affected by decisions made by the Housing Agency and Local Authorities an opportunity to have their cases assessed by an independent group of industry experts.  The points of appeal that are available to a DCB applicant include the validation stage by the local authority, the damage threshold determination made by the Housing Agency, the remediation option, and the grant amount approved and where a local authority refuse to make a grant payment pursuant to grant approval.  The Panel will review the merits of each individual case and consider all details free from any undue influence or restrictions. At the time of writing 180 appeals have been received from homeowners.  It should be noted that the Appeals Panel is statutorily independent in the performance of their functions of myself as Minister, my Department and of the Housing Agency. My Department provides limited administrative support during the initial stage of the process, in that appeals submitted by homeowners are forwarded to the Panel.  However, I understand that the Panel is in the process of assessing appeals and the Chair of the Appeals Panel has begun to issue notifications to appellants. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 543. Deputy Niall Collins asked the Minister for Housing, Local Government and Heritage the number of appeals with the appeals board at present in relation to defective concrete blocks; the number of appeals which have been decided to date; the average length of time each appeal is taking; and if he will make a statement on the matter. [71332/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_427",
          "debateSectionId": "dbsect_427",
          "showAs": "Defective Building Materials",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_427.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_543",
        "questionNumber": 543
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 909. Deputy Niall Collins asked the Minister for Health the reason for a delayed EMT call out (details supplied); and if she will make a statement on the matter. [71423/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_725",
          "debateSectionId": "dbsect_725",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_725.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_909",
        "questionNumber": 909
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  After a hearing in the Labor Court in June, it was recommended that a final extension of the current Special Scheme to the 31st of December 2025, at which point anyone remaining on the scheme should transition to the Public Service Sick Leave Scheme. Any employee of the public health sector remaining unwell beyond that date, may utilise the full provisions of the Public Service Sick Leave Scheme which will provide further support. Employees who did not qualify for the Special Scheme but are also impacted by Long-Covid may also utilise the supports of the sick leave scheme. The sick leave scheme provides full pay for three months, followed by half pay for three months, and after that, Temporary Rehabilitative Remuneration may be applied for, which, if granted, provides up to a further 547 days of paid leave. The Critical Illness Protocol that forms part of the sick leave scheme may also provide additional supports if granted. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1016. Deputy Niall Collins asked the Minister for Health if she will extend the long Covid sick scheme; and if she will make a statement on the matter. [72078/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_829",
          "debateSectionId": "dbsect_829",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_829.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1016",
        "questionNumber": 1016
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school to which the deputy refers has been granted capital funding for the provision of two mainstream classrooms under my Department’s Additional School Accommodation scheme for Modular Accommodation.  The school have received 90% of their funding. The funding grant for the ESB connections has been included in the overall grant. This funding is not issued separately. The final tranche of funding will be released to the school, upon receipt of the final drawdown paperwork, which will be subject to review and approval by Department officials. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 196. Deputy Niall Collins asked the Minister for Education and Youth the position regarding a matter (details supplied); and if she will make a statement on the matter. [70571/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_160",
          "debateSectionId": "dbsect_160",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_160.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_196",
        "questionNumber": 196
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The Department of Social Protection provides a suite of income supports for those who are unable to work due to illness or disability. Entitlement to these supports is generally not contingent on the nature of the illness but on the extent to which a particular illness impairs or restricts a person’s capacity to work.  Every application for the Department's schemes is individually assessed, in line with the provisions specified in the relevant social welfare legislation. Assessment is based on the information provided by healthcare providers and the claimant and taking into account the opinion of the Department’s Medical Assessors.  Invalidity Pension is a social insurance payment for people aged under 66 who cannot work due a long-term illness or disability. To qualify, the person must have been incapable of work for at least 12 months and be likely to be incapable of work for at least another 12 months or must be permanently incapable of work.  Pay Related Social Insurance contributions at Class A, E, H and S are reckonable for Invalidity Pension. Claimants must have 260 weeks of qualifying paid PRSI contributions since entering social insurance and 48 weeks of paid or credited PRSI contributions in the last or second-last complete contribution year before the ‘relevant date’ – this is the date of the start of the person’s permanent incapacity for work as determined by the department.  If a person has insufficient PRSI contributions, they can apply for a social assistance scheme, for example, Disability Allowance, which is my Department's primary disability related social assistance scheme. Disability Allowance is a means-tested payment for people with a disability who are aged between 16 and 66. In order to be eligible, the disability must be expected to last for at least one year. The allowance is also subject to a means test, a medical assessment and a habitual residency requirement. The purpose of the means test is to ensure that resources are directed to those with the greatest need for income supports by the State. However, even where a person has some means, from for example, illness related early pension, they may still qualify for a payment.  If the Deputy has a particular case in mind, please contact my officials so that the person's circumstances can be reviewed.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 551. Deputy Niall Collins asked the Minister for Social Protection if a teacher employed by the Department of Education and youth can access disability allowances if they are in receipt of illness related early pension payments; and if he will make a statement on the matter. [69583/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_478",
          "debateSectionId": "dbsect_478",
          "showAs": "Social Welfare Benefits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_478.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_551",
        "questionNumber": 551
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  Medical card and GP visit card provision is primarily based on financial assessment. In accordance with the Health Act 1970 (as amended), eligibility for a medical card and GP Visit Card is determined by the HSE, which assesses each application on a qualifying financial threshold. This is the amount of money that an individual can earn per week and still qualify for a card. It is specific to the individual’s own financial circumstances.  People under 70 are assessed under the general means tested medical card thresholds which are based on an applicant’s household income after deduction of tax, PRSI and Universal Social Charge. Certain expenses are also taken into account. People aged 70 or older are assessed under medical card income thresholds which are based on gross income. However, those aged over 70 can also be assessed under the general means tested scheme where there are particularly high medical costs. Detailed guidelines are available at: www2.hse.ie/services/schemes-allowances/medical-cards/applying/assessment/.  The issue of granting medical or GP visit cards on the basis of illness or a disability was previously examined in 2014 by the HSE Expert Panel on Medical Need and Medical Card Eligibility. The Group concluded that it was not feasible, desirable, nor ethically justifiable to list medical conditions in priority order for medical card or GP visit card eligibility. In following the Expert Group’s advice, a person’s means remains the main qualifier for a medical card or GP visit card.  Every effort is made by the HSE, within the framework of the legislation, to support applicants in applying for a medical card or GP visit card and, in particular, to take full account of the difficult circumstances in the case of applicants who may be in excess of the income guidelines. The HSE may exercise discretion and grant a medical card or GP visit card, even though an applicant exceeds the income threshold where they face difficult financial circumstances, such as extra costs arising from an illness. Social and medical issues are also considered when determining whether undue hardship exists for an individual accessing general practitioner or other medical services.  The HSE also has a compassionate system in place for the efficient provision of medical cards in response to emergency situations i.e., where persons are in need of urgent ongoing medical care or when a patient is receiving end of life treatment. In these cases, a medical card is issued within 24 hours of receipt of the required patient details and completed medical report by a healthcare professional. In addition, since March 2021, persons who have been certified by their treating Consultant as having a prognosis of 24 months or less are now also awarded a medical card on an administrative basis.  I can assure the Deputy that, to ensure the medical card and GP visit card system is responsive and sensitive to people's needs, my Department keeps medical card and GP visit card issues under review and any changes are considered in the context of Government policy and other issues which may be relevant. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 990. Deputy Niall Collins asked the Minister for Health if a person suffering with severe multi-organ affected endometriosis and chronic asthma and unable to work for the past five years is entitled to a medical card / GP Visit card; and if she will make a statement on the matter. [69591/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_820",
          "debateSectionId": "dbsect_820",
          "showAs": "General Practitioner Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_820.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_990",
        "questionNumber": 990
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  I appreciate the commitment and dedication shown by the many volunteers and Emergency Medical Technicians who serve communities across the country.  The pre-hospital emergency care sector continues to evolve in scale and complexity, and education pathways are adapting in line with developments in the sector. The Pre-Hospital Emergency Care Council (PHECC) is the competent regulatory authority responsible for setting standards of education and practice. PHECC approves course content, assesses the suitability of programmes delivered by education providers, and determines the theoretical and practical standards required for qualifications in pre-hospital emergency care. While PHECC sets these standards, it is important to note that it does not deliver training directly and it is open to any education provider to develop programmes and apply to PHECC for approval to deliver them.  PHECC has advised my Department that it has recently been in discussion with two education providers regarding the potential development of a paramedic apprenticeship model, and my officials have been engaging in this process. PHECC has indicated that any such programme, if approved, would not be structured as part-time provision. Decisions on course formats, including whether part-time or distance-learning models are appropriate, must be taken in line with regulatory requirements and with patient safety as the foremost consideration. By legislation HEIs are autonomous bodies and my Department does not instruct these institutions to deliver particular programmes or to operate in a particular format; however, providers are free to bring forward proposals for alternative modes of delivery, subject to regulatory approval by PHECC.  Data from the Higher Education Authority shows that enrolments in paramedic education have increased in recent years. First-year enrolments in Paramedic Studies at University College Cork have increased from 150 in 2022 to 240 in 2024, while enrolments at the University of Limerick have grown from 40 in 2022 to 55 in 2024.  More broadly, the Department of Further and Higher Education, Research, Innovation and Science continues to work to expand and diversify higher education provision across the health and social care system.  The Government is committed to ensuring that every learner has a viable and accessible pathway to fulfilling their potential. While regulatory and patient-safety considerations must guide qualification pathways in pre-hospital emergency care, my Department will continue to work with the Department of Health, relevant regulatory bodies, the Higher Education Authority and education providers to support the ongoing development of flexible, high-quality training routes that meet learner needs and contribute to a strong, well-prepared emergency care workforce. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 272. Deputy Niall Collins asked the Minister for Further and Higher Education, Research, Innovation and Science to consider the suggestions made in correspondence (detail supplied); and if he will make a statement on the matter. [68351/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_233",
          "debateSectionId": "dbsect_233",
          "showAs": "Departmental Correspondence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_233.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_272",
        "questionNumber": 272
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Health  It is recognised that endometriosis is a significant health issue for women in Ireland today and the HSE acknowledges that it is a difficult condition to diagnose and treat because of the variation of presentations which can impact the physical and mental well-being of patients. Endometriosis is a chronic disease with high recurrence rates, for which there is no definitive cure.  On 18 October I launched the National Framework for the management of Endometriosis. The Framework sets out for the first time in Ireland a defined clinical pathway for women with endometriosis, which spans primary to secondary care to specialist complex care in tertiary settings.  Most women experiencing signs and symptoms of endometriosis present to their local GP in the community. In line with clinical guidelines GPs are encouraged to initiate treatment for suspected endometriosis and may refer women with suspected endometriosis to general gynaecology services in their local hospital.  Regional Specialist Centres for moderate cases have been established in the Rotunda, the Coombe, and Limerick, with clinics under further development in Galway and the National Maternity Hospital.  Two supra-regional specialist centres, in Tallaght and Cork, have been established for the management of complex endometriosis cases.  All endometriosis sites are operational and taking referrals. Treatment including surgical intervention is being provided across the network.  Additional funding has been provided this year to expand these services through the recruitment of more personnel to provide multidisciplinary care at both supra-regional and regional level.  The Framework was officially published in October of this year. Funding of over €5 million has already been invested in specialist endometriosis services since 2021. In addition, endometriosis surgeries have been and continue to be performed in other acute gynaecology services.  The HSE has carried out an analysis of the short term and medium-term requirements to build adequate capacity, improve clinical pathways and increase expertise within our endometriosis services. The HSE’s budget for 2026 will be €27.4 billion, an increase of 6.2% on 2025. This investment will enable expansion and improvement in our health services, including endometriosis.  The Endometriosis Surgery Abroad Interim Scheme commenced from the 18 October and will operate in addition to the existing treatment abroad pathways, including the EU Treatment Abroad Scheme, the EU Cross Border Directive and Northern Ireland Planned Healthcare Schemes. The interim scheme will cover costs for the transport abroad and for healthcare provided, paid directly to the hospital.  Where a person accesses private healthcare in Ireland there is no facility for the cost of that care to be reimbursed by the public health system. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Niall Collins",
          "memberCode": "Niall-Collins.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_439.xml"
            }
          },
          "debateSectionId": "dbsect_439",
          "showAs": "Departmental Correspondence",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_439"
        },
        "questionNumber": 510,
        "date": "2025-11-27",
        "showAs": " 510. Deputy Niall Collins asked the Minister for Health her views on correspondence from a person (details supplied); and if she will make a statement on the matter. [66877/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_510"
      },
      "contextDate": "2025-11-27"
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 93. Deputy Niall Collins asked the Minister for Foreign Affairs and Trade for an update on a matter (details supplied); and if she will make a statement on the matter. [66392/25] ",
        "answerText": " Minister for Foreign Affairs and Trade  The processing of a new Honorary Consul application requires a vetting process to be cleared by the Department of Justice and An Garda Síochána before any approval can be given.  Protocol submitted Mr Khurshid's application to the Department of Justice in April. Protocol has actively been following up with the Department of Justice for an update on this application. To date, the vetting process for Mr Khurshid is still pending. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_93",
        "debateSection": {
          "showAs": "Departmental Data",
          "debateSectionId": "dbsect_100",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_100.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_100"
        },
        "date": "2025-11-26",
        "questionNumber": 93,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Niall Collins",
          "memberCode": "Niall-Collins.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "questionType": "written",
        "to": {
          "showAs": "Foreign",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 186. Deputy Niall Collins asked the Minister for Education and Youth the criteria used in assessing eligibility for ill health early retirement in the case of a teacher employed by her Department; the person or body that makes this decision (details supplied); the level at which the decision is made; the person or body that is consulted in relation to same; the precedents for this benefit being awarded; the number of cases in the past year; and if she will make a statement on the matter. [66722/25] ",
        "answerText": " Minister for Education and Youth  My department administers pension schemes, which are provided for in legislation, for teaching staff in primary, secondary and community and comprehensive schools.  One such provision of these pension schemes is the awarding of benefits under ill health retirement.  The granting of a pension and lump sum on retirement on grounds of permanent ill-health is not automatic. There is a robust medical process involving an assessment of the medical condition and its likely permanency. An applicant must apply to the Department and separately, in consultation with his/her medical advisers, submit medical evidence on the condition, treatment and prognosis, to the Occupational Health Service (Medmark) in support of the application.  The OHS conducts an independent expert medical assessment. Applications for ill-health retirement are assessed on an individual basis and not determined by precedent. Each case is considered on its own merits, taking into account the applicant’s medical condition, prognosis, and supporting documentation. The OHS provides a recommendation based on comprehensive medical evidence, and the final decision is made by the Minister based on this recommendation.  Further information on the ill health retirement procedures for teachers can be found - Retirement on Medical Grounds - Teachers and non-teaching staff www.gov.ie/en/department-of-education/services/retirement-on-medical-grounds-teachers-and-non-teaching-staff/.  Following an assessment of the medial evidence, which may include a consultation with the applicant, a decision is then communicated by the Department to the applicant. Where a teacher is in receipt of ill-health retirement pension benefit, s/he may not subsequently engage in teaching in any school or college funded directly or indirectly by the State.  My Department does not have the ill health retirement statistics available for 2025 at this time. However, for 2024, 25 teachers at primary sector retired on medical grounds and 28 from the Secondary/C&C sector.  The stats can also be found on this link Retirement Stats - First Page  https://assets.gov.ie/static/documents/Teacher_Retirement_Stats_2024.pdf ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_186",
        "debateSection": {
          "showAs": "Departmental Data",
          "debateSectionId": "dbsect_175",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_175.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_175"
        },
        "date": "2025-11-26",
        "questionNumber": 186,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Niall Collins",
          "memberCode": "Niall-Collins.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "questionType": "written",
        "to": {
          "showAs": "Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "question": {
        "showAs": " 262. Deputy Niall Collins asked the Tánaiste and Minister for Finance if he will consider deferring a requirement to register VAT for poultry farmers (details supplied) in order to allow more time to restructure; and if he will make a statement on the matter. [65459/25] ",
        "debateSection": {
          "showAs": "Tax Code",
          "debateSectionId": "dbsect_268",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_268",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_268.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Niall Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14",
          "memberCode": "Niall-Collins.D.2007-06-14"
        },
        "questionNumber": 262,
        "answerText": " Tánaiste and Minister for Finance  The VAT treatment of goods and services is subject to the requirements of EU VAT law with which Irish VAT law is obliged to comply. In general, the EU VAT Directive provides that suppliers of goods and services are required to register for VAT, and to charge and account for VAT on the supplies they make. The Directive also provides that VAT-registered businesses are entitled to claim deductions for VAT they incur on making their supplies.  The Directive allows Member States to operate a simplification arrangement, known as the SME scheme, under which businesses do not need to register for VAT provided their turnover in the current and previous calendar years do not exceed the threshold set by the relevant Member State. The turnover thresholds in Ireland are €85,000 in the case of a business engaged in the supply of goods, and €42,500 for a business engaged in the supply of services or in the supply of both goods and services.  The Directive provides for a further simplification arrangement known as the farmers flat-rate (FFR) scheme which is designed to reduce the administrative burden on farmers. The FFR scheme allows farmers to remain outside the normal VAT system, thereby avoiding the obligations of registration and returns, while permitting them to charge and retain a “flat-rate addition” on the agricultural supplies they make in the course of their farming business, as a way of compensating, on an overall basis, for VAT incurred by FFR farmers on their purchases of goods and services.  With effect from 1 September 2025, broiler chicken services have been excluded from the FFR scheme in accordance with an Order made by my predecessor under Section 86A of the Value-Added Tax (Consolidation) Act 2010. The making of this Order followed extensive consideration of a 2019 report to the Minister for Finance by the Revenue Commissioners of the review Revenue conducted which showed that the broiler chicken services sector was engaged in practices and business models that were leading to systemic overcompensation of the sector under the FFR scheme, contrary to what is permitted by the Directive. Despite the report and repeated engagement by my Department with representatives of the sector, including over the past year, it was clear that the relevant practices and business models in the sector had not changed substantially in the intervening period, and therefore, it was necessary to exclude the sector from the FFR scheme – as is provided for under Section 86A – in order to ensure that Ireland appropriately observes its obligations under EU law to guard the scheme from systemic overcompensation.  Upon exclusion from the flat-rate scheme, broiler chicken services are required, under EU law, to be treated similarly to other services supplied by businesses in Ireland. Amendments to section 6 of the Value-Added Tax Consolidation Act 2010 which are included in section 67 of Finance Bill 2025 (as passed by Dáil Committee) will legislate for this.  Of course, such suppliers may avail of the SME scheme, where applicable to them. Agricultural activities covered by the FFR scheme are not included in the calculation of the threshold for the purposes of the SME scheme. However, once a business is VAT registered, the registration overs all activities of the business. This means that a farming business which is VAT-registered cannot also avail of the FFR which, in accordance with EU law, is solely available for unregistered farmers.  Therefore, following enactment of the Finance Bill, farmers who supply broiler chicken services will be required to register for VAT from the date their supplies of goods and services, other than those covered by the FFR scheme, reaches €42,500 in a calendar year. Thus, there is already lead in time to allow mixed farmers restructure their enterprises, if they so desire.  Revenue has already issued detailed guidance for broiler farmers regarding the implications of the Section 86A Order, and Revenue will shortly issue further guidance on enactment of the Finance Bill. Any delay in aligning the registration requirement for broiler chicken services with other agricultural supplies outside the FFR scheme, and other taxable goods and services, would undermine the integrity of both the FFR and SME schemes, and exposes Ireland to the risk of infringement proceedings by the European Commission.  Finally, it is important to note that the FFR scheme is solely designed to reduce the administrative burden on farmers. No additional VAT is incurred by a farmer who registers for VAT. When registered, the farmer is obliged to charge VAT on their supplies and is entitled to claim a deduction for VAT incurred on inputs used for the purposes of making those taxable supplies. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Finance",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_262",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 357. Deputy Niall Collins asked the Minister for Education and Youth for an update on an application for a school (details supplied); and if she will make a statement on the matter. [65289/25] ",
        "debateSection": {
          "showAs": "Departmental Data",
          "debateSectionId": "dbsect_352",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_352",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_352.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Niall Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14",
          "memberCode": "Niall-Collins.D.2007-06-14"
        },
        "questionNumber": 357,
        "answerText": " Minister for Education and Youth  I can confirm to the Deputy, that my department is in receipt of an application under the Additional School Accommodation (ASA) scheme from the school in question.  The purpose of my department’s Additional School Accommodation (ASA) scheme is to ensure that essential mainstream classroom accommodation and accommodation for pupils with special education needs is available to cater for pupils enrolled each year, where the need cannot be met by the school’s existing accommodation or at other schools in the area.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In addition, repurposing and optimisation of existing accommodation capacity across the school estate has been a key enabler of timely, local provision of special class capacity in a way that supports best practice in inclusion and integration. Circa 80% of new special classes in 2025/26 are being facilitated in repurposed classroom accommodation.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  All Government departments are expected to publish their sectoral NDP Implementation Plans in November. My department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  The application from the school in question will be considered as part of this process and the school authority will be notified of the decision directly. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_357",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 957. Deputy Niall Collins asked the Minister for Further and Higher Education, Research, Innovation and Science for an update on a matter (details supplied); and if he will make a statement on the matter. [65305/25] ",
        "debateSection": {
          "showAs": "Departmental Inquiries",
          "debateSectionId": "dbsect_862",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_862",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_862.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Niall Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14",
          "memberCode": "Niall-Collins.D.2007-06-14"
        },
        "questionNumber": 957,
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  In recent years, strong government investment has driven significant growth in the apprenticeship system. Annual craft apprenticeship registrations increased by 63%, from 4,377 in 2020 - the year my department was established - to 7,113 in 2024. Consortia-led registrations also rose from 949 to 2,239 during the same period. To ensure an adequate pipeline of skilled apprentices to support government targets on housing and infrastructure development, an additional €79 million has been invested in the apprenticeship system in Budget 2026, bringing the total current budget for apprenticeship to over €410 million - more than double what it was in 2020.  Craft apprenticeships consist of both on-the-job and off-the-job training phases. Each on-the-job phase has a minimum required duration before an apprentice becomes eligible for scheduling into the next off-the-job training phase. In certain cases, the actual duration may exceed this minimum period due to factors such as apprentice numbers and available capacity.  Apprentices typically spend a mandatory minimum of six months (circa 26 weeks) undergoing on-the-job training at Phase 5. Regarding the Metal Fabrication Apprenticeship, SOLAS has advised officials in my department that as of November 2025, the median duration that an apprentice spends at Phase 5 is circa 40 weeks, including the mandatory 26 weeks training.  The apprenticeship system operates on a continuous intake basis, allowing apprentices to register throughout the year. Those apprentices in Higher Education, typically during Phases 4 and 6, generally attend off-the-job training at institutions that follow the academic calendar. A steady pipeline of apprentices ready for training ensures that workshops and classes remain fully utilised. Such an approach supports the efficient and effective use of resources.  I am assured by SOLAS that apprentices who are awaiting their next phase of training are being processed in an equitable manner and as efficiently as is possible.  All apprentices are advised at their mandatory apprenticeship induction briefings of the apprenticeship scheduling process and are also assigned a Training Advisor as their point of contact. For any apprentice seeking further information or advice regarding their individual circumstances, I would encourage them to speak to their Training Advisor, who is best suited to advise them on their specific situation. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Further and Higher Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_957",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "showAs": " 378. Deputy Niall Collins asked the Minister for Further and Higher Education, Research, Innovation and Science for an update on a matter (details supplied); and if he will make a statement on the matter. [64320/25] ",
        "to": {
          "roleType": null,
          "showAs": "Further and Higher Education",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_256.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_256",
          "showAs": "Departmental Data",
          "debateSectionId": "dbsect_256"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_378",
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  Currently, 14 apprenticeship programmes require candidates to pass the Ishihara colour vision test, a standard diagnostic test for colour vision deficiency (CVD), before starting training. This has been the case throughout the lifetime of the standards-based apprenticeship approach, which was introduced in the 1990s. There is currently no exemption from this requirement, as all apprenticeships are national programmes, delivered and administered to a common national standard.  The following are the affected crafts:- Painting and Decorating, Plumbing, Mechanical Automation and Maintenance Fitting, Aircraft Mechanic, Electrical, Electrical Instrumentation, Electronic Security Systems, Instrumentation, Refrigeration and Air Conditioning, Agricultural Mechanics, Motor Mechanics, Construction Plant Fitting, Heavy Vehicle Mechanics, and Vehicle Body Repairs.  To examine this matter, SOLAS commissioned an independent report which has now been completed. This review involved consulting with relevant independent professionals on best practice, with the preferred outcome being that the apprenticeship programmes may become more accessible to all. A final report has been received by SOLAS and has been considered by its board. My officials are actively engaging with SOLAS on the matter and an update is expected soon. ",
        "questionNumber": 378
      },
      "contextDate": "2025-11-19"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 185,
        "showAs": " 185. Deputy Niall Collins asked the Minister for Foreign Affairs and Trade if his Department will assist a person (details supplied); and if he will make a statement on the matter. [62971/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Foreign"
        },
        "by": {
          "showAs": "Niall Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14",
          "memberCode": "Niall-Collins.D.2007-06-14"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_185",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_143",
          "showAs": "Overseas Development Aid",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_143",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_143.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Foreign Affairs and Trade  I have asked officials in the Development Cooperation and Africa Division of the Department of Foreign Affairs and Trade to engage directly with the Deputy in relation to this individual case. ",
        "date": "2025-11-18"
      }
    },
    {
      "question": {
        "answerText": " Minister for Enterprise, Tourism and Employment  On 15 April, Government approved the General Scheme for the Short Term Letting and Tourism (STLT) Bill. This Bill, when enacted, will provide the statutory basis for the introduction of a register for all Short Term Lettings (STLs) in Ireland, to be implemented and managed by Fáilte Ireland from 20 May 2026, ensuring compliance with the new EU Short Term Rental Regulation, which was adopted on 11 April 2024.  The new STL register will be available online and has been broadly welcomed by the tourism sector.  From 20 May 2026, all STL hosts offering accommodation for periods up to and including 21 nights will be obliged to register with Fáilte Ireland via a digital system and confirm their compliance with planning requirements. The registration process will take just 5 minutes to complete and will result in a unique registration number being issued for each STL unit registered. This number must be displayed when listing the STL unit on any online platforms.  Fáilte Ireland has estimated that, based on data for August 2025 which has been screen scraped from publicly available STL listings across four major booking platforms, there are c.35,400 STL properties in the State currently being advertised online and up to 65% of these properties are advertised as “entire” houses and apartments.  The research points to a 26.9% increase from an estimated 27,900 units listed in August 2022. It is important, in such a fast-growing area, that we have oversight and data on where this growth is happening.  The Department of Housing, Local Government and Heritage is currently carrying out a review of the Planning Acts and is developing guidance for local authorities on short-term letting by way of a National Planning Statement.  Minister Browne will progress any necessary legislative changes to implement the new Planning requirements. The National Planning Statement will be published in advance of the final enactment of the STLT Bill to provide clarity for the tourism sector.  Government is mindful of concerns in both rural and major tourism regions where Short Term Lettings provide much needed accommodation for visitors. These concerns are being addressed through continued engagement with all stakeholders, including the Irish Self Catering Federation (ISCF). As part of this engagement process officials from my Department, along with those from the Department of Housing, Local Government and Heritage, accepted an invitation to speak at the ISCF annual Conference in County Clare on 11 October. This engagement will provide an opportunity to hear the concerns of stakeholders and to provide further clarity on the new regulatory requirements for this sector. ",
        "to": {
          "showAs": "Enterprise",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Niall Collins",
          "memberCode": "Niall-Collins.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_384.xml"
            }
          },
          "debateSectionId": "dbsect_384",
          "showAs": "Tourist Accommodation",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_384"
        },
        "questionNumber": 444,
        "date": "2025-11-12",
        "showAs": " 444. Deputy Niall Collins asked the Minister for Enterprise, Tourism and Employment for an update on matters raised in correspondence (details supplied); and if he will make a statement on the matter. [61274/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_444"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  In general, medical or health related benefits fall within the remit of the Department of Health and the HSE.  However, my Department administers the treatment benefit scheme which provides certain dental, optical, and medical appliances benefits to insured workers, the self-employed and retired people who have the required number of PRSI contributions.  These treatments are also available to their dependent spouse or partner, if applicable.  The hair replacement grant was introduced in 2022 as an expansion to the range of services available under the medical appliances element of the scheme.  A grant of up to €500, in each calendar year, is available towards the cost of wigs and hairpieces for people who suffer from hair loss as a direct result of an illness, treatment for an illness such as cancer and also a number of types of alopecia.  People with certain types of alopecia that are diagnosed as an illness can access this grant.  Other hair loss conditions that are due to ageing or other natural causes do not qualify for the scheme.  Based on advice from medical officials in my Department, the types of alopecia covered are:  • alopecia areata (which includes alopecia totalis/universalis, diffuse alopecia areata, alopecia ophiasis),  • primary scarring alopecias (including cicatricial alopecia, frontal fibrosing alopecia and lichen planopilaris alopecia),  • chemotherapy induced alopecia (anagen effluvium),  • alopecia resulting from surgery or trauma, including burns.  I have asked my Department to keep this scheme and support under review.  Any extension of this grant to other conditions would have to be considered in a policy and budgetary context.  I trust this clarifies the matter for the Deputy. ",
        "to": {
          "showAs": "Social",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Niall Collins",
          "memberCode": "Niall-Collins.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_562.xml"
            }
          },
          "debateSectionId": "dbsect_562",
          "showAs": "Social Welfare Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_562"
        },
        "questionNumber": 644,
        "date": "2025-11-12",
        "showAs": " 644. Deputy Niall Collins asked the Minister for Social Protection the plans to extend the treatment purchase scheme (hair replacement) to cover more than the five types of alopecia currently on the scheme (details supplied); and if he will make a statement on the matter. [61717/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_644"
      },
      "contextDate": "2025-11-12"
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins",
          "memberCode": "Niall-Collins.D.2007-06-14"
        },
        "questionNumber": 106,
        "questionType": "written",
        "answerText": " Minister for Education and Youth  The school referred to was approved to enter the Department’s pipeline of school buildings under the Additional School Accommodation Scheme for a project to provide a two classroom SEN base. The project is devolved to the school authority for delivery.  I can confirm that the Stage 2b (post planning) report was submitted to the Department and is currently being reviewed from cost perspective in accordance with the requirements of the Public Spending Code. All projects, including this one, are subjected to the required due diligence as specified in the Department's infrastructure guidelines.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project roll-out for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project roll-out over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  All Government departments are expected to publish their sectoral NDP Implementation Plans in November. My department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  The NDP implementation plan will be considered as part of the ongoing review of this school building project. Once the NDP implementation plan is finalised my Department will be in a position to inform the school of the outcome regarding the progression of this project. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Education",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_135",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_135",
          "showAs": "Special Educational Needs",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_135.xml"
            }
          }
        },
        "showAs": " 106. Deputy Niall Collins asked the Minister for Education and Youth for an update on a project (details supplied) for an ASD class; the reason for the delays; if the project will be expedited; and if she will make a statement on the matter. [60264/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_106"
      }
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Public Expenditure",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 565. Deputy Niall Collins asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation for an update on a matter (details supplied); and if he will make a statement on the matter. [59647/25] ",
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_565",
        "questionNumber": 565,
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  This matter is due for hearing in Court on the 13th of January 2026. As this case is subject to ongoing litigation there is no further update at this time. ",
        "debateSection": {
          "showAs": "Departmental Data",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_517",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_517.xml"
            }
          },
          "debateSectionId": "dbsect_517"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 747. Deputy Niall Collins asked the Minister for Education and Youth when a project will be completed for a wheelchair accessible toilet in a school (details supplied); and if she will make a statement on the matter. [58684/25] ",
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_747",
        "questionNumber": 747,
        "answerText": " Minister for Education and Youth  The school to which the Deputy refers submitted an application for funding under the Emergency Works Scheme (EWS) for universal access works.  The application in question has been approved and the project is currently with the school to process further. ",
        "debateSection": {
          "showAs": "Schools Refurbishment",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_689",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_689.xml"
            }
          },
          "debateSectionId": "dbsect_689"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 2057. Deputy Niall Collins asked the Minister for Health if she will review correspondence from a person (details supplied); and if she will make a statement on the matter. [60009/25] ",
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_2057",
        "questionNumber": 2057,
        "answerText": " Minister for Health  The Department of Health is committed to improving patient services and providing patient-centred care. However, while noting the complaints detailed in this correspondence, it is more appropriate that your constituent contact the HSE directly, as there are rigorous processes in place for any individual who wishes to raise a concern regarding their treatment in our health service.  As the matters raised relate to operational service provision, I have forwarded your constituent's correspondence to the HSE for direct reply. ",
        "debateSection": {
          "showAs": "Departmental Reviews",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1781",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1781.xml"
            }
          },
          "debateSectionId": "dbsect_1781"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Public Expenditure",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-10-22",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 40. Deputy Niall Collins asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the status of the sale of a property (details supplied); and if he will make a statement on the matter. [57529/25] ",
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-22/pq_40",
        "questionNumber": 40,
        "answerText": " Minister of State at the Department of Public Expenditure, National Development Plan Delivery and Reform  I am advised by the Commissioners of Public Works (OPW) that the former Garda station property at Kilfinane, Co. Limerick is currently sale agreed.  As no acceptable offers were received at the public and online auction the property was placed on the open market for sale by private treaty. On 29 September 2025, Rooney Auctioneers advised the OPW that it had received what it considered to be the final offer on the property and recommended the OPW to accept the offer. The Chief State Solicitor’s Office is currently finalising the contract for sale.  As the sale has not closed further details are commercially sensitive until completion of the contract for sale. ",
        "debateSection": {
          "showAs": "State Properties",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-22/writtens/dbsect_58",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-22/writtens/mul@/dbsect_58.xml"
            }
          },
          "debateSectionId": "dbsect_58"
        }
      },
      "contextDate": "2025-10-22"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  My department’s main responsibility is to ensure that schools in an area can, between them, cater for all pupils seeking school places in the area.??Parents have the right to choose which school to apply to and where the school has places available for the relevant year, the student should be admitted. However, in schools where there are more applicants than places available, a selection process will be necessary. This selection process and the enrolment policy on which it is based must be non-discriminatory and must be applied fairly in respect of all applicants. However, this may result in some students not obtaining a place in the school of their first choice.  In accordance with the provisions of the Education (Admission to Schools) Act 2018, schools are required to clearly set out their selection criteria in their admission policies. The criteria to be applied by schools and the order of priority are a matter for the schools themselves. It is an important feature of the act that schools can only make a decision on an application for admission that is based on the school’s admission policy.??  Tusla Education Support Service (TESS) is the agency which can assist parents who are experiencing difficulty in securing a school place for their child. Tess have advised that no referral has been received to date in relation to this child. At this time, TESS advises that the parent make applications to both local schools and schools outside of their immediate locality. The parent may contact TESS directly and they will assist the parent in securing a school place for the child referred to in this question Educational Welfare Services contact details are: tess.mw@tusla.ie or telephone: 091-385302. ",
        "by": {
          "showAs": "Niall Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14",
          "memberCode": "Niall-Collins.D.2007-06-14"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "date": "2025-10-16",
        "questionNumber": 231,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/dbsect_228",
          "debateSectionId": "dbsect_228",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/mul@/dbsect_228.xml"
            }
          },
          "showAs": "School Admissions"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-16/pq_231",
        "showAs": " 231. Deputy Niall Collins asked the Minister for Education and Youth if she will address the case of a person and their daughter (details supplied); if she will intervene to assist in identifying a suitable school placement for this pupil in Limerick; and if she will make a statement on the matter. [56143/25] "
      },
      "contextDate": "2025-10-16"
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Passport Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_98.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_98",
          "debateSectionId": "dbsect_98"
        },
        "to": {
          "showAs": "Foreign",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  With regards to the Deputy's query, the Passport Service has contacted the applicant directly and provided assistance. ",
        "questionType": "written",
        "showAs": " 156. Deputy Niall Collins asked the Tánaiste and Minister for Foreign Affairs and Trade if an application will be processed (details supplied); and if he will make a statement on the matter. [54629/25] ",
        "questionNumber": 156,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Niall Collins",
          "memberCode": "Niall-Collins.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_156"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_310.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_310",
          "debateSectionId": "dbsect_310"
        },
        "to": {
          "showAs": "Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Education and Youth  The school to which the Deputy refers submitted an application for funding under the Emergency Works Scheme (EWS) for mechanical and electrical works.  This application has been approved and is currently with the school to progress further. ",
        "questionType": "written",
        "showAs": " 414. Deputy Niall Collins asked the Minister for Education and Youth further to Parliamentary Question No. 812 of 8 September 2025, the status of approval for the emergency works at the school; and if she will make a statement on the matter. [54632/25] ",
        "questionNumber": 414,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Niall Collins",
          "memberCode": "Niall-Collins.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_414"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Defective Building Materials",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_463.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_463",
          "debateSectionId": "dbsect_463"
        },
        "to": {
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Housing, Local Government and Heritage  The Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 (the Act) commenced on 22 June 2023 which contains the current grant scheme and the related Regulations were adopted on 29 June 2023.  Government approval was granted for the priority drafting of the Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks (Amendment) Bill which will contain details of the wider group of relevant owners that can avail of increases in the grant scheme cap and rates approved in October and November 2024 along with a number of technical amendments. This legislation is being progressed as expeditiously as possible and the Bill is now included in the Autumn 2025 Government Legislation Programme for Priority Publication.  My Department continues to liaise with key stakeholders and monitors the operation of the Scheme with a view to ensuring it delivers for affected homeowners. The Implementation Steering Group for DCB meets regularly and keeps the scheme under review. Further to my reply of 15 July 2025, the group met on 4 September 2025 with a further meeting scheduled to take place this month. ",
        "questionType": "written",
        "showAs": " 605. Deputy Niall Collins asked the Minister for Housing, Local Government and Heritage further to Parliamentary Question No. 598 of 15 July 2025, if there is a further update on the matter; and if he will make a statement on the matter. [54921/25] ",
        "questionNumber": 605,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Niall Collins",
          "memberCode": "Niall-Collins.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_605"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Wind Energy Guidelines",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_700.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_700",
          "debateSectionId": "dbsect_700"
        },
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Health (Deputy Jennifer Carroll MacNeill)  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "showAs": " 854. Deputy Niall Collins asked the Minister for Health if she is aware that the wind energy industry continues to rely on the outdated 2017 HSE Position Paper on Wind Turbines and Public Health, which is contrary to more recent advice issued by the HSE (details supplied); if the 2017 Position Paper has been formally withdrawn; if not, the reason it has not been withdrawn; and if she will make a statement on the matter. [54923/25] ",
        "questionNumber": 854,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Niall Collins",
          "memberCode": "Niall-Collins.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_854"
      }
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The Teaching Council registers teachers under the Teaching Council Act 2001-2015 and in line with the Teaching Council Registration Regulations, 2016. As set out in the Schedule of the Regulations, the Council registers teachers under five routes of registration: Route 1 - Primary, Route 2 - Post-primary, Route 3 - Further Education, Route 4 - Other and Route 5 - Student Teacher. The qualification requirements for each route are set down in the Schedule.  The qualifications of teachers who qualified outside of the Republic of Ireland are assessed on an individual and holistic basis for the purposes of registering as a teacher. Qualifications are assessed for comparability with graduates of initial teacher education programmes accredited by the Teaching Council. All applications from teachers who qualified abroad are processed in line with the EU Directive 2005/36/EC and are assessed in the same manner, regardless of whether they qualified within or outside the EU. The EU Directive provides for the assessment of qualifications for the purposes of recognition, and this recognition may be subject to conditions.  To assist further with teacher supply challenges, I announced last April that I would work with the Teaching Council to introduce a proposal to enable eligible teachers who have qualified outside of Ireland to apply for registration and complete their induction requirement here.  I see this as an important step in encouraging more teachers to work and start their careers here in Ireland and I am pleased to note that significant progress has been made towards realising this measure.  Under the Teaching Council Act, the Council makes regulations for the purposes of registration through statutory instrument, including to amend or replace existing regulations. A further Statutory Instrument (SI) was required to establish the proposed creation of this timebound provision. A new set of registration regulations were drafted which included the provision for induction in the state for teachers qualified outside of the state, and on that basis engagement with the Data Protection Commissioner (DPC) was required. A proportionality impact assessment was carried out. There was also consultation with various stakeholders. Legal advice was sought to ensure that the new regulations are appropriate and proportionate, with no legal impediments, which requires more time than applies to an amending an SI.  It is expected that primary and post-primary teachers, who qualified outside of the Republic of Ireland and apply to complete their induction here under the new provision, will be subject to meeting eligibility and qualifications requirements prior to approval.  I am pleased to inform you that the final draft of the new Registration Regulations has been received from the Teaching Council and is progressing through the required procedures so that it can be laid before the Houses of the Oireachtas to be implemented shortly.  Please refer to the Teaching Council website, www.teachingcouncil.ie, for updates regarding the making of the new Registration Regulations, and for information on accessing the timebound provision for overseas qualified applicants to register and complete their induction in the State. ",
        "by": {
          "showAs": "Niall Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14",
          "memberCode": "Niall-Collins.D.2007-06-14"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "date": "2025-10-08",
        "questionNumber": 203,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/dbsect_170",
          "debateSectionId": "dbsect_170",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/mul@/dbsect_170.xml"
            }
          },
          "showAs": "Teaching Qualifications"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-08/pq_203",
        "showAs": " 203. Deputy Niall Collins asked the Minister for Education and Youth when it is expected that the Teaching Council (Registration) Regulations 2016 will be updated in order to facilitate a person (details supplied) who has achieved a portion of their qualifications/work experience overseas to apply to have said qualification/work experience recognised in Ireland, this being a crucial action to assist with current teacher supply challenges; and if she will make a statement on the matter. [54029/25] "
      },
      "contextDate": "2025-10-08"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "showAs": " 229. Deputy Niall Collins asked the Minister for Education and Youth her views on the issues raised in correspondence (details supplied); if she will have this matter examined; and if she will make a statement on the matter. [53732/25] ",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_236.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_236",
          "showAs": "Pupil-Teacher Ratio",
          "debateSectionId": "dbsect_236"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_229",
        "answerText": " Minister for Education and Youth  Under the Programme for Government there is a commitment to aim to reduce the general pupil teacher ratio at primary level to 19:1 over the term of government and introduce targeted measures in schools with very large classes.  This builds on the work of the previous government, whereby prioritisation was given to reducing the pupil teacher ratios in primary schools which has brought the teacher allocation ratio to an average of 1 classroom teacher for every 23 pupils in all primary schools, the most favourable ratio ever seen at primary level. More favourable ratios are implemented for DEIS Urban Band 1 schools. A three-point reduction in the retention schedule, which was introduced in 2021, assists schools that would otherwise be at risk of losing teaching posts.  While small schools have benefitted from the recent improvements in the staffing schedule, there are also specific staffing measures aimed at small schools.  Such measures include reduced enrolment thresholds where a school is 8km or more away from the nearest school of the same type of patronage/language of instruction and a specific staffing appeal criteria aimed at small schools which allows the school to appoint/retain a teacher on the basis of current enrolment rather than the previous 30 September. In addition, sole primary schools on our islands have a second classroom teacher allocated, regardless of enrolment.  I am considering how best to make further progress as part of the annual budgetary process in reducing the primary pupil teacher ratio in the context of Programme for Government implementation. ",
        "questionNumber": 229
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "showAs": " 497. Deputy Niall Collins asked the Minister for Agriculture, Food and the Marine if he will examine issues raised in correspondence (details supplied); and if he will make a statement on the matter. [53713/25] ",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_456.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_456",
          "showAs": "Departmental Correspondence",
          "debateSectionId": "dbsect_456"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_497",
        "answerText": " Minister for Agriculture, Food and the Marine  I am arranging to have this examined and a response will issue in due course. ",
        "questionNumber": 497
      },
      "contextDate": "2025-10-07"
    },
    {
      "contextDate": "2025-10-02",
      "question": {
        "debateSection": {
          "debateSectionId": "dbsect_268",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/dbsect_268",
          "showAs": "Public Appointments Service",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/mul@/dbsect_268.xml"
            }
          }
        },
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "houseNo": "34",
          "chamberType": "house"
        },
        "showAs": " 276. Deputy Niall Collins asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if the Public Appointments Service will launch an Irish-language higher executive officer in the civil service competition in quarter 4 of 2025; and if he will make a statement on the matter. [52822/25] ",
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  An Interdepartmental Competition for Promotion to Higher Executive Officer (HEO) positions with fluency in the Irish language in the Civil Service was launched on 3 November 2023 and is currently planned to run until 30 November 2025. There were 80 applications with 5 people being panelled and assigned in locations in Dublin and Galway.  Recognising the vital role of Irish-language proficiency in delivering public services and supporting the objectives of the Official Languages Act 2021, a new competition will be considered for advertisement in 2026. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-02/pq_276",
        "questionNumber": 276,
        "questionType": "written",
        "date": "2025-10-02",
        "to": {
          "roleType": null,
          "uri": null,
          "roleCode": null,
          "showAs": "Public Expenditure"
        },
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins"
        }
      }
    },
    {
      "contextDate": "2025-10-02",
      "question": {
        "debateSection": {
          "debateSectionId": "dbsect_350",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/dbsect_350",
          "showAs": "Agriculture Schemes",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/mul@/dbsect_350.xml"
            }
          }
        },
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "houseNo": "34",
          "chamberType": "house"
        },
        "showAs": " 378. Deputy Niall Collins asked the Minister for Agriculture, Food and the Marine to provide an update on the forgotten farmers; if consideration has been given to broadening the age and time restrictions for applicants who are excluded; and if he will make a statement on the matter. [52747/25] ",
        "answerText": " Minister for Agriculture, Food and the Marine  The application window for the scheme to support Long Established Young Farmers has closed and there are no plans to extend the eligibility criteria.  Since the time my Department was first approached in 2015 with regard to the group commonly referred to as forgotten farmers, the group was defined as young farmers who were under the age of 40 in 2015, had established their holdings prior to 2008 and were not eligible for young farmer supports under the CAP from 2015. The request for support for the forgotten farmer group in 2015 was for inclusion under the Basic Payment Scheme National Reserve as a group suffering from specific disadvantage. This definition of forgotten farmer has remained consistent since 2015.  The CAP from 2015 provided supports to young farmers who had established their holdings from 2010. Furthermore, in recognition of the withdrawal of the Installation Aid Scheme in October 2008, and following my Department’s consultation with the EU Commission, the then Minister announced in March 2015 that the group commonly known as ‘Old Young Farmers’, who established their holding between 1 January 2008 and 31 December 2009, and who, due to the timeframe of setting up their holding did not benefit from either Installation Aid or the Young Farmer category of the National Reserve, could be considered as a ‘group suffering from specific disadvantage’. The result was that this group was eligible to apply for support under the National Reserve measure of the 2015 Basic Payment Scheme. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-02/pq_378",
        "questionNumber": 378,
        "questionType": "written",
        "date": "2025-10-02",
        "to": {
          "roleType": null,
          "uri": null,
          "roleCode": null,
          "showAs": "Agriculture"
        },
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins"
        }
      }
    },
    {
      "question": {
        "date": "2025-09-25",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "showAs": " 231. Deputy Niall Collins asked the Minister for Finance if he will consider a submission regarding USC (details supplied); and if he will make a statement on the matter. [50970/25] ",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-25/writtens/mul@/dbsect_245.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-25/writtens/dbsect_245",
          "showAs": "Universal Social Charge",
          "debateSectionId": "dbsect_245"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-25/pq_231",
        "answerText": " Minister for Finance  The Universal Social Charge (USC) was designed and incorporated into the Irish taxation system in 2011 to replace two other charges, namely the Health and Income Levies. The primary purpose of the USC was to widen the tax base and to provide a steady income to the Exchequer to provide funding for public services. However, payments made by the Department of Social Protection, including the State Pension, are exempt from USC.  The USC has been reviewed and considered by my Department on many occasions. The issue of USC applying to occupational pensions of retired public servants who entered the public service before April 1995 has also been examined by my Department. Such individuals are (or were) liable to modified rate PRSI, which does not generate an entitlement to the State Pension. In retirement therefore they receive an occupational pension only, and do not receive a separate State Pension unless as a result of PRSI contributions made in another employment during their working life.  It was decided not to exempt the occupational pensions of these individuals from the USC charge as an exemption would be very costly and difficult to achieve, and it could involve all income earners with the equivalent income benefiting from the exemption. In addition, it would also undermine the principle of the USC being applied to income with few exceptions.  I would point out that the entry threshold to USC has increased significantly since it was introduced. When introduced, the entry threshold was €4,004 and now sits at €13,000 per annum. The rationale for the exemption threshold is to provide assistance to the cohort of taxpayer earning less than €13,000 per annum, such as part-time and seasonal workers and persons in receipt of small occupational pensions.  In addition, I would also point out that the structural changes implemented to the rates and thresholds of the USC since its inception in 2011 have resulted in a significant reduction in USC liability for all taxpayers. For example, in 2011 the rate structure was 2 per cent to €10,036, 4 per cent to €16,016 and 7 per cent on the balance. Whereas, in 2025, the rate structure is 0.5 per cent to €12,012, 2 per cent to €27,382, 3 per cent up to €70,044 and 8 per cent on the balance.  I currently have no plans to amend the USC exemption threshold for those with occupational pensions.  Finally, policy matters in relation to social welfare payments such as the State Pension and the Living Alone Allowance are a matter, in the first instance, for the Minister for Social Protection. ",
        "questionNumber": 231
      },
      "contextDate": "2025-09-25"
    },
    {
      "question": {
        "date": "2025-09-23",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "showAs": " 291. Deputy Niall Collins asked the Minister for Education and Youth if she will expedite a project (details supplied); and if she will make a statement on the matter. [49924/25] ",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/mul@/dbsect_289.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/dbsect_289",
          "showAs": "Departmental Data",
          "debateSectionId": "dbsect_289"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-23/pq_291",
        "answerText": " Minister for Education and Youth  The project for the school to which the Deputy refers, has been devolved to Le Cheile Trust for delivery of the project.  Following a stage 2a meeting in Q4 2024 additional information was requested from the Design Team. This has been recently received and is currently under review in accordance with Public Infrastructure Guidelines. The outcome of this review will be communicated to the School Authority in due course.  In July 2025 the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  My department is now preparing an NDP implementation plan which is due for publication later in the Autumn. This plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionNumber": 291
      },
      "contextDate": "2025-09-23"
    },
    {
      "question": {
        "date": "2025-09-23",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "showAs": " 344. Deputy Niall Collins asked the Minister for Education and Youth if she will consider a proposal (details supplied) which could help alleviate the shortage of NEPS psychologists; and if she will make a statement on the matter. [50475/25] ",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/mul@/dbsect_338.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/dbsect_338",
          "showAs": "National Educational Psychological Service",
          "debateSectionId": "dbsect_338"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-23/pq_344",
        "answerText": " Minister of State at the Department of Education  I want to thank the Deputy for raising this matter. Officials in my Department are aware of this programme and the proposal as outlined in the details supplied and are currently considering the possibility of establishing a programme to utilise the expertise of the graduates. I will revert to the Deputy following these considerations. ",
        "questionNumber": 344
      },
      "contextDate": "2025-09-23"
    },
    {
      "question": {
        "date": "2025-09-23",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "showAs": " 399. Deputy Niall Collins asked the Minister for Housing, Local Government and Heritage if he is aware of planning decisions being taken contrary to public health advice (details supplied); and if he will make a statement on the matter. [50427/25] ",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/mul@/dbsect_378.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/dbsect_378",
          "showAs": "Planning Issues",
          "debateSectionId": "dbsect_378"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-23/pq_399",
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  An Coimisiún Pleanála (the Board) is the national independent statutory body with responsibility for the determination of planning appeals and direct applications for strategic infrastructure and other developments under the Planning and Development Act 2000, as amended, and certain other Acts.  Under section 30 of the Planning and Development Act 2000, as amended the Minister shall not exercise any power or control in relation to any particular case with which a planning authority or the Commission is or may be concerned.  Arrangements have been put in place by all bodies under the aegis of my Department to facilitate the provision of information directly to members of the Oireachtas. This provides a speedy, efficient and cost effective system to address queries directly to the relevant bodies. The contact email address for An Coimisiún Pleanála in this regard is Oireachtasqueries@pleanala.ie. ",
        "questionNumber": 399
      },
      "contextDate": "2025-09-23"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "showAs": " 482. Deputy Niall Collins asked the Minister for Education and Youth the way in which parents can meet the deadline when the system is not equipped to provide documentation which is a legal requirement (details supplied); and if she will make a statement on the matter. [48093/25] ",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_392.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_392",
          "showAs": "Special Educational Needs",
          "debateSectionId": "dbsect_392"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_482",
        "answerText": " Minister of State at the Department of Education and Youth  Enabling children with special educational needs to receive an appropriate education is a priority for this Government. It is also a key priority for me, my department and for the National Council for Special Education (NCSE).  Minister McEntee and I asked that the Department and the NCSE bring forward all timelines for the 2026/2027 school year to ensure better planning and to ensure that parents and children are accepted into new special classes at a much earlier point. That has been done and a new date of 1 October 2025 has been set by which parents and schools need to have contacted the NCSE if looking for a special class/school placement for the 2026/27 school year.  This is four months earlier than the timeline for this year. I have also asked the NCSE to work with schools to sanction the majority of new special classes for the 2026/2027 school year by 31 December 2025 and this aim is outlined for schools and education stakeholders in my department’s recent circular letter.  I want to assure families, like the family referred to by the Deputy, that the NCSE will continue as they have done last year, to support families coming forward to them after the 1st October cut-off point. The NCSE will continue to support these families secure a special class place for the 2026/2027 school year where possible. Alternatively, if no special class place is available, the NCSE will work to support children in mainstream settings. The NCSE report that there are a number of vacant places in special classes in many parts of the country.  My department and the NCSE engage on a weekly basis in relation to the forward planning of special class and special school provision to meet the present, and future need, of children with special educational needs.  Parents can make initial contact, submit reports and provide consent forms directly via the NCSE’s ncse.ie/notify-ncse-special-class-special-schoolemailing parentsnotify@ncse.ie or calling 01 603 3346. ",
        "questionNumber": 482
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 813. Deputy Niall Collins asked the Minister for Education and Youth if she will review a decision to refuse incremental credit to a person (details supplied); and if she will make a statement on the matter. [45371/25] ",
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_813",
        "questionNumber": 813,
        "answerText": " Minister for Education and Youth  The criteria required to have incremental credit awarded to qualified Special Needs Assistants (SNA) is set out in Circular 0139/2006 and was agreed with the unions representing the Special Needs Assistants, School Management Representatives, the Department of Public Expenditure and Reform, and the Department of Education.  To qualify for an award of incremental credit an SNA and their prior work experience being claimed must satisfy the eligibility criteria set out in the relevant circular. An award of incremental credit cannot be made where the eligibility criteria is not satisfied.  Regarding the SNA to which you refer, their prior service did not meet the eligibility terms of the circular. Under the terms of Circular 139/2006, Section 4.3 states that work undertaken in the service of a private employer does not reckon for incremental credit purposes. Also, section 4.4 states the former employer must certify that the service was remunerated under a whole-time contract of employment or from 20 December 2001 – a regular part time contract.  As the applicant did not demonstrate that they met the criteria outlined above their application was refused. ",
        "debateSection": {
          "showAs": "Teaching Qualifications",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_703",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_703.xml"
            }
          },
          "debateSectionId": "dbsect_703"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 814. Deputy Niall Collins asked the Minister for Education and Youth to examine the case for expediting emergency works scheme approval for a school (details supplied); and if she will make a statement on the matter. [45372/25] ",
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_814",
        "questionNumber": 814,
        "answerText": " Minister for Education and Youth  The school to which the Deputy refers submitted an application for funding under the Emergency Works Scheme (EWS) for mechanical and electrical works.  The application in question is currently being reviewed by the technical area within the EWS. Once a technical recommendation has been received back from the technical team, the EWS team will engage further with the school as appropriate.  The EWS team is aware of the urgent nature of the works required and will keep the school informed throughout the process. ",
        "debateSection": {
          "showAs": "Schools Building Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_704",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_704.xml"
            }
          },
          "debateSectionId": "dbsect_704"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 980. Deputy Niall Collins asked the Minister for Education and Youth if she will address the queries raised in correspondence (details supplied); and if she will make a statement on the matter. [46650/25] ",
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_980",
        "questionNumber": 980,
        "answerText": " Minister for Education and Youth  In June of this year the Department issued a circular to post-primary schools (circular 0045/2025) informing them that they are required to implement a policy to restrict the use of, and access to, personal mobile phones by students for the duration of the school day. This policy is intended to support schools in improving the learning environment in schools by reducing distraction, reducing the risk of cyberbullying and access to inappropriate content during school hours, and, increasing traditional social interactions between pupils and students at school break times.  A key feature of the guidance is the requirement for all schools to develop their policy in consultation with the school community — including parents, students, teaching and non-teaching staff. This collaborative approach ensures that each school’s policy reflects local needs while supporting a national goal: reducing students' exposure to harmful online content and enabling them to disengage from their phones during school hours. A similar circular regarding mobile phone use issued to primary schools.  The Department approach to mobile phone restrictions in schools has been informed by ongoing research in the area. This includes the UNESCO Global Education Monitoring Report “Technology in Education a tool on whose terms”, and the Norwegian Screen Use Committee Report on the impact of the use of mobile phones during the school day on wellbeing and academic performance. Relevant research will continue to inform Department policy and resources in this area.  Cineáltas: Action Plan on Bullying, the Department of Education and Youth’s whole-education approach to preventing and addressing bullying behaviour in schools, was published in 2022. Cineáltas is dedicated to preventing and addressing bullying behaviour including cyber bullying, racist bullying, gender identity bullying and sexual harassment, among other areas, in schools. It is centred on a child rights-based approach and provides a collective vision and clear roadmap for how the whole education community and society can work together to prevent and address bullying behaviour in our schools.  Updated procedures for schools published in June 2024 take account of gender identity bullying, cyberbullying, racist bullying, sexist bullying, and sexual harassment. Under the updated procedures, all incidents of bullying behaviour must be recorded. At each meeting of the Board of Management, the principal must also present an update on the number of incidents of bullying behaviour and the measures taken to prevent and address bullying behaviour. Cineáltas also contains an action to progress the development of a national database to facilitate an annual national report on bullying behaviour in schools.  Online safety and the safe and ethical use of digital technologies is a key component of the Department’s Digital Strategy for Schools, with support and resources in the area of online safety and digital citizenship provided by Webwise. Webwise is the Irish Internet Safety Awareness Centre, and provides free information, advice and resources for schools, families and young people on online safety and digital citizenship.  Webwise is funded by the Department of Education and Youth and co-funded through the European Commission and is part of the Irish Safer Internet Centre. The Irish Safer Internet Centre is a partnership of four leading organisations – [ Webwise ], [ Hotline.ie ], [ ISPCC ][  ]and [ National Parents Council ] - with a mission to make the Internet a better place for children and young people under the coordination of the Department of Justice.  Over the latest EU funding period, which covers the 18 months from July 2024 to December 2025, EU funding of €263,000 has been allocated to Webwise. In addition, the Department has provided funding of approx. €265,000 per year to Webwise over the last three years.  A national public health campaign would not fall with the remit of the Department of Education and Youth. However, Webwise will continue to develop national awareness campaigns to promote online safety. A campaign is currently underway that will run for the month of September. The campaign is a multi-platform awareness initiative designed to reach students, parents, and educators nationwide. ",
        "debateSection": {
          "showAs": "Departmental Correspondence",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_832",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_832.xml"
            }
          },
          "debateSectionId": "dbsect_832"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1033. Deputy Niall Collins asked the Minister for Education and Youth if assistance can be provided for a school (details supplied); and if she will make a statement on the matter. [47256/25] ",
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_1033",
        "questionNumber": 1033,
        "answerText": " Minister for Education and Youth  The school to which the Deputy refers has been granted capital funding for the provision of two mainstream classrooms under my Department’s Additional School Accommodation scheme.  On approval of the project the school authority was issued with detailed information on the delivery process which includes details on funding pathways. On initiation of the project the school authority was issued with the first tranche of funding which issues over 3 instalments. Department officials have made contact with the school authority recently and I can confirm that the second tranche of funding is currently being processed and will issue to the school authority in the coming days. The final tranche of funding will issue to the school authority on receipt of final drawdown documentation which will be subject to review and approval by Department officials. ",
        "debateSection": {
          "showAs": "School Accommodation",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_876",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_876.xml"
            }
          },
          "debateSectionId": "dbsect_876"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1125. Deputy Niall Collins asked the Minister for Housing, Local Government and Heritage if he intends to provide any additional funding to local authorities under the tenant in situ scheme in addition to the funding already provided this year; and if he will make a statement on the matter.  [44757/25] ",
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_1125",
        "questionNumber": 1125,
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy James Browne)  My Department has provided €325 million to support a second-hand acquisitions programme in 2025. The programme supports priority categories of need, including exits from homeless services, tenancy sustainment (tenant in situ), people with a disability and older persons requiring urgent housing responses, and Buy and Renew acquisitions tackling vacancy. Only €133 million (or 41%) of the allocation has been drawn down by local authorities to date.  I have recently secured a further €50 million as part the National Development Plan capital funding process to expand the second hand acquisitions programme this year. I intend this funding to be ringfenced and target acquisitions that support households, primarily larger families with children, to exit long-term emergency accommodation arrangements.  I have also written recently to local authorities authorising them to enter into acquisitions that are more likely to close and fall due in 2026. Accordingly, local authorities can now enter into financial commitments for 2026 to a value of up to 30% of their original 2025 acquisitions budget. This will allow priority acquisitions to continue in the closing months of 2025, with certainty on Department funding availability in 2026, should such purchases not complete this year.  I am satisfied the funding available this year, coupled with the flexibility to enter into commitments falling due in 2026, is adequate to meet tenant in situ and other acquisitions this year. ",
        "debateSection": {
          "showAs": "Housing Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_962",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_962.xml"
            }
          },
          "debateSectionId": "dbsect_962"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "showAs": " 38. Deputy Niall Collins asked the Tánaiste and Minister for Foreign Affairs and Trade further to Parliamentary Questions Nos. 121 of 22 May and 133 of 1 July 2025, to provide additional guidance in relation to a matter (details supplied); and if he will make a statement on the matter. [40773/25] ",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_32.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_32",
          "showAs": "Registration Certificate",
          "debateSectionId": "dbsect_32"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_38",
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  The Department of Foreign Affairs and Trade is the designated authority to issue a Certificate of Freedom to Marry to Irish citizens who are getting married abroad. This is not an Irish requirement but is a requirement of the country where the applicant is getting married. To apply for a Certificate of Freedom to Marry, an online questionnaire about the applicant and the upcoming marriage or civil partnership must be submitted. Based on this questionnaire, the applicant is presented with one or more statutory declarations to complete as well as a checklist of supporting documentation required to submit with the application. The Civil Letter of Freedom to Marry will issue if the application is in order and the applicant is deemed free to marry.  One of the statutory declarations which may be required relates to a foreign divorce. The Domicile and Recognition of Foreign Divorces Act 1986 governs the recognition of foreign divorces granted on or after the coming into operation of the Act on 2 October 1986. Section 5 of the 1986 Act provides that a foreign divorce may only be recognised in Ireland if it was granted in the country where either spouse was domiciled on the date the divorce proceedings were instituted. The determination of “domicile” includes an assessment of the intention of the person to remain indefinitely in the foreign jurisdiction.  It is not possible to approve an application if the Department is not satisfied, based on the statutory declaration provided and documentation submitted, that the applicant meets the legal requirements for recognition of foreign divorces at this time. Where there is an issue as to whether a foreign divorce is entitled to recognition, section 29 of the Family Law Act 1995 allows a person to apply to an Irish court for a declaration as to marital status, including a declaration as to whether a foreign divorce is entitled to recognition in the State.  Full information on the application process is available on the Department's website under www.ireland.ie/marriageabroad.  My Department's Marriages Abroad Unit can also be contacted for further guidance at marriagesabroad@dfa.ie. ",
        "questionNumber": 38
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "showAs": " 413. Deputy Niall Collins asked the Minister for Transport if he will address issues raised in correspondence (detail supplied); and if he will make a statement on the matter. [41413/25] ",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_326.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_326",
          "showAs": "Public Service Obligation",
          "debateSectionId": "dbsect_326"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_413",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. However, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has responsibility for the regulation of fares charged to passengers in respect of public transport services provided under public service obligation (PSO) contracts.  The Department of Transport secured €658.442 million in Budget 2025 for funding for Public Service Obligation (PSO) and TFI Local Link services (an increase from €613.813 million in 2024). This includes funding for the continuation of the 20% fare reduction on PSO services, the Young Adult Card on both PSO and commercial bus services, and the 90-minute fare until the end of 2025.  Budget 2025 also included the measure to extend free child fares on PSO services to children aged 5 to 8 years old.  Therefore, funding for public transport services is focussed on existing fare initiatives and service improvements such as BusConnects in the five cities, expanding town services in the larger towns, and rolling out Connecting Ireland in rural Ireland, in order to enhance factors such as frequency, accessibility and reliability in attracting and retaining users.  Furthermore, the NTA has recently introduced a new, distance-based, zonal fare structure in the Greater Dublin Area. This move, aims to makes fares equitable, more consistent, and easier to understand, with significant reductions for many commuting from outer areas, aligning prices more closely with distance travelled.  Under the Programme for Government, our commitments include the rollout of contactless payments, keeping fares affordable, and examining the further expansion of free public transport for children.  I can assure the Deputy that this Government is committed to delivering an accessible, reliable and affordable public transport system for all our citizens, including young people.  In light of the NTA's responsibility in this area, I have forwarded the Deputy's question to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "questionNumber": 413
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "showAs": " 1401. Deputy Niall Collins asked the Minister for Housing, Local Government and Heritage when the updated planning guidelines for wind farms will be issued; the reason for the ongoing delay in publishing same; and if he will make a statement on the matter.  [40829/25] ",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_1199.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_1199",
          "showAs": "Wind Energy Guidelines",
          "debateSectionId": "dbsect_1199"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_1401",
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy James Browne)  I propose to take Questions Nos. 1401, 1404, 1434, 1609 and 1621 together.  My Department is currently undertaking a focused review of the 2006 Wind Energy Development Guidelines. The review is addressing a number of key aspects of the Guidelines including noise, setback distance, shadow flicker, community obligation, community dividend and grid connections.  My Department, in conjunction with the Department of Climate, Energy and the Environment (DCEE), which has primary responsibility for environmental noise matters, has been working to advance guidance on the noise aspect of the Guidelines, which is highly technical in nature. The two Departments have been engaging on proposals regarding the measurement and assessment of noise from wind turbines to ensure they are robust and fit for purpose having regard to, inter alia, the revised 2030 target to generate up to 80% of our electricity from renewable sources.  Further to this engagement, DCEE, in the context of its environmental noise remit, appointed noise consultants in May 2023 to inform any amendments to the noise aspect of the Guidelines. This work is now substantially complete.  My Department, in conjunction with DCEE, will make any further changes to the draft Guidelines which are deemed necessary or appropriate in the wake of this work to ensure that the finalised Guidelines, once issued, are fit for purpose to provide guidance in line with renewable energy and climate targets, whilst having appropriate regard to the impacts of wind energy development, including in relation to noise annoyance.  The evolving policy and technical context including the new Planning and Development Act 2024, which was signed by the President on 17 October 2024, and the recent revision of the National Planning Framework (NPF) reinforces the need to ensure that the finalised Guidelines, once issued, are fit for purpose.  In addition to this work, and in line with EU Directive requirements, a strategic environmental assessment (SEA) is being carried out on the draft Guidelines as part of the review process. In this regard, my Department intends to undertake a public consultation on updated draft Guidelines as part of the SEA process whereby all interested parties will have an opportunity to submit observations on the draft Guidelines. Finalised Guidelines will be prepared following detailed analysis and consideration of the submissions received during the consultation phase.  My Department notes the commitment in the recently published Programme for Government 2025 – Securing Ireland’s Future to prioritise the publication of the Wind Energy Development Guidelines, having regard to international best practice and standards. In light of this commitment, my Department is working towards concluding the finalisation of review of the Guidelines as a matter of priority, having regard to the intended public consultation and the finalisation of associated reforms and reviews including the revision of the NPF.  When finalised, the revised Guidelines will be issued under section 28 of the Planning and Development Act 2000, as amended or, subject to commencement of the Planning and Development Act 2024, as a National Planning Statement, as appropriate. The current 2006 Wind Energy Development Guidelines remain in force, pending the finalisation of the review. ",
        "questionNumber": 1401
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "showAs": " 1402. Deputy Niall Collins asked the Minister for Housing, Local Government and Heritage when the updated planning guidelines for rural houses will be issued; the reason for the ongoing delay in publishing same; and if he will make a statement on the matter. [40830/25] ",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_1200.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_1200",
          "showAs": "Planning Issues",
          "debateSectionId": "dbsect_1200"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_1402",
        "answerText": " Minister for Housing, Local Government and Heritage  Since the publication of the current Sustainable Rural Housing Guidelines in 2005 (which continue to have effect in addition to subsequent clarifications and national policy changes in the National Planning Framework) there have been important changes to our planning system. Most notably, obligations under European Directives and international agreements relating to the management and protection of the environment and adapting to and mitigating climate change have become more central to the operation of the planning system.  Updated Rural Housing Guidelines are currently being considered by my Department. The updated guidelines will expand on the high level spatial planning policy of the National Planning Framework (NPF), in particular on National Policy Objective (NPO) 28 which relates to rural housing. This objective makes a clear policy distinction between rural areas under urban influence (i.e. areas within the commuter catchment of cities, large towns and centres of employment) on the one hand, and structurally weaker rural areas where population levels may be low or declining, on the other. NPO 28 is also aligned with the established approach whereby considerations of social or economic need are to be applied by planning authorities in rural areas under urban influence.  The draft Rural Housing Guidelines will set out relevant planning criteria to be applied in local authority development plans for rural housing, based on the high level policy framework set by the NPF. The guidelines will continue to allow county development plans to provide for housing in the countryside based on the considerations detailed in NPO 28 of the NPF, and will also highlight the need to manage development in certain areas, such as the areas around cities and larger towns and environmentally sensitive areas, in order to avoid over-development.  While planning policy is a national, as opposed to an EU competence, due care is being taken to ensure the updated guidelines will not operate to conflict with fundamental EU freedoms, comply with EU environmental legislative requirements and have due regard to decisions of the European Court of Justice. The draft planning guidelines will address these complex environmental and legal issues, while also providing a framework for the sustainable management of housing in rural areas. ",
        "questionNumber": 1402
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "showAs": " 1749. Deputy Niall Collins asked the Minister for Social Protection the number of people receiving full or half rate carer's allowance that have had a review of their claim twice in eight months; and if he will make a statement on the matter. [40812/25] ",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_1472.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_1472",
          "showAs": "Social Welfare Schemes",
          "debateSectionId": "dbsect_1472"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_1749",
        "answerText": " Minister for Social Protection  Carer's allowance (CA) is a means-tested social assistance payment made to a person who is habitually resident in the State and who is providing full-time care and attention to a child or an adult who has such a disability that, as a result, they require that level of care.  My Department is committed to ensuring that only those people who are eligible receive welfare and other payments.  The objective is to ensure that we pay the right people, the right amount, through the right scheme or programme, at the right time.  Therefore, once claims are in payment, my Department undertakes periodic reviews to ensure that there is continued entitlement to payment.  Control reviews arise from both targeted and random case selections and where specific information comes to the attention of the Department.  In this context, it should be noted that people are under a legal obligation to report any change in their circumstances to the Department that may affect their eligibility, and such notifications may also trigger a review of a person's entitlement.  At all times, repeated requests for information are minimised, and every effort is made to conduct and complete reviews as quickly as possible to avoid any undue stress to the customer.  Unfortunately, the specific data requested by the Deputy regarding the number of people receiving full or half-rate CA that have had a review of their claim twice in eight months is not readily available.  However, if the Deputy has a particular case in mind, you might provide the relevant details so that my officials can examine the specific case. ",
        "questionNumber": 1749
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Niall-Collins.D.2007-06-14",
          "showAs": "Niall Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niall-Collins.D.2007-06-14"
        },
        "showAs": " 1792. Deputy Niall Collins asked the Minister for Social Protection if there are plans to increase the payment rate for people in receipt of half-rate carer's allowance; and if he will make a statement on the matter.  [41748/25] ",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_1510.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_1510",
          "showAs": "Social Welfare Rates",
          "debateSectionId": "dbsect_1510"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_1792",
        "answerText": " Minister for Social Protection  The Programme for Government includes a commitment to ‘Ensure Parents who are aged 66+ and caring for children with lifelong disabilities retain the rate at which they are paid their Carer’s Allowance and concurrently receive the State Pension’. This commitment will be advanced over the lifetime of the Government in the annual budgetary context and in light of available resources.  Any further changes or improvements will be considered in an overall budgetary and policy context. ",
        "questionNumber": 1792
      },
      "contextDate": "2025-07-29"
    }
  ]
}