{
  "head": {
    "counts": {
      "questionCount": 2136,
      "resultCount": 2136
    }
  },
  "results": [
    {
      "contextDate": "2020-07-07",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-07-07/writtens/mul@/dbsect_51.xml"
            }
          },
          "debateSectionId": "dbsect_51",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-07-07/writtens/dbsect_51",
          "showAs": "Covid-19 Pandemic Supports"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-07-07/pq_32",
        "to": {
          "roleType": null,
          "showAs": "Business",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 32,
        "showAs": " 32. Deputy Jack Chambers asked the Tánaiste and Minister for Business, Enterprise and Innovation the supports or grants available to a sector (details supplied) in the context of Covid-19; and if he will make a statement on the matter. [14147/20] ",
        "answerText": " Tánaiste and Minister for Business, Enterprise and Innovation  The Government has introduced a €12bn package of supports for firms of all sizes, which includes the wage subsidy scheme, the pandemic unemployment payment for the self-employed, grants, low-cost loans, write-off of commercial rates and deferred tax liabilities, all of which will help to improve cashflow amongst SMEs. Full details on all COVID19 supports for business are available at:   https://dbei.gov.ie/en/What-We-Do/Supports-for-SMEs/COVID-19-supports/   This package is a significant step-up in the supports available for all businesses in all sectors at this very difficult time. The measures have been developed to meet the varying needs of Irish enterprise and they are very specifically targeted by size, sector and need and are targeted at vulnerable but viable companies.  On June 25th it was announced that the Department of Social Protection’s Enterprise Support Grant will be made available to assist self-employed recipients who are exiting the Pandemic Unemployment Payment (PUP) scheme with a once-off grant of up to €1,000 to re-start their business. This will provide business owners with a once-off grant of up to €1,000 to re-start their business. A fund of €12m has been allocated for the extension of this grant. The grant will be payable to self-employed micro enterprises which employ fewer than 10 people, have an annual turnover of less than €1 million and are not eligible for support from the COVID 19 Business Restart Grant or other similar business reopening grants.  There are a number of loan schemes which have been put in place to assist businesses. The Covid-19 Working Capital Scheme open to eligible SMEs and small mid-caps (businesses of up to 499 employees) is operated by the Strategic Banking Corporation of Ireland (SBCI) in cooperation with the Department of Agriculture, Food and the Marine, and is supported by the InnovFin SME Guarantee facility.  The new €2 billion COVID-19 Credit Guarantee Scheme to aid SMEs is a further development of the existing Credit Guarantee Scheme already available. The Scheme will be available to all SME sectors. The implementation of this Scheme will require primary legislation, the drafting of which has commenced.  Any eligible business, including the self-employed, can apply for the following supports. The most appropriate support will depend on the characteristics of the business.  - MicroFinance Ireland can provide loans of up to €50,000 as an immediate measure to specifically deal with exceptional circumstances that micro-enterprises – (any business -Sole Trader, Partnership or Limited Company with less than 10 full time employees and annual turnover of up to €2m)- are facing.  - Local Enterprise Offices have moved training programmes, workshops and networking meet-ups online, covering areas such as cash management in a crisis, leading your business through COVID-19 and advice for employers impacted by the crisis. Training programmes are free of charge and places can be booked online, through your Local Enterprise Office.  - For existing companies and potential start-ups that meet eligibility criteria (such as employing 10 or fewer people with the potential for growth and job creation), Local Enterprise Offices can also offer financial supports to help manage current market challenges such as Business Priming Grants, Business Expansion Grants, Feasibility Study Grants and Technical Assistance for Micro-Exporters Grant  The Government is examining what additional measures may be warranted as part of the forthcoming Recovery Plan. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-07-07",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-07-07",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-07-07/writtens/mul@/dbsect_361.xml"
            }
          },
          "debateSectionId": "dbsect_361",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-07-07/writtens/dbsect_361",
          "showAs": "School Transport"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-07-07/pq_390",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 390,
        "showAs": " 390. Deputy Jack Chambers asked the Minister for Education and Skills if correspondence from a person (details supplied) regarding the impact on the loss of bus services for several Dublin schools will be addressed; and if she will make a statement on the matter. [13887/20] ",
        "answerText": " Minister for Education and Skills  School Transport is a significant operation managed by Bus Éireann on behalf of the Department.  In the 2019/20 school year over 120,000 children, including over 14,200 children with special educational needs, were transported in over 5,000 vehicles on a daily basis to primary and post-primary schools throughout the country covering over 100 million kilometres at a cost of over €219m in 2019.  The purpose of my Department's School Transport Scheme is, having regard to available resources, to support the transport to and from school of children who reside remote from their nearest school.  Under the terms of the scheme, children are eligible for school transport if they satisfy the distance criteria (3.2km at primary and 4.8km at post-primary) and are attending their nearest school as determined by my Department/Bus Éireann, having regard to ethos and language. Distance eligibility is determined by Bus Éireann by measuring the shortest traversable route from the child’s home to the relevant school.  All children who are eligible for school transport and who complete the application and payment process on time are accommodated on school transport services where such services are in operation.  Bus Éireann has confirmed that the services referred to by the Deputy were services that were operated by Dublin Bus and that Dublin Bus has withdrawn these services. These services were operated separately by Dublin Bus and children paid fares or availed of a range of weekly tickets when travelling. These services do not fall under the remit of my Department’s School Transport Scheme. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-07-07",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-07-07",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-07-07/writtens/mul@/dbsect_485.xml"
            }
          },
          "debateSectionId": "dbsect_485",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-07-07/writtens/dbsect_485",
          "showAs": "Covid-19 Pandemic Unemployment Payment"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-07-07/pq_519",
        "to": {
          "roleType": null,
          "showAs": "Employment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 519,
        "showAs": " 519. Deputy Jack Chambers asked the Minister for Employment Affairs and Social Protection the pandemic payment a person who is unable to return to work is entitled to in view of the fact they have an underlying health condition and are cocooning; if she will examine the specific case of a person (details supplied) in this regard; and if she will make a statement on the matter. [14325/20] ",
        "answerText": " Minister for Employment Affairs and Social Protection  The COVID-19 enhanced Illness Benefit payment applies to a person who is incapable of work by virtue of being certified by a registered medical practitioner as being a person -  (i) who is diagnosed with COVID-19, or  (ii) who is a probable source of infection of COVID-19 and is self-isolating - such persons will have either been certified by their Doctor or will have received the HSE text notification (i.e. where they are contact-traced or otherwise personally identified and advised by the HSE as being a probable source of infection).  A person who is diagnosed with COVID-19 and meets the conditions for payment is entitled to a maximum of 10 weeks enhanced IB. A person who is a probable source of infection of COVID 19 and is self-isolating is entitled to a maximum of 2 weeks enhanced Illness Benefit in respect of one claim. If the person has two 14-day contiguous periods where they are a probable source of infection, they must submit separate claims in relation to each of the two 14 day periods.   Persons who are self-isolating due to an underlying medical condition may qualify for regular Illness Benefit, provided they satisfy the relevant eligibility requirements and the have the required medical certification.  The person concerned received enhanced illness benefit for the maximum period of 4 weeks at a rate of €350 per week.  He is currently being paid regular illness benefit at a rate of €203 per week, and he has been paid fully up to date.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-07-07",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-07-07",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-07-07/writtens/mul@/dbsect_653.xml"
            }
          },
          "debateSectionId": "dbsect_653",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-07-07/writtens/dbsect_653",
          "showAs": "Disability Services Provision"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-07-07/pq_691",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 691,
        "showAs": " 691. Deputy Jack Chambers asked the Minister for Health further to Parliamentary Question No. 516 of 16 June 2020, if he will address the concerns raised in correspondence by the parent of a service user (details supplied); and if he will make a statement on the matter. [13886/20] ",
        "answerText": " Minister for Health  As the Deputy's question relates to a service matter, it has been referred to the HSE for direct reply. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-07-07",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-30/writtens/mul@/dbsect_145.xml"
            }
          },
          "debateSectionId": "dbsect_145",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-30/writtens/dbsect_145",
          "showAs": "Special Educational Needs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-30/pq_161",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 161,
        "showAs": " 161. Deputy Jack Chambers asked the Minister for Education and Skills if her Department is providing transport for the July provision for those that have previously needed it; and if she will make a statement on the matter. [12998/20] ",
        "answerText": " Minister for Education and Skills  School Transport is a significant operation managed by Bus Éireann on behalf of the Department of Education and Skills.  The purpose of my Department's School Transport Scheme is, having regard to available resources, to support the transport to and from school of children who reside remote from their nearest school.  In the current school year over 120,000 children, including over 14,200 children with special educational needs, are transported in over 5,000 vehicles on a daily basis to primary and post-primary schools throughout the country covering over 100 million kilometres at a cost of over €219m in 2019.  With regard to transport arrangements for the July Programme my Department will provide grant funding to support parents with the cost of transport arrangements for those children who are eligible for school transport and who have been approved to participate in the school based July Programme.  Schools are required to identify children who are on a School Transport service or who are in receipt of a grant. School Transport Section will be in contact with schools and families in regard to the arrangements for payment.  Grant payment is based on the distance that a family reside from their child’s school of attendance. The calculation is based on four trips per day (home to school and school to home, morning and afternoon) multiplied by the number of days a child attends school for the programme. The current rate of grant is 39.12 cent per kilometre for the first 6,437 kilometres travelled and 21.22 per kilometre for each kilometre travelled thereafter. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-30",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-30/writtens/mul@/dbsect_153.xml"
            }
          },
          "debateSectionId": "dbsect_153",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-30/writtens/dbsect_153",
          "showAs": "Special Educational Needs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-30/pq_162",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 162,
        "showAs": " 162. Deputy Jack Chambers asked the Minister for Education and Skills if she will respond to correspondence (details supplied); and if she will make a statement on the matter. [13012/20] ",
        "answerText": " Minister for Education and Skills  Under the Assistive Technology scheme, as set out in my Department’s Circular 0010/2013, funding is provided to schools towards the cost of computers and specialist equipment, which are required for educational purposes. Equipment is provided under this scheme for children with more complex disabilities who, in order to access the school curriculum, require essential specialist equipment which they do not already have, or which cannot be provided for them through the school’s existing IT provision.  The National Council for Special Education (NCSE) through its network of local Special Educational Needs Organisers (SENOs) is responsible for processing applications from schools for special educational needs supports. SENOs also make recommendations to my Department where assistive technology/specialised equipment is required. The NCSE operates within my Department's criteria in making recommendations for support.  In order to qualify for equipment under the assistive technology scheme, a student must have been diagnosed with a physical or communicative disability and must also have a recommendation in a professional assessment that the equipment is essential in order to allow the student to access the curriculum. It must also be clear that the existing I.T. equipment in the school is insufficient to meet the child's needs.  Schools make applications directly to the SENO, providing details of the student’s special educational needs or disability, including details of the approach taken by the school in making relevant interventions.  SENOs will review the application, and professional reports provided in support of same, in order to establish whether the criteria of the scheme have been met. They will then make a recommendation to my Department as to whether or not assistive technology is required; and based on this recommendation, my Department will decide on the level of grant, if any, to be provided.  Although equipment is sanctioned under the Assistive Technology scheme for use by particular students, it is the property of the school, and the school’s management authority is responsible for maintenance, repair, and insurance of the equipment.  In relation to the child named by the Deputy in his correspondence, an application has yet to be received by my Department, and may still be with the SENO for processing. The Deputy’s query will therefore be forwarded to the NCSE for direct reply. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-30",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-30/writtens/mul@/dbsect_162.xml"
            }
          },
          "debateSectionId": "dbsect_162",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-30/writtens/dbsect_162",
          "showAs": "School Accommodation"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-30/pq_172",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 172,
        "showAs": " 172. Deputy Jack Chambers asked the Minister for Education and Skills the status of the temporary prefabricated accommodation for a school (details supplied) while the permanent buildings are being built; and if she will make a statement on the matter. [13104/20] ",
        "answerText": " Minister for Education and Skills  I can confirm that in relation to the school to which the Deputy refers, a contract is due to be awarded this week (commencing 29 June, 2020) for the additional interim accommodation required for the school for the next academic year.  However, a decision in relation to planning permission for this additional accommodation is still awaited.  It should be noted that these delays are related due to the Covid-19 restrictions.  My Department is in contact with the school Principal and the Patron Body in relation to the matter. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-30",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-30/writtens/mul@/dbsect_370.xml"
            }
          },
          "debateSectionId": "dbsect_370",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-30/writtens/dbsect_370",
          "showAs": "Health Services Provision"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-30/pq_431",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 431,
        "showAs": " 431. Deputy Jack Chambers asked the Minister for Health his plans to ensure sufferers of Parkinson’s disease have access to the necessary services to treat their condition; if he will address concerns outlined in correspondence (details supplied); and if he will make a statement on the matter. [12949/20] ",
        "answerText": " Minister for Health  The Government is committed to providing services and supports for people with disabilities which will empower them to live independent lives, provide greater independence in accessing the services they choose and enhance their ability to tailor the supports required to meet their needs and plan their lives. This commitment is outlined in the Programme for Partnership Government, which is guided by two principles: equality of opportunity and improving the quality of life for people with disabilities.  In general services for people with Parkinson's Disease are delivered within the context of Primary Care, with referrals into secondary care for specialist interventions, where appropriate. However, people with Parkinson's Disease may also benefit from specialist disability services.  The HSE provides a range of assisted living services including Personal Assistant and Home Support Services to support individuals to maximise their capacity to live full and independent lives.  As the Deputy's question relates to service matters, I have arranged for the question to be referred to the Health Service Executive (HSE) for direct reply to the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-30",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-30/writtens/mul@/dbsect_401.xml"
            }
          },
          "debateSectionId": "dbsect_401",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-30/writtens/dbsect_401",
          "showAs": "Covid-19 Pandemic"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-30/pq_461",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 461,
        "showAs": " 461. Deputy Jack Chambers asked the Minister for Health the steps he is taking to increase compliance with mask wearing in public; and if he will make a statement on the matter. [13108/20] ",
        "answerText": " Minister for Health  I propose to take Questions Nos. 461 and 569 together.  The National Public Health Emergency Team (NPHET) provided guidance in relation to face coverings in its advice to Government in relation to Phase 2 of the Roadmap for Reopening Business & Society on 4 June.  The NPHET advice sets out circumstances under which the wearing of a non-medical face covering is recommended.  These are when using busy public transport, when in indoor public areas including retail outlets, by people visiting the homes of those who are cocooning, by people who are being visited in their homes by those who are cocooning, all visitors to residential care facilities and in indoor work environments where it is difficult to maintain a two-metre distance.  The wearing of face coverings in other environments should accommodate individual judgement or preference or where it is difficult to maintain a 2-metre distance.  It is important to emphasise that the wearing of face coverings is an additional hygiene measure and should not take the place of good hand hygiene, respiratory etiquette and other personal protective public health measures.  Face coverings should be used properly, in line with the guidance and to wash hands before putting them on and taking them off.  NPHET, at its meeting on Thursday 11 June, recommended that the focus in the first instance should be on increasing compliance with the current recommendations on the use of face-coverings, through the development and implementation of a national communications campaign.  On the 15th June, the Government and the National Transport Authority launched a national communications campaign  which outlines best practice for the use of face coverings in retail outlets, on public transport and in other public locations in which it is difficult to maintain social distancing or where this distance cannot be guaranteed, and will communicate to the public about:  - who should wear face coverings  - in what settings, and  - how to wear and remove face coverings correctly.  Guidance on how to make and safely use face coverings is available on gov.ie/facecoverings and the HSE website.  The Government has agreed to the mandatory use of face coverings mandatory on public transport and the development of Regulations in this regard is underway.  The NPHET keeps the position on the wearing of face coverings under continual review. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-30",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-30/writtens/mul@/dbsect_423.xml"
            }
          },
          "debateSectionId": "dbsect_423",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-30/writtens/dbsect_423",
          "showAs": "Covid-19 Pandemic"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-30/pq_482",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 482,
        "showAs": " 482. Deputy Jack Chambers asked the Minister for Health when a disability service (details supplied) can reopen; if the reopening of the service will be delayed; if interim measures can be put in place; and if he will make a statement on the matter. [13184/20] ",
        "answerText": " Minister for Health  As part of the overall effort to contain the spread of COVID-19 and in line with public health advice, day service locations have been closed since March. However priority service users have been identified in each CHO, and individualised supports continue to be provided to many people in alternative models particularly for these individuals with higher support needs, through alternative means such as via online support and/or regular telephone contact with families. Health and social care responses to the current public health emergency are under continuing review, including specific measures such as these to support vulnerable people.  The resumption of adult day services is currently being considered by my Department and the HSE as part of broader planning to prepare for the resumption of non-COVID-19 community and social care services in the current environment, and in line with public health guidance. My Department and the HSE has established a Joint Working Group to develop a plan for Community Capacity.  The HSE is finalising plans to re-establish vital non-COVID supports and services. This includes very careful and detailed work on the part of the disability sector with national guidance and will result in directing how all funded agencies can deliver services on a medium to long-term basis. A national group for the resumption of day services representative of service users and families, service providers and the HSE is working together to prepare for the resumption of day service supports in line with COVID-19 guidance. The Framework for the Resumption of Adult Disability Day Services and Action Plan for resumption of services have been completed. The national group are currently developing guidance to support the day service sector to reopen within the parameters of public health advice.  Community Healthcare Organisations are working with service providers to ascertain the current level of service provision and innovative practises that have developed over the last number of months. The collation and analysis of this data will provide a current national picture which will enable the resumption group to address the challenges of reopening day service locations.  The resumption group plan to have completed the above strands of work by the end of June following which a timeframe for the phased reopening of adult day services will be planned in cooperation with HSE disability services and service providers. In the meantime, service providers continue to contact day service users regarding their support needs and are providing those supports in different ways.  Some supports continue to be provided in a number of ways, for example by telephone, online communication and responses to address emergency needs.  The HSE and disability service providers, where identified, will continue to communicate with school leavers and their families to plan and organise for a transition to day services in line with public health guidance.  The safety of service users and staff is of critical importance therefore the attendance at locations will be determined by public health guidance, which may result in some reduction of capacity.  An information leaflet for service users and their families was developed by the national group and distributed widely to all stakeholders on June 9th.  It is expected that a clearer picture will emerge before end of June as to when day services are likely to be reinstated and how the service will be delivered taking account of Public Health Guidance and COVID-19 restrictions.  The Framework for Resumption of Adult Disability Day Services and the information leaflet “What’s Happening” is available on the New Directions website: www.hse.ie/newdirections  As the Deputy's question relates to service matters, I have arranged for the question to be referred to the Health Service Executive (HSE) for direct reply to the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-30",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-30/writtens/mul@/dbsect_448.xml"
            }
          },
          "debateSectionId": "dbsect_448",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-30/writtens/dbsect_448",
          "showAs": "Hospital Facilities"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-30/pq_506",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 506,
        "showAs": " 506. Deputy Jack Chambers asked the Minister for Health the action taken or arrangements put in place following the submission by the management of Connolly Hospital, Blanchardstown on the urgent need to increase capacity in the intensive care unit due to the experience of Covid-19 on the hospital; and if he will make a statement on the matter. [13314/20] ",
        "answerText": " Minister for Health  As this is a matter for the Health Service Executive in the first instance, I have asked them to respond directly to the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-30",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-30/writtens/mul@/dbsect_614.xml"
            }
          },
          "debateSectionId": "dbsect_614",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-30/writtens/dbsect_614",
          "showAs": "Covid-19 Pandemic"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-30/pq_687",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 687,
        "showAs": " 687. Deputy Jack Chambers asked the Minister for Transport, Tourism and Sport if a query previously submitted to his Department and to the Covid-19 query line will be responded to (details supplied); and if he will make a statement on the matter. [13007/20] ",
        "answerText": " Minister for Transport, Tourism and Sport  I am acutely aware how critical the work of the supply chain is during the COVID-19 pandemic and that every element of it is a vital link in ensuring a continuous flow of essential goods.  However, the issue you have raised regarding Certificates of Fitness to Resume Work  following periods of absence is an employee relations matter and not a matter for to my Department.  The Return to Work Safely Protocol is designed to support employers and workers to put measures in place that will prevent the spread of COVID-19 in the workplace. A link to the protocol is available here: https://www.gov.ie/en/publication/22829a-return-to-work-safely-protocol/  In response to the COVID-19 restrictions introduced by the Government on 27 March 2020, I am pleased to tell you that Regulations were signed which extend the period of validity for all driving licences due to expire between March and June for a further four months. No action is required of licence holders whose licences had been due to expire within this time period.  The safety of the public is of paramount importance at this time and as in all aspects of the COVID-19 crisis my Department continues to be guided by the National Public Health Emergency Team and the relevant national experts in relation to the resumption of services.  I am pleased to confirm the phased re-opening of the National Driver Licence Service (NDLS) centres from 8 June 2020, in line with Phase 2 of the Government roadmap for the easing of COVID-19 restrictions and the national Return To Work Safety Protocol.  The operation of the NDLS Service is the statutory responsibility of the Road Safety Authority. Further information is available at www.ndls.ie and www.rsa.ie . ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-30",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-30/writtens/mul@/dbsect_642.xml"
            }
          },
          "debateSectionId": "dbsect_642",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-30/writtens/dbsect_642",
          "showAs": "Covid-19 Pandemic"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-30/pq_718",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 718,
        "showAs": " 718. Deputy Jack Chambers asked the Minister for Transport, Tourism and Sport the latest advice or direction for travel agents regarding cancelled holidays and ticket exchange requests from customers; and if he will make a statement on the matter. [13354/20] ",
        "answerText": " Minister for Transport, Tourism and Sport  On 19 June, legal provisions were introduced to provide State backing for a new, temporary form of voucher called a Refund Credit Note, which can be issued by Irish licensed travel agents and tour operators to their customers where a booking has been cancelled due to Covid-19 travel restrictions.  Whilst consumers are entitled to a full cash refund under the Package Travel Directive in circumstances where a package holiday has to be cancelled because of Covid-19 restrictions,  customers can also agree to accept a Refund Credit Note instead of cash.  If they do, which helps stem the immediate cash drain being experienced by the sector, then the State will stand over the cash value of that Note in the event that the issuer goes out of business. Consumer protections are therefore safeguarded. All relevant information is available on the Department's website at https://www.gov.ie/en/publication/1ae3d-refund-credit-note/  Further guidance on the right of travellers to terminate package travel contacts due to the unavoidable and extraordinary circumstances resulting from the COVID-19 outbreak is available at the following link: https://www.gov.ie/en/publication/40f0d7-guidance-on-the-right-of-travellers-to-terminate-package-travel-cont/ ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-30",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-30/writtens/mul@/dbsect_679.xml"
            }
          },
          "debateSectionId": "dbsect_679",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-30/writtens/dbsect_679",
          "showAs": "Childcare Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-30/pq_763",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 763,
        "showAs": " 763. Deputy Jack Chambers asked the Minister for Children and Youth Affairs his plans to reopen childcare services which operate in schools; and if he will make a statement on the matter. [13160/20] ",
        "answerText": " Minister for Children and Youth Affairs  Guided by public health advice from the Health Protection Surveillance Centre (HPSC), early learning and care (ELC) and school-age childcare (SAC) services can resume from 29 June. On 10 June 2020, a €75m funding package was announced to facilitate the reopening of ELC and SAC services over the summer months. This substantial investment recognises the important role that the ELC and SAC sector plays in the societal and economic infrastructure of the country.  In relation specifically to the reopening of childcare services that operate on school premises, officials in my Department have been in contact with colleagues in the Department of Education and Skills.  The Department of Education and Skills have advised that the use of school facilities lies with the relevant school authority in consultation with the property owner, and that priority should be given to the interests of the school, teachers and pupils.  The Department of Education and Skills’ policy is to encourage the use of school facilities, where possible, for community, training and education-related activities. It encourages schools to facilitate requests wherever possible but on the basis that it would not impede capacity to cater for any proposed Department of Education and Skills’ summer programmes for students with special needs or from a disadvantaged background. The Department of Education and Skills advises that summer programmes should be given first priority for use of school facilities.  To assist schools in considering applications for use of their facilities, the Department of Education and Skills in consultation with representatives of schools has drafted guidelines on the use of school property outside of school hours which is available here   https://www.education.ie/en/Publications/Policy-Reports/guidelines-on-the-use-of-school-buildings-outside-of-school-hours.pdf     These guidelines are not intended to be exhaustive or prescriptive but are provided to assist schools in considering applications for the use of their facilities.  The use of school facilities should be managed at local level between the childcare service provider and the school. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-30",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/mul@/dbsect_124.xml"
            }
          },
          "debateSectionId": "dbsect_124",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/dbsect_124",
          "showAs": "Special Educational Needs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-23/pq_131",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 131,
        "showAs": " 131. Deputy Jack Chambers asked the Minister for Education and Skills the status of plans for the delivery of the July provision in 2020; if the case of persons (details supplied) will be examined; the advice for them in relation to their application for same; and if he will make a statement on the matter. [11731/20] ",
        "answerText": " Minister for Education and Skills  I propose to take Questions Nos. 131, 134 and 217 together.  My Department has published details of a summer programme for children with special educational needs enrolled in special schools, special classes and mainstream classes. The programme incorporates some aspects of the July Provision of previous years.  Summer Provision 2020 – Reconnecting with Education , is a significantly expanded programme for children with complex special educational needs which aims to re-establish the child’s relationships and connection with school and their peers as a basis for learning and participation and to help the child to re-engage in learning and social activities and help them adapt to new routines and changes. The programme aims to ensure, in so far as possible, that the child can reintegrate/transition into their planned education setting for the next school year with their peers. In-school or home-based supports by teachers and SNAs will help to prevent regression among children with special needs.  The eligibility criteria has been widened to include the following categories of children:  1. Pupils with a diagnosis of Autism  2. Pupils with severe and profound learning difficulties  3. Any child in a special class or special school   4. Children transitioning into a special class or special school from early year’s settings  5. Pupils in primary school mainstream classes who present with the following disabilities:  - Children with Down syndrome  - Children who are Deaf or most severe hard of hearing  - Children who are blind or have a most severe visual impairment  - Children who have a moderate general learning disability  - Children with severe emotional behavioural difficulties  It is a matter for the school principal to determine a student's eligibility for the scheme having regard to the published criteria.  All special schools and primary schools with special classes are invited to provide the school based summer provision for their students. This programme will run for a minimum of two weeks and can extend up to four weeks where the schools, teachers and Special Needs Assistants are willing to participate. Home-based provision will be available where a child’s local school is not providing a programme or does not have the capacity to accommodate a child in a planned programme this year. In this situation my Department will provide grant funding towards the engagement by Parents of a registered teacher / SNA to provide home based support for 10 hours a week for 4 weeks.  The programme will be reliant on schools, teachers and Special Needs Assistants (SNAs) choosing to participate on a voluntary basis.  A dedicated online registration system for families of children with special needs to access Summer Provision is now available on Gov.ie/summerprovision  Parents are asked to register their participation online, providing some outline information of the extent of their participation in the programme e.g. number of weeks.  Once registered, the parent is then free to plan and organise the programme for their child by consulting with the child’s school and securing the services of a teacher or SNA.  I also announced a programme for DEIS schools for this Summer.  Full information on summer provision and its various strands, including guidance information for parents, is available at Gov.ie/summerprovision ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-23",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/mul@/dbsect_124.xml"
            }
          },
          "debateSectionId": "dbsect_124",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/dbsect_124",
          "showAs": "Special Educational Needs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-23/pq_134",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 134,
        "showAs": " 134. Deputy Jack Chambers asked the Minister for Education and Skills the status of plans for the delivery of July provision in 2020; and if he will make a statement on the matter. [11738/20] ",
        "answerText": " Minister for Education and Skills  I propose to take Questions Nos. 131, 134 and 217 together.  My Department has published details of a summer programme for children with special educational needs enrolled in special schools, special classes and mainstream classes. The programme incorporates some aspects of the July Provision of previous years.  Summer Provision 2020 – Reconnecting with Education , is a significantly expanded programme for children with complex special educational needs which aims to re-establish the child’s relationships and connection with school and their peers as a basis for learning and participation and to help the child to re-engage in learning and social activities and help them adapt to new routines and changes. The programme aims to ensure, in so far as possible, that the child can reintegrate/transition into their planned education setting for the next school year with their peers. In-school or home-based supports by teachers and SNAs will help to prevent regression among children with special needs.  The eligibility criteria has been widened to include the following categories of children:  1. Pupils with a diagnosis of Autism  2. Pupils with severe and profound learning difficulties  3. Any child in a special class or special school   4. Children transitioning into a special class or special school from early year’s settings  5. Pupils in primary school mainstream classes who present with the following disabilities:  - Children with Down syndrome  - Children who are Deaf or most severe hard of hearing  - Children who are blind or have a most severe visual impairment  - Children who have a moderate general learning disability  - Children with severe emotional behavioural difficulties  It is a matter for the school principal to determine a student's eligibility for the scheme having regard to the published criteria.  All special schools and primary schools with special classes are invited to provide the school based summer provision for their students. This programme will run for a minimum of two weeks and can extend up to four weeks where the schools, teachers and Special Needs Assistants are willing to participate. Home-based provision will be available where a child’s local school is not providing a programme or does not have the capacity to accommodate a child in a planned programme this year. In this situation my Department will provide grant funding towards the engagement by Parents of a registered teacher / SNA to provide home based support for 10 hours a week for 4 weeks.  The programme will be reliant on schools, teachers and Special Needs Assistants (SNAs) choosing to participate on a voluntary basis.  A dedicated online registration system for families of children with special needs to access Summer Provision is now available on Gov.ie/summerprovision  Parents are asked to register their participation online, providing some outline information of the extent of their participation in the programme e.g. number of weeks.  Once registered, the parent is then free to plan and organise the programme for their child by consulting with the child’s school and securing the services of a teacher or SNA.  I also announced a programme for DEIS schools for this Summer.  Full information on summer provision and its various strands, including guidance information for parents, is available at Gov.ie/summerprovision ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-23",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/mul@/dbsect_130.xml"
            }
          },
          "debateSectionId": "dbsect_130",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/dbsect_130",
          "showAs": "Covid-19 Pandemic"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-23/pq_138",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 138,
        "showAs": " 138. Deputy Jack Chambers asked the Minister for Education and Skills if a roadmap for the reopening of the education system will be provided in order to provide clarity for pupils, families, teachers and school communities; and if he will make a statement on the matter. [11778/20] ",
        "answerText": " Minister for Education and Skills  On 12 June, my Department published the report to Government “Planning for reopening schools in line with the Roadmap for reopening society and business” https://www.education.ie/en/The-Department/Announcements/framework-for-reopening-and-operating-schools.html.  The report sets out the clear ambition to develop a sustainable plan to fully reopen schools at the start of the next school year in late August/September in line with normal timeframes.  The report also sets out in brief the contingencies that must be considered during the coming period in the context of Covid-19. These contingencies will be worked through in detail in the coming weeks with education partners and stakeholders to ensure that the return to school is safe for children and staff. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-23",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/mul@/dbsect_168.xml"
            }
          },
          "debateSectionId": "dbsect_168",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/dbsect_168",
          "showAs": "Special Educational Needs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-23/pq_178",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 178,
        "showAs": " 178. Deputy Jack Chambers asked the Minister for Education and Skills if matters raised in correspondence by a person (details supplied) regarding an outstanding July provision payment will receive a response; and if he will make a statement on the matter. [12041/20] ",
        "answerText": " Minister for Education and Skills  My Department's July Provision Scheme provides funding for an extended school year for students with a severe/profound general learning disability and/or students with Autism Spectrum Disorders (ASD). The scheme was developed to reduce potential regression in learning associated with these specific categories of special education needs over the summer holidays.  The terms and conditions relating to the operation of the scheme are made available to Parents and Tutors in advance of commencement of the tuition in a variety of documents and are also published on my Departments website.  In some cases, it may be evident that tuition was not delivered in line with the terms and conditions of the scheme. Where this occurs payment is withheld and the parent or tutor has the right to appeal the decision. In this particular case the decision was made to release the payment that had been withheld. However, due to the Covid-19 outbreak and the working arrangements currently in place, some payments have been delayed. The relevant section is now dealing with this and the payment will be issued as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-23",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/mul@/dbsect_173.xml"
            }
          },
          "debateSectionId": "dbsect_173",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/dbsect_173",
          "showAs": "Special Educational Needs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-23/pq_182",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 182,
        "showAs": " 182. Deputy Jack Chambers asked the Minister for Education and Skills if a response will issue to correspondence (details supplied); and if he will make a statement on the matter. [12063/20] ",
        "answerText": " Minister for Education and Skills  There are no plans to close the schools referred to by the deputy.  In September 2018, the NCSE was requested to develop policy advice on the educational provision that should be in place for students educated in special schools and classes and to make recommendations on the provision required to enable them achieve better outcomes.  It was agreed that the report would be completed and submitted to the Minister in 2020.  The NCSE was also requested to provide a progress report which was submitted to me on 5 November 2019.  The progress report provides an overview on the evolution of special education policy and provision in Ireland together with some preliminary analysis of emerging themes from a review of research literature and consultations with parents, teacher unions and education representative bodies, students, advocacy groups; school visits and relevant Government Departments and bodies. The Progress Report does not draw any definitive conclusions and the preliminary findings are tentative.  The NCSE is also examining implications following ratification of the Convention on the Rights of Persons with Disabilities (CRPD) in 2018, Article 24(2) of this convention obliges states, inter alia, to ensure that children can access an inclusive, quality and free education on an equal basis with others in the communities in which they live.  The NCSE is currently engaged in a public consultation with parents, students, people with disabilities, educators and other educational partners and stakeholders. The focus of this consultation focuses on how best to move forward in the education of students currently being educated in special schools and classes. Special reading schools for pupils with dyslexia are included in this process.  Following this public consultation and further deliberations by NCSE, the policy advice will be finalised and submitted to the Minister by December 2020.  It is important to note that at this stage, the NCSE has not made any recommendations regarding the future of any special school.  An official response to the deputy's separate written correspondence on this will issue shortly. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-23",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/mul@/dbsect_175.xml"
            }
          },
          "debateSectionId": "dbsect_175",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/dbsect_175",
          "showAs": "Emergency Works Scheme"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-23/pq_184",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 184,
        "showAs": " 184. Deputy Jack Chambers asked the Minister for Education and Skills if a response will issue to correspondence (details supplied); and if he will make a statement on the matter. [12068/20] ",
        "answerText": " Minister for Education and Skills  The Emergency Works Application to which the Deputy refers was refused in December 2019. The school may appeal this decision by forwarding any additional information they wish to be considered for that appeal. This correspondence should be sent to my Department's Emergency Works Team at the email address provided in my response to the correspondence referred to by the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-23",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/mul@/dbsect_124.xml"
            }
          },
          "debateSectionId": "dbsect_124",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/dbsect_124",
          "showAs": "Special Educational Needs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-23/pq_217",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 217,
        "showAs": " 217. Deputy Jack Chambers asked the Minister for Education and Skills if post-primary schoolchildren with moderate learning difficulties can apply for the July provision; the position regarding the case of a person (details supplied); and if he will make a statement on the matter. [12260/20] ",
        "answerText": " Minister for Education and Skills  I propose to take Questions Nos. 131, 134 and 217 together.  My Department has published details of a summer programme for children with special educational needs enrolled in special schools, special classes and mainstream classes. The programme incorporates some aspects of the July Provision of previous years.  Summer Provision 2020 – Reconnecting with Education , is a significantly expanded programme for children with complex special educational needs which aims to re-establish the child’s relationships and connection with school and their peers as a basis for learning and participation and to help the child to re-engage in learning and social activities and help them adapt to new routines and changes. The programme aims to ensure, in so far as possible, that the child can reintegrate/transition into their planned education setting for the next school year with their peers. In-school or home-based supports by teachers and SNAs will help to prevent regression among children with special needs.  The eligibility criteria has been widened to include the following categories of children:  1. Pupils with a diagnosis of Autism  2. Pupils with severe and profound learning difficulties  3. Any child in a special class or special school   4. Children transitioning into a special class or special school from early year’s settings  5. Pupils in primary school mainstream classes who present with the following disabilities:  - Children with Down syndrome  - Children who are Deaf or most severe hard of hearing  - Children who are blind or have a most severe visual impairment  - Children who have a moderate general learning disability  - Children with severe emotional behavioural difficulties  It is a matter for the school principal to determine a student's eligibility for the scheme having regard to the published criteria.  All special schools and primary schools with special classes are invited to provide the school based summer provision for their students. This programme will run for a minimum of two weeks and can extend up to four weeks where the schools, teachers and Special Needs Assistants are willing to participate. Home-based provision will be available where a child’s local school is not providing a programme or does not have the capacity to accommodate a child in a planned programme this year. In this situation my Department will provide grant funding towards the engagement by Parents of a registered teacher / SNA to provide home based support for 10 hours a week for 4 weeks.  The programme will be reliant on schools, teachers and Special Needs Assistants (SNAs) choosing to participate on a voluntary basis.  A dedicated online registration system for families of children with special needs to access Summer Provision is now available on Gov.ie/summerprovision  Parents are asked to register their participation online, providing some outline information of the extent of their participation in the programme e.g. number of weeks.  Once registered, the parent is then free to plan and organise the programme for their child by consulting with the child’s school and securing the services of a teacher or SNA.  I also announced a programme for DEIS schools for this Summer.  Full information on summer provision and its various strands, including guidance information for parents, is available at Gov.ie/summerprovision ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-23",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/mul@/dbsect_294.xml"
            }
          },
          "debateSectionId": "dbsect_294",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/dbsect_294",
          "showAs": "Garda Recruitment"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-23/pq_316",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 316,
        "showAs": " 316. Deputy Jack Chambers asked the Minister for Justice and Equality when the next intake of Garda recruits will commence; and if he will make a statement on the matter. [12077/20] ",
        "answerText": " Minister for Justice and Equality  The Deputy will be aware that recruitment to An Garda Síochána is governed by the Garda Síochána (Admissions and Appointments) Regulations 2013. The Public Appointments Service (PAS), on behalf of the Garda Commissioner, manages the initial recruitment stages for selection of Garda Trainees. The final stages of the recruitment process in which candidates are vetted, complete a physical competency test and a medical examination, are managed by the Commissioner and I, as Minister, have no direct involvement in the matter.  I am informed by the Garda authorities that as at 31 May 2020, there are 14,700 Garda Members, supported by over 3,000 Garda staff. This figure includes the Garda trainees from two separate intake classes who attested earlier than scheduled on Friday, 20 March, which was an operational decision taken by the Garda Commissioner in order to augment An Garda Síochána's response to policing the COVID-19 pandemic.  In 2020 it has been anticipated that in total 700 new recruits will commence training. However, as the Deputy will appreciate, these figures may be subject to change in light of An Garda Síochána’s response to the evolving COVID-19 pandemic.  I am informed by An Garda Síochána that it is intended that a Garda Recruitment Campaign will commence in 2020. The Garda authorities advise that they are currently in consultation with the Public Appointments Service about the timing of the launch of this campaign. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-23",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/mul@/dbsect_329.xml"
            }
          },
          "debateSectionId": "dbsect_329",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/dbsect_329",
          "showAs": "Covid-19 Pandemic Supports"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-23/pq_363",
        "to": {
          "roleType": null,
          "showAs": "Business",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 363,
        "showAs": " 363. Deputy Jack Chambers asked the Minister for Business, Enterprise and Innovation if the concerns of retailers (details supplied) seeking support in the context of the Covid-19 pandemic will be examined and receive a response; and if she will make a statement on the matter. [11764/20] ",
        "answerText": " Minister for Business, Enterprise and Innovation  I asked my officials to raise the matter of commercial rents and leases across a number of Government Departments. Interdepartmental discussions have taken place and there has been engagement with a range of stakeholders, including groups representing businesses and landlords, to gain additional insights and gather intelligence to inform any further discussions. I have also asked my officials to look into the different responses from other countries and to identify possible options to address the issues involved.  While different options are being explored, I would point out that any support to business in respect of rents alone would ultimately end up as a support to the landlord. Not only would it be difficult to estimate the costs involved for such a scheme, but the offering of support, or even the perception that such supports will be forthcoming, may affect the market and lessen the impetus for landlords to renegotiate with tenants.  Engagement between the landlords and tenants should be the first route taken. Tenants and landlords are encouraged to engage with each other on this matter and come to some arrangement, as it is in everybody’s interest that terms are amicably agreed. Mixed reports from stakeholders have been received on the extent to which commercial tenants have been able to negotiate with landlords. Many landlords are being constructive at the moment with informal, temporary arrangements being agreed with tenants. There is, understandably, some reluctance by landlords to disclose such arrangements due to commercial sensitivities. However, it appears that other landlords have been less flexible.  The Government is committed to ensuring as many businesses as possible survive this challenging period, and it will continue to look at how we can support businesses that have been impacted by the COVID-19 crisis. The Government recognises the issue of ‘out of pocket’ costs for businesses which have to pay ongoing fixed costs such as rents, despite not being able to trade. We have introduced a suite of supports to assist businesses which includes the wage subsidy scheme, grants, low cost loans, deferred tax liabilities and the waiver of commercial rates. Full details on all supports are available at: https://dbei.gov.ie/en/What-We-Do/Supports-for-SMEs/COVID-19-supports/  The issue of supporting fixed costs, including commercial rents, was very much to the fore of our minds when the Government recently introduced the Restart Grant which will give direct grant aid to micro and small businesses to help them with the costs associated with re-opening following COVID-19 closures. The grants will be equivalent to the rates bill of the business in 2019, with a minimum payment of €2,000 and a maximum payment of €10,000.  The issue of Commercial Rates is a policy matter for the Department of Housing, Planning and Local Government. However, I can inform the Deputy that, on 2nd May, the Government announced that commercial rates are being waived for a three-month period beginning on 27th March for businesses that have been forced to close due to public health requirements.  The Government will continue to actively engage with business owners and representative bodies regarding commercial rates. Local Authorities, who have longstanding experience in dealing with ratepayers and showing an understanding of their financial situations, are assessing the impact of Covid 19 by engaging directly with individual ratepayers, recognising that there may be impacts on sectors outside of those initially identified as being most under threat. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-23",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/mul@/dbsect_330.xml"
            }
          },
          "debateSectionId": "dbsect_330",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/dbsect_330",
          "showAs": "Covid-19 Pandemic"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-23/pq_364",
        "to": {
          "roleType": null,
          "showAs": "Business",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 364,
        "showAs": " 364. Deputy Jack Chambers asked the Minister for Business, Enterprise and Innovation if the specific concerns of a business (details supplied) will be examined and receive a response; when the business can return to work; the restrictions it will need to be put in place; the help or supports the business can avail of; and if she will make a statement on the matter. [11766/20] ",
        "answerText": " Minister for Business, Enterprise and Innovation  On 19 June the Government, having considered the public health expert advice provided by the National Public Health Emergency Team (NPHET), approved the rephasing of the Roadmap for Reopening Society and Business. Apart from some exceptions, most sectors are now being brought forward to Phase 3, beginning on Monday 29 June.  Dance studios are listed among the sports activities which can reopen from 29 June, subject to the restrictions on numbers for public gatherings and other important public health advice. Full details are available at https://www.gov.ie/en/news/58bc8b-taoiseach-announces-roadmap-for-reopening-society-and-business-and-u/  The National Return to Work Safely Protocol is a useful guide for businesses in making their assessments and adapting their workplace procedures and practices to comply fully with the COVID-19 related public health protection measures. It sets out in very clear terms for employers and workers the steps that they must take firstly before a workplace reopens, and then while it continues to operate. The Protocol is available at https://dbei.gov.ie/en/Publications/Return-to-Work-Safely-Protocol.html  The Health and Safety Authority, which is an agency of my Department, is the lead agency in overseeing compliance with the Protocol in the workplace. If employers or employees need further guidance on the Protocol, the HSA Helpline can be contacted at 1890 289 389 or wcu@hsa.ie.  In order to assist businesses to address the challenges posed by COVID-19, the Government has put in place a comprehensive suite of supports for firms of all sizes, which includes the wage subsidy scheme, grants, low-cost loans, write-off of commercial rates and deferred tax liabilities. These supports are designed to build confidence, to further assist businesses in terms of the management of their companies and to allow them to begin looking to the future and start charting a path forward for weeks and months ahead . For a full list of supports for business please see https://dbei.gov.ie/en/What-We-Do/Supports-for-SMEs/COVID-19-supports/.  As we move forward on reopening of society and business, it is important to note that all decisions taken by Government on the timing of any lifting of the remaining restrictions will be informed by the public health advice at the time. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-23",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/mul@/dbsect_579.xml"
            }
          },
          "debateSectionId": "dbsect_579",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/dbsect_579",
          "showAs": "Energy Policy"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-23/pq_632",
        "to": {
          "roleType": null,
          "showAs": "Communications",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 632,
        "showAs": " 632. Deputy Jack Chambers asked the Minister for Communications, Climate Action and Environment if he will report on an ongoing review of energy security. [11988/20] ",
        "answerText": " Minister for Communications, Climate Action and Environment  My Department is carrying out a review of the security of energy supply of Ireland’s electricity and natural gas systems which is focusing on the period to 2030 in the context of ensuring a sustainable pathway to 2050.  The review will include a full updated technical analysis of the security of supply challenges and a public consultation. The outcome of the review will inform future policy considerations.  I expect the formal procurement process for the technical analysis to commence in the coming weeks. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-23",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/mul@/dbsect_580.xml"
            }
          },
          "debateSectionId": "dbsect_580",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/dbsect_580",
          "showAs": "Just Transition Fund"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-23/pq_633",
        "to": {
          "roleType": null,
          "showAs": "Communications",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 633,
        "showAs": " 633. Deputy Jack Chambers asked the Minister for Communications, Climate Action and Environment the number of applications that have been made to date for the just transition fund; and if he will make a statement on the matter. [11989/20] ",
        "answerText": " Minister for Communications, Climate Action and Environment  I am informed by the secretariat to the Midlands Regional Transition Team (MRTT) that over 150 projects were received via the MRTT - START engagement process in the first stage of the 2020 call for proposals for the Just Transition Fund. This stage closed on Friday, 12 June. Projects that have registered at the first stage may now proceed to submit an application for funding to my Department, subject to meeting eligibility requirements and terms and conditions for funding published by my Department on Friday, 19 June. Projects have until Friday, 17 July to submit proposals for funding. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-23",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/mul@/dbsect_645.xml"
            }
          },
          "debateSectionId": "dbsect_645",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/dbsect_645",
          "showAs": "Covid-19 Pandemic"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-23/pq_709",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 709,
        "showAs": " 709. Deputy Jack Chambers asked the Minister for Transport, Tourism and Sport the status of the engagement he is having with the private bus transport sector, which is experiencing significant difficulties due to the Covid-19 pandemic. [12358/20] ",
        "answerText": " Minister for Transport, Tourism and Sport  Firstly I would like to advise that officials in my Department are engaging with the Coach Tourism & Transport Council of Ireland and will continue to do so on a regular basis.  Since the beginning of the Covid-19 health emergency, the Government has been clear that continued operation of the public transport sector is important and designated public transport as an “essential service” during the Covid-19 emergency, recognising the importance of keeping the system running especially for carrying essential workers and other passengers making necessary journeys throughout the crisis period.  The introduction of restrictions on public movement and the temporary closure of many workplaces, education centres and leisure and social activities across the country has led to an unprecedented fall in demand for public transport. Nonetheless, public transport has served, and will continue to serve, a vital role in transporting essential workers and in supporting Government’s Roadmap to Reopening Society and Business in the weeks and months ahead.  Public health advices on social distancing are relevant across the public transport sector, and operators are implementing measures to facilitate adequate social distancing measures on-board; this significantly reduces the carrying capacity of public transport services.  While the majority of public transport in Ireland is provided by the publicly-subvented bus and rail services funded through National Transport Authority's (NTA) public service obligation (PSO) programme, the public transport system also includes non-subvented bus services provided on a commercial basis by bus and coach businesses of varying size. I understand that about 90% of the commercial bus operators have suspended their services or are providing significantly reduced services at present.  From my Department's engagement with their representatives, and indeed from the NTA's regular engagement with them throughout the crisis, I understand the very difficult business environment that the commercial bus operators are now dealing with. Indeed, across Government we are acutely aware that the Covid-19 situation presents huge challenges for many business sectors.  That is why we have worked to introduce a wide programme of Government supports for impacted businesses. The range of supports available includes new schemes of wage subsidies, rates waivers, re-start grants, lending facilities, equity injection, and business advisory supports for example. I am engaging with my colleague, the Minister for Business, Enterprise and Innovation about these matters and am raising with her the concerns and situation of the commercial operators. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-23",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/mul@/dbsect_731.xml"
            }
          },
          "debateSectionId": "dbsect_731",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/dbsect_731",
          "showAs": "Community Employment Schemes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-23/pq_804",
        "to": {
          "roleType": null,
          "showAs": "Employment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 804,
        "showAs": " 804. Deputy Jack Chambers asked the Minister for Employment Affairs and Social Protection if she will engage with a disability service (details supplied) in order that community employment scheme participants can have their periods extended to ensure continuation of important services; and if she will make a statement on the matter. [11763/20] ",
        "answerText": " Minister for Employment Affairs and Social Protection  The Community Employment (CE) programme provides people who have been long term unemployed, with opportunities to gain work experience and training development so that they have increased options and prospects to re-enter the workforce.  During the COVID-19 restrictions introduced by the Government in March 2020, all CE participants due to leave CE had their time on the programme extended until 31/07/2020.  Now that the country has begun the process of restoring normal operation and in keeping with the Government’s Roadmap for re-opening society and businesses, the recruitment of CE participants has commenced. My Department has written to all CE Sponsoring Authorities regarding participants whose CE participation is due to end. Local Community Development Officers (CDOs) of the Department are in contact with schemes about phasing the departure of this group of CE participants in the period ahead.  The Blanchardstown Centre for Independent Living can contact their local CDO, Aidan O’Callaghan ( Aidan.OCallaghan@welfare.ie ) or the Area Manager, Niamh Kelly ( Niamh.Kelly1@welfare.ie ) with a view to discussing this matter further.  I trust this clarifies the matter. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-23",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_58.xml"
            }
          },
          "debateSectionId": "dbsect_58",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_58",
          "showAs": "Tax Data"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_64",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 64,
        "showAs": " 64. Deputy Jack Chambers asked the Minister for Finance the amount collected in carbon tax to date in 2020. [10659/20] ",
        "answerText": " Minister for Finance  I am advised by Revenue that €209.2 million was collected in Carbon Tax for the period January to May 2020. This is an increase of €20.7 million over the same period in 2019.  It is important to note that for the period January to May 2019 carbon tax was charged at €20 a tonne, while in the period January to May 2020 carbon tax on petrol and auto-diesel was charged at €26 a tonne.  The increase to €26 per tonne for other oils became effective from 1 May 2020 and will be reflected in tax receipts from June 2020. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_376.xml"
            }
          },
          "debateSectionId": "dbsect_376",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_376",
          "showAs": "Covid-19 Pandemic Supports"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_420",
        "to": {
          "roleType": null,
          "showAs": "Business",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 420,
        "showAs": " 420. Deputy Jack Chambers asked the Minister for Business, Enterprise and Innovation the supports available and the steps a business owner (details supplied) can take in respect of a matter; and if she will make a statement on the matter. [10808/20] ",
        "answerText": " Minister for Business, Enterprise and Innovation  Application forms for the new €250m Restart Grant providing direct grant aid to micro and small businesses are now available online on all local authority websites. The grant is a contribution towards the cost of re-opening or keeping a business operational.  To qualify for the Restart Grant, a business must be in a rateable premises and:  - have a turnover of less than €5m and have 50 or less employees,  - have suffered a projected 25%+ loss in revenue from 1 April 2020 to 30th June 2020,  - commit to remain open or to reopen if it was closed. The business must also declare the intention to retain employees that are benefitting from the Temporary Wage Subsidy Scheme (TWSS).  Subject to the qualifying criteria outlined above, any business that has a commercially rateable premises including those businesses with outstanding rates bills are eligible to make an application if they meet the criteria. The grant will be the amount of the rates demand in respect of calendar year 2019 only, subject to a minimum of €2,000 and a maximum of €10,000.  A recently established company that has moved into a rateable premises, or any company that is currently in a rateable premises but was not rate-assessed in 2019, is still eligible to apply. The local authority can pay the grant based on an estimate of what the rates demand for 2019 would have been.  Applications for the Restart Grant can be made online directly to local authorities and further information is available on the application form. If there are queries that are not addressed on the application form, businesses can contact the Business Support Unit in each local authority.  The Restart Grant is just one  of a €12bn package of supports for firms of all sizes, which includes the wage subsidy scheme, the pandemic unemployment payment for the self-employed, grants, Trading Online Vouchers, low-cost loans from MFI, write-off of commercial rates and deferred tax liabilities, all of which will help to improve cashflow amongst SMEs.  Full details on all COVID19 supports for business are available at: https://dbei.gov.ie/en/What-We-Do/Supports-for-SMEs/COVID-19-supports/. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_454.xml"
            }
          },
          "debateSectionId": "dbsect_454",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_454",
          "showAs": "Air Pollution"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_499",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 499,
        "showAs": " 499. Deputy Jack Chambers asked the Minister for Health the estimated number of persons who died due to air pollution in 2019; the identified causes of this pollution; and if he will make a statement on the matter. [10661/20] ",
        "answerText": " Minister for Health  I have asked the Health Service Executive to respond to the Deputy directly. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_469.xml"
            }
          },
          "debateSectionId": "dbsect_469",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_469",
          "showAs": "Disability Services Provision"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_516",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 516,
        "showAs": " 516. Deputy Jack Chambers asked the Minister for Health if a special needs unit can re-open as part of the Covid-19 easing of restrictions in line with other health services (details supplied); and if he will make a statement on the matter. [10780/20] ",
        "answerText": " Minister of State at the Department of Health (Finian McGrath)  The Government is committed to providing services and supports for people with disabilities which will empower them to live independent lives, provide greater independence in accessing the services they choose, and enhance their ability to tailor the supports required to meet their needs and plan their lives. This commitment is outlined in the Programme for Partnership Government, which is guided by two principles: equality of opportunity and improving the quality of life for people with disabilities.  As the Deputy's question relates to service matters, I have arranged for the question to be referred to the Health Service Executive (HSE) for direct reply to the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_690.xml"
            }
          },
          "debateSectionId": "dbsect_690",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_690",
          "showAs": "Broadcasting Sector"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_782",
        "to": {
          "roleType": null,
          "showAs": "Communications",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 782,
        "showAs": " 782. Deputy Jack Chambers asked the Minister for Communications, Climate Action and Environment if the Commission on the Future of Irish Public Service Broadcasting met in May 2020; and if he will make a statement on the matter. [10656/20] ",
        "answerText": " Minister for Communications, Climate Action and Environment  In December 2019, the Government agreed that a Commission on the Future of Irish Public Service Broadcasting would be established by the Department of the Taoiseach.  Professor Brian MacCraith, President of DCU, was appointed as Chair of the Commission earlier this year. However, as a result of the current COVID-19 pandemic, the appointment of further members to the Commission has not yet been finalised by the Department of the Taoiseach and no meetings have taken place. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_691.xml"
            }
          },
          "debateSectionId": "dbsect_691",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_691",
          "showAs": "Just Transition Commissioner"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_783",
        "to": {
          "roleType": null,
          "showAs": "Communications",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 783,
        "showAs": " 783. Deputy Jack Chambers asked the Minister for Communications, Climate Action and Environment if he will report on plans to act on the recommendations of the most recent report of the Just Transition Commissioner. [10657/20] ",
        "answerText": " Minister for Communications, Climate Action and Environment  I propose to take Questions Nos. 783 and 784 together.  I published the progress report of the Just Transition Commissioner, Mr Kieran Mulvey, together with an initial response of the Government to the Commissioner’s report and progress update on relevant measures, on Friday 22 May.  The Commissioner’s report reflects a comprehensive engagement with relevant stakeholders in the region, including local community organisations, Bord na Móna, ESB, the Midlands Transition Team, Local Authorities, public representatives, and relevant trade unions and workers' representatives. The report sets out the Commissioner’s analysis of the challenges facing the Midlands region, and for Bord na Móna workers and their families and communities, arising from an accelerated exit from peat harvesting. The report also contains important recommendations. The Government is already acting on a number of these and is committed to preparing a detailed implementation plan to address the remainder. A copy of the report and Government's initial response is available on my Department's website at dccae.gov.ie  The Government has committed significant resources in 2020, through allocating a portion of the additional carbon tax revenue to be raised on foot of Budget 2020, to measures to support the delivery of an effective just transition for the Midlands.  This includes €20 million for a new energy efficiency retrofitting scheme to be focused on the Midlands, €5 million for peatland rehabilitation outside of the Bord na Móna estate and €6 million for a dedicated new just transition fund with ESB agreeing to contribute an additional €5 million to this fund.  The Government has also committed to examining measures to support a much higher level of bog restoration on Bord na Móna bogs and to provide for a continued role for existing Bord na Móna workers on these bogs.  In relation to the Just Transition Fund, I have now launched a first call for proposals for funding. Stage 1 of accessing the Just Transition Fund is to register your project with the Midlands Regional Transition Team and START (Secretariat Technical Assistance to Regions in Transition) on www.midlandsireland.ie. In Stage 2, which I expect to launch in the coming days, my Department will publish a detailed, competitive, evaluation process for projects that have applied under Stage 1. Projects that successfully complete this stage will be invited to enter into a funding agreement with my Department with a view to initial disbursement of funding to projects as soon as possible.  I have previously set out five key priorities for this fund as follows:  - retraining and reskilling workers to assist local communities and businesses in the Midlands to adjust to the low carbon transition;  - proactive communications with affected communities and other stakeholders in the region and between local communities and the relevant national institutions;  - best practice sharing networks and frameworks;  - the early development of local transition plans, with local communities at the core of plan development, based on economic analysis and local scoping of transition impacts and the opportunities it presents, acknowledging that the needs of individual areas across the Midlands will differ; and  - innovation and investment proposals to generate sustainable employment in green enterprise that do not come within the ambit of the four Project Ireland 2040 Funds, or the State’s other investment programmes. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_691.xml"
            }
          },
          "debateSectionId": "dbsect_691",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_691",
          "showAs": "Just Transition Commissioner"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_784",
        "to": {
          "roleType": null,
          "showAs": "Communications",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 784,
        "showAs": " 784. Deputy Jack Chambers asked the Minister for Communications, Climate Action and Environment if the €6 million allocated for just transition in 2020 has been spent to date; if not, when it is planned to be spent; and if he will make a statement on the matter. [10658/20] ",
        "answerText": " Minister for Communications, Climate Action and Environment  I propose to take Questions Nos. 783 and 784 together.  I published the progress report of the Just Transition Commissioner, Mr Kieran Mulvey, together with an initial response of the Government to the Commissioner’s report and progress update on relevant measures, on Friday 22 May.  The Commissioner’s report reflects a comprehensive engagement with relevant stakeholders in the region, including local community organisations, Bord na Móna, ESB, the Midlands Transition Team, Local Authorities, public representatives, and relevant trade unions and workers' representatives. The report sets out the Commissioner’s analysis of the challenges facing the Midlands region, and for Bord na Móna workers and their families and communities, arising from an accelerated exit from peat harvesting. The report also contains important recommendations. The Government is already acting on a number of these and is committed to preparing a detailed implementation plan to address the remainder. A copy of the report and Government's initial response is available on my Department's website at dccae.gov.ie  The Government has committed significant resources in 2020, through allocating a portion of the additional carbon tax revenue to be raised on foot of Budget 2020, to measures to support the delivery of an effective just transition for the Midlands.  This includes €20 million for a new energy efficiency retrofitting scheme to be focused on the Midlands, €5 million for peatland rehabilitation outside of the Bord na Móna estate and €6 million for a dedicated new just transition fund with ESB agreeing to contribute an additional €5 million to this fund.  The Government has also committed to examining measures to support a much higher level of bog restoration on Bord na Móna bogs and to provide for a continued role for existing Bord na Móna workers on these bogs.  In relation to the Just Transition Fund, I have now launched a first call for proposals for funding. Stage 1 of accessing the Just Transition Fund is to register your project with the Midlands Regional Transition Team and START (Secretariat Technical Assistance to Regions in Transition) on www.midlandsireland.ie. In Stage 2, which I expect to launch in the coming days, my Department will publish a detailed, competitive, evaluation process for projects that have applied under Stage 1. Projects that successfully complete this stage will be invited to enter into a funding agreement with my Department with a view to initial disbursement of funding to projects as soon as possible.  I have previously set out five key priorities for this fund as follows:  - retraining and reskilling workers to assist local communities and businesses in the Midlands to adjust to the low carbon transition;  - proactive communications with affected communities and other stakeholders in the region and between local communities and the relevant national institutions;  - best practice sharing networks and frameworks;  - the early development of local transition plans, with local communities at the core of plan development, based on economic analysis and local scoping of transition impacts and the opportunities it presents, acknowledging that the needs of individual areas across the Midlands will differ; and  - innovation and investment proposals to generate sustainable employment in green enterprise that do not come within the ambit of the four Project Ireland 2040 Funds, or the State’s other investment programmes. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_692.xml"
            }
          },
          "debateSectionId": "dbsect_692",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_692",
          "showAs": "Energy Efficiency"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_785",
        "to": {
          "roleType": null,
          "showAs": "Communications",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 785,
        "showAs": " 785. Deputy Jack Chambers asked the Minister for Communications, Climate Action and Environment the status of the work to date in 2020 of the retrofit task force. [10660/20] ",
        "answerText": " Minister for Communications, Climate Action and Environment  The Government’s Climate Action Plan has set an ambitious target to retrofit 500,000 homes to a Building Energy Rating of B2 (or cost optimal equivalent), and to install 400,000 heat pumps to replace existing heating systems by 2030. A new area based approach to retrofitting is being developed, with homes being grouped together to reduce cost. Work is also underway on the development of smart financing and easy pay back mechanisms. Achievement of these targets will be supported by the financial allocation under Project Ireland 2040 of EUR 3.7 billion, and a range of other measures identified in the Climate Action Plan.  A cross-Departmental Retrofit Taskforce has been established to develop a new retrofit delivery model capable of achieving the targets mentioned above.  In 2020, the Retrofit Taskforce and its two technical subgroups have met on a number of occasions and have been working to formulate the new model. This process has been informed by a consultation with stakeholders and a thorough analysis of international experience with similar programmes. The model is designed to address barriers to energy efficiency investments in four key areas: customer proposition and demand generation, financing and affordability, supplier capacity, and delivery structure.  The Taskforce is also working to determine the estimated cost of achieving our retrofit targets as well as considering the role that retrofit could play in future economic recovery efforts.  The Retrofit Taskforce report is to be published in Q3 2020, in line with the Climate Action Plan commitment. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_710.xml"
            }
          },
          "debateSectionId": "dbsect_710",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_710",
          "showAs": "Electric Vehicles"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_806",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 806,
        "showAs": " 806. Deputy Jack Chambers asked the Minister for Transport, Tourism and Sport the number and percentage of electric cars sold to the end of May 2020. [10662/20] ",
        "answerText": " Minister for Transport, Tourism and Sport  The total number of vehicles on the National Vehicle and Driver File with a current motor tax at 31st May 2020 is 2,748,127 of which 73,192 (2.66%) use electric as a fuel type.     Fuel Type    Number of Vehicles      PETROL/ELECTRIC    52,929      ELECTRIC    10,776      PETROL/PLUG-IN HYBRID ELECTRIC    8,126      DIESEL/ELECTRIC    1,275      DIESEL/PLUG-IN HYBRID ELECTRIC    77      HYBRID    7      PLUG-IN HYBRID ELECTRIC    2      TOTAL    73,192    ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_90.xml"
            }
          },
          "debateSectionId": "dbsect_90",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_90",
          "showAs": "Departmental Correspondence"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_104",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 104,
        "showAs": " 104. Deputy Jack Chambers asked the Minister for Education and Skills if a response will issue to correspondence (details supplied); and if he will make a statement on the matter. [9662/20] ",
        "answerText": " Minister for Education and Skills  The school to which the Deputy refers has been approved funding for a building project under my Department’s Additional Accommodation Scheme 2018 that will provide for 2 additional mainstream classrooms. The tender process with respect to this project is well advanced and is expected to conclude in the coming weeks.  My Department has also approved funding to the school for additional interim temporary accommodation to assist in addressing its current enrolment need. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_106.xml"
            }
          },
          "debateSectionId": "dbsect_106",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_106",
          "showAs": "Special Educational Needs Staff"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_121",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 121,
        "showAs": " 121. Deputy Jack Chambers asked the Minister for Education and Skills if he will examine correspondence from a school (details supplied) and address the serious concerns raised regarding special needs assistant's allocation; and if he will make a statement on the matter. [9803/20] ",
        "answerText": " Minister for Education and Skills  Schools have been notified of the arrangements for the allocation of SNA support in respect of students in mainstream classes for 2020/21. The arrangements include the following provisions:  - 2019/20 mainstream class SNA allocations will be frozen, from the date of issue of Circular 0030/2020, and will automatically rollover into the 2020/21 school year. This means that no school will receive an allocation less than that which they have on the date of issue of this Circular and existing SNAs currently in standard SNA posts can continue in these posts for the next school year in the normal way.  - Schools may apply to the NCSE for additionality where they can demonstrate that the current allocation does not meet additional care needs within the mainstream classes in the school. Applications for additionality arising from significant new or emerging additional care needs, which cannot be catered within existing allocations, will be dealt with by way of an exceptional review process.  - A diagnosis of a disability, or a psychological or other professional report, will not be necessary for this process.  - The role of the SNA to support the care needs of students in mainstream classes, as set out in Circular 0030/2014, remains unchanged.  It is expected that schools will review and reprioritise the deployment of SNAs within mainstream settings and allocate resources to ensure those with the greatest level of need receive the greatest level of support. Providing access to SNA support continues to be based on primary care needs as outlined in DES Circular 0030/2014.  Detailed information on the NCSE exceptional review process is published on the NCSE website www.ncse.ie.  The NCSE will endeavour to respond to all applications for exceptional review received prior to 22nd May 2020 by 30th June 2020 and in that regard, it will prioritise applications from schools with no current SNA allocation and developing schools.  Applications for an Exceptional Review received after 22 May 2020 will continue to be processed once all other applications have been completed.  The exceptional review process for mainstream allocations will be available to schools throughout the 2020/21 school year.  As this question relates to a particular school, I have referred the question to the NCSE for their direct reply. I do not have a role in making determinations in individual cases.  A new frontloading model for allocating Special Needs Assistants to primary and post primary schools for students in mainstream classes only was to be introduced in the 2020/21 school year as part of the phased roll out of the School Inclusion Model (SIM). Due to the disruption caused by the Covid-19 public health crisis, the introduction of the model has been deferred for one year. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_288.xml"
            }
          },
          "debateSectionId": "dbsect_288",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_288",
          "showAs": "General Practitioner Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_320",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 320,
        "showAs": " 320. Deputy Jack Chambers asked the Minister for Health if refunds are available for those that were charged for an over the phone consultation with their doctor regarding potential Covid-19 before the decision was made to waive fees for such consultations; and if he will make a statement on the matter. [9693/20] ",
        "answerText": " Minister for Health  Recognising that general practitioner services, in their totality, have a key role in the collective efforts to contain and mitigate the impact on public health during the current COVID-19 public health emergency, a number of measures were put in place to support general practice. These measures included payment of a fee of €30 by the HSE to GPs for the provision of remote consultations to patients who may have contracted COVID-19 infection, including referral for testing if clinically required in line with the latest clinical algorithm. This fee which came into effect on 16 March is payable in respect of all patients, regardless of eligibility status. Refunds are not available for COVID-19 related phone consultations prior to 16 March. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_316.xml"
            }
          },
          "debateSectionId": "dbsect_316",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_316",
          "showAs": "Dental Services "
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_352",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 352,
        "showAs": " 352. Deputy Jack Chambers asked the Minister for Health if a reply will issue to a query (details supplied); and if he will make a statement on the matter. [9904/20] ",
        "answerText": " Minister for Health  I have been engaging with the dental profession in recent weeks on the concerns raised in the correspondence - details attached.  Legislative amendments have been made and the Health Protection Surveillance Centre (HPSC) has worked with the dental profession and in particular the Dental Council, to provide revised guidance for the profession to allow for the resumption of the safe provision of routine care. This was in line with Phase 1 of the Government's plan for the easing of COVID-19 restrictions which commenced on 18th May.  The Government has put in place a suite of measures to support small, medium and larger businesses that are negatively impacted by COVID-19 including a Restart grant for which application can be made on line to local authorities. The Department of Business, Enterprise and Innovation has published a Return to Work Safely Protocol, which is designed to support employers and workers to put measures in place that will prevent the spread of COVID-19 in the workplace. The Health and Safety Authority also provides information and advice for employers and employees in this regard.  The HPSC supports the use of the normal Personal Protective Equipment (PPE) used in routine dentistry. The Dental Council has indicated that dentists should take a case by case assessment when deciding if additional PPE is warranted. I am following up with the HSE on the issue of supply of PPE for dentists. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_599.xml"
            }
          },
          "debateSectionId": "dbsect_599",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_599",
          "showAs": "Social Welfare Appeals"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_650",
        "to": {
          "roleType": null,
          "showAs": "Employment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 650,
        "showAs": " 650. Deputy Jack Chambers asked the Minister for Employment Affairs and Social Protection if a reply will issue to correspondence she referred to the Social Welfare Appeals Office (details supplied); and if she will make a statement on the matter. [9914/20] ",
        "answerText": " Minister for Employment Affairs and Social Protection  The Social Welfare Appeals Office has advised me that an appeal by the person concerned was registered in that office on 12 May 2020. The Office is aware that the person concerned stated that she sent in her appeal at the end of February but, unfortunately, there is no record of the appeal being received at that time.  It is a statutory requirement of the appeals process that the relevant Departmental papers and comments by the Deciding Officer on the grounds of appeal be sought. When these papers were received from the Department the case in question was referred to an Appeals Officer on 25 May 2020.  The Appeals Officer, having fully considered all of the available evidence, decided to disallow the appeal of the person concerned by way of a summary decision. Under social welfare legislation, the decision of an Appeals Officer is final and conclusive and may only be reviewed by an Appeals Officer in the light of new evidence or new facts.  I am advised that the person concerned has submitted additional evidence and that the Department has been requested to return the file to the Social Welfare Appeals Office. On receipt of this file, the case will be referred to the Appeals Officer for review under Section 317 of the Social Welfare Consolidation Act 2005. The person concerned will be contacted when the review of her appeal has been finalised.  I am also advised by the Social Welfare Appeals Office that the Deputy's representations (reference REPS-2020-20284) were replied to by that office on 12 May 2020, confirming that an appeal was now being registered in this case.  The Social Welfare Appeals Office functions independently of the Minister for Employment Affairs and Social Protection and of the Department and is responsible for determining appeals against decisions in relation to social welfare entitlements.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_660.xml"
            }
          },
          "debateSectionId": "dbsect_660",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_660",
          "showAs": "Departmental Correspondence"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_729",
        "to": {
          "roleType": null,
          "showAs": "Culture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 729,
        "showAs": " 729. Deputy Jack Chambers asked the Minister for Culture, Heritage and the Gaeltacht if a reply will issue to correspondence (details supplied); and if she will make a statement on the matter. [9922/20] ",
        "answerText": " Minister for Culture, Heritage and the Gaeltacht  I wish to advise that a reply to the correspondence referred to by the Deputy has issued.  The Government’s Roadmap for Reopening Society & Business, published on 1 May 2020, sets out an indicative path to the easing of COVID 19 restrictions and other actions in order to facilitate the reopening Ireland’s society and economy in a phased manner Government announced the move on to Phase 2 of the Roadmap last Friday. Organisations should review the Roadmap carefully and carry out a detailed assessment of their activities with regard to the continuing public health measures. These organisations should, based on their assessment, identify which category in which phase of reopening they will be in a position to reopen safely and in line with the continued public health measures. It is not necessary for organisations to seek official authorisation to reopen.  My Department has published a new booklet on its website which sets out support and information available to the arts sector in response to the COVID-19 crisis. My Department also provides a helpdesk advice facility on income support for individuals at artsunit@chg.gov.ie and I would encourage people in the sector to make contact for advice.  The Government is providing a range of income supports for people who have lost employment as a result of the restrictions put in place to prevent the spread of the corona virus and are outlined as follows:  My colleague the Minister for Employment Affairs and Social Protection is responsible for a range of income supports including the Pandemic Unemployment Payment (PUP). The PUP is available to employees and the self-employed who have lost their job on (or after) March 13 due to the COVID-19 (Coronavirus) pandemic. Last Friday, the Government approved an extension to the PUP until 10th August 2020 with a number of changes to the payment. Further details can be accessed at this link https://www.gov.ie/en/service/be74d3-covid-19-pandemic-unemployment-payment/. I understand that thousands of people in receipt of the Pandemic Unemployment Payment have now closed or are in the course of closing their claim as they had return to work as part of the first phases of the Roadmap for the Reopening of Society and Business.  Two jobseekers benefit schemes are in place for the self-employed as well as the Social Welfare Scheme for Self-Employed Artists. The latter scheme recognises the unique creative circumstances of artists in receipt of Jobseekers Allowance and gives them special assistance in their first year out of work, allowing them to focus on their creative output.   The Temporary Wage Subsidy Scheme (TWSS) was introduced on 26 March to support the viability of firms and preserve the relationship between the employer and employee, insofar as is possible, by subsidising a portion of the employer wage bill in circumstances where the employer’s business has been negatively impacted by Covid 19. This scheme is administered by the Revenue Commissioners and along with the Pandemic Unemployment Payment (PUP), it is a significant though temporary measure that has been introduced to attempt to minimise the negative impact on the labour market through an exceptional period.  Last Friday the Government agreed that the TWSS would be extended until the end of August. Over 59,000 employers are now registered with Revenue for this scheme and over 520,900 employees have now received at least one payment under the scheme. I understand that as of 8th June, Revenue has generated further payments to employers under the scheme of €34.2 million.. Further details can be accessed at this link - https://www.gov.ie/en/press-release/455ce-minister-donohoe-announces-extension-of-temporary-wage-subsidy-scheme-until-end-augus  The Government has introduced a range of business supports for those affected by COVID-19 and many of those working in the arts, culture and audiovisual sectors may be eligible to apply for these supports. These measures aim to help these organisations to restart, reconnect and rehire staff who have been laid off or furloughed. Full details of these measures can be accessed on the gov.ie website at the following link https://www.gov.ie/en/publication/fe8f00-government-outlines-further-measures-to-support-businesses-impacted-/  The Arts Council has established a short-term Advisory Group to identify ways to address impacts of the Covid-19 Crisis on the sector. This group brings together a number of leading voices from the arts and other sectors and will report to the Arts Council on measures to sustain the arts sector through the current challenging period. I understand that the Group will complete their work shortly and I look forward to receiving their report. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_24.xml"
            }
          },
          "debateSectionId": "dbsect_24",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_24",
          "showAs": "Passport Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_24",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 24,
        "showAs": " 24. Deputy Jack Chambers asked the Tánaiste and Minister for Foreign Affairs and Trade when he expects the passport office will resume full services; if passport holders with expiring passports are advised to submit renewal applications; and if he will make a statement on the matter. [8674/20] ",
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 16, 18, 19, 24, 25, 29, 31, 36 and 38 together.  With the commencement of the COVID-19 public health emergency and the introduction of widespread travel restrictions both nationally and internationally, Irish citizens have ceased nearly all non-essential travel. This has led to a large decrease in the number of passport applications received by the Passport Service, including a decrease in applications received from applicants.  In response to this situation, the Passport Service is operating an essential, emergency service at this time. This has allowed us to both reassign staff to our consular services assisting our citizens abroad and redeploy staff to critical areas including contact tracing for the HSE and COVID-19 payments for Department of Employment Affairs and Social Protection, all critical services at this time.  The Passport Service continues to process emergency passports for our citizens at home and abroad. Almost 350 passports have issued to our citizens both at home and abroad in response to urgent requests. Our webchat service and a dedicated travel emergency mailbox continue to operate through which we can be contacted in such circumstances. In addition, our phones lines have answered over 16,000 calls from Irish citizens overseas as part of the Department’s response to the COVID-19 crisis.  The Passport Service staff cannot work remotely, they must be on site in order to process passport applications. This is to protect the personal data of the applicant and the integrity of the Irish Passport System.  The Global Irish Services Division of the Department is now focused on returning to a point when we can provide a full passport service. We will endeavour to do so as quickly as possible, while providing our staff with a safe working environment and in line with the Government’s Roadmap to reopen Ireland’s economy and society. The protection of staff is our first priority but we also recognise that providing passports is an essential public service. I encourage Deputies to stay in contact with my office for updates in relation to the Passport Service. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_101.xml"
            }
          },
          "debateSectionId": "dbsect_101",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_101",
          "showAs": "Ministerial Correspondence"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_125",
        "to": {
          "roleType": null,
          "showAs": "Public",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 125,
        "showAs": " 125. Deputy Jack Chambers asked the Minister for Public Expenditure and Reform if matters raised in correspondence (details supplied) will receive a response; and if he will make a statement on the matter. [8402/20] ",
        "answerText": " Minister for Public Expenditure and Reform  As the Deputy may be aware, the National Shared Services Office (NSSO) administer the pensions of retired civil servants.  I understand that the NSSO has now written directly to this individual on the 29th of May to address his specific concerns relating to the interaction of pension and taxation issues. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_159.xml"
            }
          },
          "debateSectionId": "dbsect_159",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_159",
          "showAs": "Departmental Correspondence"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_186",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 186,
        "showAs": " 186. Deputy Jack Chambers asked the Minister for Education and Skills if a reply will issue to correspondence (details supplied). [8633/20] ",
        "answerText": " Minister for Education and Skills  I can confirm to the Deputy that a reply has issued in relation to the correspondence in question.  I am also pleased to advise the Deputy that the school referred to received grant approval, for the provision of two mainstream classrooms, under my Department's Additional School Accommodation Scheme. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_175.xml"
            }
          },
          "debateSectionId": "dbsect_175",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_175",
          "showAs": "Schools Building Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_206",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 206,
        "showAs": " 206. Deputy Jack Chambers asked the Minister for Education and Skills the status of the development of a secondary school (details supplied); and if he will make a statement on the matter. [8788/20] ",
        "answerText": " Minister for Education and Skills  The permanent project for the school referred to by the Deputy is being delivered under my Department's Design & Build Programme.  It is anticipated that the project will proceed to tender shortly as part of a larger bundle of projects.  My Department has informed the school and it’s patron body that it will be working to have the first phase of the school's permanent accommodation handed over for occupation as early as possible in the 2021/22 school year. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_501.xml"
            }
          },
          "debateSectionId": "dbsect_501",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_501",
          "showAs": "Covid-19 Pandemic"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_579",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 579,
        "showAs": " 579. Deputy Jack Chambers asked the Minister for Health if a reply will issue to a query raised (details supplied); and if he will make a statement on the matter. [8640/20] ",
        "answerText": " Minister for Health  I propose to take Questions Nos. 579 and 621 together.  As this is an operational matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_566.xml"
            }
          },
          "debateSectionId": "dbsect_566",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_566",
          "showAs": "Covid-19 Pandemic"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_648",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 648,
        "showAs": " 648. Deputy Jack Chambers asked the Minister for Health if a series of matters (details supplied) will be addressed with regard to weddings in the context of the gradual unwinding of Covid-19 restrictions; and if he will make a statement on the matter. [9077/20] ",
        "answerText": " Minister for Health  The Government’s Roadmap for Reopening Society & Business, published on 1 May 2020, sets out an indicative path to the easing of COVID 19 restrictions and other actions in order to facilitate the reopening Ireland’s society and economy in a phased manner. The Roadmap specifies that decisions in relation to which actions will be taken and which public health measures might be lifted will be made in accordance with the Framework for Future Decision-Making which is as follows:  1. Before each Government consideration of the easing of restrictions, the Department of Health will provide a report to the Government regarding the following on/off trigger criteria:  a. The latest data regarding the progression of the disease,  b. The capacity and resilience of the health service in terms of hospital and ICU occupancy,  c. The capacity of the programme of sampling, testing and contact tracing,  d. The ability to shield and care for at risk groups,  e. An assessment of the risk of secondary morbidity and mortality as a consequence of the restrictions.  2. It will also provide risk-based public health advice on what measures could be modified in the next period.  3. The Government would then consider what restrictions could be lifted, having regard to the advice of the Department of Health as well as other social and economic considerations, e.g. the potential for increased employment, relative benefits for citizens and businesses, improving national morale and wellbeing etc.  4. It is acknowledged that there is also an ongoing possibility that restrictions could be re-imposed and this process will be carried out on an ongoing basis once every 3 weeks.  As is clear from the framework, it is the Government rather than I or my Department that will decide on any modifications to the current public health measures in place and those decisions will be informed by the status of the on/off trigger criteria and the public health advice received at the time that a decision is being made.  The exact numbers of person which it can be advised can attend events in Phase 5 have not been determined in advance. As with all other decisions under the Roadmap these will be informed, at the time that the decision is made, by the status of the on/off trigger criteria and the public health advice received. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_806.xml"
            }
          },
          "debateSectionId": "dbsect_806",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_806",
          "showAs": "Roadworthiness Testing"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_903",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 903,
        "showAs": " 903. Deputy Jack Chambers asked the Minister for Transport, Tourism and Sport if clarity will be provided on queries from an organisation (details supplied); and if he will make a statement on the matter. [8743/20] ",
        "answerText": " Minister for Transport, Tourism and Sport (Shane Ross)  Under the Road Safety Authority Act 2006 (Conferral of Functions) Order 2006 (S.I. No. 477 of 2006), the Road Safety Authority (RSA) has responsibility for the operation, oversight, development, quality assurance and delivery of CVR testing arrangements.  Accordingly, I have forwarded the Deputy's question to the RSA for direct reply.  I would ask the Deputy to contact my office if a response has not been received within ten days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Jack Chambers",
          "memberCode": "Jack-Chambers.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jack-Chambers.D.2016-10-03"
        }
      }
    }
  ]
}