{
  "head": {
    "counts": {
      "questionCount": 159,
      "resultCount": 159
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Education and Youth  I am delighted to advise the Deputy that approval has been given to Kildare and Wicklow Education and Training Board to issue the Letter of Acceptance to the preferred contractor for the project to which he refers. This will facilitate the project to progress to construction in the very near future. As the Deputy is aware, the project is part of a school campus project at Kilbride, County Wicklow. It has been devolved for delivery to KWETB.  The brief for Gaelcholáiste Na Mara is to provide a new post primary school to accommodate a long-term projected enrolment of at least 400 pupils including 2 classrooms for students with special educational needs.  The brief for Gaelscoil an Inbhir Mhóir provides for the construction of a new 16 classroom primary school including 2 classrooms for pupils with special educational needs within this new Education Campus on a greenfield site in Kilbride.  In November 2024, the campus project was authorised to proceed to Stage 3 Tender stage. In Quarter 2, 2025 the Stage 3 Tender Report was submitted to the Department. In July 2025, following a review of the submission, approval was given to KWETB to issue the Letter of Intent to the successful tenderer.  I am pleased to advise the Deputy that the approval to issue the Letter of Acceptance to the contractor was given to KWETB recently, and this will allow the project to progress to construction shortly. Once appointed, a contractor programme of works including estimated completion timelines will be shared with KWETB and the Department and this information will be provided to the school authorities.  The Department remains committed to providing ongoing guidance and practical support as required. KWETB as the delivery body will continue to engage directly with the school authority to keep it fully informed of all progress. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 410. Deputy Fionntán Ó Súilleabháin asked the Minister for Education and Youth the details of the reasons for the delay with building works for a school (details supplied) a project that was authorised by the Department of Education and Youth to proceed to the tender stage in November 2024; and if she will make a statement on the matter. [68635/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_398",
          "debateSectionId": "dbsect_398",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_398.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_410",
        "questionNumber": 410
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  GPs are self-employed practitioners and therefore may establish practices at a place of their own choosing. There is no prescribed ratio of GPs to patients, and the State does not regulate the number of GPs that can set up in any area.  Under the GMS scheme, the HSE contracts GPs to provide medical services without charge to medical card and GP visit card holders. Currently there are 2,593 GPs contracted to provide services under the GMS Scheme. A further 634 GPs do not hold a GMS contract but hold some other contract(s) with the HSE for the delivery of health services. Where a vacancy arises in a practice with a GMS contract, the HSE becomes actively involved in the recruitment process to find a replacement GP. While recruitment is ongoing, the HSE put a locum or other suitable arrangement in place to provide continuity of care for the area concerned.  Work is ongoing to increase the number of GPs practicing in across the country and thereby improve access to GP services for all patients.  Over €340 million in additional annual investment in general practice has been provided under the 2019 and 2023 GP GMS Agreements. The Agreements provide for increased GP capitation fees, increased and new supports for practices, as well as new fees for additional services. The 2023 Agreement also provided for the expansion of GP visit card eligibility in 2023 to all children under 8 years of age and all those who earn up to the median household income. Specific supports are available for eligible practices in rural areas and in areas of urban social deprivation.  The annual intake of doctors into the GP training programme has been increased by approximately 80% from 2019 to 2024, with 350 new entrant training places made available in 2024 and again in 2025. The number of new entrant training places is to increase again next year by 50 places to 400. As a result, the number of GP graduates has increased in recent years and will continue to increase in the coming years.  In addition, recruitment of GPs from abroad is ongoing under the International Medical Graduate (IMG) Rural GP Programme. As of end of Q3, there are 115 IMG GPs within the programme currently placed in general practice and a further 39 have completed the 2-year programme. The placement of IMG GPs is targeted to rural and underserved areas. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 922. Deputy Fionntán Ó Súilleabháin asked the Minister for Health to increase the number of GPs in County Wexford. [71493/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_735",
          "debateSectionId": "dbsect_735",
          "showAs": "General Practitioner Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_735.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_922",
        "questionNumber": 922
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 925. Deputy Fionntán Ó Súilleabháin asked the Minister for Health if she will consider a proposal to provide a 20-bed demountable unit at Wexford General Hospital while awaiting the completion of the new 97-bed facility, which will take three years to deliver at an estimated cost of €3 million (details supplied). [71507/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_738",
          "debateSectionId": "dbsect_738",
          "showAs": "Hospital Equipment",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_738.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_925",
        "questionNumber": 925
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  General Practitioners that hold GMS contracts for the provision of services to medical card and GP visit card holders, are required under their contract to make suitable arrangements for emergencies outside normal practice hours.  Almost 2,600 GPs now hold a GMS contract, and while they are not obliged to, most GPs participate in GP out of hours cooperatives to meet their outside of practice hours service requirements. A robust GP out of hours services ensures that, as much as possible, urgent care needs are met in the community and not in a hospital setting.  The HSE is in regular contact with all out of hours service providers to ensure that these services continue to meet the needs of their local communities.  In regard to measures to improve out of hours services, measures to reform out of hours services to ensure the delivery of an accessible high quality service are being considered as part of the Strategic Review of General Practice which is currently underway. Following its completion, a final report will be presented to me outlining the findings of the review and setting out recommended actions for a more sustainable general practice.  Furthermore, it is worth noting that as part of the measures in place to protect public health during the winter season, the HSE are providing additional funding towards out of hours GP services to increase triage capacity and GP availability in out of hours treatment centres between 6pm and 10pm from the 27th of December to the 26th of January. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 926. Deputy Fionntán Ó Súilleabháin asked the Minister for Health if she will examine ways to improve a service (details supplied) in County Wexford, with a view to reducing the number of patients who have to attend emergency departments. [71508/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_740",
          "debateSectionId": "dbsect_740",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_740.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_926",
        "questionNumber": 926
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I am delighted to advise the Deputy that approval has been given to Kildare and Wicklow Education and Training Board to issue the Letter of Acceptance to the preferred contractor for the project to which he refers. This will facilitate the project to progress to construction in the very near future. As the Deputy is aware, the project is part of a school campus project at Kilbride, County Wicklow. It has been devolved for delivery to KWETB.  The brief for Gaelcholáiste Na Mara is to provide a new post primary school to accommodate a long-term projected enrolment of at least 400 pupils including 2 classrooms for students with special educational needs.  The brief for Gaelscoil an Inbhir Mhóir provides for the construction of a new 16 classroom primary school including 2 classrooms for pupils with special educational needs within this new Education Campus on a greenfield site in Kilbride.  In November 2024, the campus project was authorised to proceed to Stage 3 Tender stage. In Quarter 2, 2025 the Stage 3 Tender Report was submitted to the Department. In July 2025, following a review of the submission, approval was given to KWETB to issue the Letter of Intent to the successful tenderer.  I am pleased to advise the Deputy that the approval to issue the Letter of Acceptance to the contractor was given to KWETB yesterday, and this will allow the project to progress to construction shortly. Once appointed, a contractor programme of works including estimated completion timelines will be shared with KWETB and the Department and this information will be provided to the school authorities.  The Department remains committed to providing ongoing guidance and practical support as required. KWETB as the delivery body will continue to engage directly with the school authority to keep it fully informed of all progress. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 98. Deputy Fionntán Ó Súilleabháin asked the Minister for Education and Youth when building works will commence for a school (details supplied) noting that this school is currently operating with a partial roof collapse since school year 2023-2024; when this building project is expected to be completed; and if she will make a statement on the matter. [68619/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_123",
          "debateSectionId": "dbsect_123",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_123.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_98",
        "questionNumber": 98
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The building project to which the Deputy refers has been devolved for delivery to the National Development Finance Agency (NDFA) as part of a programme of school building projects.  The brief is to provide a new build replacement post primary school for a long-term projected enrolment of 1,000 pupils including both general classrooms, specialist rooms, and a 4 class Special Education Needs (SEN) base.  The project is currently at Stage 2b of the architectural planning design process with a full grant of planning permission received for the school in 2024. Stage 2b is being finalised at the moment. The length of time a project takes to go through each stage varies, depending on a number of factors, including scale and complexity.  In relation to the provision of sports and recreation facilities, Department officials have engaged with the NDFA and the school authorities in order to deliver the optimum design for the school, within the parameters of the brief approved. The project includes a PE hall, a fitness suite, changing rooms, outdoor hard play courts, and a secure hard and soft play area.  The Department remains committed to providing ongoing guidance and practical support in the delivery of this project. The NDFA will continue to engage directly with the school authorities to keep them fully informed of progress on this important project.  In July, the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  The current status of all projects is listed on a county-by-county basis at www.gov.ie. under item number 10 and this is updated on a regular basis to reflect project progress through the various stages of capital appraisal, site acquisition, design, tender and construction. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 165. Deputy Fionntán Ó Súilleabháin asked the Minister for Education and Youth the status of a development (details supplied); if this includes a sports and recreation facility, noting the school provides education to approximately 1,000 students; and if she will make a statement on the matter. [68396/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_189",
          "debateSectionId": "dbsect_189",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_189.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_165",
        "questionNumber": 165
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 397, 398 and 399 together.  Any concern or allegation of a child protection nature received by staff in the Department of Education and Youth is dealt with in accordance with the Department’s Procedures for responding to Child Protection Concerns which come to the attention of staff employed by the Department.   Under these procedures, the Department does not make any judgement on the concerns which come to its attention and ensures that the details of the concern are immediately passed on to the relevant authorities, that is Tusla - the Child and Family Agency, and An Garda Síochána. The school authority is also informed of the alleged concern received. Tusla has statutory responsibility to assess all reports of child welfare and protection concerns. Tusla assesses the information received regarding the child’s situation and provides appropriate social work intervention and family support services. The role of An Garda Síochána is to investigate alleged crimes. Where it is suspected that a crime has been committed, An Garda Síochána has overall responsibility for the direction of any criminal investigation. It is the function of An Garda Síochána to interview and take any statements that will form part of the criminal investigation file.  In June 2021 my department issued correspondence to the complainant outlining how the allegations would be dealt with, in accordance with the Department's procedures. Those procedures were adhered to and Tusla, An Garda Síochána and the relevant school authority were informed of the concern raised. The advice from the Ombudsman for Children, that the matter be investigated, is in keeping with the actions taken by the department. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 397. Deputy Fionntán Ó Súilleabháin asked the Minister for Education and Youth the reason no enquiry was carried out following allegations of sexual harassment occurring in the case of a child (details supplied) as recommended by the Ombudsman; the reason no questions were asked on behalf of the family when the then Minister was present at the school after the information was disclosed to her; and if she will make a statement on the matter. [68415/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_393",
          "debateSectionId": "dbsect_393",
          "showAs": "Schools Complaints Procedures",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_393.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_397",
        "questionNumber": 397
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 397, 398 and 399 together.  Any concern or allegation of a child protection nature received by staff in the Department of Education and Youth is dealt with in accordance with the Department’s Procedures for responding to Child Protection Concerns which come to the attention of staff employed by the Department.   Under these procedures, the Department does not make any judgement on the concerns which come to its attention and ensures that the details of the concern are immediately passed on to the relevant authorities, that is Tusla - the Child and Family Agency, and An Garda Síochána. The school authority is also informed of the alleged concern received. Tusla has statutory responsibility to assess all reports of child welfare and protection concerns. Tusla assesses the information received regarding the child’s situation and provides appropriate social work intervention and family support services. The role of An Garda Síochána is to investigate alleged crimes. Where it is suspected that a crime has been committed, An Garda Síochána has overall responsibility for the direction of any criminal investigation. It is the function of An Garda Síochána to interview and take any statements that will form part of the criminal investigation file.  In June 2021 my department issued correspondence to the complainant outlining how the allegations would be dealt with, in accordance with the Department's procedures. Those procedures were adhered to and Tusla, An Garda Síochána and the relevant school authority were informed of the concern raised. The advice from the Ombudsman for Children, that the matter be investigated, is in keeping with the actions taken by the department. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 398. Deputy Fionntán Ó Súilleabháin asked the Minister for Education and Youth if she is aware that a former school principal (details supplied) was made aware of an investigation following seven reports of harassment in 2022; the reason this information was not disclosed to the family; and if she will make a statement on the matter. [68416/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_393",
          "debateSectionId": "dbsect_393",
          "showAs": "Schools Complaints Procedures",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_393.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_398",
        "questionNumber": 398
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 397, 398 and 399 together.  Any concern or allegation of a child protection nature received by staff in the Department of Education and Youth is dealt with in accordance with the Department’s Procedures for responding to Child Protection Concerns which come to the attention of staff employed by the Department.   Under these procedures, the Department does not make any judgement on the concerns which come to its attention and ensures that the details of the concern are immediately passed on to the relevant authorities, that is Tusla - the Child and Family Agency, and An Garda Síochána. The school authority is also informed of the alleged concern received. Tusla has statutory responsibility to assess all reports of child welfare and protection concerns. Tusla assesses the information received regarding the child’s situation and provides appropriate social work intervention and family support services. The role of An Garda Síochána is to investigate alleged crimes. Where it is suspected that a crime has been committed, An Garda Síochána has overall responsibility for the direction of any criminal investigation. It is the function of An Garda Síochána to interview and take any statements that will form part of the criminal investigation file.  In June 2021 my department issued correspondence to the complainant outlining how the allegations would be dealt with, in accordance with the Department's procedures. Those procedures were adhered to and Tusla, An Garda Síochána and the relevant school authority were informed of the concern raised. The advice from the Ombudsman for Children, that the matter be investigated, is in keeping with the actions taken by the department. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 399. Deputy Fionntán Ó Súilleabháin asked the Minister for Education and Youth if she was aware that in 2019 the KWETB held an investigation into complaints received by family (details supplied) regarding claims of alleged sexual harassment occurring in a school; the reason the family who submitted the complaints were not invited to participate in the investigation; the reason the family who submitted the complaints were not informed of the investigations findings; and if she will make a statement on the matter. [68417/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_393",
          "debateSectionId": "dbsect_393",
          "showAs": "Schools Complaints Procedures",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_393.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_399",
        "questionNumber": 399
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The project to which the Deputy refers is part of a school campus project at Kilbride, Co. Wicklow. It has been devolved for delivery to Kildare and Wicklow Education and Training Board (KWETB).  The brief for Gaelcholáiste Na Mara is to provide a new post primary school to accommodate a long-term projected enrolment of at least 400 pupils including 2 classrooms for students with special educational needs.  The brief for Gaelscoil an Inbhir Mhóir provides for the construction of a new 16 classroom primary school including 2 classrooms for pupils with special educational needs within this new Education Campus on a greenfield site in Arklow.  I am delighted to inform the Deputy that approval was granted to KWETB to issue a Letter of Acceptance. The project is expected to progress to construction in the very near future.  The Department remains committed to providing ongoing guidance and practical support as required. KWETB as the delivery body will continue to engage directly with the school authority to keep it fully informed of all progress. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 400. Deputy Fionntán Ó Súilleabháin asked the Minister for Education and Youth the details of the reasons for the delay with building works for (details supplied) a project that was authorised by her Department to proceed to the tender stage in November 2024; and if she will make a statement on the matter. [68618/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_394",
          "debateSectionId": "dbsect_394",
          "showAs": "Departmental Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_394.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_400",
        "questionNumber": 400
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 317. Deputy Fionntán Ó Súilleabháin asked the Minister for Health the reason Wexford General Hospital's diabetic department does not currently provide insulin pump therapy for patients in County Wexford (details supplied); and if she will make a statement on the matter. [70573/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_263",
          "debateSectionId": "dbsect_263",
          "showAs": "Medical Aids and Appliances",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_263.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_317",
        "questionNumber": 317
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 318. Deputy Fionntán Ó Súilleabháin asked the Minister for Health the number of people on the waiting list to receive a diabetic pump; the waiting times, broken down per county, in tabular form; and if she will make a statement on the matter. [70574/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_264",
          "debateSectionId": "dbsect_264",
          "showAs": "Medical Aids and Appliances",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_264.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_318",
        "questionNumber": 318
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Health  As the Health Service Executive is responsible for the delivery of public healthcare infrastructure projects, I have asked the HSE to respond to you directly in relation to this matter. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 319. Deputy Fionntán Ó Súilleabháin asked the Minister for Health if she will approve a 20-bed demountable unit for Wexford General Hospital, noting the serious need for such following ambulance delays reported on 3 December 2025; and if she will make a statement on the matter. [70579/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_265",
          "debateSectionId": "dbsect_265",
          "showAs": "Hospital Equipment",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_265.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_319",
        "questionNumber": 319
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "showAs": " 90. Deputy Fionntán Ó Súilleabháin asked the Minister for Housing, Local Government and Heritage the amount of housing adaptation grant funding that will be provided in 2026 for counties Wicklow and Wexford; the number of social housing tenants that are awaiting essential works in both counties to date, by age category, in tabular form; and if he will make a statement on the matter. [59145/25] ",
        "debateSection": {
          "showAs": "Housing Schemes",
          "debateSectionId": "dbsect_115",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_115",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_115.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Fionntán Ó Súilleabháin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "questionNumber": 90,
        "answerText": " Minister for Housing, Local Government and Heritage  My Department provides funding to local authorities under the Disabled Persons Grants scheme (DPGs) to carry out works on social homes to address the needs of older people, people with a disability or overcrowded situations. Typical works include adaptations such as stair-lifts, level deck showers, ramps and grab rails, widening door opening widths, and improving circulation spaces. Extensions to provide for ground floor bathrooms and bedrooms can also be supported.  The programme will provide €25m to local authorities in 2025 The budget for 2026 will increase and the details will be finalised shortly.  My Department will shortly request local authorities to identify their expected funding requirements for 2026. This process ensures local authorities are able to meet the needs of their tenants within the available funding envelope, while emergency cases will be provided for as they arise throughout the year.  Prior to formally notifying local authorities of their allocations for 2026, and to remove impediments to priority works, they are allowed to commit up to a maximum value of 65% of this year's allocation on works to completed next year.  Once allocations allocations for next year are notified, it will be a matter for each local authority to prioritise the works required within the funding available and per the terms of the DPG scheme.  Data on the number of tenants awaiting essential works are not collected by my Department and should be sought directly from the respective local authorities. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_90",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "showAs": " 133. Deputy Fionntán Ó Súilleabháin asked the Minister for Enterprise, Tourism and Employment the supports that will be made available to the one hundred employees who are due to lose their jobs in 2028 (details supplied); and if he will make a statement on the matter. [64243/25] ",
        "to": {
          "roleType": null,
          "showAs": "Enterprise",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_107.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_107",
          "showAs": "Job Losses",
          "debateSectionId": "dbsect_107"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_133",
        "answerText": " Minister for Enterprise, Tourism and Employment  As the Deputy will be aware, last month Merck made the decision to wind down operations at its Arklow facility by the end of 2028 following a strategic portfolio product review. Other operations in Ireland are unaffected.  While on a recent visit to Wexford and Wicklow, I visited the Arklow site and met with local staff representatives. I can assure the Deputy that the State’s agencies will provide every support available to those affected by this decision, and all efforts will be made to explore options for the future use of the site.  Indeed, my foremost concern is for the potentially impacted employees and their families during this uncertain time. To this end, IDA Ireland has activated internal processes for responding to the potential and actual job loss situation with this client company.  IDA Ireland is engaged with the company both at a site level in Arklow and at their German HQ in order to achieve the best outcome for the site. IDA will be exploring all options with the company.  IDA Ireland must also be respectful of any consultation process underway by the company with its employees and/or representatives. In the meantime, all stakeholders are conscious that the company continues to operate with a significant workforce.  In the event of job losses, the established protocols sees the IDA partnering with other support agencies at a local level to implement the Job Loss Protocol. IDA provides a coordinated response by relevant Government Departments and Agencies at a local level to support impacted employees in the event of a significant job loss announcement. However, this work may not formally commence until after the staff consultation period has been concluded. The types of supports/initiatives provided by local agencies can include the following:  • Outplacement employment support services and potential training opportunities may be provided/facilitated by the company and/or other providers (ETBs/Skillnet, etc..) to support impacted employees.  • Provision of a detailed skills profile for the employees on the site; and when individuals will be available, which can be shared with other potential employers.  • Recruitment opportunities through identification and connection with other employers who may be hiring across the locality and wider region.  • Marketing of the property solution, when appropriate through agents appointed by the company, and by IDA Ireland through its global office network.  • Information sessions by the Department of Social Protection's Intreo Office to impacted employees on social welfare services and employment support services to support impacted employees’ transition to new employment opportunities.  • Identification and provision of training and further education opportunities for employees e.g. ETBs; Skillnet; Universities.  • Exploring opportunities to start your own business through LEO’s and Enterprise Ireland. ",
        "questionNumber": 133
      },
      "contextDate": "2025-11-19"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "showAs": " 160. Deputy Fionntán Ó Súilleabháin asked the Minister for Housing, Local Government and Heritage the supports available to people awaiting a division of assets, for example sale of a jointly owned home, through the courts for a legal separation/divorce who require social housing; and if he will make a statement on the matter. [64244/25] ",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_134.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_134",
          "showAs": "Housing Provision",
          "debateSectionId": "dbsect_134"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_160",
        "answerText": " Minister for Housing, Local Government and Heritage  Applications for social housing support are assessed by the relevant local authority, in accordance with the eligibility and need criteria set down in section 20 of the Housing (Miscellaneous Provisions) Act 2009, as amended, and the associated Social Housing Assessment Regulations 2011, as amended.  A household shall be ineligible for social housing support if that household has alternative accommodation it could reasonably be expected to use to meet its housing need. However, where an applicant for social housing support owns accommodation occupied by a spouse, from whom they are formally separated or divorced, a deed of separation is sufficient to set aside this ineligibility ground. It is not necessary to await judicial separation or divorce to get a decision on social housing support in these cases.  Local authorities may provide such households with social housing support under the Rental Accommodation Scheme (RAS) or the Housing Assistance Payment (HAP) scheme until ownership of the family home is resolved in a formal separation or divorce settlement.  Support in these circumstances will be reviewed by the local authority at prescribed intervals and the household will not be able to transfer to other forms of social housing support while ownership of the family home remains to be determined. However, where the household ultimately qualifies for the full range of social housing supports, the length of time the household was supported under RAS or HAP will be reckonable for the purposes of determining the household’s relative priority for a transfer to local authority social housing. ",
        "questionNumber": 160
      },
      "contextDate": "2025-11-19"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "showAs": " 189. Deputy Fionntán Ó Súilleabháin asked the Minister for Justice, Home Affairs and Migration when works will commence for the new prison planned for Thornton Hall, given the record funding of €2.180 billion for An Garda Síochána, prisons, courts, cyber security and technology; the reason there has been such a significant delay for this development; and if he will make a statement on the matter. [64246/25] ",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_163.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_163",
          "showAs": "Prison Service",
          "debateSectionId": "dbsect_163"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_189",
        "answerText": " Minister for Justice, Home Affairs and Migration  A record capital investment of €67.9 million is being provided to the Irish Prison Service in 2026 and this forms part of a total capital investment of €527 million for the period 2026 to 2030. €495 million is being provided for capital works to build 1,595 prison spaces by 2031.  This will be the largest ever building programme in the prison estate and will include a new prison on the site of the old Cork prison, a new block in Wheatfield, an additional block extension at Midlands prison, as well as additional spaces at Castlerea, Mountjoy, Cloverhill, Portlaoise, Limerick and Dóchas. It will also fund planning and commencement of the construction of a new prison at the Thornton site in North County Dublin.  A master plan for the Thornton site will be developed in 2026, determining its future use as a combined site for use by the IPS, International Protection Accommodation Services and An Garda Síochána. ",
        "questionNumber": 189
      },
      "contextDate": "2025-11-19"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 692,
        "showAs": " 692. Deputy Fionntán Ó Súilleabháin asked the Minister for Housing, Local Government and Heritage the number of housing units that have been realised in the past five years from projects that availed of the vacant homes refurbishment grant in County Wicklow and County Wexford, in tabular form; and if he will make a statement on the matter. [64003/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Housing"
        },
        "by": {
          "showAs": "Fionntán Ó Súilleabháin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_692",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_541",
          "showAs": "Housing Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_541",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_541.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Housing, Local Government and Heritage  The Vacant Property Refurbishment Grant, introduced in July 2022 under the Croí Cónaithe fund, provides a grant of up to €50,000 for the refurbishment of vacant properties for occupation as a principal private residence and for properties which will be made available for rent. A top-up grant of up to €20,000 is available where the property is confirmed to be derelict, bringing the total grant available for a derelict property up to a maximum of €70,000. In order to qualify for the grant, the property must be vacant for two years or more at the time of application.  My Department publishes data on applications for the Vacant Property Refurbishment Grant on its website on a quarterly basis, which includes the number of applications, approvals and the total number and value of grants paid per local authority. This data also includes a breakdown of applications for the Vacant Property Refurbishment Grant and the Derelict Property Top-up Grant for every quarter. The Q3 2025 grant statistics were published on 17 October 2025. This data and previous years data can be accessed at the following link: Vacant Property Refurbishment Grant statistics. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 693,
        "showAs": " 693. Deputy Fionntán Ó Súilleabháin asked the Minister for Housing, Local Government and Heritage if there has been an increase in homeless figures since his Department changed the criteria for tenant in situ scheme specifically confirming the number of persons currently homeless in County Wicklow and County Wexford, in tabular form; and if he will make a statement on the matter. [64007/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Housing"
        },
        "by": {
          "showAs": "Fionntán Ó Súilleabháin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_693",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_543",
          "showAs": "Homeless Accommodation",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_543",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_543.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Housing, Local Government and Heritage  Supporting individuals and families experiencing or at risk of experiencing homelessness is a priority for my Department and Government.  Increased supply is key to addressing homelessness, meeting need and addressing the challenges in the housing market. Government is fully committed to working with all stakeholders to deliver social, affordable and cost rental homes at scale and to continue accelerating housing supply across all tenures. A record level of investment is being provided for the delivery of housing in 2026, with €5.2bn in Exchequer capital funding complemented by investment through the Land Development Agency (LDA) and lending from the Housing Finance Agency (HFA), bringing the total capital funding for housing in 2026 to over €9 billion. This record level of funding is supporting the delivery of social, affordable and cost rental homes. The 2026 capital funding will be supplemented by over €2 billion in current funding to address housing needs.  Over the last three years, my Department has provided funding for second hand acquisitions for a number of priority categories, including tenant-in-situ. Despite some coverage to the contrary, the eligibility criteria for tenant-in-situ acquisitions in 2025 is largely the same as guidance issued in June 2024 and not substantially different to what was required in 2023. The Government committed €325 million to support a second-hand acquisitions programme in 2025 which was apportioned across all 31 local authorities. Funding for the Second Hand Acquisitions Programme for 2026 will be agreed later this year, with individual allocations notified to local authorities as soon possible thereafter.  This substantial financial investment will support local authorities to acquire second-hand properties for priority categories of need including tenants-in-situ who have been in receipt of supports under HAP or RAS and who had received a Notice of Termination. The other priority categories for second-hand acquisitions are properties that allow persons/families to exit homelessness; one-bedroom properties to deliver on Housing First targets; specific housing required for people with a disability or the elderly and vacant properties under the Buy & Renew scheme.  Delivering Homes, Building Communities commits to maintaining a targeted Second Hand Social Housing Acquisitions Programme to support those households in the most precarious housing situations. The programme will support acquisitions for priority categories of need, including exits from long term homelessness, tenancy sustainment, urgent responses for persons with disabilities, for older persons, for care leavers, and Housing First tenancies. In respect of tenancy sustainment the acquisitions programme will continue to act as a necessary last resort policy tool available to local authorities to help prevent individuals or families falling into homelessness.  My Department currently gathers and publishes data on a monthly basis on the number of homeless persons accommodated in emergency accommodation funded and overseen by local authorities. These reports are based on data provided by local authorities, produced through the Pathway Accommodation & Support System (PASS).  While responsibility for the provision of homeless accommodation and related services rests with individual housing authorities, the administration of homeless services is organised on a regional basis with a lead authority in place for each region. County Wicklow is included in the Mid East region with Kildare County Council as the lead authority. County Wexford is included in the South East region for the purposes of homeless administration, with Waterford City and County Council as lead authority.  The monthly homelessness report includes details of individuals, families and the dependants of these families who accessed emergency accommodation during the relevant count week of the month in question. The report also includes the number of adults in emergency accommodation by age band and region. The most recently published data is in respect of September 2025. The reports are collated on a regional basis and are available on my Department's website at the following link: www.gov.ie/en/department-of-housing-local-government-and-heritage/collections/homelessness-data/ and are also published to the Department of Public Expenditure, Infrastructure, Public Service Reform and Digialisation's open data portal data.gov.ie/.  My Department also publishes quarterly progress reports which are based on quarterly performance reports submitted by the nine regional lead authorities responsible for the administration of homeless services at local level. These quarterly performance reports include information on presentations to homeless services by single adult and family households who entered emergency accommodation. The most recent published data is in respect of Q3 2025 and is available on my Department’s website at the following link: www.gov.ie/en/department-of-housing-local-government-and-heritage/collections/homelessness-data/. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 879,
        "showAs": " 879. Deputy Fionntán Ó Súilleabháin asked the Minister for Agriculture, Food and the Marine if he will report on his engagements on the Mercosur Trade Agreement. [64000/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Agriculture"
        },
        "by": {
          "showAs": "Fionntán Ó Súilleabháin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_879",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_678",
          "showAs": "Trade Agreements",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_678",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_678.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Agriculture, Food and the Marine  Along with the Tánaiste, who has lead responsibility for trade policy, I have actively engaged with both the European Commission and with other Member States across the EU to voice Ireland’s concerns in relation to the EU-Mercosur Agreement.  During these engagements, the Tánaiste and I have also repeatedly emphasised Ireland’s requirements for credible, legally-binding commitments on matters relating to trade and sustainable development, including climate, biodiversity, and deforestation protections. We have repeatedly emphasised that beef in particular is a very sensitive sector, which is vulnerable to negative impacts from the Mercosur agreement.  Since my appointment as Minister earlier this year, I have raised these concerns at Agri-Fish Council meetings and also with like-minded Member States through bilateral meetings on the margins of these Council meetings. In recent months, I have met with my French, Austrian, Latvian and Polish counterparts to exchange views.  Ireland's position on the EU-Mercosur Agreement remains as clearly outlined in the Programme for Government: ‘Work with like-minded EU countries to stand up for Irish farmers and defend our interests in opposing the current Mercosur trade deal”. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 880,
        "showAs": " 880. Deputy Fionntán Ó Súilleabháin asked the Minister for Agriculture, Food and the Marine the way in which he plans to safeguard Irish farm competitiveness in the face of ongoing EU trade negotiations, including Mercosur; if he will request mandatory safeguards to prevent Irish beef, dairy, and tillage producers being undermined by imports produced to lower standards; and if he will make a statement on the matter. [64001/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Agriculture"
        },
        "by": {
          "showAs": "Fionntán Ó Súilleabháin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_880",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_679",
          "showAs": "Agriculture Industry",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_679",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_679.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Agriculture, Food and the Marine  The Programme for Government makes two clear commitments regarding agriculture and new Free Trade Agreements. Firstly, it states that the Government will \"promote new Free Trade Agreements, ensuring proper assurances regarding sustainability, human rights and the protection of our agricultural sector”. The protection of our agricultural sector is paramount in Ireland’s position on new trade agreements.  On Mercosur, the Programme for Government is clear in its commitment to “work with like-minded EU countries to stand up for Irish farmers and defend our interests in opposing the current Mercosur trade deal.\"  Irish and EU farmers are subject to complex regulations requiring them to farm in a sustainable manner, which is why it is important to ensure that farmers in Mercosur countries are subject to the same requirements.  As part of the European Commission’s recent announcement on the proposal for the ratification of the EU-Mercosur Agreement, the Commission has committed to increasing the number of audits and checks in third countries, and strengthening SPS controls on the ground.  More recently, the Commission has also brought forward a regulation on safeguards for sensitive agricultural products in the context of the EU-Mercosur Agreement. This proposed regulation makes a number of commitments regarding applying safeguard measures in terms of transparency, monitoring and speed of response.  Ireland has sought clear, transparent and regular two-way engagement on the monitoring of the market situation for sensitive products, as well as some clarity on definitions within the regulation and the use of surveillance measures. We will continue to engage with the Commission on these issues. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Housing, Local Government and Heritage  Government is committed to delivering housing at scale across all tenures to meet the needs in Wicklow and Wexford. To help achieve this, last year, Government approved new national housing targets up to the year 2030. 303,000 homes will aim to be delivered in the period from 2025 to 2030, equating to an annual average of 50,500 homes, building up to 60,000 in 2030.  The revised targets were informed by research and modelling by the Economic and Social Research Institute (ESRI) on population projections and long-run housing demand. The revised national housing targets will inform the revision to existing social and affordable housing targets at a local authority level, ensuring that allocations reflect both housing need and population growth.  Work is ongoing in this regard and updated targets for each local authority, including Wicklow and Wexford for 2026-2028, will be set out as part of the next phase of planning for social and affordable housing delivery. These revised targets will align with the updated National Planning Framework and with the results of the Housing need and Demand Assessment (HNDA) process. The HNDA provides evidence based insights into the local housing requirements for both Wicklow and Wexford.  To ensure that local authority development plans reflect the requirements of the National Planning Framework in respect of housing as soon as possible, I issued the NPF Implementation: Housing Growth Requirements Guidelines under section 28 of the Planning and Development Act 2000 in July 2025. These Guidelines set out the housing demand scenario to 2040 for each local authority, by translating the NPF housing requirements into average annual figures and set out the requirement for planning authorities to commence the process of varying their development plan to meet the new housing growth requirements.  The Government remains fully committed to working with all stakeholders to deliver social homes at scale and to continue accelerating housing supply across all tenures. This is demonstrated by the record level of investment which is being provided for the delivery of housing in 2025, with overall capital funding now allocated by Government of almost €7.5 billion. The capital provision for 2025 is supplemented by a further €1.65 billion in current funding.  In general, my Department does not provide specific funding allocations to local authorities, rather funding for housing programmes is made to the local authorities as programmes and projects advance and relevant claims fall due for payment.  A funding allocation is provided to local authorities for the second hand social housing acquisitions programme. Funding for the 2026 second-hand acquisitions programme will be agreed shortly following completion of 2026 Estimates process. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_311",
        "debateSection": {
          "debateSectionId": "dbsect_304",
          "showAs": "Housing Provision",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_304",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_304.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Housing"
        },
        "questionNumber": 311,
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 311. Deputy Fionntán Ó Súilleabháin asked the Minister for Housing, Local Government and Heritage the social housing allocation for County Wicklow and County Wexford for 2026, in tabular form; and if he will make a statement on the matter. [62448/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Housing, Local Government and Heritage  The Ready to Build Scheme, funded by the Croí Cónaithe Towns Fund, to support addressing vacancy, was launched in September 2022. Under the Scheme, local authorities can make vacant serviced sites in towns and villages available to potential individual purchasers to build a home.  Under the scheme, local authorities identify suitable vacant sites in their ownership or purchase vacant sites in towns and villages and make them available for sale to individual purchasers for the purpose of building a principal private residence. Once serviced, the local authority will make the site available for sale at a discount on the market value of the site. The level of discount to the individual will depend on the level of servicing cost incurred by the local authority before the sale of the site, up to a maximum of €30,000.  The scheme is managed and administered by local authorities on behalf of my Department. To date 32 sites have been made available for sale by 4 local authorities, 5 sites in Wicklow, 16 sites in Laois, 4 sites in Tipperary and 7 sites by Kildare County Council. The relevant local authority assesses the applications they receive based on the framework of priorities contained in the scheme outline.  A further 100+ sites have been identified by various local authorities for possible inclusion in the scheme. These sites are at various stages of consideration to determine the costs involved to service the sites and ascertaining the potential level of interest in site purchase. The Vacant Homes Unit in my Department is continuing to engage with local authorities in relation to these sites.  While there are currently no sites available for sale under the scheme by Wexford County Council, I understand from Wexford County Council that they intend to work to identify sites that may qualify under the scheme. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_312",
        "debateSection": {
          "debateSectionId": "dbsect_305",
          "showAs": "Housing Provision",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_305",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_305.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Housing"
        },
        "questionNumber": 312,
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 312. Deputy Fionntán Ó Súilleabháin asked the Minister for Housing, Local Government and Heritage the reason Wexford County Council is not providing ready to build scheme serviced sites; and if he will make a statement on the matter. [62449/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_452",
        "debateSection": {
          "debateSectionId": "dbsect_430",
          "showAs": "Health Screening Programmes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_430",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_430.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Health"
        },
        "questionNumber": 452,
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 452. Deputy Fionntán Ó Súilleabháin asked the Minister for Health the number of patients currently waiting for BreastCheck screening in counties Wicklow and Wexford; the length of time they have been waiting; the number of patients carried over on the waiting list from 2024 who were not seen on time; and if she will make a statement on the matter. [62450/25] "
      }
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  It is a central priority for me that Ireland’s immigration system is robust, and rules based. The enforcement aspects of our laws, including deportation orders, are an essential requirement for the system to work effectively and to ensure that there is confidence in the application of our legislation in this area.  Deportations are costly and complex to enforce. It is the preferred option to return people voluntarily and my Department has a voluntary return programme to assist people to return prior to the issuance of a deportation order. A person can only avail of voluntary return before a deportation order is issued and I have increased resources into this programme to enable people who wish to return before a deportation order is issued to them.  A deportation order is a legal order to leave the State. If a person does not remove themselves from the State following the issuance of a deportation order, they will be removed, and my Department has taken action to significantly improve immigration enforcement measures and increase removals.  The number of deportation orders signed in 2024 (2,403) increased by 180% compared to 2023 (857). This year 4,022 deportation orders have been signed up to 7 November 2025.  So far in 2025, six charter flight operations have removed 205 people from the State. Of these, five operations to non-EU destinations removed 182 people who were subject to deportation orders and one operation removed 23 EU citizens on grounds of criminality. Further removals will be conducted as the year progresses.  The table below illustrates the total number of returns in 2024 and up to 7 November 2025.      Year      2024      2025 (to 7 Nov)       Enforced Deportations    134    146      Otherwise Confirmed Deportations*    28    46      Removed by Charter    N/A    182       Total Deportations      162      374       Other Removals**    26    49      Number of Voluntary Returns    934    1,377       Total Removed      1,122      1,800      Please note, figures are correct at time of issue, however, all statistics may be subject to data cleansing.  *Otherwise confirmed deportations is where it has been confirmed a person has left the state following receipt of a deportation order without being escorted.  **Other removals include Dublin III Transfer Orders of International Protection applicants to another EU State and EU Removal Orders for the return of EU Citizens under the Free Movement Regulations (these orders are made on grounds of criminality) and people who are deemed inadmissible under the International Protection Act.  As there are no routine exit checks at Irish borders, it is not possible to accurately provide the number of people who are currently in Ireland subject to deportation orders. Since 2020 over 300 of the people subject to deportation orders above have confirmed they have left the State independently.  It should be noted that many will have left the State without informing the authorities.  I am informed that the Garda National Immigration Bureau has reviewed a large sample of cases of people subject to deportation orders; their inquiries suggest a very significant number of these people have left the State.  The table below details the number of deportation orders made in respect of people who have been refused International Protection from 2021 up to 7 November 2025.      Year      2022      2023      2024      2021**      2025*       Deportation orders signed under Section 51 of the International Protection Act 2015.    541    765    2,001    0    3,017     *Data up to 7 November - Please note, figures are correct at time of issue, however, all statistics may be subject to data cleansing.  ** During the COVID- 19 Pandemic there was a moratorium on deportations. This was effective during the latter part of 2020, 2021 and for the first 8 months of 2022. During the moratorium only persons who whose presence in Ireland would be contrary to the public interest were deported. This moratorium was lifted in July 2022.  While information is kept on each individual file in relation to when a deportation order has been issued, their place of residence, and if they have been refused international protection in another EU country, this information is not collated in the manner requested by the Deputy. ",
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Fionntán Ó Súilleabháin",
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_662.xml"
            }
          },
          "debateSectionId": "dbsect_662",
          "showAs": "Deportation Orders",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_662"
        },
        "questionNumber": 760,
        "date": "2025-11-12",
        "showAs": " 760. Deputy Fionntán Ó Súilleabháin asked the Minister for Justice, Home Affairs and Migration the number of IPAS applicants which have been issued with a deportation order but remained in Ireland over the past five years, by county; the length of time they have remained in Ireland since being issued with the order; the number of which were refused asylum in another EU country; and if he will make a statement on the matter. [61539/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_760"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_379",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Fionntán Ó Súilleabháin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_342",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_342",
          "showAs": "Meals-on-Wheels Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_342.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "showAs": " 379. Deputy Fionntán Ó Súilleabháin asked the Minister for Health if she will seek funding for a service (details supplied) in Courtown, County Wexford, as a matter of urgency, to prevent this vital service closing on 6 November 2025; and if she will make a statement on the matter.  [60893/25] ",
        "questionNumber": 379,
        "answerText": " Minister of State at the Department of Health (Deputy Kieran O'Donnell)  Meals on Wheels services in our communities provide a valuable support to older people helping them to maintain their health and independence through the provision of healthy meals. I recognise the importance of this service and Government has committed to “Increase funding for the national Meals on Wheels network and develop a plan to ensure there are supported providers in every town in the country.”  To support this work, I have secured a substantial €2 million in additional funding for Meals on Wheels services for 2026. This represents a year-on-year increase in funding for this service of over 30%.  The HSE has operational responsibility for the management and delivery of all health services, including Meals on Wheels services. The HSE also has sole responsibility for the reviewing of business cases received from individual providers seeking funding for the provision of their services, as well as establishing service level agreements with service providers.  The HSE has advised the Department that at present all agreed funding under the Grant Aid Agreements signed for 2024 and 2025 has been provided to Gorey Meals on Wheels to date and that Gorey Meals on Wheels are currently paid in full on a monthly basis for their service provision.  The HSE has also advised that a meeting is being organised with the service manager for Gorey Meals on Wheels for Wednesday the 26th of November 2025, to discuss the 2026 Grant Aid Agreement for this service including any funding requests by Gorey Meals on Wheels for the expansion of this service. Any funding requests must be considered by the HSE under its standardised annual processes, taking into account local needs, prioritisation of all relevant requests and the availability of funding. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_380",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Fionntán Ó Súilleabháin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_343",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_343",
          "showAs": "Meals-on-Wheels Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_343.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "showAs": " 380. Deputy Fionntán Ó Súilleabháin asked the Minister for Health if she will meet with all stakeholders involved with a service (details supplied) to secure the future of the Courtown service; and if she will make a statement on the matter. [60894/25] ",
        "questionNumber": 380,
        "answerText": " Minister of State at the Department of Health (Deputy Kieran O'Donnell)  Meals on Wheels services in our communities provide a valuable support to older people helping them to maintain their health and independence through the provision of healthy meals. I recognise the importance of this service and Government has committed to “Increase funding for the national Meals on Wheels network and develop a plan to ensure there are supported providers in every town in the country.”  To support this work, I have secured a substantial €2 million in additional funding for Meals on Wheels services for 2026. This represents a year-on-year increase in funding for this service of over 30%.  The HSE has operational responsibility for the management and delivery of all health services, including Meals on Wheels services. The HSE also has sole responsibility for the reviewing of business cases received from individual providers seeking funding for the provision of their services, as well as establishing service level agreements with service providers.  The HSE has advised the Department that at present all agreed funding under the Grant Aid Agreements signed for 2024 and 2025 has been provided to Gorey Meals on Wheels to date and that Gorey Meals on Wheels are currently paid in full on a monthly basis for their service provision.  The HSE has also advised that a meeting is being organised with the service manager for Gorey Meals on Wheels for Wednesday the 26th of November 2025, to discuss the 2026 Grant Aid Agreement for this service including any funding requests by Gorey Meals on Wheels for the expansion of this service. Any funding requests must be considered by the HSE under its standardised annual processes, taking into account local needs, prioritisation of all relevant requests and the availability of funding. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 325. Deputy Fionntán Ó Súilleabháin asked the Minister for Transport the reason there was no supplementary roads budget received for 2025 for County Wexford; if there will be an increase in 2026 to replace the supplementary roads budget; in tabular form; and if he will make a statement on the matter. [58837/25] ",
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_325",
        "questionNumber": 325,
        "answerText": " Minister for Transport  The improvement and maintenance of regional and local roads is the statutory responsibility of each local authority, in accordance with the provisions of Section 13 of the Roads Act 1993. Works on those roads are funded from Councils' own resources, which are supplemented by State grants for regional and local roads.  On 14th February 2025 I announced an Exchequer investment of €713 million for our regional and local roads across the State which represents an overall increase of over 8% in funding this year. The main focus of the grants continues to be the protection and renewal of the regional and local road network.  All 2025 grant funding available to the Department for regional and local roads has now been allocated.  As regards 2026, regional and local road grant allocations will be finalised following the publication of the Revised Estimates Volume and will take into account the expenditure outturn on projects and programmes in the preceding year. Within the budget available, the objective is to allocate funding to eligible local authorities on as equitable a basis as possible taking the length of the road network into account. ",
        "debateSection": {
          "showAs": "Road Network",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_300",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_300.xml"
            }
          },
          "debateSectionId": "dbsect_300"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 326. Deputy Fionntán Ó Súilleabháin asked the Minister for Transport if he will provide roads funding on a needs basis, focusing on the condition of road as opposed to the current system which allocates funding based on kilometre of road, given that County Wexford’s roads conditions are amongst the worst conditions nationally; in view of the fact funding received for County Wexford cannot finance the works required to improve the overall roads conditions across the county; and if he will make a statement on the matter. [58838/25] ",
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_326",
        "questionNumber": 326,
        "answerText": " Minister for Transport  The improvement and maintenance of regional and local roads is the statutory responsibility of each local authority, in accordance with the provisions of Section 13 of the Roads Act 1993. Works on those roads are funded from Councils' own resources, which are supplemented by State grants for regional and local roads.  On 14th February 2025 I announced an Exchequer investment of €713 million for our regional and local roads across the State which represents an overall increase of over 8% in funding this year. The main focus of the grants continues to be the protection and renewal of the regional and local road network.  As regards the basis for allocating grants, within the budget available for the regional and local road grant programme, the Department's grant funding for the maintenance of regional and local roads is allocated on as fair and equitable a basis as possible to eligible local authorities. In this context, grants in the main grant categories are allocated based on the length of the road network within a local authority's area of responsibility with some account taken of traffic. It is envisaged that grants will continue to be made available on that basis.  Basing regional and local roads grant allocations on road conditions could result in an unequitable distribution of Exchequer funding. For example, local authorities that allocate higher levels of own resources funding to regional and local roads will have a larger proportion of roads with a higher condition rating than those with lower levels of own resources funding. Basing allocations on road condition could therefore disincentivise local authorities from allocating own resources funding to roads maintenance.  The Department appreciates that, within the overall parameters set for the grant programme, local authorities might need to target funding at particular problem areas and there is sufficient flexibility in the structure of the grant programme to allow for this. It is also open to each local authority to allocate its own resources to priority areas.  It should be noted that Exchequer funding for regional and local roads is intended to supplement realistic contributions from local authorities’ own resources. As the statutory road authorities for their areas, it is open to local authorities to prioritise investment on regional and local roads. ",
        "debateSection": {
          "showAs": "Road Network",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_301",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_301.xml"
            }
          },
          "debateSectionId": "dbsect_301"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Finance",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 499. Deputy Fionntán Ó Súilleabháin asked the Minister for Finance the reasons for the decision to implement a derelict property tax as opposed to a vacant property tax in Budget 2026; and if he will make a statement on the matter. [59172/25] ",
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_499",
        "questionNumber": 499,
        "answerText": " Minister for Finance  In Budget 2026, I announced the introduction of a new Derelict Property Tax (DPT). The aim of this tax will be to encourage the activation of derelict properties. This tax will replace the Derelict Sites Levy and will be collected by the Revenue Commissioners. Currently, the Derelict Sites Levy is an annual levy of 7% of the land’s market value. The rate of DPT is yet to be determined; however, it is envisaged that the rate of the new tax would not be lower than the existing 7% rate.  Introducing this new tax will take time to ensure that Revenue and local authorities can put in place the necessary arrangements for the tax to operate as intended. For this reason, I intend to bring forward legislation providing for the DPT in 2026.  A Vacant Homes Tax (VHT) was announced in Budget 2023 and legislated for in Finance Act 2022. A residential property is within the scope of the tax if it has been occupied as a dwelling for less than 30 days in a chargeable period. The tax operates on a self-assessment basis, where the number of properties in scope and the amount of tax payable depends on the self-assessed returns submitted by property owners, the number of properties declared as liable, and the number of property owners entitled to claim available exemptions from the tax. Each chargeable period commences on 1 November and ends on 31 October of the following year.  The tax has been in operation for nearly three years. VHT was charged at three times a property’s base local property tax (LPT) charge in respect of the first chargeable period (1 November 2022 – 31 October 2023), and at five times a property’s base LPT charge in respect of the second chargeable period (1 November 2023 – 31 October 2024). VHT currently applies at a rate of seven times a property’s base LPT charge with effect from 1 November 2024.  Statistics in relation to VHT are published on Revenue’s website at: www.revenue.ie/en/corporate/information-about-revenue/statistics/property-taxes/yearly-stats/2025/index.aspx  The new DPT will operate alongside the VHT to ensure that both vacancy and dereliction are discouraged through the tax system.  The VHT is one of a suite of measures which were introduced to address vacancy under Pathway 4 of the Housing for All plan. Initiatives such as the Vacant Property Refurbishment Grant and Ready to Build Scheme, under the Croí Cónaithe Towns Fund, provide financial incentives for people to buy and refurbish vacant properties and sites. The Repair and Leasing and Buy and Renew Schemes support Local Authorities in leasing or buying vacant properties from owners to assist in the provision of social housing. The CPO Activation Programme was introduced as a proactive and systematic approach by local authorities in identifying and engaging with vacant and derelict properties, with the aim of bringing such properties back into use through various means, including through use of compulsory purchase powers.  Other actions to tackle vacancy include funding full-time vacant homes officers in every Local Authority; allowing exemptions to planning permissions to convert vacant commercial premises to residential use; and enhancing the Nursing Homes Support/Fair Deal Scheme to incentivise the productive use of vacant homes.  My Department continues to monitor all aspects of the property market and I will continue to work with my colleagues in Government to ensure that any further interventions in the housing market are appropriately calibrated, represent the best use of scarce public resources, and assist with boosting the supply of much-needed housing in the State. ",
        "debateSection": {
          "showAs": "Tax Code",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_465",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_465.xml"
            }
          },
          "debateSectionId": "dbsect_465"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1054. Deputy Fionntán Ó Súilleabháin asked the Minister for Housing, Local Government and Heritage if he will increase the housing allocation for counties Wicklow and Wexford under the housing-for-all programme for 2026, 2027 and 2028; in tabular form; and if he will make a statement on the matter. [58831/25] ",
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1054",
        "questionNumber": 1054,
        "answerText": " Minister for Housing, Local Government and Heritage  Under Housing for All, the Government is committed to delivering housing at scale across all tenures to meet the needs in Wicklow and Wexford. To help achieve this, last year, Government approved new national housing targets up to the year 2030. 303,000 homes will aim to be delivered in the period from 2025 to 2030, equating to an annual average of 50,500 homes, building up to 60,000 in 2030.  The revised targets were informed by research and modelling by the Economic and Social Research Institute (ESRI) on population projections and long-run housing demand. The revised national housing targets will inform the revision to existing social and affordable housing targets at a local authority level, ensuring that allocations reflect both housing need and population growth.  Work is ongoing in this regard and updated targets for each local authority, including Wicklow and Wexford for 2026-2028, will be set out as part of the next phase of planning for Housing for All delivery. These revised targets will align with the updated National Planning Framework and with the results of the Housing need and Demand Assessment (HNDA) process. The HNDA provides evidence based insights into the local housing requirements for both Wicklow and Wexford.  To ensure that local authority development plans reflect the requirements of the National Planning Framework in respect of housing as soon as possible, I issued the NPF Implementation: Housing Growth Requirements Guidelines under section 28 of the Planning and Development Act 2000 in July 2025. These Guidelines set out the housing demand scenario to 2040 for each local authority, by translating the NPF housing requirements into average annual figures and set out the requirement for planning authorities to commence the process of varying their development plan to meet the new housing growth requirements.  The Government remains fully committed to working with all stakeholders to deliver social homes at scale and to continue accelerating housing supply across all tenures. This is demonstrated by the record level of investment which is being provided for the delivery of housing in 2025, with overall capital funding now allocated by Government of almost €7.5 billion. The capital provision for 2025 is supplemented by a further €1.65 billion in current funding.  My Department does not provide specific funding allocations to local authorities, rather funding for housing programmes is made to the local authorities as programmes and projects advance and relevant claims fall due for payment. ",
        "debateSection": {
          "showAs": "Housing Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_917",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_917.xml"
            }
          },
          "debateSectionId": "dbsect_917"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1055. Deputy Fionntán Ó Súilleabháin asked the Minister for Housing, Local Government and Heritage the affordable housing projects which are due to be delivered over the next 24 months for counties Wicklow and Wexford, in tabular form; and if he will make a statement on the matter. [58842/25] ",
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1055",
        "questionNumber": 1055,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 1055 and 1071 together.  Government is fully committed to delivering housing at scale, and continuing to accelerate housing supply across all tenures. Overall, over 16,900 affordable housing solutions have been delivered by our range of delivery partners since the launch of Housing for All, including 1,479 in Cork County Council, 318 in Wexford and 899 in Wicklow.  All local authorities prepare their own Housing Delivery Action Plan setting out their planned approach to meeting identified social and affordable housing needs. Cork, Wexford and Wicklow county councils’ published plans are available on their official websites.  The Affordable Housing Fund (AHF) is available to assist local authorities towards the cost of developing affordable homes where significant affordability needs have been identified.  Cork County Council has received funding approval to facilitate the delivery of 732 affordable purchase and cost rental homes in key urban centres across the county with the support of the AHF. This includes 63 affordable purchase homes delivered to date at Clonmore, Mallow and funding approval to support the delivery of 134 affordable purchase homes at St. Joseph’s Road, Mallow by 2027.  Wexford County Council has received funding approval to support the delivery of 60 affordable purchase homes during 2025 & 2026 with AHF support.  Wicklow County Council has received funding approval to support the delivery of 117 affordable purchase homes by 2026 with AHF support.  I anticipate that these counties will continue to expand their delivery programmes as additional affordable housing schemes are identified, developed and approved.  The Ready to Build serviced sites scheme supports local authorities to provide sites at a discount to people who want to build their own home. The Vacant Property Refurbishment Grant continues to support the purchase and refurbishment of vacant and derelict properties. Further information with regard to the scheme is available on my Department's website at the following link: www.gov.ie/en/publication/33209-ready-to-build-scheme-serviced-sites-for-new-homes/ or by contacting the Vacant Homes officer directly from Cork, Wexford and Wicklow county councils.  It is also worth noting that the First Home Scheme, which supports first-time buyers in purchasing new houses and apartments in the private market through the use of an equity share model, is also available to support eligible new home purchasers in all local authorities, including Cork, Wexford and Wicklow.  My Department, the Housing Agency and Housing Delivery Co-ordination Office of the Local Government Management Association continue to be available to assist all local authorities in relation to the ongoing development of their affordable housing delivery programmes. ",
        "debateSection": {
          "showAs": "Housing Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_918",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_918.xml"
            }
          },
          "debateSectionId": "dbsect_918"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1061. Deputy Fionntán Ó Súilleabháin asked the Minister for Housing, Local Government and Heritage the funds allocated for counties Wicklow and Wexford for the tenant-in-situ scheme for 2026; in tabular form; and if he will make a statement on the matter. [58900/25] ",
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1061",
        "questionNumber": 1061,
        "answerText": " Minister for Housing, Local Government and Heritage  Funding for the Second Hand Acquisitions Programme will be agreed later this year, with individual allocations notified to local authorities as soon possible thereafter.  That said, I expect the 2026 programme to maintain support for tenant in situ acquisitions as a last resort policy tool available to local authorities to prevent social housing supported households in the private rental sector from becoming homeless.  In the meantime, local authorities have been authorised to enter into commitments for 2026 to a value of up to 30% of their original 2025 acquisitions budget. This allows them commit, pending an agreed programme budget for next year, some €95 million extra in 2025 for acquisitions that will complete and draw down in 2026.  For Wicklow and Wexford County Councils, this provides scope for both to commit €1.8 million each to acquisitions that are likely to only complete and drawdown in 2026. This includes acquisitions to support exits from homelessness, tenancy sustainment via tenant in situ, and other priority cohorts such as older persons, persons with disabilities, care leavers, etc.  This flexibility effectively provides for a multi-annual approach to programme delivery, facilitating local authorities to plan and progress acquisitions from one year to the next with a higher level of certainty vis-à-vis future funding availability. ",
        "debateSection": {
          "showAs": "Housing Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_924",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_924.xml"
            }
          },
          "debateSectionId": "dbsect_924"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1084. Deputy Fionntán Ó Súilleabháin asked the Minister for Housing, Local Government and Heritage if his Department provides specific funding to local authorities for the purposes of refurbishment of vacant social housing stock; if he will detail the amount which has been made available to Wicklow County Council and Wexford County Council for this purpose; the amount which has been drawn down in each of the past five years, in tabular form; and if he will make a statement on the matter. [59170/25] ",
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1084",
        "questionNumber": 1084,
        "answerText": " Minister for Housing, Local Government and Heritage  The management and maintenance of local authority housing stock, including pre-letting repairs to vacant properties, the implementation of a planned maintenance programme and carrying out of responsive repairs, are matters for each individual local authority under Section 58 of the Housing Act 1966. Local authorities also have a legal obligation to ensure that all of their tenanted properties are compliant with the provisions of the Housing (Standards for Rented Houses) Regulations, 2019.  Notwithstanding the legal obligation on local authorities to manage and maintain their own stock, my Department provides annual funding support to local authorities for management and maintenance under the current Planned Maintenance/Voids Programme.  This funding should supplement LA own resources and not be seen as a substitute for adequate budgeting for housing management and maintenance by local authority officials and elected members as part of their annual budgetary process.  The 2025 Programme will provide funding of €31 million to local authorities to support the refurbishment and re-letting of a minimum of 1,900 homes, and continue the transition from a reactive, voids approach to a Planned Maintenance approach. The following table details the allocation to both Wicklow and Wexford under the 2025 Planned Maintenance/Voids programme.     Local Authority    Number of units allocated in 2025    Voids Funding Allocation    Planned Maintenance Funding Allocation      Wicklow    65    €715,000    €345,913      Wexford    61    €671,000    €326,147       An annualised breakdown by local authority of the funding provided and the number of properties remediated under the Voids programme is available on my Department's website at the following link:   www.gov.ie/en/collection/0906a-other-local-authority-housing-scheme-statistics/#voids-programme   Details in relation to delivery under the 2025 Planned Maintenance/Voids Programme will be available early in 2026. ",
        "debateSection": {
          "showAs": "Housing Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_944",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_944.xml"
            }
          },
          "debateSectionId": "dbsect_944"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1085. Deputy Fionntán Ó Súilleabháin asked the Minister for Housing, Local Government and Heritage the number of housing units that have been realised in the past five years from projects that availed of the vacant homes refurbishment grant in County Wicklow and County Wexford, in tabular form; and if he will make a statement on the matter. [59171/25] ",
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1085",
        "questionNumber": 1085,
        "answerText": " Minister for Housing, Local Government and Heritage  The Vacant Property Refurbishment Grant, introduced in July 2022 under the Croí Cónaithe, provides a grant of up to €50,000 for the refurbishment of vacant properties for occupation as a principal private residence and for properties which will be made available for rent. A top-up grant of up to €20,000 is available where the property is confirmed to be derelict, bringing the total grant available for a derelict property up to a maximum of €70,000. In order to qualify for the grant, the property must be vacant for two years or more at the time of application.  My Department publishes data on applications for the Vacant Property Refurbishment Grant on its website on a quarterly basis, which includes the number of applications, approvals and the total number and value of grants paid per local authority. This data also includes a breakdown of applications for the Vacant Property Refurbishment Grant and the Derelict Property Top-up Grant for every quarter. The Q3 2025 grant statistics were published on 17 October 2025. This data can be accessed at the following link: www.gov.ie/en/department-of-housing-local-government-and-heritage/collections/vacant-property-refurbishment-grant-statistics/#2025 ",
        "debateSection": {
          "showAs": "Departmental Data",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_945",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_945.xml"
            }
          },
          "debateSectionId": "dbsect_945"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1086. Deputy Fionntán Ó Súilleabháin asked the Minister for Housing, Local Government and Heritage to provide an update on the measures his Department is taking to address homelessness among the over 65s and to prevent people retiring into homelessness; the number of people over 65 in County Wicklow and County Wexford that have entered homelessness, for the past five years, in tabular form; and if he will make a statement on the matter. [59173/25] ",
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1086",
        "questionNumber": 1086,
        "answerText": " Minister for Housing, Local Government and Heritage  Supporting individuals and families experiencing or at risk of experiencing homelessness is a priority for my Department and Government.  Increased supply is key to addressing homelessness, meeting need and addressing the challenges in the housing market. Government is fully committed to working with all stakeholders to deliver social, affordable and cost rental homes at scale and to continue accelerating housing supply across all tenures. A record level of investment is being provided for the delivery of housing in 2026, with €5.2bn in Exchequer capital funding complemented by investment through the Land Development Agency (LDA) and lending from the Housing Finance Agency (HFA), bringing the total capital funding for housing in 2026 to over €9 billion. This record level of funding is supporting the delivery of social, affordable and cost rental homes. The 2026 capital funding will be supplemented by over €2 billion in current funding to address housing needs.  The long-term housing needs of families and individuals, including those aged 65 and over, who are in emergency accommodation, will be met through a range of social housing supports such as the Housing Assistance Payment scheme and through general social housing allocations. Critical to supporting households to exit homelessness is our continued investment in the social housing programme. €2.9bn of the capital funding for housing in 2026 has been allocated to support the delivery of social homes. This continued investment in the social housing programme will increase the supply of stock available to allocate to households on the social housing waiting list, including households in emergency accommodation.  In addition, the Programme for Government includes a number of commitments related to increasing the supply of housing for older people. These commitments build upon the policy objectives in Housing for All, which commit to increasing housing available to older people to facilitate ageing in place with dignity and independence. Work on these commitments is ongoing within a Policy Group established to consider the implementation of these commitments through specific measures in the new Housing Plan that is currently being prepared by my Department.  The new Housing Plan, which will be published shortly, will include robust and targeted actions that will increase the provision of housing. The plan will also include a range of measures to address homelessness, including the development of a Homelessness Prevention Framework to ensure all possible measures are being taken across Government to prevent homelessness.  My Department currently gathers and publishes data on a monthly basis on the number of homeless persons accommodated in emergency accommodation funded and overseen by local authorities. These reports are based on data provided by local authorities, produced through the Pathway Accommodation & Support System (PASS).  While responsibility for the provision of homeless accommodation and related services rests with individual housing authorities, the administration of homeless services is organised on a regional basis with a lead authority in place for each region. County Wicklow is included in the Mid East region with Kildare County Council as the lead authority. County Wexford is included in the South East region for the purposes of homeless administration, with Waterford City and County Council as lead authority.  The monthly homelessness report includes details of individuals, families and the dependants of these families who accessed emergency accommodation during the relevant count week of the month in question. The report also includes the number of adults in emergency accommodation by age band and region. The most recently published data is in respect of September 2025. The reports are collated on a regional basis and are available on my Department's website at the following link: www.gov.ie/en/department-of-housing-local-government-and-heritage/collections/homelessness-data/ and are also published to the Department of Public Expenditure, Infrastructure, Public Service Reform and Digialisation's open data portal www.data.gov.ie/ .  My Department also publishes quarterly progress reports which are based on quarterly performance reports submitted by the nine regional lead authorities responsible for the administration of homeless services at local level. These quarterly performance reports include information on presentations to homeless services by single adult and family households who entered emergency accommodation. The most recent published data is in respect of Q3 2025 and the report is available on my Department’s website at the following link: www.gov.ie/en/department-of-housing-local-government-and-heritage/collections/homelessness-data/  My Department does not hold any information in relation to the number of individuals who have entered emergency accommodation by age band. This information may be available from Wicklow and Wexford County Councils. ",
        "debateSection": {
          "showAs": "Homeless Persons Supports",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_946",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_946.xml"
            }
          },
          "debateSectionId": "dbsect_946"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1087. Deputy Fionntán Ó Súilleabháin asked the Minister for Housing, Local Government and Heritage whether the newly introduced two-year eligibility requirement is being reviewed or removed from the tenant-in-situ scheme; and if he will make a statement on the matter. [59174/25] ",
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1087",
        "questionNumber": 1087,
        "answerText": " Minister for Housing, Local Government and Heritage  I refer to my reply to Question No. 269 of 7 October 2025 and advise the position remains unchanged. ",
        "debateSection": {
          "showAs": "Housing Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_947",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_947.xml"
            }
          },
          "debateSectionId": "dbsect_947"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Justice",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1292. Deputy Fionntán Ó Súilleabháin asked the Minister for Justice, Home Affairs and Migration when the domestic violence Garda register will be introduced; if it will include all previous offenders; and if he will make a statement on the matter. [58835/25] ",
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1292",
        "questionNumber": 1292,
        "answerText": " Minister for Justice, Home Affairs and Migration  Combatting all forms of domestic, sexual and gender-based violence (DSGBV) and ensuring that victims and survivors receive the protection and care they deserve remain absolute priorities for this government.  These commitments lie at the heart of the Third National DSGBV Strategy, and a key element of achieving them is through legislative reform.  Last month, I secured Government approval for the drafting of the Sexual Offences, Domestic Violence and International Instruments Bill 2025, which will establish a publicly accessible Domestic Violence Register of Judgements to be published by the Courts Service.  This new law, Jennie's Law, named after Jennifer Poole, will allow those convicted of domestic violence against a partner or former partner, to be included on this public Register of Judgments.  The Register will not include previous convictions for serious domestic violence offences as the law is generally not retroactive.  The General Scheme is being referred to the Justice Committee for pre-legislative scrutiny and, when its report is received, work on finalising the Bill will be prioritised. ",
        "debateSection": {
          "showAs": "Domestic, Sexual and Gender-based Violence",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1111",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1111.xml"
            }
          },
          "debateSectionId": "dbsect_1111"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Justice",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1381. Deputy Fionntán Ó Súilleabháin asked the Minister for Justice, Home Affairs and Migration the number of persons who have received deportation orders to date, but are still remaining in the State; if he can provide details in relation to the destination countries for deportation orders, in tabular form; and if he will make a statement on the matter. [59979/25] ",
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1381",
        "questionNumber": 1381,
        "answerText": " Minister for Justice, Home Affairs and Migration  It is a central priority for me that Ireland’s immigration system is robust, and rules based. The enforcement aspects of our laws, including deportation orders, are an essential requirement for the system to work effectively and to ensure that there is confidence in the application of our legislation in this area.  Deportations are costly and complex to enforce. It is the preferred option to return people voluntarily and my Department has a voluntary return programme to assist people to return prior to the issuance of a deportation order. A person can only avail of voluntary return before a deportation order is issued and I have increased resources into this programme to enable persons who wish to return before a deportation order is issued to them.  A deportation order is a legal order to leave the State. If a person does not remove themselves from the State following the issuance of a deportation order, they will be removed, and my Department has taken action to significantly improve immigration enforcement measures and increase removals. The number of deportation orders signed in 2024 (2,403) increased by 180% compared to 2023 (857). This year 3,877 deportation orders have been signed up to 31 October 2025.  So far in 2025, six charter flight operations have removed 205 people from the State. Of these, five operations to non-EU destinations removed 182 people who were subject to deportation orders and one operation removed 23 EU citizens on grounds of criminality. Further removals will be conducted as the year progresses.  The table below illustrates the total number of returns in 2024 and to date in 2025.      Year      2024      2025 YTD       Enforced Deportations    134    146      Otherwise Confirmed Deportations*    28    45      Removed by Charter    N/A    182       Total Deportations      162      373       Other Removals**    26    49      Number of Voluntary Returns    934    1,348       Total Removed      1,122      1,770       Please note, figures are correct at time of issue, however, all statistics may be subject to data cleansing.   *Otherwise confirmed deportation is where it has been confirmed the individual has left the state following receipt of a deportation order without being escorted.  **Other enforced removals include Dublin III Transfer Orders of International Protection applicants to other EU State and EU Removal Orders for the return of EU Citizen under the Free Movement Regulations (these orders are made on grounds of criminality) and persons who are deemed inadmissible under the International Protection Act.  As there are no routine exit checks at Irish borders, it is not possible to accurately provide the number of people who are currently in Ireland subject to deportation orders. Since 2020 over 300 of the people subject to deportation orders above have confirmed they have left the State independently. It should be noted that many will have left the State without informing the authorities.  I am informed that the Garda National Immigration Bureau has reviewed a large sample of cases of persons subject to deportation orders; their inquiries suggest a very significant number of these individuals have left the State.  The table below illustrates the number of deportation orders signed in 2025 and the top ten nationalities up to 31 October 2025.      Nationality      DO Signed       Georgia    747      Algeria    456      Brazil    358      Nigeria    311      Pakistan    291      South Africa    186      Albania    136      India    132      Egypt    125      Afghanistan    123      Others    1,012      Total    3,877      * Please note, figures are correct at time of issue, however, all statistics may be subject to data cleansing.  ",
        "debateSection": {
          "showAs": "Deportation Orders",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1174",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1174.xml"
            }
          },
          "debateSectionId": "dbsect_1174"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1435. Deputy Fionntán Ó Súilleabháin asked the Minister for Agriculture, Food and the Marine the details of projects which has been organised to date for County Wexford’s coastline with the €7 million funding announced in March 2025 in conjunction with the EIP; in tabular form; and if he will make a statement on the matter. [58836/25] ",
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1435",
        "questionNumber": 1435,
        "answerText": " Minister for Agriculture, Food and the Marine  On the 16th October last, I, together with Minister of State for Nature, Heritage and Biodiversity, Christopher O’Sullivan TD, announced that the Operational Group led by SECAD has been approved to deliver the European Innovation Partnership (EIP) project ‘The Arable Coast Environment’, on the theme of enhancing habitats for biodiversity in an arable environment, along the coast from South Cork to Wexford. Joint funding of €7 million in total from both Departments has been allocated to cover both administration costs and payments to participating farmers.  EIP projects involve a range of actors including farmers, researchers, ecologists and community groups, coming together to trial innovative solutions which address challenges on Irish farms.  The European Innovative Partnerships (EIP) initiative is co-funded by the European Commission and the Irish Government under the CAP Strategic Plan 2023-2027. ",
        "debateSection": {
          "showAs": "Departmental Funding",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1223",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1223.xml"
            }
          },
          "debateSectionId": "dbsect_1223"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1442. Deputy Fionntán Ó Súilleabháin asked the Minister for Agriculture, Food and the Marine if he will report on his engagements on the Mercosur trade agreement. [59168/25] ",
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1442",
        "questionNumber": 1442,
        "answerText": " Minister for Agriculture, Food and the Marine  Along with the Tánaiste, who has lead responsibility for trade policy, I have actively engaged with both the European Commission and with other Member States across the EU to voice Ireland’s concerns in relation to the EU-Mercosur Agreement.  During these engagements, the Tánaiste and I have also repeatedly emphasised Ireland’s requirements for credible, legally-binding commitments on matters relating to trade and sustainable development, including climate, biodiversity, and deforestation protections. We have repeatedly emphasised that beef in particular is a very sensitive sector, which is vulnerable to negative impacts from the Mercosur agreement.  Since my appointment as Minister earlier this year, I have raised these concerns at Agri-Fish Council meetings and also with like-minded Member States through bilateral meetings on the margins of these Council meetings. In recent months, I have met with my French, Austrian and Latvian and Polish counterparts to exchange views.  Ireland's position on the EU-Mercosur Agreement remains as clearly outlined in the Programme for Government: ‘Work with like-minded EU countries to stand up for Irish farmers and defend our interests in opposing the current Mercosur trade deal”. ",
        "debateSection": {
          "showAs": "Trade Agreements",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1229",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1229.xml"
            }
          },
          "debateSectionId": "dbsect_1229"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1443. Deputy Fionntán Ó Súilleabháin asked the Minister for Agriculture, Food and the Marine the way in which he plans to safeguard Irish farm competitiveness in the face of ongoing EU trade negotiations, including Mercosur; if he will request mandatory safeguards to prevent Irish beef, dairy and tillage producers being undermined by imports produced to lower standards; and if he will make a statement on the matter. [59169/25] ",
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1443",
        "questionNumber": 1443,
        "answerText": " Minister for Agriculture, Food and the Marine  The Programme for Government is clear in its commitment to “work with like-minded EU countries to stand up for Irish farmers and defend our interests in opposing the current Mercosur trade deal.\"  Irish and EU farmers are subject to complex regulations requiring them to farm in a sustainable manner, which is why it is important to ensure that farmers in Mercosur countries are subject to the same requirements.  As part of the European Commission’s recent announcement on the proposal for the ratification of the EU-Mercosur Agreement, the Commission has committed to increasing the number of audits and checks in third countries, and strengthening SPS controls on the ground.  More recently, the Commission has also brought forward a regulation on safeguards for sensitive agricultural products in the context of the EU-Mercosur Agreement. This proposed regulation makes a number of commitments regarding applying safeguard measures in terms of transparency, monitoring and speed of response. Ireland continues to engage with the Commission on this proposed regulation to seek clarity on these commitments. ",
        "debateSection": {
          "showAs": "Trade Agreements",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1230",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1230.xml"
            }
          },
          "debateSectionId": "dbsect_1230"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1865. Deputy Fionntán Ó Súilleabháin asked the Minister for Health the current rates of vacancy for mental health staff across counties Wicklow and Wexford; a breakdown per profession; the length of time the roles have been vacant for, in tabular form; and if she will make a statement on the matter.  [58832/25] ",
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1865",
        "questionNumber": 1865,
        "answerText": " Minister for Health (Deputy Jennifer Carroll MacNeill)  As this is a service matter, it has been referred to the Health Service Executive for attention and direct reply to the Deputy. ",
        "debateSection": {
          "showAs": "Mental Health Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1619",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1619.xml"
            }
          },
          "debateSectionId": "dbsect_1619"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1866. Deputy Fionntán Ó Súilleabháin asked the Minister for Health if she accepts that the average cost of a legal claim for medical negligence in Ireland is almost three times higher than in the UK; that cases take over 50 per cent longer to resolve than in the UK; her views that a medical negligence claim in Ireland takes 1,462 days on average (four years), 14 per cent longer than in South Africa and 56 per cent longer than in Hong Kong, the UK or Singapore; if she will provide a solution to the matter that the Medical Protection Society have highlighted; and if she will make a statement on the matter. [58833/25] ",
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1866",
        "questionNumber": 1866,
        "answerText": " Minister for Health  My predecessor as Minister for Health published the Report of the Interdepartmental Working Group on the Rising Cost of Health-Related Claims on the 19 September 2024, along with two ancillary reports, ‘Plaintiff experiences of the medico-legal environment in Ireland (UCC)’ and ‘A Comparative analysis of clinical negligence claims in a range of jurisdictions (HRB)’. The reports are available at: www.gov.ie/en/department-of-health/publications/interdepartmental-working-group-on-the-rising-cost-of-health-related-claims-report/  The Report identified six strategic priorities to reduce the requirement for litigation in healthcare and improve the litigation process for those taking this path. It set out a comprehensive set of 30 recommendations that span a range of government departments and agencies. The government accepted the recommendations of the Report and established an Implementation Group to drive forward their implementation.  The Government has reinforced the importance of making progress on this issue by including a commitment in the Programme for Government 2025, to \"Implement the recommendations of the Report of the Interdepartmental Working Group on the Rising Cost of Health-Related Claims and make it easier and less stressful for patients when things go wrong\".  The focus of the work of the Interdepartmental/Agency Implementation Group, established in September 2024, has been to ensure that the recommendations made are implemented without delay.  The Implementation Group will continue its work to ensure progress is made on the recommendations, monitor progress against the actions and timelines set out in the plan, and report on progress, in accordance with its Terms of Reference.  Since the publication of the Report in September 2024, and in tandem with the work of the Implementation Group on the drafting of this plan, a number of recommendations have been substantially implemented, including:  • the launch of the National Open Disclosure Framework in 2023  • commencement of the Patient Safety (Notifiable Incidents and Open Disclosure) Act 2023 in September 2024  • issue by the President of the High Court in April 2025 of two new High Court Practice Directions concerning clinical negligence proceedings  On 16 October 2025, my Department published the Implementation Plan for the recommendations of the Report of the Interdepartmental Working Group on the Rising Cost of Health-Related Claims. The Implementation Plan is available on the Department of Health’s website. (Report and Implementation Plan of the Interdepartmental Working Group on the Rising Cost of Health-Related Claims) ",
        "debateSection": {
          "showAs": "Departmental Legal Cases",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1620",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1620.xml"
            }
          },
          "debateSectionId": "dbsect_1620"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1867. Deputy Fionntán Ó Súilleabháin asked the Minister for Health to provide a breakdown of the 2026 Budget for mental health, including programme-level funding per county, including regional health allocations; to include specific suicide prevention funding for counties Wicklow and Wexford, in tabular form; and if she will make a statement on the matter. [58839/25] ",
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1867",
        "questionNumber": 1867,
        "answerText": " Minister of State at the Department of Health  The total allocation for mental health services in 2026 is almost €1.6 billion, which is the sixth year in a row in which the mental health budget has been increased.  This increase in funding for mental health services represents a significant investment which will enable continued policy implementation and service improvement in line with our national mental health policy, Sharing the Vision, and our national suicide and self-harm reduction strategy Connecting for Life, across a broad continuum from mental health promotion, prevention and early intervention, through to specialist mental health services.  This year’s budget provided the opportunity to focus on investing in crisis support and suicide prevention; youth mental health and CAMHS, and expanding the National Clinical Programmes.  As occurs each year following the Budget, discussions will now take place with the HSE on details relating to specific service initiatives in the context of preparing the HSE Service Plan 2026, including that for Mental Health. ",
        "debateSection": {
          "showAs": "Departmental Data",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1621",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1621.xml"
            }
          },
          "debateSectionId": "dbsect_1621"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1868. Deputy Fionntán Ó Súilleabháin asked the Minister for Health if she will consider allocating a specific mental health crisis unit in County Wexford to provide for the number of patients who have presented to Wexford Accident and Emergency Department with suicidal thoughts and/or in a mental health crisis, for the past 5 years, in tabular form; and if she will make a statement on the matter. [58841/25] ",
        "by": {
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "showAs": "Fionntán Ó Súilleabháin",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1868",
        "questionNumber": 1868,
        "answerText": " Minister of State at the Department of Health  As this is a service matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "debateSection": {
          "showAs": "Departmental Data",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1622",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1622.xml"
            }
          },
          "debateSectionId": "dbsect_1622"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_201.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_201",
          "debateSectionId": "dbsect_201"
        },
        "to": {
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Housing, Local Government and Heritage  In relation to Lady’s Island Lake, my colleague, Minister of State, Christopher O’Sullivan along with Department officials have met with the Department of Agriculture, Food and the Marine (DAFM) along with Wexford County Council, National Parks and Wildlife (NPWS) and Local Authority Waters Programme (LAWPRO) to establish an oversight group for Lady’s Island. This group has met on multiple occasions and is led and chaired by Wexford County Council. Teagasc also recently joined. Minister O'Sullivan has requested that Wexford County Council urgently prepare a specific action plan to deal with the pollution at the lake, which will follow the framework and mechanisms within the Water Action Plan. Wexford County Council, who are leading this project, is in the final stages of developing an action plan for the area.  Lady’s Island Lake is a Priority Area for Action (PAA) under the existing Water Action Plan and therefore all mechanisms for undertaking scientific and compliance investigations, delivery of advice and implementing regulatory and supplementary measures under the Water Action Plan will be harnessed. Funding from my Department has already been provided to support a significant component of the action required through the provision of (i) National Agricultural Inspection Programme (NAIP) inspectors in the local authorities, whom are responsible for investigating farm compliance with the Good Agricultural Practice (GAP) Regulations; (ii) free advice and support for farmers under ASSAP, and co-funding is provided by DAFM and my Department for (iii) the implementation of supplementary measures through the Farming for Water EIP.  ",
        "questionType": "written",
        "showAs": " 201. Deputy Fionntán Ó Súilleabháin asked the Minister for Housing, Local Government and Heritage for information on the terms and the parties involved in the proposed action plan led by Wexford County Council and the time scales for agreed action (details supplied). [55708/25] ",
        "questionNumber": 201,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Fionntán Ó Súilleabháin",
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_201"
      }
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Water Pollution",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_253.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_253",
          "debateSectionId": "dbsect_253"
        },
        "to": {
          "showAs": "Agriculture",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 263 and 264 together.  My Department is supporting the work of the inter-departmental Lady’s Island Oversight Group, led by Wexford County Council, which also involves the Department of Housing, Local Government and Heritage , Local Authorities Water Programme Office (LAWPRO), and the National Parks and Wildlife Service (NPWS). This work is being led by Minister Christopher O'Sullivan.  Wexford County Council is in the latter stages of developing a site-specific action plan to address the challenges faced by Lady's Island Lake. Once the final Lady’s Island Lake Sustainable Farming & Communities Scheme business plan is received from Wexford County Council, it will be considered by both Departments.  In the Lady's Island Lake catchment, my Department, along with the Department of Housing, Local Government and Heritage (DHLGH) and Tirlan, is funding free confidential advisory support to farmers through the Agricultural Sustainability Support and Advisory Programme (ASSAP).  Under that Programme, ASSAP advisors are working in the Lake's catchment to identify appropriate on-farm measures to address the challenges faced by the lake.  The Farming for Water European Innovation Partnership (EIP) is led by the Local Authorities Waters Programme (LAWPRO) working in partnership with Teagasc and Dairy Industry Ireland. Through this national EIP, my Department provides funding for specific targeted on-farm actions which go beyond regulatory requirements. This EIP is designed to complement advice provided by ASSAP advisors and a number of Farming for Water EIP applications have already been completed in the lake's catchment.  In addition, EU and nationally co-funded schemes such as the Agri-Climate Rural Environment Scheme (ACRES) and the Targeted Agriculture Modernisation Scheme (TAMS) have been available to farmers in the catchment, again benefiting water quality by providing incentives to farmers to go above and beyond minimum regulatory requirements. ",
        "questionType": "written",
        "showAs": " 263. Deputy Fionntán Ó Súilleabháin asked the Minister for Agriculture, Food and the Marine for support with provision of funding and staff resources to adequately monitor and reduce water pollution at Lady’s Island lake (details supplied). [55709/25] ",
        "questionNumber": 263,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Fionntán Ó Súilleabháin",
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_263"
      }
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Water Pollution",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_253.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_253",
          "debateSectionId": "dbsect_253"
        },
        "to": {
          "showAs": "Agriculture",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 263 and 264 together.  My Department is supporting the work of the inter-departmental Lady’s Island Oversight Group, led by Wexford County Council, which also involves the Department of Housing, Local Government and Heritage , Local Authorities Water Programme Office (LAWPRO), and the National Parks and Wildlife Service (NPWS). This work is being led by Minister Christopher O'Sullivan.  Wexford County Council is in the latter stages of developing a site-specific action plan to address the challenges faced by Lady's Island Lake. Once the final Lady’s Island Lake Sustainable Farming & Communities Scheme business plan is received from Wexford County Council, it will be considered by both Departments.  In the Lady's Island Lake catchment, my Department, along with the Department of Housing, Local Government and Heritage (DHLGH) and Tirlan, is funding free confidential advisory support to farmers through the Agricultural Sustainability Support and Advisory Programme (ASSAP).  Under that Programme, ASSAP advisors are working in the Lake's catchment to identify appropriate on-farm measures to address the challenges faced by the lake.  The Farming for Water European Innovation Partnership (EIP) is led by the Local Authorities Waters Programme (LAWPRO) working in partnership with Teagasc and Dairy Industry Ireland. Through this national EIP, my Department provides funding for specific targeted on-farm actions which go beyond regulatory requirements. This EIP is designed to complement advice provided by ASSAP advisors and a number of Farming for Water EIP applications have already been completed in the lake's catchment.  In addition, EU and nationally co-funded schemes such as the Agri-Climate Rural Environment Scheme (ACRES) and the Targeted Agriculture Modernisation Scheme (TAMS) have been available to farmers in the catchment, again benefiting water quality by providing incentives to farmers to go above and beyond minimum regulatory requirements. ",
        "questionType": "written",
        "showAs": " 264. Deputy Fionntán Ó Súilleabháin asked the Minister for Agriculture, Food and the Marine for support for farmers to implement positive environmental changes and assistance to substantially reduce the levels of water pollution in Lady’s Island lake (details supplied). [55710/25] ",
        "questionNumber": 264,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Fionntán Ó Súilleabháin",
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_264"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Housing Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_474.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_474",
          "debateSectionId": "dbsect_474"
        },
        "to": {
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Housing, Local Government and Heritage (Deputy James Browne)  Under Housing for All, announced in September 2021, the Government committed to increase the supply of housing to an average of 33,000 homes per year over the next decade. Over 300,000 new homes were be built by the end of 2030, including a projected 90,000 social homes, 36,000 affordable purchase homes and 18,000 cost rental homes.  One of the objectives announced under Housing for All was to wind down long term leasing from the end of 2025, which has been reflected through gradually reducing long term leasing delivery targets over the recent past, culminating in a target of just 200 for 2025. This objective does not include all types of leasing; it excludes the Mortgage to Rent scheme and Repair and Lease. While there is no immediate plan to continue long term leasing beyond this year, all delivery streams for social housing are kept under review, particularly in the the context of a new Housing Plan and in light of changing demographics and the numbers currently availing of emergency accommodation. ",
        "questionType": "written",
        "showAs": " 615. Deputy Fionntán Ó Súilleabháin asked the Minister for Housing, Local Government and Heritage the way in which the discontinuation of long-term leasing agreements will help to address the housing crisis. [55147/25] ",
        "questionNumber": 615,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Fionntán Ó Súilleabháin",
          "memberCode": "Fionntán-Ó-Súilleabháin.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Fionntán-Ó-Súilleabháin.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_615"
      }
    }
  ]
}