{
  "head": {
    "counts": {
      "questionCount": 73,
      "resultCount": 73
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  The Home Energy Upgrade Loan Scheme is intended to play a crucial role in helping homeowners invest in energy upgrades to make their homes warmer, healthier and more comfortable, with lower emissions and lower bills.  The scheme is available nationwide and homeowners can borrow from €5,000 to €75,000 on an unsecured basis for a term of up to 10 years, at interest rates from as low as 2.99% (price varies depending on the finance provider). PTSB was the first lender to join in April 2024, with AIB and Bank of Ireland joining in June 2024. In 2025 the group of participating lenders has been expanded to include Avant Money (in partnership with An Post) and seven credit unions from the Irish League of Credit Unions, enhancing accessibility to more affordable retrofit loans in local communities.  At the end of September 2025, there were 776 loans drawn to a value of €38,258,801. The Deputy may wish to note that as uptake figures in certain counties mean that it could be possible to identify individual homeowners, regional figures are reported instead. To end September 2025, 79 loans were drawn in the west region of Ireland to a value of €3,875,895.  In line with the Programme for Government, in addition to expanding the number of lenders under the scheme, a key focus of my Department across 2025 has been the continued promotion of the scheme to drive uptake. The Department has engaged with the Sustainable Energy Authority of Ireland, the Strategic Banking Corporation of Ireland and several lenders to examine and identify opportunities to further promote the scheme. This also includes the progression of a marketing and communications campaign to scale up activity in the Home Energy Upgrade Loan Scheme. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 137. Deputy Peter Roche asked the Minister for Climate, Energy and the Environment to outline the current uptake of the home energy upgrade loan scheme in County Galway; and how his Department intends to expand awareness and access for homeowners; and if he will make a statement on the matter. [73229/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_169",
          "debateSectionId": "dbsect_169",
          "showAs": "Energy Conservation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_169.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_137",
        "questionNumber": 137
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Deputy Barry Ward  I am asking this question on behalf of my colleague Deputy Pete Roche who has done an awful lot of work in this area for families in his constituency of Galway East. The question is about what assessment the Department of Finance has carried out of the cumulative increase in costs in things like energy, childcare and housing, and the effect that has on hard-pressed working families. Will that assessment result in any particular policy change, for example, more targeted supports in next year's budget or future budgets? \n Deputy Simon Harris  I thank Deputy Ward for taking this question on behalf of our colleague, Deputy Pete Roche. As part of the budget process, my Department annually conducts distributional analysis to examine the impact of proposed tax and welfare measures on a range of households. Given the variety of ways in which means tests are applied it would not be possible to do such analysis specifically on households that do not qualify for means tested supports.  As in previous budgets, distributional analysis was conducted through the decision-making process for budget 2026 and ex post distributional analysis of the final budget measures was then published on budget day. The analysis finds that all households receive an average boost in their net disposable income of 1.1% as a result of budget 2026.  The budget is also progressive, with low-income households gaining more. The bottom two income cohorts gain 4.9% and 3.8%, respectively. The analysis indicates that budget 2026 reduces the at-risk-of-poverty rate for all households by 1.7% on average. That is not something you hear in this House very often.  As the Deputy will appreciate, in the budget the Government had to make difficult choices to get back to an annual rhythm of budgeting and move beyond one-off measures to being able to deliver permanent, sustainable and targeted measures to assist people. The budget was designed to boost our economic resilience and support workers and growth in their income by investing in jobs and the future. However, with the substantial personal income tax packages implemented over the past four years, the previous Government made significant progress in the context of increasing the entry point to income tax for all income earners and increasing the point at which the higher rate of income tax takes effect. These income tax measures are broadly expected to be in line with wage growth.  Budget 2025 has provided a range of support to individuals, families and businesses. In particular, the rent tax credit has proven to be a very meaningful support for renters. The credit is being extended for a further three years. The ceiling of the second USC rate band is being increased. This will ensure that a full-time worker on the minimum wage who benefits from the increase in the hourly minimum wage will remain outside the highest rates of USC. The 9% VAT on gas and electricity bills, which most opposition parties only budgeted to go to the end of the year or April, will now be in place for several years until the 31 December 2030. There is also a variety of other measures. \n Deputy Barry Ward  I acknowledge what has been done in the budget in respect of this area. I acknowledge particularly the difficulty in balancing the importance of supports without creating inflationary pressure in other areas. I recognise that this has been done in the budget to a large extent. However, in certain schemes where supports are being provided, there are different pressures on families depending on where they live. The supports that are provided are across the board. There is no recognition of the fact that, for example, housing is much more expensive in cities. There is no recognition of the fact that if you are running a childcare facility in my constituency of Dún Laoghaire, your rent will be higher as will the rent paid by your staff. I raised with the Minister for children previously the idea that we might have varied rates according to where they are in the country, but I do not know if that is possible. Has the Department of Finance looked at the possibility of having staggered rates around the country? \n Deputy Simon Harris  It is a very interesting point. This week, the Minister, Deputy Foley, took a very important step forward in publishing the first instalment of the action plan on childcare. That has a number of areas on which she is endeavouring to move including on the issue of staffing and pay but also in trying to provide maximum fee caps starting with lower income families. Next year has to be about publishing a comprehensive plan that gets us from here to the destination envisaged in the programme for Government of €200 per month per child. We know how to do that. What we need to know is how we do it. In addition, we need to make sure the system has enough places and staff. The Deputy made the point that one size does not fit all. There is not a one-size-fits-all model in relation to childcare. The parent has to have choice – that is really important – but even in a country as geographically small as Ireland there can be regional and local differences and providing a system that is flexible enough to understand that will be part of the challenge. Good measures have been taken this year, including the funding in capital for state interventions in some of these and 2026 will see the substantive plan. \n Deputy Joe Neville  I wish the Ceann Comhairle a happy Christmas. I want to raise targeted tax credit adjustments. The budget was significant, with an extra €9.4 billion spent. We got a lot of criticism and many questions were asked. It was suggested that, potentially, we had spent too much. There was a real focus on the part of this Government on supporting the most vulnerable, which is exactly what we did. We put a lot of extra spending in social welfare to really look after people in need, and correctly so. There was also significant capital investment. Is there any way we can look at the next part, namely - and as a previous speaker mentioned - the people who get up early in the morning and how to deal with them? How can the budget benefit families? \n Deputy Simon Harris  Sometimes it is like Goldilocks – too hot, too cold or just right. In every debate I do on finance, whether it is here or the media, the first half is spent saying we spent too much money and the second half is a list of things we on which we should have spent more. The job of the Minister for Finance, the Government and the Oireachtas is to try and get the balance right. The first of five budgets had to be about getting back to a regular pattern of budgeting and being very clear to everybody in this country and everybody who looks at investing here that we intend to continue to run budget surpluses and continue to set money aside into the funds and invest at scale in infrastructure and in respect of the infrastructural pinch points that are holding us back. It was the budget of 9% in many ways - 9% for energy, which was reduced until the end of 2030, for jobs in the hospitality sector and also for stimulating apartment building because that is key to our housing challenge. However, I want to assure Deputies, their constituents and the people of Ireland that I want to get back to a regular budgetary rhythm whereby we can advance the tax measures for middle Ireland outlined in the programme for Government. Subject to being able to run the economy well and keeping things on the straight and narrow, that is exactly the path we will take over the next four budgets. \n Deputy Barry Ward  I agree about having a standard measure that is predictable from year to year, particularly in relation to the tax brackets. However, tax credits is one area in respect of which we could potentially address issues relating to working families. These are the families caught between qualifying for certain grants and not earning enough to be okay on their own. Tax credits, reform of tax credits or giving them advantages in terms of what tax they pay is one area.  Means tests are not keeping up with inflation, and that affects families in the middle ground. They might earn more money, fall outside something that is means tested but not have more purchasing power on foot of inflation. \n Deputy Simon Harris  That is absolutely right. We have to keep the means test under review so they do not become mean. That is why we took a number of steps in the budget, particularly around carers, to make sure more people qualify because, ultimately, we want to phase out the means test. The Department of Social Protection, certainly in the previous Dáil, was working on reviewing the means test. I will seek an update for the Deputy on that.  We live in a country where wage growth is outstripping price growth on average. For the first time in a while, we are seeing wages rising faster than prices. That is much-needed potential relief for families in the months and year ahead after what has been a very constrained and pressurised time in relation to the cost of living.  Regarding tax credits, I am learning in this job not to speculate on every potential measure. Lots of good ideas come up in this House. Tax measures are considered in the context of the annual budget. We have the work of the tax strategy group. I will be asking it to look at a range of issues in advance of the next budget. I will be happy to have feedback from Deputy Ward and other Members on that. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 178. Deputy Peter Roche asked the Tánaiste and Minister for Finance whether his Department has assessed the cumulative impact of rising energy, childcare and housing costs on households that do not qualify for means-tested supports; whether targeted tax credit adjustments are under consideration in future budget preparations; and if he will make a statement on the matter.  [73232/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_44",
          "debateSectionId": "dbsect_44",
          "showAs": "Cost of Living Issues",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_44.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_178",
        "questionNumber": 178
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  This government is fully committed to supporting children with special educational needs to fulfil their full potential and the Programme for Government makes a number of commitments to deliver on this objective.  By the end of the year there will be over 20,000 special educational teachers and Budget 2026 is providing an additional 860 posts. For 2026/27 school year there will be just under 21,000 special education teachers in our schools, with more than 15,000 of these dedicated to supporting children in mainstream.  The Special Education Teacher (SET) allocation model provides schools with additional teaching hours to support the teaching needs of students in mainstream classes.  It is important to clarify that the SET model creates a learning need profile for every school of which enrolments is only one input.  The allocation model uses a variety of data, provided by each school to complete allocations. This data includes, enrolment data, data on educational needs profiles and data on educational disadvantage. All of these inputs are the most up to date available.  Where schools have a unique requirement in their school’s needs such as an immediate change in circumstances, and they have a concern about their allocation, there is an opportunity to seek a review from the National Council for Special Education before the start of the next school year. This review process has been streamlined to make it as easy as possible for schools and it should be noted that over 80% of schools who submitted valid reviews in advance of this school year received additional resources.  My Department will continue to work with all stakeholders on ensuring our allocation model is as responsive to school’s needs as possible. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 109. Deputy Peter Roche asked the Minister for Education and Youth if she will review the current system for allocating support-teaching hours to schools, given concerns that allocations are based primarily on data from previous years and therefore do not accurately reflect present-day enrolment levels, pupil needs, or the number of students requiring additional educational support (details supplied); if a more responsive or real-time allocation model is being considered to ensure schools have adequate staffing to meet actual needs; and if she will make a statement on the matter. [70775/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_131",
          "debateSectionId": "dbsect_131",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_131.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_109",
        "questionNumber": 109
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I can advise the Deputy that under the National Strategy on Education for Sustainable Development – ESD to 2030, funding is provided to schools for projects that support ESD.  In 2025, over €850,000 was provided to 390 schools across the country for ESD projects including school garden projects. An additional €460,000 was provided in summer 2025 to 20 organisations supporting ESD in schools. A list of grantees and projects is available on the ESD to 2030 webpage: www.gov.ie/en/department-of-education/publications/national-strategy-on-education-for-sustainable-development-in-ireland/.  In summer 2025, my department also delivered over €500,000 to 10 youth led Climate Justice projects under the Climate Justice fund. This funding supports young people aged 8 to 25 to take part in projects that raise awareness and take action on climate issues.  ESD projects funded by my department in 2025 were required to include an element of local community level action, ensuring students have the opportunity to take action for sustainable development in their local community and/ or to include the local community in ESD actions taking place in schools. Creating links and partnerships between schools and local community groups to accelerate action for sustainable development is one of five key priority areas under the ESD to 2030 strategy.  A second progress report on ESD to 2030 was published in September 2025 highlights the progress made in Education for Sustainable Development right across the education sectors. My department publishes a quarterly ESD Newsletter which issues to all schools spotlighting ESD activities in schools, resources, programmes, teacher professional learning opportunities and initiatives.  My department has also published a Sustainability Toolkit for schools to support them in developing a School Sustainability Policy Statement in accordance with the School Sector Climate Action Mandate and the department has started mapping these School Sustainability Policy Statements. All schools in receipt of ESD funding from the department commit to developing their statements.  Further information is available on the ESD to 2030 webpage at the link above.  There are a wide range of ESD related programmes and initiatives available to schools, some of which are funded by government departments, statutory agencies, Local Authorities, NGOs, Corporate sponsorship and some of which are social enterprises etc. For example, the An Taisce/ Green Schools programme is funded by the Department of Climate, Energy and the Environment and over 90% of our primary and post-primary schools engage with this programme, the WorldWise Global Schools programme and the Global Village programmes for schools are funded by the Department of Foreign Affairs/ Irish Aid, the Safe Routes to School programme is a collaboration between the National Transport Authority and Green Schools, the SEAI have an Energy in Schools programme and also provide grants under their Community Grant Programme to support schools to make effective energy upgrades. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 156. Deputy Peter Roche asked the Minister for Education and Youth the funding streams, grant programmes, or corporate partnership schemes available to support schools developing garden projects that will also serve the wider community; whether additional resources are planned to assist schools in promoting biodiversity, environmental education, and outdoor learning through such initiatives; and if she will make a statement on the matter. [70774/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_179",
          "debateSectionId": "dbsect_179",
          "showAs": "Education Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_179.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_156",
        "questionNumber": 156
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  The college to which the Deputy refers, Mountbellew Agricultural College is a private agricultural training institution which does not receive direct funding from my Department, nor is there any direct oversight by the Department of the operations of the college. My understanding is that the college provides training services, funded by course participants and by Teagasc.  As a private college, the day to day operation of the organisation, including issues surrounding the administration and finances are the responsibility of the college administrators to deal with in line with the college’s own criteria. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 231. Deputy Peter Roche asked the Minister for Further and Higher Education, Research, Innovation and Science if a college (details supplied) will be considered eligible for capital investment support; if his Department has examined options to align the college with an appropriate public body or higher education institution in order that it may access such funding; if he will consider facilitating access to capital investment through Atlantic Technological University or another suitable mechanism, in recognition of the college’s contribution to agricultural education and regional development; and if he will make a statement on the matter. [67829/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_244",
          "debateSectionId": "dbsect_244",
          "showAs": "Further and Higher Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_244.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_231",
        "questionNumber": 231
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  Ireland’s second National Cyber Security Strategy, published in 2019, came to a close at the end of 2024. It set out 20 collaborative measures with the aim of meeting a range of objectives, including to improve the ability of the State to respond to and manage cyber security incidents and to improve the resilience and security of public sector IT systems to better protect data and services. A Mid-Term Review of the Strategy published in May 2023 saw the inclusion of a further 18 new measures to be met within its lifetime.  I expect to be in a position to publish the End-of-Strategy report shortly which will set out progress made on implementing these measures at the end of 2024.  Preparations for the successor strategy are underway in my Department. This strategy will incorporate obligations arising from the revised EU Network and Information Security Directive (NIS2 Directive) alongside other national commitments relating to cyber security such as those set out in the Programme for Government and the National Development Plan.  A public consultation process will be launched soon to gather input from citizens, academia, industry, and other key stakeholders. These submissions will be reviewed and taken into consideration throughout the process of formulating priorities and specific measurable goals for the third Strategy.  Officials in my Department are currently consulting with the National Cyber Security Centre as well as other relevant Government Departments and Agencies including the Department of Foreign Affairs and Trade and the Department of Defence on developing this strategy. Care will be taken throughout the strategy development process to ensure appropriate alignment with other relevant strategies including the Maritime Security Strategy and the Digital and AI Strategy.  I expect to be in a position to publish the Third National Cyber Security Strategy early in 2026. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 78. Deputy Peter Roche asked the Minister for Justice, Home Affairs and Migration for an update on the implementation of the National Cyber Security Strategy; and if he will make a statement on the matter. [60387/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_107",
          "debateSectionId": "dbsect_107",
          "showAs": "Cybersecurity Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_107.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_78",
        "questionNumber": 78
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "showAs": " 39. Deputy Peter Roche asked the Minister for Housing, Local Government and Heritage the current regulatory framework governing maximum wind turbine height; whether concerns raised by residents in County Galway regarding the increasing scale of turbine proposals, particularly turbines exceeding traditional height thresholds, are being considered as part of the ongoing review of wind energy planning guidelines; and if he will make a statement on the matter.  [65792/25] ",
        "debateSection": {
          "showAs": "Wind Energy Guidelines",
          "debateSectionId": "dbsect_41",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/debate/dbsect_41",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/debate/mul@/dbsect_41.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Peter Roche",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29",
          "memberCode": "Peter-Roche.D.2024-11-29"
        },
        "questionNumber": 39,
        "answerText": " Deputy Albert Dolan  The current wind energy guidelines date back to 2006. In 2006, turbines were 80 m high. Today in east Galway, communities are fighting applications against 180 m industrial structures using rules from two decades ago. It is regulatory negligence to apply 2006 rules to 2025 technology. My argument is simple. The guidelines must protect people first, through strictly increased setback distances and noise regulation. Only then can we provide the renewables. We cannot continue to regulate modern monsters with obsolete laws. We need the update and we need it now. When can we anticipate the new energy guidelines? \n Deputy James Browne  I propose to take Questions Nos. 14, 39, 85, 532 and 533 together.  My Department is currently undertaking a focused review of the 2006 wind energy development guidelines which will inform a new national planning statement on wind energy under the new Planning and Development Act 2024. The review is addressing a number of key aspects of the guidelines including noise, setback distance, shadow flicker, community obligation, community dividend and grid connections. The key policy area here is with the Department of the Climate, Environment and Energy, which has primary responsibility for environmental noise matters and has been working to advance guidance on the noise aspect of the national planning statement, which is highly technical in nature. This work is now well under way.  In addition to work on the noise aspects of the national planning statement, the evolving policy and technical context including the new Planning and Development Act 2024 and the revision of the national planning framework reinforces the need to ensure that the finalised guidelines, once issued, are fit for purpose. In line with EU directive requirements, a strategic environmental assessment, SEA, is being carried out on the draft national planning statement as part of the review process. In this regard, my Department intends to undertake a public consultation on updated draft guidelines as part of the SEA process whereby all interested parties will have an opportunity to submit observations on the draft national planning statement. A finalised national planning statement will be prepared following detailed analysis and consideration of the submissions received during the consultation phase.  My Department is working towards concluding the finalisation of the national planning statement having regard to the intended public consultation and the impact of associated reforms and reviews including the revision of the NPF. The current 2006 wind energy development guidelines remain in force, pending the finalisation of that review. \n Deputy Albert Dolan  I appreciate the update and that the Department of energy and climate is working on the noise aspect. The speed at which this is dealt with is vital. Right now, there is a gold rush and a race to get planning applications through for these wind farms. I am speaking on behalf of the people of east Galway in Killimordaly, Barnaderg, Shancloon, Laurclavagh and Clonbern. There are 27 proposed wind farms in north Galway alone, with up to 150 turbines. The entire character of north Galway would be transformed if these were permitted.  Beyond the social impact, I need to raise the hard economic fact about the viability of these projects. EnergyCloud was before the committee last week. A total of €2 billion worth of electricity is being curtailed. This cannot be allowed to go on. It is not a sustainable model the way we are operating. \n Deputy Pádraig O'Sullivan  I support Deputy Dolan as well. I spoke about solar guidelines previously. It has to be said again that is taking an extreme amount of time to get these guidelines updated. I am here since 2020. I have spoken about this a dozen times at this stage. We have been led to believe that these guidelines are being updated or imminent. The Minister is giving us an update on the progress in relation to that. As I said, it seems to take an extreme amount of time. They are much anticipated and long awaited. Whether it is solar or wind, the only conclusion I can draw is that we seem to be putting things on the long burner. The only conclusion I can draw is that is being done by design by the Department to allow a number of applications. I am surprised to hear there are that many applications in one part of Galway. I thought that we had a heavy number of applications in my part of the country, but nothing comparable to Deputy Dolan's. We seem to do things very slowly. They seem to take an awful long time. I met the industry a number of weeks ago in relation to this. The industry wants these guidelines updated because it wants people to be aware of what is happening and it wants it done transparently. I echo the calls of Deputy Dolan to get this done urgently. \n Deputy James Browne  I thank both Deputies for their input in relation to the matter. In relation to my time in the Department of housing, there has been significant engagement with the Department of the environment in terms of developing the wider issues around the guidelines and in relation to updating them through the national planning statements. These are very technical in nature. They are very complex. There is considerable EU environmental legislation to take into account. Most importantly, there are also local communities to take into account. It is about finding that balance of where we can get to a situation where we can deliver and develop renewable energy while at the same time ensuring that local communities and individuals are respected within their local communities as well. This is not an easy balance to find. I have little doubt that if it was an easy balance to find it would have been done a considerable time ago. We are working very carefully, as I said, with the Department of the environment, whose policies are around ensuring that we have necessary renewable energy. I will be working with the Deputies as well and with the House to ensure that we can get that balance in place. \n Deputy Albert Dolan  Recently I had the privilege of walking one of the proposed sites in Shancloon near Caherlistrane in County Galway, where what was before me was beautiful open landscape. What amazed me was that this windfarm was proposed to be built on a bog. In order to build a turbine on a bog, a significant amount of peat has to be excavated in order to put in the concrete base to allow for the turbine to go up. The problem here is that this goes against everything we are working for environmentally; digging up bogs to put in wind turbines that ultimately have a useful life of maybe 30 to 40 years before they have to be considered to be taken down at that point. I also highlight that the engagement that happens in advance of these developments going to a planning process where a turbine farm is being proposed at 50 MW. That is the potential output of the turbines. As a result, those planning applications can go through directly to An Coimisiún Pleanála. The reality for a lot of these farms that are proposed is that their output will be a lot less than 50 MW and they should be going to the council first based on output, not based on potential capacity. That is something that needs to be hammered quickly because they are acting as if they are going to put out 50 MW when the reality is it will be a lot less. \n Deputy James Browne  I thank the Deputies for their concerns. There is a very large number of national planning statements that are now required over the coming years. Providing one under wind energy is a priority for the Department of housing, but as I said, many of the key principles are also within the Department of environment. We are continuing to work with it. It is about finding that balance where we can deliver renewable energy, which is absolutely critical for our environment - we are in a climate emergency - and ensuring that we meet the EU guidelines around the habitats directive, for example, and other directives, while also ensuring that the local communities are protected and respected. That is not an easy balance to deliver and arrive at. It is a difficult one to ensure that we can balance those competing interests. We have to ensure that we get this right, even if it does take a little bit longer than people might have hoped for. To ensure that we do not have a rushed answer is critical. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_39",
        "questionType": "oral",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 542. Deputy Peter Roche asked the Minister for Housing, Local Government and Heritage the steps his Department is taking to ensure meaningful public consultation in rural communities that are expected to accommodate renewable energy projects significantly larger than those envisaged under current planning guidelines; and if he will make a statement on the matter. [60402/25] ",
        "debateSection": {
          "showAs": "Renewable Energy Generation",
          "debateSectionId": "dbsect_495",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_495",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_495.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Peter Roche",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29",
          "memberCode": "Peter-Roche.D.2024-11-29"
        },
        "questionNumber": 542,
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  Public participation is a crucial element of all substantive decision-making processes under the Planning and Development Act 2000, and the recently enacted Planning and Development Act 2024. The Programme for Government 2025 – Securing Ireland’s Future contains commitments to introduce planning guidelines for solar energy developments and to prioritise the publication of the Wind Energy Development Guidelines, having regard to international best practice and standards.  Regarding solar energy, my Department will prepare a new National Planning Statement on Solar Energy under the new Planning and Development Act 2024. My Department has begun an initial scoping process to identify the component factors relevant to the preparation of the National Planning Statement for solar energy development, including any appropriate environmental assessment and public consultation requirements and other relevant European obligations such as the Renewable Energy Directive (RED III), which will determine the timeframe for publication of said National Planning Statement.  This scoping process remains at an early stage but I am satisfied that the existing and evolving planning system, supported by Government policy more generally, provides a sufficiently robust policy and legislative framework to facilitate the roll-out of solar energy development in a sustainable manner and to assist with meeting our renewable electricity requirements while balancing the perspectives of local communities and allowing for public and stakeholder engagement.  In the interim, there are currently no specific planning guidelines in place in respect of solar energy development. Proposals for individual solar energy developments are subject to the statutory requirements of the Planning and Development Act 2000, as amended, and the Planning and Development Act 2024, as amended, in the same manner as other proposed developments, with planning applications made to the relevant local planning authority, or An Coimisiún Pleanála on appeal.  Regarding Wind Energy, My Department is currently undertaking a focused review of the 2006 Wind Energy Development Guidelines which will inform a new National Planning Statement on Wind Energy under 2024 Act. The review is addressing a number of key aspects of the Guidelines including noise, setback distance, shadow flicker, community obligation, community dividend and grid connections.  My Department, in conjunction with the Department of Climate, Energy and the Environment (DCEE), which has primary responsibility for environmental noise matters, has been working to advance guidance on the noise aspect of the National Planning Statement, which is highly technical in nature. The two Departments have been engaging on proposals regarding the measurement and assessment of noise from wind turbines to ensure they are robust and fit for purpose having regard to, inter alia, the revised 2030 target to generate up to 80% of our electricity from renewable sources.  Further to this engagement, DCEE, in the context of its environmental noise remit, appointed noise consultants in May 2023 to inform any amendments to the noise aspect of the National Planning Statement. This work is now substantially complete.  My Department, in conjunction with DCEE, will make any further changes to the draft National Planning Statement which are deemed necessary or appropriate in the wake of this work to ensure that the finalised National Planning Statement, once issued, are fit for purpose to provide guidance in line with renewable energy and climate targets, whilst having appropriate regard to the impacts of wind energy development.  The evolving policy and technical context including the new Planning and Development Act 2024 and the recent revision of the National Planning Framework (NPF) reinforces the need to ensure that the finalised Statement, once issued, is fit for purpose.  My Department intends to undertake a public consultation on both the solar and wind Energy National Planning Statements as part of the SEA process whereby all interested parties will have an opportunity to submit observations on the draft National Planning Statement. Finalised National Planning Statements will be prepared following detailed analysis and consideration of the submissions received during the consultation phase.  In addition, it is open to any member of the public to make an observation or submission on a planning application, including in relation to solar energy developments, and the planning authority is statutorily obliged to consider such submissions before making a decision on the application. Persons who make submissions are also entitled to be notified of any significant further information provided to the planning authority by the applicant and to be notified of the authority’s decision on the application. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_542",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_353",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_353",
          "showAs": "Arts Policy",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_353.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 481. Deputy Peter Roche asked the Minister for Culture, Communications and Sport the steps being taken to support the recovery and growth of the live arts and events sector, which continues to face challenges related to rising operational costs and venue closures; if his Department will consider the expansion of grant or tax-relief supports for regional theatres and music venues; and if he will make a statement on the matter. [64647/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_481",
        "answerText": " Minister for Culture, Communications and Sport  Tax reliefs are a matter for the Minister for Finance. My priority as Minister is to ensure that the arts and culture sectors are resilient, sustainable, forward reaching and accessible. To do this, we need to build capacity in all areas under my remit. I recently announced €384.1m in the 2026 budget for arts and culture, which provides a wide range of supports to artists and arts organisations that directly contribute to the live entertainment sector. The final detailed allocation will be in the revised estimates which is due to be published shortly.  My Department provides capital support for arts and culture infrastructure throughout the country while annual support, including programming and revenue supports, is provided by local authorities and the Arts Council. I have asked the Arts Council to contact the Deputy directly with a detailed response in regard to the support they provide. Please contact my private office if you do not hear from the Council within ten working days.  In addition and in support of a commitment in the Programme for Government, my Department continues to aid the development of a more vibrant and culturally diverse Night-Time Economy which many live entertainment businesses participate.  This year I launched the Grassroots Music Venue Support Scheme, to support small established music venues that promote themselves and are known in the community for programming grassroots music artists. These venues play a vital role in Ireland’s cultural and creative ecosystem. The Scheme operated with a total fund of €500,000 and 34 grants of up to €15,000 were awarded to small independent venues to host events showcasing the talent of emerging, grassroots artists performing live music they have written or created themselves. Due to the success of this scheme and the importance of sustaining these venues, I recently announced an allocation of €1m towards a 2nd iteration of this scheme for 2026 to help further protect these venues against the backdrop of rising costs.  The work under the Night-Time Economy programme has made some impact on bringing the benefits of a vibrant Night-Time Economy into public discourse as well as affecting policy development across Government. We will continue to work across Government and with the live events and arts sector to address the challenges faced, to develop and sustain the sector. ",
        "questionNumber": 481,
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_354",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_354",
          "showAs": "Sports Funding",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_354.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 482. Deputy Peter Roche asked the Minister for Culture, Communications and Sport if he will provide an update on investment in local sports facilities and community clubs across rural Ireland; whether the Sports Capital and Equipment Programme will be expanded or restructured to prioritise underfunded areas such as east Galway; and if he will make a statement on the matter. [64648/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_482",
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  The Community Sport Facilities Fund (CSFF) is the primary means of providing Government funding to sport and community organisations at local, regional and national level throughout the country. The Fund aims to foster an integrated and planned approach to the development of sports and physical recreation facilities and assists the purchase of non- personal sports equipment.  Among the Fund's objectives is to assist voluntary and community organisations, national governing bodies (NGBs) of sport, local authorities and Education and Training Boards and schools to develop high quality, accessible, safe, well-designed, sustainable facilities in appropriate locations and to provide appropriate equipment to help maximise participation in sport and physical recreation  Over 19,000 projects have benefited from sports capital funding since 1998, bringing the total allocations in that time to over €1.4 billion. Over €277 million was allocated to 3,048 community sports clubs and facilities in 2024 from the 2023 round of the CSFF, representing the largest-ever investment in sports facilities in communities across Ireland. In the 2023 round of the CSFF over €17 million was allocated to 194 sporting projects in County Galway and over €32 million has been allocated to 492 sporting projects in County Galway over the last 3 rounds.  In line with previous rounds of the Fund, a review of the current funding round is being undertaken. I have asked my Department to prepare for a further round of the CSFF in 2026. It is anticipated that the next CSFF round will particularly target areas and sports that have been under-invested in over the years. ",
        "questionNumber": 482,
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_433",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_433",
          "showAs": "Qualifications Recognition",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_433.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 562. Deputy Peter Roche asked the Minister for Health her Department's perspective on the CORU revised standards and criteria for counsellors and psychotherapists (details supplied); and the reason the revised standards also reduce the requirements for clinical supervision of therapists, which is an essential component of safe practice and if she will make a statement on the matter. [64639/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_562",
        "answerText": " Minister for Health  As the Deputy is aware, CORU is Ireland’s multi-profession health and social care regulator. CORU’s role is to protect the public by regulating the health and social care professions designated under the Health and Social Care Professionals Act 2005 (as amended).  Counsellors and psychotherapists perform a vital role, providing therapeutic care to often vulnerable people.  Regulation is being introduced to these professions to protect the public, ensuring that care provided is of a consistently high standard and always by suitably qualified individuals.  The Counsellors and Psychotherapists Registration Board (CPRB) was established in 2019 and since that time has been working to progress regulation of both professions.  The CPRB undertook extensive research, analysis, and public consultation as part of the process of introducing statutory regulation for these professions.  The public consultation process received over 700 submissions, including from educators, professional bodies and existing practitioners. This comprehensive process recognised the differences in scope and complexity of practice between the two professions and ensures that the threshold standards and qualification levels set for each accurately reflect the competencies required for safe and effective practice, while strengthening public protection.  In line with the CPRB’s statutory responsibility to assess, balance and consider all perspectives before reaching a final evidence-based decision, the Board carefully considered every submission received and determined the final Standards and Criteria that will underpin entry to the registers for both counsellors and psychotherapists. This open, structured and inclusive process demonstrates CORU’s clear commitment to transparency, accountability, evidence-based decision-making, proportionality and, above all, the protection of the public.  A comprehensive consultation report has been published by CORU, setting out the process followed, the key themes raised in submissions, and the rationale for the final decisions taken by the Board and is accessible at [ Counsellors & Psychotherapists Registration Board - Coru ]  In July 2025 CORU published two key documents for each of these professions:  • Standards of Proficiency: These outline the threshold knowledge and skills required for entry to the register. They define what a counsellor or psychotherapist must be able to do at the point of entry into practice.  • Criteria for Education and Training Programmes: These set out the systems and processes education providers must implement in the design and management of education and training programmes. They provide assurance that all graduates have achieved all the Standards of Proficiency upon successful completion of an education and training programme.  The adopted Standards and Criteria reflect the threshold knowledge and skills required for safe practice at entry to the professions of Counselling and Psychotherapy. The introduction of consistent standards for the education and training of counsellors and psychotherapists marks a significant milestone, ensuring that those seeking support can have confidence in accessing appropriately trained and qualified practitioners.  On issues such as personal therapy and clinical supervision CORU’s competency-based framework ensures that essential attributes such as self-awareness, reflexivity, and ethical judgment are achieved through validated educational methods, including clinical supervision, reflective practice, and experiential learning.  CORU’s criteria mandate structured, practice-integrated supervision that enables supervisors and educators to directly evaluate proficiency and ensure safe practice. This approach provides robust, verifiable safeguards while maintaining flexibility for different theoretical modalities. The standards set the threshold for safe and effective practice, without restricting innovation or allowing education providers to exceed these minimum requirements at their discretion.  I am confident that CORU’s work will bring clear benefits for public protection. The framework has been designed to strengthen standards of practice while ensuring that training pathways and workforce supply are not adversely affected.  I am assured that CORU will continue to engage closely with education providers, professional bodies, and other stakeholders as the regulatory process advances, keeping public protection at the centre of this work.  I am eager to see this work progressed so that two very important professions are finally regulated, in the interest of public protection. ",
        "questionNumber": 562,
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_434",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_434",
          "showAs": "Mental Health Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_434.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 563. Deputy Peter Roche asked the Minister for Health her Department's plans to expand access to mental health services for young people, including school-based supports and early intervention programmes; whether consideration has been given to strengthening community mental health teams in rural areas; and if she will make a statement on the matter. [64640/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_563",
        "answerText": "",
        "questionNumber": 563,
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Rural",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_543",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_543",
          "showAs": "Rural Schemes",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_543.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 673. Deputy Peter Roche asked the Minister for Rural and Community Development and the Gaeltacht the measures being considered to ensure that rural and regional projects receive equitable access to capital funding under national investment and enterprise schemes; if his Department has conducted any review into geographic disparities in funding allocation; and if he will make a statement on the matter. [64649/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_673",
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  Under the framework of the national rural development policy Our Rural Future and the National Planning Framework this Government continues to invest heavily in programmes which aim to revitalise our rural towns and villages, achieve balanced regional development and support development in local communities right across the country.  In line with this remit, the department operates the Rural Development Investment Programme to deliver a range of capital schemes which are available for communities all across rural Ireland for projects such as town regeneration works, the development of community and enterprise facilities and projects which provide outdoor recreation facilities.  This investment is channelled via a range of schemes such as the Town and Village Renewal Scheme, CLÁR, the LEADER programme, the Rural Regeneration and Development Fund (RRDF), the Community Centre Investment Fund and the Outdoor Recreation and Investment Scheme. The scale of this investment, ranges from projects with a value of up to €65,000 under schemes such as CLÁR, to larger multi-million euro projects under schemes such as the RRDF.  The application process for funding can vary from scheme to scheme and applications are generally made via lead bodies such as local authorities or local development companies, each of whom draw on local consultation to identify priority projects for to form the basis for funding applications in their area. Funding is ultimately allocated based on a project's suitability against scheme criteria, the geographical spread of projects, the quality of the proposed projects, and the available budget.  Applications for departmental funding are accepted on an equitable basis across all counties, for example, by facilitating a consistent number of applications that can be made submitted by each local authority or local development company under each Call for Proposals. Significant effort is afforded both at local and national level to ensure a balanced allocation of funding.  This has seen very significant capital allocations across constituencies such as East Galway. For example, last month I approved €1m in funding under the RRDF to support the redevelopment of the Bridge House in Gort. Last year, €13m in RRDF funding was approved to support large capital projects in towns like Athenry, Tuam and Glenamaddy.  The CLÁR programme in particular is targeted at defined geographic areas based on data on population change to ensure those areas facing particular challenges, and which are our most remote rural areas, have access to tailored funding opportunities. As you may be aware, a review has been completed in recent months in respect of the areas eligible for CLÁR to ensure that it continues to target the most appropriate areas. The findings of this review will inform eligibility under the scheme in 2026.  Details of project allocations across the above schemes are available on my department's website.   ",
        "questionNumber": 673,
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 135,
        "showAs": " 135. Deputy Peter Roche asked the Minister for Transport if consideration is being given to specific measures to support commuters travelling to city and town centres, particularly students travelling from east Galway into university in Galway city, whose bus and/or train services are at capacity before reaching their locality at peak times; and if he will make a statement on the matter. [63420/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Peter Roche",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29",
          "memberCode": "Peter-Roche.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_135",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_93",
          "showAs": "Public Transport",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_93",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_93.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Transport  As Minister of State at the Department of Transport with special responsibility for Rural Transport, I have responsibility for policy and overall funding in relation to rural public transport service provision; however, I am not involved in the day-to-day operations.  The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally. In light of the NTA responsibilities I have referred your question to the NTA for direct reply to you. Please advise my private office if you do not receive a reply within ten working days. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 143,
        "showAs": " 143. Deputy Peter Roche asked the Minister for Transport the number of passenger journeys per year on Bus Éireann route 425A in Galway; the basis on which the decision was made to reroute this service, which is considered unsustainable for the community it serves; and if he will make a statement on the matter. [63419/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Peter Roche",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29",
          "memberCode": "Peter-Roche.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_143",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_101",
          "showAs": "Bus Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_101",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_101.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport (Deputy Darragh O'Brien)  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  The issue raised by the Deputy is a matter for Bus Éireann. Therefore, I have referred the Deputy's question to Bus Eireann for direct response to the Deputy. Please advise my private office if you do not receive a reply within ten working days. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Social Protection  The Programme for Government contains a commitment to introduce the Automatic Enrolment (AE) Retirement Savings System.  The aim of introducing AE is to address the pension coverage gap that exists in Ireland and to provide workers with greater comfort and security regarding their retirement income.  The new system - to be known as My Future Fund - will commence from 1 January 2026.  The implementation of Automatic Enrolment will pave the way for around 7500,000 workers to be brought into a retirement savings scheme for the first time and I look forward to its implementation.  There are no plans to review the rate paid by employers in respect of PRSI.  With regard to Automatic Enrolment, it should be noted that every effort has been made to ease the burden on employers associated with the implementation of this important initiative.  During the design phase, there was extensive engagement with employers through a public consultation exercise and with their representative organisations.  As a result of that, the design of My Future Fund was changed to provide for a phasing-in of contribution rates over a decade (rather than 6 years as originally planned), starting at a very low 1.5% of gross pay for the first three years.  For employers, this approach gives them more time to adjust their budgets and it gives them very clear certainty as to the rates that will be applicable so as to facilitate the gradual absorption of these labour costs, thereby easing the burden on employers in implementing this reform.  It is also important to note that earlier this year I announced that the collection of contributions for 'My Future Fund' had been rescheduled to the 1st January 2026 from the 30th September 2025.  This decision was informed by a number of factors including giving additional lead-in time for employers, particularly small and micro businesses, to ensure they can be compliant with the legislation from the start.  Additionally, the introduction of My Future Fund will be a positive development for many employers because the availability of an occupational pension in a place of employment can be a significant draw for talented workers.  Conversely, the lack of an occupational pension can push workers away.  The introduction of My Future Fund, therefore, creates a more level playing field for employers trying to attract good workers in a tight jobs market.  Moreover, employers benefit from participating in the scheme by enhancing their employees’ sense of wellbeing with regard to them having some security with respect to their post-employment retirement.  Finally, we have set up a new public body called the National Automatic Enrolment Retirement Savings Authority (NAERSA) which will take care of most of the administration of the scheme, making it very easy for employers to comply with their obligations, and ensuring that employers will not have to shoulder any of the administrative costs of the scheme.  I hope this clarifies matters for the Deputy. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_92",
        "debateSection": {
          "debateSectionId": "dbsect_114",
          "showAs": "Social Insurance",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_114",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_114.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 92,
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 92. Deputy Peter Roche asked the Minister for Social Protection if his Department has reviewed the possibility of lowering employers' PRSI in light of the forthcoming auto-enrolment scheme (details supplied); and if he will make a statement on the matter. [50818/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Social Protection  Matters relating to foster carers, including foster care allowance, are the responsibility of my colleague, the Minister for Children, Disability and Equality.  This Government acknowledges the important role that carers, including foster carers, play and remains fully committed to supporting them. The State Pension (Contributory) system already provides a range of measures to recognise caring periods outside of paid employment, such as PRSI credits, Homemaking Disregards, and HomeCaring Periods which recognise caring periods of up to 20 years outside of paid employment in the calculation of a payment rate.  Foster carers are entitled to benefit from these measures on the same basis as other carers and parents. If they are not in receipt of Child Benefit, they can still qualify for the Homemaker’s Scheme or HomeCaring Periods provided the caring periods are confirmed by Tusla.  Foster carers can register for up to 20 years caring periods for children under the age of 12, or for children over the age of 12 in the case of a child who requires full-time nursing care.  Since January 2024, long-term carer's contributions can be awarded to a person who has cared for an incapacitated person or persons requiring full-time care for a period of 20 years or more. These contributions are treated the same as paid contributions for State Pension (Contributory) entitlement only and can be used to fill any gaps in a person's contribution record, including satisfying the minimum 520 contributions, or 10 years, required for eligibility.  Foster carers who have cared for an incapacitated dependent or dependents for over 20 years also benefit from this provision.  These measures assist foster carers to access the State pension system and recognise the years spent caring for children in the same way as biological or adoptive parents, while ensuring that the system remains sustainable.  Any future changes to State Pension system would have to be considered in the overall policy and budgetary context, including the sustainability of the Social Insurance Fund.  In relation to the Back-to-School Clothing and Footwear Allowance, in June 2025, I was really pleased to announce that Back-to-School Clothing and Footwear Allowance eligibility was being extended to include children for whom Foster Care Allowance is being paid.  The Back-to-School Clothing and Footwear Allowance scheme provides a once-off payment to eligible families to assist with the costs of clothing and footwear when children start or return to school each autumn.  The scheme operates from June to September each year.  In order to qualify for Back-to-School Clothing and Footwear Allowance, an applicant must satisfy a number of qualifying conditions, one of which requires the applicant’s household income to be within the relevant income limits. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_351",
        "debateSection": {
          "debateSectionId": "dbsect_340",
          "showAs": "Social Welfare Benefits",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_340",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_340.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 351,
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 351. Deputy Peter Roche asked the Minister for Social Protection if he will outline any plans to review and improve the financial and social supports available to foster carers, including measures relating to allowances, pension entitlements, and access to additional benefits such as the back to school clothing and footwear allowance; and if he will make a statement on the matter. [62409/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  The Government remains committed to apprenticeships and has significantly expanded opportunities for learners in recent years, recognising the important role they play in equipping Ireland’s workforce with the skills needed to meet national priorities, including infrastructure delivery.  In Budget 2026 my Department secured an additional €79 million investment in apprenticeship delivery - the largest since the formation of this Department. This investment will directly support the expansion of the craft apprenticeship system and support key trades such as plumbing and electrical, which are essential to delivering the National Development Plan 2025.  To further support apprentices, €2.5 million was also secured to reduce the cost of attending higher education generally in phases 4 and 6. This will permanently lower fees by 17% for over 14,000 apprentices in the 2025/26 academic year, including more than 11,000 craft apprentices. Apprentices from the minority gender in a trade can receive a gender-based bursary and targeted bursaries to support increased uptake and retention of apprenticeship among the Traveller communities are available.  Annual craft apprenticeship registrations have risen 63%, from 4,377 in 2020 to 7,113 in 2024. The number of apprentices in construction-related fields has increased by 52%, rising from 14,567 in 2020 to 22,190 as of October 2025. These apprentices now account for the majority of Ireland’s total current apprentice population of 30,602.  My department is leading several initiatives to address the construction skills gap, including the “Build Back Home” campaign targeting Irish construction workers abroad. The campaign website has received over 68,750 visits, with 95% of traffic from North America, Canada, and Australia. A second phase of the campaign is planned shortly.  In addition, WorldSkills Ireland, held in September, saw strong engagement from second-level schools nationwide. This annual event plays a key role in showcasing career pathways in construction and raising awareness of the valuable opportunities available through apprenticeships.  The Apprentice of the Year and Employer of the Year awards highlight the value of apprenticeships by recognising excellence and promoting their role in addressing skills needs across sectors.  Building on this progress, next year will see the launch the Action Plan for Apprenticeship 2026 - 2030, setting a target to increase annual apprentice registrations from 9,352 in 2024 to 12,500 by 2030, with two-thirds in craft and construction-related areas. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_505",
        "debateSection": {
          "debateSectionId": "dbsect_481",
          "showAs": "Apprenticeship Programmes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_481",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_481.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Further and Higher Education"
        },
        "questionNumber": 505,
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 505. Deputy Peter Roche asked the Minister for Further and Higher Education, Research, Innovation and Science the steps being taken to address the current shortage of qualified tradespeople across the country; the specific measures being implemented to attract, train, and support the next generation of apprentices and skilled workers; and if he will make a statement on the matter. [62408/25] "
      }
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  I have committed to reduce monthly fees to €200 over the lifetime of the Government. The steps in achieving this ambition over the coming years will be set out in the Action Plan on Accessible, High Quality, Affordable Early Learning and Care and School-Age Childcare, which the Department is continuing to develop.  In line with the commitment in the Programme for Government, the Action Plan will be informed by a broad consultation process. I will provide further detail on the Action Plan and the consultation process at the earliest opportunity.  In the immediate term, the investment of €1.48bn secured in the 2026 budget for early learning and care and school-age childcare will allow the Department to build on recent progress in the gradual reduction of fees for parents, while also supporting supply and the quality of provision.  Budget 2026 enables Core Funding to continue to support fee-control measures and will also allow for growth in the sector. The allocation for Core Funding in 2026 will ensure fees remain at 2021 levels for a majority of providers. As well as this, there will be new maximum fee caps set to reduce costs for families paying the highest fees across the country. Further details of the new, lower maximum fee caps will be announced in the coming months.  The 2026 allocation for Core Funding will also support implementation of the recently announced Employment Regulation Orders, which led to a 10% increase in the minimum rate of pay for educators from 13 October.  There will also be enhancements in Year 5 of Core Funding to improve pay for educators and school age childcare practitioners with implementation of new Employment Regulation Orders.  Capital funding is also being made available in 2026 for the sector.  Further steps will be detailed in the Action Plan, which will look at affordability, access and quality of the early learning and care and school-age childcare system.  These three attributes – affordability, accessibility and quality – are closely connected and the ways in which they interact is complex.  It will be essential that we make progress in all three areas in parallel in order to deliver on our vision.  Officials are working on an integrated approach to minimise the risk of unintended consequences and to identify opportunities to address multiple policy challenges at the same time. ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Peter Roche",
          "memberCode": "Peter-Roche.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_108.xml"
            }
          },
          "debateSectionId": "dbsect_108",
          "showAs": "Childcare Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_108"
        },
        "questionNumber": 148,
        "date": "2025-11-12",
        "showAs": " 148. Deputy Peter Roche asked the Minister for Children, Disability and Equality for a progress report on the Programme for Government Commitment to reduce childcare costs to €200 per month per child; and if she will make a statement on the matter. [61570/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_148"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality (Deputy Norma Foley)  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly. ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Peter Roche",
          "memberCode": "Peter-Roche.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_116.xml"
            }
          },
          "debateSectionId": "dbsect_116",
          "showAs": "Disability Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_116"
        },
        "questionNumber": 156,
        "date": "2025-11-12",
        "showAs": " 156. Deputy Peter Roche asked the Minister for Children, Disability and Equality if it is the case that individuals who do not have an intellectual disability are not eligible for State-provided residential care (details supplied); if she will outline the rationale and policy position underpinning this; and if she will make a statement on the matter. [61571/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_156"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_24",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Peter Roche",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29",
          "memberCode": "Peter-Roche.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_56",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_56",
          "showAs": "Emergency Planning",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_56.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 24. Deputy Peter Roche asked the Tánaiste and Minister for Defence if the Office of Emergency Planning plans to advertise the way in which the public should respond to the various emergencies it deals with; and if he will make a statement on the matter. [60388/25] ",
        "questionNumber": 24,
        "answerText": " Tánaiste and Minister for Defence  As the Deputy will be aware, my Department is responsible for coordinating emergency planning arrangements across the Government through the Office of Emergency Planning and the Government Task Force on Emergency Planning. For over a decade now, the Office of Emergency Planning has coordinated a public awareness campaign called Be Winter Ready. This campaign was primarily focused on the challenges that the winter season can bring.  Irish Emergency Management operates on a Lead Government Department basis, once a crisis or emergency type is assigned to a Lead Government Department, that Department is then responsible for planning and preparedness, which includes public messaging. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "oral",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 15. Deputy Peter Roche asked the Minister for Education and Youth the steps her Department is taking to address the growing financial pressures facing schools, particularly in relation to the rising costs of heating, electricity, and day-to-day operational expenses; if increased funding will be made available to ensure schools can continue to function effectively and safely through the winter months; and if she will make a statement on the matter. [59750/25] ",
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_15",
        "questionNumber": 15,
        "answerText": " Deputy Peter Roche  What steps are the Department taking to address the growing financial anomalies, difficulties or pressures facing many schools, particularly in relation to the rising costs of heating, electricity, and day-to-day operational expenses that any school would incur? Will increased funding will be made available in those circumstances for schools that want to continue to function effectively and safely through the winter months? \n Deputy Helen McEntee  Like the Deputy, I am acutely aware of pressures schools can be under and the subsequent pressure on parents and the school community. That is why the Government is committed to increasing funding to support schools. The programme for Government very clearly commits to increasing capitation funding to schools of all types to ensure that schools can meet the elevated day-to-day running costs. They are not immune to the increasing costs we have seen across the board.  The commitment in the programme for Government builds on the progress which has been made in recent years. This year specifically, my Department secured €39 million in budget 2026 towards increased capitation funding. This is on a permanent basis so instead of once-off funding, this will go directly into the base for primary, post-primary and special schools. There has also been an increase for the DEIS urban band 1 schools, where there is a particular challenge. We have seen an increase in the standard capitation rates to schools of €50 per pupil for primary schools and €20 per student for post-primary schools. We have also allowed for the increase of €20 in capitation rates for the DEIS urban band one schools and the increased capitation rates will now also see special schools receiving the same rates of capitation rates for young people aged 12 years and over.  The increases announced in budget 2026 are in addition to the 12% increases as part of budget 2025. In the last three budgets there has been an overall increase of 49.7%. That said, I appreciate there is more work we need to do and more support we need to provide.  We need to look at how we permanently reduce the costs and one of the ways I believe we can do that is to look at our energy costs. A photovoltaic, PV, solar programme has been rolled out across many of the schools and, already, the feedback I am getting from the schools I have been engaging with is that schools are starting to see a reduction in their overall energy bills. It is really important we can permanently reduce the cost for schools.  My Department is looking at a body of work to assess the overall data within schools to examine what are the actual costs, where are the hidden costs that maybe we do not see every day that can emerge and add a significant challenge to schools if they are not planned for or pre-empted and of course there is the pressure that this places on the school.  Separate from that is the financial support services unit, which specifically engages and works with schools when they are in difficulty. The unit can advance particular payments to schools to help them during difficult times. I encourage any school in that situation to make sure it engages with the section and with the particular groups involved. \n An Cathaoirleach Gníomhach (Deputy Erin McGreehan)  I thank the Minister. I apologise to Deputy Roche but our time for this session is up. As agreed on the Order of Business earlier, we must move on to Topical Issue Matters. ",
        "debateSection": {
          "showAs": "School Funding",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/debate/dbsect_24",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/debate/mul@/dbsect_24.xml"
            }
          },
          "debateSectionId": "dbsect_24"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 32. Deputy Peter Roche asked the Minister for Education and Youth the steps being taken to expand youth mental health support within schools and community youth centres; if there are plans to enhance coordination between local education providers and HSE mental health services; and if she will make a statement on the matter. [59749/25] ",
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_32",
        "questionNumber": 32,
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 32 and 74 together.  At the outset, it is important to note that the provision of child and adolescent mental health services lies specifically within the remit of the Department of Health and the HSE. HSE Primary Care Psychology Services and Child and Adolescent Mental Health Services (CAMHS) provide a range of clinical supports to children and young people. Where a parent has significant concerns about their child’s mental health, they can request a referral for their child to the CAHMS through their GP. The GP may also be able to signpost to other relevant support services.  My department has built strong links with the Department of Health to explore ways to improve supports for children and young people more broadly, including around increasing awareness, promoting help-seeking behaviour, school staff training, and signposting the wide range of services available to children and young people.  My department has also been working closely with the Department of Health and the HSE to agree a protocol to facilitate referral pathways to local services, on foot of Recommendation 10 of the HSE’s mental health policy Sharing the Vision. This collaboration will assist in the creation of a Single Point of Access to mental health services for children and young people as per the HSE Child and Youth Mental Health Office Action Plan.  The area of wellbeing and the promotion of positive mental health is a priority for the Department of Education and Youth. This includes promoting emotional wellbeing and resilience and positive coping skills, which support children and young people to manage the complexities of modern life.  The department’s approach to supporting wellbeing and mental health is set out in its Wellbeing Policy Statement and Framework for Practice which can be found at www.gov.ie/en/department-of-education/campaigns/wellbeing-in-education/ and informs the department’s extensive and ongoing work in the area of student wellbeing. The departments approach is founded on research and best international practice of how schools can best support the wellbeing and mental health of children and young people. The approach proposed is a whole school and preventative approach which has multiple components that include:  - Providing children and young people with opportunities to build core social and emotional skills and competencies  - Providing children and young people with opportunities to experience supportive relationships within the school setting and to learn through those relationships  - Providing children and young people with opportunities to be part of a school environment and culture that feels both physically and psychologically safe  - Schools are encouraged to develop policies that create an environment in which children and young people feel a sense of belonging and connectedness, in which they feel their voice is heard, and they feel supported.  - Schools are encouraged to use a reflective, school self-evaluation approach to identify and prioritise the needs of its own school community in relation to the promotion of wellbeing and mental health, and to respond to meeting those needs.  Policy implementation responsibility is coordinated by the Wellbeing Office which is situated within the National Educational Psychological Service (NEPS) in the Department.  The Department’s Wellbeing Office has initiated a Policy and Implementation Plan Review to plan for the next school wellbeing strategy once the current implementation Plan completes in 2025. A broader stakeholder engagement process will take place to consult on a successor Wellbeing in Education Policy and Implementation Plan post 2025 which will inform the priorities when we produce an updated strategy incorporating the continued, adapted, or new areas of agreed focus in educational wellbeing. Department officials will advertise this review on gov.ie and will communicate with stakeholders in coming months to include them in the consultation process, that will lead to the new Wellbeing Policy and Implementation Plan going forward.  A dedicated wellbeing portal has also been developed and is now available, bringing together all the wellbeing supports and resources that have been developed by the Department and the Department’s support services, which are available to view at www.gov.ie/en/department-of-education/campaigns/wellbeing-in-education/  Social, Personal and Health Education (SPHE) is a mandatory part of the Primary and Junior Cycle curriculum, which provide vital opportunities for the development of children’s wellbeing in the physical, social, emotional and intellectual domains.  An updated Junior Cycle SPHE specification was published by the National Council for Curriculum and Assessment (NCCA) in May 2023 and was rolled out for first years in all schools from September 2023. The updated Junior Cycle specification provides clear direction on the knowledge, skills, and dispositions that all students should gain during the three years of junior cycle SPHE. It places a strong focus on the development of important life skills that young people need growing up in a fast changing and complex world. The SPHE specification is grounded in values of respect, equality, inclusivity, responsibility, dignity, compassion and empathy. The updated Junior Cycle SPHE specification consists of four strands: ‘Understanding Myself and Others’, ‘Making Healthy Choices’, ‘Relationships and Sexuality’, and ‘Emotional Wellbeing’.  The learning outcomes of the ‘Emotional Wellbeing’ Strand include that students should be able to ‘discuss the fluid nature of emotional wellbeing and ways to nurture and protect it’, to ‘consider the impact of stress and draw upon a variety of techniques to help self-regulate emotions and cope with the day-to-day stresses of life’, and to ‘ discuss ways to support themselves and others in challenging times and where/how/when to seek support, if needed’. The learning outcomes of the Making Healthy Choices strand in the updated specification include that students should be able to ‘consider the multifaceted nature of health and wellbeing, and evaluate what being healthy might look like for different adolescents, including how food, physical activity, sleep/rest and hygiene contribute to health and wellbeing, to ‘discuss societal, cultural and economic influences affecting young people when it comes to making healthy choices about smoking, alcohol and other addictive substances and behaviours (including gaming, gambling and social media addictions) and how harmful influences can be overcome in real-life situations’, and to ‘demonstrate skills and strategies to help make informed choices that support health and wellbeing and apply them in real-life situations that may be stressful and/or involve difficult peer situations’.  An updated Senior Cycle specification was approved and published in September 2024. Schools have until September 2027 to introduce the specification for students entering fifth year of the Leaving Certificate Established programme, to accommodate the necessary planning and preparatory work. This includes the development of resources and the provision of training for teachers, as key elements of this work. The specification includes a strand called ‘Health and Wellbeing’. The learning outcomes of this strand include that students should be able to ‘explore the factors that influence mental health and wellbeing, including the influence of family, peers, societal attitudes, media, technology, alcohol and drugs, and one’s sense of self’, to ‘recognise unhelpful thinking patterns and negative self-talk and how these can affect emotions and behaviour’, to ‘recognise the signs and symptoms of low mood, stress and anxiety in themselves and others and recognise when help should be sought, where to go and how to access help if needed’, and to ‘discuss ways of responding to low mood, stress and anxiety’.  An updated Primary Wellbeing curriculum has recently been published. The aims of the Wellbeing specification empower each child to thrive, now and in the future. It provides them with the necessary knowledge, skills, concepts, dispositions, attitudes and values to lead active, healthy and fulfilling lives to the best of their ability.  I would also like to draw your attention to some of the supports currently available in post-primary schools to support students including access to counselling which is a key part of the role of the Guidance Counsellor, offered on an individual or group basis as part of a developmental learning process, at moments of personal crisis but also at key transition points [ ]. Also at post primary a Student Support Team is a student-focused mechanism put in place by a school in order to co-ordinate the support available for students in the school and to facilitate links to the community and other non-school support services. Jigsaw, in partnership with the National Educational Psychological Service (NEPS)/Department of Education & Youth, provides a comprehensive suite of mental health and wellbeing resources, training and programmes for post-primary schools through Neart. Neart supports schools to provide learning opportunities for students to promote mental health and wellbeing, as well as mental health webinars and eLearning courses for school staff, Student Support Teams and parents. A full outline of all Neart supports and resources on offer for the 2025/26 academic year is available here https://d2nklej7l2bs3q.cloudfront.net/wp-content/uploads/2025/01/Neart-Programme-Areas-2025-2026-1.pdf[ ]  Separately, in 2023, the department established a €5 million pilot programme of Counselling and Mental Health supports for primary schools. The pilot received additional funding, in subsequent Budgets, to continue the pilot, which will run to June 2026. The Counselling in Primary Schools Pilot consists of 2 strands. Strand 1 is the provision of one-to-one counselling to support small numbers of children in schools in counties Cavan, Laois, Leitrim, Longford, Mayo, Monaghan and Tipperary. The Department of Education and Youth created panels of pre-approved private counsellors to provide counselling supports under the pilot. In October 2024, the department announced the extension of Strand 1 of the Counselling in Primary Schools Pilot to 61 urban DEIS primary schools. These schools, in Dublin North City and Dublin South-West, have been identified by the department as supporting children from areas with some of the highest levels of disadvantage in the State.  Strand 2 of the pilot is the establishment of Education Wellbeing Teams to support 78 schools in cluster areas in Cork, Carlow, Dublin 7 and Dublin 16. To date, 20 Education Wellbeing Practitioners have been recruited. The focus of the support provided is on strengthening whole-school preventative approaches. This includes the provision of psycho-educational support for parents and teachers and the provision of early intervention on an individual and group basis to children with mild to emerging need using low-level therapeutically informed approaches.  My Department continues to review our overall approach to fostering good mental health and wellbeing in our schools so that children can be optimally supported to reach their potential. ",
        "debateSection": {
          "showAs": "Mental Health Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_51",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_51.xml"
            }
          },
          "debateSectionId": "dbsect_51"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1020. Deputy Peter Roche asked the Minister for Housing, Local Government and Heritage when his Department last requested the Department of Health to provide its position on wind turbines, given environmental noise affects human health and that the current 2006 Section 28 Wind Energy Development Guidelines provide no specific health protection standards; and if he will make a statement on the matter. [58203/25] ",
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1020",
        "questionNumber": 1020,
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  The possible affect from wind turbine noise is the principal potential health impact attributed to wind energy developments. The Department of Climate, Energy and the Environment (DCEE) has primary responsibility for environmental noise matters.  My Department is currently undertaking a focused review of the 2006 Wind Energy Development Guidelines which will inform a new National Planning Statement on Wind Energy under the new Planning and Development Act 2024. The review is addressing a number of key aspects of the Guidelines including noise as well as setback distance, shadow flicker, community obligation, community dividend and grid connections.  My Department is working in conjunction with DCEE, in the context of its environmental noise policy remit, to finalise the guidance on the noise aspect of the review. As part of this work, DCEE, in the context of its environmental noise remit, appointed noise consultants in May 2023 to inform any amendments to the noise aspect of the National Planning Statement. As part of their work, which is now substantially complete, the noise consultants have assessed the impact of human health from turbine noise having regard to international best practice and standards, including the current World Health Organisation (WHO) standards on noise.  My Department, in conjunction with DCEE, will make any further changes to the draft National Planning Statement which are deemed necessary or appropriate in the wake of this work to ensure that the finalised National Planning Statement, once issued, are fit for purpose to provide guidance in line with renewable energy and climate targets, whilst having appropriate regard to the impacts of wind energy development, including in relation to any potential health impact caused by noise.  In line with EU Directive requirements, a Strategic Environmental Assessment (SEA) is being carried out on the draft National Planning Statement as part of the review process. In this regard, my Department intends to undertake a public consultation on updated draft Guidelines as part of the SEA process whereby all interested parties will have an opportunity to submit observations on the draft National Planning Statement, including the Department of Health. Finalised National Planning Statements will be prepared following detailed analysis and consideration of the submissions received during the consultation phase. ",
        "debateSection": {
          "showAs": "Wind Energy Generation",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_893",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_893.xml"
            }
          },
          "debateSectionId": "dbsect_893"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1736. Deputy Peter Roche asked the Minister for Health the total expenditure in 2024 on health and social care research and development; to provide a detailed breakdown of this expenditure by programme, funding stream and agency; the proportion of the overall health budget this represents; and if she will make a statement on the matter. [58204/25] ",
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1736",
        "questionNumber": 1736,
        "answerText": " Minister for Health  The Health Research Board (HRB) is the largest funder of health and social care research in the state. In 2024, the HRB was allocated €58,055,000 by the Department of Health which represents 0.254% of the total Department of Health expenditure for 2024.  The Deputy may wish to consult the HRB’s financial statements for the year 2023, publicly available on the HRB's website. The financial statements capture the breakdown of expenditure by award. The HRB’s Annual Report Part 1 2024 contains a list of all awards given out in 2024 and can also be accessed on the HRB's website.  The 2024 financial statements (HRB Annual Report Part 2 of 2024) are currently being audited by the Comptroller and Auditor General, as per normal processes, and will be laid before the Houses of the Oireachtas thereafter. ",
        "debateSection": {
          "showAs": "Departmental Expenditure",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1492",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1492.xml"
            }
          },
          "debateSectionId": "dbsect_1492"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1737. Deputy Peter Roche asked the Minister for Health the number of public patients on waiting lists in University Hospital Galway and Portiuncula University Hospital who have received care via third party insourcing activity; the extent to which this activity has reduced waiting lists, from 2021 to date in 2025, in tabular form; and if she will make a statement on the matter. [58205/25] ",
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1737",
        "questionNumber": 1737,
        "answerText": " Minister for Health  In relation to the particular query raised as it relates to a service matter I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "debateSection": {
          "showAs": "Hospital Waiting Lists",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1493",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1493.xml"
            }
          },
          "debateSectionId": "dbsect_1493"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1738. Deputy Peter Roche asked the Minister for Health if her attention has been drawn to restrictions placed on third-party insourcing and National Treatment Purchase Fund published data showing a parallel increase in waiting lists in recent months across the country, including in University Hospital Galway; the steps her Department will take to ensure an appropriate balance is being struck in phasing out third-party insourcing while also ensuring all avenues are explored in reducing waiting lists where no permanent solution is immediately available within current HSE capacity; and if she will make a statement on the matter.  [58206/25] ",
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1738",
        "questionNumber": 1738,
        "answerText": " Minister for Health (Deputy Jennifer Carroll MacNeill)  The Government acknowledges that acute hospital waiting lists are too long, and many patients are waiting an unacceptably long time for care.  We are committed to improving access to hospital care, through reforms and by building sustainable internal capacity within the public system and ensure that this is maximised to the greatest extent through greater productivity and efficiencies.  Until that capacity is in place to meet the increased demand, we need to utilise all available options in the public and private systems to ensure that patients have access to the care they need.  However, I firmly believe that we are overly reliant on insourcing and private sector outsourcing to deal with our waiting lists.  Given my concerns about the operation of the insourcing model in particular, earlier this year I asked the CEO of the HSE to conduct a review of insourcing and outsourcing. Having considered the review with my officials and the HSE, I wrote to the CEO in August authorising him to introduce a number of control measures to restrict the use of third-party insourcing.  We need to move away from our dependency on this model to fully use the internal underutilised capacity we have within our core health service and this means that productivity in the HSE itself must improve and we are taking action to address this, including through the full implementation of the Public Only Consultant Contract (the POCC) for:  • more efficient rostering of services across 6/7 days;  • better scheduling of outpatients to maximise existing resource utilization;  • improved benchmarking and standardisation of scheduled care;  • maximising physical assets such as diagnostics, surgical hubs, virtual wards where appropriate.  Given the time lag in these productivity measures impacting on scheduled care performance, I approved a recommendation in the CEO’s report that the HSE engage with the NTPF and private providers, including non-hospital providers, to develop an expanded framework to outsource scheduled care work once all core capacity has been utilised.  In addition, to ensure patient have access to the treatments they require, 3rd party insourcing can still be used if a derogation from the relevant REO has been granted, all control measures have been complied with and a significant need for a targeted scheduled care initiative has been identified. ",
        "debateSection": {
          "showAs": "Hospital Waiting Lists",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1494",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1494.xml"
            }
          },
          "debateSectionId": "dbsect_1494"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Emigrant Support Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_71.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_71",
          "debateSectionId": "dbsect_71"
        },
        "to": {
          "showAs": "Foreign",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister of State at the Department of Foreign Affairs and Trade  I propose to take Questions Nos. 105 and 134 together.  In line with the commitments in the Programme for Government, I am committed to facilitating the easier return to Ireland for our diaspora.  I am currently hosting a series of consultations with Irish communities around the world to inform our new diaspora strategy. As part of these discussions, I always ensure that time is provided for those considering retuning home, so I can hear their experiences first hand. These in-person engagements have been supplemented by an online consultation, the Global Irish Survey, which also asked participants for any views they have on returning to Ireland. These are important discussion and the views will feed into our new strategy.  Even ahead of our new strategy, we are focused on supporting those who wish to come home.  Through the Emigrant Support Programme, we fund the Citizens’ Information Board's \"Returning to Ireland\" portal, which contains a wide range of very practical information and advice for returning emigrants. Furthermore, the Department of Foreign Affairs and Trade works closely with partners such as Crosscare and Safe Home, who provide information and support to returning Irish emigrants.  We also fund Back for Business, an initiative we established to support and guide Irish entrepreneurs who have returned, or plan to return, to Ireland.  Through the Interdepartmental Committee on the Irish Abroad which I chair, we also work closely with other departments on specific issues such as access to PPS numbers and the criteria around habitual residence in areas such as social protection and housing.  Driving Licence exchange is another issue that comes up regularly. Ireland currently allows licence exchanges with 21 jurisdictions, including Australia, New Zealand, United Kingdom and seven Canadian provinces. As such agreements with the US have to bee concluded on a State by State basis, our focus initially is on those states with a significant Irish population. Engagement is currently underway with New York State.  I am also pleased to see that some private insurance companies are now offering specialised motor insurance cover policies for returning emigrants, which is an issue that has been raised with me in the past. ",
        "questionType": "written",
        "showAs": " 134. Deputy Peter Roche asked the Tánaiste and Minister for Foreign Affairs and Trade the measures his Department is taking to support young Irish emigrants who wish to return home, given the practical difficulties many face in securing housing, employment, and basic documentation on their return; and if he will make a statement on the matter. [57136/25] ",
        "questionNumber": 134,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Peter Roche",
          "memberCode": "Peter-Roche.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_134"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Small and Medium Enterprises",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_70.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_70",
          "debateSectionId": "dbsect_70"
        },
        "to": {
          "showAs": "Foreign",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 104, 112, 141 and 159 together.  Deepening Ireland’s global engagement and driving trade and prosperity are core priorities for this Government and for my Department. Trade promotion in particular remains a key priority and there will be more than forty Ministerial-led trade missions to different parts of the world this year. Between now and the end of the year there will be trade missions supporting Irish business to the US, South Africa, Canada and Germany amongst others.  These of course involve close collaboration right across Government Departments and Agencies. My Department works closely with the Department of Enterprise, Tourism and Employment, given the lead role of that Department and the agencies under its remit on tourism and trade promotion, including supports provided to SMEs.  Tourism Ireland is responsible, for marketing the island of Ireland as a tourism destination working directly with partners in the tourism industry. Enterprise Ireland supports Irish companies expanding internationally and is the primary conduit for supports to SMEs such as the LeanPlus grant, GradStart, and the Dynamic Leadership – Roadmap to Growth programme.  My Department also plays a key role in coordinating Ireland’s overall international promotional work. This is primarily led through the Government Trade Forum, which I established earlier this year and which has already met on eight occasions. In addition to business representatives, the Forum also has the CEOs of the relevant State Agencies involved in trade promotion as part of its membership.  This work is also driven through the Headquarters Market Team which is co-chaired by officials in my Department and the Department of Enterprise, Tourism and Employment. Both bodies includes senior representatives from Tourism Ireland and Enterprise Ireland. Both the Government Trade Forum and the HQ Market Team oversee implementation of the Government’s new Action Plan on Market Diversification.  Under the Trade and Investment Strategy, our Ambassadors lead Local and Regional Market Teams, which includes all of the relevant State agencies including Tourism Ireland and Enterprise Ireland. These teams provide important strategic direction and effective coordination of Team Ireland’s activities overseas, with a view to maximising the value and impact of Ireland’s in-market promotional activities including on tourism promotion and supporting Irish businesses access to new markets.  Specific promotion activities supported by the diplomatic network include overseas trade and tourism missions organised by Enterprise Ireland and Tourism Ireland. More broadly, the diplomatic network also works to raise awareness of, and interest in, Ireland through annual global campaigns, particularly around St. Brigid’s Day, St. Patrick’s Day and Bloomsday.  My Department also leads coordination on major economic and public diplomacy initiatives, which serve to raise awareness of Ireland as a location to invest, study, live and do business. Examples of this include Ireland House at the South by Southwest (SXSW) Conference and Festival, which takes place in Austin, Texas, in March every year, and the recently completed Expo in Osaka, Japan.  My Department will continue to support mission-led initiatives in 2026, promoting Ireland as a tourism destination and a place to do business, as well as promoting Irish businesses, in close partnership with state agencies, and in line with our strategic priorities. ",
        "questionType": "written",
        "showAs": " 159. Deputy Peter Roche asked the Tánaiste and Minister for Foreign Affairs and Trade the way in which Ireland’s diplomatic network is being used to promote Ireland as a tourism destination, particularly in key overseas markets; whether additional initiatives are planned to strengthen tourism ties abroad; and if he will make a statement on the matter. [57137/25] ",
        "questionNumber": 159,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Peter Roche",
          "memberCode": "Peter-Roche.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_159"
      }
    },
    {
      "question": {
        "answerText": " Deputy Peter Roche  I welcome the debate here this morning. I ask the Minister to set out the steps being taken to expand apprenticeship and skills training opportunities right across areas such as County Galway, where access to approved training centres remains limited in some instances; if consideration will be given to establishing mobile or satellite training hubs in partnership with ETBs to reduce travel and dropout rates among rural apprentices; and if he will make a statement on the matter. \n Deputy Marian Harkin  I hear the Deputy's question because this is an issue that has come to my attention, especially in more rural counties. Apprenticeships are national programmes. As much as possible, SOLAS schedules craft apprentices to an available training location near to the home of the apprentice. If a placement is not available near an apprentice's home, SOLAS will endeavour to schedule him or her to attend the nearest available location. As with every other post-secondary education route, not all programmes are available in every location. During their induction, apprentices are advised that they may be required to travel to other counties for training. Apprentices are assigned a training adviser in their employer's region, who provides ongoing support throughout the programme.  Craft apprentices required to travel outside their home region may qualify for an accommodation allowance. Travel and meal allowances are also available, although it is important to say that only one type of allowance is payable per training phase. In the national survey of apprenticeships which was published last month, 87% of apprentices reported that they are enjoying their apprenticeship experience and 84% have developed confidence in their ability to learn. A total of 85% are glad they chose the apprenticeship route and feel part of their organisation, and, crucially, 94% believe their apprenticeship will provide good employment opportunities.  This positive experience is reflected in the relatively low non-progression rates. That is something we should look at where apprenticeships are concerned. There are very low non-progression rates. Between 90% and 92% of first-year apprentices progress to their second year. \n Deputy Peter Roche  I thank the Minister of State for the comprehensive response. We all need to promote and support apprenticeships and to encourage apprentices to follow through to qualification, because there is a much-needed requirement and demand, particularly to service industry. If we think about construction, that is the core heart of people we will need in the future. We need them now, but the more encouragement we can give them to follow through with their apprenticeships and training, the better it will be for this island. \n Deputy Marian Harkin  I thank the Deputy. I absolutely agree. That is why an extra €79 million was acquired in this budget for apprenticeships, bringing the overall investment to nearly €411 million. That is clear evidence of the Government's determination to fund the apprentice system. It is more than just funding. It is also ensuring that more and more people see apprenticeships as a viable and exciting educational pathway. Much work is going into that. I know the Deputy is concerned about this issue of apprentices receiving training closer to their home location. I fully understand that but it is important to say that every effort is made by SOLAS to try to ensure that can happen. Where learners are travelling outside of their home region, certain allowances are available. They can decline a call to a location up to three times. The system is as flexible as it can be. \n Deputy Peter Roche  I welcome that. The more remote or rural the training courses are, the easier it is, at times, to find accommodation. We almost always hear that in urban settings, accommodation is nigh impossible to secure. In instances where courses could be rolled out in more rural or satellite towns, out of the cities and bigger towns, accommodation is sometimes that bit more accessible. I am interested in the Minister of State's responses on this matter. I appreciate that she is mindful of it and that it is something we can look forward to seeing progressed. \n Deputy Marian Harkin  I fully appreciate what the Deputy is saying. Accommodation is a significant issue for all third level students. We are talking about apprenticeships in particular. I just had a look at the apprenticeships that are available in Galway-Roscommon ETB. I see that it offers training in various locations. For example, Galway Technical Institute offers training as an accounting technician, auctioneering and commis chef are offered in Athenry, hairdressing is offered in Galway Technical Institute, and software development is offered in the Mervue training centre. The Deputy can see from that that a real effort is being made. I have just a few locations here. The Deputy will be aware of all of them in his own county. Every effort is being made to try to ensure that the courses available for apprenticeships are in locations that are as suitable as possible for them to attend. ",
        "by": {
          "showAs": "Peter Roche",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29",
          "memberCode": "Peter-Roche.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "date": "2025-10-16",
        "questionNumber": 12,
        "questionType": "oral",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/debate/dbsect_15",
          "debateSectionId": "dbsect_15",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/debate/mul@/dbsect_15.xml"
            }
          },
          "showAs": "Apprenticeship Programmes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-16/pq_12",
        "showAs": " 12. Deputy Peter Roche asked the Minister for Further and Higher Education, Research, Innovation and Science the steps being taken to expand apprenticeship and skills training opportunities in rural areas such as County Galway, where access to approved training centres remains limited; if consideration will be given to establishing mobile or satellite training hubs in partnership with ETBs to reduce travel and dropout rates among rural apprentices; and if he will make a statement on the matter. [55759/25] "
      },
      "contextDate": "2025-10-16"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  I am very conscious of the cost pressures facing students who pay for student accommodation or who commute long distances to their institutions. The Student Grant Scheme also recognises this by providing a higher non-adjacent maintenance grant rate for students whose normal residence is 30km or more from their institution.  Students this academic year are benefitting from Budget 2025 which increased all income thresholds to avail of a student grant including increasing all standard rate thresholds by at least 15%.  In addition, I was delighted in Budget 2026 to: -  • Reduce the student contribution charge permanently by €500 commencing this academic year which will benefit c108,000 students.  • Increase all non-adjacent maintenance grant rates, c30,000 students this academic year will see a pro-rata increase of between €111-239.  • Permanently increase the Post Graduate Fee Contribution Grant by €500 from €4,000 to €4,500 benefitting over 2000 students.  From September 2026  Students will see the full benefit of non-adjacent maintenance grant rate increases with the: -  • Non-Adjacent Special Rate increasing by €350  • Band 1 Non-Adjacent Rate increasing by €430  • Bands 2-4 Non-Adjacent Rates increasing by €200  The income threshold for the special rate of grant will increase in line with social welfare from €27,400 to €28,600.  The income threshold for the €500 student contribution grant will increase from €115,000-€120,000. Combined with the permanent fee reduction, this means that eligible undergraduate students whose households earning are under €120,000 will pay no more than €2,000 towards the student contribution charge in the 26/27 academic year. ",
        "by": {
          "showAs": "Peter Roche",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29",
          "memberCode": "Peter-Roche.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "date": "2025-10-16",
        "questionNumber": 59,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/dbsect_95",
          "debateSectionId": "dbsect_95",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/mul@/dbsect_95.xml"
            }
          },
          "showAs": "Third Level Costs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-16/pq_59",
        "showAs": " 59. Deputy Peter Roche asked the Minister for Further and Higher Education, Research, Innovation and Science if he will review the current SUSI income threshold and related grant supports for students from low and middle-income families in rural constituencies such as Galway east, where transport and accommodation costs are significantly higher due to limited public transport and distance from third-level campuses; and if he will make a statement on the matter. [55760/25] "
      },
      "contextDate": "2025-10-16"
    },
    {
      "question": {
        "answerText": " Deputy Peter Roche  I welcome both Ministers to the House for this worthwhile debate that we are having. Will the Minister for Rural and Community Development and Gaeltacht provide an update on his Department's plans to streamline and accelerate the approval process for local improvement schemes and outdoor recreation infrastructure scheme applications, particularly in areas such as east Galway where some shovel-ready projects with local match funding are awaiting sanction? Will he make a statement on the matter? \n Deputy Dara Calleary  I thank the Deputy for his question. As part of the ongoing process of co-ordinated scheme delivery across my Department, schemes such as the outdoor recreation infrastructure scheme, ORIS, involve a well-established process of issuing calls for applications, project evaluation and project selection. In general, my Department's schemes are administered on a competitive basis, which underpins the delivery of value for money and the selection of high quality projects. Applications for ORIS are administered, prioritised and submitted by each local authority and by local development companies to my Department for assessment. The process, while reviewed and refined ahead of each funding iteration, is well-embedded across the local authorities and local development companies.  ORIS provides funding for the development and enhancement of infrastructure such as walking trails, cycleways, water-based recreation sites and mountain trails. It is typically opened every 18 months across a number of different measures. I have already announced the successful projects under measure 1 and the project development measure of the 2024-25 scheme. The successful projects under measures 2 and 3 will be announced before the end of this year.  Since 2020, almost €5 million has been approved for 58 projects across Galway under ORIS. The local improvement scheme, LIS, is one of the key supports to rural communities in that it improves non-public rural roads and laneways that are not typically maintained by local authorities. While my Department provides funding for the scheme, it is fully administered by local authorities. Local authorities are responsible for the selection and the prioritisation of those roads, as well as the management of applications and waiting lists. Following my approval in August of additional allocations under the scheme, Galway County Council’s 2025 allocation is now €2.1 million, which is an increase of €843,000 on its original 2025 allocation, and the council has indicated to me that its full allocation will be utilised by year end. Significant levels of investment have been delivered under my Department's rural development investment programme in recent years and I am absolutely committed, along with the Minister of State, Deputy Buttimer, to ensuring that this funding continues to be utilised in an efficient and effective manner. \n Deputy Peter Roche  I thank the Minister. First, I am a great advocate, as I am sure many others are, for investment in the infrastructure developments he mentioned such as walkways, greenways and cycleways. We are living in an area where the population, thankfully, is increasing. I am also mindful that people are craving those kind of recreational opportunities, particularly people who want to seek outdoor recreational exposure for childhood obesity, mindfulness or people who are struggling with mental health issues. I am sure anything the Minister can do in promoting and supporting that is a really welcome departure.  Right across every county the LIS has proved to be a very essential component or element. There are people who are building their first home in little laneways who apply for those scheme and it is a really great saviour when they can have that. \n Deputy Dara Calleary  I could not agree with the Deputy more on outdoor recreation. The focus of the ORIS scheme is to support outdoor recreation infrastructure. It funds projects such as walkways, cycleways, blueways, water and cycle trails, mountain-access routes and open water amenities of bogs, rivers, lakes and beaches, including tidal pools. Projects are generally located in the countryside under the scheme. However, we will examine projects that might link a town or a village to an existing outdoor recreational facility in the countryside. We try to align some of the principles of ORIS with the national outdoor recreational strategy, Embracing Ireland’s Outdoors, to also maintain and improve existing trails. While we build new ones, existing trails are equally as important.  LIS is extremely important and is a major focus for me. I am delighted to be able to tell the Deputy that in 2024 Galway County Council was one of the top six performing local authorities. It had minimal underspend. It is crazy to be able to say that there were local authorities that did not spend their LIS allocation and returned money. I cannot understand that and I am sure, as I look around the Chamber here, none of us can understand that as Deputies who know communities who need that LIS expenditure. That will not happen again. \n Deputy Peter Roche  I can certainly attest to the fact that any moneys that Galway County Council get will be spent very wisely and very prudently. It has quite a comprehensive list of infrastructure that it wishes to develop under these schemes. One of the things I ask about passionately is that the Department continues to invest in these schemes, particularly in outdoor recreation. It is a game-changer for many communities. Certainly, in east Galway, in my neck of the woods, I would welcome any investment in that regard. \n Deputy Dara Calleary  We funded 59 projects in Galway since 2020 under ORIS with an investment of €4.944 million. There are some really good ones, including the Creggs mountain walk and the Glinsk Heritage Park, which are two really good examples.  In relation to the LIS, since 2020 we have funded 195 roads in Galway, an investment of €10.04 million. That is money well spent.  As regards ORIS, one of the few good things to come out of Covid was that people embraced the outdoors and, more importantly, their local outdoors. We see it in the increase in people using facilities. We see it particularly in our partnership with Coillte around recreational spaces and forests and where we make investments. There has been an extraordinary increase in people using existing forests where trails have been opened, access has been opened and investments have been made in infrastructure and facilities to draw people to forests. I was with the Leas-Cheann Comhairle in Kilkenny earlier in the summer opening up new facilities there. It is extraordinary to see how small investments can totally open up an area and allow people to make full use of their local infrastructure facilities. \n Deputy Micheál Carrigy  I have a question about the LIS. The Minister stated that some counties are not spending their allocation. I come from the county of Longford, where we have huge waiting lists. We spend our entire allocation. I ask that any moneys not spent by a local authority be ring-fenced and sent back to those local authorities that are spending what has been allocated and have long waiting lists. ",
        "by": {
          "showAs": "Peter Roche",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29",
          "memberCode": "Peter-Roche.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "date": "2025-10-16",
        "questionNumber": 89,
        "questionType": "oral",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/debate/dbsect_28",
          "debateSectionId": "dbsect_28",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/debate/mul@/dbsect_28.xml"
            }
          },
          "showAs": "Departmental Schemes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-16/pq_89",
        "showAs": " 89. Deputy Peter Roche asked the Minister for Rural and Community Development and the Gaeltacht if he will provide an update on his Department’s plans to streamline and accelerate the approval process for local improvement scheme and outdoor recreation infrastructure scheme applications, particularly in areas such as Galway east, where shovel-ready projects with local match funding are awaiting sanction; and if he will make a statement on the matter. [55758/25] "
      },
      "contextDate": "2025-10-16"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  My Department ensures a fair and equitable distribution via a range of schemes which are targeted based on need and reviewed before each launch to ensure that they continue to respond to evolving needs.  The CLÁR Programme provides funding under a number of different measures for small-scale infrastructural projects in designated rural areas that have experienced significant levels of depopulation over a defined period. This is targeted at smaller rural settlements that have experienced depopulation in the past. It is a matter for each local authority to accept and prioritise applications under measure 1 for community infrastructure and amenities based on their own assessment of need locally.  Since 2020, over €53 million has been approved for almost 1,300 projects nationwide under the CLÁR programme with over €4 million of this being allocated for 93 projects in County Galway.  The Town and Village Renewal Scheme (TVRS) was introduced in 2016 and has to date allocated almost €184 million to over 1,800 projects nationally. Almost €7 million has been allocated to 74 projects in County Galway and supported projects can be found in east Galway towns such as Athenry, Ballinasloe, Gort and Portumna. Details of all projects approved can be found on my department’s website.  Delivered in partnership with local authorities, it primarily targets funding at areas with populations of less than 10,000 people. All applications received under the scheme are assessed competitively for suitability against the scheme criteria and objectives. Factors such as the geographical spread of projects are also considered to maximise this funding’s impact.  The current LEADER Programme, which runs to 2027, is operational across the country. It supports a broad range of enterprises and community groups to develop projects which improve the quality of life and economic activity in rural areas. It is delivered through Local Action Groups (LAGs) across rural Ireland, facilitating a community-led, bottom-up approach to rural development. Under the current 2023-2027 LEADER Programme, Galway has an allocation of €9 million, almost €5.5 million of which is allocated to Galway East.  To ensure a fair and balanced allocation of LEADER funding across rural areas, the allocation methodology included a baseline amount to each sub-regional area, with additional funding based on population density and level of deprivation of the area.  I will continue to keep the focus of all my department's schemes under review to ensure the continued efficient and effective use of available resources. ",
        "by": {
          "showAs": "Peter Roche",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29",
          "memberCode": "Peter-Roche.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "date": "2025-10-16",
        "questionNumber": 107,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/dbsect_130",
          "debateSectionId": "dbsect_130",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/mul@/dbsect_130.xml"
            }
          },
          "showAs": "Rural Schemes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-16/pq_107",
        "showAs": " 107. Deputy Peter Roche asked the Minister for Rural and Community Development and the Gaeltacht the measures being taken to ensure a fair and balanced distribution of funding across rural counties, particularly in Galway east, under upcoming allocations for the LEADER, CLÁR, and town and village renewal schemes; if priority will be afforded to rural communities experiencing infrastructure deficits, depopulation, and planning constraints; and if he will make a statement on the matter. [55757/25] "
      },
      "contextDate": "2025-10-16"
    },
    {
      "question": {
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-09/pq_19",
        "answerText": " Minister for Justice, Home Affairs and Migration  Tackling the scourge of drug dealing and targeting the work of organised crime groups, who inflict intimidation, violence and misery on families and communities across Ireland is a top priority for the Government and my Department.  An Garda Síochána continues to implement an enhanced national anti-drugs strategy through Operation Tara. The focus of this operation is to disrupt, dismantle and prosecute drug trafficking networks, at all levels - international, national and local. It extends to anyone involved in the importation, distribution, cultivation, production, local sale and supply of controlled drugs.  I understand that, as part of Operation Tara and ongoing investigations targeting the sale and distribution of controlled drugs and drug trafficking networks, Gardaí from the Galway Divisional Drugs Unit seized cocaine with an estimated street value of €161,000 and arrested a man on 1 September 2025.  Under Operation Tara, individuals and groups involved in the drug trade will continue to be the target of enforcement activity based on intelligence and the latest crime trends.  At a national level, the Garda National Drugs and Organised Crime Bureau leads in tackling all forms of drug trafficking and the supply of illicit drugs in Ireland. Collaboration at an inter-agency and international level remain key in tackling this issue. Given the global nature of the drugs trade, international law enforcement co-operation remains a key element in the overall response.  While the Garda Commissioner is responsible for the management of Garda resources, I am committed to ensuring that An Garda Síochána has the resources it needs to fight crime and a strengthened, well-resourced Garda organisation is central to this policy. I am pleased to say that I secured a record allocation for An Garda Síochána in last Tuesday's Budget of over €2.59 billion for 2026, which will support the recruitment of up to 1000 Gardaí and 200 Garda staff in 2026.  We can see throughout our communities the damage and devastation that organised drug crime gangs heap on society. The motivator for all these organised crime gangs when it comes to the dealing of drugs is money.  The Criminal Assets Bureau continues to be at the forefront of fighting organised crime in this country and disrupting the activities of criminal gangs by depriving them of ill-gotten assets.  My Department is also working to introduce legislation to further strengthen the State’s ability to seize criminal assets and to target the proceeds of crime. The new Bill will also speed up the process to dispose of seized assets for the benefit of the State.  The Department of Health leads on Government policy in the area of drugs, guided by the whole of Government national drugs and alcohol strategy. While this strategy recognises the need for a balanced health-led approach, it is also matched with strengthened enforcement measures across government to tackle the supply of illegal drugs.  Sustained action by An Garda Síochána continues unabated, bringing significant convictions and ongoing seizures of drugs, firearms and ammunition. I can assure the Deputy that we will continue to do everything we can to support Gardaí in this regard. ",
        "date": "2025-10-09",
        "questionNumber": 19,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/writtens/dbsect_36",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/writtens/mul@/dbsect_36.xml"
            }
          },
          "debateSectionId": "dbsect_36",
          "showAs": "Drug Dealing"
        },
        "showAs": " 19. Deputy Peter Roche asked the Minister for Justice, Home Affairs and Migration the specific actions his Department intends to take in response to the recent increase in drug-related arrests across Galway; and if he will make a statement on the matter. [54139/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Justice",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-10-09"
    },
    {
      "question": {
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-09/pq_83",
        "answerText": " Minister for Justice, Home Affairs and Migration  Community safety is a top priority for my Department. Everyone has the right to be safe and feel safe and rural Ireland is no exception.  Supporting the work of the National Rural Safety Forum, my Department has published the second Rural Safety Plan 2025-2027. The Plan’s vision is to ensure people and communities in rural Ireland feel safe and are safe in their homes, places of work, and their local environments.  The Garda Commissioner is responsible for the management and administration of An Garda Síochána, which includes all operational policing matters. As Minister, I have no role in these independent functions.  With regard to burglaries, which can be of particular concern for people living in isolated areas of the country, I can say that An Garda Síochána have had considerable success in reducing the prevalence of this through Operation Thor, which focuses on the prevention of burglaries and associated crimes, throughout Ireland, using strategies which are adapted for both rural and urban settings.  An Garda Síochána launched the Winter Phase (2025/2026) of Operation Thor on 1 October 2025.  In the 10 years since Operation Thor was introduced, burglary and related offences have declined overall. The level of residential burglary during the winter months, October to March, has fallen by 75% since the commencement of Operation Thor in 2015.  Under Operation Thor, the Garda National Drugs and Organised Crime Bureau (GNDOCB) co-ordinates and supports Divisional resources actively targeting organised crime gangs and repeat offenders, particularly involved in rural burglaries and crimes, through enforcement activity based on intelligence and the latest burglary trends.  Gardaí conduct high-visibility patrols and check-points at specific times of day in known ‘hot-spots’ to reduce the movement of burglars, gathering intelligence on known offenders and regularly communicating with those in the community about crime prevention measures.  Operation Thor also aims to reduce burglaries by ensuring every burglary is appropriately investigated to the highest possible standard and by monitoring crime data for changes in trends of burglaries, associated crimes and detection rates.  An Garda Síochána also promotes the practice of ‘property marking' which is a process where a physical mark is etched onto a piece of property such as a bike, laptop or tools. Property Marking engagement days are held by local community policing units and regularly highlighted on Garda social media platforms.  The 'Lock Up Light Up’ campaign is An Garda Síochána's anti-burglary awareness campaign which encourages homeowners to protect their homes over the winter months, when burglaries traditionally tend to rise. ",
        "date": "2025-10-09",
        "questionNumber": 83,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/writtens/dbsect_99",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/writtens/mul@/dbsect_99.xml"
            }
          },
          "debateSectionId": "dbsect_99",
          "showAs": "Crime Prevention"
        },
        "showAs": " 83. Deputy Peter Roche asked the Minister for Justice, Home Affairs and Migration the specific measures he is taking as we enter the winter months, given reports in media outlets such as RTÉ that people are more likely to be burgled during this period; the measures in place to ensure the safety and protection of vulnerable people across rural Ireland in particular this winter; and if he will make a statement on the matter. [54138/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Justice",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-10-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  My Department has overseen considerable legislative and structural reform of the Irish planning system over the past two years.  The National Planning Framework (NPF) has been reviewed to reflect Ireland’s housing and infrastructure goals associated with a growing population and economy, and provides the planning system with a strategic plan to shape the future growth and development of our Country to 2040.  The Planning and Development Act 2024 (the Act) represents the most significant update of planning legislation in a quarter century and contains many impactful reforms.  The Act introduces statutory time periods for decision making for An Coimisiún Pleanála (An Coimisiún) for the first time. Increased resource allocation to An Coimisiún Pleanála has reduced number of cases on hands from 3,638 in May 2023 to 1,362 cases in July 2025, which is a 62.5% decrease. In terms of processing timelines, all large Scale Residential Development applications (100 units or more) have met their statutory objective period target of 16 weeks, since September 2024. The average number of weeks to dispose such cases was 9 weeks by May 2025.  The new Act also makes important reforms in relation to Judicial Review (JR):-  • removing the requirement to apply for leave to apply for JR, which reduces time and removes unnecessary legal costs to all parties.  • requires that an application for JR may only be made on the grounds of challenge raised by the applicant in the statement of grounds filed with their application.  • provides that an applicant for JR will not be permitted to plead a ground in JR proceedings unless they have a sufficient interest in the matter to which the ground relates.  Alongside the above reforms, my Department is also currently revising exempted development Regulations, developing a Planning Excellence Framework and implementing the Ministerial Action Plan on Planning Resources, which covers a range of measures to address resourcing challenges across the sector. ",
        "by": {
          "showAs": "Peter Roche",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29",
          "memberCode": "Peter-Roche.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "date": "2025-10-08",
        "questionNumber": 17,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/dbsect_24",
          "debateSectionId": "dbsect_24",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/mul@/dbsect_24.xml"
            }
          },
          "showAs": "Planning Issues"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-08/pq_17",
        "showAs": " 17. Deputy Peter Roche asked the Minister for Housing, Local Government and Heritage the methods his Department is currently assessing to speed up the planning process; and if he will make a statement on the matter. [53744/25] "
      },
      "contextDate": "2025-10-08"
    },
    {
      "question": {
        "date": "2025-09-25",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29"
        },
        "showAs": " 62. Deputy Peter Roche asked the Minister for Enterprise, Tourism and Employment the supports his Department is putting in place to assist small and medium-sized enterprises, particularly those without dedicated HR capacity, to prepare for the introduction of the auto-enrolment pension scheme (details supplied); if he is aware that many SMEs in areas such as Galway east have reported receiving little to no communication about the scheme and are concerned about the additional administrative costs; and if he will make a statement on the matter. [50819/25] ",
        "to": {
          "roleType": null,
          "showAs": "Enterprise",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-25/writtens/mul@/dbsect_94.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-25/writtens/dbsect_94",
          "showAs": "Small and Medium Enterprises",
          "debateSectionId": "dbsect_94"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-25/pq_62",
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  The Auto-enrolment pension scheme is under the remit of the Department of Social Protection, which has provided me with the information below.  The Programme for Government contains a commitment to introduce the Automatic Enrolment (AE) Retirement Savings System. The aim of introducing AE is to address the pension coverage gap that exists in Ireland and to provide workers with greater comfort and security regarding their retirement income. The new system - to be known as My Future Fund - will commence from 1 January 2026.  The national campaign to raise awareness of 'My Future Fund' is well underway, with the current focus being on awareness raising with employers. Thousands of employers and related professionals in HR and payroll have been directly reached through webinars, conferences and in person stakeholder meetings in recent months, most recently at the National Ploughing Championships. The second phase of the strategy commenced this summer with the launch of an advertising campaign on multiple media platforms.Additional campaigns targeted at employers and employees will be run before and after the launch in January 2026.  There is a very good, up-to-date information hub available to anyone who wants to learn more about My Future Fund and how it will work. This is at www.gov.ie/autoenrolment, and it includes links to information videos on the Department of Social Protection's YouTube channel.  Any queries on this should be directed to my colleague, Minister Dara Calleary TD. ",
        "questionNumber": 62
      },
      "contextDate": "2025-09-25"
    },
    {
      "question": {
        "date": "2025-09-25",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "oral",
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29"
        },
        "showAs": " 96. Deputy Peter Roche asked the Minister for Social Protection if he will review the assessment criteria for social protection payments in cases where applicants and-or part-time farming applicants are not in paid employment outside the home but provide essential unpaid care and support within the household; and if he will consider allowing greater flexibility in recognising minimal or subsistence-level farming activity (details supplied), in view of concerns that rigid application of the rules is leaving some families without necessary supports; and if he will make a statement on the matter. [50808/25] ",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-25/debate/mul@/dbsect_32.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-25/debate/dbsect_32",
          "showAs": "Social Welfare Eligibility",
          "debateSectionId": "dbsect_32"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-25/pq_96",
        "answerText": " Deputy Peter Roche  Will the Minister consider reviewing the assessment criteria for social protection payments, especially in cases where applicants, including part-time farmers, are not in paid employment outside of the home but are providing unpaid care within the household? Could there be more flexibility in recognising minimal or subsistence-level farming activity, given the concerns that the current rigid rules are leaving some families without the supports they badly need? \n Deputy Dara Calleary  My Department provides a number of supports for small-scale farmers in the circumstances outlined by Deputy Roche. Farm assist is the statutory income support specifically for farmers on low incomes. A person can qualify for farm assist if he or she is aged from 18 to 66, engaged in farming and meets the other statutory scheme conditions of the scheme. The farm assist scheme is similar to the jobseeker's allowance in a number of ways, such as the retention of secondary benefits and access to activation programmes where a person may want to take up off-farm employment or is seeking educational or training opportunities.  However, the means test is more generous on farm assist. For example, under jobseeker's allowance, self-employed income is assessed at 100%; this is reduced to 70% under farm assist. Child disregards apply under farm assist which do not exist under jobseeker's allowance. In addition, account is taken of any exceptional circumstances to ensure the assessment for the scheme reflects the current situation accurately. The scheme is demand-led and there are currently just over 3,300 farmers availing of the farm assist payment.  The Government acknowledges the valuable role that family carers play and remains fully committed to supporting carers in that role, including those who care in a farm situation. This is recognised in the programme for Government. We provide a range of income supports for carers, including carer's allowance, carer's benefit, domiciliary care allowance and the annual carer's support grant. If the Deputy has specific cases that are not qualifying, I ask him to bring them to my attention and we will work to try and assist him on those. \n Deputy Peter Roche  I think all of us would have specific cases. Obviously, it would not be an avalanche by any manner of means, but we have people come to our constituency offices with those circumstances where they would be engaged full time in caring and their farm would be more of a financial burden than financially rewarding. They are doing the State a great service by providing care for their loved one.  The calculation, based on the number of acres and the numbers of livestock, sometimes prohibits them from gaining carer's allowance for their loved one. When I mentioned \"rigid\", that is what I am referencing. There is a perception, somehow or other, that if you have land and-or a small number of stock, the calculation is that you are doing all right and that you are outside of your means, but there needs to be greater flexibility with those instances that I am referencing. \n Deputy Dara Calleary  As I said in my main response, farm assist is a flexible payment as compared to, for instance, jobseeker's allowance, and there are better supports available to those on farm assist. That flexibility is built-in, as I said. Self-employed income, under jobseeker's allowance, is assessed at 100%. Under farm assist, that is 70%. Child disregards apply under farm assist which do not apply to jobseekers.  In relation to the home carer's scheme, we are trying to ensure that carers who look after people within the home - the family carers, be that in a home or on a farm - are also given support through pension and we have reduced a scheme in recent years to ensure that is done.  The means-testing measurement is there to ensure that we target resources at those who most need them and that those resources, which are scarce, go to the areas that need them most. If there are specific cases, we will engage with the Deputy on them. \n Deputy Peter Roche  I fully accept that cases have to be assessed and the criteria are strict. The cases that I mentioned, as I said, involve only a small of people who have come to my constituency office who would fall into that category where they are full time.  In fact, in order to come to the constituency office, they would sometimes have to get somebody to stand in and do the caring while they were absent from the house. That will tell the Minister the level of necessity there is and the requirement there would be for the Department and the Minister to be more compassionate in terms of the way we would deal with cases like that. ",
        "questionNumber": 96
      },
      "contextDate": "2025-09-25"
    },
    {
      "question": {
        "date": "2025-09-25",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29"
        },
        "showAs": " 139. Deputy Peter Roche asked the Minister for Social Protection if he will review the appeals process and criteria for carer's allowance and disability allowance, in light of cases where families providing full-time care have been refused supports despite clear evidence of need, particularly in rural areas where access to services is limited (details supplied); and if he will make a statement on the matter. [50809/25] ",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-25/writtens/mul@/dbsect_153.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-25/writtens/dbsect_153",
          "showAs": "Social Welfare Benefits",
          "debateSectionId": "dbsect_153"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-25/pq_139",
        "answerText": " Minister for Social Protection  The Carer’s Allowance is the main scheme by which my Department provides income support to carers in the community.  The primary objective of the Carer’s Allowance payment is to provide an income support to people whose earning capacity is substantially reduced because they cannot work full-time due to their caring responsibilities.  The principal conditions for receipt of Carer’s Allowance are that a means test is satisfied, and that full-time care and attention is required and being provided. Full-time care is set out in legislation as the provision of care for not less than 35 hours over a minimum of five days per week.  The provision of full-time care and attention requirement is moderated somewhat by allowing a carer to work or engage in education or training for up to 18.5 hours a week and still qualify for a payment. Effectively this is half a working week. During this time adequate provision must be made for the care of the relevant person.  When assessing an application for Carer’s Allowance, the Department must be satisfied that the carer meets the criteria as set out in legislation. This includes ensuring that care is being provided for not less than 35 hours per week and that the carer is not engaged in employment or self-employment for more than 18.5 hours. The same legislation applies to a claim being processed by the Department and a claim where the decision has been appealed to the Social Welfare Appeals Office.  When a Social Welfare Inspector is assessing a claim for Carer's Allowance from a farmer, they complete a Means Reporting Form and an IN93 form. The latter looks at the income and expenses on the farm. Where necessary, my Department refers to the Tegasc Farm Management Handbook, which provides guidance on how to calculate the standard labour requirements for the agricultural enterprise in question.  It is important to note that where a person disagrees with the Department’s calculation of labour hours, they can provide supporting evidence to challenge the assessment and any such information will be considered.  I trust this clarifies the issue for the Deputy. ",
        "questionNumber": 139
      },
      "contextDate": "2025-09-25"
    },
    {
      "question": {
        "date": "2025-09-25",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29"
        },
        "showAs": " 248. Deputy Peter Roche asked the Minister for Enterprise, Tourism and Employment his plans to support Irish SMEs affected by the 10% tariffs now being applied to most exports to the United States; whether targeted measures are being developed to help these firms diversify into new markets or offset the increased costs; and if he will make a statement on the matter. [37630/25] ",
        "to": {
          "roleType": null,
          "showAs": "Enterprise",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-25/writtens/mul@/dbsect_262.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-25/writtens/dbsect_262",
          "showAs": "Small and Medium Enterprises",
          "debateSectionId": "dbsect_262"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-25/pq_248",
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  The global trading environment has been evolving rapidly over the last number of years. Geopolitical tensions, shifting regulatory environments and supply chain disruptions are reshaping how and where we do business. The introduction of the EU-US tariffs presents notable challenges for many Irish businesses exporting to the US market.? Irish exporters are a vital economic pillar in towns and communities around the country. As has consistently been pointed out, international trade is critically important to the vitality of Irish businesses – both the market diversification and the market resilience agendas are central to the long-term prosperity and success of our enterprise base.  The Government’s Action Plan on Market Diversification, sets out a path to assist and support Ireland’s businesses, large and small, to adapt to this new environment by striking out into new and diverse markets and deepening their engagement in existing markets. The Action Plan on Market Diversification has a series of initiatives designed to deepen and expand existing market relationships where possible, identify and cultivate new market opportunities, deepen agency support for companies seeking to diversify their export markets and promote and protect market access for Irish goods.  My Department through Enterprise Ireland is actively supporting indigenous SMEs to adapt to the impact of US tariffs and future trade disruptions through a combination of strategic engagement and targeted supports. The agency is working directly with affected companies to assess risks and develop mitigation strategies, supported by its teams in Ireland and across seven US offices. Two new financial supports have been introduced: the Market Research Grant (up to €35,000) to help companies assess tariff impacts and develop pricing and supply chain strategies, and the New Markets Validation Grant (up to €150,000) to support market entry planning. These measures are part of a broader response that includes access to expert advice, strategic consultancy, and market diversification initiatives through Enterprise Ireland’s global network. ",
        "questionNumber": 248
      },
      "contextDate": "2025-09-25"
    },
    {
      "question": {
        "date": "2025-09-23",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29"
        },
        "showAs": " 27. Deputy Peter Roche asked the Minister for Children, Disability and Equality the CDNTs with the longest average waiting times for first contact commencement of therapy; the actions being taken to address these geographic inequities, particularly for children in rural and under-served areas; whether targeted measures such as mobile clinics, cross-team redeployment, or temporary therapy panels are being implemented to ensure parity of access nationally; and if she will make a statement on the matter. [50221/25] ",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/mul@/dbsect_49.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/dbsect_49",
          "showAs": "Disability Services",
          "debateSectionId": "dbsect_49"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-23/pq_27",
        "answerText": " Minister for Children, Disability and Equality  This Government and I recognise the importance of early intervention for children with disabilities and ensuring they receive the right services at the right time.  Under the Programme for Government, the Government is committed to ensuring children and their families who need early intervention and therapy input can access that support in a timely way.  The key vehicle for change and improvement is the Roadmap for Service Improvement for Disability Services for Children and Young People. The implementation of this roadmap is well under way and will continue until 2026.  The Roadmap contains an important set of actions that, collectively, will enhance children’s disability services in Ireland.  They include significant measures to integrate and improve access to services, expand the workforce and advance better communication and engagement with families.  There are 93 Children’s Disability Network Teams aligned to 96 Community Healthcare Networks across the country, are providing services and supports for children aged from birth to 18 years of age.  I am informed by the HSE that areas including Dublin and the Mid West region have challenges with higher numbers of children on the Children's Disability Network Teams waiting list.  The HSE also inform me that data on the longest average waiting times for first commencement of therapy with specific Children's Disability Network Teams is not available.  Children’s Disability Network Teams currently provide services and supports for nearly 45,000 children with complex needs.  Unfortunately, there are also almost 11,000 children waiting for an initial contact from a Children's Disability Network Team.  A significant focus of the Government is filling vacant posts within the 93 Children's Disability Network Teams.  HSE data from April 2025 shows there has been a nationwide increase of 26% in Children's Disability Network Team staffing levels since October 2023.  Most significantly, the Children's Disability Network Teams national vacancy rate has reduced from 29% in 2023 to 18% in 2025 - a reduction of 11 percentage points.  The HSE have put in place strategies and supports in place for urgent cases on the waiting list, such as 1,052 children (and/or their parents) who are on the CDNT waiting list participated in one or more individual and/or group intervention appointments during August 2025.  A dedicated Disability Workforce Strategy is being developed in 2025 to meet growing service demands and address recruitment and retention challenges across specialist disability services.  The HSE are facilitating direct access for funded agencies to existing health and social care professional panels, which will shorten the recruitment process.  My Department is working with the HSE to seek to introduce specific recruitment and retention incentives for therapists to work in Children's Disability Network Teams.  Where necessary and possible, cross cover or temporary redeployment to address operational gaps, optimise risk mitigation and ensure equitable service delivery across the area is in place. This can be challenging to implement, increasing staff burnout and challenging retention.  My Department continues to work with the HSE to examine all avenues to improve access to services through the Roadmap and will continue to consider opportunities for innovative practice. ",
        "questionNumber": 27
      },
      "contextDate": "2025-09-23"
    },
    {
      "question": {
        "date": "2025-09-23",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29"
        },
        "showAs": " 41. Deputy Peter Roche asked the Minister for Children, Disability and Equality the steps being taken to ensure that early childhood care and education providers are adequately resourced and supported to fully include children with additional needs; if additional funding, staff training, and inclusion supports are being provided to meet the commitments set out in the Joint Oireachtas Committee's 2024 report; and if she will make a statement on the matter. [50192/25] ",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/mul@/dbsect_64.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/dbsect_64",
          "showAs": "Early Childhood Care and Education",
          "debateSectionId": "dbsect_64"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-23/pq_41",
        "answerText": " Minister for Children, Disability and Equality  The Access and Inclusion Model (AIM) was introduced in 2016 to ensure that children with additional needs or a disability could access and meaningfully participate in the Early Childhood Care and Education or ECCE programme. Since its introduction, AIM has had a major impact on the lives of children with disabilities and the overall quality of early learning and care. To date, over 35,000 children have received more than 80,000 targeted supports across over 4,800 early learning and care services nationwide.  The 2025 budget allocation for the AIM is €80.861m which was an increase of 41% from the previous 2024 budget. This funding provides a suite of universal and targeted supports across 7 levels. Universal supports are designed to create a more inclusive culture in early learning and care settings, through training courses and qualifications for staff. Where universal supports are not enough to meet the needs of an individual child, targeted supports are available including equipment, therapeutic supports and the facilitation of a lower ratio of children to staff in pre-school rooms or funding for an extra staff member as a shared resource, where a child with additional needs is present.  Access to AIM is based on the needs of the individual child, in the context of the pre-school setting, and does not require a diagnosis.  In line with a commitment in First 5: A Whole-of-Government Strategy for Babies, Young Children and their Families 2019-2028, an independent evaluation of AIM was undertaken in order to inform an extension of AIM beyond the Early Childhood Care and Education (ECCE) programme as well as any potential enhancements to the model.  AIM has now expanded beyond time spent in the ECCE programme, allowing children to access AIM targeted supports for an additional 3 hours a day during the ECCE term and 6 hours outside of the ECCE term.  It is intended that over time, all children with disabilities registered in early learning and childcare services will have access to supports under AIM. To this end, a tailored model is under design which would enable the extension of AIM to children under three. It is also intended to give consideration at a later date to an extension of AIM for children attending school-age childcare. Both extensions will require a redesign of AIM to ensure that it meets the different needs of children in these two separate cohorts and will also require funding through the annual Budget process.  All providers are strongly encouraged to be inclusive and to welcome all children who apply for places in their service. Services should ensure equal access for all children and should not undertake any action that could adversely affect the ability of any child to access and meaningfully participate in the ECCE programme. Parents struggling to secure a place should contact their local City or County Childcare Committee for advice and support.  The Department has committed to review the guidance on inclusion policies to ensure there is adequate support and recognition for priority target groups; provide guidance on admissions policies, and explore the possible introduction of regulatory requirements for ELC and SAC services to have an inclusive admissions policy. The Department will continue to support and encourage services to ensure their services are open and inclusive. ",
        "questionNumber": 41
      },
      "contextDate": "2025-09-23"
    },
    {
      "question": {
        "date": "2025-09-18",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29"
        },
        "showAs": " 163. Deputy Peter Roche asked the Minister for Climate, Energy and the Environment the breakdown of the €27 million funding announced for the acceleration of the circular economy transition, by county; and the timeline for when these funds will issue. [49370/25] ",
        "to": {
          "roleType": null,
          "showAs": "Climate",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-18/writtens/mul@/dbsect_150.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-18/writtens/dbsect_150",
          "showAs": "Departmental Funding",
          "debateSectionId": "dbsect_150"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-18/pq_163",
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  The Circular Economy Fund operates on an annual basis, with the €27million allocated for 2025 activities only. The Fund utilises revenues from environmental levies to provide financial support to the initiatives as prescribed for under Section 8 (9) of the Circular Economy and Miscellaneous Provisions Act, 2022.  Since the funding announcement earlier this year, successful recipients of 2025 funds have already availed of funding and will continue to drawdown funds until year end.  While the allocation of funding is currently only available in aggregate form, funds have been provided to support a range of important circular national initiatives this year including the Circular Economy Innovation Grant Scheme, EPA Circular Economy Programme, Anti-Dumping Initiative, Irish Environmental Network and Food Circle project. In addition, funds have been allocated to support the introduction of designated waste collection systems for textiles and hazardous waste.  More information on the initiatives supported by the Fund can be found in the annual www.gov.ie/en/department-of-climate-energy-and-the-environment/publications/circular-economy-fund-accounts/, audited by the Comptroller and Auditor General (C&AG). It should be noted the audit of the 2024 accounts has yet to be finalised as the audit of accounts are typically carried out by the C&AG in the final quarter of the subsequent year. ",
        "questionNumber": 163
      },
      "contextDate": "2025-09-18"
    },
    {
      "question": {
        "date": "2025-09-18",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29"
        },
        "showAs": " 168. Deputy Peter Roche asked the Tánaiste and Minister for Defence the type of ancillary benefits available to members of the Defence Forces, such as healthcare; if there are any plans to expand these benefits; and if he will make a statement on the matter. [49368/25] ",
        "to": {
          "roleType": null,
          "showAs": "Defence",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-18/writtens/mul@/dbsect_155.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-18/writtens/dbsect_155",
          "showAs": "Defence Forces",
          "debateSectionId": "dbsect_155"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-18/pq_168",
        "answerText": " Tánaiste and Minister for Defence  In relation to healthcare, a wide range of medical services are provided to members of the Permanent Defence Force. These include an annual medical examination, sick parades, attendance at GP surgery outside of sick parade and out-of-hours GP services, prescription services, laboratory services, physiotherapy, chiropody, radiology, ophthalmic examinations, in-patient and outpatient public hospital charges, routine dental treatment and the provision of overseas medical services, including global comprehensive medical insurance in the case of Defence Forces personnel (including dependents) assigned to longer term overseas administrative posts.  Additionally, private medical care (i.e. private consultant appointments, diagnostic tests and semi-private hospital treatment) has been made available to all ranks since September 2023, following on from a Programme for Government commitment and a recommendation of the Commission on the Defence Forces.  Medical mental health services available to personnel include access to clinical psychology and psychiatry services. The psychology service assesses, diagnoses, treats and advises on strategies to prevent mental health disorders, and there are currently two Clinical Psychologists employed by the Defence Forces. Psychiatry services specialise in the assessment, diagnosis and treatment of mental illness. There is currently one dedicated civilian consultant psychiatrist engaged by the Defence Forces.  In addition to these clinical supports, non-medical mental health services are provided by the Defence Forces Personnel Support Service (PSS) and my Department funds a confidential counselling, referral and support service, available on a 24/7 basis 365 days a year, for serving members of the Defence Forces, civilian employees and Civil Defence volunteers.  In addition to the above, members of the Permanent Defence Force may avail of a range of allowances and pension entitlements, as well as extensive opportunities for lifelong learning which are provided to all personnel throughout their careers and include access to specialist and third-level education. In this regard, the organisation has a number of collaborative partners across the Further and Higher Education sector, including the South East Technological University, Maynooth University, Munster Technological University and SOLAS.  It is also notable that the provisions of the Working Time Directive have been applied across the Defence Forces, subject to certain exemptions, since January of this year and that there have been increases to the maximum ages of recruitment and retirement respectively. In addition, there has been significant progress on pay and allowances, including a doubling of the patrol duty allowance and an extension of the Naval Service Tax Credit for a further five years.  I am satisfied that the range of benefits outlined above offer comprehensive supports to members of the Defence Forces. I can assure the Deputy that we continue to keep such supports under review. ",
        "questionNumber": 168
      },
      "contextDate": "2025-09-18"
    },
    {
      "question": {
        "date": "2025-09-18",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29"
        },
        "showAs": " 169. Deputy Peter Roche asked the Tánaiste and Minister for Defence if steps have been taken to address the shortage of people and facilities for the training of pilots in the Air Corps. [49369/25] ",
        "to": {
          "roleType": null,
          "showAs": "Defence",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-18/writtens/mul@/dbsect_156.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-18/writtens/dbsect_156",
          "showAs": "Air Corps",
          "debateSectionId": "dbsect_156"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-18/pq_169",
        "answerText": " Tánaiste and Minister for Defence  Recruitment and retention of specialist personnel in the Defence Forces personnel is a challenge, which I have acknowledged on a number of occasions. However, considerable progress has been made to address potential barriers to recruitment and retention. A number of financial and non-financial retention initiatives are being implemented including an increase in the mandatory retirement a to 62, increase in the maximum recruitment age to 39, and the extension of the provision of private secondary healthcare to all members of the PDF. These measures have been taken in addition to significant progress on pay.  Additional measures are being taken to streamline the recruitment process and further work is being progressed to provide the capacity within the organisation to accept greater numbers at induction. Initial indications, are positive, particularly in the context of the number of expressions of interest received to join the Defence Forces.  The provision of professional training and instruction in the Defence Forces is essential in the context of recruitment and retention. Defence Forces instructors provide the necessary ongoing professional training of Defence Forces personnel and are instrumental in delivering a future focused modern Defence Forces organisation. Instructors must possess advanced education, specialist expertise and substantial experience. The introduction of an appropriate payment, to incentivise qualified officers, who upskill to meet modern training standards, recognises both the important role undertaken by instructing Officers and rewards the higher level of professionalisation that is now expected. Commissioned Officer Instructors who successfully achieve the newly formulated Professionalised Instructor Programme qualification and undertake full-time instructor posts at specific Defence Forces institutions may be eligible for a weekly inducement while serving in such instructor posts.  Additional external support has been put in place which has resulted in an increased level of serviceability for the fleet and increased pilot training capacity, resulting in much faster progression to operational units.  I have approved the introduction of a new Service Commitment scheme aimed at ATC personnel and extended the Service Commitment Scheme available for pilots. A contract with an external service provider to provide Flight Information Service Officer (FISO) services at the Aerodrome has recently been put in place. The contract will assist the Air Traffic Control Service in returning to full operational flight activities on a 24 hour 7 day a week basis.  In addition to the cohort of experienced pilots, the Air Corps has a very strong pipeline of trainee pilots. I am satisfied that the measures taken enables the Air Corps to provide trainee pilots with the required training. ",
        "questionNumber": 169
      },
      "contextDate": "2025-09-18"
    },
    {
      "contextDate": "2025-07-10",
      "question": {
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-10/writtens/mul@/dbsect_58.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-10/writtens/dbsect_58",
          "showAs": "Diaspora Issues",
          "debateSectionId": "dbsect_58"
        },
        "questionType": "written",
        "questionNumber": 25,
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign",
          "roleType": null
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche",
          "memberCode": "Peter-Roche.D.2024-11-29"
        },
        "showAs": " 25. Deputy Peter Roche asked the Tánaiste and Minister for Foreign Affairs and Trade his plans to increase support for Irish diaspora organisations in countries where current funding levels are relatively low despite active community engagement; if targeted funding increases are being considered for such regions; and if he will make a statement on the matter. [37629/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-10/pq_25",
        "answerText": " Minister of State at the Department of Foreign Affairs and Trade  The Government is committed to deepening our ties with our diaspora to ensure our relationship with our global Irish communities is a dynamic one that meets their needs and can also adapt to evolving circumstances.  Central to our approach is the Emigrant Support Programme (ESP), which provides grants to organisations in the voluntary sector who work with our most vulnerable citizens overseas. The Programme also supports projects that nurture our cultural heritage, promote vibrant networks among the Irish abroad and provide advice for emigrants who wish to return to Ireland.  By the end of this year, the ESP will have has granted over €265 million in support of more than 850 organisations in 51 countries.  In 2024, the ESP provided grant funding to projects in 36 countries worldwide. Beyond the support provided to traditional large Irish communities across Britain, the United States of America, Canada, and Australia, ESP allocated funding support to 78 projects around the world. This ranged from the Greek-Irish Society in Athens to the Mashonaland Irish Association in Zimbabwe. In addition, the Department supported for Irish Studies programmes in Mexico, Argentina and Brazil among others.  This year the Department will allocate almost €16.5 million in support of diaspora engagement. Organisations will be informed of the outcome of the grant round later this month.  As part of my engagements on the new diaspora strategy, I am keen to hear from as many voices as possible across our diaspora including those in others from less traditional diaspora locations. I have already met with communities in Nairobi and Brussels and will be in the Middle East in September. ",
        "date": "2025-07-10"
      }
    },
    {
      "contextDate": "2025-07-08",
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-08/pq_144",
        "house": {
          "chamberType": "house",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "showAs": "34th Dáil"
        },
        "questionNumber": 144,
        "date": "2025-07-08",
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science (Deputy James Lawless)  I am very much aware that the rising cost of living continues to impact students and their families.  The Government, through successive budgets, has sought to reduce the cost of higher education, through once-off measures and through long term improvements to the student grant scheme.  Over the past three years once-off cost of living measures has included:  • Reduction to the student contribution fee by €1,000;  • Increase to the postgraduate fee contribution grant from €4,000 to €5,000;  • Additional funding to the Student Assistance Fund.  More long-term measures have also been implemented over recent Budgets which include:-  • Increases to student maintenance grants;  • Increases to all income thresholds, including the special rate of grant;  • Reduction in the distance criteria for the non-adjacent rate of grant;  • A new student contribution grant of €500 for income thresholds up to €100k, which has been increased for the 2025/26 academic year to €115k;  • Change to the eligibility criteria for second chance mature students;  • Increases in the deduction allowable for student earnings outside of term time;  • Restoration of maintenance grants for postgraduate students; and  • Introduction of a new part-time fee grant scheme in September 2024.  CSO data outlines that the 3-year average growth in inflation is 5.4%. Maintenance grant rates remained static up to and including the 2021/22 academic year. From there on, the maintenance grant rates have increased from between 28% (Non-adjacent Special Rate) and 121% (Non-adjacent Band 4). The following table outlines the increases in each of the maintenance rates.      Maintenance Rate Description      2012/13 to 2021/22      2022/23 Academic Year      2023/24 Academic Year      2024/25 Academic Year      % Increase from 2012/13 to 2024/25       Non Adjacent Special Rate    €5915    €6115    €6971    €7586    28%      Adjacent Special Rate    €2375    €2575    €2936    €3230    36%      Non Adjacent Band 1    €3025    €3225    €3677    €4292    42%      Adjacent Band 1    €1215    €1415    €1613    €1774    46%      Non Adjacent Band 2    €2270    €2470    €2717    €3332    47%      Adjacent Band 2    €910    €1110    €1221    €1343    48%      Non Adjacent Band 3    €1515    €1715    €1887    €2502    65%      Adjacent Band 3    €605    €805    €886    €975    61%      Non Adjacent Band 4    €755    €955    €1051    €1666    121%      Adjacent Band 4    €305    €505    €556    €612    101%     From September, 2025, all income thresholds under the Student Grant Scheme will increase. The income threshold for the special rate of maintenance is increasing in line with Social Welfare and all other income thresholds are increasing by at least 15%.  Following these recent revisions, the income threshold to receive a Student Contribution grant now stands at €115,000 which is the highest it has ever been. This means that undergraduate students who were not eligible previously may now qualify for a Student Contribution Grant.  The measures to increase the income thresholds is primarily with a view to recognising the increase in income growth over the last number of years and the effect that this has had on student supports and the number of students eligible to receive a student grant.  This Government is committed to reducing the cost of college for families and we have already made significant strides in that regard.  To support decision-making, ahead of Budget 2026, I will publish an options paper, which will identify costs and potential impacts of various policy options aimed at reducing the cost of higher education.  The options assessment is intended to identify costs and potential impacts by the Department and is published without prejudice to eventual Government decisions. ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "debateSection": {
          "showAs": "Grant Payments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-08/writtens/dbsect_77",
          "debateSectionId": "dbsect_77",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-08/writtens/mul@/dbsect_77.xml"
            },
            "pdf": null
          }
        },
        "showAs": " 144. Deputy Peter Roche asked the Minister for Further and Higher Education, Research, Innovation and Science if the increases in SUSI grants have kept pace with the cost-of-living increases in the past three years; and if he will make a statement on the matter. [37405/25] ",
        "questionType": "written",
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche"
        }
      }
    },
    {
      "contextDate": "2025-07-08",
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-08/pq_163",
        "house": {
          "chamberType": "house",
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "showAs": "34th Dáil"
        },
        "questionNumber": 163,
        "date": "2025-07-08",
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  Government has demonstrated a strong and sustained commitment to apprenticeships. Since the formation of Department of Further and Higher Education Innovation Research and Science, and the publication of the Action Plan for Apprenticeship 2021-2025, investment in apprenticeship training has increased by 85%, from €184 million in 2020 to €339 million in 2025  This investment has supported a 33% growth in the number of apprenticeship programmes available from 58 to 77. There are now 25 craft apprenticeship programmes supporting Government priorities on Housing for All, and 52 consortia-led programmes designed to serve industry needs across multiple sectors such as construction, ICT, hospitality, health, and social care - supporting Ireland both economically and socially.  In 2024 four new apprenticeships were launched in the private and public sectors: a Level 8 in Advanced Manufacturing Engineering, a Level 6 Civil Service Digital Marketing programme, a Level 9 public sector Social Work programme, and a Level 9 Software Solutions programme.  The development of new apprenticeships follows a structured 10-step process overseen by the National Apprenticeship Office. These programmes are proposed by industry-led groups, backed by solid evidence of significant skills needs and practical employer engagement.  Expanding apprenticeship courses offers a fast-track route to employment, providing valuable qualifications, including in professions that were previously accessible only through university.  This \"earn while you learn\" model in emerging skills areas enhances both affordability and accessibility, particularly for a diverse learner population. The growing number of programmes highlights the increasing popularity of apprenticeships as a pathway to training and qualification through employment.  Work is ongoing to expand our offerings further, with new programmes in development in areas such as planning, beauty, business, and robotics. Expanding and modernising the apprenticeship system is a priority for my Department, as we strive to equip Ireland’s workforce for a future shaped by demographic shifts and the twin green and digital transitions. ",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "debateSection": {
          "showAs": "Apprenticeship Programmes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-08/writtens/dbsect_95",
          "debateSectionId": "dbsect_95",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-08/writtens/mul@/dbsect_95.xml"
            },
            "pdf": null
          }
        },
        "showAs": " 163. Deputy Peter Roche asked the Minister for Further and Higher Education, Research, Innovation and Science the progress of the expansion of apprenticeships since the publication of the action plan on apprenticeships; and if he will make a statement on the matter. [37404/25] ",
        "questionType": "written",
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche"
        }
      }
    },
    {
      "question": {
        "questionNumber": 45,
        "showAs": " 45. Deputy Peter Roche asked the Minister for Transport the current status of the proposed greenway planned to run through Kinvara, County Galway; if he will provide an update on the timeline for its development expected completion; and if he will make a statement on the matter. [36472/25] ",
        "by": {
          "memberCode": "Peter-Roche.D.2024-11-29",
          "showAs": "Peter Roche",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29"
        },
        "date": "2025-07-02",
        "questionType": "written",
        "debateSection": {
          "showAs": "Greenways Provision",
          "debateSectionId": "dbsect_110",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-02/writtens/mul@/dbsect_110.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-02/writtens/dbsect_110"
        },
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to Greenways. There is a significant amount of investment for Greenway schemes in County Galway with €3,500,000 allocated in 2025.  In line with Section 32 (2) of the Roads Act 1993, the planning, design, and construction of individual Greenways is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. Investment in Greenway and National Roads Active Travel projects is also subject to the requirements of the Infrastructure Guidelines and necessary statutory approvals.  Noting the above position, I have referred your question, on this occasion, to TII for a direct reply. Please advise my private office if you do not receive a reply within 10 working days. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-02/pq_45",
        "to": {
          "showAs": "Transport",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-07-02"
    },
    {
      "contextDate": "2025-06-26",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-26/writtens/mul@/dbsect_85.xml"
            }
          },
          "debateSectionId": "dbsect_85",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-06-26/writtens/dbsect_85",
          "showAs": "Mental Health Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-06-26/pq_50",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 50,
        "showAs": " 50. Deputy Peter Roche asked the Minister for Health if her Department currently has an action plan in place to develop a framework for responding to patients presenting with a mental health crisis at accident and emergency departments; and if she will make a statement on the matter. [34538/25] ",
        "answerText": " Minister of State at the Department of Health (Deputy Mary Butler)  It is widely accepted that Emergency Departments are an inappropriate environment for people in a mental health crisis, and that alternative care pathways and therapeutic environments should be developed. People experiencing mental health distress and illness often find busy Emergency Departments the wrong setting for their needs and evidence indicates this is often the reason some people leave before meeting a clinician.  Supporting the development of real alternatives to Emergency Departments is a priority for Government: the Department of Health and the HSE continue to work to expand alternative care pathways and therapeutic environments for people presenting to Emergency Departments in mental health crisis, and to prioritise securing additional funding to continue their expansion. The Government remains firmly committed to enhancing all aspects of mental health services. The total allocation for mental health services is just under €1.5 billion for 2025.  Supports have been put in place so people presenting to Emergency Departments (EDs) receive a compassionate response, as well as a therapeutic assessment and intervention from a suitably trained mental health professional. This programme is delivered in all 26 adult Emergency Departments that are operating 24/7 and in one paediatric hospital.  The Model of Care for Self-Harm and Suicide Related Ideation was updated in 2022 and incorporates the Suicide Crisis Assessment Nurse (SCAN) service, which provides a critically important safety net for people in suicidal crisis. The ambition of the new Sharing the Vision Implementation Plan (2025-2027), published on 9th April 2025, is to expand these services to provide full coverage nationwide. The SCAN service provides a timely response to requests for assessment of patients in suicidal crisis from GPs, and the assessments often take place in primary care settings. In addition, Budget 2025 provided funding for a further six SCAN nurses, and work is ongoing to ensure full access to the service across the country.  The model of care for the service envisages a dedicated mental health assessment room within hospitals to provide a more appropriate environment for assessments to take place. Given most acute mental health in-patient units are co-located with our acute hospital network, it is important that people in distress are assessed in clinically appropriate environments when they present for support.  Over the course of the second implementation plan for Sharing the Vision, a new National Clinical Programme for Self-Harm and Suicide Related Ideation will be published and will include a scaling up of the Suicide Crisis Assessment Nurse service. To support this continuous service improvement, an online data capture tool will provide valuable insights into population needs, service user experiences and the effectiveness of the service.  The policy also commits to providing an alternative to Emergency Departments for people in a mental health crisis. The Emergency Department is not an appropriate environment for supporting people in acute mental health distress, and work is ongoing to shift supports for those in crisis away from hospitals and into services in our communities.  The development of the new model of care for Crisis Resolution Services has been delivered, which has two components:  1) Crisis Resolution Teams: teams of mental health professionals who work out of hours to meet people in a crisis and provide rapid assessment and intensive intervention. There are six pilot Crisis Resolution Teams currently operational in Sligo/Leitrim, Cork city (two teams), Waterford City and County, South Dublin/Wicklow and Limerick.  2) Crisis Cafés: a welcoming, non-clinical safe environment in the style of a café where people can go at evenings and weekends. These are known as 'Solace' cafés, and a number are now open in different locations.  The model of care for Crisis Resolution Services was developed as a direct recommendation of Sharing the Vision (Recommendation 24). It recognises that people who are experiencing a mental health crisis need specialist services to provide timely brief intensive supports to keep people safe. Work is ongoing with the HSE to speed up the expansion of these services for people in a mental health crisis.  In addition, the Child & Youth Mental Health Office published a 3-year action plan in February of this year which commits to developing an Integrated Crisis Response Pathway for children and young people experiencing a mental health crisis across the 24/7 continuum of care, including an improved child and youth liaison service with Emergency Departments.  Limerick City also has a pilot project known as the Community Access Support Team (CAST), a partnership between An Garda Síochana and the HSE to establish an appropriate co-response approach to calls relating to mental health and situational trauma. The CAST team are working to enhance diversionary practices for those experiencing crisis and situational trauma that leads to mental health difficulties, with the shared goal of providing a compassionate and effective response to people in distress and improving their experience and outcomes.  My ambition to expand the range of alternative care pathways for people in suicidal and self-harm crisis is demonstrated in the range of services being developed. I will continue to work closely with the HSE and the Department of Health to ensure that there are real alternatives to Emergency Departments and more appropriate treatment environments for people in mental health distress. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail"
        },
        "date": "2025-06-26",
        "by": {
          "showAs": "Peter Roche",
          "memberCode": "Peter-Roche.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Peter-Roche.D.2024-11-29"
        }
      }
    }
  ]
}