{
  "head": {
    "counts": {
      "questionCount": 901,
      "resultCount": 901
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 372. Deputy Conor D. McGuinness asked the Minister for Health if the PCRS is instructing pharmacists participating in the free HRT to investigate their patients' sex assigned at birth where they suspect it differs from the gender on their medical records; if so, the legal basis on which this is done; and if she will make a statement on the matter. [72622/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_328",
          "debateSectionId": "dbsect_328",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_328.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_372",
        "questionNumber": 372
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 1 to 15, inclusive, together.  The Cabinet committee on housing last met yesterday, Monday, 15 December. The committee works to ensure a cross-Government approach to the implementation of our commitments regarding housing policy. This week’s meeting was specifically focused on our homelessness challenge, in particular the national housing plan commitments in this regard, including the development of a homeless prevention framework and a child and family homelessness action plan.  We are making good progress on the delivery of homes to those most in need across the country, with the new housing plan committed to delivering 72,000 social homes over its lifetime. However, as we increase supply, we also recognise that those experiencing, or at risk of, homelessness have a wide and complex variety of needs. We need to ensure that the appropriate services and policies are in place to support them. Housing is our single biggest issue as a country, with profound social and economic consequences. That is why it is at the centre of the Government’s focus.  Along with the largest ever commitment on social housing, the new national housing plan commits to delivering 300,000 new homes, including 90,000 affordable supports to help people who are struggling to have a home of their own. The plan sets out the highest ever commitment of State funding for housing, with €28 billion over the next five years, coupled with additional funding through State vehicles, including the Land Development Agency, the Housing Finance Agency, Home Building Finance Ireland, the First Home Scheme and the Irish Strategic Investment Fund. Housing delivery, along with infrastructure and utility investment to enable delivery at scale, is at the core of the agreed national development plan published in July, and, at €275 billion, the largest ever capital injection in the history of the State.  To build homes at the scale now required, we need improved and more resilient water, energy and transport services. We will see large-scale investment in all of these areas over the coming years. Last month under price review 6, the investment plan for energy infrastructure was finalised, including funding allocations of up to €18 billion to ESB and EirGrid, leveraged by the Government injection of €3.5 billion in equity to these companies. This will enable thousands more homes to be connected to the grid.  We have also published the investment plan for water, which sets out over €12 billion investment in our water infrastructure, the majority of which will support the delivery of our housing targets. In addition, we are tackling barriers to delivery, through the accelerating infrastructure report and action plan, which includes reforms which will support public and private sector delivery of homes at scale.  Housing is at the centre of the State’s investment and focus for the coming years. However, to meet our targets, we will also need significant delivery from the private sector and we have implemented a number of measures and reforms in support of this. We have focused on making apartment delivery more financially viable, reformed our planning process and created a stable policy environment to enable the private sector to deliver at scale.  We are seeing indications now that our measures are beginning to take effect, evidenced by CSO data showing that we have had an increase of almost 30% in homes approved for planning in quarter 3 of this year, in comparison with the same time period last year, with the number of apartments approved up by over 50%. These are clear indications of confidence. Work is under way to zone a significantly higher quantum of land across the country. Now is the time for ambitious execution, and we have set out a clear framework and roadmap for the coming years to do this. I am confident that we can build on our success to date and bring about a very significant scale-up in our delivery of housing over the lifetime of this Government. \n Deputy Séamus McGrath  I thank the Taoiseach. I welcome today's announcement in relation to the vacant property refurbishment grant and the extension of this grant until 2030. This provides important certainty from a policy point of view in relation to vacant properties. We know they are still a very significant challenge. I also welcome the new initiative in relation to the above the shop grant. Up to €140,000, where multiple properties are involved, is potentially available. That is very significant and the fact that it will be available by quarter 1 of the new year is very important. It is important to look at the local authorities and their resourcing in terms of being able to deal with this grant. I ask the Taoiseach to also look at that. We want these grants to be processed in a timely manner so that we can get on with utilising this currently under-occupied space. The resourcing of local authorities is important and I ask the Taoiseach to look at that. \n Deputy Paul McAuliffe  In my constituency between Shanowen Road and Collins Avenue there are proposals to build new apartment developments. While the additional new housing is incredibly welcome, unfortunately the under-utilised industrial estate there is currently occupied by Santry Boxing Club. Would the Taoiseach agree as well as powering ahead with the provision of new housing, Dublin City Council needs to have a more proactive strategy of making land available to sports clubs so they can avail of programmes like the sports capital grant? Santry Boxing Club is an amazing local facility and will be a great facility for those new homes that will be built. As well as enabling new homes, we need to put in place new facilities, and Dublin City Council needs to be more proactive in making land available to sports clubs. \n Deputy Shane Moynihan  As the Taoiseach said, the delivery of housing is the number one priority for this Government. That is why it is strategically important that all sectors of the Government support that aim, namely through the national development plan's transport sectoral plan, which was published recently. In my constituency, which the Taoiseach visited, we see it as one of the fastest-growing constituencies in the country, with large developments like Adamstown and Clonburris flying ahead. In its county development plans, South Dublin County Council is setting very ambitious targets for zoning. The key to enabling this zoning and to enabling delivery of those homes is the deployment and development of DART+ South West as a transport programme, to intensify the capacity on that line, not only benefitting commuters in Dublin Mid-West but also Kildare North, Dublin South-Central and Dublin-Central.  I am asking the Taoiseach for his support to do all we can to prioritise and bring forward, where possible, the delivery of Dart+ South West as a long overdue infrastructure requirement to not only allow catch-up on public transport in my area but also to plan for the future. \n Deputy John Connolly  One of the actions in the recently published housing plan is that the Department will be publishing quarterly and annual performance tables for new-build output versus targets per local authority, thereby ensuring transparency and accountability.  I understand that will commence next June in relation to social housing. We should also provide similar tables in relation to affordable housing. The local authorities should also be assessed on their output of affordable housing. What actions will the Government take with local authorities that are not meeting their housing targets? \n Deputy Ryan O'Meara  Last February the Government announced its intention to remove the requirement for planning permission for log cabins and modular homes in backyard developments. By the end of the Christmas recess, it will be nearly a year since we heard that announcement. One-off houses in rural Ireland can benefit if we allow log cabins and modular homes to be built not just in backyard developments. They are also one of the few affordable houses out there for young people in rural Ireland whom I speak to. I could give numerous examples of log cabins and modular homes across north Tipperary and north-west Kilkenny that are at threat of enforcement proceedings because they do not have planning permission. Enforcement should not be ongoing until we know what these regulations say. In addition, the development contributions for one-off rural houses should be scrapped again. They are simply a privilege for building on your own land. First, will we see these planning regulations that will exempt log cabins? Second, will this go beyond backyard developments and allow them in rural areas? Third, when will we see the regulations? \n An Ceann Comhairle  I call Deputy Ruth Coppinger. One question. \n Deputy Ruth Coppinger  I also send my solidarity to the Jewish community in Sydney following the appalling attack.  I am sure the Taoiseach agrees with me that cities should be liveable and should have culture as well as venues where people can meet, socialise and enjoy themselves. Will the Cabinet committee on housing and local government discuss the issue of The Complex, a very important cultural space in our capital where artists are currently housed but have been given an eviction notice for the middle of January? A protest on this will come to the Dáil tomorrow. I have attended meetings and other get-togethers in The Complex. In fact, it was the venue for the launch of one of the presidential campaigns. Dublin City Council is open to buying The Complex but only if it can be given 80% to 90% of the funding. We need to intervene to buy this for €10 million. It would be €80 million to buy or to build a similar space. \n Deputy Rose Conway-Walsh  I ask the Taoiseach to consider issuing an upfront fund to local authorities, but to Mayo County Council in particular, in order that they can turn around the vacant properties they have without having to go through the bureaucratic nightmare of applying for funding from central government on a house-by-house, unit-by-unit basis. Can the Taoiseach imagine what it is like to be a homeless person in Mayo watching council houses remain empty month after month while nothing is done? I will give him an example from a young mother in my constituency:  I am homeless, living in a friend's house. I've just had my first baby. She's now a month old. She was born at 36 weeks. I've been in and out of hospital the whole of the pregnancy with stress and anxiety. I developed diabetes also. I was rushed to a Dublin hospital for a week from bleeding and pains. I had a terrible experience. A lot of this stress has been brought on because of my homeless situation.  That is the case for many people. \n Deputy Barry Heneghan  I too join in the condolences on the attack that happened on the Jewish community in Australia.  I also support the plea for funding for The Complex.  Regarding the Cabinet committee on housing, across the country AHBs have signed turnkey deals that then collapse. In Dún Laoghaire-Rathdown, there was a recent scheme that had the contract signed, everything was above board, they were all ready and, at the last minute, when they were looking for funding, the Department denied the funding for 40 turnkey units. If we are to bring medium-sized and small developers into the market, this risk cannot be acceptable. We will not get the funding from the funding schemes, and it is putting all the risk on the developers. The homes are built, the deal collapses and the investor walks away. We want these small-scale developers to meet the housing targets. I have hundreds of people in my constituency looking for affordable housing, and this cannot happen. \n Deputy Darren O'Rourke  I want to raise the issue of child homelessness. In October there were 5,274 children in emergency accommodation. More than 150 of those were in my county, Meath. There is an expectation that at Christmas there will be more than 5,000 and that almost 1,000 of those will be in emergency accommodation for their second or third Christmas. Are there specific measures the Government will take in advance of Christmas, now a handful of days away, to minimise the number of children in homelessness this Christmas? \n Deputy Ruairí Ó Murchú  We all know the issue that exists in relation to housing, whether it is homelessness, the lack of supply, those who cannot get houses, whether from a rental point of view or a purchase point of view, and those languishing on social housing lists. However, we also have to look at the issue of estate management. I do not believe the local authorities, like Louth County Council, have the necessary powers when dealing with chaotic tenants. They may need supports, but even beyond that, we have seen outright criminality and drug-dealing. We know that AHBs have greater levels of power even in relation to the nuclear action of eviction. That should be the last thing that is looked at but, at the end of the day, it is a requirement. I have worked alongside the Louth local authority, the Garda and others in dealing with some situations and we have attempted to move people sideways to deal with the issue. Some very good work has been done, but we do not have the necessary tools, and that is the problem. \n Deputy Liam Quaide  One of the most infuriating parts of the housing crisis is the tens of thousands of properties that have been left idle and decaying throughout the country. Youghal's potential to be on a par with Kinsale for economic prosperity and tourism has been thwarted by the epic scale of dereliction that has been allowed to take place there over many years. Likewise, Castlemartyr and Midleton have many prime-location properties left like deserted husks where boutiques could be flourishing or community hubs or accommodation created. In Holland or Germany this would not be tolerated. Landlords would have to sell up or repurpose a vacant property within a reasonable period or face losing it. The Government's softly-softly approach to vacancy and dereliction is clearly not working, and our towns and villages are haunted by this policy failure. We need to see swift direct action by our local authorities with landlords who blight our streets with decaying properties and a much more urgent pursuit of derelict site levies. The collection of derelict site levies by Revenue is welcome, but why is the Government waiting until 2027 to implement this? \n Deputy Peadar Tóibín  The housing crisis has had varied and wide ramifications in Irish society. One of them is a serious fall in the fertility rate in this State. There has been a 30% fall in the number of births annually. There has been a 20,000 fall in the number of births annually since Celtic tiger times. Some 69% of people aged 25 years or under are living with their parents. Well over 40% of adults who are under 30 are living with their parents. That is changing the very nature of Irish society. The ability for adults to form relationships to have children is being deleted for hundreds of thousands of people. This is having massive ramifications. Schools are now noticing that there is a fall in the number of children being enrolled. An unbalanced demographic structure has serious consequences for our workforce and our pensions. Planning, permitting, licensing, tendering and judicial reviews here are among the slowest in the whole of the European Union. While the Taoiseach's Government has announced plans, they are not ambitious enough and I do not believe they will be implemented in a timely fashion. \n The Taoiseach  There were quite a number of questions there, beginning with Deputy Séamus McGrath. I welcome also the good initiative we have announced today, namely the extension of the vacant refurbishment grant to 2030, but specifically on the commercial properties and the €140,000 plus a €5,000 grant for assistance to support the owner to design a project. The Deputy is right in saying that we need to make sure that the local authorities prioritise this - in other words, that they put a project manager or whatever in charge of this operation in the towns and the cities to make this a reality. It needs to be driven with someone who is accountable and who is doing this every single day, in my view. I will talk to the Minister about that.  We need to alert all the business committees in towns and cities because people need to know. If you combine it with the living city initiative, there are real prospects of, once and for all, getting activity in towns and city centres to address dereliction and allow for change of use. Due to changing patterns of trade and so on, many commercial uses are no longer sustainable, so there is an opportunity for increased numbers residential units in towns and cities.  Deputy McAuliffe raised the topic of the Santry Boxing Club. I was recently with the Land Development Agency, LDA, on the southside, where an existing boxing club has been incorporated into a housing development. A new boxing club is being built in the housing development. That is the way to go. Is the local authority involved in the specific development to which the Deputy referred? It is. The local authority should look seriously at that example. Amenities matter in communities and society. They give young people opportunities. It seems to me that some accommodation must be made for Santry Boxing Club. The other example was a good initiative. The name of the boxing club escapes me now, but the people will have a first-class boxing club as a result of the development. It might be a bigger development. In fairness to the LDA, it saw that needed to be done. The Deputy might give me the details.  Deputy Shane Moynihan spoke about the interdependence of the national transport plan in terms of infrastructure and housing delivery. Housing delivery will depend on infrastructure delivery. I am acutely aware of planning considerations. South Dublin County Council is looking at 10,000 to 18,000 new zonings for housing. That will be dependent on DART+ South West. I have had meetings with the Minister for public expenditure and the Minister for climate and transport, Deputy Darragh O'Brien, to ensure we can underpin the development of DART+ South West. We can make progress on that to give the certainty that the council, Deputy Moynihan and the people in the area require.  Deputy Connolly asked about quarterly tables for social housing. He asked about applying such an approach to affordable housing. I will talk to the Minister. It is a fair point. The councils control a bit more for social housing, but outputs should be across the board. The first issue is to highlight those councils that are not performing. It becomes fairly obvious in a league table scenario which councils are not performing. The actions can take a number of forms. We have to work through the actions. There could be disincentives or limited finance. We have to work through that, but there must be consequences or direct action from the State to override councils that are not performing in respect of housing more generally.  Deputy O'Meara spoke about log cabins and modular homes. I hope that the Minister will in February have a list of exempted developments. I understand it has expanded significantly. There have been a lot of submissions from Government Departments and agencies, particularly those with acute issues, including health, for example, where we need urgent public services. The Minister recently indicated to me that it would be February that we will have completion of that. It is fairly complex and much bigger than we originally anticipated.  The rural housing guidelines need to be published. I have asked the Minister to prioritise that. I fully accept what the Deputy is saying about the potential for enabling and helping young people in rural Ireland to afford housing at a reasonable cost when it comes to buying or renting. We will keep an eye on that. We will look at the development levies over time in respect of rural buildings on people's land although services of one kind or another are required.  I fundamentally agree with Deputy Coppinger that cities should be liveable and that there should be strong social support and creative cultural amenities. The Deputy said the local authority is depending on someone else. Other local authorities tend to get on with it and are in a position to facilitate either the acquisition or purchase of a building without having to do the simple equation and getting the Department to pay out for every single acquisition. The Minister for public expenditure has taken an interest in this issue. I will check the current lie of the land in respect of the Complex. I know Deputy Heneghan also raised that issue.  To Deputy Conway-Walsh, I say that there is no reason why voids should take so long. There has to be some framework of control for the Department. We discovered recently with the tenant in situ scheme that houses were being bought with people living in them. Those houses are bought by councils and suddenly there is €80,000 or €100,000 going into the house. The original objective of that was to stop people going into homelessness. When a local authority house becomes vacant, unless there is something majorly wrong structurally, it should be occupied within a month. We have given huge money to local authorities for voids over the past five years. They should get on with it. They let the houses lie idle for too long. It is inexcusable. In some councils, there is inertia. I have seen it. People leave very good houses for one reason or another, the shutters go up and the houses are left there for three or four months. Those houses should be reoccupied once the electrics and everything else are grand. If we have to get around to repairing them, we can at least give someone the house. That is my view. I get impatient about it from time to time, to be honest. I hear what the Deputy is saying. If you give an upfront grant, there is no guarantee it will be spent on voids, and that is the problem.  I do not have the details of the 40-turnkey units to which Deputy Heneghan referred. Are they in Dún Laoghaire? \n Deputy Barry Heneghan  Yes. \n The Taoiseach  Has the Deputy moved across? \n Deputy Barry Heneghan  I am national now. \n The Taoiseach  The Deputy has a wide compass. He is national now. I ask him to give me the details and I will follow through. It should not happen. I do not know the background to that.  I appreciate the Deputy's comments about the Jewish community in Ireland and the impact that what happened in Bondi Beach has had on the Jewish community globally and in Ireland. The murder that took place was quite shocking. Others were injured. The Deputy also referenced the Complex.  Deputy O'Rourke spoke about child homelessness. The meeting of the Cabinet subcommittee on housing yesterday was entirely about different aspects of homelessness. We had good presentation of data. The data illustrates that there is a wide variety of reason why people become homeless. There are different factors. There is a high rate for singles in homelessness as well as children. There are different elements to the issue. An increasing amount of those who leave direct provision end up homeless. Family reunification comes with that. The link between migration and housing has grown, but is not the only factor. Family separation is a factor. Different factors give rise to homelessness, and specifically child homelessness. The Minister has specific measures. He achieved €100 million in the budget to acquire social housing and housing more generally to take more families out of emergency accommodation and get them into either local authority houses or acquired homes. There is a specific programme ahead now.  Have I dealt with everyone? I have not. \n An Ceann Comhairle  Deputies Ó Murchú and Tóibín. \n The Taoiseach  How could I forget Deputy Ó Murchú? He spoke about estate management powers to deal with what he described as \"chaotic tenants\". There are powers. I am not sure that the AHBs have different powers. They just have a different way of operating. \n Deputy Ruairí Ó Murchú  It is about eviction. \n The Taoiseach  They have a different of operating. They lay it down from the beginning. \n Deputy Ruairí Ó Murchú  It is easier for them to evict people. \n The Taoiseach  Local authorities have struggled with this for quite a long time. My own belief is that persistent misbehaviour and so on should mean you lose the tenancy. That is what should happen. It is hard. We know of housing estates that have awful tensions, difficulties and challenges. I would be glad to work with the Deputy on the issue. I will talk to the Minister about it.  Deputy Quaide spoke about the thousands of houses that have been left lying idle. We give responsibilities to the local authorities. Deputy Connolly talked about league tables. There is a league table showing which local authorities did what in respect of derelict sites. It is very telling. There are two or three that did an exceptional job. If they can do it, why cannot others? It begs the question of whether there is, or has been historically, inertia in local authorities about the Derelict Sites Act. Revenue will now be charged with it. That will bring about a change and better behaviour. The reason for the length of time, and I hope it can be accelerated, is the mapping. I have challenged officials from the Department of Finance and Revenue about this issue. I have asked why the maps are not there already and why they would take so long. Apparently, at the time of the land tax and others, the mapping was not as comprehensive as people would have expected.  That is the issue there. I think it is a game-changer and will be a game-changer.  Deputy Tóibín is making a link between falling fertility and the housing issue. Again, there are a number of variables, I imagine, responsible for that. The bottom line is we do need to provide more housing more quickly to as many young people as possible. It is a social need. Every young person in the country has a right to aspire to owning a home, and many do aspire to owning a home, or some young families being able to rent a home at an affordable cost. We are building substantially more houses than we did five years ago. We are doing about 30,000 odd now compared to 20,000 in 2020. We need to go to 50,000 and we need all hands on deck in that respect. I do not think enrolments are going down in schools yet, I think they are going up. \n Deputy Peadar Tóibín  They are; 30 schools are falling this year. And childcare. ",
        "questionType": "oral",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 12. Deputy Conor D. McGuinness asked the Taoiseach when the Cabinet committee on housing will meet next. [69836/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/dbsect_11",
          "debateSectionId": "dbsect_11",
          "showAs": "Cabinet Committees",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/mul@/dbsect_11.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_12",
        "questionNumber": 12
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  As Minister of State at the Department of Transport with special responsibility for Rural Transport, I have responsibility for policy and overall funding in relation to rural public transport service provision; however, I am not involved in the day-to-day operations.  The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally, including implementation of the Connecting Ireland Rural Mobility Plan. Post Budget discussions around allocating funding for the Public Service Obligation programme are ongoing, as is regular engagement between the NTA and the Transport Coordination Units on resourcing requirements.  In light of the NTA responsibilities I have referred your question to the NTA for direct reply to you. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 287. Deputy Conor D. McGuinness asked the Minister for Transport the reason funding applications for Local Link DRT services are not being processed at present; and if he will make a statement on the matter. [71862/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_203",
          "debateSectionId": "dbsect_203",
          "showAs": "Bus Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_203.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_287",
        "questionNumber": 287
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  As Minister of State at the Department of Transport with special responsibility for Rural Transport, I have responsibility for policy and overall funding in relation to rural public transport service provision; however, I am not involved in the day-to-day operations.  The National Transport Authority (NTA), via the 15 Transport Coordination Units operating under the \"TFI Local Link brand\" nationwide, has statutory responsibility for securing the provision of public passenger transport services nationally. In light of the NTA responsibilities I have referred your question to the NTA for direct reply to you. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 288. Deputy Conor D. McGuinness asked the Minister for Transport the number of funding applications for Local Link DRT services waiting to be processed; and if he will make a statement on the matter. [71863/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_204",
          "debateSectionId": "dbsect_204",
          "showAs": "Bus Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_204.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_288",
        "questionNumber": 288
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  As Minister of State at the Department of Transport with special responsibility for Rural Transport, I have responsibility for policy and overall funding in relation to rural public transport service provision; however, I am not involved in the day-to-day operations.  The National Transport Authority (NTA), via the 15 Transport Coordination Units operating under the \"TFI Local Link brand\" nationwide, has statutory responsibility for securing the provision of public passenger transport services nationally. In light of the NTA responsibilities I have referred your question to the NTA for direct reply to you. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 289. Deputy Conor D. McGuinness asked the Minister for Transport when a specific funding application for a Local Link DRT service (details supplied) will be processed; and if an update could be provided; and if he will make a statement on the matter. [71864/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_205",
          "debateSectionId": "dbsect_205",
          "showAs": "Bus Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_205.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_289",
        "questionNumber": 289
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Under the Central Bank of Ireland’s Consumer Protection Code, a regulated entity must retain details of individual transactions for six years after the date on which the particular transaction is discontinued or completed. A regulated entity must retain all other records for six years from the date on which the regulated entity ceased to provide any product or service to the consumer concerned.  The six-year requirement is a minimum retention period required by Central Bank regulation, not a maximum retention period. How regulated entities deal with retention of records after the period has elapsed may be impacted by other regulatory requirements such as the General Data Protection Regulation, anti-money laundering considerations and banks' internal policies. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 359. Deputy Conor D. McGuinness asked the Tánaiste and Minister for Finance the maximum amount of time that bank statements are typically retained by commercial banks; to confirm the way in which commercial banks deal with bank statements after that period of time has elapsed; and if he will make a statement on the matter. [71411/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_259",
          "debateSectionId": "dbsect_259",
          "showAs": "Banking Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_259.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_359",
        "questionNumber": 359
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  Section 39 of the Electoral Act 1992, as amended, provides that where a vacancy occurs in the Dáil the Ceann Comhairle, as soon as she is directed by the Dáil to do so, directs the Clerk of the Dáil to issue a writ directing the relevant returning officer to hold an election to fill the vacancy. Where, within 6 months of a vacancy arising, the Dáil has not so directed the Ceann Comhairle, she shall, as soon as practicable at the end of the 6 month period, direct the Clerk to issue the writ.    Section 96 of the Electoral Act 1992 provides that a poll shall be taken on such day as shall be appointed by the Minister, by order, being a day which (disregarding any excluded day – Sunday, Good Friday, Public holiday) is not earlier than the 18th day or not later than the 25th day next following the day on which the writ for the by-election is issued.    To date, the Clerk of the Dáil has not issued a writ to the returning officer of either Dáil constituency in which there is currently a vacancy. When a writ is issued I will make an order appointing the day on which and the hours during which the poll will be taken at the by-election. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 602. Deputy Conor D. McGuinness asked the Minister for Housing, Local Government and Heritage when he will announce the polling day of the Galway west and Dublin central by-elections. [72224/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_474",
          "debateSectionId": "dbsect_474",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_474.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_602",
        "questionNumber": 602
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  Tógfaidh mé Ceisteanna Uimh. 1179 agus 1180 le chéile.  Ba mhaith liom ceisteanna 71577/25 agus 71574/25 a thógáil le chéile. Mar pholasaí ginearálta, ní chuireann mo Roinn comhairle dlí atá faighte aice amach sa bhfearann poiblí.Chríochnaigh an Bille um Údarás na Gaeltachta (Leasú) 2024 Céim an Choiste i nDáil Éireann níos túisce i mbliana. Cé gurb é athbhunú toghcháin chuig bord an Údaráis príomhchuspóir an Bhille seo, ar mhaithe le tacú le soláthar títhíochta sa Ghaeltacht ann, déanfar leasú sa Bhille ar Alt 8 den Acht um Údarás na Gaeltachta, 1979, chun cead a thabhairt don Údarás talamh a dhíol le comhlacht tithíochta ceadaithe nó le húdarás tithíochta nó a dhiúscairt ar shlí eile chuig an gcéanna, chun tithíocht a sholáthar sa Ghaeltacht. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 1180. D'fhiafraigh Deputy Conor D. McGuinness den Aire Forbartha Tuaithe agus Pobail, agus Gaeltachta an bhfuil comhairle dlí iarrtha aige nó ag a Roinn maidir leis an gcumhacht atá ag Údarás na Gaeltachta, faoi Acht na Gaeltachta, 2012, faoina bhféadfaí suíomhanna talún atá ag Údarás na Gaeltachta a úsáid ar mhaithe le tithíocht a chur ar fáil do chainteoirí Gaeilge sa Ghaeltacht agus, má tá comhairle dlí faighte; agus an ndéanfaidh sé ráiteas ina thaobh. [71577/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_994",
          "debateSectionId": "dbsect_994",
          "showAs": "Údarás na Gaeltachta",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_994.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1180",
        "questionNumber": 1180
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Arboreal maintenance work at An Rinn Garda Station in 2021 (resulting in €9,363.75 expenditure) required the mobilisation of specialised machinery and crews to carry out, in a controlled and safe manner, the following works;  On the western side of the property, a row of 14 number mature Spruce & Leylandii were growing in close proximity to the main road. The Tree's were over-mature and shedding branches.  The Arborist recommended that the trees along the road be felled to eliminate the risk of falling branches and debris. These works were carried out in line with the Arborist's recommendations.  To the North of the property, an over mature Poplar was growing adjacent to, and overhanging, an adjoining shed. The Tree was over-mature and prone to wind-throw in high winds, so it was removed.  The Eastern side of the property is populated with mature Pine that were deemed safe, with no further work required.  A traffic management plan was required, to facilitate the tree felling and pruning that was conducted. The 'stop - go' traffic management plan was concentrated primarily along the Western boundary for the duration of the works.   ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 51. Deputy Conor D. McGuinness asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation to report on the way in which in 2021 arboreal maintenance, costing the taxpayer €9,363.75, was spent by the Office of Public Works at a location (details supplied). [70825/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_92",
          "debateSectionId": "dbsect_92",
          "showAs": "Office of Public Works",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_92.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_51",
        "questionNumber": 51
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for students with special educational needs.  Local special educational needs organisers (SENOs) are available to offer advice, support and guidance as required to ensure students with special educational needs are supported to achieve their full potential. A list of SENOs , their contact details and the areas they cover is available on the NCSE website.  As the matter raised relates to a NCSE process. I will arrange for your query to be forwarded to the NCSE for their attention and direct reply.  Deputies are also welcome to raise such matters with the NCSE directly through their dedicated Oireachtas query line at oireachtasqueries@ncse.ie.  The NCSE in-school support service is also available to schools to offer further guidance and support.  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 164. Deputy Conor D. McGuinness asked the Minister for Education and Youth if she has responded to correspondence sent by the principal of a school (details supplied). [70820/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_188",
          "debateSectionId": "dbsect_188",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_188.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_164",
        "questionNumber": 164
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I can confirm to the Deputy that the school in question initially submitted an application under the department’s Additional School Accommodation Scheme (ASA) in 2018. An assessment deemed that the site was restricted and that additional lands were required to deliver this accommodation, and this application was withdrawn by the school authority.  A request to purchase additional lands was submitted by the school in 2021 and the acquisition of a 2.765 acres site adjacent to the school was completed at the end of May 2025.  In late 2024 the school in question submitted a revised ASA application for additional accommodation to meet their future needs.  The Department's approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. A strong focus will be on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. The provision of required school places, including for children with special educational needs, is a priority for my department.  A decision will be made in relation to the school's application for additional accommodation shortly in the context of overall programme management. This decision will take account of overall school place needs, including for children with special education needs, and in cognisance of demographic projections, capacity across schools in the area, and the extent to which schools are prioritising local school place needs. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 184. Deputy Conor D. McGuinness asked the Minister for Education and Youth for an update on the progress of the new classrooms for a school (details supplied). [70819/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_209",
          "debateSectionId": "dbsect_209",
          "showAs": "School Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_209.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_184",
        "questionNumber": 184
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 12 to 28, inclusive, together.  The Cabinet committee on infrastructure last met on 3 November and will meet again early in the new year. The Cabinet committee works to drive infrastructure delivery and the implementation of the revised national development plan. As Members know, last week, we brought to Government the essence of that plan. The reform of the delivery of critical, growth-enhancing infrastructure is a key commitment in the programme for Government. Last week marked a major milestone on this agenda with the publication of the accelerating infrastructure report and action plan.  This plan sets out 30 high-impact and time-bound reforms to speed and scale up delivery of homes, roads, public transport, wastewater plants and energy infrastructure. Actions include legislative reforms to balance individual rights and public good, simplify regulation and consenting systems, cut administrative burden and red tape and build public acceptance and a delivery culture. The reforms align with broader housing, climate and competitiveness goals. These will be achieved by streamlining approvals to allow concurrent processing, introducing statutory timelines for major project decisions, rationalising delivery guidance to reduce duplication and complexity, enhancing procurement practices through clearer project pipelines, and fostering a delivery-focused culture that balances safeguards with urgency.  We are at a critical juncture. We have a strong economy and growing population, but our infrastructure delivery is too slow. We have a once-in-a-generation opportunity to transform this. The Government, private sector and communities must align behind delivery. The plan is underscored by the largest capital investment in the history of the State, with over €275 billion planned over the coming ten years.  Over recent weeks, Departments have published their ambitious sectoral investment plans for the next five years. Areas such as energy, transport and water will see a significant scale-up in funding and delivery, all of which will support us to address our infrastructure deficit and scale up housing. There will also be robust oversight of the Government’s performance in achieving these actions with regular reports on progress to the Cabinet committee on infrastructure. In the period ahead, the Cabinet committee will, therefore, oversee both the investments and reforms required to ensure that infrastructure is delivered as efficiently and quickly as possible. \n An Ceann Comhairle  There are 12 Deputies present. They will have 30 seconds each, which means there will be six minutes for questions and six minutes for a response. That is as fair as I can be. \n Deputy Aindrias Moynihan  The recently published national development plan update sets out an ambitious plan for key infrastructure for the years ahead. Many of the capital works are due to get under way by 2030 and others thereafter. Having a pipeline of projects ready is vital because there is so much background work involved with them. I am particularly focused on the ones after 2030. We have seen how the N22 Macroom bypass took many years to advance through the earlier stages, such as the background works, planning and design and so on. The next phase of that road is the piece between Macroom and Ballincollig. It needs to continue in the background and get through the various background stages so that we have a pipeline of projects ready to roll as soon as possible. \n Deputy Ruairí Ó Murchú  We have all seen a huge amount of flood damage and the danger of nature. While a huge amount of work has been done by local authorities and emergency services, this brings to light the need to deal expeditiously with CFRAM protections that are necessary throughout Louth. With regard to the south part of the Dundalk and Blackrock project, the promise is quarter 2 of 2027 for planning application submission. There have been promises and we have been waiting years. \n The Taoiseach  Is that CFRAM? \n Deputy Ruairí Ó Murchú  It is CFRAM. There are five particular projects throughout Louth, in Drogheda, Carlingford, Greenore, Baltray and Ardee. The lack of wastewater capacity is also causing issues. \n Deputy Albert Dolan  We need to double-track the rail line from Galway city to Athenry. The passing loop at Oranmore is under construction now. Ceannt Station is moving to be a station with five platforms. Huge investment has gone in but we must continue it because we are going to wait years for the Galway city outer bypass and the reality is that rail is the lever we can pull. We can build a double track from Athenry to Galway city which would greatly improve the quality of life for all commuters in east Galway. \n Deputy Darren O'Rourke  We need updated wind and solar farm guidelines. The wind farm guidelines are in draft form since 2019 and the last full version was in 2006. There is a commitment in the programme for Government for solar farm guidelines but recent responses say they are at a very early stage of a scoping process. When will they be ready? \n Deputy Paul Murphy  The new roll-out of BusConnects routes has been a disaster in my constituency. Constituents report that buses on the F spine route, which were supposed to provide a more direct route to the city centre and greater connectivity, are taking 20 to 30 minutes longer to get into town and providing fewer options for people trying to get to work or school. It is made worse by the frequent delays and cancellations seen across nearly all routes in Dublin South-West, including the S and W spines operated by Go-Ahead Ireland. Elsewhere, the NTA has been forced to change routes in Finglas and Chapelizod due to protests and people making their voices heard. Will the NTA do the same here or will people be forced to protest? \n Deputy Séamus McGrath  Central to a good infrastructure system is a good public transport system. I welcome the approval of BusConnects Cork by Cabinet to proceed to the planning phase. That is very welcome but we cannot wait years for improvements to the local bus service. I am sure the Taoiseach, like other public representatives in Cork, is inundated with unreliability issues relating to local bus services, such as buses not turning up, disappearing buses and inaccurate information on the travel app. It is simply not good enough and it has been going on for years. People are tired of excuses from the National Transport Authority and Bus Éireann. I ask the Taoiseach to please take this issue up and look for immediate improvements. \n Deputy Tony McCormack  While we prioritise electricity, water and transport, digital connectivity must now be treated equally. It is essential for Ireland's competitiveness. Europe has fallen behind the US and China. 5G stand-alone is under 2% in the EU and 0% in Ireland, compared with 20% in the US and 80% in China. AI, ehealth and advanced manufacturing cannot run on yesterday’s networks. If we want future investment in next-generation technology, connectivity must be prioritised. Will the Cabinet committee on infrastructure evaluate 5G stand-alone as a national priority? During Ireland's EU Presidency, will the Government push for strong, pro-investment digital policy under the digital networks Act? \n Deputy Peadar Tóibín  The Navan to Dublin rail line is not included in the national development plan review as a project that will start to be built before 2030. It has no start date for construction at all at the moment. It is up to a future government to fund the construction of a Navan to Dublin rail line. No money has been assigned or ring-fenced for that particular project, despite the fact there are 90,000 people commuting from Meath at the moment, 60,000 of whom travel by car and add to the M50 crisis. The M50 is currently grinding to a halt. If the Government wants to help fix the M50 crisis, allow people in Meath to use public transport to get to work without pushing them into cars every single day. \n Deputy Paul Lawless  Ireland faces an emergency crisis in terms of infrastructure, housing, energy and water. According to the ESRI, an additional 40,000 construction workers will be needed for the housing plan and an additional 40,000 will be needed for infrastructure. That is 80,000 construction workers who are required to meet the Government’s plan. Indeed, the Dublin metro will require 8,000 construction workers. What is the Taoiseach’s plan in order to achieve this? I speak to construction workers in Australia all the time. They want to come home but they are simply totally disenfranchised and disengaged. The Government has no interest in bringing them home. \n Deputy Rose Conway-Walsh  I know the Taoiseach will agree that the people in Mayo deserve to have proper road infrastructure. I want to specifically talk to him about the R312, which is the main road connecting Erris to the county town of Castlebar. I want it to be designated a regional strategic road because that is the only way it will get the funding it needs. It is a dangerous road. People have put up with it for years but it is time for it to be fixed. \n The Taoiseach  Which one is that? \n Deputy Rose Conway-Walsh  It is the R312. I thank the Taoiseach. \n Deputy Barry Heneghan  Ba mhaith liom ceist a chur ar an Taoiseach faoin flooding we saw in Clontarf yesterday. I thank the Minister of State, Deputy Boxer Moran, for coming down and sorting out the dreaded sandbags, but households and businesses were very worried yesterday. I had tens of people----- \n The Taoiseach  Where was that? \n Deputy Barry Heneghan  Clontarf. Does the Taoiseach not know I am a Clontarf man? The flood defence is critically needed. Will flood defences be included in critical infrastructure with the recent announcement last week? This needs to be fast-tracked and people and businesses need assurance. \n An Ceann Comhairle  Finally, Deputy Conor D. McGuinness. \n Deputy Conor D. McGuinness  Once again, I am raising with the Taoiseach the N25, which is the transport spine of Waterford's infrastructure and long regarded as the most dangerous national road in the State. There has been no funding for safety improvements. Routine maintenance, resurfacing and line painting are not good enough at this stage. Bus stops are being withdrawn. There was another HGV incident this morning just outside Dungarvan. We need to see serious investment in safety improvements on the N25 right from Rosslare to Cork city, but particularly in Waterford where there has been no funding for safety improvements. \n An Ceann Comhairle  Taoiseach, the floor is yours for five minutes. \n The Taoiseach  I love the demarcation lines. The \"Rosslare to Cork city, but particularly in Waterford\" part of it. I am sorry. I get it. Do not worry. \n Deputy Conor D. McGuinness  There have been no safety upgrades. There was a serious incident there this morning. \n The Taoiseach  It is just an observation. I will start with Deputy Aindrias Moynihan, who made a very good point. Hopefully, with this national development plan and the allocation of ten years, we will avoid this stop-start where we get a project from A to B but C is not provided for at all. We had that over the last two decades, I suppose. I recall how the Cork-Limerick road had planning in an earlier era and then that was all shelved after the financial crash and so on. If they had kept the planning going, they would have been in a much better position now to actually start. I do accept that, and particularly on the N22. The Macroom bypass has been extremely effective but there is the problem that you go along a great road into Ballincollig if you are coming from the Kerry side but then you are suddenly into what, as the Deputy was saying to me the other day, is like a parking lot for the next 20 to 40 minutes. It is a very good point that we should encourage Transport Infrastructure Ireland, TII, and others to keep thinking of the next stage and to have the planning ready and preparatory work done. I will work on that particular stretch the Deputy has referenced.  Deputy Ó Murchú raised the flood damage, CFRAM and the five projects in Louth. Deputy Barry Heneghan had a similar point. In general, flood protection schemes take a long time. Some of that is due to stakeholder engagement and public engagement, and there can be objections and so on. If any projects are of such imperative, these are. We do know that when these projects happen, they are effective in protecting against flooding. Towns that had historical flooding events have stopped them because of good infrastructure being put in. These projects invite a lot of objections. We had it in Cork city and it went the whole way to the top courts. It is only now that work is under way and all of that. There was flooding in Cork city this week. It was there because of the tidal levels, but one could argue that if you had the protections in, then businesses and people would have been protected and people could have gone in and out of town. I am very conscious of that.  With regard to Deputy Dolan's question, I will come back to the Minister. It was a good point. I do no know where we are on it in terms of the national development plan but there is no question that Galway city is facing enormous congestion, including all the areas feeding into Galway city. It is a real problem. Public transport, including rail, does give us an option, but not the whole option. We have to get the ring road done. Equally, though, the rail infrastructure is critical. I will talk to the Minister for Transport, Darragh O'Brien, about that.  Deputy O'Rourke raised the issue of the updated wind farm guidelines. The Deputy is correct that they have been a long time coming and technology has changed in the intervening period. I have asked the Minister, James Browne, to accelerate the work on the guidelines. The unit in his Department is also working on planning exemptions. There is a lot of work there. The Department is also working on rural guidelines for housing and one-off housing. There is a lot of work in that Department but I accept that we do need to bring this to a conclusion. At some stage, we need some collective debate on energy. We are all dealing with individual cases of objections to solar, objections to gas generation, objections to wind onshore, and objections to wind offshore potentially. We desperately need the offshore wind. This is something we have got to progress through planning. I am hoping we can get wind farms built, certainly through 2030 to 2031. If we do not, then we are in trouble from an energy perspective. As a collective - when I say \"collective\", I mean the entire Oireachtas - we have to try to stand back and say that there are huge challenges. We discussed security earlier. We are very dependent on the importation of fossil fuels through the interconnectors. There are real issues here that we need to be clear-eyed about. We can then take decisions once everybody realises that there are pluses and minuses in all of this.  Deputy Paul Murphy raised BusConnects, which he said was a \"disaster\"----- \n Deputy Paul Murphy  Some of it. \n The Taoiseach  That is okay. It is a word that is not uncommon. Anyway, I have had my issues with BusConnects down through the years. There have been issues for habitual users of bus services who feel the changing of services or the reorientation of scheduling and so on has eroded what they would have had prior to it. Then we had all the issues around what were, in my view, over-the-top initial plans, which then got rolled back. This seems to have been a pattern throughout the BusConnects journey and I think lessons could be learned from that. A lot of heat built up that perhaps was not necessary in the first place because a lot of stuff that was proposed was then taken away. We will engage with the National Transport Authority, NTA, in terms of what is happening. It has made a lot of progress now on BusConnects. We need a good bus transport system.  That brings me to Deputy Séamus McGrath's point. Yes, I have heard similar reports in terms of reliability. Originally, a year and a half ago, the shortage of drivers was blamed, but we definitely need to improve reliability. There had been very good stuff happening in public transport growth and so on.  I will talk to Deputy McCormack again. The Deputy is absolutely correct that America, China and others are way ahead of us in some of this in the digital space. We need to catch up fairly quickly. I will look at the 5G stand-alone issue.  Deputy Tóibín mentioned the NDP. The Navan rail line is in the NDP review----- \n Deputy Peadar Tóibín  It is not a Bill. \n The Taoiseach  The Deputy has a great capacity. He is brilliant at it, actually. From a political agitation perspective, the Deputy has a great capacity to turn what others would see as success into defeat. For the Deputy in opposition to say that we are not releasing----- \n Deputy Peadar Tóibín  That----- \n An Ceann Comhairle  Do not interrupt. \n Deputy Peadar Tóibín  I have to, a Cheann Comhairle. \n An Ceann Comhairle  No, Deputy Tóibín, do not even dare. \n The Taoiseach  The Deputy is trying to ask how I can----- \n An Ceann Comhairle  Deputy Tóibín will have to look for it afterwards. \n The Taoiseach  I spoke to the Minister, Deputy O'Brien, about this and he is very clear that the Navan line is going ahead. \n Deputy Peadar Tóibín  There is no date for construction. \n An Ceann Comhairle  Do not even think about it. \n The Taoiseach  The Government is absolutely committed to it.  On Deputy Lawless's question, there is a huge increase in apprenticeships. We are recruiting people back. We are anxious for people to come back into the country, and people are coming back into the country. The construction industry is confident enough in terms of the numbers for getting the housing done, for example, and the huge retrofit programme that is going on as well.  I will talk and engage with the Minister in respect of Deputy Conway-Walsh's query on the R312.  Regarding Deputy Heneghan's question, I have discussed that in terms of Clontarf and flood relief generally. It will be part of critical infrastructure, absolutely. I see it as critical infrastructure because it is a big threat to us. The storms are worse and they are more severe. We need to accelerate the protection of people, households and businesses in that respect.  On the N25, we need to get the bypasses along that road. That is a section of the road that definitely needs improvement.  I thank the Ceann Comhairle. \n An Ceann Comhairle  I thank the Taoiseach and Members. For future reference, if there needs to be back and forth, this is not the forum in which to pose a question. \n Deputy Ruairí Ó Murchú  In the review----- \n An Ceann Comhairle  We have a Dáil reform committee today at which it will be discussed. \n The Taoiseach  We need a bit of entertainment and lively engagement, too. \n An Ceann Comhairle  This is not the forum, Taoiseach. ",
        "questionType": "oral",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 28. Deputy Conor D. McGuinness asked the Taoiseach when the Cabinet committee on infrastructure will next meet. [69835/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/debate/dbsect_15",
          "debateSectionId": "dbsect_15",
          "showAs": "Cabinet Committees",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/debate/mul@/dbsect_15.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_28",
        "questionNumber": 28
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade (Deputy Helen McEntee)  As noted in my response to Parliamentary Question No.145 of 4 December 2025, the main purpose of the Israeli Settlements in the Occupied Palestinian Territory (Prohibition of Importation of Goods) Bill will be to prohibit the importation of goods into the State from Israeli settlements in the Occupied Palestinian Territory. The General Scheme of the Bill was approved by the Government in fulfilment of the commitment in the Programme for Government to progress legislation prohibiting import of those goods.  As the legal framework in respect of trade in services differs from that in goods, there remains considerable legal uncertainty as to whether the inclusion of services in the Bill is permissible under EU law. For this reason the Tánaiste sought the advice of the Attorney General on the issue. The Deputy will understand that I cannot pre-empt the advice of the Attorney General. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 91. Deputy Conor D. McGuinness asked the Minister for Foreign Affairs and Trade further to Parliamentary Question No. 145 of 4 December 2025, the areas of legal uncertainty she is referring to as to whether the inclusion of services is permissible under EU law.  [70842/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_74",
          "debateSectionId": "dbsect_74",
          "showAs": "Middle East",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_74.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_91",
        "questionNumber": 91
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  High cost credit providers require authorisation from the Central Bank of Ireland under the Consumer Credit Act 1995.  The regulatory framework for high cost credit providers was strengthened by the Consumer Credit (Amendment) Act 2022. The 2022 Act introduced a statutory interest rate cap on high cost credit agreements and a maximum loan term of 52 weeks.  My Department continues to engage with the Central Bank of Ireland on the impact these reforms have had on the consumer and the high cost credit provider market.  Engaging in high cost credit lending without the appropriate licence is an offence under section 98 of the Consumer Credit Act 1995. The powers of An Garda Síochána in tackling illegal moneylending are provided for in sections 105 to 109 of the same Act.  All high cost credit providers authorised by the Central Bank of Ireland are listed on a Register on its website. Any suspected unregulated moneylending should be reported to the Central Bank of Ireland and An Garda Síochána. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 58. Deputy Conor D. McGuinness asked the Tánaiste and Minister for Finance his Department’s strategy to tackle unregulated loan-sharks and regulated high cost credit providers operating within the State. [57717/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_74",
          "debateSectionId": "dbsect_74",
          "showAs": "Financial Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_74.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_58",
        "questionNumber": 58
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 209, 210, 211 and 212 together.  The regulation of paramotoring in Ireland falls under the remit of the Irish Aviation Authority (IAA).  Paramotors pilots flying in Ireland are required to comply with the following regulations:  Aeronautical Notice A.112: • Pilots are required to register their aircraft in accordance with IAA Aeronautical Notice A.112 FLIGHT PERMIT FOR SINGLE SEAT AIRCRAFT  Aeronautical Notice P.35: • Pilots must be licensed to fly in accordance with IAA Aeronautical Notice P.35 NATIONAL LICENSING REQUIREMENTS FOR POWERED PARAGLIDER AIRCRAFT (PPG) and POWERED HANG-GLIDER AIRCRAFT (PHG)  IAA Aeronautical Notice P.21: • Pilots visiting from other jurisdictions must comply with the requirements of Aeronautical Notice P.21- Acceptance of Flight Crew Licenses.  Standardised European Rules of the Air, Regulation (EU) No 923/2012: • Minimum heights must be flown in accordance with Standardised European Rules of the Air, Regulation (EU) No 923/2012 as amended. In particular  • SERA.5005 (f) Except when necessary for take-off or landing, or except by permission from the competent authority, a VFR (Visual Flight Rules) flight shall not be flown:  (1) over the congested areas of cities, towns or settlements or over an open-air assembly of persons at a height less than 300 m (1 000 ft) above the highest obstacle within a radius of 600 m from the aircraft;  (2) elsewhere than as specified in (1), at a height less than 150 m (500 ft) above the ground or water, or 150 m (500 ft) above the highest obstacle within a radius of 150 m (500 ft) from the aircraft.  There are currently 41 powered paragliders registered with the IAA.  The reporting procedure to notify the IAA of an unlawful operation of a paramotor can be accessed on the IAA website at www.iaa.ie/safety/safety-reporting/general-aviation-occurrence-reporting ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 209. Deputy Conor D. McGuinness asked the Minister for Transport the laws, regulations and rules that apply to paramotors in Ireland; and if he will make a statement on the matter. [69476/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_199",
          "debateSectionId": "dbsect_199",
          "showAs": "Air Safety",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_199.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_209",
        "questionNumber": 209
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 209, 210, 211 and 212 together.  The regulation of paramotoring in Ireland falls under the remit of the Irish Aviation Authority (IAA).  Paramotors pilots flying in Ireland are required to comply with the following regulations:  Aeronautical Notice A.112: • Pilots are required to register their aircraft in accordance with IAA Aeronautical Notice A.112 FLIGHT PERMIT FOR SINGLE SEAT AIRCRAFT  Aeronautical Notice P.35: • Pilots must be licensed to fly in accordance with IAA Aeronautical Notice P.35 NATIONAL LICENSING REQUIREMENTS FOR POWERED PARAGLIDER AIRCRAFT (PPG) and POWERED HANG-GLIDER AIRCRAFT (PHG)  IAA Aeronautical Notice P.21: • Pilots visiting from other jurisdictions must comply with the requirements of Aeronautical Notice P.21- Acceptance of Flight Crew Licenses.  Standardised European Rules of the Air, Regulation (EU) No 923/2012: • Minimum heights must be flown in accordance with Standardised European Rules of the Air, Regulation (EU) No 923/2012 as amended. In particular  • SERA.5005 (f) Except when necessary for take-off or landing, or except by permission from the competent authority, a VFR (Visual Flight Rules) flight shall not be flown:  (1) over the congested areas of cities, towns or settlements or over an open-air assembly of persons at a height less than 300 m (1 000 ft) above the highest obstacle within a radius of 600 m from the aircraft;  (2) elsewhere than as specified in (1), at a height less than 150 m (500 ft) above the ground or water, or 150 m (500 ft) above the highest obstacle within a radius of 150 m (500 ft) from the aircraft.  There are currently 41 powered paragliders registered with the IAA.  The reporting procedure to notify the IAA of an unlawful operation of a paramotor can be accessed on the IAA website at www.iaa.ie/safety/safety-reporting/general-aviation-occurrence-reporting ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 210. Deputy Conor D. McGuinness asked the Minister for Transport if persons who operate a paramotor in Ireland require a licence; and if their aircraft must be registered; and if he will make a statement on the matter. [69477/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_199",
          "debateSectionId": "dbsect_199",
          "showAs": "Air Safety",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_199.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_210",
        "questionNumber": 210
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 209, 210, 211 and 212 together.  The regulation of paramotoring in Ireland falls under the remit of the Irish Aviation Authority (IAA).  Paramotors pilots flying in Ireland are required to comply with the following regulations:  Aeronautical Notice A.112: • Pilots are required to register their aircraft in accordance with IAA Aeronautical Notice A.112 FLIGHT PERMIT FOR SINGLE SEAT AIRCRAFT  Aeronautical Notice P.35: • Pilots must be licensed to fly in accordance with IAA Aeronautical Notice P.35 NATIONAL LICENSING REQUIREMENTS FOR POWERED PARAGLIDER AIRCRAFT (PPG) and POWERED HANG-GLIDER AIRCRAFT (PHG)  IAA Aeronautical Notice P.21: • Pilots visiting from other jurisdictions must comply with the requirements of Aeronautical Notice P.21- Acceptance of Flight Crew Licenses.  Standardised European Rules of the Air, Regulation (EU) No 923/2012: • Minimum heights must be flown in accordance with Standardised European Rules of the Air, Regulation (EU) No 923/2012 as amended. In particular  • SERA.5005 (f) Except when necessary for take-off or landing, or except by permission from the competent authority, a VFR (Visual Flight Rules) flight shall not be flown:  (1) over the congested areas of cities, towns or settlements or over an open-air assembly of persons at a height less than 300 m (1 000 ft) above the highest obstacle within a radius of 600 m from the aircraft;  (2) elsewhere than as specified in (1), at a height less than 150 m (500 ft) above the ground or water, or 150 m (500 ft) above the highest obstacle within a radius of 150 m (500 ft) from the aircraft.  There are currently 41 powered paragliders registered with the IAA.  The reporting procedure to notify the IAA of an unlawful operation of a paramotor can be accessed on the IAA website at www.iaa.ie/safety/safety-reporting/general-aviation-occurrence-reporting ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 211. Deputy Conor D. McGuinness asked the Minister for Transport the reporting procedure if a person is operating a paramotor unlawfully; and if he will make a statement on the matter. [69478/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_199",
          "debateSectionId": "dbsect_199",
          "showAs": "Air Safety",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_199.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_211",
        "questionNumber": 211
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 209, 210, 211 and 212 together.  The regulation of paramotoring in Ireland falls under the remit of the Irish Aviation Authority (IAA).  Paramotors pilots flying in Ireland are required to comply with the following regulations:  Aeronautical Notice A.112: • Pilots are required to register their aircraft in accordance with IAA Aeronautical Notice A.112 FLIGHT PERMIT FOR SINGLE SEAT AIRCRAFT  Aeronautical Notice P.35: • Pilots must be licensed to fly in accordance with IAA Aeronautical Notice P.35 NATIONAL LICENSING REQUIREMENTS FOR POWERED PARAGLIDER AIRCRAFT (PPG) and POWERED HANG-GLIDER AIRCRAFT (PHG)  IAA Aeronautical Notice P.21: • Pilots visiting from other jurisdictions must comply with the requirements of Aeronautical Notice P.21- Acceptance of Flight Crew Licenses.  Standardised European Rules of the Air, Regulation (EU) No 923/2012: • Minimum heights must be flown in accordance with Standardised European Rules of the Air, Regulation (EU) No 923/2012 as amended. In particular  • SERA.5005 (f) Except when necessary for take-off or landing, or except by permission from the competent authority, a VFR (Visual Flight Rules) flight shall not be flown:  (1) over the congested areas of cities, towns or settlements or over an open-air assembly of persons at a height less than 300 m (1 000 ft) above the highest obstacle within a radius of 600 m from the aircraft;  (2) elsewhere than as specified in (1), at a height less than 150 m (500 ft) above the ground or water, or 150 m (500 ft) above the highest obstacle within a radius of 150 m (500 ft) from the aircraft.  There are currently 41 powered paragliders registered with the IAA.  The reporting procedure to notify the IAA of an unlawful operation of a paramotor can be accessed on the IAA website at www.iaa.ie/safety/safety-reporting/general-aviation-occurrence-reporting ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 212. Deputy Conor D. McGuinness asked the Minister for Transport the number of paramotors which are recorded to be in operation in Ireland to date; and if he will make a statement on the matter. [69479/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_199",
          "debateSectionId": "dbsect_199",
          "showAs": "Air Safety",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_199.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_212",
        "questionNumber": 212
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  Under the Health Act 2004, the Health Service Executive (HSE) is required to manage and deliver, or arrange to be delivered on its behalf, health and personal social services. The Minister for Health is prohibited from directing the HSE to provide a treatment or a personal service to any individual or to confer eligibility on any individual.  In relation to the particular query raised, as this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 834. Deputy Conor D. McGuinness asked the Minister for Health the action she will take in an urgent neurosurgical case for a person (details supplied) where the patient has been placed on a lengthy waiting list despite clinical advice that surgery is required promptly; and if she will ensure the HSE provides an expedited review and treatment date. [69028/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_684",
          "debateSectionId": "dbsect_684",
          "showAs": "Hospital Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_684.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_834",
        "questionNumber": 834
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 835. Deputy Conor D. McGuinness asked the Minister for Health if shunt replacement or similar neurosurgical procedures are eligible for support through the cross-border healthcare scheme, the treatment abroad scheme, or the national treatment purchase fund, particularly in cases where significant delays exist in accessing such treatment in the State; and the criteria governing access to each scheme. [69029/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_685",
          "debateSectionId": "dbsect_685",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_685.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_835",
        "questionNumber": 835
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  The main purpose of the Dormant Accounts Acts is to reunite account holders with their funds. Under the legislation dormant funds which have not been claimed are transferred to the Dormant Accounts Fund, which is managed by the National Treasury Management Agency. The beneficial owner has a right to reclaim their money at any time. The legislation governing Dormant Accounts also established an administrative framework within which Departments could apply for funding from the Dormant Accounts Fund to deliver measures to address disadvantage.  The Department of Rural and Community Development and the Gaeltacht has responsibility for the overall administration of the Dormant Accounts Fund, with individual Government Departments responsible for the delivery and administration of their own measures. All measures funded must be in line with the objectives set out in the legislation, that is, to address economic, social or educational disadvantage or to support persons with a disability. Funding within the Action Plans is not allocated on a county-by-county basis. It is allocated to specific measures across Government Departments who are then responsible for the allocation and oversight of that funding. While some measures operated by Departments are specific and local in nature, in general the measures support individuals and organisations right across the country. The measures to be funded are identified each year in an annual Dormant Accounts Fund Action Plan, with Government Departments requested to identify potential projects or programmes for inclusion. Funding for 2026 will be utilised by eleven Government Departments who will manage the measures set out in the 2026 Action Plan published in November. The specific measures approved in both the 2025 and 2026 Action Plans are attached.  Further information on annual Dormant Accounts Fund Action Plans is available here www.gov.ie/en/collection/769773-dormant-accounts-fund-annual-action-plans-and-reports/.   DAF Measures 2025 and 2026  ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 1108. Deputy Conor D. McGuinness asked the Minister for Rural and Community Development and the Gaeltacht to provide a breakdown of where the just under €44.8 million that has been spent on the 51 measures in the Dormant Accounts Fund Action Plan 2026, will be spent, by county, and nationally if not spent in one particular county, in tabular form. [69365/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_928",
          "debateSectionId": "dbsect_928",
          "showAs": "Dormant Accounts Fund",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_928.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1108",
        "questionNumber": 1108
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  The main purpose of the Dormant Accounts Acts is to reunite account holders with their funds. Under the legislation dormant funds which have not been claimed are transferred to the Dormant Accounts Fund, which is managed by the National Treasury Management Agency. The beneficial owner has a right to reclaim their money at any time. The legislation governing Dormant Accounts also established an administrative framework within which Departments could apply for funding from the Dormant Accounts Fund to deliver measures to address disadvantage.  The Department of Rural and Community Development and the Gaeltacht has responsibility for the overall administration of the Dormant Accounts Fund, with individual Government Departments responsible for the delivery and administration of their own measures. All measures funded must be in line with the objectives set out in the legislation, that is, to address economic, social or educational disadvantage or to support persons with a disability. Funding within the Action Plans is not allocated on a county-by-county basis. It is allocated to specific measures across Government Departments who are then responsible for the allocation and oversight of that funding. While some measures operated by Departments are specific and local in nature, in general the measures support individuals and organisations right across the country. The measures to be funded are identified each year in an annual Dormant Accounts Fund Action Plan, with Government Departments requested to identify potential projects or programmes for inclusion. Funding for 2026 will be utilised by eleven Government Departments who will manage the measures set out in the 2026 Action Plan published in November. The specific measures approved in both the 2025 and 2026 Action Plans are attached.  Further information on annual Dormant Accounts Fund Action Plans is available here www.gov.ie/en/collection/769773-dormant-accounts-fund-annual-action-plans-and-reports/.   DAF Measures 2025 and 2026  ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 1109. Deputy Conor D. McGuinness asked the Minister for Rural and Community Development and the Gaeltacht to provide a breakdown of where the just under €47 million that has been approved for the 56 measures in the Dormant Accounts Fund Action Plan 2026 will be spent, by county, and nationally if not spent in one particular county, in tabular form. [69366/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_928",
          "debateSectionId": "dbsect_928",
          "showAs": "Dormant Accounts Fund",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_928.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1109",
        "questionNumber": 1109
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Deputy Conor D. McGuinness  Is maith an áit í tosú ag uimhir a haon. Tá ceist atá agam don Aire Forbartha Tuaithe agus Pobail, agus Gaeltachta, an Teachta Calleary, mar gheall ar an stádas atá ag na pleananna teanga in gach limistéar pleanála Gaeltachta agus bailte seirbhíse Gaeltachta. Cén obair atá ar siúl chun an chéad ghlúin eile do phleananna a fhorbairt? An ndéanfaidh sé ráiteas ina thaobh sin agus i dtaobh na moille atá i gceist le cuid de na pleananna sin? \n Minister for Rural and Community Development and the Gaeltacht (Deputy Dara Calleary)  Gabhaim buíochas leis an Teachta as an gceist. Is é an sprioc atá leis an bpróiseas pleanála teanga ná an Ghaeilge a láidriú mar theanga phobail. Déantar é seo trí phleananna teanga a fheidhmiú i limistéir aitheanta a chuirfidh le húsáid na Gaeilge i réimsí áirithe sa phobal, mar shampla, sa teaghlach, i measc na hóige, sa chóras oideachais, san earnáil ghnó agus san earnáil phoiblí. Cuirtear tacaíocht ar fáil do na pobail leis na pleananna sin a chur i bhfeidhm agus fostaítear oifigigh phleanála teanga, OPT, le tabhairt faoin obair sin.  Ceadaítear maoiniú ar bhonn bliantúil do 29 ceanneagraíochta pleanála teanga leis na pleananna teanga atá faofa do 26 limistéar pleanála teanga, LPT, agus dhá bhaile seirbhíse Gaeltachta, BSG, a fheidhmiú faoi scáth Údarás na Gaeltachta. Mar chuid den mhaoiniú sin, ceadaítear do na ceanneagraíochtaí OPT amháin, nó beirt i gcásanna áirithe, a fhostú. Faoi láthair, tá ceadanna in áit le 35 OPT a fhostú sna 26 LPT agus dhá BSG.  Faoi scáth Fhoras na Gaeilge, tá seacht mbaile seirbhíse Gaeltachta taobh amuigh den Ghaeltacht agus trí líonra Gaeilge ag feidhmiú. Anuas air sin, tá feidhmiú dhá líonra Gaeilge neamhreachtúil á mhaoiniú ag Foras na Gaeilge ar an taobh ó thuaidh den Teorainn, is iad sin, Carn Tóchair agus iarthar Bhéal Feirste.  Tá ról lárnach ag na hoifigigh phleanála teanga sa phróiseas pleanála teanga. Tá na hoifigigh phleanála teanga fostaithe ag na ceanneagraíochtaí éagsúla, ní hamháin sa limistéir phleanála teanga Ghaeltachta ach i mbailte seirbhíse Gaeltachta agus líonraí Gaeilge araon. Is iad na hoifigigh phleanála teanga atá freagrach as cur i bhfeidhm bhearta an phlean teanga faoina gcúram. Cuireann siad an Ghaeilge chun cinn, eagraíonn siad imeachtaí cultúrtha, cuireann siad acmhainní agus tacaíochtaí ar fáil d'fhoghlaimeoirí, agus bíonn siad rannpháirteach leis an bpobal agus na heagraíochtaí Gaeilge a bhíonn ag obair sna ceantair phleanála teanga.  Tá sé i gceist go mbeidh na pleananna atá in éag cheana féin nó a bheidh ag dul in éag idir seo agus deireadh 2025 bailí go deireadh na bliana 2027 nó go dtí go n-aontófar pleananna nua, cibé acu is luaithe. Beidh aon phlean a théann in éag tar éis an 31 Nollaig 2025 bailí go ceann bhliain tar éis dó dul in éag nó go dtí go n-aontófar plean nua, cibé acu is luaithe. \n Deputy Conor D. McGuinness  Gabhaim buíochas leis an Aire as an gcuid sin dá fhreagra. Tá dea-obair ar bun ag na hoifigigh phleanála teanga agus na ceanneagraíochtaí. Bhí mé féin mar oifigeach pleanála teanga i nGaeltacht na nDéise tráth dá raibh. Feictear go bhfuil fás ag teacht ar líon na gcainteoirí Gaeilge laethúla i go leor limistéar pleanála teanga. Tá líon na nGaeltachtaí a bhfuil fás ag teacht orthu ag dul in airde de réir an daonáirimh is déanaí, ach tá moill i Roinn an Aire agus sa chóras. Tá ocht bplean tagtha chun deiridh. Tá plean amháin críochnaithe le trí bliana agus tá síneadh ama curtha leis. Ní fheictear go bhfuil aon dul chun cinn i dtaobh na bpleananna nua a fhorbairt. Tá seacht gcinn sa bhreis ag teacht chun deiridh i mbliana, rud a chiallaíonn go mbeidh 15 plean teanga as feidhm ag deireadh na bliana seo. Caithfidh muid an ghlúin nua de phleananna nua a chur i gcrích gan a thuilleadh moille. Bhí a fhios againn go maireann na pleananna seo seacht mbliana agus go raibh deireadh ag teacht leo. Ba cheart go ndéanfaí an obair seo cheana féin. Tá mé ag impí ar an Aire dul i ngleic leis an bhfadhb seo agus an mhoill a sheachaint. \n Deputy Dara Calleary  Tá brón orm nach raibh seans agam mo bhuíochas a ghabháil leis an Teachta as a chuid oibre mar oifigeach pleanála teanga. Mar a dúirt mé, tá sé i gceist go mbeidh na pleananna atá in éag cheana féin, nó iad siúd a bheidh ag dul in éag idir seo agus deireadh na bliana seo, bailí go deireadh na bliana 2027 nó go dtí go n-aontófar pleananna nua, cibé acu is luaithe. Beidh aon phlean a théann in éag tar éis dheireadh mhí na Nollag 2025 bailí go ceann dhá bhliain tar éis dó dul in éag nó go dtí go n-aontófar plean nua, cibé acu is luaithe. Tuigim go bhfuil moill ann agus tá muid ag dul i ngleic leis an moill sin. Beidh €3 milliún bhreise sa bhuiséad le haghaidh an phróisis pleanála in 2026. Tá mé ag obair le hoifigigh na Roinne ar an moill agus bhí cruinniú ag oifigigh mo Roinne ar thaobh Oireachtas na Samhna i mBéal Feirste leis na hoifigigh phleanála teanga chun cúrsaí a phlé, idir cúrsaí buiséid agus eile. \n Deputy Conor D. McGuinness  Gabhaim buíochas leis an Aire as é sin a admháil agus an obair atá ag dul ar aghaidh. Creidim go bhfuil obair ag dul ar aghaidh sa Roinn le dul i ngleic leis seo. I ndáiríre, ní rud maith é go bhfuil muid sa riocht seo. Ba cheart go seachnófaí é seo tamall ó shín. Caithfimid a admháil chomh maith go bhfuil fadhbanna le héiginnteacht. Tá sé go maith go bhfuil na pleananna chun a bheith sínte go dtí deireadh 2027 agus go mbeidh siad fós bailí agus a leithéid, ach caithfimid tuiscint go bhfuil difríocht idir an stádas agus an riocht ina bhfuil na ceantair Ghaeltachta ar an talamh anois i gcomparáid le seacht mbliana ó shín. Tá rudaí tar éis athrú. Tá an ghéarchéim tithíochta, mar is eol don Aire, tar éis dul in olcas ó shin, mar shampla. Tá éiginnteacht ann i gcomhar na noifigeach phleanála teanga. Tá sé deacair do na ceanneagraíochtaí iad a chóiméad ina gcuid post nó iad a earcú chun na poist a líonadh. Anuas air sin, i dtaobh chúrsaí tithíochta de, tá Conradh na Gaeilge agus grúpaí eile nach é ag iarraidh go mbeadh straitéis daonra agus tithíochta i ngach limistéir phleanála teanga. Ba cheart go mbeadh sé sin fite fuaite leis na pleananna teanga. Ba cheart go mbeadh an dá rud ag dul ar aghaidh ag an am céanna le chéile leis an taithí agus eolas céanna ag dul isteach sa straitéis agus phlean. \n Deputy Dara Calleary  Mar a dúirt mé sa fhreagra, tá an t-uafás oibre ar siúl ag na hoifigigh phleanála teanga. Baineann cuid den scéal agus fuinnimh atá sa teanga lena gcuid oibre. Tá siad an-láidir sa scéal sin. Tuigim go mór an brú atá orthu agus ar na ceanneagraíochtaí, ach tá muid ag foghlaim agus muid ag cur an clár seo ar siúl sa tír. As an bhfoghlaim agus an cleachtadh sin, beimid in ann rudaí a dhéanamh níos fearr. Tuigim an brú atá ar na hoifigigh phleanála teanga agus na ceanneagraíochtaí, go háirithe ó thaobh oifigigh pleanála teanga a chóiméad. Tuigim freisin na fadhbanna atá ann ó thaobh tithíochta de. Tá siad go léir ceangailte agus tá sé tábhachtach go bhfuil tuiscint ar an gceangal sin, ní hamháin ag mo Roinn – cé go bhfuil sé sin tábhachtach – ach ag Ranna eile, lena n-áirítear na Ranna oideachais agus tithíochta. Beimid ag plé na gcleachtaí ón athbhreithniú le hAirí eile, ní hamháin i mo Roinn féin. Tá suim mhór agam sa phróiseas seo. Tá suim mhór agam cleachtaí a fhoghlaim as an obair atá déanta go dtí seo agus leanúint ar aghaidh leis na hoifigigh phleanála teanga, na ceanneagraíochtaí agus ceanneagraíochtaí breise freisin. ",
        "questionType": "oral",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 1. D'fhiafraigh Deputy Conor D. McGuinness den Minister for Rural and Community Development and the Gaeltacht cén stádas atá ag na pleananna teanga i ngach Limistéar Pleanála Gaeltachta agus Baile Seirbhíse Gaeltachta; agus cén obair atá ar siúl chun an chéad ghlúin eile pleananna a fhorbairt; agus an ndéanfaidh sé ráiteas ina thaobh. [68522/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/dbsect_3",
          "debateSectionId": "dbsect_3",
          "showAs": "Pleanáil Teanga",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/mul@/dbsect_3.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_1",
        "questionNumber": 1
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  The Local Improvement Scheme (LIS) supports the improvement of rural roads and laneways that are not usually maintained by local authorities. Since its establishment in 2017, the Government has provided almost €184 million to local authorities for the LIS.  In August, I was delighted to announce €14 million in additional funding for the 2025 scheme. This brings the total amount invested in the LIS in 2025 to over €30 million.  The Programme for Government commits to the provision of additional funding for the LIS. €17 million in LIS funding was recently announced as part of Budget 2026. This represents an increase in the base allocation to the Scheme in previous years. My officials have engaged closely with local authorities to ensure this LIS funding is fully utilised.  As has been the case over previous years, details of the 2026 scheme, including county allocations and the scheme outline, will be circulated to local authorities and published on the department's website in the new year. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 62. Deputy Conor D. McGuinness asked the Minister for Rural and Community Development and the Gaeltacht the planned 2025 funding allocation for the local improvement scheme (LIS); and if he will provide additional supports to local authorities with significant LIS backlogs. [68474/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_97",
          "debateSectionId": "dbsect_97",
          "showAs": "Road Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_97.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_62",
        "questionNumber": 62
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  This Government is committed to building stronger, safer communities across the country. Minister O'Callaghan and I are conscious that different communities have different needs and we must recognise that. When it comes to rural communities, some areas may face quite specific challenges given their geographic characteristics, whereas some challenges and crime types may be experienced across all rural communities.  Getting more Gardaí out on patrol in all our communities is this Government’s first priority in the area of Justice. A Garda budget of €2.59 billion in 2026 will fund the recruitment of up to 1,000 new Gardaí. An Garda Síochána, through Public Jobs, has run two Garda recruitment campaigns in 2025, with over 11,100 applications in total. Overall, 794 trainees have entered the Garda College in 2025, the highest number since 2018. This shows that recruitment of new Gardaí is gathering real momentum and we now have a steady pipeline of recruits entering the Garda College. 194 new Gardaí attested from the Templemore in mid-November and we are confident that we can look forward to seeing more large groups of Gardaí attesting from Templemore over the course of 2026. In turn these Gardaí will boost numbers throughout the country.  Rural crime obviously covers a number of areas that cause concern for people living in rural communities, ranging from burglary and theft, to animal crime and road traffic offences. An Garda Síochána are committed to tackling all crime, including crime that occurs in our rural communities.  I can assure the Deputy that An Garda Síochána is committed to strengthening their role in fighting crime in rural communities through intelligence-led operations, and their national anti-burglary initiative, Operation Thor. They commenced the winter phase of this Operation in October. This annual increased enforcement operation is aimed at preventing burglars from exploiting the reduced hours of daylight. An Garda Síochána will continue to make arrests as part of ongoing investigations into rural burglaries and bring individuals before the Courts.  Rural safety and community safety is not about policing alone of course – it requires a multi-agency, multi-sectoral and a whole-of-Government response.  Supporting the work of the National Rural Safety Forum, our Department has published the second Rural Safety Plan 2025-2027. The Plan’s vision is to ensure people and communities in rural Ireland feel safe and are safe in their homes, places of work, and their local environments.  It does this by identifying five key priority areas that we will focus on to achieve the overall goal. These areas are: Community Safety, Burglary and Theft, Roads Policing, Animal Crime and Heritage Crime.  Local Community Safety Partnerships (LCSP) are also being rolled out across the country at present, including the Waterford LCSP which has been established and which held its first meeting at the beginning of November. They will play a major role in enhancing public safety alongside An Garda Síochána, residents, businesses and state agencies. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 94. Deputy Conor D. McGuinness asked the Minister for Justice, Home Affairs and Migration his views on the concerns of rural communities regarding policing and community safety. [68409/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_117",
          "debateSectionId": "dbsect_117",
          "showAs": "Crime Prevention",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_117.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_94",
        "questionNumber": 94
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  In June, the Government approved the General Scheme of the Israeli Settlements in the Occupied Palestinian Territory (Prohibition of Importation of Goods) Bill. The main purpose of the Bill is to prohibit the importation of goods into the State from Israeli settlements in the occupied Palestinian territory, including East Jerusalem. The Joint Committee on Foreign Affairs and Trade held a number of hearings on the General Scheme, and received submissions representing a range of views and perspectives.  Pre-Legislative Scrutiny is an important part of the legislative process and the Tánaiste has thanked the Committee for its report on receipt. Detailed work to analyse the report and its recommendations is well underway.  The Regulatory Impact Assessment is currently being finalised by the Department of Foreign Affairs and Trade and will be available on the Department’s website when completed.  The next steps in the process, including the timeline for the progress of the Bill, are being considered by Government.  The General Scheme fulfils the commitment in the Programme for Government to prohibit the import of goods from the occupied Palestinian territory. Trade in services is considerably more complex than is the case with goods and there remains considerable legal uncertainty as to whether the inclusion of services is permissible under EU law. Legal clarity is needed on this point.  We must also take account of practical issues with regard to implementation should services be included in the scope of the Bill.  It remains the Government’s preference that collective action would be taken at EU level and we continue to pursue this.  In this context, Ireland has welcomed the announcements by the Dutch, Slovenian, and Belgian Governments regarding the banning of the importation of goods produced in illegal Israeli settlements, and the introduction of legislation by the Spanish government  At the EU level, the primary right now is ensuring the success of the ceasefire and peace deal and of making a contribution to international efforts in this regard. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 145. Deputy Conor D. McGuinness asked the Minister for Foreign Affairs and Trade her plans to pass the Israeli Settlements in the Occupied Palestinian Territory (Prohibition of Importation of Goods) Bill 2025, in full, in 2025; and if not, the way in which she will justify the continued trade of goods and services with illegally occupied lands, that are being ethnically cleansed by an apartheid state. [68535/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_167",
          "debateSectionId": "dbsect_167",
          "showAs": "Middle East",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_167.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_145",
        "questionNumber": 145
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 313, 314 and 315 together.  The 2022 Framework for the Future Delivery of Water Services was prepared following extensive consultation between my Department, Uisce Éireann, the County and City Management Association, the Local Government Management Agency and union representatives. The Workplace Relations Commission facilitated the dialogue. Inter alia, the Framework addressed concerns raised by water services staff and these clarifications remain.  Section 4 of the Framework details that local authority water services staff who decide not to transfer to Uisce Éireann can choose to remain in employment with their local authority maintaining their current terms and conditions of employment.  During the transition period, any arrangements put in place are in keeping with the Framework and are to help ensure the maintenance of a stable operational environment, as the water sector completes the transition to a national water services authority. I am informed that all water service workers have the opportunity to avail of Health and Safety or other training, so that they may participate fully and safely in their role. At the end of the transition period in 2026 local authorities will cease to be directly involved in the provision of public water services.  Section 159 of the Local Government Act 2001 provides that the Chief Executive is responsible for the staffing and organisational arrangements necessary for carrying out the functions of the local authority for which they are responsible. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 313. Deputy Conor D. McGuinness asked the Minister for Housing, Local Government and Heritage if the commitments given to water services workers in June 2023, allowing them to remain in direct local authority employment until at least the end of 2026, preclude any requirement for those staff to undertake Uisce Éireann-led training or to engage with Uisce Éireann operational systems. [68571/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_296",
          "debateSectionId": "dbsect_296",
          "showAs": "Public Sector Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_296.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_313",
        "questionNumber": 313
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 313, 314 and 315 together.  The 2022 Framework for the Future Delivery of Water Services was prepared following extensive consultation between my Department, Uisce Éireann, the County and City Management Association, the Local Government Management Agency and union representatives. The Workplace Relations Commission facilitated the dialogue. Inter alia, the Framework addressed concerns raised by water services staff and these clarifications remain.  Section 4 of the Framework details that local authority water services staff who decide not to transfer to Uisce Éireann can choose to remain in employment with their local authority maintaining their current terms and conditions of employment.  During the transition period, any arrangements put in place are in keeping with the Framework and are to help ensure the maintenance of a stable operational environment, as the water sector completes the transition to a national water services authority. I am informed that all water service workers have the opportunity to avail of Health and Safety or other training, so that they may participate fully and safely in their role. At the end of the transition period in 2026 local authorities will cease to be directly involved in the provision of public water services.  Section 159 of the Local Government Act 2001 provides that the Chief Executive is responsible for the staffing and organisational arrangements necessary for carrying out the functions of the local authority for which they are responsible. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 314. Deputy Conor D. McGuinness asked the Minister for Housing, Local Government and Heritage if his attention has been drawn to the fact that some local authorities have directed non-transferred water services staff to attend Uisce Éireann safety management system training; if he considers this compatible with Government commitments to those workers; and if he will intervene to ensure that any such directives are paused pending appropriate engagement. [68572/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_296",
          "debateSectionId": "dbsect_296",
          "showAs": "Public Sector Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_296.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_314",
        "questionNumber": 314
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 313, 314 and 315 together.  The 2022 Framework for the Future Delivery of Water Services was prepared following extensive consultation between my Department, Uisce Éireann, the County and City Management Association, the Local Government Management Agency and union representatives. The Workplace Relations Commission facilitated the dialogue. Inter alia, the Framework addressed concerns raised by water services staff and these clarifications remain.  Section 4 of the Framework details that local authority water services staff who decide not to transfer to Uisce Éireann can choose to remain in employment with their local authority maintaining their current terms and conditions of employment.  During the transition period, any arrangements put in place are in keeping with the Framework and are to help ensure the maintenance of a stable operational environment, as the water sector completes the transition to a national water services authority. I am informed that all water service workers have the opportunity to avail of Health and Safety or other training, so that they may participate fully and safely in their role. At the end of the transition period in 2026 local authorities will cease to be directly involved in the provision of public water services.  Section 159 of the Local Government Act 2001 provides that the Chief Executive is responsible for the staffing and organisational arrangements necessary for carrying out the functions of the local authority for which they are responsible. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 315. Deputy Conor D. McGuinness asked the Minister for Housing, Local Government and Heritage the safeguards in place to ensure that local authority water workers who chose not to transfer to Uisce Éireann cannot be subject to indirect or functional transfer through training requirements, system dependencies or other measures introduced without agreement. [68573/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_296",
          "debateSectionId": "dbsect_296",
          "showAs": "Public Sector Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_296.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_315",
        "questionNumber": 315
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  My Department oversees workforce planning for the local government sector, including the monitoring of local government sector employment levels. To this end, my Department gathers aggregate quarterly data on staff numbers in each local authority on a whole time equivalent basis. However, granular data, in terms of the grades of staff assigned to specific work areas in each local authority, is not collected and consequently is not available in my Department. The relevant information would be available from each local authority.  Under Section 159 of the Local Government Act 2001, each Chief Executive is responsible for the staffing and organisational arrangements necessary for carrying out the functions of the local authority for which he or she is responsible including the grading structure within the local authority. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 331. Deputy Conor D. McGuinness asked the Minister for Housing, Local Government and Heritage the details of the grades of oifigigh forbartha Gaeilge in each of the local authorities, in tabular form; if he will consider raising the grades of all oifigigh forbartha Gaeilge to Grade 7, a management level which would enable oifigigh to do their work in an effective manner; and if he will make a statement on the matter. [68681/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_307",
          "debateSectionId": "dbsect_307",
          "showAs": "Local Authorities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_307.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_331",
        "questionNumber": 331
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 538. Deputy Conor D. McGuinness asked the Minister for Health the availability of ultrasound imaging services in publicly funded acute hospitals; the hospitals which do not provide ultrasound on either/both a seven-day and out-of-hours basis; and for how long each such hospital has been without weekend and/or out-of-hours ultrasound, in tabular form. [68960/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_481",
          "debateSectionId": "dbsect_481",
          "showAs": "Hospital Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_481.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_538",
        "questionNumber": 538
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  I propose to take Questions Nos. 101 to 105, inclusive, together.  Under the Road Safety Authority Act 2006, the Road Safety Authority (RSA) has statutory responsibility for the National Driver Testing Service. While my Department is responsible for the overall staffing sanction, neither I nor my officials are involved in the service at an operational level. Accordingly, the information requested for learner drivers taking tests through either Irish or English language sits with the RSA.  Given the RSA's responsibility in this matter, I have referred the Deputy's question to the RSA for direct response. Please contact my office if a reply is not received within ten days. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 101. Deputy Conor D. McGuinness asked the Minister for Transport the average waiting time for applicant’s waiting on an Irish language driving test invitation, by county, as of  30 November 2025, in tabular form. [67588/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_92",
          "debateSectionId": "dbsect_92",
          "showAs": "Driver Test",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_92.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_101",
        "questionNumber": 101
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  I propose to take Questions Nos. 101 to 105, inclusive, together.  Under the Road Safety Authority Act 2006, the Road Safety Authority (RSA) has statutory responsibility for the National Driver Testing Service. While my Department is responsible for the overall staffing sanction, neither I nor my officials are involved in the service at an operational level. Accordingly, the information requested for learner drivers taking tests through either Irish or English language sits with the RSA.  Given the RSA's responsibility in this matter, I have referred the Deputy's question to the RSA for direct response. Please contact my office if a reply is not received within ten days. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 102. Deputy Conor D. McGuinness asked the Minister for Transport the number of applicant’s waiting on an Irish language driving test invitation, by county, as of  30 November 2025, in tabular form. [67589/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_92",
          "debateSectionId": "dbsect_92",
          "showAs": "Driver Test",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_92.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_102",
        "questionNumber": 102
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  I propose to take Questions Nos. 101 to 105, inclusive, together.  Under the Road Safety Authority Act 2006, the Road Safety Authority (RSA) has statutory responsibility for the National Driver Testing Service. While my Department is responsible for the overall staffing sanction, neither I nor my officials are involved in the service at an operational level. Accordingly, the information requested for learner drivers taking tests through either Irish or English language sits with the RSA.  Given the RSA's responsibility in this matter, I have referred the Deputy's question to the RSA for direct response. Please contact my office if a reply is not received within ten days. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 103. Deputy Conor D. McGuinness asked the Minister for Transport the number of English language driving testers, by county, as of 30 November 2025, in tabular form. [67590/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_92",
          "debateSectionId": "dbsect_92",
          "showAs": "Driver Test",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_92.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_103",
        "questionNumber": 103
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  I propose to take Questions Nos. 101 to 105, inclusive, together.  Under the Road Safety Authority Act 2006, the Road Safety Authority (RSA) has statutory responsibility for the National Driver Testing Service. While my Department is responsible for the overall staffing sanction, neither I nor my officials are involved in the service at an operational level. Accordingly, the information requested for learner drivers taking tests through either Irish or English language sits with the RSA.  Given the RSA's responsibility in this matter, I have referred the Deputy's question to the RSA for direct response. Please contact my office if a reply is not received within ten days. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 104. Deputy Conor D. McGuinness asked the Minister for Transport the number of Irish language driving testers, in each of the years 2015 to 2025, in tabular form. [67591/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_92",
          "debateSectionId": "dbsect_92",
          "showAs": "Driver Test",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_92.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_104",
        "questionNumber": 104
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  I propose to take Questions Nos. 101 to 105, inclusive, together.  Under the Road Safety Authority Act 2006, the Road Safety Authority (RSA) has statutory responsibility for the National Driver Testing Service. While my Department is responsible for the overall staffing sanction, neither I nor my officials are involved in the service at an operational level. Accordingly, the information requested for learner drivers taking tests through either Irish or English language sits with the RSA.  Given the RSA's responsibility in this matter, I have referred the Deputy's question to the RSA for direct response. Please contact my office if a reply is not received within ten days. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 105. Deputy Conor D. McGuinness asked the Minister for Transport if he is aware of applicants waiting on Irish language driving test invitations, who are waiting longer than applicants waiting for an English language driving test invitation. [67592/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_92",
          "debateSectionId": "dbsect_92",
          "showAs": "Driver Test",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_92.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_105",
        "questionNumber": 105
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I understand that the Deputy has been in contact with my Department's Immigration Oireachtas service and that this is now resolved. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 397. Deputy Conor D. McGuinness asked the Minister for Justice, Home Affairs and Migration to assist in a case where the citizenship division has not issued a woman with their invitation for their graduation ceremony for a fourth time since 2024, even though they were informed that they have. [67371/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "showAs": "Conor D McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_356",
          "debateSectionId": "dbsect_356",
          "showAs": "Citizenship Ceremonies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_356.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_397",
        "questionNumber": 397
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  My Department will continue to engage with Hill Farmer stakeholders regarding their concerns on the management of mountain environments.  While ACRES, the current agri-environment climate measure under the 2023-2027 CAP Strategic Plan, is closed for applications, my Department will be engaging in due course with a range of stakeholders in relation to the development of new measures for the next CAP programming period post-2027.  Hill farmers who are participating in the ACRES Co-operation approach may avail of complementary environmental actions under the Non-Productive Investments (NPIs) and Landscape Actions elements of the ACRES Co-operation approach.  While their ACRES advisor can advise them as to whether NPIs are appropriate for their lands, the ACRES Co-operation Project (CP) Teams, whose services were procured by my Department, engage with the participants in their respective zones in relation to Landscape Actions. I understand that a number of the CP Teams held information meetings in their areas to bring the options available under the Landscape Action element to the attention of ACRES Co-operation participants.  For a land parcel to be eligible under the Basic Income Support for Sustainability (BISS) scheme, agricultural activity must be taking place in a parcel. Agricultural activity is the use of the parcel to produce agricultural products, such as livestock rearing and fattening, milk production, the growing of fodder crops (silage, hay), tillage and energy crops, or, indeed, the maintenance of the agricultural area.  This definition of agricultural activity considers the physical limitations that certain parcels can be constrained by, in particular hill and upland parcels, and allows other forms of agricultural activity, outside of production to be carried out.  This broad definition of agricultural activity allows uplands to be managed in a way that best suits the local conditions and that takes account of best practice. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Conor D McGuinness",
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_128.xml"
            }
          },
          "debateSectionId": "dbsect_128",
          "showAs": "Land Issues",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_128"
        },
        "questionNumber": 129,
        "date": "2025-11-27",
        "showAs": " 129. Deputy Conor D. McGuinness asked the Minister for Agriculture, Food and the Marine if his Department will engage with hill farmers in relation to localised management of mountain environments taking account of international best practice. [66663/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_129"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Defence  I propose to take Questions Nos. 209 and 211 together.  Staff of the Department of Defence and Defence Forces personnel are free to use personal social media accounts on their own time.  Personal social media accounts of Department of Defence staff or Defence Forces members and their digital media presence are not part of the official communications of either the Department or the Defence Forces.  Both the Department and the Defence Forces have social media policies, in which departmental staff and Defence Forces personnel are provided with guidelines in relation to the use of personal social media accounts.  In the case of staff of the Department of Defence, this includes guidance to ensure official information is not disclosed without appropriate authorisation and that they do not express opinions on matters of or the implementation of government policy. Staff are also advised to be clear about the difference between official departmental accounts and personal ones, particularly where there is any risk that any statements, images or material posted may be perceived as being posted on behalf of the Department of Defence or the Government of Ireland.  The Defence Forces also have robust social media policies in place to provide guidance on how to ensure members maintain an accurate, appropriate and apolitical presence on personal social media accounts.  Defence Forces personnel are directed not to comment on any issue relating to controversial, sensitive or political matters which would be incompatible with service in the Defence Forces and are directed not to attempt to speak or be interpreted as speaking on behalf of the Defence Forces.  In the case of the individual, whose details were supplied, the Defence Forces were not aware of the named accounts sharing content and opinions on political and international affairs and this will now be looked into. ",
        "to": {
          "showAs": "Defence",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Conor D McGuinness",
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_191.xml"
            }
          },
          "debateSectionId": "dbsect_191",
          "showAs": "Social Media",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_191"
        },
        "questionNumber": 209,
        "date": "2025-11-27",
        "showAs": " 209. Deputy Conor D. McGuinness asked the Minister for Defence whether the digital media presences, across multiple platforms, of a person (details supplied) are part of Defence Forces or Department of Defence communications; whether posts on these accounts are sanctioned by the Defence Forces or Department of Defence; whether the opinions expressed on these platforms align with the foreign, defence and security policies of Government; and if he will make a statement on the matter. [67082/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_209"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Defence  The Defence Forces’ have advised that apart from their participation in an episode of the podcast series, 'The Two Johnnies', broadcast earlier this year, they have not utilised social media influencers for recruitment or communications purposes, nor have any requests been made to the Minister or her predecessor for the use of social media influencers for these purposes.  In addition, and further to the response of my predecessor to Parliamentary Question No. 179 of 17 June 2025, I wish to reiterate that the Defence Forces is an apolitical organisation and does not endorse the individual views of any person. Consideration of commercial arrangements with any organisation or entity take into account potential conflicts of interest. However subsequent actions by an individual, organisation or entity after an arrangement is concluded cannot be anticipated by the Defence Forces.  Personal social media accounts of members of the Defence Forces and their digital media presence are not part of the official communications of the Defence Forces. The Defence Forces have robust social media policies in place to provide guidance on how to ensure members maintain an accurate, appropriate and apolitical presence on personal social media accounts.  All Defence Forces personnel are directed not to comment on any issue relating to controversial, sensitive or political matters which would be incompatible with service in the Defence Forces and are directed not to attempt to speak or be interpreted as speaking on behalf of the Defence Forces. ",
        "to": {
          "showAs": "Defence",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Conor D McGuinness",
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_192.xml"
            }
          },
          "debateSectionId": "dbsect_192",
          "showAs": "Defence Forces",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_192"
        },
        "questionNumber": 210,
        "date": "2025-11-27",
        "showAs": " 210. Deputy Conor D. McGuinness asked the Minister for Defence further to Parliamentary Question No. 179 of 17 June 2025, if she or her predecessor authorised the use of social media influencers by the Defence Forces for recruitment and communications; and her views on whether there may be conflicts of interest caused by social media accounts advertising careers in the Defence Forces while simultaneously sharing partisan content related to live conflict situations and international politics. [67083/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_210"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Defence  I propose to take Questions Nos. 209 and 211 together.  Staff of the Department of Defence and Defence Forces personnel are free to use personal social media accounts on their own time.  Personal social media accounts of Department of Defence staff or Defence Forces members and their digital media presence are not part of the official communications of either the Department or the Defence Forces.  Both the Department and the Defence Forces have social media policies, in which departmental staff and Defence Forces personnel are provided with guidelines in relation to the use of personal social media accounts.  In the case of staff of the Department of Defence, this includes guidance to ensure official information is not disclosed without appropriate authorisation and that they do not express opinions on matters of or the implementation of government policy. Staff are also advised to be clear about the difference between official departmental accounts and personal ones, particularly where there is any risk that any statements, images or material posted may be perceived as being posted on behalf of the Department of Defence or the Government of Ireland.  The Defence Forces also have robust social media policies in place to provide guidance on how to ensure members maintain an accurate, appropriate and apolitical presence on personal social media accounts.  Defence Forces personnel are directed not to comment on any issue relating to controversial, sensitive or political matters which would be incompatible with service in the Defence Forces and are directed not to attempt to speak or be interpreted as speaking on behalf of the Defence Forces.  In the case of the individual, whose details were supplied, the Defence Forces were not aware of the named accounts sharing content and opinions on political and international affairs and this will now be looked into. ",
        "to": {
          "showAs": "Defence",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Conor D McGuinness",
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_191.xml"
            }
          },
          "debateSectionId": "dbsect_191",
          "showAs": "Social Media",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_191"
        },
        "questionNumber": 211,
        "date": "2025-11-27",
        "showAs": " 211. Deputy Conor D. McGuinness asked the Minister for Defence if she is aware that a number of digital media accounts purporting to be operated by a person (details supplied) and promoting recruitment to the Defence Forces regularly share content and opinions on political and international affairs, and if these accounts are not sanctioned by Government or the Defence Forces, the policy of Government in relation to the use of social media channels by and featuring serving members of the Defence Forces, in uniform, providing commentary on political and international affairs. [67084/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_211"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The Tenant (Incremental) Purchase Scheme provides for the purchase by eligible tenants of local authority houses which are available for sale under the scheme. All applications for the Scheme must satisfy the requirements outlined in the Housing (Miscellaneous Provisions) Act 2014 and the associated Regulations.  In order to be eligible, applicants must meet certain criteria, including minimum primary annual reckonable income of €11,000. In determining a tenant’s minimum annual reckonable income, local authorities can include incomes from employment, private pensions, the State pension, Widow's, Widower's, Surviving Civil Partner's Pension, Blind Pension, Invalidity Pension, Disability Allowance, and certain social protection payments, where the social protection payment is secondary to income from employment or a pension/allowance. However, other social protection payments including Carer's Allowance, which are considered shorter term in nature, are not considered when determining an applicant's annual reckonable income.  The minimum annual reckonable income requirement has a dual purpose. It ensures the scheme is sustainable and the tenant purchasing the house has the financial means to maintain and insure the property for the duration of the charged period, which may be 20, 25 or 30 years.  The Scheme is monitored on an ongoing basis by my Department to ensure that it remains effective and sustainable. However, there are currently no plans for Carer’s Allowance to be added as a form of reckonable income for the purposes of determining eligibility for the Scheme. ",
        "to": {
          "showAs": "Housing",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Conor D McGuinness",
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_303.xml"
            }
          },
          "debateSectionId": "dbsect_303",
          "showAs": "Departmental Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_303"
        },
        "questionNumber": 353,
        "date": "2025-11-27",
        "showAs": " 353. Deputy Conor D. McGuinness asked the Minister for Housing, Local Government and Heritage to outline in full detail the reason for the exclusion of those on carer’s allowance from availing of the tenant purchase scheme; if his Department has any plans to change this; and if he will make a statement on the matter. [66823/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_353"
      },
      "contextDate": "2025-11-27"
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 13. Deputy Conor D. McGuinness asked the Taoiseach when the Cabinet committee on Northern Ireland will next meet. [65861/25] ",
        "answerText": " The Taoiseach  I propose to take Questions Nos. 1 to 13, inclusive, together.  The Cabinet subcommittee on Northern Ireland was created on 18 February 2025 to oversee implementation of relevant programme for Government commitments and ongoing developments in relation to Northern Ireland, Irish-British relations, and the shared island initiative. As well as considering issues relevant to the Government's position as a co-guarantor of the Good Friday Agreement, including our role in Good Friday Agreement institutions such as the North-South Ministerial Council, the British-Irish Council and the British-Irish Intergovernmental Conference, topics for discussion also include the annual UK-Ireland summits and their agreed programme of work and the continued roll-out and development of the investment, research and dialogue strands of the shared island initiative.  On 17 October, I chaired the 30th plenary meeting of the North-South Ministerial Council in Farmleigh House, Dublin. The Northern Ireland Executive was led by the First Minister, Michelle O'Neill, MLA, and the deputy First Minister, Emma Little-Pengelly, MLA. We had constructive discussions on areas of mutual issues, including business and trade matters, infrastructure and investment co-operation, and tackling gender-based violence. Our discussion also included a new agenda item on emergency planning and preparedness. We also had updates by all Ministers on North-South co-operation under their portfolios, ranging from day-to-day cross-Border engagement to major infrastructural projects. The event was preceded by a dinner at Farmleigh with Government and Northern Ireland Ministers on 16 October.  On 18 November, the Government announced allocations of over €50 million from the shared island fund for ten new projects to be delivered as part of the initiative over 2026 to 2030. Among the projects are €14 million for a major new shared island media initiative to be taken forward by Coimisiún na Meán, €5.9 million to develop cross-Border emergency management capacity on flood response and rescue operations, particularly with resources for technology and so forth, and €2 million to enable a new Dublin-Derry PSO air service to start in 2026.  Next week, along with the Tánaiste, I will attend a summit meeting of the British-Irish Council in Wales where the focus of our discussions will be on the creative industries across these islands. The Cabinet committee on Northern Ireland will continue to meet biannually on these and related matters. We will be meeting again next on 8 December. \n An Ceann Comhairle  I ask Members to please be brief and concise, as the Taoiseach needs to respond. \n Deputy Brendan Smith  I thank the Taoiseach for his reply. As he is aware, there was a general welcome for the legacy framework that was published jointly by the Irish and British Governments in early September. Could he let us know what progress is being made in bringing forward the necessary legislation to enact that framework and to ensure that all of these issues are dealt with through putting the victims first and at the centre of the framework and the modus operandi of dealing with these legacy issues?  Another thing I have consistently raised is the Belturbet bombing of December 1972 and the Dublin-Monaghan bombings of 1974. Again, the British Government has not co-operated to the extent necessary to ensure a comprehensive investigation into the Dublin-Monaghan bombings. Will the Taoiseach let us know if that will continue to be on the agenda in all discussions at Government level with his British counterparts? \n Deputy Erin McGreehan  I would like the Taoiseach to outline whether the Cabinet committee discussed the cross-Border economy, particularly in counties such as Louth where these issues are felt most acutely. Will there be specific actions in relation to tax and administrative complications facing cross-Border workers, including the differentiations between the pricing of alcohol and fuel between both jurisdictions and the impact of that in the distortion of local trade and the undermining of businesses and broader communities?  I support my colleague Deputy Smith in relation to the bombings. I also highlight that it will have been 50 years this December since the Dundalk bombing where people tragically lost their lives. \n Deputy Barry Heneghan  Regarding the cross-Border organisation Foras na Gaeilge, if it had the same growth as the Arts Council, Foras na Gaeilge's budget would now be €50 million. Instead of that, níl sé ach €17 milliún. I welcome the raise in the recent budget to Foras na Gaeilge's funding, but how will the Taoiseach ensure that this additional funding is made available, given that 25% of it is from the North? \n Deputy Ruairí Ó Murchú  I have often brought up the positives regarding the shared island unit. I believe the project in relation to DkIT and its partnership with Queen's University Belfast could fit into that. However, a number of other issues arise, whether we are talking about the remote working issues that have an impact on taxation or exam certification. In fairness to Deputy McGreehan, she has brought up the issue of the disparity regarding fuel. I have spoken before about the need for some sort of means of putting these issues on the agenda properly and dealing with them.  We have made the call for a long time to get down to the issue of constitutional change and the need for a means - call it a citizens' assembly or a forum - by which this conversation can happen. The State must properly prepare for Irish unity. There has been an abject failure to do so and we cannot just wait until everybody gets on together. We need to prepare now and the onus is on the State to do it. \n Deputy Cormac Devlin  I thank the Taoiseach for the update on the work of the Cabinet subcommittee. As Cathaoirleach of the Committee on the Implementation of the Good Friday Agreement, we have had good engagements North and South. That is continuing next week with visiting MPs from Westminster. Dialogue is important in terms of the Government's good relationship with London as well as Belfast.  May I also raise the case of the 265 students and teachers who were kidnapped in Niger state in Nigeria? It is a very serious case and I would like to know what is happening there. \n Deputy Richard Boyd Barrett  Last week, I raised with the Taoiseach - I want to do so again because it is important - the fact that, as part of a wider attack by the British Government on those standing in solidarity with the people of Palestine and against Israel's genocide in Gaza, people in the North are being arrested and charged, including one of our councillors, Councillor Shaun Harkin in Derry, for indicating supporting support for Palestine Action. The designation by the Starmer Government of Palestine Action as a terrorist group is outrageous when what the group has been trying to do is stop Israeli terrorism and genocide by trying to disrupt the ability of the British state and Israeli companies to collaborate with Israel in the genocidal assault on the people of Palestine. It is happening in the North. Arrests are taking place. There was a protest this weekend where people declared their support for Palestine Action. It should not be a chargeable offence and the Taoiseach should speak out against it. \n Deputy Paul Murphy  For 15 months, an Irish citizen from County Antrim has been held without trial in an English prison and has had his rights denied. Jordan Devlin is being locked inside for 23 and a half hours per day. He is being strip searched twice daily. His mail has been withheld, his visits are blocked and his calls are denied. His sister said, \"They put him on public protection so he can't speak to anyone\". She also said:  They often don’t have vegetarian food so he can't eat. They're x-raying him and strip-searching him twice a day. He's freezing too.  He is a Palestine solidarity activist. He is charged with regard to a protest action at Elbit Systems. Elbit is the largest supplier of weapons to the Israeli genocide. He denies all the charges. His trial begins today but his judge was swapped out yesterday with no stated justification. The question is whether the Irish Government has made any representations on his behalf and whether the Taoiseach has sought to ensure that his basic rights as a prisoner and a defendant are defended as opposed to being ridden roughshod over like many other Palestine protesters. \n Deputy Ivana Bacik  I thank the Taoiseach for the update. I welcome the developments with the shared island fund. It is now clearer than it has ever been that conversations about the constitutional future of the island are picking up steam. I would dispute the Secretary of State for Northern Ireland's recent claim that there was no appetite for constitutional change in Northern Ireland. I see that the leader of the SDLP Claire Hanna and others contested that claim. In the absence of leadership from the British Government and in keeping with the principles in the Good Friday Agreement-Belfast Agreement, it is essential for our Government to take on a role of preparing in earnest for the work necessary to lay the groundwork and foundations for running a referendum on unity. We need a clear timeline to allow for that necessary groundwork to take place, to develop Green and White Papers, to allow for the work of citizens' assemblies to take place and to see progress made building on the work of the shared island unit in advance of the 30th anniversary of the Good Friday Agreement-Belfast Agreement. The Taoiseach said that the next meeting of the Cabinet subcommittee would be on 8 December. As we approach 2028, what substantive steps will that Cabinet subcommittee be announcing in terms of bringing the debate further? \n Deputy Rose Conway-Walsh  At last week's session of the Committee on the Implementation of the Good Friday Agreement, we had a profound contribution from the All-Island Cancer Research Institute and the All-Island Congenital Heart Disease Network. It highlighted once again what we have known for some time, namely, that lives can be saved and healthcare can only be delivered to an optimum level across the island when we have an all-island approach to healthcare for the 7 million people living on the island. It makes zero sense on a small island such as ours financially or otherwise to have two healthcare systems operating simultaneously. Until such time as we have a referendum on Irish unity and an opportunity to design a new and modern all-island, world-class service, I ask the Taoiseach and the Minister for Health to set aside a permanent allocation in the health budget for the delivery of healthcare on an all-island basis, utilising North-South collaboration to improve outcomes for patients in both jurisdictions and maximise the wonderful clinical expertise on the island. \n Deputy Eoin Hayes  The renewed calls for a border poll on reunification in recent months point to a definite direction of travel on the issue of a united Ireland and on that question moving from the realm of the idealistic to the practical. My party and I would welcome the opportunity to advocate for reunification and believe that a united Ireland achieved by truly informed communities North and South in a process defined by consent and deliberative consensus has the real potential to benefit the people of the entire island. However, I am concerned that as the chances of a border poll in the next ten or 15 years continue to rise to that of political inevitability, we are running out of time to ensure it takes place in such an environment. Will the Government commit to the establishment of citizens' assemblies, work towards cross-Border fora on health, economics and education and set out a positive vision? \n Deputy Peadar Tóibín  The purpose of the British legacy Bill was to grant to amnesty to those who had killed innocent civilians. There appears to be a significant contradiction in the position of the Irish and British Governments in the new joint framework that seeks to replace that. The British Government is briefing that there will be safeguards for British army veterans. I asked Simon Harris this question and he said that was separate from the joint framework and that the British were looking for their own safeguards in their own legislation. Would that separate treatment for British army veterans not undermine a joint framework? Would it not create a lop-sided justice system in the Six Counties? Will that protection for veterans apply to both sides of the conflict? Will the British secretary of state retain a veto over the disclosure of the role of paid British agents in the Troubles and will former RUC officers who played a significant role in the Troubles be part of the investigative system that is put in place? \n Deputy Conor D. McGuinness  Tá Coimisinéir Teanga nua ceaptha sna Sé Chontae, Pól Deeds. Is coiscéim chun tosaigh é seo i ndiaidh tréimhse an-fhada ag feitheamh dá leithéid. Tá Gaeilge agus pobal na Gaeilge faoi ionsaí sna Sé Chontae faoi láthair. Conas a dhéanfaidh an Taoiseach cosaint ar an bpobal seo, ar lucht labhartha na Gaeilge ó Thuaidh?  While I am on my feet, I want to raise the situation of Jordan Devlin, an Irish citizen from County Antrim who is on remand in Britain awaiting charges relating to pro-Palestinian activism there. I see this in the wider context of a crackdown on political dissent and political protest in Britain. Has the Taoiseach raised, or will he raise, this situation with the British authorities to ensure he is treated fairly in prison and will be afforded a fair trial? \n The Taoiseach  I thank all of the Deputies for raising a variety of issues. Deputy Brendan Smith was first up. In respect of the legacy framework, the measures announced in the joint framework were published in September and provide a pathway to truth and accountability. That is why I went to London to meet Keir Starmer. It was one of those trips. I take it that people accept that we have to go to London every now and again to meet the Prime Minister. It was to make sure we got the legacy Bill over the line because it is an important piece of legislation that is certainly far superior to the previous legacy Act of the last British Government.  The British Government published the Bill amending the 2023 legacy Act on 14 October, so that is the progress the Deputy was asking for. The second reading of that Bill took place in the House of Commons on 18 November. To be fair, we believe that represents speed and demonstrates the seriousness with which they are approaching this essential work. The key test for us will be whether it faithfully reflects what is in the joint framework. The Minister, Deputy McEntee, and the UK secretary of state, Hilary Benn, discussed the legacy framework in their introductory call last week.  The Tánaiste and the Minister, Deputy O'Callaghan, also discussed this with the secretary of state, Mr. Benn, at the British-Irish Intergovernmental Conference, which took place on 17 November because we, too, have responsibilities in this jurisdiction. While we can only legislate once the UK legislation is enacted, the Minister for justice, Jim O'Callaghan, has said he is hopeful that the general scheme of the Bill will be published in April or May of next year. Enabling reciprocal co-operation between the two jurisdictions is absolutely at the heart of the agreed joint framework on legacy. The Garda Commissioner is also committed to the establishment by the end of this year of a dedicated unit as a central point of contact in relation to Troubles-related investigations undertaken by An Garda Síochána. That is also in the joint framework. An Garda Síochána has also committed, where possible, to answer questions that a family may have in relation to the investigation of a Troubles-related incident and provide a report to the family.  In respect of the Belturbet and Dublin-Monaghan bombings, the publication of the Denton report may very well shed light on the Dublin-Monaghan bombings. We have to await the outcome of that. I know it is into the Glenanne Gang and the atrocities they perpetrated, but that will be important. I know that Deputy Smith has been a strong advocate on the Belturbet and Dublin-Monaghan bombings.  Deputy McGreehan raised a very important point about the treatment for tax purposes of workers who cross the Border. We do not have that resolved yet. There have been ongoing issues, or attempts to do that, between the respective Departments of finance and I am pushing through the cross-Border bodies and through the Department of Finance to get some progress on that. We are also working with employers and unions through the LEEF process to see can we make progress on it. It is an issue for the seamless transfer of workers North to South and South to North.  It is more difficult in terms of harmonisation of prices North and South. Different Governments have different policies. I have not seen today's budget in respect of the UK yet but that could even bring in more taxation. We do not know how that will manifest.  I am conscious also that it is 50 years since the Dundalk bombing.  Maidir le ceist an Teachta Heneghan, tá deacracht ann toisc an gaol atá ann. Tá dualgas ar an Executive airgead a chur ar fáil d’Fhoras na Gaeilge agus caithfimid an rud céanna a dhéanamh. Is féidir linn níos mó a chur ar fáil. Trí shared island, tá níos mó á dhéanamh againn, maraon leis an méid atá ag teacht go hoifigiúil ón Rialtas, chun gnóthaí trí Ghaeilge a chothú agus tacaíocht a thabhairt. Mar sin beimid ag déanamh sin. I will come back to the shared island initiative later.  Deputy Ó Murchú and others raised constitutional issues and so on. I think reconciliation cannot be postponed, Deputy. \n Deputy Ruairí Ó Murchú  I did not say it could be. \n The Taoiseach  The Deputy kind of said we could not wait. \n Deputy Ruairí Ó Murchú  The Taoiseach said waiting on a perfect----- \n The Taoiseach  I know. I am not trying to----- \n Deputy Ruairí Ó Murchú  He said we wait on a perfect----- \n An Ceann Comhairle  Deputy, please. The Taoiseach is answering the questions. \n The Taoiseach  I just think we need to really focus on reconciliation on a constant, constant basis. \n Deputy Ruairí Ó Murchú  That is okay. \n The Taoiseach  It is hard work but it does bear great fruit in terms of the North and South and different traditions and political backgrounds within the North as well. \n Deputy Peadar Tóibín  It is more likely to happen in a united Ireland. \n An Ceann Comhairle  Deputy, this is not a back and forth. \n The Taoiseach  It is very important that we consistently do that. I do not think citizens' assemblies are in any shape or form an appropriate route for discussing the future of Ireland or the constitutional framework into the future. \n Deputy Ruairí Ó Murchú  In a forum. \n Deputy Peadar Tóibín  The New Ireland Forum. \n The Taoiseach  I just do not believe it at all, because anyone who knows anything about the North - and I have been involved all my life politically; I have been involved in discussions about the devolution of justice, for example, and I was in the Government when the Good Friday Agreement was first signed - knows it means people-to-people engagement. It means political parties engaging. It means political traditions as well as independent politicians or people who have a view. Citizens' assemblies can be closed enough in some respects and they can be a percentage of a random percentage of the population. There were some good citizens' assemblies but for something as overarching as a future constitutional framework - I just want to give my view on this - from my experience, it simply would not cut it. You would end up with a report----- \n Deputy Peadar Tóibín  The New Ireland Forum. \n Deputy Ruairí Ó Murchú  Then come up with an alternative. \n An Ceann Comhairle  Sorry, there is a structure on this debate. \n The Taoiseach  What I am always amused by----- \n Deputy Peadar Tóibín  We are just giving suggestions. \n An Ceann Comhairle  It is not allowed. \n The Taoiseach  Fianna Fáil as a party has committed to the North with great substance over the years - Charles Haughey, Albert Reynolds and Bertie Ahern in terms of the Good Friday Agreement. In this Government and the last, we did something that has never been done in the shared island initiative. Some €1 billion from 2020 to 2025 and beyond and another €1 billion in this programme for Government, which is bringing real substance. Instead of all the rhetoric and everything else, we are doing things. Part of that has also been a very important investment in real research into the different systems North and South - into our health systems, into education completion, into energy, into enterprise, and into ecology and climate. Good stuff has been done by the Economic and Social Research Institute. I defy the Deputies to go back over the last 100 years and come up with anything that parallels the level of research we have undertaken to try to understand better the different systems and different approaches.  Now, I will put a challenge to Sinn Féin. It has been talking about this for decades but it has not produced a scrap of paper in terms of----- \n Deputy Ruairí Ó Murchú  That is not true. \n Deputy Rose Conway-Walsh  That is not true. \n The Taoiseach  One second, please. I am just trying to make a point. \n Deputy Rose Conway-Walsh  Yes, but it is not the truth. \n An Ceann Comhairle  It is not a back and forth. \n Deputy Rose Conway-Walsh  Do not tell untruths. \n The Taoiseach  In terms of a blueprint, why is Sinn Féin afraid to bring forward a blueprint? \n Deputy Rose Conway-Walsh  You are the Taoiseach. \n An Ceann Comhairle  There are seven other Deputies, Taoiseach. \n Deputy Rose Conway-Walsh  You are the leader. \n The Taoiseach  I know. \n An Ceann Comhairle  It is not a back and forth. \n The Taoiseach  We are taking our responses in terms of the Good Friday Agreement. \n Deputy Conor D. McGuinness  You lead the Government. \n The Taoiseach  I believe in the unity of the Irish people, okay,----- \n An Ceann Comhairle  Seven other Deputies, Taoiseach. \n The Taoiseach  -----but I would say to the Deputies that with everything Sinn Féin does, the onus is on the Government. The Government will take its responsibilities in relation to this but----- \n Deputy David Cullinane  I have brought forward a plan for healthcare. I will send it on to you. \n The Taoiseach  -----fo a party I would have thought was so committed as Sinn Féin is rhetorically - it keeps going on about it - it has produced very little in terms of what it believes the blueprint should be. \n Deputy Rose Conway-Walsh  We have done several studies. \n An Ceann Comhairle  Just to remind----- \n The Taoiseach  That is the point I would make----- \n Deputy Ruairí Ó Murchú  And we have engaged. \n The Taoiseach  -----because the party always wants us to produce the blueprint. \n Deputy Ruairí Ó Murchú  That is because we are not in power. \n The Taoiseach  By the way, Fianna Fáil will not be found wanting, nor will other parties, in terms of delivering substance in respect of this issue. \n Deputy Ruairí Ó Murchú  You are the Government. \n An Ceann Comhairle  Taoiseach, just to remind you there are seven other Deputies. \n The Taoiseach  That is covering all the seven really. There are a good few----- \n Deputy Peadar Tóibín  But it is not getting us anywhere. \n An Ceann Comhairle  No, the next seven, including Deputy Boyd Barrett. \n The Taoiseach  Deputy Devlin made a very important point and he has done very good work as Chair of the Good Friday committee. I certainly think he is correct in respect of what has happened in Nigeria. At the European Union-African Union Summit, that was raised in terms of what Boko Haram and various jihadist groups were doing in terms of the persecution and killing of many people, but Christians as well, and the kidnapping of young girls and so on. I appreciate the point the Deputy raised there.  To Deputy Boyd Barrett on the issues around Palestine Action, all of our embassies and so on provide whatever consular supports to any Irish citizen who is on remand or in prison. We always provide whatever supports we can or whatever assistance but we do not and obviously cannot interfere in the criminal justice system. I will review the case of Jordan Devlin and I will ask again our ambassador in London for an update in respect of that. \n Deputy Richard Boyd Barrett  You should speak out against Starmer's policy. \n An Ceann Comhairle  Please, Deputy. \n Deputy Richard Boyd Barrett  It is a disgraceful policy. \n The Taoiseach  I have no issue with people - obviously, I do not - supporting Palestinians. I do have an issue - I am not saying this happened in these cases at all because I do not know the full detail of them - but I read recently of a case where there was a ramming of building in London, so it is not as black and white as the Deputy has articulated, or even here where people drive through gates and barriers and do criminal damage. TDs' offices have had criminal damage by, I would say, more extreme elements of people who were involved in supporting the Palestinian movement, unfortunately. It is true. My own office was damaged three times. I know other TDs whose offices were damaged. \n Deputy Erin McGreehan  Hear, hear. \n The Taoiseach  So, is that acceptable? Is that legitimate protest? No, it is not. When there are people working in those offices, they do not think it is legitimate. All I am saying is we all have to be clear on the demarcation line. I am not familiar with the individual cases here in terms of the alleged crimes and so on like that, but let us not try to pretend that everything is just all one way because----- \n Deputy Paul Murphy  But in Britain, if you just hold a sign saying \"Free Palestine Action\", you can be arrested. \n An Ceann Comhairle  Please, Deputy Murphy. \n The Taoiseach  -----one thing I do know----- \n Deputy Paul Murphy  That is crazy. \n An Ceann Comhairle  This is orchestrated. I ask you to stop interrupting. \n The Taoiseach  One thing I do know is either on the far right or the far left, people do transgress the lines and let us not pretend they do not. They have in this country in the past. There clearly are other issues in the UK----- \n Deputy Richard Boyd Barrett  I think you will find the Israelis are the transgressors. \n The Taoiseach  -----and so on like that. Look, some people were trying to stop Dublin Port the other day. \n Deputy Paul Murphy  And they got bashed, did they not? \n An Ceann Comhairle  Taoiseach, I do not know if you intend to take any other questions. \n Deputy Paul Murphy  They got battered by gardaí, did they not? \n The Taoiseach  Well, they should not be trying to stop----- \n Deputy Paul Murphy  Did the Taoiseach support the gardaí battering them? \n The Taoiseach  Some 80% of trade in this country goes through Dublin Port and you guys want to wreck it. That is bread on the table. Workers all over the country depend on trade going through Dublin Port. As far as the Deputies are concerned, that should be stopped in its tracks. There are demarcation lines that we have to be very clear about. The right to protest----- \n Deputy Paul Murphy  They were protesting trade with Israel. \n The Taoiseach  -----is a sacred right in this country. We should cherish that and we should never do anything to damage it, nor should others.  I think I have dealt with the issue Deputy Bacik raised in my general response. I do not believe a citizens' assembly is the right way to go.  Deputy Conway-Walsh spoke about the cancer consortium. I helped to set that up originally. We are supporting it. On congenital heart disease, there was a very good agreement and there are cross-Border health initiatives including, for example, an initiative to treat children's hearts in Crumlin. There is more we can do. There is a cancer centre at Altnagelvin. I do not know if the Deputy has seen that. The Republic provided a lot of funding for that. There are also other services. I am all for that. We are researching whether we can provide better primary care services North and South and whether hospital resources can be combined. Deputy McGreehan made a point to me about two hospitals, one of which was Daisy Hill Hospital, where more stuff could be done. We have been working on that through various initiatives. I am all for that. We will continue to do that in conjunction with the ESRI and NESC.  I have given my views on the issue raised by Deputy Eoin Hayes. We have established all-island forums through the shared island initiative. Through that initiative, we have created a climate and biodiversity network, an all-island women's forum and an all-island youth forum where young people get together and talk about the future and about their lives. We have also developed the first all-island music archive, combining music from different traditions in the one archive. That is being funded through the shared island unit. There is a lot happening on the ground. People are just getting together. I was at an event two weeks ago. It was fantastic. People from east Belfast were doing tapestries with people from Inishbofin. Some of them had never been in the Republic before. Some of those from the South had never been in the North. We have a long way to go but we need to do this right and properly.  To respond to Deputy Conor McGuinness, is maith an rud é go bhfuil an coimisinéir teanga nua ann sa Tuaisceart. Tá Acht ann anois. Tá reachtaíocht curtha i láthair. Is dócha go bhfuil an-chuid oibre le déanamh ag an gcoimisinéir chun é sin a chur i bhfeidhm. Níl an reachtaíocht sin lán-cosúil leis an reachtaíocht atá againn anseo. Más féidir linn aon tacaíocht a thabhairt dó agus do ghluaiseacht na Gaeilge sa Tuaisceart, beimid sásta é sin a dhéanamh. Tá a lán déanta againn ach táimid sásta i bhfad níos mó a dhéanamh. \n Deputy Peadar Tóibín  Will the Taoiseach address the lopsided protections for veterans? \n The Taoiseach  Again, they were not negotiated by this Government, nor are they part of the joint framework. It is our understanding that the accommodation made for witnesses should apply in the cases of all victims equally, regardless of the perspective being brought to the matter. \n Deputy Peadar Tóibín  It is a problem then. \n An Ceann Comhairle  The Taoiseach has another 15 minutes. Did he answer Deputy McGuinness's question? \n The Taoiseach  I did. \n An Ceann Comhairle  You did. I am sorry; I was distracted. I would like to welcome a member of the Down's syndrome community, Declan Moran, who is here with Deputy Albert Dolan. You are very welcome, Declan. \n The Taoiseach  You are very welcome, Declan. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_13",
        "debateSection": {
          "showAs": "Cabinet Committees",
          "debateSectionId": "dbsect_16",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/debate/mul@/dbsect_16.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/debate/dbsect_16"
        },
        "date": "2025-11-26",
        "questionNumber": 13,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Conor D McGuinness",
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29"
        },
        "questionType": "oral",
        "to": {
          "showAs": "Taoiseach",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 35. Deputy Conor D. McGuinness asked the Taoiseach if he will report on the programme plan for his Department’s new disability unit for 2025-2027. [65862/25] ",
        "answerText": " An Ceann Comhairle  We have 15 to 16 minutes left. There are 20 Deputies to speak on the next question. I propose to divide the time remaining after the Taoiseach's opening statement between a number of Deputies. \n The Taoiseach  It is a brilliant statement. \n An Ceann Comhairle  The Taoiseach will have to try to be brief. \n The Taoiseach  I jest. \n Deputy Peadar Tóibín  It is all in the delivery. \n The Taoiseach  I will try to cut it short to allow others to come in. I propose to take Questions Nos. 14 to 35, inclusive, together.  I established the disability unit in the Department to bring about a renewed focus and urgency and out of a desire to drive progress on disability issues. The unit's first programme plan, published in September, outlines how the unit will drive the delivery of the Government's new national disability strategy, working across government to make the ambitions a reality. In particular, the unit will look to drive innovation, to get things done, to bring momentum to policy implementation, to troubleshoot, where appropriate, to improve the delivery of services, and to get strategic thinking on future challenges. The unit will also support the Cabinet committee on disability.  The first programme plan for the unit outlines ten priority areas for the period from 2025 to 2027 across five workstreams. The first workstream relates to transforming children's disability services, early years education and health. The second is about increasing system capacity and the third is about opening doors and addressing barriers to employment pathways and supports. The fourth relates to implementing the national disability strategy and the fifth is on planning and designing for the future. The programme plan allows for further workstreams to be assigned to the unit as may be needed.  We do not want to duplicate the work of Ministers or Departments but to support them in improving services and getting things done. It is already up and running. The Cabinet committee on disability has met five times to date. With the support of the unit, we have looked at the new national disability strategy. As the House will know, that has gone through and has now been published. The provision of therapists in special schools is up and running. Some €16 million has been allocated for that this year. There have also been improvements to the delivery of services and the assessment of need process is being reformed, which includes legislative reform.  The budget was impacted by the unit and the Cabinet subcommittee and there was a significant focus on disability, particularly the income disregards for carer's allowance, among other initiatives and payments. The budget also provided a record €3.8 billion allocation towards specialist disability services. This represents a 20% increase year on year. That is to provide permanent dedicated funding for essential disability services. The investment in children's disability services will provide therapy services and strengthen the children's disability network teams through the provision of additional staff and so forth. Some €20 million was targeted at the assessment of need waitlist initiative, providing up to 6,500 clinical assessments. We are developing our budget spotlight on disability. That will be published in due course. It relates to the last budget but will also provide further thinking with regard to future budgets. We are also looking at developments in the area of transport and mobility. We are awaiting proposals from the Departments of Transport and Finance in that regard. \n An Ceann Comhairle  I propose to take the first six Deputies and to allow the Taoiseach six minutes to respond. \n Deputy Pádraig O'Sullivan  This is a topic the Taoiseach is very familiar with. He has visited the Rainbow Club on dozens of occasions at this stage and knows the great work that Jon, Karen and the board do. When Senator Rabbitte was the Minister of State, she was the first to allocate funding to the Rainbow Club under a service level agreement to provide respite care for children. As the Taoiseach will know, every week, over 1,200 children avail of this service, which is provided on a shoestring budget. The Taoiseach will be very familiar with the difficulties the club had in acquiring a nearby site, the former HSE ambulance building. It now has that building and has been lucky enough to engage an architect who is a professional in this field pro bono to design a bespoke building that is fit for the club's purposes. We need to move this project on. We need the HSE and the Government to support it financially to deliver it. It is going to be a massive undertaking for the charity. What is the Taoiseach's office going to do to advance the project? \n Deputy Ruairí Ó Murchú  The National Human Rights Strategy for Disabled People 2025-2030 was launched with great fanfare but we await the action plan. There is much talk of accountability. Will the Taoiseach give me a timeline for the introduction of that action plan? Who will be taking the lead, particularly with regard to oversight and accountability? Will it be the unit, the Cabinet committee or the Department of Children, Disability and Equality? How exactly will it work? How will we see improvements, whether in relation to assessments and therapies or the low level of disabled people who are involved in employment and the need for schemes that actually work? A lot of work is needed to make schemes such as the wage subsidy scheme and the work and access programme fit for purpose. \n Deputy Cian O'Callaghan  The level of unemployment among disabled people in Ireland is among the worst in Europe. I recently met with a number of disabled people in my constituency who have excellent qualifications and skills and who are willing and eager to work but who are stuck in unemployment. There are a number of barriers to employment that need to be removed. We are far behind other European countries in this regard. In 2021, the OECD released a report that made a number of recommendations as to how to tackle this. Those recommendations have still not been implemented. When will they be implemented in full?  What is the Government doing to tackle the scandalously high unemployment levels for disabled people in Ireland? \n Deputy Barry Heneghan  Bhí mé ag caint faoi seo dhá sheachtain ó shin agus an tseachtain seo caite. An rud atá i gceist ná Stapolin Educate Together National School in Baldoyle, which has a petition. Children from the school were in the Dáil last week. It needs two autism classrooms to be sanctioned by the Minister. There are eight children in mainstream classes with eligibility letters and a further 30 in the catchment area who are on waiting lists. This is a huge priority for me and I would love it to be addressed. \n Deputy Richard Boyd Barrett  David and Nicole have a five-year-old son with autism, and an older son. They live in a maisonette, which is 29 sq. m. It is absolutely tiny and rank with damp. Because of his autism, their son has serious sensory processing issues. He is a flight risk. I know these flats well. They have very dangerous concrete steps, which are a serious risk to him. Occupational therapists, medical professionals and people in school have said that he has to be got out of there as he cannot develop or do his occupational therapy if he is living in these conditions. Dún Laoghaire-Rathdown County Council says autism is too prevalent in the community to give it medical priority. That is outrageous. The prevalence of a condition is not a reason to say it is not a priority if the child is in danger. If a child is in danger, it is a priority to get the child out of danger. \n An Ceann Comhairle  I appreciate that. The Taoiseach has the message. \n Deputy Richard Boyd Barrett  I would like there to be an intervention on that. \n Deputy Paul Murphy  The budget was a savage attack on disabled people. It took over €1,000 out of the pockets of disabled people and betrayed the promise in the programme for Government to introduce a permanent annual cost-of-disability support payment. The last time I asked about this, the Taoiseach claimed the cost of disability would be looked at in the next budget. The cost-of-living crisis is now. The cost-of-disability crisis is now. Some 70,000 people who are disabled or have a long-term illness are living in poverty. That is one in three. I have been inundated with emails from disabled people asking for winter cost-of-living and cost-of-disability payment. Many will be forced to choose between heating and eating this Christmas. They also want a permanent cost-of-disability payment without further delay. The Taoiseach has billions of euro in surplus. Do not be a Scrooge this Christmas. Please act on it. \n Deputy Peadar Tóibín  The children's disability network team, CDNT, in Meath is not fully staffed. According to statistics I received today, there are 20 vacant posts across disability teams in Kells, Dunshaughlin, Navan, Slane and Trim. Separate data received by Aontú today show that the Government is actually reducing the number of college places for speech and language therapists, from 370 in the year before Covid to 355 last year. The Government is reducing the number of students filling the necessary college places on an annual basis. What is the Taoiseach saying to parents whose children have been waiting for 14 months to see the CDNT in County Meath and to the children who are being bounced around endlessly from CAMHS, the CDNTs and other services? \n An Ceann Comhairle  Before the Taoiseach replies, could he maybe answer the other Deputies in writing?  Sixteen Deputies did not get to ask questions. They might get some form of response from the Taoiseach. \n The Taoiseach  You can bring some more of them in if you want, a Cheann Comhairle. \n An Ceann Comhairle  Only if the Taoiseach needs less time. We cannot go over the 45 minutes provided. \n The Taoiseach  I am not going to write replies to oral questions. I have given an overall response to everybody. \n An Ceann Comhairle  I am bound by the timelines set down. \n The Taoiseach  Do I have six minutes remaining? \n An Ceann Comhairle  Yes. \n The Taoiseach  I will get around to everybody who has asked a question. \n An Ceann Comhairle  I am talking about the Deputies who have not have not got in. \n Deputy Richard Boyd Barrett  The Taoiseach cannot really answer questions that have not been asked. \n An Ceann Comhairle  I know, but that is it. \n The Taoiseach  It is a new departure if I am going to do a written reply to every oral question. That is not on either. \n An Ceann Comhairle  The Taoiseach should go ahead. I suppose it is just a casualty of how interruptions affect the course of questions. To be fair, the Taoiseach cannot answer a question that has not been asked. We are delaying the answering process. \n Deputy Jennifer Whitmore  Could we even have 30 seconds to ask a question and then maybe the Taoiseach could respond? \n An Ceann Comhairle  No. We cannot go over time. I do not set the time. I do not have that discretion. \n Deputy Jennifer Whitmore  No, but we could stay within the time. \n An Ceann Comhairle  There are 15 Deputies left. \n The Taoiseach  Deputy Pádraig O'Sullivan raised the Rainbow Club, which is doing exceptional work. Jon and Karen O'Mahony have been exceptional leaders in that regard. The former Minister of State, now Senator Rabbitte, did good work on a service level agreement. I was involved in advocating for that building, which was a HSE building, to be allocated to the Rainbow Club. I will certainly continue to work with them and to support them with capital. What is important is that we get a timeline and some idea of how we can progress that as quickly as we possibly can. It is a very good, practical example of how a parent-led, community-based approach can develop services for autism in a nimble and flexible way that has helped so many families.  Deputy Ó Murchú asked about the action plan. That will come.  I do not have an exact date but it is on target. It is fairly imminent. \n Deputy Ruairí Ó Murchú  Who will lead on it? \n An Ceann Comhairle  Please, Deputy Ó Murchú. \n The Taoiseach  The Minister, Deputy Foley, will lead, with the support of the unit in my office, but she will also report to the Cabinet subcommittee, which will then make recommendations to the Cabinet. That is how this will work. The Cabinet subcommittee is very important because all the key Ministers have to be there.  I agree with Deputy Cian O'Callaghan that the unemployment levels among the disability community is too high, and the barriers are too much. Part of the strategy in terms of what I am trying to do with the Minister, Deputy Calleary, is to remove some of those barriers and to create additional supports to make sure that employers are even more incentivised to recruit people. The intention is also to give supports to those who employ people with disabilities on a more sustainable basis. I do not disagree with the Deputy. The historic underemployment of people with disabilities in society is something that is exercising me.  I will pursue the issue raised by Deputy Heneghan about the two autism classes in the Educate Together school in Baldoyle.  I agree with Deputy Boyd Barrett. That is a very strange response from the council referring to the prevalence of autism. Autism is a spectrum, a continuum. There is high-functioning autism, people in the middle and those with autism which is very severe and profound. The council should be able to use the general guidelines in respect of health needs more generally. I am at a loss as to why the council cannot say in this case that the child needs prioritisation and a proper house to facilitate the treatment and life of the child. That is something on which I will go back to the Minister for housing in respect of guidelines to be sent to councils in that respect. I would not have thought it necessary. I thought councils would have enough flexibility to do this.  I disagree with Deputy Paul Murphy's description of the budget as a savage attack, but €3 billion has been invested in special education as an outcome of the budget, as well as €130 million for grants to adapt the houses of older people and disabled people. There was a €10 increase per week in the disability allowance, an expansion of the wage subsidy scheme, an increase of €375 in the income limit for carer's benefit, and a €20 increase in the monthly domiciliary care allowance. That is not a savage attack on disability. We have to pursue the cost of disability and the Minister will bring plans in the next budget in respect of that.  In response to Deputy Tóibín, the vacancy rate nationally has come down for CDNTs. We have increased the allocation of therapy places in third level colleges. \n An Ceann Comhairle  I thank the Taoiseach. Even though there is time left, the point is that this format is not working. The place to discuss that is at the Business Committee on Thursday. I ask Members to bring it up and we can sort out something else. Certainly, where there is a grouping of 19 Members, it is not possible to give the Taoiseach time to answer in the remaining time. I am sorry for those who did not get in but there is just nothing we can do, other than discuss it at the Business Committee and change the format. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_35",
        "debateSection": {
          "showAs": "Departmental Programmes",
          "debateSectionId": "dbsect_17",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/debate/mul@/dbsect_17.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/debate/dbsect_17"
        },
        "date": "2025-11-26",
        "questionNumber": 35,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Conor D McGuinness",
          "memberCode": "Conor-D-McGuinness.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29"
        },
        "questionType": "oral",
        "to": {
          "showAs": "Taoiseach",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "question": {
        "showAs": " 300. Deputy Conor D. McGuinness asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the complete breakdown of costs involved in the works completed by the Office of Public Works on the Garda station situated in An Rinn, Contae Phort Láirge, in each of the past ten years. [65655/25] ",
        "debateSection": {
          "showAs": "Office of Public Works",
          "debateSectionId": "dbsect_295",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_295",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_295.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Conor D McGuinness",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "memberCode": "Conor-D-McGuinness.D.2024-11-29"
        },
        "questionNumber": 300,
        "answerText": "",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Public Expenditure",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_300",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 392. Deputy Conor D. McGuinness asked the Minister for Education and Youth the number of schools in Waterford that applied for funding under the 2025 Summer Works Programme. [65607/25] ",
        "debateSection": {
          "showAs": "Schools Building Projects",
          "debateSectionId": "dbsect_382",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_382",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_382.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Conor D McGuinness",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "memberCode": "Conor-D-McGuinness.D.2024-11-29"
        },
        "questionNumber": 392,
        "answerText": " Minister for Education and Youth  The purpose of the Climate Action Summer Works Scheme (CASWS) is to enable individual school authorities to undertake small-scale building works on a devolved basis that, ideally, can be carried out during the summer months or at other times that avoid disrupting the operation of the school. The CASWS operates on a multi-annual basis across a number of categories of works.  I can confirm my department has received applications under the CASWS for 49 schools across the county of Waterford for a number of different categories of work.  It is envisaged that approvals in any given year will involve a spread of categories rather than the traditional single category at a time. This is aimed at managing market capacity and maximising value for money opportunities for school authorities.  The CASWS will operate on a multi-annual basis, the first tranche of projects for 2026 were announced on the 18th November 2025. Under this scheme, approved applications from schools that are not reached for funding or market prioritisation reasons (as above) in 2026 will qualify to be assessed for purposes of the funding available for climate action summer works in subsequent years.  Full details of the of the announcement and the list of schools approved in the first tranche, the Circular (0029/2025) for the scheme and guidance documents for schools can be found at the below link; www.gov.ie/en/department-of-education/services/summer-works-scheme/. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_392",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 409. D'fhiafraigh Deputy Conor D. McGuinness den Aire Oideachais agus Óige Chun a fhiafraí den Aire Oideachais agus Óige díriú chomh luath agus gur féidir ar na seomraí ranga breise buana a chur ar fáil do Scoil Gharbháin i nDún na Mainistreach, Port Láirge, ós rud é, i mí Feabhra 2025, gur gheall an Roinn go ndéanfadh foireann deartha teagmháil leis an scoil laistigh de shé seachtaine, rud nach bhfuil tarlaithe fós, agus go bhfuil brú ollmhór anois ar an scoil agus liosta feithimh ollmhór ann di, agus go bhfuil faillí á ndéanamh ar thuismitheoirí atá ag iarraidh páistí leo a chur go dtí scoil lán-Ghaelach, rud nach mbeidh líon mór atá ar an liosta feithimh a dhéanamh anois, agus gur baile seirbhíse Gaeltachta é Dún Garbhán, agus gurb í seo an t-aon bhunscoil lán-Ghaeilge sa cheantar máguaird. [65865/25] ",
        "debateSection": {
          "showAs": "Scoileanna Gaeilge agus Gaeltachta",
          "debateSectionId": "dbsect_395",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_395",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_395.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Conor D McGuinness",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "memberCode": "Conor-D-McGuinness.D.2024-11-29"
        },
        "questionNumber": 409,
        "answerText": " Minister for Education and Youth  Is féidir liom a dheimhniú don Leas gur chuir an scoil atá i gceist iarratas isteach ar dtús faoi Scéim Cóiríochta Scoile Breise (ASA) na roinne in 2018. De réir measúnú, bhí an suíomh srianta agus go raibh tailte breise ag teastáil chun an chóiríocht seo a sholáthar, agus tharraing údarás na scoile an t-iarratas seo siar.  Chuir an scoil iarratas isteach chun tailte breise a cheannach in 2021 agus críochnaíodh éadáil láithreán 2.765 acra in aice leis an scoil ag deireadh mhí na Bealtaine 2025.  Ag deireadh na bliana 2024, chuir an scoil i gceist iarratas athbhreithnithe ASA isteach le haghaidh cóiríochta breise chun freastal ar a riachtanais amach anseo.  Is é cur chuige na Roinne leanúint d’acmhainn an eastáit scoile reatha a uasmhéadú a oiread agus is féidir ar an gcéad dul síos agus an acmhainn bhreise riachtanach a sholáthar trí thionscadail spriocdhírithe agus tosaíochta a chur i bhfeidhm thar an tréimhse 2026 go 2030 chun freastal ar na riachtanais is práinní agus is tosaíochtaí. Díreofar go láidir ar an acmhainn scoile atá ann cheana a uasmhéadú, tionscadail tosaíochta a chur chun cinn nuair nach leor an acmhainn áitiúil ar fud scoileanna sa cheantar, agus seachadadh inacmhainne a chinntiú, a chuireann luach ar airgead ar fáil, agus a fhreastalaíonn ar riachtanais fheidhmiúla. Tá soláthar áiteanna scoile riachtanacha, lena n-áirítear do leanaí a bhfuil riachtanais speisialta oideachais acu, mar thosaíocht ag mo roinn.  Déanfar cinneadh maidir le hiarratas na scoile ar chóiríocht bhreise go luath i gcomhthéacs bhainistíocht fhoriomlán an chláir. Cuirfear san áireamh sa chinneadh seo riachtanais fhoriomlána na n-áiteanna scoile, lena n-áirítear riachtanais do leanaí a bhfuil riachtanais speisialta oideachais acu, agus mar aitheantas ar réamh-mheastacháin dhéimeagrafacha, ar acmhainn trasna scoileanna sa cheantar, agus a mhéid atá scoileanna ag tabhairt tosaíochta do riachtanais áitiúla na n-áiteanna scoile. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_409",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 747. Deputy Conor D. McGuinness asked the Minister for Children, Disability and Equality whether a social worker has been appointed to the Dungarvan children's disability network team (CDNT 6) to advocate for children with disabilities [65616/25] ",
        "debateSection": {
          "showAs": "Childcare Services",
          "debateSectionId": "dbsect_663",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_663",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_663.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Conor D McGuinness",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "memberCode": "Conor-D-McGuinness.D.2024-11-29"
        },
        "questionNumber": 747,
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Children",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_747",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 760. Deputy Conor D. McGuinness asked the Minister for Children, Disability and Equality her plans to address the childcare capacity shortage in Dungarvan, County Waterford given that a large number of children are missing out on early years education; and if she will make a statement on the matter. [65373/25] ",
        "debateSection": {
          "showAs": "Childcare Services",
          "debateSectionId": "dbsect_677",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_677",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_677.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Conor D McGuinness",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "memberCode": "Conor-D-McGuinness.D.2024-11-29"
        },
        "questionNumber": 760,
        "answerText": " Minister for Children, Disability and Equality  Improving access to quality and affordable Early Learning and Care and School Age Childcare is a key priority of Government.  Early learning and childcare capacity is increasing. Data from the Annual Early Years Sector Profile 2023/24 shows that the estimated number of enrolments increased by approximately 19% from the 2021/22 programme year. However, it appears that demand for early learning and childcare remains higher than available supply in certain parts of the country, particularly for younger children.  A forward planning model is in development which will be central to the Department's plans to achieve the policy goals set out in the Programme for Government to build an affordable, high-quality, accessible early childhood education and care system, with State-led facilities adding capacity.  The Department continues to support the ongoing development and resourcing of Core Funding which has given rise to a significant expansion of places since the scheme was first introduced. Core Funding, which is in its fourth programme year, funds services based on the number of places available.  This provides stability to services, and reduces the risk associated with opening a new service or expanding an already existing service. For the third programme year (2024/25), the allocation for Core Funding allowed for a 6% increase in capacity. Budget 2025 secured funding for the fourth programme year (2025/6) to facilitate a further 3.5% increase from September 2025. Budget 2026 has made provision for the fifth programme year (2026/7) for a further expansion in supply of 4.2%.  This increased investment will allow increases in the natural growth of the sector driven both by new services joining the sector and existing services offering more places and/or longer hours to families.  The total allocation for Core Funding in 2026/2027 programme year will increase to €437 million, an increase of 15% on the current full year allocation.  The Government is also supporting the expansion of capacity through capital funding. The Building Blocks Extension Grant Scheme is designed to increase capacity in the 1–3-year-old, pre–Early Childhood Care and Education, age range for full day care. Core Funding Partner Services could apply for capital funding to physically extend their premises or to construct or purchase new premises.  Capital funding allocated to the early learning and childcare sector under the National Development Plan has enabled significant investment in early learning and childcare. This allows existing Core Funding Partner Services to extend their existing premises or, in the case of community services, to construct or purchase new premises. The Scheme will deliver up to 1,500 full-day care places for 1- to 3-year-olds which will come on stream over the course of 2026.  As announced in the context of Budget 2026, €36 million will be available in 2026 for early learning and childcare capital programmes. This will include acquisitions of new buildings through the State-led early learning and childcare programme, investment in expansion of existing early learning and childcare operators through the Building Blocks scheme and a number of quality initiatives including supports to childminders.  The Programme for Government commits for the first time to provide capital investment to build or purchase state-owned early learning and childcare facilities, to create additional capacity in areas where unmet need exists. State ownership of facilities is a very substantial and significant development and offers the potential for much greater scope to influence the nature and volume of provision available and to ensure better alignment with estimated demand.  The Department funds 30 City/County Childcare Committees, which provide support and assist families and early learning and childcare providers. The network of 30 City/County Childcare Committees across the country can assist in identifying vacant places in services for children and families who need them and engage proactively with services to explore possibilities for expansion among services, particularly where there is unmet need.  Parents experiencing difficulty in relation to their early learning and childcare needs should contact their local City/County Childcare Committee for assistance. Contact details for the Waterford County Childcare Committee may be found at [ https://cccw.ie ].  Current data on childcare capacity at county level is available at www.pobal.ie/childcare/capacity/ ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Children",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_760",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 804. Deputy Conor D. McGuinness asked the Minister for Health if additional physical space would be provided to the rheumatology outpatient department at Cork University Hospital as the current lack of adequate infrastructure is creating significant challenges for both patients and staff; and if she will make a statement on the matter. [65180/25] ",
        "debateSection": {
          "showAs": "Hospital Facilities",
          "debateSectionId": "dbsect_717",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_717",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_717.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Conor D McGuinness",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Conor-D-McGuinness.D.2024-11-29",
          "memberCode": "Conor-D-McGuinness.D.2024-11-29"
        },
        "questionNumber": 804,
        "answerText": " Minister for Health  As the Health Service Executive is responsible for the management of the public healthcare estate, I have asked the HSE to respond to you directly in relation to this matter. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_804",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    }
  ]
}