{
  "head": {
    "counts": {
      "questionCount": 3676,
      "resultCount": 3676
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Deputy Ged Nash  It is a year since the new Dáil met and almost 11 months since the new Government was formed, yet we still do not have the medium-term economic plan that this Government is obliged to submit to Brussels. The media were briefed earlier this week that the Cabinet would approve the plan on Tuesday. Is that the case? Has the plan been approved and when will it be published? \n Deputy Simon Harris  Yes, it has been approved and it will be published tomorrow. I am very happy, of course, to provide any advices or technical briefings that are required by Opposition spokespeople early in the new year, whenever required and in the appropriate forum. The medium-term fiscal structural plan will be published tomorrow. In line with all relevant European regulations and procedures, the plan will be submitted to the European Commission shortly thereafter. Although each member state has discretion over the content of its medium-term fiscal structural plan, MTP, information is required on three core elements: the fiscal strategy; investment plans; and structural reforms. Of these, the fiscal strategy is clearly the key component. As Deputy Nash is aware, the medium-term plan is a highly consequential document. It required considerable thought and analysis. The plan will reflect current macro-economic conditions as well as Government decisions and priorities.  The merit of medium-term fiscal planning is clear for a number of reasons, and I do not need to convince anyone of that. It provides clarity, it prevents in-year drift, and medium-term plans can help mitigate the vulnerability of Ireland's tax revenue base. Likewise, medium-term planning can also assist in preparing the public finances for fiscal challenges facing the Irish economy, such as the impact of population ageing, as we see in the Future Forty report we published last month, and crucially a credible medium-term strategy provides certainty on the domestic budgetary policy stance that can help boost private sector spending on capital investment.  This plan will set out the Government's economic and budgetary strategy for the remainder of this decade, with a clear objective to support further sustainable gains in living standards for all in the years ahead. \n Deputy Ged Nash  There is simply no valid reason this plan has been delayed for several months. We were told to expect this plan in the summer. We expected to see it before the budget. We did not see it before the budget. I think at this point, politics and media management is getting in the way of the publication of the plan. It will be published tomorrow. That is an interesting and important point. It should have been published this week so the Dáil would have been able to scrutinise and interrogate the plan and have a full debate on it. It is not an abstract plan. It will affect every person, every business and every citizen of this country over the next four to five years. There is, unfortunately, a pattern here when it comes to fiscal management and the production of data. We in the Opposition all expressed concerns, for example, about the reliability of the information received on existing levels of service before the budget. There were no spending review papers this year. We have a range of different concerns. It is not acceptable to me that on the day of the recess, we are being told that a publication of this importance is being published when the Dáil rises. \n Deputy Simon Harris  I take the point. It would have been optimum to have an opportunity to debate it before the recess. We did make an intentional decision not to publish this earlier in the year. I was not the Minister of Finance but I was involved in the decision as a party leader. The rationale behind it, which I think was correct, was to wait and see what the international environment looked like from a tariff point of view. There was different debate and different commentary on this and we decided to publish a summer economic statement that had a one-year horizon. This was different from previous years. We decided to publish the budget. When there was a degree of trade certainty - insofar as there ever is in this world - or certainly more than there was earlier in the year, it gave us more confidence to publish a fiscal strategy that is a binding document. There will be plenty of time for the Oireachtas to interrogate it. I am very happy for Opposition spokespeople on finance to be provided with any briefings they require. It did need to go to the Cabinet this week. It went to Cabinet and it will be published this week too. \n Deputy Ged Nash  The Minister has laid out the principles of what we can expect to see tomorrow. We knew that already. We understood that. Those of us who are members of the Oireachtas Committee on Budgetary Oversight met with the Irish Fiscal Advisory Council, IFAC, this week. I know the Tánaiste met with them when he was appointed. \n Deputy Simon Harris  I did. \n Deputy Ged Nash  They were, rightly, scathing about this Government's approach to budgeting. They said that the Government was budgeting like there was no tomorrow. The Tánaiste acknowledged there are no forecasts or horizons beyond next year. That is no way to budget. Our view in Labour is that key to this plan is that we should be prepared to reflect on the plan. Perhaps the Tánaiste can confirm to the House this afternoon whether the plan will include the commitment to the introduction of a net spending rule, net of tax changes. That would be really important. The Tánaiste will recall that the previous Government introduced collectively a spending rule of 5%.  That rule was more honoured in the breach. It was not based on any evidence at all or anchored in any plan. We should move to multi-annual budgeting in order to give those who are planning public service provision more certainty. Will the Minister commit to multi-annual budgeting in the plan tomorrow and to the introduction of a net spending rule? In other words, net of tax changes. \n Deputy Simon Harris  Without being smart, it depends on how you define multi-annual budgeting. What this will enable us to do is set out a horizon for spending levels out to the end of the decade. That provides greater certainty for the Department of public expenditure and others to engage multi-annual funding, which interestingly is something IFAC is very supportive of. It made a very positive difference when we introduced it in health for a two-year period. I met representatives from IFAC. I do not wish to speak for the council, but its main requirement is that the Government should set out a medium-term plan and stick to it. I think I am correctly paraphrasing what was said. Governments can decide what the level of spending should be, but IFAC's concern - and, certainly, what I took from it - is that it is important that when the Government publishes a medium-term plan, it sticks to it. There is a requirement for a net expenditure growth path. Net primary spending is a technical definition of public expenditure defined as general government spending adjusted for interest expenditure, discretionary revenue measures, expenditure on programmes matched or co-financed by the European Union, cyclical elements of unemployment benefit and one-off temporary expenditure items outside the control of government. There will be a commitment to that in the plan tomorrow. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 169. Deputy Ged Nash asked the Tánaiste and Minister for Finance the contents of the Government’s medium-term economic framework; the reasons for the delay in producing the plan; and if he will make a statement on the matter.  [73642/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "showAs": "Ged Nash"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_35",
          "debateSectionId": "dbsect_35",
          "showAs": "Economic Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_35.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_169",
        "questionNumber": 169
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  In order to plan for school provision and analyse the relevant demographic data, my department divides the country into 314 school planning areas (SPA) and uses a geographical information system, using data from a range of sources, including CSO census data, child benefit and school enrolment data, to identify where the pressure for school places across the country will arise and where additional school accommodation is needed at primary and post-primary level.  Major new residential developments have the potential to alter the demand for school places at a local level. In that regard, as part of the demographic demand analysis, my department monitors planning and construction activity in the residential sector. This involves the analysis of data sources from local authorities and the CSO along with the engagement with local authorities and the construction sector. In this way, up-to-date information on significant new residential developments is obtained and factored into the demographic analysis exercise. This is necessary to ensure that schools infrastructure planning is keeping pace with demographic changes, at a local level, where there is a constantly evolving picture with planned new residential development.  Where demographic data indicates that additional provision is required, the delivery of such additional provision is dependent on the circumstances of each case and may, be provided through:  • Utilising existing unused capacity within a school or schools,  • Extending the capacity of a school or schools,  • Provision of a new school or schools.  If additional accommodation is required, the aim to try and facilitate this, as much as possible, by way of expansion of existing schools rather than establishing new schools. The expansion of existing schools is consistent with wider Government objectives under Project Ireland 2040 for an increased emphasis on compact growth. In respect of post primary schools, new post primary schools must have a student enrolment capacity of 600-1,000 students and must be co-educational. A lower threshold of 400 students may apply to gaelcholáistí, having regard to the alternative of establishing an Irish-medium unit (aonad) in an English-medium school.  New schools are only established in areas of demographic growth as the resources available for school infrastructure have to be prioritised to meet the needs of areas of significant population increase so as to ensure that every child has a school place.  There is a significant post primary school project, Drogheda Educate Together Secondary School at Stage 2B (Detailed design stage) to deliver a new 1,000 pupil school. Any future shortfall in capacity required to meet the demand for post primary schools can be catered for in the existing post primary schools.  Details of large-scale projects being delivered under the school building programme may be viewed on my department's website at www.gov.ie and this information is updated regularly. In addition, a list of large-scale projects completed from 2010 to date may also be viewed on the website.  Based on analysis undertaken, it is deemed that there is not a sufficient unmet demand in the Drogheda SPA to establish a new post primary school.  The pace of delivery of additional residential developments, along with updated enrolment data and demographic data will be kept under review and this will inform the timing of further school requirements across school planning areas. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 461. Deputy Ged Nash asked the Minister for Education and Youth if she is aware of the extensive population growth on the north side of Drogheda; if her Department has any plans to develop a new second-level school to address the needs of the area or to extend existing secondary schools in the area; and if she will make a statement on the matter. [73533/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "showAs": "Ged Nash"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_437",
          "debateSectionId": "dbsect_437",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_437.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_461",
        "questionNumber": 461
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  I propose to take Questions Nos. 276 and 309 together.  Planning and Development Act (Exempted Development) Regulations 2022, provides an exemption from the requirement for planning permission for the conversion of certain types of vacant commercial property into residential use, such as ‘living over the shop’ accommodation and conversion of vacant pubs, up to a maximum of 9 residential units. Article 10(6) of the 2001 Regulation sets out the provisions exempting change of use from vacant commercial units to residential units.  Regulations providing for an extension until 31 December 2028, of the exemption for conversion to residential use set out under S.I. No. 75 of 2022, were before the Joint Oireachtas Committee on Housing on 09 December 2025. Following the anticipated receipt of positive resolutions of both Houses of the Oireachtas, as required under section 262(4) of the Planning and Development Act 2000, as amended, I, as the Minister of State with responsibility for Planning, will sign the regulations into law at the earliest opportunity once finalised. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 309. Deputy Ged Nash asked the Minister for Housing, Local Government and Heritage if he plans to further extend the Article 10(6)(a) exemptions under the Planning and Development Regulations 2001 (as amended), which are due to end on 31 December 2025; and if he will make a statement on the matter. [73121/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "showAs": "Ged Nash"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_256",
          "debateSectionId": "dbsect_256",
          "showAs": "Planning Issues",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_256.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_309",
        "questionNumber": 309
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  The query raised by the Deputy is an operational matter for Iarnród Éireann. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 346. Deputy Ged Nash asked the Minister for Transport if Irish Rail is aware that car parks at both Drogheda and Dundalk train stations are at full capacity from approximately 7.15am on weekdays; if, given the improvements to the frequency of commuter and Enterprise services and the roll out of the Dart service, and the fact that there are no plans under the revised NDP to open either a new North Drogheda station, or to reopen the station at Dunleer, County Louth, if he will work with Irish Rail to provide better access to parking for rail users to encourage more customers to avail of expanded services; and if he will make a statement on the matter. [72433/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "showAs": "Ged Nash"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_253",
          "debateSectionId": "dbsect_253",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_253.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_346",
        "questionNumber": 346
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 450 and 451 together.  Tackling educational disadvantage and helping students reach their full potential is a key priority for me as the Minister for Education and Youth and for Government. Currently, the DEIS programme supports almost 1,200 primary and post-primary schools, reaching approximately 260,000 students, with an annual investment of over €180 million. Budget 2026 allocates an additional €16.5 million in 2026, rising to €48 million in 2027, to support the implementation of the new DEIS Strategy and introduce the DEIS Plus scheme, which will commence in 2026.  A new DEIS Strategy, which will include the DEIS Plus scheme, will be published early in 2026. The DEIS Plus scheme will provide additional support to schools with the highest levels of need, in line with the Government’s commitment. It will target a cohort of schools with high concentrations of children and young people experiencing intergenerational disadvantage where there is a significant gap in outcomes and there are barriers to those children and young people achieving their potential.  Schools will not be required to apply for inclusion in the DEIS Plus scheme. The process to identify schools for inclusion will be evidence-informed, using available data. The Pobal HP deprivation index will be one element of this.  The details of the DEIS Plus scheme are currently being finalised within an overall programme of work to tackle educational disadvantage and will be outlined in the new DEIS Strategy. Future allocation of overall resources will be considered within the context of the new DEIS Strategy and the availability of resources. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 450. Deputy Ged Nash asked the Minister for Education and Youth the details of the eligibility criteria for inclusion in the new DEIS Plus programme; if the principal criteria to be applied will be the Pobal Deprivation Index and other small area data sets; and if she will make a statement on the matter. [71674/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "showAs": "Ged Nash"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_340",
          "debateSectionId": "dbsect_340",
          "showAs": "Educational Disadvantage",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_340.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_450",
        "questionNumber": 450
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 450 and 451 together.  Tackling educational disadvantage and helping students reach their full potential is a key priority for me as the Minister for Education and Youth and for Government. Currently, the DEIS programme supports almost 1,200 primary and post-primary schools, reaching approximately 260,000 students, with an annual investment of over €180 million. Budget 2026 allocates an additional €16.5 million in 2026, rising to €48 million in 2027, to support the implementation of the new DEIS Strategy and introduce the DEIS Plus scheme, which will commence in 2026.  A new DEIS Strategy, which will include the DEIS Plus scheme, will be published early in 2026. The DEIS Plus scheme will provide additional support to schools with the highest levels of need, in line with the Government’s commitment. It will target a cohort of schools with high concentrations of children and young people experiencing intergenerational disadvantage where there is a significant gap in outcomes and there are barriers to those children and young people achieving their potential.  Schools will not be required to apply for inclusion in the DEIS Plus scheme. The process to identify schools for inclusion will be evidence-informed, using available data. The Pobal HP deprivation index will be one element of this.  The details of the DEIS Plus scheme are currently being finalised within an overall programme of work to tackle educational disadvantage and will be outlined in the new DEIS Strategy. Future allocation of overall resources will be considered within the context of the new DEIS Strategy and the availability of resources. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 451. Deputy Ged Nash asked the Minister for Education and Youth if a school (details supplied) will be included in the new DEIS Plus programme; and if she will make a statement on the matter. [71675/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "showAs": "Ged Nash"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_340",
          "debateSectionId": "dbsect_340",
          "showAs": "Educational Disadvantage",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_340.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_451",
        "questionNumber": 451
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The major project for the school referred to by the Deputy is currently at Architectural Planning Stage 3 – Tender Action and Award.  The brief for the project is the development of a new 20 Mainstream Class primary school plus 4 classrooms for pupils with Special Educational Needs, along with one Home School Liaison Room (HSCL) on existing site.  My Department is currently reviewing Tender report no. 2 which is subject to due diligence by my Department which is a critical part of the overall completion of the Stage 3 process and is critical to ensuring quality and value for money.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 456. Deputy Ged Nash asked the Minister for Education and Youth if her Department has received proposals from a school (details supplied) in County Louth proposing internal modifications to the proposed new buildings; if she is aware of the fact that the new school building has been in process for several years; if she will include the project in her Department’ Sectoral Plan under the revised NDP; and if she will make a statement on the matter. [71753/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "showAs": "Ged Nash"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_345",
          "debateSectionId": "dbsect_345",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_345.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_456",
        "questionNumber": 456
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The project referred to by the Deputy has been devolved for delivery to Louth County Council.  The brief for this major school building project is to provide an 8-classroom school with an additional 4 classroom Special Educational Needs (SEN) base included. The project has been devolved for delivery to Louth County Council.  The project is currently at stage 4 (construction) of the delivery process. The length of time a project takes to deliver depends on several factors, including scale and complexity and is subject to the time it takes to progress through the various design stages, and the statutory approval process.  The Department has been actively engaged with the Design Team and Louth County Council throughout the process and will continue to engage to provide practical advice and assistance on this important project.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects.  In addition, repurposing and optimisation of existing accommodation capacity across the school estate has been a key enabler of timely, local provision of special class capacity in a way that supports best practice in inclusion and integration. Circa 80% of new special classes in 2025/26 are being facilitated in repurposed classroom accommodation.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 499. Deputy Ged Nash asked the Minister for Education and Youth if the building unit in her Department will engage with Louth County Council in relation to a school build (details supplied); and if she will make a statement on the matter. [72345/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "showAs": "Ged Nash"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_389",
          "debateSectionId": "dbsect_389",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_389.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_499",
        "questionNumber": 499
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The school building project referred to by the deputy will provide a new 1000 pupil post-primary school building and accommodation, including classrooms for children with special educational needs.  Department officials and the external project management consultants are currently reviewing the works and site-specific requirements to ensure the tender documents are up to date and in line with my Departments’ technical guidelines documents.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs  The Department will continue to keep the school and its patron body updated as the project progresses. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 528. Deputy Ged Nash asked the Minister for Education and Youth when the construction of a new school building project will commence (details supplied); and if she will make a statement on the matter. [72564/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "showAs": "Ged Nash"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_411",
          "debateSectionId": "dbsect_411",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_411.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_528",
        "questionNumber": 528
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  My Department is in the process of commencing the Planning and Development Act 2024 (Act of 2024) on a phased basis, to facilitate the transition to the new legislation across the planning system and taking into account the need to liaise with local authorities, planning bodies and other stakeholders. A detailed implementation plan is available at www.gov.ie/planning .  A priority is the full commencement of Part 3 – Plans, Policies and Related matters of the 2024 Planning and Development Act. Work on commencing all sections of the Part is well advanced and I intend that Part 3 will be fully commenced by year end. This includes new provisions with respect to Development Plans.  I am aware of the need to allow Local Authorities to be capable of extending their current Development Plans for a period of time to assist and facilitate the smooth transition to the new Planning and Development Act. In this regard, on 26 November 2025, I received Government approval to draft the General Scheme of a Bill to make further legislative amendments to planning legislation. One element of the General Scheme relates to provisions that will allow planning authorities to extend the development plans that are currently in force and ensuring that future full development plan reviews are carried out only under the Act of 2024. I intend to progress the drafting of this Bill as a matter of urgency. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 564. Deputy Ged Nash asked the Minister for Housing, Local Government and Heritage when he will sign the planned secondary legislation to allow local authorities to have their County Development Plans to be extended for a short period beyond 2027; and if he will make a statement on the matter. [71676/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "showAs": "Ged Nash"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_445",
          "debateSectionId": "dbsect_445",
          "showAs": "Local Authorities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_445.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_564",
        "questionNumber": 564
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  My Department is currently undertaking a review of jury service, which is informed by research on the topic including the Law Reform Commission’s Report on Jury Service, submissions made by stakeholders including the Bar Council and Law Society, as well as legislative and policy developments in related areas over the past number of years.  All aspects of jury reform, including the issues raised by the Deputy, will be considered as part of this process. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 715. Deputy Ged Nash asked the Minister for Justice, Home Affairs and Migration if he will consider introducing a scheme to allow the Courts Service to provide reasonable expenses to cover the cost of travel for citizens selected for jury duty; and if he will make a statement on the matter. [71931/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "showAs": "Ged Nash"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_565",
          "debateSectionId": "dbsect_565",
          "showAs": "Courts Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_565.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_715",
        "questionNumber": 715
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The Public Service Management Act 1997 (\"the PSMA\") was introduced to provide a statutory underpinning for the Strategic Management Initiative. It provided for a new management structure for the Civil Service to enhance the management, effectiveness and transparency of the operations of Departments of State and certain other offices of the Civil Service. The PSMA must also be viewed in the context of the wider suite of accountability and transparency measures in the Civil and Public Service taken at the same time and in the years since its enactment. This includes all of the legislation in the areas of Freedom of Information, Ethics in Public Office and Regulation of Lobbying, and the range of budgetary and expenditure reforms.  Specifically in relation to expenditure, as the Deputy may be aware, earlier this year, I committed to carrying out a review of Public Financial Procedures (PFP) with a view to further enhancing accountability in regard to public expenditure management and ensuring value for money in government decision making. This review process is underway. The Review of the PFP is about understanding what supports and structures can help to deliver accountability and performance improvements in:  • budgetary discipline within the limits voted by Dáil Éireann;  • clarity around accountability and financial responsibility to Government and the Oireachtas;  • how financial accountability rules enable responsible delivery; and  • evidence based expenditure decisions.  The review process and updated PFP and related supports will look to better assist Accounting Officers, Finance Officers and other expenditure officials over programmes carry out their duties. It will also assist parliamentarians to better understand where responsibility and accountability lie on questions of value for money and budgetary management that will support scrutiny by the Oireachtas of spending decisions and compliance with governance requirements. The updated PFP should ensure that all officials who are responsible for public expenditure are clear in terms of their personal and legal accountability for budgetary discipline. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 50. Deputy Ged Nash asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if he is considering modernising the framework of accountability for senior civil and public servants as regards their operational and policy delivery responsibilities and performance; and if he will make a statement on the matter. [70847/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "showAs": "Ged Nash"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_91",
          "debateSectionId": "dbsect_91",
          "showAs": "Civil Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_91.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_50",
        "questionNumber": 50
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Localised flooding issues are a matter, in the first instance, for each Local Authority to investigate and address, and Louth County Council may carry out flood mitigation works using its own resources. The Council may apply to the OPW for funding for flood mitigation works under the OPW's Minor Flood Mitigation Works and Coastal Protection Scheme. This scheme was introduced by the OPW on an administrative, non-statutory basis in 2009. The purpose of the scheme is to provide funding to Local Authorities to undertake minor flood mitigation works, or studies to address localised flooding and coastal protection problems within their administrative areas. The criteria for the Minor Flood Mitigation Works and Coastal Protection Scheme are currently under review, and any application under the scheme will be considered against revised criteria. The OPW expect to advise Local Authorities of the revised criteria for the Scheme in the coming weeks.  The OPW does not currently have any application under the Minor Flood Mitigation Works and Coastal Protection Scheme for the location referenced in this question. Since 2009, the OPW has approved funding under the Minor Flood Mitigation Works and Coastal Protection Scheme of some €1.9 million to County Louth for some 26 projects.  The Scheme Viability Reviews (SVRs) for Annagassan and Termonfeckin have been completed. As the SVRs for these areas concluded that potentially viable Flood Relief Schemes have been identified, these areas will be brought forward as Flood Relief Projects in due course, through the second tranche of schemes. The OPW will discuss with Louth County Council the optimal means for progressing Flood Relief in these areas. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 60. Deputy Ged Nash asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the position regarding the management of flooding at Seapoint, Termonfeckin, County Louth; and if he will make a statement on the matter. [70849/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "showAs": "Ged Nash"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_99",
          "debateSectionId": "dbsect_99",
          "showAs": "Flood Risk Management",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_99.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_60",
        "questionNumber": 60
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I propose to take Questions Nos. 69 and 71 together.  I wish to assure the Deputy that reform of the statutory framework for ethics in public life is a priority for this Government, and we have committed in our Programme for Government 2025, 'Securing Ireland’s Future', to update the legislation that underpins it. However, this policy area remains a complex one, and careful consideration is required before I can bring forward detailed proposals for legislative reform.  As the Deputy mentions in his question, my Department has already prepared the ground with a comprehensive review of the ethics legislative framework. This was undertaken during the life of the last Government and the Report and findings were published in February 2023. The Report's recommendations include that the legislative framework for ethics should be underpinned by a set of integrity principles; that disclosure requirements should be strengthened to improve transparency; and that consideration should be given to whether the regime should encompass more office holders. The Report also recommends a strengthening of the Standards in Public Office Commission (SIPO). Certain, more recent, recommendations in relation to ethics will also need to be considered in the context of the reform agenda.  A variety of operational and policy considerations flow from this. I am conscious that this represents an opportunity to make real and meaningful, long-term change to our current regime and I wish to ensure that this happens in a way that is both coherent from a policy perspective and user-friendly from an operational perspective.  Given their significance, I will examine the outstanding policy issues with care and engage with my officials to determine the most appropriate way to deliver on our Programme for Government commitment in this area. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 69. Deputy Ged Nash asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation his plans to reform ethics legislation; and if he will make a statement on the matter. [70848/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "showAs": "Ged Nash"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_108",
          "debateSectionId": "dbsect_108",
          "showAs": "Ethics in Public Office",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_108.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_69",
        "questionNumber": 69
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The Government is committed to ensuring access to affordable, quality early learning and care (ELC) and school-age childcare (SAC), and has demonstrated this commitment through an investment of €1.48bn in the 2026 budget.  One of the primary vehicles for the delivery of this investment is Core Funding, the supply-side payment to support the operating costs of services in the early learning and care sector. A service’s Core Funding grant is designed to support the costs of:  • Staff pay and conditions, including contact and non-contact time, holiday pay, sick pay and other employer costs  • Administrative staff/time  • Non-staff overhead costs  For the 2025/2026 programme year, €45 million has been ringfenced to support employers in meeting the costs of further increases to the minimum rates of pay for staff across the sector.  An allocation of €405 million for the Scheme was secured in Budget 2026. This is an increase of €52 million on the 2025 allocation of €353 million – representing a 15% year-on-year increase and a 56% increase over the initial 2022 allocation of €259 million.  In addition, €20.6 million in brand new funding for a full programme year has been secured to support providers in adhering to the Scheme’s fee management conditions including reductions in the maximum fee caps in the 2026/2027 programme year. This will guarantee that Core Funding’s monetary protections will continue to be passed on to families while ensuring sustainability and stability for the sector.  Department has also made changes to improve the sustainability of providers through, for example, targeted measures for small and sessional services, and a fee increase assessment process for services with fees frozen at unsustainably low rates last year.  The 2025/2026 Core Funding Partner Service Funding Agreement includes provisions for the undertaking of a further Fee Increase Assessment-type exercise, which will seek to support the ongoing viability of services where fees are particularly low.  The details of this undertaking are being developed by the Department and as part of this development, every effort will be made to carefully manage the potential out-of-pocket expenses to families occasioned by this policy.  It should be noted that, as with 2024/2025 Fee Increase Assessment, the new exercise will be designed to identify and support those services whose fees may have been frozen at a very low level. The details of the 2025/2026 fee increase process will be communicated to the sector once finalised.  Partner Services facing sustainability concerns can also avail of supports through the Department’s established case management process, through which local City and County Childcare Committees and Pobal work together to assess and provide support including financial support to services experiencing difficulties.  All services are encouraged to avail of these supports if they are facing difficulties with the sustainability of their business. Contact details for the CCCs can be found at the City and County Childcare Committees page on gov.ie. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 286. Deputy Ged Nash asked the Minister for Children, Disability and Equality when the fee increase and assessment process will be open for application for eligible childcare providers and partner services who are in the core funding scheme in Louth and elsewhere; and if she will make a statement on the matter. [70640/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "showAs": "Ged Nash"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_231",
          "debateSectionId": "dbsect_231",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_231.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_286",
        "questionNumber": 286
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Deputy Ged Nash  A welcome announcement at least was made in the budget in October that this Government would plan to transfer responsibility for collecting derelict sites levies to the Revenue Commissioners and, from then on, the levy would be known as a tax, given the fact that it would be collected by the Revenue Commissioners. This is a welcome development and something for which I have been campaigning and advocating for many years. One of the key things in this regard is that the revenue collected ought to be dispersed directly back to the local authorities involved. The Minister might advise on the position in that regard and what he plans to do to legislate for this announcement that was made in budget 2026. \n Deputy Simon Harris  I thank Deputy Nash for the question. First, we share the same view on the importance of this derelict property tax. In a housing emergency, which we are in, every lever must be used. Having a tax that targets derelict properties is an important one. There is a significant body of work to do, however. I do not say this to in any way cast aspersions but I am conscious that local authorities will have an important role in this regard because when you are moving from a levy to a tax, the importance of consistency will be really important in being able to underpin any tax collected by the Revenue Commissioners.  As the Deputy said, in this budget we announced the introduction of a new derelict property tax. The aim of this tax is to encourage the activation of derelict properties and sites. In fact, not having to collect much money from this tax would ultimately be a good thing if we can change behaviour and get derelict sites and properties back into use. This will replace the derelict sites levy and it will be collected by the Revenue Commissioners. In order for the new tax to be successful on introduction, care has to be taken in its design. A key issue is that the tax must apply in a consistent manner to all residential properties and sites that are derelict. Therefore, a lead-in time will be required for our local authorities to identify all the relevant derelict properties in their areas for inclusion on a register in a consistent manner.  I intend to legislate for the derelict property tax in 2026. This is dependent on engagement from stakeholders. It will also be influenced by any advice I receive from the Attorney General. The timeline of bringing in the legislation in 2026 is necessary to allow local authorities to prepare and publish a preliminary register of derelict properties in 2027, with the tax coming into effect as quickly as possible thereafter. The yield from the derelict property tax will accrue to the Exchequer. That is the current intention. As the Deputy will appreciate, replacing the current levy with a new tax is a complex process. There is much detail that remains to be worked through regarding the operation of the new tax. I will be in a position to provide further information over the course of next year in advance of the tax being legislated for. I genuinely look forward to engaging with Deputies on the design of the tax through the legislative process. \n Deputy Ged Nash  There is concern at official level in local authorities that it may not be the case that the revenue collected will be dispersed directly back to the local authorities where the subject sites are present. The Minister will understand those concerns. I draw some analogies between the transfer of the household charge, which the Minister will recall from the early 2010s, to the local property tax and how compliance improved. In fact, the transformation of the household charge to the property tax was quite successful from a collection point of view, looking at the compliance figures compared to the collection of the household charge, which was the responsibility of the local authorities at that point in time. It was for good reason that responsibility was transferred. It was done expeditiously and efficiently in a short period of time. Given the fact that we have derelict sites registers available to local authorities across the country, although they may need to be finessed, I do not accept for a minute, given the urgency of this matter, that we ought to wait until 2027 until Revenue has responsibility for collecting these charges. \n Deputy Simon Harris  I appreciate the past examples. I remember soldiering on some of them together in past iterations of government. We need to get this right, however. My predecessor announced that timeline on budget day. I think we will all agree that we actually do not want to collect much revenue from the tax. Rather, we want people to take derelict properties and sites and put them back into use. The purpose of making the budget day announcement, albeit with the lead-in time, was to make it clear to people in this country that if they are sitting on a derelict property or site in a housing emergency, we intend to tax that reality. We intend to do it through the Revenue Commissioners because, as the Deputy rightly said, the Revenue Commissioners are good at collecting tax. That is what we intend to do because, in a housing emergency, we cannot tolerate this situation.  Currently, the derelict site levy is an annual levy of 7% of the land’s market value. While the rate of the derelict property tax is yet to be determined, I will say to the House that it certainly will not be lower than the current 7%. The primary goal will not be to raise revenue but, rather, to encourage owners of derelict properties to bring them back into use. We want to do this as quickly as possible but we also have to make sure it is consistent with all the principles expected in a new tax. \n Deputy Ged Nash  The Minister will know how this works. He will know about the ineffective nature of the Derelict Sites Act and the need for reform in that space. When a local authority identifies an owner of a derelict site or property and, after due process, decides to place that site on a register, the individual may decide to contest that. It then becomes complicated. He or she may potentially challenge the designation of a derelict site through the courts and communities become frustrated.  Dereliction itself is an absolute scourge, regardless of the housing disaster we are experiencing at the moment. It is a public health matter. In fact, the Scottish Administration has designated dereliction as a public health issue, and for very good reasons. The reality is that the Revenue Commissioners are the best-placed agency to collect a levy that will be transformed into a tax for a number of different reasons. Any business owner I know needs to sweat every asset they have. If it is a case that somebody is wealthy enough to be able to preside over a derelict site without using that site to generate some revenue, they must have very deep pockets. Of course, if Revenue is collecting your tax and you are not compliant, then you cannot run your businesses. I get what the Minister is saying in terms of that disincentive piece, which is important, like the vacant homes tax. It is not about collecting tax; it is about incentivising use. I ask and urge the Minister to look again at ensuring the revenues generated and collected are returned to local authorities like the local property tax, by and large. \n Deputy Simon Harris  I genuinely am eager to engage on the design and construct of the new tax and we will have an opportunity to do that through the legislative process. I do also genuinely take the point around the urgency of this, and the Government genuinely does too, but we also have to just make sure we get it right. I am conscious there are local authorities around the country that do very a good job and that are also very busy. This is quite an important and big project for them because we have to have a consistency in terms of this. It cannot be a case of County Wicklow doing one thing in relation to a derelict site levy and County Louth doing another. That is a levy collected by the local authorities. Once this becomes a national tax there has to be that consistent approach.  I agree with the Deputy about dereliction and the housing emergency, absolutely, but dereliction more broadly is a real issue. We will get to some of this later as well, but this is why we have made some changes, for example with the living cities initiatives and the like to try and bring derelict properties back into use, particularly on main streets with over-the-shop schemes as well. ",
        "questionType": "oral",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 2. Deputy Ged Nash asked the Tánaiste and Minister for Finance the details of and timeline for the production of legislation to empower the Revenue Commissioners to implement the proposed new derelict sites tax; if all of the revenue collected will be disbursed to the relevant local authorities; and if he will make a statement on the matter. [65023/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "showAs": "Ged Nash"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/debate/dbsect_14",
          "debateSectionId": "dbsect_14",
          "showAs": "Derelict Sites",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/debate/mul@/dbsect_14.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_2",
        "questionNumber": 2
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for students with special educational needs.  I understand that this earlier date of 1 October for the Parents Notify process does not suit every family. However, this earlier date was introduced to support forward planning and to equip the NCSE with timely local information on students who are seeking a specialist placement on entering the education system for the first time, who are transitioning to post-primary specialist places or leaving school.  This information is critical in matching the location of special provision to known demand. The earlier date coincides with when schools begin enrolment processes. Many mainstream schools, particularly at post-primary level commence admissions processes for the following school year on 1 October. It therefore provides parents with an opportunity to enrol in existing classes.  The NCSE aims to sanction the majority of new special classes for the 2026/27 school year by 31 December 2025, four months earlier than last year. This will bring a level of clarity and certainty to both parents and schools as to where new classes will be located. It will also afford greater lead in times for schools that require repurposing or major building works to get works complete and allow schools to recruit staff and undertake the training needed so that children are fully supported in these placements.  While there are very valid reasons for the earlier closing date, it is also important that those who come forward after that date are assured that they are not forgotten or excluded.  I would like to stress that the NCSE will continue to support all children made known to them after the October deadline. However, it is critical that the NCSE has as much local information as possible as early as possible to effectively plan new provision.  For the 2025/26 school year the NCSE advise that a small number of special class places remain in every county in the country for those still seeking placement. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 385. Deputy Ged Nash asked the Minister for Education and Youth if her attention has been drawn to an issue caused by the lack of a late application process for notifying the NCSE of a child’s requirement for a place in a special class or school, and that parents who were not aware of the notification process or had a children born after the 30 September deadline are being left without a way to enrol their child in school for September 2026; the plans to deal with these cases; and if she will make a statement on the matter. [69097/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "showAs": "Ged Nash"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_345",
          "debateSectionId": "dbsect_345",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_345.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_385",
        "questionNumber": 385
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Ireland remains consistent in our support of multilateralism and enabling an inclusive international system that delivers concretely for the poorest, the marginalised and most vulnerable to ensure that no-one gets left behind.  The Government endorsed the ‘Compromiso de Seville’ at the Fourth International Conference on Financing and Development (FfD4) which was attended by the Minister of State for International Development and Diaspora, Neal Richmond TD last July.  My Department supported the FfD4 ambition to renew the global financing framework for sustainable development and to build on the outcomes of previous International Conferences on Financing for Development. Public resources, policies and plans are at the heart of our efforts for a sustainable development investment drive.  The outcome document addresses a range of action areas, including Official Development Assistance, the role of domestic public resources and Beneficial Ownership transparency.  In relation to the Official Development Assistance (ODA), while we must acknowledge that it will never be enough to deliver the Sustainable Development Goals (SDGs), it remains a critical financing mechanism for the poorest and most vulnerable communities whom we partner with. Ireland remains committed to working towards the target to provide 0.7% of Gross National Income in ODA and has consistently increased allocations over recent years.  The Department of Finance also strongly supports the role of domestic public resources in financing sustainable development. Domestic resources are essential to close financing gaps and to fund the achievement of the Sustainable Development Goals. Ireland launched its whole of government approach to strengthening Domestic Resource Mobilisation for sustainable development in 2019, establishing a tripartite group of the Department for Finance, the Department of Foreign Affairs and Trade and the Office of the Revenue Commissioners. This Group constructively engages bilaterally and multilaterally with developing countries and provides substantial technical expertise on capacity building on tax administration and policy internationally.  On the specific commitment on Beneficial Ownership transparency, Ireland as an EU member has agreed to the Anti-Money Laundering (AML) Package which includes the 6th Anti-money laundering Directive (6AMLD), the EU Anti-money Laundering Regulation (AMLR), and the establishment of the EU Authority for Anti-Money Laundering (AMLA). Consequently, Ireland is obliged to transpose the Beneficial Ownership elements of the 6AMLD and the AMLR which, inter alia, involves moving towards greater harmonisation and transparency of our national Beneficial Ownership regime in conjunction with our European counterparts. Notably, the 6AMLD and the AMLR build on the previous EU AML Directives and provide for information sharing of Beneficial Ownership information amongst EU Member States and the newly established AMLA through EU Beneficial Ownership and bank account interconnection systems: BORIS and BARIS. These will allow Financial Intelligence Units (FIUs) and Competent Authorities, efficient and timely access to information on the identity of holders of bank accounts and payment accounts, securities accounts, crypto-asset accounts and safe-deposit boxes, their proxy holders, and their beneficial owners.  My Department with the Department of Justice, Home Affairs and Migration are currently working on the transposition of the 6AMLD and AMLR for which there are staggered transposition deadlines. The key upcoming dates include 10 July 2026 for certain aspects of 6AMLD and 10 July 2027 for the majority of 6AMLD and the AMLR. Furthermore, Ireland in conjunction with our EU partners will consider the feasibility of a global Beneficial Ownership register. Money laundering and terrorist financing is a global challenge that necessitates a global response to effectively combat bad actors and protect wider society from criminal activity. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 177. Deputy Ged Nash asked the Tánaiste and Minister for Finance if Ireland supports each of the elements of the ‘Compromiso de Seville’, the outcome document from this summer’s financing for development conference; how the Government is working to implement the commitments made, in particular, the commitment to (details supplied); and if he will make a statement on the matter. [68021/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "showAs": "Ged Nash"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_161",
          "debateSectionId": "dbsect_161",
          "showAs": "Fiscal Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_161.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_177",
        "questionNumber": 177
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Ireland continues to take action to ensure the Irish tax code is in line with new and emerging international tax standards as agreed globally. This includes through our work at the OECD and at the UN where Ireland is actively and constructively participating in negotiations on the UN Framework Convention on International Tax Cooperation.  The United Nations General Assembly has established an Intergovernmental Negotiating Committee (INC) to draft a United Nations Framework Convention on International Tax Cooperation and two early protocols. This work will culminate in a vote of the UN General Assembly in the latter half of 2027. Intersessional meetings are ongoing, on the following three workstreams:  • Framework Convention (Workstream I)  • Early Protocol on the taxation of income derived from the provision of cross-border services in an increasingly digitalised and globalised economy (Workstream II)  • Early Protocol on the prevention and resolution of tax disputes (Workstream III)  The UN INC on International Tax Cooperation held formal plenary meetings in New York in August 2025 and in Nairobi in November 2025. Irish officials participated in these plenary sessions and have been engaging constructively in the process. In between the plenary meetings, Irish officials have taken part in intersessionary virtual meetings and have been providing written feedback to the UN Secretariat and the Co-Leads of the workstreams. The next plenary session will take place in New York in February 2026.  In terms of the specific issues referred to in the question on the taxation of high net worth individuals, tax avoidance and evasion by individuals can undermine the fairness of the taxation system for all. The Government supports efforts to ensure full compliance with domestic tax laws and mechanisms to ensure appropriate transparency standards and exchange of information rules between tax authorities to address challenges in this area. Ireland has one of the most progressive systems of taxes and social transfers of any EU or OECD country.  Developing a global asset registry is an issue that has been raised by civil society organisations as part of the UN tax work. This issue has been recognised as being highly complex and presents technical challenges. Significant technical work would need to be done to examine the feasibility of this proposal further. At present, setting up a global asset registry does not appear to form part of the overall work in developing a United Nations Framework Convention on International Tax Cooperation.  However, we recognise information on beneficial ownership is an important tool in compliance that deserves broad consideration. In recent years there have been international developments on the topic with the OECD Global Forum on Transparency and Exchange of Information for Tax Purposes including beneficial ownership information as part of the exchange of information on request (EOIR) standard. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 178. Deputy Ged Nash asked the Tánaiste and Minister for Finance whether Ireland supports the establishment of a UN convention on taxation; in particular, how Ireland is supporting the issue of taxing high net worth individuals, and the establishment of a global asset registry; and if he will make a statement on the matter. [68022/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "showAs": "Ged Nash"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_162",
          "debateSectionId": "dbsect_162",
          "showAs": "Fiscal Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_162.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_178",
        "questionNumber": 178
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The Department is aware that a small number of service providers have regrettably chosen to withdraw from Core Funding, and pleased to note that Tots & Co have remained in the scheme.  The Department, through County/City Childcare Committees, engages directly with services, to highlight the benefits of staying in Core Funding, not only for their service but also for the families who avail of them. The Minister is hopeful that this provider may reconsider their decision as others have.  As of 3 November 2025, there were 5,035 services listed as being open on the Early Years Platform, of which 177 (4%) had left Core Funding at one point over the lifetime of the scheme to this date and continue to operate outside of this scheme. A further 415 services (8%) had left Core Funding at one point over the lifetime of the scheme to this date but later rejoined and were signed up to the fourth year of the scheme on this date. The overwhelming majority of services, 4,157 or 83%, have continued to participate in Core Funding from the date on which they first signed up for the scheme.  The State is providing Core Funding to promote the interests of children and their families and workers in a privately operated sector.  Tots & Co Playgroup is currently receiving Core Funding for their service. The table below shows that the Core Funding provided to Tots & Co Playgroup has increased from €59,673.44 in year 1 of the scheme to €66,496 in year 4.     Name of provider    2022/2023  Core Funding received    2023/2024  Core Funding received    2024/2025  Core Funding Contract Value (May 2025)    2025/2026  Core Funding Contract Value (5 Nov 2025)    % change in grant value between 2022/2023 and 2025/2026      Tots and Co Playgroup    €59,673.44    €60,086.52    €60,623.68    €66,496.00    11%         While the State cannot mandate providers to participate in the scheme, Core Funding has been designed with maximum participation of providers in mind as reflected in the year-on-year growth of investment in the Scheme (rising from €259 million in 2022 to over €405 million in 2026). This represents an increase of over 56% in Core Funding in four years.  In addition to this increased allocation, participation in Core Funding unlocks additional supports for services to access, including:  • access to wider financial supports where a service is experiencing financial difficulty or has concerns about their viability;  • access to enhanced support for services caring for concentrated numbers of children facing disadvantage through Equal Start; and  • opportunities to apply for capital grants through the Department.  Participation in Core Funding is optional, but it remains open to all registered providers subject to their agreement to the terms and conditions of the Core Funding Agreement.  In addition to the year on year increases in the Core Funding allocation, the Department has introduced a range of other enhancements to the Scheme in recent years to improve protection for families through, for example, new deposit rules and maximum fee caps.  The Department has also made changes to improve the sustainability of providers through, for example, targeted measures for small and sessional services, a fee increase assessment and approval process for services with fees frozen at unsustainably low rates. There are also wider financial supports from the Department for services experiencing financial difficulty.  All services have been encouraged to avail of these supports as an alternative to withdrawing from Core Funding and removing the benefit of Core Funding to children and their families.  For the current programme year, services have the autonomy and business freedom, to withdraw from Core Funding, even though this will result in the loss of the significant financial support it offers them and the substantial benefits and certainty it brings to families.  For this programme year, services remain eligible to provide the National Childcare Scheme, the Early Childhood Care and Education programme and the Community Childcare Subvention Plus Saver programme.  Service providers are required to provide 3 months written notice to families before withdrawing from Core Funding mid-year.  Core Funding remains open to services and uptake remains strong. The fourth year of Core Funding began on 1 September and as of 26 November there were 4,568 services signed up to Year 4 of Core Funding, a near 5 per cent increase on this time last year. This is the highest number of Partner Services in Core Funding at any point since the scheme was launched in 2022 and the number continues to grow.  If parents are experiencing difficulty in relation to their early learning and childcare needs, they should contact their local County/City Childcare Committee for assistance.  The Department has a list of all Core Funding Partner Services which is updated regularly on the Departments website under www.gov.ie/en/department-of-children-disability-and-equality/publications/how-to-find-a-partner-service/ ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 507. Deputy Ged Nash asked the Minister for Children, Disability and Equality if she is aware that a childcare provider in Louth (details supplied) has left the Core Funding system; if additional support can be provided to the operator to ensure they remain within the system and continue to provide early years care to the cohort of families that currently use the service; and if she will make a statement on the matter. [68104/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "showAs": "Ged Nash"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_450",
          "debateSectionId": "dbsect_450",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_450.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_507",
        "questionNumber": 507
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Core Funding is a supply-side grant to providers designed to support quality, sustainability, and affordability for parents through associated conditions in relation to fee control and cost transparency.  Core Funding operates alongside the National Childcare Scheme, the Early Childhood Care and Education programme and Equal Start and constitutes additional income for providers on top of funding for these schemes, as well as income from parental fees.  As of 3 November 2025, there were 5,035 services listed as being open on the Early Years Platform, of which 177 (4%) had left Core Funding at one point over the lifetime of the scheme to this date and continue to operate outside of this scheme. A further 415 services (8%) had left Core Funding at one point over the lifetime of the scheme to this date but later rejoined and were signed up to the fourth year of the scheme on this date. The overwhelming majority of services, 4,157 or 83%, have continued to participate in Core Funding from the date on which they first signed up for the scheme.  The table below provides a breakdown of the services that left Core Funding in each programme year by county division. Some services may have left and rejoined multiple times across the three years, and therefore the figures cannot be aggregated across programme years from the breakdown below.        COUNTY DIVISION      Year 1 (2022/2023)      Year 2 (2023/2024)      Year 3 (2024/2025)      Year 4 (2025/2026)       Cork City    2    4    5    0      County Carlow    0    0    0    0      County Cavan    2    4    4    0      County Clare    5    3    4    0      County Cork    12    15    14    0      County Donegal    12    9    17    0      County Galway    24    30    16    1      County Kerry    5    9    5    0      County Kildare    11    11    7    0      County Kilkenny    0    2    0    0      County Laois    5    3    2    0      County Leitrim    1    0    0    0      County Limerick    6    11    2    0      County Longford    0    1    1    0      County Louth    6    2    3    0      County Mayo    7    12    0    0      County Meath    4    13    16    0      County Monaghan    0    4    1    0      County Offaly    7    2    2    0      County Roscommon    1    4    2    0      County Sligo    0    5    5    0      County Tipperary    12    14    3    0      County Waterford    5    2    2    0      County Westmeath    1    1    1    0      County Wexford    4    11    6    2      County Wicklow    2    12    3    0      Dublin City    17    56    28    0      Dun Laoghaire-Rathdown    8    10    8    0      Fingal    7    29    9    0      South Dublin    9    17    8    0       TOTAL      175      296      174      3        It should be noted that of the services tabulated above, over 70% of services had returned to participate in Core Funding as of 3 November 2025.  When first introduced in 2022, Core Funding brought a significant increase in investment for the sector, with €259 million of funding paid directly to services in first year of the scheme. Investment in Core Funding has continued to increase year-on-year, rising to over €390 million for the fourth, and current, programme year.  Within the Core Funding allocation for the current programme year, €45 million has been ring-fenced to support employers in meeting the costs of further increases to the minimum rates of pay across the sector, as set out under the updated Employment Regulation Orders.  The Department has also made changes to improve the sustainability of providers through, for example, the targeted measures for small and sessional services and a fee increase assessment and approval process for services with fees frozen at unsustainably low rates. Some of the increased measures include:  • The Base Rates for all age groups increasing, with larger increases in funding for places offered to children under the age of three. In short, all providers currently signed up to Core Funding will receive a higher payment going forward to support their day-to-day costs.  • The flat rate for services registered on the Tusla Early Years Register as sessional-only increased from €4,075 to €5,000. This will strengthen supports to sessional-only services, who typically operate for shorter hours per week and fewer weeks per year.  • The minimum Base Rate allocation increased from €8,150 to €14,000. This is the minimum amount of funding a centre-based service will receive through their Base Rate. This ensures a minimum guaranteed income for services. This increase supports smaller services and services operating in rural areas, who may be prone to fluctuations in demand.  Programme Year 5 (2026/2027) will see further investment in Core Funding, with the budget increasing by nearly 11% on the current year 4 allocation. This increases will translate to a full year allocation of at least €436.94 million for Year 5 of Core Funding.  There are financial supports available from the Department where a service is experiencing financial difficulty or has concerns about their viability, which can be accessed through their local City/County Childcare Committee while remaining within Core Funding.  I understand services in isolated rural areas may face challenges due to small local population. As a part of the Case Management process, financial assistance under sustainability funding may be granted in respect of the ongoing operational expenditure and liabilities of a service facing and unable to deal with these challenges. This funding is designed to support the continued provision of ELC/SAC Services Providers in rural communities and encourage efficiency by providing governance and business model supports to support the long-term sustainability and safeguard invest.  As part of the Case Management process, City or County Childcare Committees assist services with issues and difficulties that arise. The County Childcare Committees may refer Core Funding-partner services facing difficulties to Pobal and the Department to be considered for Sustainability Funding.  I would encourage any service experiencing financial difficulty and who would like support to contact their County Childcare Committee to access case management supports. Contact details for the County Childcare Committee can be found online at: https://www.gov.ie/en/department-of-children-disability-and-equality/campaigns/city-and-county-childcare-committees/ ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 508. Deputy Ged Nash asked the Minister for Children, Disability and Equality the plans for any reforms to ensure that rural based early years services remain within the Core Funding system; and if she will make a statement on the matter. [68105/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "showAs": "Ged Nash"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_451",
          "debateSectionId": "dbsect_451",
          "showAs": "Early Childhood Care and Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_451.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_508",
        "questionNumber": 508
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  In total, data from Pobal confirms that, as of 26 November, there are 113 providers operating in Co. Louth – 109 of whom are in receipt of Core Funding – representing a 96.46% county-wide take-up rate of Core Funding.  While the Department cannot mandate providers to participate in the Scheme, every effort has been made to carefully design Core Funding to meet the policy objectives including to achieve high levels of participation by providers.  Participation in Core Funding is optional, but it remains open throughout the year to all registered providers subject to their agreement to the terms and conditions of the Scheme.  In the interest of clarity, transparency and consistent reporting, I have defined a service that left Core Funding as any service that had a gap between contracts for Core Funding of 4 or more weeks. There are a number of reasons why a service might fall into this definition. For example, a service may have withdrawn from the scheme, been removed from the scheme for breach of rules, or experienced a delay in re-contracting following a change of circumstance application or between programme years. Many services have left and later re-joined the scheme. There may be a small number of services who left the scheme and subsequently closed at a later date that are not captured in the figures below.  The table below provides a breakdown of the services in Louth that left Core Funding in each programme year. Some services may have left and rejoined multiple times across the three years, and therefore the figures cannot be summed across programme years from the breakdown below.        COUNTY DIVISION      Year 1 (2022/2023)      Year 2 (2023/2024)      Year 3 (2024/2025)      Year 4 (2025/2026)       County Louth    6    2    3    0       It should be noted that of the 11 services in Louth that have left the scheme at one point, 10 services were contracted to Core Funding as of 3 November 2025 - meaning over 90% of services in Louth who left the scheme at one point have now returned to Core Funding.  The Department does not provide the names of services that have left the scheme. However, the Department has a list of all Core Funding Partner Services which is updated regularly on the Departments website under www.gov.ie/en/department-of-children-disability-and-equality/publications/how-to-find-a-partner-service/. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 509. Deputy Ged Nash asked the Minister for Children, Disability and Equality the number of early years services in Louth that are currently supported through the core funding model; the number of services in the county that left the core funding system in the years 2022 to 2024, and to date in 2025, respectively; if she will provide the names of the services that have left the system in each of the years in question, in tabular form; and if she will make a statement on the matter. [68106/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "showAs": "Ged Nash"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_452",
          "debateSectionId": "dbsect_452",
          "showAs": "Early Childhood Care and Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_452.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_509",
        "questionNumber": 509
      },
      "contextDate": "2025-12-02"
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 215. Deputy Ged Nash asked the Minister for Housing, Local Government and Heritage when he will provide funding to develop a new fire station for Dunleer, County Louth; and if he will make a statement on the matter. [66629/25] ",
        "answerText": " Minister for Housing, Local Government and Heritage  The provision of a fire service in its functional area, including the establishment and maintenance of a fire brigade, the assessment of fire cover needs and the provision of fire station premises, is a statutory function of individual fire authorities under the Fire Services Acts, 1981 and 2003.  My Department supports the fire authorities through setting general policy, providing a central training programme, issuing guidance on operational and other related matters and providing capital funding for equipment and priority infrastructural projects.  Louth County Council has indicated that Dunleer remains their top priority project, and a new fire station at Dunleer is provided for in the Fire Services Capital Programme 2021 - 2025.  The Council submitted a preliminary appraisal to my Department in January 2021. Following examination of the proposal, approval in principle for this project issued on 25 June 2021, along with approval for the Council to appoint a design team and to progress this project to full design and cost plan stage.  Louth County Council is working to finalise the acquisition of their preferred site. Upon final confirmation of the site acquisition, I understand that Louth County Council will move quickly through the necessary phases to progress the construction of a new station for Dunleer. My Department will continue to support Louth County Council to progress the new Dunleer fire station project. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_215",
        "debateSection": {
          "showAs": "Fire Stations",
          "debateSectionId": "dbsect_199",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_199.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_199"
        },
        "date": "2025-11-26",
        "questionNumber": 215,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Ged Nash",
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09"
        },
        "questionType": "written",
        "to": {
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "question": {
        "showAs": " 275. Deputy Ged Nash asked the Tánaiste and Minister for Finance in view of the recent guidance from the Revenue Commissioners which provides employers an opportunity to correct any payroll tax issues arising from the Supreme Court Karshan ruling of 2023, his plans to enforce the Karshan ruling to ensure that all workers who should be classified as employees have such a classification; the means by which he intends to ensure there is a level playing field for those employers who take the opportunity to make these corrections; and if he will make a statement on the matter. [65773/25] ",
        "debateSection": {
          "showAs": "Tax Data",
          "debateSectionId": "dbsect_273",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_273",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_273.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Ged Nash",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "memberCode": "Gerald-Nash.D.2011-03-09"
        },
        "questionNumber": 275,
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 275 and 276 together.  On 20th of October 2023 the Supreme Court, in a unanimous decision, delivered an important judgment on the key factors to be considered when classifying an individual’s employment status for income tax purposes.  The detailed judgment was delivered by Mr. Justice Brian Murray in The Revenue Commissioners v. Karshan (Midlands) Ltd. t/a Domino’s Pizza. The case was concerned with whether the delivery drivers were independent contractors under a “contract for service”, and therefore taxable under Schedule D of the Taxes Consolidation Act 1997, or employees under a “contract of service”, and taxable under Schedule E of that Act (PAYE).  The judgment sets out an extensive review of relevant caselaw and succinctly summarises it through the provision of a five-step decision-making framework. The decision-making framework consists of five questions that are to be used to resolve the question of whether a contract is one of service (employee) or for service (self-employed). Under the self-assessment tax system, each business making payments to individuals is obliged to correctly determine whether those individuals are employed or self-employed, based on the facts and circumstances of each relationship and by applying the five-step framework. While the judgment related to a company engaging individuals as delivery drivers, as a decision of the Irish Supreme Court, the judgement has application across all sectors.  I am advised by Revenue that a detailed Tax and Duty Manual (TDM), to provide guidance in relation to the application of the judgment, and to assist businesses who engage individuals to carry out work, is available. The TDM, Part 05-01-30, was published on 21 May 2024 and is available at: www.revenue.ie/en/tax-professionals/tdm/income-tax-capital-gains-tax-corporation-tax/part-05/05-01-30.pdf.  In September 2025, following on from the Supreme Court judgement in the Karshan case, Revenue announced that employers can correct payroll tax issues for 2024 and 2025 arising from bona-fide classification errors, without imposition of interest and penalty, if they do so before 30 January 2026. Employers who acted in good faith, relying on the case law and guidance available prior to the Supreme Court judgment, but who may have misclassified employees as contractors, are encouraged to take this opportunity to regularise their tax affairs.  Guidance on this disclosure opportunity is set out in Tax and Duty Manual ‘Settlement arrangement arising from Revenue v Karshan (Midlands) Ltd. trading as Domino’s Pizza’ which is available at: www.revenue.ie/en/tax-professionals/tdm/compliance/audit-and-other-compliance-interventions/karshan-settlement-guidance/karshan-disclosure-opportunity-guidance.pdf.  Where an employer fails to take this opportunity to review its workforce practices and make a relevant disclosure, by 30 January 2026, and the liabilities from misclassification subsequently come to light, Revenue will form the view that the default has arisen from a complete failure to operate fiduciary taxes, PAYE, PRSI and USC, and will apply the relevant legislation to address this. Interest and penalties will apply in full in line with Revenue’s Code of Practice for Revenue Compliance Interventions which is available at: www.revenue.ie/en/tax-professionals/documents/code-of-practice-revenue-compliance-interventions.pdf  I am further advised by Revenue that it allocates significant resources to manage tax compliance. Revenue's risk-based compliance programme collates and assesses information from multiple sources to build profiles and assess overall risk. Risk associated with misclassification is taken into consideration, along with other risks identified, to target and confront the riskiest cases.  The tax risks associated with misclassification are not new, and in terms of Revenue compliance interventions, it is important to note that each compliance intervention is different, and the facts and circumstances of each case will inform Revenue’s response. Coupled with that, employment classification is a complex area, and each determination must be made on the facts and circumstances of each individual case.  Through detailed guidance, the provision of the disclosure opportunity and targeted risk-focused compliance interventions, Revenue has a comprehensive framework to support voluntary compliance for taxpayers with their self-assessment obligations, as well as to detect and challenge misclassification. Revenue is focused on continuing to maximise the use of its extensive resources to identify misclassification non-compliance and quantify risk while minimising the administrative burden on compliant taxpayers. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Finance",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_275",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 276. Deputy Ged Nash asked the Tánaiste and Minister for Finance following on from the recent guidance from the Revenue Commissioners which provides employers an opportunity to correct any payroll tax issues arising from the Supreme Court Karshan ruling of 2023, the means by which the Revenue Commissioners will ensure that all employers who have previously classified their employees as self-employed are adhering to the ruling, the means by which the Revenue Commissioners intends to enforce this; whether more staff will be required to enforce this adequately; and if he will make a statement on the matter. [65774/25] ",
        "debateSection": {
          "showAs": "Tax Data",
          "debateSectionId": "dbsect_273",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_273",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_273.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Ged Nash",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "memberCode": "Gerald-Nash.D.2011-03-09"
        },
        "questionNumber": 276,
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 275 and 276 together.  On 20th of October 2023 the Supreme Court, in a unanimous decision, delivered an important judgment on the key factors to be considered when classifying an individual’s employment status for income tax purposes.  The detailed judgment was delivered by Mr. Justice Brian Murray in The Revenue Commissioners v. Karshan (Midlands) Ltd. t/a Domino’s Pizza. The case was concerned with whether the delivery drivers were independent contractors under a “contract for service”, and therefore taxable under Schedule D of the Taxes Consolidation Act 1997, or employees under a “contract of service”, and taxable under Schedule E of that Act (PAYE).  The judgment sets out an extensive review of relevant caselaw and succinctly summarises it through the provision of a five-step decision-making framework. The decision-making framework consists of five questions that are to be used to resolve the question of whether a contract is one of service (employee) or for service (self-employed). Under the self-assessment tax system, each business making payments to individuals is obliged to correctly determine whether those individuals are employed or self-employed, based on the facts and circumstances of each relationship and by applying the five-step framework. While the judgment related to a company engaging individuals as delivery drivers, as a decision of the Irish Supreme Court, the judgement has application across all sectors.  I am advised by Revenue that a detailed Tax and Duty Manual (TDM), to provide guidance in relation to the application of the judgment, and to assist businesses who engage individuals to carry out work, is available. The TDM, Part 05-01-30, was published on 21 May 2024 and is available at: www.revenue.ie/en/tax-professionals/tdm/income-tax-capital-gains-tax-corporation-tax/part-05/05-01-30.pdf.  In September 2025, following on from the Supreme Court judgement in the Karshan case, Revenue announced that employers can correct payroll tax issues for 2024 and 2025 arising from bona-fide classification errors, without imposition of interest and penalty, if they do so before 30 January 2026. Employers who acted in good faith, relying on the case law and guidance available prior to the Supreme Court judgment, but who may have misclassified employees as contractors, are encouraged to take this opportunity to regularise their tax affairs.  Guidance on this disclosure opportunity is set out in Tax and Duty Manual ‘Settlement arrangement arising from Revenue v Karshan (Midlands) Ltd. trading as Domino’s Pizza’ which is available at: www.revenue.ie/en/tax-professionals/tdm/compliance/audit-and-other-compliance-interventions/karshan-settlement-guidance/karshan-disclosure-opportunity-guidance.pdf.  Where an employer fails to take this opportunity to review its workforce practices and make a relevant disclosure, by 30 January 2026, and the liabilities from misclassification subsequently come to light, Revenue will form the view that the default has arisen from a complete failure to operate fiduciary taxes, PAYE, PRSI and USC, and will apply the relevant legislation to address this. Interest and penalties will apply in full in line with Revenue’s Code of Practice for Revenue Compliance Interventions which is available at: www.revenue.ie/en/tax-professionals/documents/code-of-practice-revenue-compliance-interventions.pdf  I am further advised by Revenue that it allocates significant resources to manage tax compliance. Revenue's risk-based compliance programme collates and assesses information from multiple sources to build profiles and assess overall risk. Risk associated with misclassification is taken into consideration, along with other risks identified, to target and confront the riskiest cases.  The tax risks associated with misclassification are not new, and in terms of Revenue compliance interventions, it is important to note that each compliance intervention is different, and the facts and circumstances of each case will inform Revenue’s response. Coupled with that, employment classification is a complex area, and each determination must be made on the facts and circumstances of each individual case.  Through detailed guidance, the provision of the disclosure opportunity and targeted risk-focused compliance interventions, Revenue has a comprehensive framework to support voluntary compliance for taxpayers with their self-assessment obligations, as well as to detect and challenge misclassification. Revenue is focused on continuing to maximise the use of its extensive resources to identify misclassification non-compliance and quantify risk while minimising the administrative burden on compliant taxpayers. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Finance",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_276",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 302. Deputy Ged Nash asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation to set out the policy in relation to the re-appointment of persons holding senior posts in State agencies beyond an initial five-year contract; if such a policy applies only to those at chief executive or head of agency level; if he will outline what other posts, or grades, groups and categories this policy applies to; and if he will make a statement on the matter. [65762/25] ",
        "debateSection": {
          "showAs": "State Bodies",
          "debateSectionId": "dbsect_297",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_297",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_297.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Ged Nash",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "memberCode": "Gerald-Nash.D.2011-03-09"
        },
        "questionNumber": 302,
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Individuals in leadership roles such as Chief Executive Officers and other analogous heads of State agencies are typically appointed for a fixed length of time as specified in the primary legislation underpinning the agency, usually five-year fixed term contracts. In particular circumstances this initial contract may be extended for a single and final extension of five years, for a maximum term of ten years. Any such extension would require the approval of the relevant line Minister under whose aegis the State agency operates with the consent of the Minister for Public Expenditure and Reform.  Relevant Government policy and practice, as set out in The Code of Practice for the Governance of State Bodies, is that a maximum term of ten years should apply to fixed term posts in State bodies. This policy is applicable to senior leadership roles within State agencies. Given differences in structures and grades operating within State agencies, it is not possible to specify particular grades or posts across all such bodies. However, it is the case that fixed term contracts for CEOs of Commercial State Bodies (CSBs) and non-Commercial State Bodies (NCSBs) have been a long-standing policy and practice of Government.  The Code of Practice for the Governance of State Bodies reflects Government policy in terms of tenure. It is Government policy that the interests of good governance and administration are not best served by having the same individuals in place for an indefinite period. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Public Expenditure",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_302",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 303. Deputy Ged Nash asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the costs involved in replacing signage in his Department due to errors on the signs; and if he will make a statement on the matter. [65764/25] ",
        "debateSection": {
          "showAs": "Departmental Expenditure",
          "debateSectionId": "dbsect_298",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_298",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_298.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Ged Nash",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "memberCode": "Gerald-Nash.D.2011-03-09"
        },
        "questionNumber": 303,
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Following the change of the name of my Department upon formation of the Government, a procurement process was undertaken to replace the Department’s signage at the Government Buildings complex. After the new signage had been installed, it was noted that one word had been misspelled. The external supplier of the signage confirmed that it made this error when producing it and has since replaced the signage at no additional cost. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Public Expenditure",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_303",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 304. Deputy Ged Nash asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation to set out a list of unpublished reports carried out by the Irish Government Economic and Evaluation Service, either directly in his Department or by other Departments, which have been sent to his Department, in tabular form; and if he will make a statement on the matter. [65765/25] ",
        "debateSection": {
          "showAs": "Departmental Reports",
          "debateSectionId": "dbsect_299",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_299",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_299.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Ged Nash",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "memberCode": "Gerald-Nash.D.2011-03-09"
        },
        "questionNumber": 304,
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Policy analysis is a core component of the public expenditure management and value for money frameworks. Irish Government Economic Evaluation Service (IGEES) plays a key role in supporting all departments and offices in delivering on their value for money responsibilities through undertaking regular analysis of expenditure trends and policies. Alongside this, individual line Departments also maintain responsibility for conducting detailed policy analysis within their own sectors, contributing sector-specific insights and evidence to the wider policy making process. Reports are published on individual Departmental websites and where applicable can also be accessed through the IGEES website.  Since 2024 approximately 63 papers have been published by Irish Government Economic and Evaluation Service, IGEES, staff across Government. During 2025, policy analysis and expenditure evaluations on a broad range of topics, including disability services, social housing, migration and labour market trends, statutory sick leave, well-being, education, transport, and youth participation. This analytical research has continued to play a key role in supporting evidence-based policymaking across the government.  In addition, my department continually seeks to ensure evidence and analysis is at the centre of policy making including through the budgetary process. This is communicated through our range of publications including the annual Expenditure Report, the recently published Medium Term Expenditure Framework, the Public Service Performance Report, as well our expenditure and policy evaluation papers across a range of topics.  In preparation for Budget 2026, my department undertook several pieces of analysis to support resource allocation:  • The Public Service Performance Report, published in June, detailed how Departments performed against targets set in the Revised Estimates process. This supports assessment of progress ahead of the budgetary process.  • The National Development Plan Review, published in July, sets out investment plans to address the infrastructure deficit in the best way to safeguard our economy, drive growth and opportunity, protect jobs, increase competitiveness and ensure prosperity for our people and communities. This review was underpinned by analysis of drivers of infrastructure needs.  • The Medium-Term Expenditure Framework was published in September. This is a multiyear public expenditure planning exercise and supports assessment of the resource implications of future policy decisions over the period 2025 to 2030.  This work complements engagement with Departments in the Estimates process and the analysis underpinning these discussions, such as, for example, the Forecasting Live Register Claimants and Expenditure 2026 paper, published by my department on budget day, which examines labour market trends and forecasts Live Register related expenditure for 2026. Other recent publications from my department also include:  Review of Social Housing Delivery and Spend • ;  Managing IPAS Expenditure Pressures: Demand-Side Drivers and Policy Responses • ;  School Meals Programme: An Analytical Review of Expenditure, Participation and Governance • , and:  “Specialist Disability Services in Ireland: An Overview of Expenditure Trends, Activity Outputs and Budget Governance 2018–2023 • .  These along with all of my Department’s published policy analysis and strategies are available on the department’s website. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Public Expenditure",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_304",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 325. Deputy Ged Nash asked the Minister for Enterprise, Tourism and Employment the timeline to transpose the EU Platform Workers Directive into Irish law; the legislative pathway his Department envisages for the transposition; if he favours pre-legislative scrutiny of the heads of a Bill in this case; and if he will make a statement on the matter. [65771/25] ",
        "debateSection": {
          "showAs": "EU Directives",
          "debateSectionId": "dbsect_319",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_319",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_319.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Ged Nash",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "memberCode": "Gerald-Nash.D.2011-03-09"
        },
        "questionNumber": 325,
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  The Improving Working Conditions in Platform Work Directive entered into force on 1 December 2024. EU Member States have until 2 December 2026 to transpose the Directive into national law.  The Directive is complex and wide ranging. It seeks to ensure people working though digital labour platforms have the correct legal employment status that corresponds to their actual working arrangements, enabling them to benefit from the employment rights they are entitled to.  The Directive also aims to regulate the use of algorithms by digital labour platforms. The Directive will make the use of algorithms in human resources management in platform work more transparent, ensuring that automated systems are monitored by qualified staff, and that workers have the right to contest automated decisions. The Directive also imposes substantial limitations on the processing of personal data by these systems.  transposition forum with relevant government stakeholders to review the consultation outcomes and discuss transposition measures.  My Department is also represented at the EU Official Expert Group on the Transposition of the Directive which has been established by the European Commission. This Group has met seven times to date and will meet a final time in December to approve the report. The Group will issue a final report on transposition by the end of 2025 which will be an important source of guidance for Member States.  Once these measures have been fully considered by all relevant government stakeholders, the Department will set out a clear and definitive legislative pathway. Work on the transposition of the Platform Work Directive remains ongoing, and the Department of Enterprise, Tourism and Employment are committed to progressing it without delay.The Department of Enterprise, Tourism and Employment has recently completed consultations with Government Departments, and the public consultation process has also concluded. In the coming weeks, the Department will convene a ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Enterprise",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_325",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 326. Deputy Ged Nash asked the Minister for Enterprise, Tourism and Employment the means by which his Department intends to take account of the 2023 Supreme Court “Karshan ruling” when transposing the EU Platform Workers Directive into law; whether the five step framework in that ruling will be applied to the determination of the employment status of platform workers and those working in the gig economy; and if he will make a statement on the matter. [65772/25] ",
        "debateSection": {
          "showAs": "EU Directives",
          "debateSectionId": "dbsect_320",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_320",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_320.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Ged Nash",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "memberCode": "Gerald-Nash.D.2011-03-09"
        },
        "questionNumber": 326,
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  The Improving Working Conditions in Platform Work Directive entered into force on 1 December 2024. EU Member States have until 2 December 2026 to transpose the Directive into national law.  The Directive is complex and wide ranging. It seeks to ensure people working though digital labour platforms have the correct legal employment status that corresponds to their actual working arrangements, enabling them to benefit from the employment rights they are entitled to.  The Directive also aims to regulate the use of algorithms by digital labour platforms. The Directive will make the use of algorithms in human resources management in platform work more transparent, ensuring that automated systems are monitored by qualified staff, and that workers have the right to contest automated decisions. The Directive also imposes substantial limitations on the processing of personal data by these systems.  The Department of Enterprise, Tourism and Employment has recently completed consultations with Government Departments, and the public consultation process has also concluded. In the coming weeks, the Department will convene a transposition forum with relevant government stakeholders to review the consultation outcomes and discuss transposition measures.  It is anticipated that the ruling of the Supreme Court in the Domino’s Pizza case (Revenue Commissioners v. Karshan (Midlands) Ltd. T/A Domino’s Pizza); five-step framework included in that judgment; and subsequent Revenue, Department of Social Protection, WRC Code of Practice on Determining Employment Status published in November 2024 will be considered with respect to the provisions of Chapter II of the Platform Work Directive, which concerns employment status. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Enterprise",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_326",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 327. Deputy Ged Nash asked the Minister for Enterprise, Tourism and Employment following on from the recent guidance from the Revenue Commissioners which provides employers an opportunity to correct any payroll tax issues arising from the Supreme Court Karshan ruling of 2023, the means by which his Department and the industrial relations institutions under its aegis will ensure that all employers who have previously classified their employees as self-employed are adhering to the ruling; the means by which the institutions intend to enforce this; whether he anticipates more staff will be required to adjudicate on cases arising from the ruling; and if he will make a statement on the matter. [65775/25] ",
        "debateSection": {
          "showAs": "Industrial Relations",
          "debateSectionId": "dbsect_321",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_321",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_321.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Ged Nash",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "memberCode": "Gerald-Nash.D.2011-03-09"
        },
        "questionNumber": 327,
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  In Ireland, there are a number of statutory bodies whose remit includes determining the employment status of a person. Each of these bodies make their determinations independently of each other in respect of the particular functions for which they are responsible. While Revenue has responsibility for determination of employment status of a worker for taxation purposes, responsibility for determination of employment status of a worker for PRSI purposes falls to the Department of Social Protection (DSP).  Following the Supreme Court’s judgment in ‘The Revenue Commissioners v Karshan (Midlands) Ltd. t/a Domino’s Pizza’ , I understand that the Revenue Commissioners are now providing employers with an opportunity to correct any payroll tax issues in respect of 2024 and where relevant, 2025.  The Labour Court and the Workplace Relations Commission (WRC) are independent statutory offices under the aegis of my Department. The WRC’s functions include adjudication, mediation, conciliation, information provision, and inspection of employer records for compliance. The Labour Court is the court of last resort in industrial relations disputes and the sole appellate body in employment rights cases. Whether a person is an employee under employment rights legislation may be determined by the WRC’s Adjudication Service and the Labour Court (on appeal), as a preliminary issue, and in such cases, the current law is applied and where employment status is an issue, the Karshan ruling is one of the factors considered and applied where appropriate.  The Programme for Government includes a commitment to support the central role of the WRC and the Labour Court in industrial relations and employment rights. My Department together with the workplace relations bodies actively monitor the rate of complaints and continuously evaluate resource requirements which are necessary for the performance of their functions. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Enterprise",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_327",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 344. Deputy Ged Nash asked the Minister for Education and Youth if she is aware of a school’s (details supplied) difficulties in securing an increase in its SNA allocation; the progress on this issue; the reason for the delay; and if she will make a statement on the matter. [65187/25] ",
        "debateSection": {
          "showAs": "Special Educational Needs",
          "debateSectionId": "dbsect_338",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_338",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_338.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Ged Nash",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "memberCode": "Gerald-Nash.D.2011-03-09"
        },
        "questionNumber": 344,
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is, in the first instance, the primary body responsible for the matter the Deputy has raised. As the matter raised relates to a NCSE process. I will arrange for your query to be forwarded to the NCSE for their attention and direct reply.  Deputies are also welcome to raise such matters with the NCSE directly through their dedicated Oireachtas query line at oireachtasqueries@ncse.ie. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_344",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 692. Deputy Ged Nash asked the Minister for Justice, Home Affairs and Migration the reason the community probation team did not award funding, following an expression of interest process, to a project (details supplied) to continue its established Drugs Court partnership in Drogheda; if he will review the decision or alternatively provide additional funding to the group to continue its trusted Drugs Court partnership work in the community; his views that the decision following the expression of interest process runs contrary to the principles established by his Departments-sponsored Drogheda Implementation Board of supporting sustained community-based interventions, developing established trusted relationships, and investment in local services in Drogheda; and if he will make a statement on the matter. [66292/25] ",
        "debateSection": {
          "showAs": "Departmental Funding",
          "debateSectionId": "dbsect_616",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_616",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_616.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Ged Nash",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "memberCode": "Gerald-Nash.D.2011-03-09"
        },
        "questionNumber": 692,
        "answerText": " Minister for Justice, Home Affairs and Migration  Following its establishment in 2021, the extended term of the Drogheda Implementation Board came to an end on 31 December 2024.  The Board was established to oversee the implementation of the report ‘Drogheda: Building a Bridge to a Better Future’ and is an example of how the government is prioritising building stronger, safer communities.  During its term significant progress was made on the 74 recommendations as set out in the Drogheda Report Implementation Plan. These recommendations fell under two general headings:  • the need for improved inter-agency cooperation in the administration and delivery of services in Drogheda;  • the need to resource services or provide additional services in the area.  Over the lifetime of the Board 70 posts were created in response to the Drogheda Report Implementation Plan; 23 of these are permanent posts while a number of others are funded on a long -term basis by a variety of government departments and statutory agencies. In addition, over €31m was committed in funding either to support these posts or for capital projects.  Several actions from the Implementation Plan related specifically to The Red Door project, and the delivery of services to the community through that project. Amongst other interventions delivered by a variety of agencies, my Department resourced a Drug Court Liaison Worker and administrative supports from October 2021 to October 2025 through The Red Door Project on a temporary basis.  The Probation Service recently opened an Expression of Interest (EOI) process for the delivery of community based supports to the Co Louth Probation Service team. The closing date for receipt of applications was 17 October 2025.  The EOI contained a number of specific requirements from the successful organisation, including to work with the Louth Probation Service team to deliver services within the Drug Treatment Court model.  I understand that the process has concluded and that a preferred service provider was selected by the Probation Service. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Justice",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_692",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "showAs": "Ged Nash",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09"
        },
        "showAs": " 125. Deputy Ged Nash asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation to confirm that the OPW will prioritise the Seapoint Bridge and surrounding flooding zone in Termonfeckin, County Louth for attention in their list of projects for minor flood mitigation works; the timescale for those works to complete; and if he will make a statement on the matter. [64059/25] ",
        "to": {
          "roleType": null,
          "showAs": "Public Expenditure",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_99.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_99",
          "showAs": "Flood Risk Management",
          "debateSectionId": "dbsect_99"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_125",
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Localised flooding issues are a matter, in the first instance, for each Local Authority to investigate and address, and Louth County Council may carry out flood mitigation works using its own resources. The Council may apply to the OPW for funding for flood mitigation works under the OPW's Minor Flood Mitigation Works and Coastal Protection Scheme. This scheme was introduced by the OPW on an administrative, non-statutory basis in 2009. The purpose of the scheme is to provide funding to Local Authorities to undertake minor flood mitigation works, or studies to address localised flooding and coastal protection problems within their administrative areas. The criteria for the Minor Flood Mitigation Works and Coastal Protection Scheme are currently under review, and any application under the scheme will be considered against revised criteria. The OPW expect to advise Local Authorities of the revised criteria for the Scheme in the coming weeks.  The OPW does not currently have any application under the Minor Flood Mitigation Works and Coastal Protection Scheme for the location referenced in this question. Since 2009, the OPW has approved funding under the Minor Flood Mitigation Works and Coastal Protection Scheme of circa €1.9 million to County Louth for some 26 projects.  The Scheme Viability Reviews (SVRs) for Annagassan and Termonfeckin have been completed.  As the SVRs for these areas concluded that potentially viable Flood Relief Schemes have been identified, these areas will be brought forward as Flood Relief Projects in due course, through the second tranche of schemes.  The OPW will discuss with Louth County Council the optimal means for progressing Flood Relief in these areas. ",
        "questionNumber": 125
      },
      "contextDate": "2025-11-19"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 695,
        "showAs": " 695. Deputy Ged Nash asked the Minister for Social Protection his position on a matter (details supplied); and if he will make a statement on the matter. [63695/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Social"
        },
        "by": {
          "showAs": "Ged Nash",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "memberCode": "Gerald-Nash.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_695",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_545",
          "showAs": "Social Welfare Code",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_545",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_545.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Social Protection  Further to Budget 2026, €28.9 billion will be spent on social welfare in 2026, including over €1.15 billion of new measures targeted to assist households. The measures contained in the Budget are designed to support the most vulnerable in our society with the increased cost of living and there is a particular focus on tackling child poverty with over €320 million in targeted measures to alleviate Child Poverty. This includes the largest ever increase in the Child Support Payments of €8 and €16 per week for children aged under 12 and 12 and over respectively which will benefit those in receipt of Jobseeker’s Benefit and Jobseeker’s Allowance, including those in part-time employment.  Budget 2026 also provides targeted supports for low income working families by raising the income thresholds for Working Family Payment by €60 per week from January 2026 and extending the benefit of the fuel allowance scheme to families in receipt of the Working Family Payment.  The Jobseeker’s Pay-Related Benefit is a fundamentally new scheme and is being monitored as the first full annual cycle of the scheme progresses. My department is assessing the impact of the scheme and of the pay-related approach to a benefit payment, in terms of economic and behavioural metrics, and will consider any potential changes as the scheme continues to roll out.  The maximum rates available on Jobseeker’s Pay-Related Benefit for those either with five-plus years contributions or contributions of between two and five years, €450 and €300, respectively, remain considerably higher than the personal rates for other working-age social welfare schemes, which will increase to €254 from January 2026. As of end September 2025, the average weekly payment was €394.20 for the initial 13-week period of entitlement for those with five years PRSI contributions.  In addition, Budget 2026 increased the National Minimum wage, which means that people earning the National Minimum wage who become unemployed will benefit from a higher rate of Jobseeker’s Pay-Related Benefit than previously.  Any future changes to the scheme will be considered in a wider policy and budgetary context. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 842,
        "showAs": " 842. Deputy Ged Nash asked the Minister for Justice, Home Affairs and Migration when a contract (details supplied) will terminate; if his department plans to renew the contract; and if he will make a statement on the matter. [63999/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Justice"
        },
        "by": {
          "showAs": "Ged Nash",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "memberCode": "Gerald-Nash.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_842",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_649",
          "showAs": "International Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_649",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_649.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Justice, Home Affairs and Migration  The Department has had a contract in place with a provider to provide international protection accommodation at this location since early 2024. It is functioning as a dispersal centre for the International Protection Accommodation Service (IPAS), with families in residence for a short period of time before transfer to an alternative centre. The end date of the current contract is during the first quarter of 2026.  The Department conducts all contractual negotiations on the basis of there being no guarantee of the continuity of a contract beyond its end date.  With respect to potential for contract renewals, the provision of accommodation for international protection applicants is demand-led, and each premises is considered on a case-by-case basis to decide if the contract will be renewed as it approaches its end date.  At potential renewal stage, consideration will be given to the current and projected demand for accommodation, the provider's performance under contract, and compliance with standards and legal obligations.  Ireland has adopted and is now working to implement the EU Pact on Migration and Asylum in mid-2026. Reforming and speeding up processing of applications should also serve over time to reduce the scale of the demand for international protection accommodation.  The Department is working to increase the amount of State-owned international protection accommodation and creating a more stable and sustainable accommodation system.  As developing these more sustainable state-owned accommodation system options under this strategy will take time, the commissioning of emergency commercial accommodation will continue to be a feature in the short to medium term. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 1109,
        "showAs": " 1109. Deputy Ged Nash asked the Minister for Health if she is aware of the difficulties people suffering from a rare genetic condition are having in accessing a drug (details supplied); the plans to make this drug more easily available; and if she will make a statement on the matter. [63665/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "showAs": "Ged Nash",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "memberCode": "Gerald-Nash.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_1109",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_894",
          "showAs": "Health Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_894",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_894.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Health  Under the Health (Pricing and Supply of Medical Goods) Act 2013, the HSE has statutory responsibility for decisions on the pricing and reimbursement of medicines and medical devices; therefore, the matter has been referred to the HSE for attention and direct reply to the Deputy. ",
        "date": "2025-11-18"
      }
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The SAFE registration process, carried out by the Department of Social Protection, is key to proper authentication of a person's identity.  It helps to deter and, where attempted, detect fraudulent presentation of identities for the purpose of accessing public services and funds.  It also acts to facilitate easier access to services by enabling people to present proof of identity on a 'once and done' basis rather than having to present such proofs each time they transact with a public body.  It is also core to the delivery of secure online public services and is key to the implementation of the Connecting Government 2030 strategy, and the implementation in Ireland of the EU Digital agenda including the EIDAS regulation and the EU Digital Wallet.  In July 2021, the Data Protection Commission (DPC) commenced an own volition inquiry into the Department of Social Protection’s processing of biometric data in connection with the SAFE registration process and the issuing of Public Services Cards (PSC).  The Department of Social Protection received a copy of the DPC's decision on 9th June 2025.   In summary, the DPC acknowledges that the process is provided for in law, but it believes that the law is not transparent or precise enough in its formulation to satisfy GDPR requirements.  I am advised that following careful consideration by the Department of Social Protection, and consultation with the Attorney General's Office, the Department of Social Protection decided to appeal the DPC decision on 7th July 2025.  As the matter is now a matter for the courts to adjudicate, it would not be appropriate for me to make any comment. ",
        "to": {
          "showAs": "Public Expenditure",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Ged Nash",
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_365.xml"
            }
          },
          "debateSectionId": "dbsect_365",
          "showAs": "Data Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_365"
        },
        "questionNumber": 424,
        "date": "2025-11-12",
        "showAs": " 424. Deputy Ged Nash asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if he is concerned at the Data Protection Commissioner’s (DPC) ruling of June 2025 (details supplied) specifically in respect of the DPC’s finding and fine against the Department of Social Protection, regarding issues connected to the identification of a valid lawful basis for the Department’s processing of biometric data in connection with the registration of new public service cards; the requirement to cease processing of such data within 9 months (in the absence of the Department of Social Protection identifying such a valid lawful basis for the processing of such data); the work his Department has done with the Department of Social Protection since the ruling in order to address the issues identified; and if he will make a statement on the matter. [61915/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_424"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  The Retail Planning Guidelines were issued as Ministerial Guidelines under Section 28 of the Planning and Development Act in 2012.  Section 28 of the Act provides that planning authorities and An Bord Pleanála (now An Coimisiún Pleanála) are required to have regard to the Guidelines in the performance of their functions.  The guidelines recognise that the retail sector is a key component of the national economy and aims to ensure that the planning system continues to play its role in supporting competitiveness and choice in the sector, while also promoting the vitality and viability of city and town centres.  A plan-led approach is taken to the provision of new retail development based on a retail strategies.  Under the Guidelines, retail strategies are to be prepared at regional and local levels, which project future retail needs and requirements aligned to the settlement hierarchy established by the National Planning Framework, Regional Spatial and Economic Strategies and City and County Development Plans.  This process will identify the appropriate level, form and location of retail activity.  Part 3, Chapter 3 of the Planning and Development Act 2024, relating to National Planning Statements, commenced on October 2, 2025.  Ministerial Guidelines will, over time, be reviewed and replaced, as appropriate, with National Planning Statements (NPSs).  Having regard to the evolving nature of the retail industry and broader changes that are impacting on the role of city and town centres in recent years, it is envisaged that a review of the Retail Planning Guidelines will be included in the review programme.   In the interest of clarity, the existing Retail Planning Guidelines will continue to have effect until such time as they are replaced by an NPS.  With regard to the specific categories of retail establishments and consideration within the process of granting planning permission, under the provisions of the Planning and Development Regulations 2001 (as amended) the definition of a 'shop' includes a structure used for the retail sale of goods.  The Regulations do not specify what types of goods may or may not be sold within a shop. ",
        "to": {
          "showAs": "Housing",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Ged Nash",
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_547.xml"
            }
          },
          "debateSectionId": "dbsect_547",
          "showAs": "Planning Issues",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_547"
        },
        "questionNumber": 628,
        "date": "2025-11-12",
        "showAs": " 628. Deputy Ged Nash asked the Minister for Housing, Local Government and Heritage if he is considering undertaking a review of retail planning and development guidelines to provide for a distinct category for certain types of stores (details supplied) that are currently classified under the scope of general retail classifications; and if he will make a statement on the matter. [61784/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_628"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_188",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Ged Nash",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "memberCode": "Gerald-Nash.D.2011-03-09"
        },
        "debateSection": {
          "debateSectionId": "dbsect_175",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_175",
          "showAs": "Coast Guard Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_175.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Transport",
          "roleCode": null
        },
        "showAs": " 188. Deputy Ged Nash asked the Minister for Transport if he can provide a briefing on the reason search and rescue crews who commence work at 1300 hours for a continuous 24hr duty period, have their hours of work artificially reduced to 16.5 hours (details supplied); and if he will make a statement on the matter. [60718/25] ",
        "questionNumber": 188,
        "answerText": " Minister of State at the Department of Transport  Coast Guard SAR helicopter services are provided under contract that is currently transitioning from CHCI to Bristow Ireland Limited (BIL).  Coast Guard Aviation services are regulated by the Irish Aviation Authority. My Department does not have any role in the regulatory oversight of the contracted service providers. Many of the personnel previously employed by CHCI have or will prior to completion of transition take up the option of joining BIL Ireland.  Similar to the previous contract, crews operate 24 hr shift patterns. In addition to regulated Flight Time Limitation requirements, both entities are required to operate a Fatigue Risk Management System, as per IAA regulatory requirements. In order to enhance overall flight crew safety, the new contract obliges ‘on duty’ flight crews to remain on base for their full tour of duty, for which suitable rest and sleeping accommodation is provided.  I understand that the new contractor, Bristow Ireland, following contract award concluded framework agreements with the employee representative organisations, FORSA, UNITE and IALPA.  BIL subsequently concluded collective bargaining agreements with the three representative organisations. BIL continues to actively engage with the cohort of CHCI staff who have yet to transfer, to support seamless transfer to the new contractor as the remaining bases transition. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_311",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Ged Nash",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "memberCode": "Gerald-Nash.D.2011-03-09"
        },
        "debateSection": {
          "debateSectionId": "dbsect_280",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_280",
          "showAs": "International Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_280.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Justice",
          "roleCode": null
        },
        "showAs": " 311. Deputy Ged Nash asked the Minister for Justice, Home Affairs and Migration for information on a matter (details supplied); and if he will make a statement on the matter. [60841/25] ",
        "questionNumber": 311,
        "answerText": " Minister for Justice, Home Affairs and Migration  I can advise the Deputy that my Department informed this provider that the Department would terminate the relevant contract on 29 October and that this would come into effect with its cessation on 30 November 2025.  In relation to payments made to this provider, there is full transparency from the Department in terms of providers receiving payments, with details of all payments over €20,000 and the recipients published quarterly online at: www.gov.ie/en/department-of-social-protection/collections/purchase-orders-for-20000-or-above/  Payments to this provider are included in these public reports.  As the Deputy will be aware extensive challenges were posed to the State in sourcing international protection accommodation during an unprecedented surge in applications from 2022 to 2024.  During this period, over 45,000 additional international protection applicants arrived in Ireland. Prior to this, a typical 3-year period would have seen close to 8,000 or 9,000 arrivals.  During the surge period, the State was obliged to urgently source over 26,000 beds for international protection applicants, and in parallel, up to 60,000 beds for people fleeing the war in Ukraine.  Centres were opened across the country, often at short notice, in order to ensure that families and children were not left homeless. Despite these efforts, the State was unable to provide all single male applicants with accommodation from the end of 2023.  Due to the recent reduction in the numbers seeking international protection, the State is now in a position to begin regularising the accommodation portfolio and increasing the number of state-owned beds.  The Department continues to appraise the portfolio of existing accommodation with a view to consolidation where possible, along with better governance and compliance.  While commissioning emergency commercial accommodation will continue to be necessary in the short to medium term, it is being contracted on a short-term basis, which enables the State to decommission this capacity with agility as contracts expire or demand fluctuates. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09",
          "showAs": "Ged Nash",
          "memberCode": "Gerald-Nash.D.2011-03-09"
        },
        "questionNumber": 1,
        "questionType": "oral",
        "answerText": " Deputy Ged Nash  We have been reading a lot of significant information in the media in recent days and weeks about plans the Minister appears to have to improve the delivery of infrastructure and capital development in the context of the revised national development plan, NDP. Will he elaborate precisely on what those plans are and how he plans to implement them? \n Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation (Deputy Jack Chambers)  My Department is currently finalising the completion of a report and action plan on accelerating infrastructure delivery in our economy. It will be brought to Government in the coming weeks. It will set out a series of high-impact reforms targeted at the most significant barriers to the timely delivery of critical infrastructure. These reforms will have a clear focus on reducing timelines and significantly improving outcomes. They will be targeted at the most impactful barriers to infrastructure delivery as outlined in the report published in July. This report identified 12 barriers to the effective delivery of infrastructure in our country.  The most significant barriers identified are broadly categorised across three headings, which were set out in the report. The first is the regulatory environment, including the growth and complexity of legislation; policy statements and strategies; how consents, licences and permissions for development are obtained; the timelines for these processes, engagement between the regulatory bodies and project developers; and consistency across regulatory bodies.  The second heading is the planning and legal systems, including the increasing role that the courts play in infrastructure projects; the cascading consequences from these decisions through development cycles; and the impact that the uncertainty in planning and legal decisions are having on projects.  The third heading is internal systems, such as how the Government allocates funding and develops a credible project pipeline; the rules applied to the development of projects; and how contractors are procured to undertake the works necessary for a project.  The task force is providing strategic guidance and practical insights into the development of actions to address these barriers. This work is also informed by extensive engagement in the economy with delivery bodies, regulators, and industry representatives, as well as international best practice.  Some reforms had already been introduced when we published the NDP. We have given funding certainty of €102 billion from 2026 to 2030, which is €34 billion over the previous allocation. It provides greater certainty for key strategic projects such as MetroLink, the greater Dublin drainage scheme and the eastern and midlands water supply project, as well as the prioritisation of funding for critical infrastructure, such as electricity, water, and transport to help the supply of new homes and economic competitiveness. \n An Leas-Cheann Comhairle  Thank you, Minister. \n Deputy Jack Chambers  Departments are in the process of developing sectoral investment plans to allocate their capital resources and these will be published in the coming weeks. \n Deputy Ged Nash  This is all well and good and we have been reading a lot about this since the revised national development plan was published. We will see updates on specific projects shortly. Will there be timelines for those projects? Looking beyond the abstract, what will it mean for people? For example, will the package of proposals that the Minister wants implemented shorten the timeframe for the delivery of the MetroLink or the northern line DART project to Drogheda? How many new homes will it deliver? At the moment this is all in the abstract about task forces and so on reporting but there is very little detail.  The Minister briefed the media earlier this week that the threshold in the Department's infrastructure guidelines will increase from €200 million to €500 million.  I am not absolutely convinced that will improve project delivery. In fact, I would advise caution in that regard. The Minister should be streamlining the process for using the infrastructure guidelines, not necessarily increasing the threshold. \n Deputy Jack Chambers  There are extensive actions across every barrier and the plan is to have the majority of the practical actions being delivered in 2026. Every action we take is about shortening and truncating timelines for the development lifecycle of critical infrastructure, which is simply taking too long. That means we need to increase our risk appetite. We have too much process and too many decision-makers and there is risk aversion across our systems. Secondly, within government, where we can control processes or procedures, that means we cut unnecessary levels of process which do not add value but simply add time. We have had a forensic assessment of this in recent months. The response to it around the infrastructure report which we publish involves practical actions which will demonstrate shortening of timelines for critical infrastructure and other infrastructure across our economy.  On the point about housing, water and wastewater treatment plants are central to the delivery of new homes and many of Irish Water's capital projects are taking far too long. We have secondments from Irish Water and the task force in my Department. They make a positive contribution to the whole area of reform. \n Deputy Ged Nash  Would the Government take any responsibility for what the Minister described as the unnecessary processes that have developed over time? We hear a lot of analysis of this and finally the Government appears to be cottoning on to the fact we have a real problem with delivery. We have been saying it in opposition for years - I try to be constructive and put forward alternative proposals for delivery of infrastructure - but it is only when someone like John Collison writes an article for a national newspaper that senior Government representatives seem to take notice. I understand from the media that Fianna Fáil backbenchers have been saying this for a long time as well. There is a form of fetishisation of bureaucracy in this country. We seem to love it and get caught up in it, but it may have gone too far. In some respects, however, that is a scapegoating exercise. Our problem these days is not money. It was always money but now it is delivery and this Government will be judged on delivery. The IMF said clearly that our infrastructure lags 32% behind comparable countries. It is a rich country that feels very poor. \n Deputy Jack Chambers  That is why we have corrected that around having over 5% GNI* allocated for critical infrastructure, which is one of the highest levels of infrastructure investment across EU counterparts. It did not take any article in any newspaper for me to prioritise infrastructure delivery. Since the brief was allocated to my Department, we have stood up a task force, developed an evidence base and published the report in July on the evidence base, which is now informing the various reforms which we will introduce and set out in the coming weeks. That is about cutting unnecessary processes within government and the State. We have a complicated structure of regulation in our economy which needs simplification, and not only at EU level. We need to prioritise domestic simplification and reform to do things quicker, to develop and facilitate economic growth and, ultimately, to deliver infrastructure quicker and build more homes. That is the central metric which will underpin all the work on infrastructure. We will set out the detail around that when it is published in the coming weeks. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Public Expenditure",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_14",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/debate/dbsect_14",
          "showAs": "National Development Plan",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/debate/mul@/dbsect_14.xml"
            }
          }
        },
        "showAs": " 1. Deputy Ged Nash asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the reforms he plans to introduce to improve the delivery of infrastructure and capital development outlined in the revised national development plan; and if he will make a statement on the matter. [60445/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_1"
      }
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Finance",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 460. Deputy Ged Nash asked the Minister for Finance the number of PAYE taxpayer units who may have either underpayments or overpayments for the 2023 and 2024 tax years respectively; the number who have not yet submitted a tax return; and if he will make a statement on the matter. [58142/25] ",
        "by": {
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "showAs": "Ged Nash",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_460",
        "questionNumber": 460,
        "answerText": " Minister for Finance  At the end of every year, Revenue makes a Preliminary End of Year Statement (PEOYS), available to employees. The PEOYS sets out a provisional tax position, based on information available on Revenue records. It will show whether an employee has paid the correct amount of Income Tax and Universal Social Charge (USC) for the year.  I am advised by Revenue that the final position for PAYE taxpayers can only be quantified when taxpayers submit their tax returns at the end of the year and claim any additional credits or reliefs that may be due or declare any additional income they may have.  To assist taxpayers, balance their tax, Revenue regularly issues letters to taxpayers who according to their PEOYS, may have either overpaid or underpaid tax in a particular tax year. These letters advise the recipients to submit a PAYE Income Tax return to claim any additional tax credits or reliefs that they may be due and/or to declare any additional income they may have received. These letters also remind taxpayers of a four-year time limit in respect of submitting such claims.  I am further advised by Revenue that over 891,000 PAYE taxpayer units, who have paid or are liable to pay tax, have yet to file an Income Tax return for 2023 and approximately 1.2 million have yet to file for 2024. The analysis of those PAYE taxpayers indicates that 590,000 (66%) and 717,000 (60%) of taxpayer units in 2023 and 2024 respectively have a balanced tax position.  Of the remainder, 70,000 taxpayer units (8%) in 2023 and 171,000 (14%) in 2024 potentially underpaid tax with 231,000 taxpayer units (26%) in 2023 and 312,000 (26%) in 2024, potentially overpaid tax.  Finally, Revenue advises that these figures relate to PAYE taxpayers only, data is not available in respect of potential overpayments or underpayments for self-assessed taxpayers. ",
        "debateSection": {
          "showAs": "Tax Data",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_430",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_430.xml"
            }
          },
          "debateSectionId": "dbsect_430"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 648. Deputy Ged Nash asked the Minister for Education and Youth if she is aware of the difficulties being experienced by already qualified teachers on supply panels (details supplied), who appear to be losing out to newly-qualified teachers for CID posts; and if she will make a statement on the matter. [57940/25] ",
        "by": {
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "showAs": "Ged Nash",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_648",
        "questionNumber": 648,
        "answerText": " Minister for Education and Youth  Teachers on supply panels are considered to be a contracted employee of their base school and can establish an eligibility to an award of a CID, where they satisfy all the relevant criteria set out in the Department Circular 23/2015, governing the award of a CID in the Primary Sector.  Earlier this year I announced two new measures to address ongoing challenges and boost teacher supply. These measures are aimed at ensuring that newly qualified teachers can gain permanent contracts earlier and to assist eligible teachers who trained outside of Ireland to work here.  In relation to the first measure, teachers who have taken up their first contract in a viable teaching post in September of this year will become eligible for a permanent contract in September 2026.  I am determined to address job security and to make teaching a more attractive, sustainable career. This measure which will see teachers who started teaching in September gain a permanent contract a year earlier than they would have previously, by qualifying for the award of a Contract of Indefinite Duration, where they have been re-appointed following a competitive recruitment process. This will provide teachers with the certainty that they need, particularly for those who may be considering large financial commitments, such as those applying for mortgages.  This new measure will apply to both newly qualified teachers, and those teachers who have not yet managed to secure a permanent position, where those teachers satisfy the relevant criteria.  Officials within my Department are currently engaging with the teacher unions and the school management bodies to finalise the details of the new scheme, and these details will be published once this process has been completed. ",
        "debateSection": {
          "showAs": "Teaching Qualifications",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_595",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_595.xml"
            }
          },
          "debateSectionId": "dbsect_595"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1095. Deputy Ged Nash asked the Minister for Housing, Local Government and Heritage if there are any plans to designate Drogheda as a city in law, and for local Government administrative purposes; and if he will make a statement on the matter. [59227/25] ",
        "by": {
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "showAs": "Ged Nash",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1095",
        "questionNumber": 1095,
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  Project Ireland 2040 is the overarching planning and investment framework for the social, economic and cultural development of Ireland.  The National Planning Framework (NPF), together with the National Development Plan, combine to form Project Ireland 2040. The NPF sets out a vision and strategy for the spatial development of Ireland to 2040. The NPF the strategic importance of Drogheda. It aims to support its development and its economic potential as part of the Dublin-Belfast Corridor and, in particular, the core Drogheda-Dundalk-Newry network. This NPF targets significant growth into the regional growth centres, including Drogheda, to enable them to act as regional drivers.  The Revised NPF was approved by Government and the Oireachtas in April 2025. This concluded the Revision process and allows the revised NPF to take effect in the planning system. The NPF aims for a roughly 50:50 distribution of growth between the Eastern and Midland region, and the Southern, and Northern and Western Regions combined, with 75% of the growth to take place outside of Dublin and its suburbs. The Revised NPF retains the strategy approach for Drogheda in relation to its role as a regional driver.  The Local Democracy Taskforce, which was established in June of this year, will examine the local government sector with a view to bringing forward recommendations of reform. The Taskforce will examine the following areas within the sector: functions, structures (including matters in respect of municipal districts, area committees and town-related bodies), funding and governance arrangements. The Taskforce is due to submit its recommendations in the first half of 2026, which will then be considered by Government. ",
        "debateSection": {
          "showAs": "Urban Development",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_956",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_956.xml"
            }
          },
          "debateSectionId": "dbsect_956"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Rural",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 2165. Deputy Ged Nash asked the Minister for Rural and Community Development and the Gaeltacht if additional financial support will be made available to community development organisations, in terms of their core funding under various Department-supported funding streams, to assist them in meeting their obligations as employers under the new pension auto-enrolment obligations from 2026; and if he will make a statement on the matter. [57884/25] ",
        "by": {
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "showAs": "Ged Nash",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_2165",
        "questionNumber": 2165,
        "answerText": " Minister of State at the Department of Rural and Community Development and the Gaeltacht  I propose to take Questions Nos. 2165 and 2181 together.  The Government's five-year strategy, Sustainable, Inclusive and Empowered Communities, which has been extended to end 2025, aims to support the community and voluntary sector. This whole of Government strategy, led by my Department, is implemented and overseen collaboratively with the sector through the Cross Sector Group on Local and Community Development.  The community and voluntary sector is quite diverse and receives financial support through a wide range of funding programmes and schemes from Government departments and agencies, including my own Department.  My Department’s Social Inclusion and Community Activation Programme (SICAP), is our country’s primary social inclusion intervention. The current SICAP Programme, which began on 1st of January 2024 will run until the end of 2028. An increase in core funding of €1.5m has been secured for the programme in 2026, in line with the Programme for Government’s commitments to incrementally increase funding for SICAP, bringing the annual funding in 2026 to over €50m.  As part of funding arrangements for SICAP, Programme Implementers are permitted to use up to 25% of their overall annual allocation to cover administration costs associated with delivering the programme, including staff salary and pension costs.  The Community Services Programme (CSP) currently supports 427 community-based organisations, with a budget of €59.4m allocated for 2026, to provide local services through a social enterprise model. The CSP contribution is not aligned to the minimum wage and is not intended to meet the full employment cost of supported posts. The contribution must be co-funded by other sources, for example, from income received from the public for the use of their facilities and services.  My Department has no operational role in relation to the wage rates, including pension obligations arising for community development organisations, including CSP-supported organisations. These are solely matters for the Boards of those organisations, to manage as the respective employers, subject to compliance with employment legislation. Notwithstanding this, increased funding has been provided over the past three years to most CSP-funded organisations to support increases in the costs of employment.  The New Solutions Social Innovation Fund, which is co-funded through the European Social Fund+ 2021-2027 (ESF+), is aimed at reducing the risk of poverty and social exclusion, with an emphasis on disadvantaged groups. Under the initiative, salary and pension costs for employees are allowable costs, subject to evidenced invoice payments.  Údarás na Gaeltachta has a comprehensive strategic development approach to managing the increased demand for funding from Gaeltacht community development organisations, with a 59% increase in direct funding provided to these organisations over the past five years. The distribution of funding is based on annual work plans prepared by the community development organisations. The Community Development Unit within an tÚdarás in collaboration with the relevant officers and Regional Managers, carries out a comprehensive assessment of the applications to address the needs of the organisation. ",
        "debateSection": {
          "showAs": "Departmental Funding",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1870",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1870.xml"
            }
          },
          "debateSectionId": "dbsect_1870"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Air Corps",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_173.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_173",
          "debateSectionId": "dbsect_173"
        },
        "to": {
          "showAs": "Defence",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Tánaiste and Minister for Defence  The State’s investment in three C-295 aircraft and associated costs represents is a significant investment which serves as an indication of the Government’s ongoing commitment to ensuring that all branches of the Defence Forces continue to retain a range of flexible conventional military capabilities to meet the roles assigned.  The C295 Military Patrol aircraft’s are primarily equipped for maritime surveillance, particularly fisheries protection, but can also provide the Air Corps with the capability to deliver a range of services including logistics support and transport of troops and equipment, medical evacuation and air ambulances, search and rescue and a general utility role.  The Deputy will appreciate that, for operational and security reasons, it would not be appropriate to disclose further details of the operational deployment of individual Air Corps aircraft. ",
        "questionType": "written",
        "showAs": " 233. Deputy Ged Nash asked the Tánaiste and Minister for Defence given the investment of over €230 million in two new maritime surveillance aircraft for the Air Corps delivered in 2024, the targets that have been set by his Department and military command for a minimum level of surveillance flying hours per year; and if he will make a statement on the matter. [57166/25] ",
        "questionNumber": 233,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Ged Nash",
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_233"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Air Corps",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_174.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_174",
          "debateSectionId": "dbsect_174"
        },
        "to": {
          "showAs": "Defence",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Tánaiste and Minister for Defence  I am advised that the military authorities currently avail of external service providers to assist in the conversion training referred to by the Deputy. I am given to understand that same meets the current training requirements of the military authorities. This policy will be kept open to review as the fleet and associated training requirements develop in the coming years. ",
        "questionType": "written",
        "showAs": " 234. Deputy Ged Nash asked the Tánaiste and Minister for Defence since the retirement of the King Air 200, multi-engine flight training in the Air Corps has been outsourced to civilian flight schools, if he intends continuing with this policy; if not, if there will be efforts to bring multi-engine conversion and airline pilot standards multi crew coordination courses back in-house; if this will feature as part of any future PC9 replacement contract; and if he will make a statement on the matter. [57167/25] ",
        "questionNumber": 234,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Ged Nash",
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_234"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_175.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_175",
          "debateSectionId": "dbsect_175"
        },
        "to": {
          "showAs": "Defence",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Tánaiste and Minister for Defence  My Department, with the Defence Forces, is developing  a series of masterplans for each Defence Forces installation, which will be developed to future-proof these locations for the next 20-30 years. The first such masterplan for the Airside in Casement Aerodrome, Baldonnel, was completed earlier this year and sets out a number of recommendations in relation to the development of the aerodrome in response to the level of ambition this Government has set for the Air Corps. The masterplan sets out the layout and operational functionality of the current and future airbase. As such, I do not intend to publish the report at this time when it could adversely affect the security and defence of the State if detailed information about the current and future structure and operations of a military installation were publicly available.  In total, the masterplan for Casement Airside provides development options equivalent to over €200 million in investment. These plans will dovetail with developments already identified under the current IDP, and will also lay out requirements for the years from 2027 onwards.   Arising from this masterplan, my Department is currently in the process of tendering for an Integrated Design Team to undertake the design and construction oversight for the construction works on three (3) Aircraft Hangars, one of which will be a new, dedicated maintenance hangar. ",
        "questionType": "written",
        "showAs": " 235. Deputy Ged Nash asked the Tánaiste and Minister for Defence given the approval of the master plan for the infrastructural development of Casement Aerodrome, when these plans will be published; if they will be resourced as part of voted budget or funds set aside under the NDP; and if he will make a statement on the matter. [57168/25] ",
        "questionNumber": 235,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Ged Nash",
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_235"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Air Corps",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_177.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_177",
          "debateSectionId": "dbsect_177"
        },
        "to": {
          "showAs": "Defence",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Tánaiste and Minister for Defence  Ireland will assume the Presidency of the Council of the European Union from July to December 2026. This will involve a significant programme of meetings and events across the country, including a number of major summits in Dublin. My Department is committed to ensuring a successful Irish Presidency and will work closely with other Departments and State agencies in the planning and delivery of Ireland’s programme.  The Defence Forces will be important in supporting the safe and secure delivery of the Presidency. As the Deputy will appreciate, for operations reasons, it would not be appropriate for me to detail the operational measures to be put in place at this juncture. ",
        "questionType": "written",
        "showAs": " 236. Deputy Ged Nash asked the Tánaiste and Minister for Defence given the Air Corps has previously employed the armed PC9 as an air interceptor for high profile security events such as the visit of Queen Elizabeth II and given recent personnel issues in the Air Cops, if the Air Corps presently has trained pilots to employ the PC9 in this armed role; if it will feature as a part of security arrangements for the upcoming EU presidency; and if he will make a statement on the matter. [57169/25] ",
        "questionNumber": 236,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Ged Nash",
          "memberCode": "Gerald-Nash.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Gerald-Nash.D.2011-03-09"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_236"
      }
    }
  ]
}