{
  "head": {
    "counts": {
      "questionCount": 1763,
      "resultCount": 1763
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Enterprise, Tourism and Employment  I propose to take Questions Nos. 403 and 410 together.  The Deputy has asked for details of the progress made over the past 12 months on each of my Department’s Programme for Government commitments. I am pleased to report that since January 2025, my Department has made substantial progress in delivering on the commitments set out in the Programme for Government with significant progress achieved across a wide range of areas. Our focus has been on supporting enterprise, fostering innovation, strengthening tourism, and ensuring high-quality employment opportunities across all regions of Ireland.  Employment continues to grow strongly, with 30,700 jobs created in the year to Q3 2025, bringing total employment to over 2.82 million. This represents an increase of 1.1% compared to Q3 2024, with regional employment outside Dublin rising by 23,700 (+1.2%).  Inward investment has remained robust. IDA Ireland supported 179 investments by global companies in the first half of 2025, a 37% increase on the same period last year, expected to deliver cutting-edge research and development and create over 10,000 jobs. IDA also launched its new five-year strategy, Adapt Intelligently: A Strategy for Sustainable Growth and Innovation 2025–2029, aligning with Programme for Government objectives.  Enterprise Ireland continues to drive export growth, with client companies achieving exports of €36.75 billion in 2024, up 7% on the previous year. Over 234,000 people are now employed in EI-supported companies.  Key policy initiatives have been advanced, including the publication of the Action Plan on Competitiveness and Productivity in September, supported by €3.68 billion in allocations under the National Development Plan Review 2025.  We launched the Government’s Action Plan on Market Diversification and led trade missions to Japan, Canada, the UAE, and the United States. A Small Business Unit was established, fulfilling a key Programme for Government commitment, and we convened the first meeting of the Cost of Business Advisory Forum. Regulations were signed to implement the EU Directive on reducing administrative burdens and simplifying corporate sustainability reporting.  In line with the Programme for Government a key priority of mine is reducing red tape and simplifying processes for small businesses. Key highlights in this regard include:  • Grant simplification: The newly established Small Business Unit has reviewed all Local Enterprise Office (LEO) grant schemes, resulting in a reduction of application questions, down 47% for Business Expansion Grants, 30% for the Green for Business Grant and 28% for the Feasibility Grant with further reductions targeted.  • 'Once only' principle: Work is underway to merge application processes across different grants, ensuring businesses only need to provide their data once.  • Faster approvals: Enterprise Ireland has been tasked with achieving a 24-hour turnaround time for grant application approvals.  • EU regulatory relief: Ireland was among the first in Europe to sign regulations exempting 80% of small businesses from the scope of the EU Corporate Sustainability Reporting Directive (CSRD), with a two-year delay granted to others pending further EU negotiations.  • SME Test expansion: In 2024, 26 SME Tests were applied across 8 Government Departments, 10 of which were conducted by the Department of Enterprise, Tourism and Employment. These tests assess the impact of new legislation on small businesses and propose mitigation measures. This figure is expected to increase with all departments mandated to apply SME Tests for new policies.  • Listening to businesses: My officials are actively engaging with stakeholders through the Enterprise and Retail Forums and the Cost of Business Advisory Forum to identify high-impact burdens and opportunities for reform  • Digital transformation: 95% of filings with the Companies Registration Office are now online and the Workplace Relations Commission has implemented Robotic Process Automation to streamline complaint handling.  • Business support access: The National Enterprise Hub has handled over 7,500 enquiries, simplifying access to over 250 supports from 29 departments and agencies.  • Regulatory modernisation: Updates to the Companies Act, the introduction of SCARP (Small Companies Administrative Rescue Process), and reforms to co-operative legislation are making compliance more flexible and accessible.  • EU engagement: The Department of Enterprise, Tourism and Employment continues to shape EU policy through active participation in working groups, supporting simplification efforts such as the EU Startup and Scaleup Strategy and the forthcoming Digital Simplification Package.  In line with the Programme for Government commitment, tourism policy has been strengthened with its functions transferring to my Department and with the launch of A New Era for Irish Tourism, Ireland’s new National Tourism Policy Statement, and the publication of the Tourism Sectoral Adaptation Plan 2025–2030, the first of its kind for the sector. These initiatives aim to ensure balanced regional development and resilience in the face of climate change.  Innovation remains central to our agenda. Under the Disruptive Technologies Innovation Fund, €159 million has been awarded to 27 projects addressing major societal and economic challenges. We launched Ireland’s first Semiconductor Strategy, positioning Ireland as a key player in Europe’s semiconductor future. Additional commitments have been advanced through convening of the Employment Law Review Group, the publication of the Action Plan to Promote Collective Bargaining 2026–2030. The Employment Permits function has had a very strong year, reducing the backlog to its lowest level since 2022 and achieving the fastest processing timelines to date. The permit system digitally transformed facilitating the more efficient and secure processing permits with critical skills processing times down to 10 days. This progress is critical given the service’s central role in enabling business growth and job creation, supporting Ireland’s economic development over recent years. New categories of permits issued including town planners, and a seasonal permits scheme.  In the Programme for Government, there is a firm commitment to support the central role played by the Workplace Relations Commission and the Labour Court in industrial relations and employment matters. A new chair of the Labour Court was appointed in April and the WRC continues to play a critical role in ensuring that employment rights are upheld for all, recovering over €2 million in unpaid wages on foot of 5,156 inspections completed during 2024. The WRC plays a leading role in contributing to the harmonious industrial relations climate with data for conciliation services showing an 85% success rate.  I secured Government agreement to adopt a distributed model of implementation of the EU Artificial Intelligence (AI) Act. This approach will build on the deep knowledge and expertise of the established sectoral regulators. Following this in September 2025 a national single point of contact has also been established within the department to streamline coordination between Irish regulators, the European Commission, and stakeholders. The Single Point of Contact serves as the interface with the public, other Member States, and EU-level counterparts with its purpose to streamline communication and coordination for the implementation and enforcement of the AI Act.  Over the last 18 months my Department’s Officials have been putting in place the structures for a successful Presidency and have been working through the Department of Foreign Affairs and Trade’s Interdepartmental Groups on Presidency Policy Priorities and Operation Planning on progressing Ireland’s policy priorities and operational planning for the Presidency. This work will continue right up to 1st July 2026 when Ireland assumes the Presidency of the Council of the European Union. My Department’s Presidency Planning Team will continue to collaborate across government to ensure that all perspectives are heard and considered in a fair and inclusive manner.  In line with commitments in the Programme for Government my Department continued work to strengthen the Competition and Consumer Protection Commission. the CCPC to strengthen its mandate through the addition to and enhancement of its senior leadership team. In addition, the recruitment of an additional CCPC Member is ongoing, and the CCPC has recently commenced the recruitment of two Senior Directors who will have a direct role in supporting the Members to ensure it can continue to deliver on its important brief. In parallel, the Department is reviewing the legislative framework governing consumer protection fines. Future penalties are expected to align with those applicable to competition law infringements, ensuring greater consistency and impact across the regulatory landscape.  Further progress includes commissioning research to inform the review of Personal Injuries Guidelines, launch of the new Action Plan for Insurance Reform which 11 actions for delivery by my Department and new mediation service from the Personal Injuries Resolution Board. I have also launched a public consultation on the new National Life Sciences Strategy, and announced €170 million investment in European Space Agency programmes to support innovation and technology commercialisation.  Supported by Ministers Dillon and Smyth good progress is being made across all relevant commitments beyond the main achievements highlighted above, in fulfilment of the Programme for Government. Full details of these achievements and ongoing initiatives will be published in the Department’s Annual Report for 2025. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 403. Deputy Frankie Feighan asked the Minister for Enterprise, Tourism and Employment the progress made over the past 12 months on each of his Department's Programme for Government commitments, in tabular form; and if he will make a statement on the matter. [71636/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_301",
          "debateSectionId": "dbsect_301",
          "showAs": "Programme for Government",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_301.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_403",
        "questionNumber": 403
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  My officials are working to consolidate the information sought by the Deputy in relation to the progress made over the past 12 months on each of my Department’s Programme for Government commitments. I will arrange to have the material compiled and forwarded to the Deputy as soon as it is available. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 447. Deputy Frankie Feighan asked the Minister for Education and Youth the progress made over the past 12 months on each of her Department's Programme for Government commitments, in tabular form; and if she will make a statement on the matter. [71635/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_337",
          "debateSectionId": "dbsect_337",
          "showAs": "Programme for Government",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_337.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_447",
        "questionNumber": 447
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for children with special educational needs.  In order to support the NCSE and forward planning my department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE through the Parent Notify process that they are seeking a special educational placement for their child.  This notification process will provide the NCSE with critical information on children who continue to need a special class as they progress to post-primary level as well as details on students who require a place for the first time. This year to facilitate earlier sanctioning of classes for the 2026/27 school year, an earlier date of 1 October was set for parents to complete the process.  The NCSE is undertaking analysis of information provided through the Parents Notify process to plot demand for special class places for the 2026/27 school year. The NCSE will also consider vacant places in existing special classes and places that will become available through the regular transition of children from primary to post-primary schools. Once this analysis is completed the NCSE will be equipped to engage with schools to open new special classes in relevant areas. It is expected that these special classes will be sanctioned in the coming weeks.  This new timeline was publicised widely and communicated with schools and special education advocacy groups and parent representative bodies. The NCSE also undertook a lot of work at local level to ensure that families were aware of the timeline and process and consequently report a significant level of engagement and contact from families ahead of the 1 October closing date.  The NCSE advise that the majority of children and young people coming to them through the Parent’s Notify process are already enrolled in school and are being supported by existing special education teachers and special needs assistants.  My department and the NCSE are committed to ensuring that sufficient special education placements remain available for children with special educational needs and will continue to review and monitor the situation as to where new specialist provision is required. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 483. Deputy Frankie Feighan asked the Minister for Education and Youth when a school in County Leitrim (details supplied) will receive sanction for an autism class; and if she will make a statement on the matter. [72162/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_373",
          "debateSectionId": "dbsect_373",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_373.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_483",
        "questionNumber": 483
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Culture, Communications and Sport  I intend to publish an update on progress in relation to the progress made in relation to my Department’s Programme for Government commitments on my Department’s website (www.gov.ie/en/department-of-culture-communications-and-sport/) shortly. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 531. Deputy Frankie Feighan asked the Minister for Culture, Communications and Sport the progress made over the past 12 months on each of his Department's Programme for Government commitments, in tabular form; and if he will make a statement on the matter. [71634/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_415",
          "debateSectionId": "dbsect_415",
          "showAs": "Programme for Government",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_415.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_531",
        "questionNumber": 531
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The information requested is being compiled and will be forwarded to the Deputy in accordance with Standing Orders. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 563. Deputy Frankie Feighan asked the Minister for Housing, Local Government and Heritage the progress made over the past 12 months on each of his Department's Programme for Government commitments, in tabular form; and if he will make a statement on the matter. [71633/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_444",
          "debateSectionId": "dbsect_444",
          "showAs": "Programme for Government",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_444.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_563",
        "questionNumber": 563
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 700 and 741 together.  Delivering on the commitments laid out in the Programme for Government is a priority for me as Minister, my Department and my colleagues, Ministers of State Colm Brophy and Niall Collins. Working with them, I want to ensure that our justice system is modern, efficient, and responsive to the needs of all of our people. To serve the fundamental need of all people to feel safe and secure in their homes and in their communities.  I was pleased to recently publish the new Statement of Strategy for my Department for 2025–2028. The Strategy aligns with the Programme for Government, sets out my Department’s strategic direction to 2028 and will further the work towards our shared vision of a safe, fair and inclusive Ireland.  Some of my Department's achievements regarding commitments set out in the Programme for Government (PfG) since the formation of the Government are set out below.  Garda Recruitment  My first priority as Minister for Justice is to get more Gardaí out onto our streets preventing the commission of crime through high visibility patrols. Increased recruitment and appropriate civilianisation where possible are vital to achieving this as is modern technology and equipment and active management of Garda resources. The PfG commits to recruiting at least 5,000 Gardaí in the coming five years. As we strengthen An Garda Síochána, we will see more Gardaí visible in our communities tackling and preventing crime.  This year 794 new recruits have been welcomed into the Garda College in Templemore. This is the highest number recruited since 2018. This includes an intake of 223 trainees in November, the largest single intake in over a decade. Recruitment into An Garda Síochána is now gathering real momentum. New Garda recruits are already making an impact in their communities and the ongoing recruitment of new Gardaí will see further progress in increasing Garda numbers across the State.  Policing, Security and Community Safety Act 2024  On 2 April 2025, I was pleased to commence the landmark Policing, Security and Community Safety Act 2024, in line with the PfG.  As a result, the following bodies were established:  • The new Garda Board  • The Policing and Community Safety Authority (replacing the existing Policing Authority and Garda Síochána Inspectorate)  • Fiosrú – the Office of the Police Ombudsman  • The Office of the Independent Examiner of Security Legislation  • The National Office for Community Safety  The Act strengthens and consolidates independent, external oversight of An Garda Síochána; makes community safety a whole of government and multi-agency responsibility and enhances the internal governance of An Garda Síochána by establishing a new non-executive board which is a corporate governance standard across the public and private sectors.  Tackling Anti-Social Behaviour  The Government’s focus on youth diversion and interventions is a keystone in the Youth Justice Strategy, which is a forward-thinking plan designed to address the unique challenges faced by young people in Ireland. At its core, the Strategy emphasises early intervention, prevention, family support, and community engagement. It includes key objectives aligned with PfG commitments, aimed at promoting positive behavioural change, and it is only by targeting this behaviour that we can break the cycle of offending by young people. YDPs work with young people at risk of crime and anti-social behaviour to divert them away from criminal behaviour and towards better life outcomes.  In November, I was pleased to announce with Minister of State Collins that the State’s network of Youth Diversion Projects (YDPs) has been successfully rolled out nationwide, making these critical interventions available to young people at risk of engaging in criminal activity no matter where they live in Ireland.  Prisons and Penal Policy  A multi-year building programme is currently progressing at several key sites across the prison estate. To accelerate delivery, agreement has been secured for six major projects to bypass the first approval gate of the Infrastructure Guidelines. This decision is expected to bring forward delivery timelines on those six projects by 12 to 18 months. This acceleration reflects the priority placed by the PfG on strengthening the prison system’s resilience and supporting the Irish Prison Service to provide safe, secure and humane accommodation.  Electronic Monitoring  My Department is leading a cross-agency project to introduce electronic monitoring for specific categories of individuals, as committed to in the Programme for Government, and in line with existing legal provisions. Existing legislation, including the Bail Act 1997, as amended, the Criminal Justice Act 2006, as amended and the Sex Offender Act 2001, as amended, provide for electronic monitoring, in certain circumstances.  I had committed to the publication of a Request for Tender (RFT) for the provision of an electronic monitoring service provider by the end of 2025. This Request for Tender has now been published with a closing date of the 16 January 2026 at 5pm.  My Department is tendering for an electronic monitoring service provider for a 12-month pilot phase, which will focus on individuals on temporary release nationally and those admitted to bail in a pilot area. It is proposed to utilise 30 to 50 electronic tags during this phase. This is expected to provided capacity to electronically monitor between 90 and 150 people in a year, but exact numbers monitored will depend on a range of factors including individuals’ lengths of time on bail or on temporary release, and individuals’ personal circumstances, including ongoing suitability and compliance with conditions.  The pilot approach will allow for processes and procedures to be tested before a wider scale national rollout, while also supporting the agencies involved to build capability and knowledge of the electronic monitoring system. Insights from the pilot will inform any future national rollout and procurement. The pilot is expected to be operational in 2026.  A Modern Courts and Legal System  I am committed to enacting essential legislative reform to modernise and streamline our Courts and legal system including:  General Scheme of the Civil Reform Bill  I obtained Government approval to prepare a General Scheme of a Civil Reform Bill. The Civil Reform Bill is a key implementation measure of the Kelly Report of the Review of the Administration of Civil Justice. As part of the Bill, it is my intention to introduce provisions which will codify the existing law on judicial review by placing it on a statutory basis. The measures should achieve greater transparency in the law and lead to a more streamlined review process.  Key reforms should ensure that the system cannot be misused on purely technical grounds, that the public interest is placed at the heart of judicial review, costs are reduced where possible and litigants have sufficient standing to properly challenge decisions. Given the significant challenges currently facing our State in terms of housing shortages, energy deficits, inadequate water supplies and climate change, all of which are exacerbated by the demands of a rising population, we can no longer delay on reform of the judicial review system. I am confident that the Bill will remove weaknesses in the current law, eliminate impediments to progress and deliver reform for the public benefit. I am also confident that measures in the Bill preserve the right of the citizen to ensure that public bodies act lawfully and are accountable for their decisions.  General Scheme of the Criminal Law and Civil Law (Miscellaneous Provisions) Bill 2025  In May, I secured Government approval to progress the General Scheme of the Criminal Law and Civil Law (Miscellaneous Provisions) Bill 2025, which inter alia significantly expands the courts' powers to conduct criminal proceedings remotely, provides for the digitalisation of court documents in such proceedings, criminalises the exploitative practice of seeking sex in lieu of rent, amends the law on disclosure of counselling records in sexual offence trials, and empowers the Gardaí to direct the removal of face coverings in certain public order situations.  The Bill also incorporates legislative amendments to the Criminal Justice (Community Service) Act 1983 and the Criminal Justice (Community Service) (Amendment) Act 2011 to provide that the limit of community service hours be increased from 240 up to 480 hours. This action also includes the requirement for the judiciary to consider community service be mandatory where considering a custodial sentence of up to 2 years or less. It is anticipated that the Bill will be published this year.  I was pleased to receive Cabinet approval for the Bill today 16 December.  Family Law Reform  The ongoing reform of the Family Justice system, for the benefit of families and children, is another of my key priorities.  On 28 April, I hosted my first meeting of the Family Justice Development Forum, and I look forward to the next one planned for 19 January.  This was followed in May by the publication of the Review of the Operation of the In Camera Rule in Family Law Proceedings. The review, a key action in the Family Justice Strategy, was conducted by a team from University College Cork and Trinity College Dublin and is an important piece of research which details the perspectives of many stakeholders regarding the current understanding and operation of the in-camera rule in family law proceedings. Importantly, it includes the views of those who have been parties in such proceedings. Officials from my Department are currently engaging with a variety of stakeholders and working on a policy paper regarding how some of the recommendations made in the report could be implemented.  In August of this year, I published two tenders for the provision of new family law services aimed at making our system more transparent and better for children. The first is for a Private Family Law Reporting Project to provide transparency for the public and increase awareness and understanding of family law proceedings while ensuring that children’s and parents’ right to privacy is upheld. I am pleased to say that the Child Law Project has been contracted to deliver the three year project and work on it has commenced. The second is for a service to provide a new and innovative way to hear children’s voices in private family law proceedings. The Children’s Court Advocate Pilot Project will initially be established in Waterford and Clonmel, ensuring that all children to whom guardianship, custody or access applications relate can have the opportunity to be informed about the proceedings relating to them and have their voice heard without any cost to families.  In October this year I launched a social media campaign to promote a culture of paying child maintenance. This was a recommendation in the Review of the Enforcement of Child Maintenance Orders. Work on implementing the other recommendations in the review is ongoing with child maintenance guidelines and an accompanying calculator due to be launched in January.  In November I hosted a stakeholder event where the OECD and the World Justice Project released the preliminary findings of my Department’s first Legal Needs Survey. The survey forms part of a project Ireland is participating in to develop people-centred justice services to enhance access to justice, including in family justice. I look forward to the full findings being published in 2026.  Domestic, Sexual, and Gender-Based Violence Strategy  Combatting all forms of domestic, sexual and gender-based violence (DSGBV) has been of central importance for me since taking office.  In June, I published the final implementation plan of the five-year ‘Zero Tolerance’ National DSGBV Strategy setting out the delivery targets and collective action to end 2026. The plan builds on the DSGBV commitments set out in the PfG and contains 95 specific actions across the four pillars of the Istanbul Convention. There is a strong emphasis on delivery, collective responsibility, and meaningful outcomes.  Amongst the key deliverables are actions already underway in respect of significant legislative reform commitments including:  • Prioritising the drafting of the Guardianship of Infants (Amendment) Bill that will, in certain situations, allow for the removal of guardianship rights from individuals convicted of killing the other parent or guardian of their child;  • Limiting the disclosure of counselling records in rape and sexual assault cases;  • Banning sex for rent under the Criminal Law and Civil Law (Miscellaneous Provisions) Bill 2025;  • Introducing the Criminal Law (Sexual Offences, Domestic Violence, and International Instruments) Bill 2025 which will introduce the Domestic Violence Register of Judgments - known as ‘Jennie’s Law’ - bringing greater transparency and accountability for serious offenders;  • Establishing the necessary legislative basis to provide for Operation Encompass, which will enable An Garda Síochána to share information with schools when a child has been exposed to domestic violence.  As part of the Zero Tolerance Strategy, Government committed to doubling domestic violence accommodation capacity in Ireland by the end of 2026 from 141 to 282 family units.  The following safe accommodation target was set earlier this year  • 52 new family refuge units by the end of 2026  • 45 new safe homes by the end of 2026  • 50 new units under construction by the end of 2026  Therefore, by the end of 2026 it is envisaged to have 94 safe homes and 193 refuge units completed, bringing total safe accommodation to 287, with 50 further refuge units under construction. I am continuing to work with Cuan, my Department and the Department of Housing to ensure we are exhausting all measures to increase the pace of delivery for this much needed additional capacity.  Immigration  My Department has taken action to significantly improve immigration enforcement measures and increase removals in line with commitments set out in the PfG. This includes the renewed use of chartered deportation flights. To date this year 4,454 deportation orders have been signed and 1,952 people have departed the State under various mechanisms.  In keeping with the PfG commitment to significantly enhance the delivery of public services digitally, phase one of my Department's Immigration Customer Service Portal, which enables applicants to check their immigration application status, book first-time registration appointments, and submit queries, has been operational since last October. To the end of Q3 2025, more than 195,000 customers have registered, with over 150,000 queries resolved and in excess of 88,000 registration appointments made.  In April I secured Government approval to draft the International Protection Bill, the most significant reform of Irish asylum laws in the history of the State in line with the EU Migration and Asylum Pact. The Pact is a new EU framework to manage migration and asylum for the long-term. The overall objective of the Pact is to provide a fair, sustainable and efficient asylum procedure. These important changes include streamlining the decisions process, streamlining the returns process, a new ‘Border procedure’ with a three-month time limit for decisions, and new institutional arrangements for international protection decisions and appeals.  State-Owned Accommodation  I am committed to reforming Ireland’s international protection system to ensure its efficiency and robustness. A stable and sustainable accommodation network is a central element of that reform and a key PfG commitment. State-owned centres are part of the Government’s long-term plan to reduce the reliance on private accommodation providers resulting in better value for money of public funds and a more efficient international protection system. The purchase of the Citywest Hotel in June was a significant step in achieving this.  The viability of other properties that could be utilised as state-owned accommodation is currently being accessed.  Integration  Work on the publication of a new national Migration and Integration Strategy is ongoing as referenced in the PfG.  The Minister of State for Migration, Colm Brophy, recently announced the 37 projects set to receive over €1.5m in funding under the Ireland Against Racism Fund 2025. This Fund enables non-government and community organisations to provide national and regional projects and local initiatives that combat racism and promote racial equality. The Fund is a key part of the National Action Plan Against Racism (NAPAR) which was informed by the experiences of people who have been directly affected by racism.  This is in addition to the Integration Fund which combines two previously run funds – the International Protection Integration Fund (IPIF) and the Communities Integration Fund (CIF). Since their inception, these funds have provided close to €10m in funding to more than 1,000 projects across the country. This fund is for projects supporting migrant integration in areas such as sport, education, employment, and culture. Results of the 2025 Integration Fund were announced in November. 117 projects were awarded a total of €3.6m.  Transfers of Responsibilities  In line with PfG commitments, responsibility for integration, International Protection Accommodation Services (IPAS), and the Ukraine Division transferred to my Department from the Department of Children, Equality, Disability, and Equality on 1 May 2025. This transfer includes the transfer of all staff, approximately 340 people, alongside a substantial budget transfer of approximately €2.1 billion. As my Department had existing responsibility for immigration and migration and the processing of applications for international protection, this transfer underpins a more cohesive and strategic approach to migration and integration.  The National Cyber Security Centre (NCSC) also transferred to my Department from the Department of the Environment, Communications and Climate on 2 June 2025. The NCSC is the lead government agency on cyber security.  Responsibility for the Irish Film Classification Office (IFCO) transferred from my Department on 1 August to the Department of Culture, Communications and Sport. This transfer was carried out in line with the Programme for Government and aligns the work of IFCO with the Department responsible for culture. Responsibility for the Property Services Regulatory Authority (PSRA), as well as the Property Services Appeal Board, also transferred from my Department on 1 August to the Department of Housing, Local Government and Heritage. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 700. Deputy Frankie Feighan asked the Minister for Justice, Home Affairs and Migration the progress made over the past 12 months on each of his Department's Programme for Government commitments, in tabular form; and if he will make a statement on the matter. [71630/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_552",
          "debateSectionId": "dbsect_552",
          "showAs": "Programme for Government",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_552.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_700",
        "questionNumber": 700
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The Department is currently collating the information requested and a reply will issue directly to the Deputy on this matter as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 822. Deputy Frankie Feighan asked the Minister for Children, Disability and Equality the progress made over the past 12 months on each of her Department's Programme for Government commitments, in tabular form; and if she will make a statement on the matter. [71628/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_648",
          "debateSectionId": "dbsect_648",
          "showAs": "Programme for Government",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_648.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_822",
        "questionNumber": 822
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 947. Deputy Frankie Feighan asked the Minister for Health the progress made over the past 12 months on each of her Department's programme for Government commitments, in tabular form; and if she will make a statement on the matter.  [71631/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_760",
          "debateSectionId": "dbsect_760",
          "showAs": "Programme for Government",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_760.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_947",
        "questionNumber": 947
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1165. Deputy Frankie Feighan asked the Minister for Further and Higher Education, Research, Innovation and Science the progress made over the past 12 months on each of his Department's programme for Government commitments, in tabular form; and if he will make a statement on the matter.  [71629/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_981",
          "debateSectionId": "dbsect_981",
          "showAs": "Programme for Government",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_981.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1165",
        "questionNumber": 1165
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  I propose to take Questions Nos. 1181 and 1187 together.  The Programme for Government, Securing Ireland’s Future , is a programme of investment and reform, backed by ambitious actions, which will support significant progress in addressing critical challenges.  Since this Government was formed, my Department has achieved significant progress across all actions for which it is responsible across the areas of rural development, community development, and Gaeltacht and the Islands. Comprehensive updates are set out in the table at the following link, and these updates demonstrate the extent of delivery across both policy and schemes in 2025.   Progress on Department Programme  ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 1181. Deputy Frankie Feighan asked the Minister for Rural and Community Development and the Gaeltacht the progress made over the past 12 months on each of his Department's Programme for Government commitments, in tabular form; and if he will make a statement on the matter. [71627/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_995",
          "debateSectionId": "dbsect_995",
          "showAs": "Programme for Government",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_995.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1181",
        "questionNumber": 1181
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  Disability Allowance (DA) is a weekly allowance paid to people with a specified disability who are aged 16 or over and under the age of 66. This disability must be expected to last for at least one year and the allowance is subject to medical assessment, means test and habitual residency conditions.  I can confirm that my Department received an application for DA from the above-named person on 13 November 2025. As their initial application did not contain all the information required to make a decision on entitlement, an information request letter was sent to the person concerned on 21 November 2025. I can confirm documentation was received from the person concerned on 28 November 2025.  The person concerned has been awarded DA with effect from 01 October 2025. The first payment will be made on 07 January 2026. Arrears of payment due from 01 October 2025 to 06 January 2026 will issue as soon as possible.  The person concerned was notified of this decision in writing on 02 December 2025.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 456. Deputy Frankie Feighan asked the Minister for Social Protection when an application for disability allowance by a person (details supplied) will be decided given the family urgently need assistance. [70934/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_447",
          "debateSectionId": "dbsect_447",
          "showAs": "Social Welfare Benefits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_447.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_456",
        "questionNumber": 456
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The person concerned applied for State pension (contributory) on 22 July 2025. Confirmation of their modified social insurance contribution record was received from the Department of Education on 24 November 2025.  The person concerned was also awarded Long Term Carers Contributions which can be included in the calculation of state pension contributory from 1 January 2024. The state pension contributory was awarded on 4 December 2025 at the current weekly rate of €246.30 plus the increase for Living alone of €22.00. This pension was awarded with effect from 1 January 2024. Arrears due will be paid on 12 December 2025.  I hope this clarifies the position for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 557. Deputy Frankie Feighan asked the Minister for Social Protection if his Department will confirm the pension contributions made by a person (details supplied); and if he will make a statement on the matter. [69611/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_479",
          "debateSectionId": "dbsect_479",
          "showAs": "Departmental Correspondence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_479.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_557",
        "questionNumber": 557
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 35. Deputy Frankie Feighan asked the Minister for Climate, Energy and the Environment the progress made over the past 12 months on each of his Department’s Programme for Government commitments, in tabular form; and if he will make a statement on the matter. [67817/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_37",
          "debateSectionId": "dbsect_37",
          "showAs": "Programme for Government",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_37.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_35",
        "questionNumber": 35
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  My Department has made significant progress on the Programme for Government commitments under its remit. Due to the large number of commitments however, it is not possible to include all of these in this response, so they will be provided to the Deputy electronically and in tabular format as requested. Updates on a range of commitments are set out in the table below:      Set an ambitious child poverty target ensuring a focus on inequality.     This commitment has been delivered. A new Child Poverty Target was approved by Government and announced in September 2025.       Continue to expand and improve the Free Hot School Meals programme and ensure that suppliers adhere to robust guidelines on the nutritional value of meals, the dietary requirements of students, reduce food waste and utilise recyclable packaging.     Processing of applications ongoing; work underway on options for smaller schools, including the involvement of local groups, meals on wheels etc. A Dietician is being funded by the Department of Social Protection. This Dietitian who is supervised by the Department of Health and in coordination with the Interdepartmental Group on School Meals will carry out a review of the Nutritional Standards for School meals, and examine supplier menus etc. A report will be prepared for the Minister by the end of the year. The issue of waste and recycling has been written into the new Call for Tender and other procurement templates.       The Government will protect core welfare rates while ensuring that available resources are targeted at vulnerable groups who are unable to work such as carers, people with disabilities and pensioners.     Core welfare rates were protected in Budget 2026, with an above inflation increase of €10 per week in the maximum weekly personal rates of payment. Additional supports were provided such as the largest ever increase in the Child Support Payment, the largest ever increase in the income disregard for Carer’s Allowance, and increases in the weekly rate of Fuel Allowance, Working Family Payment and Domiciliary Care Allowance, among others.       Safeguard the sustainability of the Social Insurance Fund by fully implementing the PRSI Roadmap 2024 – 2028.     The increases agreed as per the PRSI roadmap from 2024 to 2028 were legislated for in the Social Welfare (Miscellaneous Provisions) Bill 2024 which was enacted in July 2024. The first increase of 0.1% across all PRSI rates became effective from 1 October 2024. The second increase of 0.1% on all rates became effective from 1 October 2025.       Progressively increase weekly pension payments.     Budget 2026 provided for a €10 increase in the maximum weekly personal rates of payment across pension schemes.       Examine improvements to key ancillary benefits such as the Fuel Allowance, Household Benefits Package and Living Alone Allowance to support vulnerable groups.     Budget 2026 provided for a number of improvements to the Fuel Allowance scheme. This included:  • A €5 increase in the weekly rate of payment;  • An extension in the eligibility of Fuel Allowance for recipients of the Working Family Payment; and  • People in receipt of Disability Allowance and Blind Pension can retain Fuel Allowance for five years after exiting their payment to take up employment.       Continue to significantly increase the income disregards for Carer’s Allowance in each Budget with a view to phasing out the means test during the lifetime of the Government.       Budget 2026 provides for the largest ever increase in the carer’s allowance income disregards – an increase of €375 per week to €1,000 for single people, and an increase of €750 per week to €2,000 for a couple. This means that a carer in a two-adult household with an income of over €100,000 will retain their full Carer’s Allowance payment.  The latest changes are evidence of the Government’s determination to deliver on its commitment to eliminate the means test over the life-time of its term, and will do so in a progressive manner as part of the annual Budget process.       Introduce a permanent Annual Cost of Disability Support Payment with a view to incrementally increasing this payment.     Due to the cross-departmental nature of the cost of disability, the Taoiseach has set up a Disability Programme Office in his own Department. He has also established a dedicated Cabinet Committee on Disability with a view to driving and monitoring progress in this area.  The recently published National Human Rights Strategy for Disabled People 2025 – 2030 takes a whole of Government approach and includes a commitment to establish a Strategic Focus Network on the Cost of Disability. This will be led by the Department of Social Protection but will involve all relevant Departments and Agencies. The work of this network, which will include people with disabilities and their advocates, will inform the approach to be taken in delivering on this commitment.  I have asked my officials to expedite this work with a view to bringing a proposal to Government in the first half of the year.       Progressively increase weekly Disability Payments and the Domiciliary Care Allowance.     As part of Budget 2026 measures announced:  • a €20 increase in the monthly Domiciliary Care Allowance, and,  • €10 increase in the maximum personal rate of weekly disability payments from January 2026. There will be proportionate increases for people getting a reduced rate       Review the minimum hours requirement under the Wage Subsidy Scheme for people with disabilities and examine an increase to the payment rate.     As a result of reviewing the subsidy rate, Budget 2026 provides that from April 2026:  • The two lower rates of €6.30 and €6.93 are being combined into one rate and increased to €7.50;  • The two middle rates of €7.56 and €8.19 are being combined and increased to €8.50; and  • The two higher rates of €8.72 and €9.45 are being combined and increased to €10.       Promote training initiatives to raise awareness and understanding of disabilities amongst Intreo staff.     Intreo Employment Services provide Disability Awareness training to staff to support their engagement with people with disabilities. The IMS Training and Change Management Team provide training and support on how to engage with DSP customers with disabilities through our Customer Service Courses. The trainers also highlight various training courses for staff to attend that assist with dealing with customers with disabilities e.g. National Disability Authority Training, JAM training, Be Disability Aware.       Examine the eligibility criteria for the Back-to-School Clothing and Footwear Allowance.     Eligibility for the BSCFA was extended to children for whom Foster Care Allowance is being paid from June 2025.  As part of Budget 2026 measures, Back to School Clothing and Footwear Allowance extended to eligible children aged 2 and 3.       Set a new child poverty target and examine ways to lift more children out of child poverty.     New Child Poverty Target approved by Government and announced in September 2025. The successor to the Roadmap for Social Inclusion is being developed.    Budget 2026 provides for a package of measures to tackle child poverty and to support families. The package includes:  • the largest Child Support Payment increase in the history of the State,  • increase in the Working Family Payment thresholds of €60 per week, for all family sizes,  • families receiving the Working Family Payment will qualify for the Fuel Allowance for the first time  • expansion of the Back to School Clothing and Footwear Allowance to 2 and 3 year olds for eligible recipients,  • extension of the Back to Work Family Dividend for people in receipt of Disability Allowance and Blind Pension; and  • increase of €20 per month in the Domiciliary Care Allowance.       Explore a targeted Child Benefit Payment and examine the interaction this would have with existing targeted supports to reduce Child Poverty such as the Working Family Payment and Child Support Payment.     This work is being progressed, having regard to the available body of evidence, including the work undertaken previously by the ESRI, the National Economic and Social Council, and the Commission on Taxation and Welfare.           Expand the eligibility for the Fuel Allowance to families in receipt of the Working Family Payment.     This commitment has been delivered as part of Budget 2026 - families receiving the Working Family Payment will qualify for the Fuel Allowance.       Increase core welfare payments, ensuring that resources are also targeted at people who are unable to work.     Budget 2026 provided for a €10 increase in the maximum weekly rates of core welfare payments.       Progressively increase the Child Support Payment     The DSP 2026 Budget package included the largest Child Support Payment increase in the history of the State, with a weekly increase of €16 to €78 for children aged 12 and over (a 26% increase), and a weekly increase of €8 to €58 for children under 12 (a 16% increase). This brings the total annual value of the Child Support Payment to €3,016 for each child under 12 and €4,056 for each child 12 and over.       Enhance supports for lone parents.     The Department of Social Protection has engaged with stakeholders such as the National One Parent Family Alliance to identify opportunities for enhancing supports to lone parents. Budget 2026 provides for a €10 increase in the weekly rate of one-parent family payment, and a €60 increase in the thresholds of the Working Family Payment for all family sizes.       Enact legislation to give entitlement to unmarried cohabitants to a Widow’s, Widower’s or Surviving Civil Partner’s Contributory Pension.     This commitment has been delivered. The Social Welfare (Bereaved Partner's Pension and Miscellaneous Provisions) Act 2025 was enacted on 21 July 2025. The provisions of the Act commenced from that date.       Complete the roll-out of Hot School Meals to all Primary Schools in 2025.     All primary schools are eligible for the Free Hot School Meals Programme from September 2025. All the procurement templates provided by the Department of Education Schools Procurement Unit were revised by the Department of Education in consultation with the Interdepartmental working group for the Schools Meals Programme and were published on 15 August 2025. New schools joining the programme can avail of the cold lunch option until procurement for Hot Schools Meals has been completed.       Ensure that suppliers adhere to robust guidelines on the nutritional value of meals, the dietary requirements of students, reduce food waste and utilise recyclable packaging.     The nutritional value of school meals, dietary requirements of students etc. will be examined by the Dietitian for the School Meals Programme. Food waste and recycle packaging requirements have been built into the new procurement documentation.       Implement the Summer 2025 Holiday Meals pilot project and evaluate this initiative aimed at closing the nutritional gap during school closures.     As part of the 2025 Budget €1.3 million was allocated for a Holiday Hunger pilot project to support some 68,000 of our most vulnerable children with complex special educational needs and those at greatest risk of educational disadvantage. Applications were received from 914 schools. A draft evaluation is being finalised by the D/Education.       Introduce Pay Related Benefit in March 2025 linking unemployment payments to previous earnings for those who have contributed to the Social Insurance Fund and who lose their jobs.     This commitment has been delivered. Pay Related Benefit (PRB) for jobseekers launched on 31 March 2025.       Introduce the   Auto Enrolment My Future Fund   in September 2025 to provide workers with greater comfort and security regarding their retirement savings       On 29 April 2025 the Minister for Social Protection announced that the collection of contributions for the Automatic Enrolment retirement savings system called My Future Fund will begin from 1st January 2026.       Publish a new Employment Strategy focused on intensive engagement and supports to help those most distant from the labour market into the workforce.     A public consultation was launched with a closing date of end September 2025. 5 Regional Consultation Workshops are being held in Autumn 2025, with the aim to publish the revised Pathways to Work Strategy in mid-2026.       Increase the number of recruitment fairs and job matching services connecting employers with jobseekers.     A total of 612 events have been organised by Employer Relations from January to October 2025, compared to 536 for the same period in 2024. To date in 2025, over 92k jobseekers have met with over 1,895 employers at these events. A total of 1,962 job matching services were carried out by Employer Relations from January to October 2025, compared to 2,070 in the same period in 2024.       Enhance application processes within the Department of Social Protection and provide additional resources where necessary to ensure that individuals receive decisions on their applications in a timely manner.     Additional Appeals Officers assigned to the Social Welfare Appeals Office in response to increased applications received in 2024 and to deal with the associated backlog increase. Further improvements delivered through the Appeals Modernisation project including enhancements to my MyWelfare which facilitate an appellant to easily submit and track their appeal and receive their decision as soon as it is available. New Appeals Regulations implemented across the Department from 28th of April 2025 which aim to provide greater transparency, streamline processes and improve processing times.       Provide increased flexibility to local Community Employment (CE), TÚS, and Rural Social Schemes to retain participants for longer when it benefits both the individual and the community.     The Department has in place increased flexibility to enable participants to remain within their work programme through the provision of temporary extensions. A work programmes participation may be extended where the participant is in continued training/education in the case of CE, or where there is no replacement to fulfil specific community needs. The Department also introduced Rural Social Scheme Review measures to offer 3-year contracts to RSS participants, while those who are 60 years or over may remain on the scheme, provided they maintain eligibility to a qualifying payment, until they reach 66.       In particular, work to ensure there is some discretion at local level so that vulnerable individuals who have little prospect of entering paid employment are not forced off CE schemes when their three-year term expires.     The Department introduced increased flexibility to enable CE participants remain within their work programme through the provision of temporary extensions. CE participation may be extended where the participant is in continued training/education in the case of CE, or where there is no replacement to fulfil specific community needs.       Increase the top-up payment for participants on CE, TÚS, and the Rural Social Scheme in recognition of the important work they do in local communities.       As part of Budget 2026 measures, a €5 increase in the top up for Community Employment, Tús and Rural Social Scheme participants (from €27.50 to €32.50 per week) was included. Participants will also benefit from the €10 increase in the maximum weekly personal rates of payment, and the increases in the child support payment, where applicable.       Continue to support and increase the places on successful local programmes such as CE, TÚS and the Rural Social Scheme which do vital work in local communities.     There were 19,564 participants on CE and 4,503 on Tús at the end of October. Overall, the number on schemes has risen by around 250 over the past year. Currently there are 68 qualified adults and 269 credit only customers on CE. Tús continues to be actively promoted to 18-year-old customers who have a low probability of exit from the LR.       Deliver social welfare payments, such as Jobseeker's Allowance, through post offices, and examine what other services could be provided through the network.     Throughout 2025, the DSP continued to deliver cash payments to welfare recipients via An Post. An Post also provide a budgeting service to DSP customers through the network and the Department continue to engage with An Post to explore other possible services which could be undertaken by the Post Office Network.       Ensure every government department Statement of Strategy includes Climate Action and decarbonisation as a key priority.     This commitment has been delivered. The DSP Statement of Strategy 2025-2028 includes: ‘ Supporting a whole-of Government approach to climate action and decarbonisation. One of our aims over the lifetime of this SoS is to reduce the Department’s carbon footprint and energy utilization (per person/per sq meter)’.       ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 381. Deputy Frankie Feighan asked the Minister for Social Protection the progress made over the past 12 months on each of his Department’s Programme for Government commitments, in tabular form; and if he will make a statement on the matter. [67816/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_342",
          "debateSectionId": "dbsect_342",
          "showAs": "Programme for Government",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_342.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_381",
        "questionNumber": 381
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "showAs": " 61. Deputy Frankie Feighan asked the Minister for Housing, Local Government and Heritage if his Department is currently reviewing ways to reduce the duplication of planning applications needed to be attained to construct energy generating sites; and if he will make a statement on the matter. [61063/25] ",
        "debateSection": {
          "showAs": "Planning Issues",
          "debateSectionId": "dbsect_94",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_94",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_94.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Frankie Feighan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12",
          "memberCode": "Frank-Feighan.S.2002-09-12"
        },
        "questionNumber": 61,
        "answerText": " Minister for Housing, Local Government and Heritage  The Planning and Development Act 2024 represents the largest update to Irish planning legislation in a quarter century. The new Act, which was underpinned by a detailed review and advice of the Office of the Attorney General as well as extensive engagement with stakeholders and other relevant Government Departments, contains key reforms aimed at improving confidence, clarity and consistency within the planning system.  There is a clearer distinction between different categories of consents and most importantly there are statutory time periods for decision making for all consent processes, including, for the first time, for An Coimisiún Pleanála. This will bring increased certainty to planning consent processes, for both the public and stakeholders involved in the delivery of key infrastructure such as housing and renewable energy.  New provisions in the Act, such as Government approved National Planning Statements, which will over time replace current s.28 Ministerial Guidelines, will ensure greater consistency across all tiers of planning whilst requirements for environmental assessment for planning have been made clearer for all consenting processes. My Department will be bringing forward National Planning Statements, subject to completing the relevant consultation and environmental assessments in the areas of Wind and Solar Energy, which will further enhance clarity on these matters and approve alignment of national policy and local implementation across all tiers of planning. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_61",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 596. Deputy Frankie Feighan asked the Minister for Social Protection when a number of schools (details supplied) will receive notice that they have received sanction under the school meals programme. [65537/25] ",
        "debateSection": {
          "showAs": "Social Welfare Benefits",
          "debateSectionId": "dbsect_536",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_536",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_536.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Frankie Feighan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12",
          "memberCode": "Frank-Feighan.S.2002-09-12"
        },
        "questionNumber": 596,
        "answerText": " Minister for Social Protection  The objective of the School Meals Programme is to provide regular, nutritious food to children to support them in taking full advantage of the education provided to them. The programme is an important component of policies to encourage school attendance and extra educational achievement.  Following receipt of School Meals Funding applications from Drumboylan National School, Leitrim Village National School and St Hugh's NS, Dowra there was some further clarifications required on each of these applications. I'm pleased to advise that all three schools have been awarded and School Meals funding has issued.  I trust this clarifies the matter. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Social",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_596",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 597. Deputy Frankie Feighan asked the Minister for Social Protection when an applicant (details supplied) will expect to hear from his Department regarding a review of their entitlement to the State pension (contributory) and their desire to switch back to a contributory pension. [65538/25] ",
        "debateSection": {
          "showAs": "Pension Provisions",
          "debateSectionId": "dbsect_537",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_537",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_537.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Frankie Feighan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12",
          "memberCode": "Frank-Feighan.S.2002-09-12"
        },
        "questionNumber": 597,
        "answerText": " Minister for Social Protection  The person concerned reached pension age on 5 March 2006. State Pension (contributory) was awarded from 10 March 2006 to 9 June 2016 when they were awarded State Pension (non-contributory) at a higher rate of payment. Following a review, their State Pension (non-contributory) was reduced with effect from 27 January 2023.  The State Pension (contributory) entitlement is currently being reviewed for the person concerned. This review will determine which pension provides the most beneficial rate payable. A decision letter will issue to the person concerned as soon as possible.  I hope this clarifies the position for the Deputy. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Social",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_597",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 604,
        "showAs": " 604. Deputy Frankie Feighan asked the Minister for Housing, Local Government and Heritage the number of applications for the vacant homes refurbishment grant, by county in 2024 and to date in 2025; the number of new builds constructed, by county in 2024 and to date in 2025, in tabular form; and if he will make a statement on the matter. [63711/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Housing"
        },
        "by": {
          "showAs": "Frankie Feighan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12",
          "memberCode": "Frank-Feighan.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_604",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_501",
          "showAs": "Departmental Data",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_501",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_501.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Housing, Local Government and Heritage  The Vacant Property Refurbishment Grant, introduced in July 2022 under the Croí Cónaithe Towns Fund, provides a grant of up to €50,000 for the refurbishment of vacant properties for occupation as a principal private residence and for properties which will be made available for rent. A top-up grant of up to €20,000 is available where the property is confirmed to be derelict, bringing the total grant available for a derelict property up to a maximum of €70,000. In order to qualify for the grant, the property must be vacant for two years or more at the time of application.  My Department publishes data on applications for the Vacant Property Refurbishment Grant on its website on a quarterly basis, which includes the number of applications, approvals and the total number and value of grants paid per local authority. This data also includes a breakdown of applications for the Vacant Property Refurbishment Grant and the Derelict Property Top-up Grant for every quarter. The Q3 2025 grant statistics were published on 17 October 2025. This data can be accessed at the following link: Vacant Property Refurbishment Grant statistics www.gov.ie/en/department-of-housing-local-government-and-heritage/collections/vacant-property-refurbishment-grant-statistics/#2025  My Department also publishes programme-level statistics on social and affordable housing delivery activity by local authorities and delivery partners in each local authority area. Data is published on the statistics page of my Department’s website at the following link: www.gov.ie/en/department-of-housing-local-government-and-heritage/collections/overall-social-and-affordable-housing-provision/.  New dwelling completions data are published by the CSO on a quarterly basis and are available on its website at www.cso.ie/en/statistics/buildingandconstruction/newdwellingcompletions/. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister of State at the Department of Transport (Deputy Seán Canney)  As Minister of State with responsibility for International and Road Transport, Logistics, Rail and Ports, I am not involved in the day-to-day operations of public transport.  The issue raised by the Deputy is an operational matter for Irish Rail. Therefore, I have referred the Deputy's questions to Irish Rail for direct response. Please advise my private office if you do not receive a reply within ten working days. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_191",
        "debateSection": {
          "debateSectionId": "dbsect_204",
          "showAs": "Rail Network",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_204",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_204.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Transport"
        },
        "questionNumber": 191,
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 191. Deputy Frankie Feighan asked the Minister for Transport if he will support the proposal to add a daily return commuter train from Longford to Sligo to accommodate workers and students commuting to Sligo on a daily basis, which would substantially reduce the local carbon footprint and traffic gridlock around the town of Sligo; and if he will do everything within his powers to persuade Irish Rail management to provide this service as a matter of urgency. [62400/25] "
      }
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  I propose to take Questions Nos. 893 and 894 together.  The introduction of Core Funding in 2022 brought a significant increase in investment for the sector. €259 million of funding was made available for services in year 1 of the scheme, of which €210.8 million was entirely new funding to the sector.  Core Funding has increased annually, now exceeding €390 million for the current and fourth year of the scheme. This is an increase of over 50% since the scheme began in September 2022. The additional funding is supporting further capacity growth, the maintenance of a fee management system to benefit families and significant improvements to pay and conditions in this valued sector.  I was delighted to announce further investment in Core Funding in Budget 2026. The additional funding being made available in 2026 will see the allocation for Core Funding in the next programme year which begins in September 2026 increase to almost €437 million. That is an additional €44 million on the current full year allocation, or an 11% increase.  This increased investment will allow for further increases in capacity across the sector and will support Partner Services in adhering to the fee management conditions of the grant including reductions in the maximum fee caps from September 2026. This will support the sustainability of the sector while maintaining Core Funding affordability measures for families. Full details of Core Funding 2026/2027 will be made available to the sector in 2026.  The Department is supporting the roll-out and implementation of MyFutureFund through sector specific communications in collaboration with the Department of Social Protection.  The base rates in Core Funding have been developed using the various components associated with the cost of delivery of service provision such as; staff pay and conditions, including contact and non-contact time, holiday pay, sick pay and other employer costs such as pension contributions; administrative staff/time and non-staff overhead costs. These components have been factored into the calculation of the budget for Core Funding since the scheme began in 2022.  Although, the cost of delivery components such as improvements to staff pay have been used to derive the base rates the eligible areas of expenditure of the Core Funding grant are much broader. Partner Services can choose how to spend their Core Funding grant in accordance with the approved areas of expenditure outlines in the Funding Agreement.  I have established an Early Learning and Childcare Provider Consultative Forum, to build on the Department’s strong commitment to, and track record in, engaging with stakeholders in the sector through the Department’s advisory, oversight, consultation and research processes. Under the Terms of Reference the Early Learning and Childcare Provider Consultative Forum will discuss policy and operational issues relating to the provision of early learning and childcare services. The Forum will inform members of early learning and childcare developments and invite the views, concerns and suggestions from providers, as appropriate.  In addition to the increased level of Core Funding for year 4 of the scheme and in Budget 2026, there are wider financial supports available from the Department where a service is experiencing financial difficulty or has concerns about their viability, which can be accessed while remaining within Core Funding.  The Department offers Sustainability Funding to services where issue/s have been identified through the Case Management process that have the potential to have serious consequences for their viability. As part of the Case Management process, in which local City or County Childcare Committees (CCCs) assist services with issues and difficulties that arise, the CCC may refer Core Funding Partner Services facing difficulties to Pobal and the Department to be considered for Sustainability Funding.  Sustainability Funding is intended to prevent significant issues that threaten the viability of a service from occurring in first instance, and any service seeking these supports should contact their City or County Childcare Committee. ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Frankie Feighan",
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_763.xml"
            }
          },
          "debateSectionId": "dbsect_763",
          "showAs": "Childcare Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_763"
        },
        "questionNumber": 893,
        "date": "2025-11-12",
        "showAs": " 893. Deputy Frankie Feighan asked the Minister for Children, Disability and Equality if she will engage with private childcare providers who avail of core funding from her Department on the issue of significant increased costs under the new obligations under the auto enrolment scheme. [61978/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_893"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  I propose to take Questions Nos. 893 and 894 together.  The introduction of Core Funding in 2022 brought a significant increase in investment for the sector. €259 million of funding was made available for services in year 1 of the scheme, of which €210.8 million was entirely new funding to the sector.  Core Funding has increased annually, now exceeding €390 million for the current and fourth year of the scheme. This is an increase of over 50% since the scheme began in September 2022. The additional funding is supporting further capacity growth, the maintenance of a fee management system to benefit families and significant improvements to pay and conditions in this valued sector.  I was delighted to announce further investment in Core Funding in Budget 2026. The additional funding being made available in 2026 will see the allocation for Core Funding in the next programme year which begins in September 2026 increase to almost €437 million. That is an additional €44 million on the current full year allocation, or an 11% increase.  This increased investment will allow for further increases in capacity across the sector and will support Partner Services in adhering to the fee management conditions of the grant including reductions in the maximum fee caps from September 2026. This will support the sustainability of the sector while maintaining Core Funding affordability measures for families. Full details of Core Funding 2026/2027 will be made available to the sector in 2026.  The Department is supporting the roll-out and implementation of MyFutureFund through sector specific communications in collaboration with the Department of Social Protection.  The base rates in Core Funding have been developed using the various components associated with the cost of delivery of service provision such as; staff pay and conditions, including contact and non-contact time, holiday pay, sick pay and other employer costs such as pension contributions; administrative staff/time and non-staff overhead costs. These components have been factored into the calculation of the budget for Core Funding since the scheme began in 2022.  Although, the cost of delivery components such as improvements to staff pay have been used to derive the base rates the eligible areas of expenditure of the Core Funding grant are much broader. Partner Services can choose how to spend their Core Funding grant in accordance with the approved areas of expenditure outlines in the Funding Agreement.  I have established an Early Learning and Childcare Provider Consultative Forum, to build on the Department’s strong commitment to, and track record in, engaging with stakeholders in the sector through the Department’s advisory, oversight, consultation and research processes. Under the Terms of Reference the Early Learning and Childcare Provider Consultative Forum will discuss policy and operational issues relating to the provision of early learning and childcare services. The Forum will inform members of early learning and childcare developments and invite the views, concerns and suggestions from providers, as appropriate.  In addition to the increased level of Core Funding for year 4 of the scheme and in Budget 2026, there are wider financial supports available from the Department where a service is experiencing financial difficulty or has concerns about their viability, which can be accessed while remaining within Core Funding.  The Department offers Sustainability Funding to services where issue/s have been identified through the Case Management process that have the potential to have serious consequences for their viability. As part of the Case Management process, in which local City or County Childcare Committees (CCCs) assist services with issues and difficulties that arise, the CCC may refer Core Funding Partner Services facing difficulties to Pobal and the Department to be considered for Sustainability Funding.  Sustainability Funding is intended to prevent significant issues that threaten the viability of a service from occurring in first instance, and any service seeking these supports should contact their City or County Childcare Committee. ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Frankie Feighan",
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_763.xml"
            }
          },
          "debateSectionId": "dbsect_763",
          "showAs": "Childcare Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_763"
        },
        "questionNumber": 894,
        "date": "2025-11-12",
        "showAs": " 894. Deputy Frankie Feighan asked the Minister for Children, Disability and Equality If she will consider increasing core funding rates to take into consideration the additional costs incurred by auto enrolment; and if she will make a statement on the matter. [61979/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_894"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_40",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Frankie Feighan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12",
          "memberCode": "Frank-Feighan.S.2002-09-12"
        },
        "debateSection": {
          "debateSectionId": "dbsect_71",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_71",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_71.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 40. Deputy Frankie Feighan asked the Tánaiste and Minister for Defence the number of Defence Forces’ personnel serving overseas at present; if the number is anticipated to change over the next 18 months; and if he will make a statement on the matter. [60379/25] ",
        "questionNumber": 40,
        "answerText": " Tánaiste and Minister for Defence  As of 03 November 2025, Ireland is contributing 430 Defence Forces personnel to overseas peacekeeping missions and commitments. This reflects the Government's continued commitment to our responsibilities in the area of international peace and security.  Ireland has always been a strong supporter of peacekeeping and contributions to peacekeeping operations and this is expressed in Ireland's long-standing tradition of participating in UN and UN-mandated peacekeeping operations, as well as by Ireland's engagement in the EU's Common Security and Defence Policy (CSDP). Our peacekeepers are recognised internationally for their expertise and experience.  As the Deputy will know, on 28th August last, the UN Security Council renewed the UNIFIL mandate up to 31st December 2026, to be followed by a period of drawdown and withdrawal, scheduled to be completed by the end of 2027. This will have the most significant impact on the numbers of the Defence Forces serving overseas over the next 18 months.  In terms of any potential increases in the numbers of Defence Forces personnel overseas over this period, Ireland considers the policy and political context in relation to any requests regarding Ireland's participation in various missions, and these are considered on a case-by-case basis. Any decision to deploy is made on the basis of policy advice and on the changing nature of demands and potential future mission profiles, as well as the assets and capabilities which can be made available by the Defence Forces for overseas deployment, given existing operational demands at home and overseas and also in the current more challenging security environment. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_42",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Frankie Feighan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12",
          "memberCode": "Frank-Feighan.S.2002-09-12"
        },
        "debateSection": {
          "debateSectionId": "dbsect_72",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_72",
          "showAs": "White Papers",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_72.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 42. Deputy Frankie Feighan asked the Tánaiste and Minister for Defence the input his Department has made to the EU’s White Paper for European Defence – Readiness 2030; and if he will make a statement on the matter. [60380/25] ",
        "questionNumber": 42,
        "answerText": " Tánaiste and Minister for Defence  The White Paper for European Defence – Readiness 2030, published on 19 March 2025, is a Joint Communication by the High Representative for Foreign Affairs and the EU Commission that seeks to mitigate some of the threats and challenges Europe collectively faces.  It outlines a strategic direction with proposals aimed at closing critical capability gaps, enhancing military mobility, and strengthening the European Defence Technological and Industrial Base. It also encourages voluntary cooperation among Member States to strengthen their security.  The proposals present options on how Member States can make the investments necessary in the coming years in a collaborative way that strengthen the European defence industrial base and reduces dependencies outside of the Union. As such, the matters proposed within touch upon not just the Department of Defence and the Defence Forces, but cut across a range of other Government Departments.  Prior to the Paper’s publication, Ireland engaged constructively at political and senior official level with relevant counterparts both in Brussels and across European capitals. In addition, there was close cooperation with colleagues across Government, where matters proposed within the Paper fell across the agenda of the various relevant Council formations. This engagement ensured that Ireland’s national position in this regard was understood.  We will continue to engage constructively on the various initiatives that are being progressed at EU level. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_99",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Frankie Feighan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12",
          "memberCode": "Frank-Feighan.S.2002-09-12"
        },
        "debateSection": {
          "debateSectionId": "dbsect_102",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_102",
          "showAs": "Renewable Energy Generation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_102.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Climate",
          "roleCode": null
        },
        "showAs": " 99. Deputy Frankie Feighan asked the Minister for Climate, Energy and the Environment the plans his Department is currently evaluating to reduce barriers for the construction of renewable energy; and if he will make a statement on the matter. [60389/25] ",
        "questionNumber": 99,
        "answerText": " Minister for Climate, Energy and the Environment  Government is committed to achieving 80% of electricity coming from renewable sources in the near term as part of a longer term strategy to decarbonise our power system.  The transition to a renewables led energy system will be underpinned by the delivery of wind and solar generation, as well as supporting technologies to harness renewables output and deliver it to the electricity network and on to our homes and businesses.  Renewable electricity projects make a significant contribution to communities across Ireland through job creation, community benefit funds, and revenue to Local Authorities which is reinvested in local communities and services.  My Department chairs two cross-Government taskforces with the specific aims of ensuring cohesive policy development and reducing barriers for the development of onshore and offshore renewable electricity developments. The Offshore Wind Development Taskforce and the Accelerating Renewable Electricity Taskforce brings together officials from relevant Government Departments, the electricity system operators (EirGrid and ESB Networks), sectoral regulators (CRU and MARA), the Sustainable Energy Authority (SEAI), the National Treasury Management Agency (NTMA), and industry representatives to identify the barriers to renewable growth and develop solutions to remove or minimise those barriers.  Key policies, such as the onshore Renewable Electricity Support Scheme (RESS), Offshore Renewable Electricity Support Scheme (ORESS), inclusion of Regional Renewable Electricity Capacities in the National Planning Framework, the identification of key grid infrastructure projects, and the establishment of an Offshore Wind Clearing House are just some of the achievements of these two taskforces. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_130",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Frankie Feighan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12",
          "memberCode": "Frank-Feighan.S.2002-09-12"
        },
        "debateSection": {
          "debateSectionId": "dbsect_134",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_134",
          "showAs": "Energy Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_134.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Climate",
          "roleCode": null
        },
        "showAs": " 130. Deputy Frankie Feighan asked the Minister for Climate, Energy and the Environment if his Department is currently reviewing ways to reduce the duplication of licensing applications needed to be attained to construct energy generating sites; and if he will make a statement on the matter. [60390/25] ",
        "questionNumber": 130,
        "answerText": " Minister for Climate, Energy and the Environment  The Environment (Miscellaneous Provisions) Bill 2025 has passed Second Stage in the Dáil. The Bill aims to streamline the current EPA licencing process by putting in place statutory timelines for EPA decisions and also by enabling ‘limited’ licence reviews in circumstances where an EIA is not required and the proposed change to an installation is not substantial.  The Action Plan on Competitiveness and Productivity was published in September 2025. Action 44P of the Plan is a priority action which commits to expedite the Bill in addition to resourcing the EPA sufficiently to comply with the required licencing decision timeframes and review the legislative possibilities to allow for concurrent processing of planning and licencing decisions.  Any activity that requires an Industrial Emissions licence under the Industrial Emissions Directive (IED) must be authorised in line with that Directive. The EPA is the competent authority for the IED. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1001. Deputy Frankie Feighan asked the Minister for Housing, Local Government and Heritage if Sligo and Leitrim local authorities' storm damage claims in relation to storm Éowyn are paid; if not, when management can expect payment; and if he will make a statement on the matter. [57799/25] ",
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1001",
        "questionNumber": 1001,
        "answerText": " Minister for Housing, Local Government and Heritage  My Department undertakes the Lead Government Department role, as set out in the Strategic Emergency Management (SEM) Framework (2017), in relation to the coordination of national level responses to severe weather and flooding emergencies, where warranted. My Department's National Directorate for Fire & Emergency Management undertakes this role and works closely with local authority Severe Weather Assessment Teams and Met Éireann.  Local authorities are designated as the lead agencies for coordinating a response to flooding and severe weather emergencies. All local authorities have an established Severe Weather Assessment Team in place, monitoring Met Éireann weather warnings, High Tide Advisories and the European Flood Awareness System (EFAS) advisory warnings. Local authorities also have Severe Weather/ Flood Plans in place to support the response to weather emergencies.  Since 2009, my Department has made financial support of over €100 million available to assist local authorities in meeting the unbudgeted costs of clean-up and necessary immediate works, including for exceptional overtime payments, the hire of plant and heavy machinery, the purchase of materials required for the clean-up and the hire of contractors associated with significant severe weather emergency events.  This is in recognition of the exceptional nature of the activities carried out by local authorities in responding to these types of emergencies and the fact that the costs of these un-programmed activities could not be foreseen in annual expenditure planning. This practice is considered a vital enabler to underpin a rapid response by local authorities.  In the context of Storm Éowyn and the exceptional nature of the response and humanitarian assistance activities carried out by local authorities, clearly the costs of these activities were not budgeted for within existing resources. My Department has collated costs from all local authorities in relation to severe weather responses earlier this year and, in consultation with the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation, is working with local authorities to address relevant unbudgeted costs. This process should be concluded shortly.  It should be noted that funding the repair of public infrastructure is undertaken by the relevant Department in line with its sectoral responsibility. Capital costs associated with infrastructural damage, for example damage to the roads network and coastal protection infrastructure (where necessary), are funded under relevant sectoral arrangements. ",
        "debateSection": {
          "showAs": "Weather Events",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_878",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_878.xml"
            }
          },
          "debateSectionId": "dbsect_878"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1014. Deputy Frankie Feighan asked the Minister for Housing, Local Government and Heritage his plans to extend certain planning exemptions to convert vacant commercial properties into new homes (details supplied); if he will confirm his plans to extend or review the scheme before the end of 2025; and his views on whether the scheme has been a success and produced the potential to create 3,429 new homes throughout the country between 2018 and 2024 and is worthy of a further extension. [58137/25] ",
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1014",
        "questionNumber": 1014,
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  I propose to take Questions Nos. 1014 and 1142 to 1144, inclusive, together.  Turning vacant properties into homes is a key pillar of Housing for All. S.I. No. 75/2022 - Planning and Development Act (Exempted Development) Regulations 2022, provides an exemption from the requirement for planning permission for the conversion of certain types of vacant commercial property into residential use, such as ‘living over the shop’ accommodation and conversion of vacant pubs, up to a maximum of 9 residential units.  Draft regulations have been laid before the Houses of the Oireachtas providing for an extension, until 31 December 2028, of the exemption for conversion to residential use set out under S.I. No. 75 of 2022.  Following engagement on the draft regulations with the Joint Oireachtas Committee for Housing, Local Government and Heritage and receipt of positive resolutions of both Houses of the Oireachtas as required under section 262(4) of the Planning and Development Act 2000, as amended, I, as the Minister of State with responsibility for Planning, will sign the regulations into law at the earliest opportunity once finalised.  The use of the 2022 Regulations requires the developer to notify the planning authority at least two weeks prior to the commencement of any proposed change of use and related works. Planning authorities are required to maintain a record and to submit annual returns to the Department on the notifications received in the preceding year including the location and number of residential units to be provided.  My Department publishes these returns annually and prepares a Planning Exemptions Story Map to provides further background information and spatial analysis of notifications received. Up to the end of 2024, local authorities received 1,457 notifications from developers intending to avail of the exemptions. If enacted, this would result in 3,429 new homes across the country.  In 2024 alone, 292 notifications were received relating to the provision of 713 new homes, which is the highest annual number of notified units since 2018.  Notifications have increased steadily since with an average of 2.35 homes per notification.  The returns indicate significant development activity in response to the provision of the exemptions and highlight urban areas where local authorities are successfully tackling urban vacancy. The information is available at: www.gov.ie/en/department-of-housing-local-government-and-heritage/publications/notifications-received-by-local-authorities-under-planning-permission-exemptions-for-converting-commercial-property-into-homes/ ",
        "debateSection": {
          "showAs": "Vacant Properties",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_889",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_889.xml"
            }
          },
          "debateSectionId": "dbsect_889"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1015. Deputy Frankie Feighan asked the Minister for Housing, Local Government and Heritage the financial supports available from his Department to parents and guardians of children with autism who need to modify their house to provide their child with an adapted bedroom or sensory room; and if he will make a statement on the matter. [58155/25] ",
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1015",
        "questionNumber": 1015,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 977, 1006 and 1015 together.  My Department provides funding under the suite of Housing Adaptation Grants for Older People and Disabled People, to assist those in private houses to make their accommodation more suitable for their needs. The suite of grants, which include the Housing Adaptation Grant for Disabled People, the Mobility Aids Grant and the Housing Aid for Older People Grant, are funded by my Department with a contribution from the local authority.  The Housing Adaptation Grant for Disabled People and the Mobility Aids Grant is available for the carrying out of works of adaptation that, in the opinion of the local authority, are reasonably necessary for the purposes of rendering a house more suitable for a member of the household who has an enduring physical, sensory, mental health or intellectual disability. In general, these grant schemes can be used for works such as level access showers, accessible bathrooms, access ramps, stair lifts, fixed track hoists or extensions. Grant aid may be considered for the provision of infrastructural and safety related adaptations to create appropriate space for applicants with specific sensory needs not including the provision of sensory equipment.  The Housing Aid for Older People Grant is available to assist older people living in poor housing conditions to have necessary repairs or improvements carried out. Qualifying works include structural repairs or improvements, upgrading unsafe electrical wiring, drylining, repair or replacement of windows and doors and the repair or provision of central heating (where no central heating exists or the existing system is broken or beyond repair).  The administration of the grants scheme, including the assessment, approval and prioritisation of grant applications under the various measures, is the responsibility of each local authority. Having considered all of the circumstances in any particular case, it is a matter for the local authority to determine grant eligibility. Local authorities, in administering the scheme, work with qualifying applicants to secure the most beneficial outcome possible in line with the applicants' financial circumstances and within the parameters of the grant scheme. ",
        "debateSection": {
          "showAs": "Grant Payments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_866",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_866.xml"
            }
          },
          "debateSectionId": "dbsect_866"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1021. Deputy Frankie Feighan asked the Minister for Housing, Local Government and Heritage the reason for the reduction of funding for smaller local authorities particularly the reduction of €1.3 million to Leitrim County Council in funding in 2025 under the Equalisation Fund (details supplied) . [58209/25] ",
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1021",
        "questionNumber": 1021,
        "answerText": " Minister for Housing, Local Government and Heritage  I assume the question is referring, for the most part, to annual Local Property Tax (LPT) allocations from the Local Government Fund. At the outset, it is important to note that LPT funding allocations are decided in accordance with Government approved distribution policies, and are based on the baselines and estimates of the yield in individual local authority areas. Under the LPT allocation model, every local authority has a minimum level of funding available to it, known as the baseline. If the estimated LPT yield in a local authority area is lower than an authority’s baseline, the authority is topped-up or equalised to that baseline by the Exchequer via the Local Government Fund. Accordingly, the equalisation funding requirement varies from year to year. The specific amount is the shortfall between the baseline and the estimated yield in a local authority area.  Local authority baselines for 2024 were adjusted in accordance with the recommendations of the 2023 Baseline Review working group. Every authority, including Leitrim County Council, received an increase in baseline funding of at least €1.5m. Building on the baseline increases of 2024, local authorities will see further increases in 2026, which will ensure that any benefit from the revaluation of LPT will go directly to the sector where it is needed. Accordingly, Leitrim County Council’s baseline is increased by an additional €0.2m for 2026, thereby resulting in an overall baseline increase of €1.7m or 19% since 2023.  Furthermore, local authorities may vary the rate of LPT in their administrative area by up to 15% of the basic rate of the Tax. The decision to vary must be taken by resolution of the Council. If a local authority decides to vary the LPT basic rate upwards; 100% of the resultant additional income is available for the authority's own use. Similarly, if an authority decides to vary the LPT basic rate downwards (by up to 15%), the resultant loss in LPT income is reflected in reduced LPT funding to the authority. The power to vary LPT rates enables elected members to directly influence the level of LPT income they have to meet their expenditure requirements.  The table below sets out a summary of the LPT allocation process in respect of Leitrim County Council for the years 2023 to 2026.     LPT Liability Year    LPT Baseline (minimum funding to be provided from LPT allocation)    Estimated LPT Yield collected locally (before local variation)    Equalisation funding from the Local Government Fund to ensure allocation is at least matched to LPT Baseline    Additional funding arising from local variation decision (+15% for Leitrim County Council)    Final LPT Allocation      2023    €8,956,315    €1,777,150    €7,179,166    €266,572    €9,222,888      2024    €10,456,315    €1,878,503    €8,577,813    €281,775    €10,738,091      2025    €10,456,315    €1,929,751    €8,526,565    €289,463    €10,745,778      2026    €10,656,315    €2,144,959    €8,511,357    €321,744    €10,978,059       Detailed information regarding LPT allocations to all local authorities, is published by my Department at the following link: www.gov.ie/en/collection/ea27d-local-property-tax-allocations/  I acknowledge the current financial environment in which all local authorities, are operating, and the pressures facing them in respect of general inflation and higher costs. Every effort has been made to provide support to the sector in the delivery of its functions.  Since 2009, my Department has made financial support of over €100 million available to assist local authorities in meeting the unbudgeted costs of clean-up and necessary immediate works, including for exceptional overtime payments, the hire of plant and heavy machinery, the purchase of materials required for the clean-up and the hire of contractors associated with significant severe weather emergency events.  This is in recognition of the exceptional nature of the activities carried out by local authorities in responding to these types of emergencies and the fact that the costs of these un-programmed activities could not be foreseen in annual expenditure planning. This practice is considered a vital enabler to underpin a rapid response by local authorities.  In the context of Storm Éowyn and the exceptional nature of the response and humanitarian assistance activities carried out by local authorities, clearly the costs of these activities were not budgeted for within existing resources. My Department has collated costs from all local authorities in relation to severe weather responses earlier this year and, in consultation with the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation, is working with local authorities to address relevant unbudgeted costs. This process should be concluded shortly.  It should be noted that funding the repair of public infrastructure is undertaken by the relevant Department in line with its sectoral responsibility. Capital costs associated with infrastructural damage, for example damage to the roads network and coastal protection infrastructure (where necessary), are funded under relevant sectoral arrangements. ",
        "debateSection": {
          "showAs": "Local Authorities",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_894",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_894.xml"
            }
          },
          "debateSectionId": "dbsect_894"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Rural Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_345.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_345",
          "debateSectionId": "dbsect_345"
        },
        "to": {
          "showAs": "Rural",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  The Local Improvement Scheme or LIS is a key support to rural communities in improving non-public rural roads and laneways that are not typically maintained by local authorities. Since 2017, almost €184 million has been allocated to the Scheme.  On 7th August last, I was delighted to announce €14 million in additional funding for the 2025 scheme. This brings the total amount invested in LIS in 2025 alone to €30 million - a record investment.  Leitrim’s County Council’s original allocation for 2025 was €373k and, following the August 2025 additional allocation, it now had a full year budget of €900k. Final figures on the number of road improvements completed in Leitrim this year will be available following the drawdown process in December.  While my Department provides funding for the scheme, it is administered by local authorities who maintain responsibility for the management of waiting lists, scheme applications and determining the eligibility of roads.  My officials advise local authorities to review their waiting lists periodically to ensure all roads listed are eligible under the scheme. The Department has also engaged closely with local authorities to ensure LIS funding is fully utilised and that as many roads as possible are completed under the scheme.  The Programme for Government commits to the provision of additional funding for the LIS. As the Deputy will be aware, €17 million in LIS funding was recently announced as part of Budget 2026. This represents an increase in base funding announced in previous years.  My Department will aim to launch the 2026 Scheme as early as possible next year, allowing local authorities to better plan and manage their resources. Details of the 2026 scheme, including county allocations will be circulated to local authorities once finalised. ",
        "questionType": "written",
        "showAs": " 362. Deputy Frankie Feighan asked the Minister for Rural and Community Development and the Gaeltacht when the allocation of funding under the local improvement scheme will be announced; if consideration will be given to the various waiting list reports across a number of counties, particularly in County Leitrim where it is anticipated it may take in excess of six years under the average current funding since 2022; and if assistance will be given to those counties in particular; and if he will make a statement on the matter. [55642/25] ",
        "questionNumber": 362,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Frankie Feighan",
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_362"
      }
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Rural Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_346.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_346",
          "debateSectionId": "dbsect_346"
        },
        "to": {
          "showAs": "Rural",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  The Outdoor Recreation Infrastructure Scheme (ORIS) provides funding for the development and enhancement of outdoor recreational infrastructure such as walking trails, cycleways, water-based recreation sites and mountain trails. Since 2020, funding of over €94 million has been approved for almost 1,300 projects nationwide.  I was delighted to announce funding of €8.7 million on 14th of August to deliver 221 projects under measure 1 and the project development measure of the 2024/2025 scheme.  I expect to announce the successful projects under measures 2 and 3 of the programme in the coming weeks. ",
        "questionType": "written",
        "showAs": " 363. Deputy Frankie Feighan asked the Minister for Rural and Community Development and the Gaeltacht when the funding under the outdoor recreation infrastructure scheme will be announced; and if he will make a statement on the matter. [55643/25] ",
        "questionNumber": 363,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Frankie Feighan",
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_363"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Housing Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_445.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_445",
          "debateSectionId": "dbsect_445"
        },
        "to": {
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  The legislative process for the taking in charge of housing estates by local authorities is set out in section 180 of the Planning and Development Act 2000. The prescribed process in this regard applies to residential developments consisting of two or more dwellings that have been granted planning permission under section 34 of the Act.  There is no automatic requirement for local authorities to take charge of unfinished housing estates after a certain period of time. Under section 180 (1) of the Act of 2000, the planning authority is obliged to initiate the taking in charge process where requested by either the developer of, or by the majority of owners of the dwellings in, the estate in question. However, this is subject to the development being completed to the satisfaction of the authority and in accordance with the permission and any conditions attached thereto.  Where developments have not been completed to the satisfaction of the planning authority, and where enforcement proceedings in this connection have not been commenced by the planning authority within 4 years of the expiry of the planning permission relating to a development, section 180 (2)(a) of the Act provides that the planning authority shall, where requested by the majority of owners of the houses involved, initiate the taking in charge procedures under section 11 of the Roads Act 1993, as amended (the Roads Act).  Where this particular approach is being progressed, the authority may apply the security or development bond provided as part of the planning application for the purposes of ensuring the satisfactory completion of the development.  Where the calling in of the development bond is not possible or sufficient, section 180(2A) of the Act provides that the initiation of the taking in charge procedures under section 11 of the Roads Act shall not preclude the planning authority concerned from pursuing a developer for any costs incurred by the authority in respect of necessary works undertaken on a development to enable it to be taken in charge by that authority.  In order to conclude the taking in charge process where the development has been deemed to have been satisfactorily completed, a local authority is required to make a declaration under section 11 of the Roads Act following a proposal by the executive. The making of such a declaration, which effectively confirms that the authority is prepared to take over responsibility for the ongoing maintenance of the public works elements of the estate, is a reserved function of the elected members of a local authority.  Therefore, the decision to take any particular estate or estates in charge is ultimately one for the elected members of the local authority who, by way of declaration made under the Roads Act, will make such a decision.  It should be noted that financial decision making and the accountability of local authorities is a matter for the elected members of a local authority who have direct responsibility in law for all reserved functions of the authority, which includes the adoption of the annual budget of the local authority.  In this regard, section 103 of the Local Government Act 2001, as amended, provides for the local authority budgetary process. It is a matter for each local authority to determine its own spending priorities in the context of the annual budgetary process, having regard to both locally identified needs and the funding resources available to the local authority. This includes the taking in charge of housing estates.  There is no longer a dedicated funding scheme for unfinished housing estates and currently there are no plans to reintroduce a further funding scheme for such purposes. ",
        "questionType": "written",
        "showAs": " 586. Deputy Frankie Feighan asked the Minister for Housing, Local Government and Heritage if he will consider engaging with management of local authorities to examine the extent of uncompleted housing estates with infrastructural deficits beyond the resources of the local authority and available bonds; if his attention has been drawn to the fact that there are people living in unfinished housing estates with sewerage overflowing and local authorities having the on-going costs of dealing with such matters; and if so, if he will consider setting up a fund similar to the mica re-dress scheme to deal with this serious issue mainly in the west of Ireland. [54776/25] ",
        "questionNumber": 586,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Frankie Feighan",
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_586"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Housing Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_475.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_475",
          "debateSectionId": "dbsect_475"
        },
        "to": {
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 616, 642 and 643 together.  On 10 June 2025, the Government approved policy measures including modifications to rent controls to come into effect on 1 March 2026 in order to boost investment in the supply of homes available for rent and keep existing landlords in the market. The changes agreed will also provide significantly stronger tenancy protections and are finely balanced between the interests of tenants and the need for further private investment in the rental market across the country, taking account of stakeholder engagement. Further information is available here: www.gov.ie/en/department-of-housing-local-government-and-heritage/press-releases/government-to-introduce-major-reforms-to-the-rental-sector/.  The modifications to rent controls have been informed by the findings of the Housing Agency review of Rent Pressure Zones and Potential Policy Options and its preferred recommendation to modify the operation of the existing RPZ rent controls. The report can be accessed here: www.housingagency.ie/publications/review-rent-pressure-zones-report .  Resetting of rents to market value will be allowed for new tenancies created (i.e. first time tenancy between parties) on or after 1 March 2026 as part of the reform of rent controls. However, resetting of rents will not be allowed where the preceding tenancy, if any, was terminated via a ‘no fault eviction’. Rent re-setting will only be allowed where a tenant terminates their tenancy or breaches their tenant obligations or where the dwelling is no longer suitable to the accommodation needs of the tenant household.  The policy proposals for stronger tenancy protections will apply to new tenancies created from 1 March 2026, which will significantly enhance the current provision of tenancies of unlimited duration with the introduction of tenancies of minimum duration (TMD), involving rolling 6-year tenancies by a smaller landlord (with three or fewer tenancies) with a new tenant.  In limited circumstances during a 6-year TMD, a smaller landlord will be allowed to end a tenancy. This would include where the landlord requires the property for a family member (spouse/civil partner/parent/child) or where the landlord is experiencing hardship and requires vacant possession. A smaller landlord will also be allowed to terminate a tenancy using the limited grounds under section 34 of the Residential Tenancies Acts 2004 to 2025 (RTA) at the end of each 6-year period while the tenancy continues to exist.  All landlords will retain the right to terminate a tenancy where there is a breach of tenant obligations or where the dwelling is no longer suitable to the accommodation needs of the tenant household.  For existing tenancies (i.e. those created on or before 28 February 2026), resetting of rents to market value will not be allowed. The restriction on annual rent increases will continue to apply.  Legislation is being prepared and will be published later this year to give effect to these policy measures.  The Government remains focused on growing the supply of much-needed rental accommodation by keeping existing landlords in the market and attracting new landlords, while ensuring strong and balanced tenancy protections for both tenants and landlords.  The RTB's Profile of the Register shows that at the end of Q2 2025, there were 240,798 registered private tenancies, an increase of 3.2% annually, with 104,072 private landlords. There were also 14,742 new tenancy registrations in Q2 2025.  My Department, the RTB and I keep the operation of the Residential Tenancies Acts 2004 to 2025 across the country under constant review and will progress any necessary legislative change in a timely manner. ",
        "questionType": "written",
        "showAs": " 642. Deputy Frankie Feighan asked the Minister for Housing, Local Government and Heritage to examine the implications of the new regulations (details supplied) to be introduced in March 2026 whereby smaller landlords with three or fewer tenancies can terminate a new rolling six-year tenancy on the grounds of intending to sell at the end of the 6-year period. [55468/25] ",
        "questionNumber": 642,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Frankie Feighan",
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_642"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Housing Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_475.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_475",
          "debateSectionId": "dbsect_475"
        },
        "to": {
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 616, 642 and 643 together.  On 10 June 2025, the Government approved policy measures including modifications to rent controls to come into effect on 1 March 2026 in order to boost investment in the supply of homes available for rent and keep existing landlords in the market. The changes agreed will also provide significantly stronger tenancy protections and are finely balanced between the interests of tenants and the need for further private investment in the rental market across the country, taking account of stakeholder engagement. Further information is available here: www.gov.ie/en/department-of-housing-local-government-and-heritage/press-releases/government-to-introduce-major-reforms-to-the-rental-sector/.  The modifications to rent controls have been informed by the findings of the Housing Agency review of Rent Pressure Zones and Potential Policy Options and its preferred recommendation to modify the operation of the existing RPZ rent controls. The report can be accessed here: www.housingagency.ie/publications/review-rent-pressure-zones-report .  Resetting of rents to market value will be allowed for new tenancies created (i.e. first time tenancy between parties) on or after 1 March 2026 as part of the reform of rent controls. However, resetting of rents will not be allowed where the preceding tenancy, if any, was terminated via a ‘no fault eviction’. Rent re-setting will only be allowed where a tenant terminates their tenancy or breaches their tenant obligations or where the dwelling is no longer suitable to the accommodation needs of the tenant household.  The policy proposals for stronger tenancy protections will apply to new tenancies created from 1 March 2026, which will significantly enhance the current provision of tenancies of unlimited duration with the introduction of tenancies of minimum duration (TMD), involving rolling 6-year tenancies by a smaller landlord (with three or fewer tenancies) with a new tenant.  In limited circumstances during a 6-year TMD, a smaller landlord will be allowed to end a tenancy. This would include where the landlord requires the property for a family member (spouse/civil partner/parent/child) or where the landlord is experiencing hardship and requires vacant possession. A smaller landlord will also be allowed to terminate a tenancy using the limited grounds under section 34 of the Residential Tenancies Acts 2004 to 2025 (RTA) at the end of each 6-year period while the tenancy continues to exist.  All landlords will retain the right to terminate a tenancy where there is a breach of tenant obligations or where the dwelling is no longer suitable to the accommodation needs of the tenant household.  For existing tenancies (i.e. those created on or before 28 February 2026), resetting of rents to market value will not be allowed. The restriction on annual rent increases will continue to apply.  Legislation is being prepared and will be published later this year to give effect to these policy measures.  The Government remains focused on growing the supply of much-needed rental accommodation by keeping existing landlords in the market and attracting new landlords, while ensuring strong and balanced tenancy protections for both tenants and landlords.  The RTB's Profile of the Register shows that at the end of Q2 2025, there were 240,798 registered private tenancies, an increase of 3.2% annually, with 104,072 private landlords. There were also 14,742 new tenancy registrations in Q2 2025.  My Department, the RTB and I keep the operation of the Residential Tenancies Acts 2004 to 2025 across the country under constant review and will progress any necessary legislative change in a timely manner. ",
        "questionType": "written",
        "showAs": " 643. Deputy Frankie Feighan asked the Minister for Housing, Local Government and Heritage if he is aware that small landlords in rural areas (like the North West) are leaving the market in anticipation of the new regulations, reducing the amount of available rental properties putting further pressure on an existing limited market; if he has engaged with stake holders including auctioneers and letting agents to discuss the impact; and if he will review some of the measures proposed for March 2026, in particular if such a measure should be considered on a regional basis because not all areas are the same when it comes to the housing rental market. [55469/25] ",
        "questionNumber": 643,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Frankie Feighan",
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_643"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Departmental Correspondence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_516.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_516",
          "debateSectionId": "dbsect_516"
        },
        "to": {
          "showAs": "Social",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Social Protection  The Deputy has now contacted stating that he wishes to withdraw the PQ as the matter has been resolved directly by the Department.   ",
        "questionType": "written",
        "showAs": " 660. Deputy Frankie Feighan asked the Minister for Social Protection if his Department will issue a statement to person (details supplied); and if he will make a statement on the matter. [54918/25] ",
        "questionNumber": 660,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Frankie Feighan",
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_660"
      }
    },
    {
      "question": {
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-30/pq_664",
        "answerText": " Minister for Social Protection  The objective of the School Meals Programme is to provide regular, nutritious food to children to support them in taking full advantage of the education provided to them. The programme is an important component of policies to encourage school attendance and extra educational achievement.  The status of the schools for the 2025/26 year stated by the deputy above are as follows:     Aughawillan NS    Claim Awarded and payment has issued      Kilnagross NS    Claim Awarded and payment has issued      Drumlea NS    Claim Awarded and payment has issued      Ballinamore NS    Pending - Awaiting further Information      Strabaggan NS    Claim Awarded and payment has issued      Kingsland Boyle NS    Claim Awarded and payment has issued      Drumboylan NS    Pending - Awaiting further Information      Frenchpark NS    No application received to date     My Department provides the funding to the schools in two tranches. The first payment is made after the school submits a fully completed application and their claim is processed. The second payment issues in the first week in January.  The primary relationship is between the school and supplier. The school meals funding is paid into a dedicated bank account held by the school for The School Meals Programme. The supplier invoices are paid by the school from this account. The payment of these invoices is a matter for the school.  I trust this clarifies the matter. ",
        "date": "2025-09-30",
        "questionNumber": 664,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/dbsect_547",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/mul@/dbsect_547.xml"
            }
          },
          "debateSectionId": "dbsect_547",
          "showAs": "School Meals Programme"
        },
        "showAs": " 664. Deputy Frankie Feighan asked the Minister for Social Protection if he will provide clarification on the payment under the hot meals suppliers programme to specific schools (details supplied) in counties Leitrim and Roscommon. [51933/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Social",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-30"
    },
    {
      "question": {
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-30/pq_682",
        "answerText": " Minister for Justice, Home Affairs and Migration  As the Deputy will appreciate, management of the courts, operational matters and logistical functions are the responsibility of the judiciary and Courts Service, which are independent in the exercise of their functions under the Courts Service Act 1998 and given the separation of powers in the Constitution.  However, to be of assistance, officials at my Department have made enquiries of the Courts Service regarding the Deputy's question. I am advised that, in relation to Court sittings at Harristown Courtroom (at Castlerea Prison), the Courts Service have confirmed that there has been no change to the scheduled sittings taking place in that location. The Court is scheduled to sit on four Fridays each month which it continues to do. During 2024, the Court sat on 46 occasions and, to date in 2025, the Court has sat on 34 occasions.  Where the District Court sitting at Harristown is dealing with remands from other Districts (pursuant to section 5 of the Criminal Justice (Miscellaneous Provisions) Act 1997) it should be noted that it has no jurisdiction to finalise the charges/hear the trial and the matter must be remanded back to the originating court for trial/sentence. Physical attendance for remands (rather than appearance by video link) is a matter for the judiciary and is subject to section 23 of the Civil Law and Criminal Law (Miscellaneous Provisions) Act 2020.  I am further advised that video link (rather than physical attendance at the Court) is the default position for any remand in Letterkenny District Court unless the Judge directs otherwise. ",
        "date": "2025-09-30",
        "questionNumber": 682,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/dbsect_562",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/mul@/dbsect_562.xml"
            }
          },
          "debateSectionId": "dbsect_562",
          "showAs": "Prison Service"
        },
        "showAs": " 682. Deputy Frankie Feighan asked the Minister for Justice, Home Affairs and Migration the reason the modern, state of the art courtroom and facilities at Castlerea prison continue to lie idle and unused, resulting in prison staff and prisoners having to regularly undertake a 5-hour round-trip to attend Letterkenny district court instead; and if he will make a statement on the matter. [51385/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Justice",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-30"
    },
    {
      "question": {
        "date": "2025-09-25",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12"
        },
        "showAs": " 290. Deputy Frankie Feighan asked the Minister for Housing, Local Government and Heritage if his Department will consider setting up a funding mechanism within his Department to deal with the challenge of unfinished housing estates, where the existing or exhausted cash or insurance bonds fall well short of the required funds to deal with structural, sewerage and water deficits (details supplied). [50912/25] ",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-25/writtens/mul@/dbsect_303.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-25/writtens/dbsect_303",
          "showAs": "Housing Provision",
          "debateSectionId": "dbsect_303"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-25/pq_290",
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  The legislative process for the taking in charge of housing estates by local authorities is set out in section 180 of the Planning and Development Act 2000. The prescribed process in this regard applies to residential developments consisting of two or more dwellings that have been granted planning permission under section 34 of the Act.  There is no automatic requirement for local authorities to take charge of unfinished housing estates after a certain period of time. Under section 180 (1) of the Act of 2000, the planning authority is obliged to initiate the taking in charge process where requested by either the developer of, or by the majority of owners of the dwellings in, the estate in question. However, this is subject to the development being completed to the satisfaction of the authority and in accordance with the permission and any conditions attached thereto.  Where developments have not been completed to the satisfaction of the planning authority, and where enforcement proceedings in this connection have not been commenced by the planning authority within 4 years of the expiry of the planning permission relating to a development, section 180 (2)(a) of the Act provides that the planning authority shall, where requested by the majority of owners of the houses involved, initiate the taking in charge procedures under section 11 of the Roads Act 1993, as amended (the Roads Act).  Where this particular approach is being progressed, the authority may apply the security or development bond provided as part of the planning application for the purposes of ensuring the satisfactory completion of the development.  Where the calling in of the development bond is not possible or sufficient, section 180(2A) of the Act provides that the initiation of the taking in charge procedures under section 11 of the Roads Act shall not preclude the planning authority concerned from pursuing a developer for any costs incurred by the authority in respect of necessary works undertaken on a development to enable it to be taken in charge by that authority.  In order to conclude the taking in charge process where the development has been deemed to have been satisfactorily completed, a local authority is required to make a declaration under section 11 of the Roads Act following a proposal by the executive. The making of such a declaration, which effectively confirms that the authority is prepared to take over responsibility for the ongoing maintenance of the public works elements of the estate, is a reserved function of the elected members of a local authority.  Therefore, the decision to take any particular estate or estates in charge is ultimately one for the elected members of the local authority who, by way of declaration made under the Roads Act, will make such a decision.  It should be noted that financial decision making and the accountability of local authorities is a matter for the elected members of a local authority who have direct responsibility in law for all reserved functions of the authority, which includes the adoption of the annual budget of the local authority.  In this regard, section 103 of the Local Government Act 2001, as amended, provides for the local authority budgetary process. It is a matter for each local authority to determine its own spending priorities in the context of the annual budgetary process, having regard to both locally identified needs and the funding resources available to the local authority. This includes the taking in charge of housing estates.  There is no longer a dedicated funding scheme for unfinished housing estates and currently there are no plans to reintroduce a further funding scheme for such purposes. ",
        "questionNumber": 290
      },
      "contextDate": "2025-09-25"
    },
    {
      "question": {
        "date": "2025-09-25",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12"
        },
        "showAs": " 322. Deputy Frankie Feighan asked the Minister for Agriculture, Food and the Marine for an update on the regional veterinary laboratory redevelopment plan (details supplied), specifically with regards to the existing Sligo site; if the development of a new laboratory in Sligo is still planned for phase two; when is phase two due to begin; and if he will make a statement on the matter. [50856/25] ",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-25/writtens/mul@/dbsect_337.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-25/writtens/dbsect_337",
          "showAs": "Veterinary Laboratories",
          "debateSectionId": "dbsect_337"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-25/pq_322",
        "answerText": " Minister for Agriculture, Food and the Marine  My Department is working in partnership with the Office of Public Works to develop detailed proposals for a redevelopment programme of the Regional Veterinary Laboratory network.  Under current proposals the development of the laboratory facilities in Sligo is scheduled for the second phase.  Ultimately, the pace and scheduling of these proposals will be determined by the availability of capital funding and the range of other demands on the Vote, through the normal budgetary processes. ",
        "questionNumber": 322
      },
      "contextDate": "2025-09-25"
    },
    {
      "question": {
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-24/pq_69",
        "answerText": " Minister for Education and Youth  I wish to advise the Deputy that my Department has no current record of receiving an application for additional accommodation from the school in question.  The purpose of my Department’s Additional School Accommodation (or ASA) scheme is to ensure that essential mainstream classroom accommodation and accommodation for pupils with special education needs is available to cater for pupils enrolled each year, where the need cannot be met by the school’s existing accommodation or by available accommodation at other schools in the area.  The National Council for Special Education (NCSE) has a statutory function to plan and co-ordinate the provision of education and support services to children with special educational needs, in consultation with the relevant education partners and the Health Service Executive (HSE). This includes the establishment of special class and special school placements in various geographical areas where there is an identified need.  When the NCSE sanction a special class in a school (primary or post-primary), school authorities can apply to my Department for capital funding to repurpose an existing space within the school building to accommodate the class and/or to construct additional accommodation under my Department’s Additional School Accommodation Scheme (ASA). ASA application forms are available on my Department’s website, www.education.ie. Should the school in question receive a sanction from the NCSE for a special class they can apply as set out above to repurpose space or for additional accommodation.  Over the last two years, my Department and the National Council for Special Education (NCSE) have worked closely on a more streamlined and joined up planning process which has ensured a targeted approach to meet demand for special education placements ahead of each new school year.  My Department continues to work with the NCSE in relation to the short-term requirements for special class and special school places and also the more strategic and longer-term requirements. ",
        "date": "2025-09-24",
        "questionNumber": 69,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/dbsect_105",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/mul@/dbsect_105.xml"
            }
          },
          "debateSectionId": "dbsect_105",
          "showAs": "Special Educational Needs"
        },
        "showAs": " 69. Deputy Frankie Feighan asked the Minister for Education and Youth for an update regarding the provision of an autism unit and extension in a school (details supplied); and if she will make a statement on the matter. [50724/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Education",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-24"
    },
    {
      "question": {
        "date": "2025-09-23",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12"
        },
        "showAs": " 119. Deputy Frankie Feighan asked the Minister for Climate, Energy and the Environment if he is aware of the waiting times for applications under the SEAI warmer homes scheme (details supplied); and his views on whether these delays are acceptable. [49718/25] ",
        "to": {
          "roleType": null,
          "showAs": "Climate",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/mul@/dbsect_134.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/dbsect_134",
          "showAs": "Energy Conservation",
          "debateSectionId": "dbsect_134"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-23/pq_119",
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 115 and 119 together.  The Warmer Homes Scheme aims to improve the energy efficiency and warmth of homes owned by people at risk of energy poverty by providing fully-funded retrofits. The scheme is operated by the Sustainable Energy Authority of Ireland (SEAI) on behalf of my Department and is funded through carbon tax receipts and the European Regional Development Fund.  Last year saw a record spend of almost €230 million under the scheme. As reported by the SEAI, this resulted in 7,743 upgrades being provided to low-income households. This year’s budget includes an allocation of €280 million for the Warmer Homes Scheme. This represents an 11-fold increase on the 2020 expenditure figure.  The scheme has been delivering a greater number of deeper and more complex upgrades in recent years. This is reflected in the average cost of upgrades which the SEAI indicates has increased from €2,600 in 2015 to over €29,000 in 2025. These deeper upgrades mean that more lower income homeowners are benefitting significantly from warmer, healthier and more comfortable homes, with lower energy bills and reduced emissions.  The average waiting time under the Warmer Homes Scheme, from application to completion of upgrade works, to date in 2025 was 21 months for the worst performing homes and 22 months for better performing homes.  It is important to note that these averages represent a significant reduction since 2022 when the average waiting time was 26 months. The reduction in waiting times follows a range of measures introduced by my Department and the SEAI. These include the allocation of additional staff to the Warmer Homes Scheme; a significantly increased budget allocation; active contract engagement and management by the SEAI to increase contractor output; as well as actions to address ongoing supply chain pressures.  Given the very high number of applications (approximately 12,000 in 2024 compared to approximately 2,800 in 2021) and the greater volume of deeper retrofits being provided under the scheme, the SEAI is projecting that new applications may face the following waiting times:  • the usual processing time for applications is 5 to10 days from receipt;  • pre-works BER can be up to 12 months from application (if required);  • the survey is approximately 14 months from application;  • works are completed approximately 24 to 26 months from application; and  • the post works BER/inspection is approximately 2 to 3 months after works are completed.  As Minister, I have no function in relation to individual applications. Applicants can contact the SEAI at any time to get further information on the status of their application either by email to warmerhomes@seai.ie or by phone to 1800 250 204. Oireachtas members can make queries on behalf of applicants by contacting the dedicated email address oireachtas@seai.ie.  My officials continue to work with the SEAI to maximise and accelerate the output of free energy upgrades provided under this important scheme. ",
        "questionNumber": 119
      },
      "contextDate": "2025-09-23"
    },
    {
      "question": {
        "date": "2025-09-23",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12"
        },
        "showAs": " 205. Deputy Frankie Feighan asked the Minister for Finance the number of local authorities that own land liable to residential zoned land tax; the amount of revenue raised through local authorities since the introduction of the tax; and if he will make a statement on the matter. [49582/25] ",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/mul@/dbsect_211.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/dbsect_211",
          "showAs": "Local Authorities",
          "debateSectionId": "dbsect_211"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-23/pq_205",
        "answerText": " Minister for Finance  RZLT is an annual tax, calculated at a rate of 3% of the market value of the land within its scope, known as a relevant site. Relevant sites are identified by reference to maps published by local authorities, which are revised on an annual basis, and reflect land that the local authority has determined meets the relevant criteria for the tax, being that the land is zoned for residential or mixed-use (including residential) purposes and that it is serviced. Owners of such land, including local authorities, are required to register and pay the tax by 23 May each year.  I am advised by Revenue that thirty local authorities have filed Residential Zoned Land Tax (RZLT) returns, accounting for €11.5 million of RZLT collections to date. ",
        "questionNumber": 205
      },
      "contextDate": "2025-09-23"
    },
    {
      "question": {
        "date": "2025-09-23",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12"
        },
        "showAs": " 421. Deputy Frankie Feighan asked the Minister for Social Protection the number of people who will receive an increase in their carer's allowance payment when the changes to the means test takes effect in July 2025, by county; and if he will make a statement on the matter. [50466/25] ",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/mul@/dbsect_401.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/dbsect_401",
          "showAs": "Social Welfare Benefits",
          "debateSectionId": "dbsect_401"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-23/pq_421",
        "answerText": " Minister for Social Protection  The information requested by the Deputy is available in my press release dated 03 July 2025 announcing the significant improvements to the Carer's Allowance means test. All Department of Social Protection press releases are available at www.gov.ie/dsp.  I hope this clarifies the position for the Deputy. ",
        "questionNumber": 421
      },
      "contextDate": "2025-09-23"
    },
    {
      "question": {
        "date": "2025-09-23",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12"
        },
        "showAs": " 422. Deputy Frankie Feighan asked the Minister for Social Protection the number of families who have benefitted from the newborn baby grant since it was introduced, by county; if he has any plans to review the scheme; and if he will make a statement on the matter. [50467/25] ",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/mul@/dbsect_402.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/dbsect_402",
          "showAs": "Social Welfare Benefits",
          "debateSectionId": "dbsect_402"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-23/pq_422",
        "answerText": " Minister for Social Protection  Child Benefit becomes payable in respect of newborn babies in the month after their birth, subject to the qualifying conditions.  As part of Budget 2025, a new-born baby grant of €280 was introduced. This is paid to families of babies born, or children with a date of placement, on or after 1 December 2024 in addition to their regular first month’s Child Benefit payment of €140.  The table below outlines a breakdown by county of the number of new-born baby grants paid or payable up to 2nd September 2025.      County      No. of Customers      No of Children       Carlow    407    412      Cavan    523    532      Clare    712    720      Cork    3737    3803      Donegal    1005    1021      Dublin    8953    9096      Galway    1803    1834      Kerry    850    866      Kildare    1829    1861      Kilkenny    545    558      Laois    626    634      Leitrim    201    203      Limerick    1333    1357      Longford    301    306      Louth    1015    1035      Mayo    829    842      Meath    1441    1466      Monaghan    370    378      Offaly    529    538      Roscommon    370    378      Sligo    363    368      Tipperary    1036    1055      Waterford    815    832      Westmeath    648    662      Wexford    1052    1069      Wicklow    1074    1085       Total     32367    32906     I have no current plans to review this grant as it was introduced less than 12 months ago.  I trust this clarifies the matter for the Deputy. ",
        "questionNumber": 422
      },
      "contextDate": "2025-09-23"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12"
        },
        "showAs": " 687. Deputy Frankie Feighan asked the Minister for Housing, Local Government and Heritage further to Parliamentary Question No. 1138 of 8 September 2025, if a reply will issue specifically to the question, which was not answered in the reply and asked him to confirm that he has received a request from Leitrim County Council for funding to deal with historic structural issues around the unfinished housing estate (details supplied). [48737/25] ",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_565.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_565",
          "showAs": "Local Authorities",
          "debateSectionId": "dbsect_565"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_687",
        "answerText": " Minister for Housing, Local Government and Heritage  I can confirm that my Department has received correspondence from Leitrim County Council requesting funding supports to deal with historic structural issues around an unfinished housing estate. My Department is currently examining the said correspondence and will respond in due course.  However, it remains the case that there is no longer a dedicated funding scheme for unfinished housing estates and it is in this context that I must frame my response, noting that s30 of the Planning and Development Act would also apply. ",
        "questionNumber": 687
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 242. Deputy Frankie Feighan asked the Minister for Transport to provide an update on the progress of the review of the large public service vehicle licensing system that his Department are undertaking; his plans to streamline the current inspection process and eliminate duplication across various testing regimes, including the Commercial Vehicle Roadworthiness Test; and if he will indicate a date in which the review will be complete. [44456/25] ",
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_242",
        "questionNumber": 242,
        "answerText": " Minister for Transport  An Garda Síochána carry out a Large Public Service Vehicle (LPSV) inspection to determine the suitability of a bus for use as an LPSV before it can be licensed, and a subsequent inspection at each licence renewal period. The licence is valid for 3 years, unless otherwise provided for by the PSV officer.  The applicant must be a fit and proper person (having regard to character and previous conduct) and the vehicle safe for the carriage of passengers. The technical examination considers the vehicle's specification, age and condition.  As you are aware, my Department is currently undertaking a review of the licensing regime for Large Public Service Vehicles (LPSVs), with the aim of streamlining and improving the overall process. This work is ongoing, and it is expected that the policy review will progress during the remainder of 2025. As part of this process, my Department will also be required to make legislative amendments to implement the outcomes of the review. ",
        "debateSection": {
          "showAs": "Public Transport",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_199",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_199.xml"
            }
          },
          "debateSectionId": "dbsect_199"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 243. Deputy Frankie Feighan asked the Minister for Transport if his Department will introduce a financial support scheme to assist commercial bus operators with the costs of upgrading their tachograph systems to comply with EU law; and if he will make a statement on the matter. [44457/25] ",
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_243",
        "questionNumber": 243,
        "answerText": " Minister of State at the Department of Transport  The EU 'Mobility Package I' introduced a new set of rules for the road transport sector and is applicable across the EU. The package ensures good implementation and enforcement of EU road transport legislation and provides a balance between the social protection of drivers and the freedom of operators to provide cross-border transport services.  As part of the 'Mobility Package I', smart tachographs version 2 must be retrofitted to commercial vehicles, including buses, operating internationally within the EU from 31 December 2024 onwards. Full details of the categories of vehicles to which the 'Mobility Package I' applies is available through the RSA website. This includes detail on deadlines by which upgrades must be completed and the requirements surrounding international transport.  I acknowledge there are costs involved with upgrading tachographs, but this is a necessary once-off investment for commercial bus operators to comply with their legal obligations as set out in the EU Mobility Package I. The cost entailed by the retrofit is a commercial matter for each commercial operator and is determined by a number of factors, including the age, make, and model of the vehicles to be updated. I do not intend to introduce financial supports for tachograph upgrades required under Mobility Package I. ",
        "debateSection": {
          "showAs": "Bus Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_200",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_200.xml"
            }
          },
          "debateSectionId": "dbsect_200"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 244. Deputy Frankie Feighan asked the Minister for Transport to provide a timeframe on when digital payments will be introduced across all public transport in Ireland; and if he will make a statement on the matter. [44458/25] ",
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_244",
        "questionNumber": 244,
        "answerText": " Minister for Transport  As the Deputy may be aware, as Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has responsibility for the development of public transport infrastructure, including ticketing and technology projects.  The NTA's Next Generation Ticketing project will provide a transformative upgrade to the ticketing system for public transport passengers in Ireland. The project will facilitate a variety of payment methods on public transport services, involving a next-generation 'Account Based Ticketing' scheme incorporating both mobile and card-based payments for passengers.  Following a competitive procurement process, the NTA awarded, in April 2024, an overall framework contract for the design, supply, installation and operation of a new multi-modal, ticketing system to Spanish information technology company - Indra Sistemas S.A. - who have designed, installed and operated similar systems internationally. I recently met with Indra Sistemas S.A and we discussed the progress to date.  There is a commitment under the Programme for Government to roll out contactless fare payments on all public transport and to keep fares low and affordable.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a direct reply. Please contact my private office if you do not receive a reply within 10 working days. ",
        "debateSection": {
          "showAs": "Public Transport",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_201",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_201.xml"
            }
          },
          "debateSectionId": "dbsect_201"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Finance",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 527. Deputy Frankie Feighan asked the Minister for Finance his position in relation to taxing energy returns from householders with solar panels who return electricity to the utility companies; and if he will make a statement on the matter. [45858/25] ",
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_527",
        "questionNumber": 527,
        "answerText": " Minister for Finance  I propose to take Questions Nos. 525 and 527 together.  Micro-generation of electricity is the small-scale production of electricity by consumers who generate electricity at their own homes for their own consumption and sell the excess electricity produced to the grid.  Section 216D of the Taxes Consolidation Act 1997 provides that profits of up to €400 per year arising to an individual from the generation of electricity from renewable, sustainable or alternative sources of energy at the individual’s sole or main residence for the individual’s own consumption (referred to as the micro-generation of electricity) is exempt from Income Tax, USC and PRSI. The profits which are exempted are those profits arising from the domestic generation of electricity which is supplied to the national grid. The tax exemption is currently due to expire on 31 December 2025.  As the Deputies will appreciate, decisions regarding taxation measures are made in the context of the annual Budget and Finance Bill processes, at the appropriate time, and having regard to the sound management of the public finances. It is a longstanding practice of the Minister for Finance not to comment in advance of the Budget on any tax matters which might be the subject of Budget decisions. ",
        "debateSection": {
          "showAs": "Tax Exemptions",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_452",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_452.xml"
            }
          },
          "debateSectionId": "dbsect_452"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Enterprise",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 682. Deputy Frankie Feighan asked the Minister for Enterprise, Tourism and Employment if he has any concerns around the recent announcement of changes to the hybrid working policy of a company (details supplied), and before that by another financial institution to reduce their staff working under the hybrid model; and if he will consider reviewing national employment guidance on these matters. [45388/25] ",
        "by": {
          "memberCode": "Frank-Feighan.S.2002-09-12",
          "showAs": "Frankie Feighan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Frank-Feighan.S.2002-09-12"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_682",
        "questionNumber": 682,
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  The sudden onset of widespread remote working during the pandemic has led to a broader acceptance by employers and workers of remote working as a viable long-term option, along with increased interest in flexible working arrangements and work life balance more broadly. Remote, hybrid and flexible working arrangements have become a new normal for many workers. The most recent data from the Central Statistics Office show that in the second quarter of 2025, over 1 million (or 36%) persons reported working from home at least some of the time. Within this, over half a million (555,500) persons were usually working from home.  The Government is committed to facilitating remote and flexible working in a way which maximises economic, social and environmental benefits. The Government delivered all 15 actions outlined in the National Remote Strategy. These include legislating for the right to request a remote working arrangement through the under the Work Life Balance and Miscellaneous Provisions Act 2023, significant investment in Ireland’s remote working hub and broadband infrastructure and the provision of remote work guidance for workers and businesses. The National Remote Work Strategy was overseen the by the Remote Work Interdepartmental Group based in my Department. Programme for Government 2025, Securing Ireland’s Future, re-affirms this commitment to promoting flexible working arrangements that benefit both workers and employers  The right to request a remote working arrangement is available to all employees under the Work Life Balance and Miscellaneous Provisions Act 2023. This right was commenced on the 6th of March 2024. The right to a request flexible working arrangement, such as adjusted working patterns or reduced hours, is available to parents and carers under the Act. The flexible working provisions of the Act are under the remit of the Department of Children, Disability and Equality.  Our legislative framework provides all workers with the right to request a remote working arrangement from their employer. We have not excluded any category of worker or occupation from this right within the legislation.  However, not all occupations, industries, or particular roles within an enterprise will be appropriate or suitable for remote working. Providing a right to request supports and facilitates remote working in Ireland, and at the same time, supports a productive and competitive business environment. In addition to this, Government cannot dictate terms agreed between an employee and employer, nor can the Government become involved in disputes between parties.  Under the Act, employers and employees are obliged to have regard to a Code of Practice when considering applications for remote working arrangements. The Code of Practice provides practical guidance for employers and employees on how to comply with the legislation. The Code also encourages employers to develop a work life balance policy that includes provisions for remote working and flexible working arrangements and provides templates to assist employers and employees.  Employees are able to refer a dispute to the Workplace Relations Commission (WRC) where an employer fails to fulfil their obligations under the Act. In addition, the Code is admissible in evidence in proceedings before a court, the Labour Court or the WRC.  My Department will be commencing a review of the operation of the remote working provisions of the Act, not earlier than one year and not later than two years after the commencement of the Act, in line with the provisions of the legislation. ",
        "debateSection": {
          "showAs": "Flexible Work Practices",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_578",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_578.xml"
            }
          },
          "debateSectionId": "dbsect_578"
        }
      },
      "contextDate": "2025-09-08"
    }
  ]
}