{
  "head": {
    "counts": {
      "questionCount": 663,
      "resultCount": 663
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Health  The Influenza Vaccination Programme provides a free flu vaccine to those most vulnerable to the effects of the flu. Every year the WHO reviews global surveillance data and recommends the specific influenza strains that manufacturers should include in the season's vaccines based on the flu strains that are considered most likely to circulate. Vaccine production takes several months and this allows the manufacturers sufficient time to have vaccine available in time for the start of the flu season. All licensed influenza vaccines included for the 2025/2026 season comply with WHO and NIAC recommendations.  In 2024, HIQA carried out a Health Technology Assessment, or HTA, on enhanced flu vaccines. The HTA noted that studies on the effectiveness of enhanced flu vaccines are limited due to the small number of studies and a paucity of data over multiple seasons. Due to the variability of seasonal influenza, a single study may misrepresent the 'on average' vaccine effectiveness.  Based on the limited data available, the HTA found that switching from a standard to an enhanced flu vaccine for those aged 65 and older would likely reduce the burden of flu. Whether such a switch would represent a good use of public monies would depend on the price of these enhanced vaccines compared with the standard flu vaccine.  Overall, ECDC reported low to moderate relative vaccine effectiveness for the adjuvanted influenza vaccine against laboratory confirmed influenza and against laboratory confirmed influenza related hospitalisation. They concluded that the evidence of the relative vaccine effectiveness of enhanced influenza vaccines compared to standard vaccines is still limited and that further studies are needed to allow more substantial conclusions on the potential benefits of enhanced influenza vaccines.  It should be noted that the UK is experiencing a significant influenza A wave with medium-level impact in terms of hospitalisations up to 29 November 2025. This is in context of a programme using enhanced influenza vaccines. Australia also offered enhanced influenza vaccines and experienced a severe flu season.  In Ireland amongst both hospitalised influenza cases with severe acute respiratory infection and ICU admissions due to influenza this season, where influenza vaccination status was known, 73% had not received the current season influenza vaccine.  For those in recommended groups, the influenza vaccine currently offered as part of the Influenza Vaccination Programme reduces the risk of serious illness and death from influenza. Ensuring high vaccine coverage is the key public health intervention that is required. While Ireland performs well compared to other countries in Europe, achieving high vaccine coverage in older age groups, it is essential that all those in recommended groups continue to be supported and encouraged to avail of the influenza vaccine.  The HSE was asked to commence a tender process to determine if the enhanced vaccines could be purchased at a price that was cost effective and from within their existing budget. The HSE carried out an analysis of the tenders received and on 4 February 2025, advised the Department that neither of the enhanced vaccines for older people met the criteria set out in the HTA for net monetary benefit compared to standard flu vaccine and was over twice the price of the standard flu vaccine.  The HIQA HTA estimates increasing costs of procurement of the enhanced influenza vaccines at between approximately 4 and 19 million euros/year. Actual costs are commercially confidential and are not known until tenders are evaluated each year.  The healthcare budget is finite. Decisions regarding increased spending in one area could impact the provision of other health technologies and treatments within the healthcare system. Therefore, cost-effectiveness must be considered in any decision-making process. The introduction of an enhanced vaccine can be reconsidered when the cost effectiveness is more favourable. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 663. Deputy Donna McGettigan asked the Minister for Health the estimated price, per patient, of the standard flu vaccine and of the enhanced flu vaccine; if she will introduce a policy of offering both and allowing patients decide if they want to pay the extra cost of the enhanced vaccine; and if she will make a statement on the matter. [73478/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_636",
          "debateSectionId": "dbsect_636",
          "showAs": "Vaccination Programme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_636.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_663",
        "questionNumber": 663
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  The State Claims Agency (SCA) has a statutory remit to manage personal injury and third-party property damage claims on behalf of State authorities including the Health Service Executive (HSE). The SCA has provided me with the information set out below. As of 01/12/2025, the State Claims Agency has paid €159 million to date under the Clinical Indemnity Scheme relating to claims finalised in respect of the HSE Mid West Region. This amount includes damages, agency legal and other costs, and plaintiff legal costs and is inclusive of VAT. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 744. Deputy Donna McGettigan asked the Minister for Health the sums paid via the clinical indemnity scheme for Mid-West HSE settled claims; and if she will make a statement on the matter. [73722/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_716",
          "debateSectionId": "dbsect_716",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_716.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_744",
        "questionNumber": 744
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  The State Claims Agency (SCA) has a statutory remit to manage personal injury and third-party property damage claims on behalf of State authorities, including the Health Service Executive (HSE). The SCA has provided me with the information set out below. As at 17/12/2025, the State Claims Agency has 123 claims, that were created during or before 2020 that relate to the HSE Mid West Region, which have not been concluded. These claims are under active management at various stages of the claim lifecycle. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 745. Deputy Donna McGettigan asked the Minister for Health the number of claims which were not settled in the period 2015-2020 for the Midwest region and are still outstanding; and if she will make a statement on the matter. [73723/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_717",
          "debateSectionId": "dbsect_717",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_717.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_745",
        "questionNumber": 745
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  I appreciate that there has been some confusion regarding the introduction of the new Adult Educator grade and how whole-time equivalent (WTE) hours are calculated for pay purposes. I want to take this opportunity to clarify the position.  Under the contractual framework for this new grade outlined in Information Note ESR ETB 0001/2024 issued to the Education and Training Boards (ETBs) in April 2024, a WTE post is calculated as follows:  • 20 hours of learner delivery per week; 15 hours of non-contact time per week.  This equates to the contractual obligations of an Adult Educator to deliver 1,044 contact hours and an associated 782 non-contact hours for a WTE post per year, equating to a total of 1,826 hours for a WTE. The WTE equivalent of 1,044 contact hours represents the maximum annual contact hours for a full-time Adult Educator, ensuring compliance with the Haddington Road Agreement. The non-contact time, equivalent to 782 non-contact hours, is not formally timetabled but is expected to be used for essential professional activities such as programme development, lesson preparation, learner assessment, and continuing professional development.  Flexibility remains for part-time arrangements and additional hours where appropriate, subject to compliance with the Organisation of Working Time Act and other relevant agreements.The Deputy may recall that in 2024 a new grade of Adult Educator was created following a Labour Court recommendation. This was the culmination of many years of work by my Department, in close collaboration with the Department of Education and Youth, the Department of Public Expenditure, Education and Training Boards Ireland (ETBI), and with the strong support of the unions SIPTU and TUI. This new grade provides a standardised pay scale aligned to the Youthreach Resource Person grade, delivering incremental progression for Adult Educators.  These arrangements were formally communicated to ETBs by the Department of Education and Youth in April 2024. Tutors who choose to assimilate onto the new contract will benefit from these standardised terms. Those who do not will remain on their existing contractual arrangements. Finally, it should be noted that individual ETBs are the employers and, as such, are responsible for staffing matters such as contracts, subject to Ministerial consents and approvals as may be determined from time to time. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 786. Deputy Donna McGettigan asked the Minister for Further and Higher Education, Research, Innovation and Science the reason ETB tutors have been told they cannot work more than 20 hours per week (details supplied); and if he will make a statement on the matter. [73608/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_752",
          "debateSectionId": "dbsect_752",
          "showAs": "Further and Higher Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_752.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_786",
        "questionNumber": 786
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  Australia and Ireland share close and long-standing connections, underpinned by strong people-to-people links. In 2026, we will celebrate 80 years of diplomatic relations with Australia and our Missions are engaged in a range of activities both to mark the anniversary and to deepen bilateral engagement and cooperation at multilateral level.  Ireland is currently represented by two Diplomatic Missions in Australia, with an Embassy in Canberra and a Consulate General in Sydney. In early 2026, that representation will increase to three missions when we open a Consulate General in Melbourne. Plans are well under way for the opening of the Consulate and Marie-Claire Hughes has been appointed as Consul General. This will bring Ireland's diplomatic presence to 18 missions in the Asia Pacific region.  The Embassy and the Consulates work to promote and protect Irish interests in Australia, to strengthen political and economic relationships, to support the Irish community and to promote cultural ties and the Irish arts. In addition, our Honorary Consul in Perth provides consular services and assistance to Irish citizens, supports local Irish community efforts and assists in developing trade and economic relations with Western Australia. Our missions also work closely with the State Agencies to promote trade, tourism and inward investment. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 167. Deputy Donna McGettigan asked the Minister for Foreign Affairs and Trade her Department's plans to expand Ireland's diplomatic presence across Australia; and if she will make a statement on the matter. [71396/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_101",
          "debateSectionId": "dbsect_101",
          "showAs": "Diplomatic Representation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_101.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_167",
        "questionNumber": 167
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  I am advised that the Defence Forces sought quotes from three suppliers to supply Wind Instruments in November 2025. Only one valid submission was received for this competition, and this contract is currently ongoing.  This approach is in line with Office of Government Procurement Guidelines which directs that contracts below the national advertising threshold of €50,000 (exclusive of VAT), may be awarded on the basis of responses to written specifications (for example, by email) issued to at least three suppliers or service providers.     ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 235. Deputy Donna McGettigan asked the Minister for Defence the number of musical shops that applied for the contract to supply the Defence Forces School of Music with musician instruments but were unsuccessful when the contract was last out to tender; when will this contract be next put out to tender; and if she will make a statement on the matter. [71406/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_157",
          "debateSectionId": "dbsect_157",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_157.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_235",
        "questionNumber": 235
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to cycling and public transport infrastructure, including the provision of funding to the National Transport Authority (NTA) in support of public bike-sharing schemes in Galway, Limerick, Cork and Waterford.  Outside of the regional cities, many local authorities have arrangements in place with shared mobility companies to provide bike-sharing schemes under contract or licence agreement. These schemes are not funded through the NTA. Accordingly, any proposals regarding the introduction of a shared bike scheme in Clare are a matter for consideration by Clare County Council. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 264. Deputy Donna McGettigan asked the Minister for Transport the position regarding the introduction of an e-bike rental scheme for County Clare; and if he will make a statement on the matter. [71391/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_179",
          "debateSectionId": "dbsect_179",
          "showAs": "Cycling Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_179.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_264",
        "questionNumber": 264
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The Office of Public Works (OPW) can confirm that one project, in excess of €40,000, was carried out at Kilrush Garda Station, commencing in 2024 with retention due in December 2025.  The nature of the works are outlined in the table below:     Year    Nature of Works    Expenditure ex VAT      2024/2025    Replacement of:  • Main Entrance Doors to Public Reception Area  • Rear Entrance Doors  • Side Emergency Exit Doors      Expenditure is considered commercially sensitive until the final account is agreed and the information can be provided to the Deputy at that time.      ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 380. Deputy Donna McGettigan asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the nature of refurbishment works that the OPW carried out at Kilrush Garda Station, where the value of works was in excess of €40,000 in 2024 and to-date in 2025, in tabular form; and if he will make a statement on the matter. [71402/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_278",
          "debateSectionId": "dbsect_278",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_278.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_380",
        "questionNumber": 380
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The Office of Public Works (OPW) can confirm that no refurbishment works, in excess of €40,000, were carried out at Shannon Garda Station in 2024 or to-date in 2025. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 381. Deputy Donna McGettigan asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the nature of refurbishment works that the OPW carried out at Shannon Garda Station, where the value of works was in excess of €40,000 in 2024 and to-date in 2025, in tabular form; and if he will make a statement on the matter. [71403/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_279",
          "debateSectionId": "dbsect_279",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_279.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_381",
        "questionNumber": 381
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, National Development Plan Delivery and Reform  The Office of Public Works (OPW) can confirm that one project, in excess of €40,000, was carried out at Ennis Garda Station. The project commenced on site in 2024 and completed in 2025 when final retention was paid.  The nature of the works are outlined in the table below:      Year      Description of Works      Cost ex VAT       2024/2025    • Main & Sub Electrical Distribution System Upgrade    €310,725.86     I can confirm that no other works in excess of €40,000 were carried out in 2025 at Ennis Garda Station. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 382. Deputy Donna McGettigan asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the nature of refurbishment works that the OPW carried out at Ennis Garda Station, where the value of works was in excess of €40,000 in the years of 2024 and to-date in 2025, in tabular form; and if he will make a statement on the matter. [71404/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_281",
          "debateSectionId": "dbsect_281",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_281.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_382",
        "questionNumber": 382
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  This Government is fully committed to ensuring that every child has a positive school experience, with access to qualified and engaged teachers who are dedicated to supporting their learning.  An analysis of teacher payroll data, as of March 2025, shows there are 79,225 teachers employed in our schools across the country with 43,221 at primary level including special schools and 36,004 in post-primary schools  The ratio of female to male teachers in primary and post-primary schools (excluding ETBs) in the 2024/25 school year was 6:1 and 2:1 respectively.  The Department produces and publishes a range of data on teachers including the gender of teachers appointed. The data may be found on the Teacher Statistics section to the Department's website, using this link <https://www.gov.ie/en/department-of-education/publications/teacher-statistics/>  In addition, the Department recently published 3 reports on teacher supply including data on an analysis of the Teaching Council register, a survey of substitutes and a survey of teacher unmet demand in post-primary schools.  The Department provides a range of measures to address teacher supply. The Department announced new measures in 2025 including assisting teachers gain permanent roles more quickly and approving regulations recently to allow teachers who qualified overseas to undertake their induction in the State.  My Department remains committed to supporting a diverse and sustainable teaching workforce and is currently developing a strategic workforce plan for the teaching profession, in partnership with UNESCO and supported by the European Commission’s Technical Support Instrument.  In addition to recently announced measures, the Department will continue to consider further measures to strengthen the teaching workforce and ensure that schools have the support needed to provide an excellent education for every student. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 443. Deputy Donna McGettigan asked the Minister for Education and Youth the ratio of male to female teachers in primary and secondary schools respectively; the measures he will introduce to increase the number of males training to become primary and secondary school teachers; and if he will make a statement on the matter. [71569/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_332",
          "debateSectionId": "dbsect_332",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_332.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_443",
        "questionNumber": 443
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage (Deputy Christopher O'Sullivan)  The National Parks and Wildlife Service (NPWS) has carried out extensive refurbishment and related capital works in the Burren National Park between 2024 and 2025 in order to address longstanding shortcomings in facilities and provide adequate support to staff. To this end, the purchase of McGann’s Farm in Tullycommon in 2024 has provided an important base for staff within the region and will support operations within the Park for years to come.  Continued investment will be required in coming years to ensure ongoing improvements to visitor infrastructure and staff facilities, enhancing the experience for visitors to the area while supporting the NPWS’s core mission to protect nature.  A table outlining projects and their status in the Burren National Park is attached.      Year 2024      Works Commissioned      Location in Burren National Park (NP)      Complete (Y/N)       1.    Stockyard for Conservation Grazing    Slieve Carron Nature Reserve (NR)    Y      2.    Upgrade Road (Section of Marked Trail)    Green Rd, Gortlecka    Y      3.    Preparing and Submitting a Planning Application: Upgrade Existing Septic Tank to Effluent Treatment System and Soil Polishing Filter.    Glencolumbkille South    Y      4.    Condition Survey/Report, Conservation Report and Project Plan (Purcell’s Farm Complex); MOU with Irish Natural Stone.    Purcell’s Farm Complex (Ruins): Keelhilla, Slieve Carron NR    Y      5.    Preparing and Submitting a Planning Application to refurbish Research Centre (Burren Field Study Centre); MOU with Galway University.    Carron Research Station, Fahee, Carron, Ennis.    Y         Farmhouse, Tullycommon            6.    Asbestos Report, Removal and Disposal    Farmhouse    Y      7.    Permission for Septic Tank Upgrade    Farmhouse    Y      8.    Application Declaration of Exemption for Extension to Dwelling    Farmhouse    Y      9.    Radon Test    Farmhouse    Y      10.    SEAI Technical Assessment Report    Farmhouse    Y      11.    Rewire House & Pump    Farmhouse    Y      12.    Security CCTVs, Gate, Access Door & Lighting    Farmhouse Area    Y      13.    Rock Breaking & Concrete Works for Security Gate Entrance    Farmhouse    Y      14.    Entrance: Refurbish Steel Gate, Piers, Wall    Farm Entrance    Y      15.    Driveway: Fence and gate    Farm Entrance    Y      16.    Driveway Gravel    Farm Entrance    Y      17.    Farmyard Gravel    Farmyard    Y      18.    Planning for 4 Agricultural Sheds    Farmyard    Y      19.    Stone for Shed Foundations    Farmyard    Y      20.    Concrete & Steel Mesh for Sheds    Farmyard    Y      21.    Shed Foundations    Farmyard    Y      22.    Supplies for Shed Roof Repairs    Farmyard    Y      23.    Electrical Works on Sheds    Farmyard    Y      24.    Construction of 2 Haybarns & 2 Lean-to open sheds    Farmyard    Y      25.    Slate for Traditional Farm Buildings    Farmyard    Y      26.    Roofing/Gutters of Traditional Farm Buildings    Farmyard    Y      27.    Upgrade Farm Boundary Road    Farm Boundary    Y      28.    Orchard Fence    Farm    Y      29.    Submersible Pump Work    Farmyard    Y      30.    Fencing off Walking Trail    Road adjacent to farm    Y       Year 2025      Works Commissioned      Location in Burren National Park (NP)      Complete (Y/N)       31.    Refurbish Ruin/Grounds: Clearing, Demolition, Roof and Flooring.    Glencolmbkille National School (Ruin)    Ongoing      32.    Restoration Services (Purcell’s Farm Complex)    Purcell’s Farm Complex (Ruins): Keelhilla, Slieve NR    Ongoing      33.    Consultation and Close Out for Works (Burren Field Study Centre)    Carron Research Station, Fahee, Carron.    Y         Tullycommon            34.    Supplies for Traditional Farm Buildings    Farmhouse    Y      35.    Refurbish Traditional Horse Stables    Farmyard    Y      36.    Rebuild Gable, Internal Repointing, Exterior Air-vents of Old Stone Building    Farmyard    Y      37.    Electrical Works on Sheds    Farmyard    Y      38.    Fire Alarms for 2 Machinery Sheds    Farmyard    Y      39.    Fire Management Plan and Fire Safety Equipment    Farmhouse, Sheds and Yard    Y      40.    Supplies for Reroofing Sheds    Farmyard    Y      41.    Construction of Replacement Haybarn    Farmyard    Ongoing      42.    Electrical Works on 4 High Bay Sheds    Farmyard    Y      43.    Gravel - Roads around sheds    Farmyard    Y      44.    Install Cattle Crush & Water Pipes from Shed to Pump    Farmyard    Ongoing      45.    Submersible Pump Work    Farmyard to Shed    Y      46.    Removal of Old Wall & Water Tank. Excavate & Install New Water Tank, Water Pipes and Channels with Retaining Wall Around Shed.    Farmyard    Ongoing      47.    Establish Heritage Orchard; including Fencing; MOU with Irish Seed Savers.    Rockforest    Ongoing       Year: 2026      Planned works      Location in Burren National Park (NP)      Status       48    Refurbish of the Carran Field Study Centre    Carran Village    Proposed      49    New Visitor Centre    Corofin    Proposed      50    Reception area/all ability trail    Rockforest    Proposed      51    Composting toilets    Slieve Carron, Keelhilla, Kenny’s Cross    Proposed      52    Continued restoration of Purcell’s Farm Complex    Purcell’s Farm Complex (Ruins): Keelhilla, Slieve NR    Ongoing      53    Continued refurbishment of Farmhouse    Tullycommon, Carran    Ongoing        ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 545. Deputy Donna McGettigan asked the Minister for Housing, Local Government and Heritage the nature of refurbishment works that were carried out at Burren National Park in 2024 and to-date in 2025, in tabular form; the refurbishment works that are scheduled to commence at this National Park during the first half of 2026; and if he will make a statement on the matter. [71405/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_429",
          "debateSectionId": "dbsect_429",
          "showAs": "National Parks",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_429.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_545",
        "questionNumber": 545
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I can assure the Deputy that I am committed to ensuring that An Garda Síochána has the resources it needs for its vital policing work, and a strengthened, well-resourced Garda organisation is central to this policy. In this regard the Garda Vote in Budget 2026 saw an unprecedented allocation of over €2.59 billion for the year, a 33% increase since 2021.  The Garda Commissioner is responsible for managing and administering An Garda Síochána under the Policing, Security and Community Safety Act 2024, including responsibility for the allocation and deployment of resources and the purchase of equipment.  I am informed by Garda authorities that no anti-vehicle ram barriers have been purchased by An Garda Síochána in 2024 or in 2025 to date. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 672. Deputy Donna McGettigan asked the Minister for Justice, Home Affairs and Migration the amount that An Garda Síochána spent on purchasing anti-vehicle ram barriers in 2024 and to-date in 2025, in tabular form; and if he will make a statement on the matter. [71392/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_533",
          "debateSectionId": "dbsect_533",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_533.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_672",
        "questionNumber": 672
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I have requested the information sought by the Deputy from the Garda authorities. Regrettably, this was not available in time and I will write to the Deputy once the information is to hand. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 673. Deputy Donna McGettigan asked the Minister for Justice, Home Affairs and Migration the amount spent on vehicle recovery services within Clare-Tipperary division in 2023 to-date in 2025, by year, in tabular form; and if he will make a statement on the matter. [71393/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_534",
          "debateSectionId": "dbsect_534",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_534.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_673",
        "questionNumber": 673
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this PQ refers to an operational issue, it has been forwarded to the HSE for response. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 903. Deputy Donna McGettigan asked the Minister for Health the number of WTE sonographers by grade posts that were filled at Limerick Maternity Hospital in 2024 and to-date in 2025; if this number will be further increased during Q1 2026; and if she will make a statement on the matter. [71394/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_718",
          "debateSectionId": "dbsect_718",
          "showAs": "Hospital Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_718.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_903",
        "questionNumber": 903
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 904. Deputy Donna McGettigan asked the Minister for Health the number of WTE physiotherapists that were based at Ennis Hospital in each of the years of 2023, 2024 and to-date in 2025, in tabular form; and if she will make a statement on the matter. [71395/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_719",
          "debateSectionId": "dbsect_719",
          "showAs": "Hospital Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_719.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_904",
        "questionNumber": 904
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  Under the Health Act 2004, the Health Service Executive (HSE) is required to manage and deliver, or arrange to be delivered on its behalf, health and personal social services. The Minister for Health is prohibited from directing the HSE to provide a treatment or a personal service to any individual or to confer eligibility on any individual.  In relation to the particular query raised, as this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 953. Deputy Donna McGettigan asked the Minister for Health the reason a person (details supplied) has not received the spinal surgery they require; if she will ensure they are treated promptly; and if she will make a statement on the matter. [71691/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_766",
          "debateSectionId": "dbsect_766",
          "showAs": "Hospital Procedures",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_766.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_953",
        "questionNumber": 953
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  I am conscious of financial challenges facing learners and the need for the progressive implementation of measures to address costs as a barrier to attending tertiary education. It is a priority for me to explore the most effective and sustainable ways to support learners in managing these costs.  As part of Budget 2026, I announced a permanent reduction in the Student Contribution charge. This flat rate reduction has reduced the rate from €3,000 to €2,500 for undergraduate students eligible for the free fees initiative and, applied on a pro rata basis, has lowered the student contribution by 17% for apprentices attending Higher Education. This will benefit approximately 14,000 apprentices in the 2025/26 academic year.  As part of Budget 2026, it was important for me to make permanent, sustainable interventions which would give families and learners certainty. With this permanent measure I have done that. This is the first time the student contribution has been permanently reduced.  Looking ahead to future Budget decisions, I will continue to consider all options available to me to reduce the cost of education for apprentices, students and their families. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1168. Deputy Donna McGettigan asked the Minister for Further and Higher Education, Research, Innovation and Science if he will reconsider and reintroduce the 33% reduction on contributory fees for apprentices which was reduced to 17% in the recent budget; and if he will make a statement on the matter. [71831/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_984",
          "debateSectionId": "dbsect_984",
          "showAs": "Departmental Budgets",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_984.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1168",
        "questionNumber": 1168
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  Our Rural Future, the Government's Rural Development Policy, recognises the opportunity for rural rejuvenation that remote working presents and commits to establishing a comprehensive and integrated national network of 400 remote working hubs by the end of 2025. I was delighted to announce at the National Hub Summit recently that we have reached that key target. As of the 8th of December, there are 401 hubs on-boarded to the Connected Hubs platform. In County Clare there are 14 hubs on-boarded, increasing from 10 when the platform was launched in 2021.  My Department has also funded the Broadband Connection Points (BCP) initiative which provides free high-speed broadband WiFi access at 300 locations around the country. Over 60 of these BCPs have established remote working facilities and are on-boarded to the Connected Hubs platform. Details of all the on-boarded hubs are available at www.connectedhubs.ie.  My Department has invested significantly in the establishment and development of remote working hubs through the range of schemes which make up my Department's Rural Development Investment Programme. This includes funding for the development of hubs under schemes such as the Town and Village Renewal Scheme, the Rural Regeneration and Development Fund and LEADER. It is envisaged that this capital funding will continue as part of these schemes with a continued strategic focus for this investment.  In 2021 and 2022, a new targeted scheme was implemented to support the development of facilities in hubs across Ireland including additional desk space, privacy booths, technical equipment, meeting facilities and access control. Almost €14 million in funding to some 200 projects was allocated via the 'Connected Hub Calls'.  I intend to publish a first National Hubs Strategy shortly, developed jointly with the Department of Enterprise, Tourism and Employment and the Western Development Commission and following consultation with key stakeholders. The strategy will present a coherent approach to the future development of remote working hubs and will include measures to underpin the sustainable development of the Connected Hubs network as well as supporting balanced regional economic development and digital services for rural communities. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 1177. Deputy Donna McGettigan asked the Minister for Rural and Community Development and the Gaeltacht his Department's strategy to expand connected hubs and remote working infrastructure including the potential for new hubs in Clare; and if he will make a statement on the matter. [71407/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_992",
          "debateSectionId": "dbsect_992",
          "showAs": "Departmental Strategies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_992.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1177",
        "questionNumber": 1177
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Deputy Donna McGettigan  One of the biggest issues for apprentices is placements for educational training. While there is an option to swap placements, sometimes there is not enough time to do this or to find someone to swap with. Apprentices have no idea where they will be placed, causing huge stress as they will need to budget for this added expense. Furthermore, the accommodation allowance for this is only €70 per week. Does the Minister accept that more supports are needed in the current cost-of-living crisis? If we consider the cost of rent in the country, the current system is forcing people into paying double for their accommodation and this is not acceptable. \n Minister for Further and Higher Education, Research, Innovation and Science (Deputy James Lawless)  I thank Deputy McGettigan. I understand well the issue that she raises and I share her concern. It is well-placed. I have heard this myself from apprentices out in the field in different locations. I have heard about the challenges they face when they are sometimes placed somewhere far from home and how difficult that is to manage. Finding accommodation, of course, is a big complication as part of that as well.  I know the Deputy raised this issue before the committee recently when she was there with SOLAS. I have raised it with SOLAS myself on a number of occasions, including very recently. I have actually asked SOLAS as a starting point to review the current placement and allocation system for apprentices, and then to fix it, and to identify any opportunities for improvement. I have also heard anecdotally from engagement with employers who are taking on many apprentices that there can sometimes be a degree of arbitrariness in the system. Even though there is supposed to be a design and methodology in place, it appears that does not always manifest. This is something I have asked SOLAS to look at and take on.  It is worth noting that apprenticeships are national programmes. As with every other post-secondary education route, it is not possible that every programme will be provided in every educational institution. An apprenticeship may be delivered through a particular local ETB but it is actually a national scheme. In our own county of Kildare, which myself and the Cathaoirleach Gníomhach share, farrier apprenticeships are available. They are not available anywhere else, as I understand it, and that is because there is a particular speciality and set of knowledge within Kildare. There are probably exceptions. If people are doing a farrier apprenticeship, Kildare is where they go to do it. There are other skills. Wind turbine maintenance is available on the coast in Tralee, for example. There are other skills that are particular to specific areas. There is also the situation where apprentices are given an offer of a placement and they can decline that if it does not work for them. They can say \"No\" and then the place will be allocated to the next person on the list to take up. They get up to three refusals. \n Deputy Donna McGettigan  Gabhaim buíochas leis an Aire. I welcome that he has been in contact with SOLAS, as have we on the committee. In some cases, we were finding at the committee that someone in Donegal was going to Cork and someone from Cork going to Donegal, both doing the same apprenticeship. It just beggars belief how that happens so I welcome the fact that SOLAS will review, and also fix, this. During recent committees, we heard directly from apprentices about the challenges for their placements. The situation is affecting all ages of apprentices now within a wider age range as the demographic for apprentices has changed significantly, as the Minister knows. There are now more and more apprentices who have families to support and mortgages in one location. This means that their responsibilities at home would be severely impacted as they would need to leave for 12 weeks. It is not sustainable. I welcome the fact that the Minister is going to get SOLAS to look into this. It should stop this whole lottery basis and apprenticeships should be closer to home. \n Deputy James Lawless  Again, I agree with the Deputy. Part of the situation is that when an apprentice is offered a place, they are offered the next available place. There is pressure on for good reason. I put that pressure on myself to get as many people trained as quickly as possible. I addressed some of the backlogs that had previously arisen during Covid, etc. As a place becomes available on a particular course, the student will be offered the next available place. That may not be close to home but they do have the option to refuse that place. They can do that up to three times without any consequence in terms of their allocation or their place in the queue. Sometimes, by doing that they can wait and get a place closer to home. Some apprentices come forward and say they are happy to travel because they want to get through their programme and out the far side and increase their earnings, etc., by doing so. Supports are available in particular circumstances as well, particularly for members of the Traveller community, young people from particularly disadvantaged groups and learners from other under-represented groups in further education. There are some targeted schemes and financial supports available to assist in particular circumstances. \n Deputy Donna McGettigan  The only issue there is that they have to accept a placement within seven working days of the notification date. If they start declining, there is a fear that they may not ever get placed on this. It is an absolutely hellish situation out there for student accommodation and there is the fear too that if they do not accept the place they may not get accommodation. This process should ensure fairness for all apprentices. The Minister has said that himself. Is it fair for apprentices, many of whom are paid below minimum wage and are already paying extra rent, to be forced into living in unregulated digs because of their placement? They also may not even find a place to live and instead have to make long commutes. Once again, let us hope SOLAS rectifies all this for them. \n Deputy James Lawless  The Deputy will be aware that there are allowances available to the apprentices who have to travel. There are various different rates and different bandings depending on whether they are travelling 5, 10 or 20 miles, right up to 40 miles or more. There are different travel allowances available to apprentices to help them in meeting those travel costs. While the issue is a real one, and one which I have asked SOLAS to examine and tackle, there is an induction module for apprentices when they start. Depending on the particular apprenticeship, and I gave the example of the farriers located in Kildare but there are many across the country, it should be known by people entering that these are based in a particular limited location. Equally, some of the larger courses, like those for electricians, plumbers or wood manufacturing, are available more widely and in those cases it is reasonable to expect that a place closer to home would come available. I expect a certain degree on knowledge on the part of the apprentice. Certainly, that should be communicated during the induction stage. Even though there may be a seven-day window to accept or refuse the place, there should have been an awareness of what is likely to arise long before that stage. ",
        "questionType": "oral",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 199. Deputy Donna McGettigan asked the Minister for Further and Higher Education, Research, Innovation and Science the steps his Department is taking to develop and reform the placement and allocation system for apprentices, ensuring that these are reasonably within a commutable area close to where they live; and if he will make a statement on the matter. [67911/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/dbsect_37",
          "debateSectionId": "dbsect_37",
          "showAs": "Apprenticeship Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/mul@/dbsect_37.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_199",
        "questionNumber": 199
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Deputy Donna McGettigan  The plans for a business school at UCC have been in development for the past three years, with reports that an architect firm had signed a contract of €3.5 million in 2022. From my understanding, the project was expected to cost over €100 million and was slated to start in 2024. This would have also included the provision to accommodate 4,000 students. The statement from UCC stated the college would provide an update on Cork university business school in the new year. Are we now in a situation where millions of euro of taxpayers' money is effectively down the drain? Will the Minister clarify what the situation is? \n Deputy James Lawless  I hope the Deputy will agree that value for money is a key component of every State-sponsored project or use of State funds. UCC is an autonomous institution. It manages its own projects and capital and it is responsible for the oversight, planning and management of its capital development plan. The university has a review under way in light of increased construction inflation. The increase in construction costs and materials in recent years has been well ventilated and that has an impact on provision and delivery of various projects. On completion of that review which is currently under way, UCC will submit its capital plan to the governing authority in the coming months; I expect it in the new year. Provision of €25 million was made for the business school in 2019 under the higher education strategic infrastructure fund. Approval in principle was granted in 2019 and the total cost of the project at that time was estimated at €105 million, with a delivery of a 17,000 sq. m custom-built business school on a site on Union Quay being examined.  I understand that the university and the governing authority have full intention and full ambition to develop a world-class business school. They are committed to the project. It will advance. However, value for money is a key consideration. Space utilisation and optimisation in the preferred location must be a feature, as must student access and accessibility, synergy and the ability to leverage other parts of the existing campus. There are a number of considerations that are currently being examined in light of this review but I am assured that the ambition and intention remains to deliver a world-class business college of which the city and the college can be very proud. However, I do not expect that it will be the same proposal as has been previously presented. \n Deputy Donna McGettigan  It is no secret that universities are continuing to deal with chronic underfunding for the best part of 30 years and there does not seem to be any let-up on that front. This means many universities have a heavy reliance on international students, who pay costly fees towards the Irish university sector, and potentially this is a factor in this project not going ahead. According to the Irish Examiner, the UCC business school plan was reliant on the expected income to the business school coming from international students. The publication also recorded that during the first post-pandemic year of 2022, 52,000 student visas were authorised in the State. That increased to 60,901 last year. According to statistics provided to the Dáil in May, figures for this year are not in yet but the indications are that there has been a drop-off in the number of students, particularly Chinese students, coming here.  Why do our State-owned universities have to scramble for funding elsewhere? Is there not a need for funding contingency in these types of situations? \n Deputy James Lawless  For clarity, I am not aware of any impact on this particular project as a result of any kind of funding withdrawal or shortfall. It is news to me if that is the case. It has not been raised with me by any of the college authorities or anybody else in the sector other than by way of the Deputy's suggestion today on the floor of the Dáil. As such, it is fair to say it is not a factor here. What is strongly a factor is delivering value for money. I hope the Deputy agrees with me that it is important State funding is used well, wisely and to deliver maximum benefits for the institute and for the student population it serves.  The ambition remains to develop a very high-end business school in the ambit of UCC. However, a wise reassessment is taking place of the overall project specifications, scope and cost envelope as part of the capital review plan. I am heartened that the college authorities are doing that. It is a wise approach to the use of State money and the ultimate outcome will be far stronger for it. \n Deputy Donna McGettigan  I welcome that there is still ambition for this project. However, ambition is not reality or actual work on the ground. Is the Minister aware of any timeframe for how long the review will take? What happens if we are left with an unfinished site? That site could accommodate 4,000 students. Meanwhile, students continue to struggle to afford extortionate rents in the private market. We are now in a situation wherein the university has paid out millions of euro on a development that is, in effect, abandoned for now, although the Minister says the ambition to progress it is still there. This should not be happening. Hard-working taxpayers have a right to know what has happened. Can the project be taken over by the Department to ensure the site is developed to house students if what is planned does not go ahead? \n Deputy James Lawless  The Deputy will have to forgive me for saying I am not entirely sure what she is asking. On the one hand, she is calling for me to spend more money and, on the other, she is talking about being careful with taxpayers' money. I am a little confused as to what her ask is. Value for money is a key consideration. UCC is an autonomous body and a very well-run institution with an extremely competent chair, president and board. They have told me they intend to publish their renewed and revised plans early in the new year and we will then see the shape of the new business college. It certainly will be stronger for the process that has been gone through. Throwing good money after bad would not be wise. Proceeding with a project that, at a specification and cost level, may be far in excess of what is appropriate or necessary would not be a wise move. I am speaking hypothetically but I hope the Deputy agrees with me on that principle. I look forward to UCC publishing its revised plans for the business school in 2026. The university will have my full support for the next steps. ",
        "questionType": "oral",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 200. Deputy Donna McGettigan asked the Minister for Further and Higher Education, Research, Innovation and Science the steps his Department is taking in relation to the reports that a €17 million business school at University College Cork has been permanently shelved; and for an update on the status of the matter. [67912/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/dbsect_38",
          "debateSectionId": "dbsect_38",
          "showAs": "Third Level Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/mul@/dbsect_38.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_200",
        "questionNumber": 200
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Deputy Donna McGettigan  This question is a bit outdated since the rescheduling of the Dáil last week. A recent OECD report on technological universities identified the exclusion of professorships at TU level as a huge shortcoming that should be urgently addressed. The report states the current TU system cannot fully achieve the expectations set out in the Technological Universities Act 2018. I welcome the announcement the Minister recently made that professors will be coming into TUs. \n Deputy James Lawless  I thank the Deputy. It is something I am focused on and it is in the programme for Government. It is something I have been working on since I took on the position. I am committed to continuing the progress of the technological universities as key drivers of regional and national development. They have fantastic potential and are already realising it. I think I have visited all of them at this stage - multiple sites within some of them. They are a strong regional accelerator in terms of bringing excellence and university education to every corner of the country.  Last week, I announced a new targeted investment of €65.8 million for the technological university sector. That is the targeted enhancement fund, TEF. The projects will run over a 36-month period up to December 2028. That fund includes provision for the technological university professorships. The professor grades will be funded through that. There are some approvals required from other parts of the Government, primarily the Minister for public expenditure, Deputy Chambers. I am working closely with him to finalise the terms and conditions that will attach to those grades. I am confident of resolving this matter before year's end. We are nearly there now but I have been working on it intensely, particularly in recent weeks. That will be a significant milestone. It will give the technological universities the status they deserve and allow professors to be appointed within them, which is necessary for leadership of research projects, enterprise engagement and a status commensurate with their positioning. I am confident we have made significant progress on this in recent weeks. I hope to be able to announce that and get it brought to a conclusion, with agreement from the Government, before the year's end. \n Deputy Donna McGettigan  There is a huge issue with parity of esteem within further and higher education and that needed to be addressed. There should not be this distinction between our institutions and those wishing to pursue their education, whether at Trinity College or a TU. The development of technological universities has undoubtedly been a hugely impactful and positive change for higher education, boosting regions that otherwise would not have the opportunities for regional development. The absence of professorships has been a massive drawback in developing research capacity, crucial to these landmark TUs. Currently, legacy universities employ between 10% and 15% of their staff at professor level while the TUs have none. What percentage of staff will these new professors represent? Will their pay equal their counterparts' in legacy institutions? \n Deputy James Lawless  For clarity, I will provide a short recap of the historical position. The original institutes of technology, IoTs, did not have professorial grades. They were amalgamated, largely, to form the technological universities we have now. Within the IoTs, the comparative grade was senior lecturer 3. The scales, grades, bands and job titles did not innately map onto the universities'. In some cases, the legacy job titles, conditions and work programmes did not map either. For example, they did not necessarily work over the summer. In a traditional university, a research professor would have a body of work over the summer months. In an IoT, a senior lecturer would typically finish up at the end of the academic term in May and not return until maybe late September. That is a significant difference. It is not just about giving them a new title, but about looking at their work output, the programmes they take on, enterprise engagement and the leadership role they play in the academic sector and that they are more than capable of playing, but it has to be reflected. That is part of this programme of transition as well. \n Deputy Donna McGettigan  The potential for massive increases in research and development if professors accounted for 5% of TU staff by 2030 is very significant. This would also increase postgraduate research student numbers and EU Horizon research funding, which could reach €80 million per year. The overall economic impact nationally would be in the region of €2.8 billion. Getting to 5% of TU staff by 2030 would be welcome.  Another important focus of the OECD report is on the comparison of various strands of benchmarked institutions with TU Dublin. The findings show greater levels of research activity and available financial resources at TU Dublin and Ireland's other TUs. A medium-term aspiration from the emerging TU sector is there when a much higher one could be available. The timelines are being closely monitored. I welcome the update the Minister has given us today on this. \n Deputy James Lawless  They are being closely monitored, not least by me. I keep a programme for Government tracker to make sure we make our targets and, as far as possible, get ahead of target in delivering all the items I signed up to deliver at the start of this year. The OECD report is extremely useful in setting out academic career structures, contracts, senior management and leadership structures and the benefits they bring to an organisation, which are well documented and on which we are all in agreement.  In terms of the wider development of the technological universities, there have been a number of funding commitments and programmes rolled out in the past year. For example, €90 million over three years has been recently committed to in the transformation fund. The technological university advancement fund has a €50 million envelope over two years. The TU research and innovation supporting enterprise, TU RISE, research programme within the technological universities amounts to €83.68 million. The national technological university transformation for recovery and resilience, N-TUTORR, project has €40 million and there is the targeted enhancement fund, which allows things like project management systems, integrated accounting systems and student record systems to be better integrated across the TUs. They have taken a number of legacy campuses and pulled them together. Part of the funding is to bring them together in an holistic fashion. ",
        "questionType": "oral",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 202. Deputy Donna McGettigan asked the Minister for Further and Higher Education, Research, Innovation and Science the reason there are no professors at technological universities (TUs); if his Department will review this; if not, the reasons not to include professors under the remit of TUs; and if he will make a statement on the matter. [67913/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/dbsect_40",
          "debateSectionId": "dbsect_40",
          "showAs": "Technological Universities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/mul@/dbsect_40.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_202",
        "questionNumber": 202
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  Delivering Homes, Building Communities, published 13 November 2025, commits to ensuring that the increased supply of social homes includes homes that reflect universal design principles, fostering inclusivity.  My Department jointly published the National Housing Strategy for Disabled People (NHSDP) 2022-2027 and Implementation Plan with the Department of Health and the Department of Children, Disability, and Equality. The Strategy and Implementation Plan may be accessed on my Department’s website at the following link: www.gov.ie/en/publication/60d76-national-housing-strategy-for-disabled-people-2022-2027/. The Implementation Plan sets out the actions to achieve the vision of the joint Strategy for delivering housing and related supports for disabled people to 2027 operating under the new housing plan Delivering Homes, Building Communities.  Separately, my Department published a Design Manual for Quality Housing which is available on my Department’s website at the following link: [ www.gov.ie/en/publication/b3e02-design-manual-for-quality-housing/ ]. The Manual is intended to guide local authorities and Approved Housing Bodies, and their consultants, on the design of social housing including the internal layouts of individual social homes. The manual includes guidance on the approach to ‘Housing for People with Disability’ (Section 5.3.2) and specific design approaches developed with the input of the Centre for Excellence in Universal Design. My Department is working with all local authorities and Approved Housing Bodies to utilise this Design Manual for all new build social housing projects.  Local authorities play a key role in the planning and provision of social housing in their areas, and decide on the number and types of dwellings to provide, based on identified need.  The National Disability Authority is undertaking an economic and social evaluation of the Universal Design housing model. My Department will consider this analysis when published.  In parallel, the coordination and delivery of the disability services supports is a matter for my colleague, the Minister for Children, Disability and Equality and the Health Service Executive. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 429. Deputy Donna McGettigan asked the Minister for Housing, Local Government and Heritage the status of plans on universal design for independent living purposes, considering that around 1,300 disabled people live in nursing homes; if he will give assurances that the State support for disabled people can and will ensure independent living; and if he will make a statement on the matter. [70983/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_422",
          "debateSectionId": "dbsect_422",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_422.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_429",
        "questionNumber": 429
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 527. Deputy Donna McGettigan asked the Minister for Children, Disability and Equality if her Department will consider an additional emergency winter payment for disabled people, many of whom are struggling to keep up with costs to warm their homes; and if she will make a statement on the matter. [70982/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_497",
          "debateSectionId": "dbsect_497",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_497.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_527",
        "questionNumber": 527
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  I propose to take Questions Nos. 405 and 406 together.  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for students with special educational needs.  407 new special classes were sanctioned by the NCSE for the 2025/26 school year. Of these 7 are in County Clare, 3 at primary and 4 at post-primary level. This brings to 83 the number of special classes currently in operation in the county. There are also 2 special schools in County Clare with approximately 250 students enrolled.  The NCSE advise that a small number of specialist vacancies still exist within County Clare for this school year. Any family seeking a placement is urged to contact the NCSE via the contact details available on the NCSE's website: https://ncse.ie/seno-contact-information Local special educational needs organisers (SENOs) remain available to provide the location of these vacancies and advice as to the supports available to students with special educational needs.  As demand for new special classes at post-primary level is expected to increase significantly over the next few years, due to increasing demographics and increasing prevalence rates, my department and the NCSE have engaged with post-primary stakeholders in relation to the provision of special classes.  In October 2022, my department wrote to all post-primary schools requesting that each school begin planning to provide for up to four special classes to meet the needs of students progressing from primary school. Last year my department issued a circular to all schools setting out new measures to support the forward planning of special education provision. Included in this circular was a reminder of the need for post-primary schools to continue planning for this level of provision.  In order to support the NCSE and forward planning my department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE through the Parent Notify process that they are seeking a special educational placement for their child. This year to facilitate earlier sanctioning of classes for the 2026/27 school year an earlier date of 1 October was set for parents to complete this process.  The NCSE is undertaking analysis of information provided through the Parents Notify process to plot demand for special class places for the 2026/27 school year. The NCSE will also consider vacant places in existing special classes and places that will become available through the regular transition of children from primary for post-primary schools. Once this analysis is completed the NCSE will be equipped to engage with schools to open new special classes in relevant areas. It is the aim of the NCSE to sanction the majority of new special classes by 31 December 2025.  I would like to stress that the NCSE will continue to support all children made known to them after the October deadline. However, it is critical that the NCSE has as much local information as possible as early as possible to effectively plan new provision. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 405. Deputy Donna McGettigan asked the Minister for Education and Youth the number of children in the Shannon area who need a place in an autism class in secondary school for September 2026; the number of school places available to them in the Shannon area; her plans to increase the number of places to provide for all children requiring them; and if she will make a statement on the matter. [69434/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_363",
          "debateSectionId": "dbsect_363",
          "showAs": "School Admissions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_363.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_405",
        "questionNumber": 405
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  I propose to take Questions Nos. 405 and 406 together.  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for students with special educational needs.  407 new special classes were sanctioned by the NCSE for the 2025/26 school year. Of these 7 are in County Clare, 3 at primary and 4 at post-primary level. This brings to 83 the number of special classes currently in operation in the county. There are also 2 special schools in County Clare with approximately 250 students enrolled.  The NCSE advise that a small number of specialist vacancies still exist within County Clare for this school year. Any family seeking a placement is urged to contact the NCSE via the contact details available on the NCSE's website: https://ncse.ie/seno-contact-information Local special educational needs organisers (SENOs) remain available to provide the location of these vacancies and advice as to the supports available to students with special educational needs.  As demand for new special classes at post-primary level is expected to increase significantly over the next few years, due to increasing demographics and increasing prevalence rates, my department and the NCSE have engaged with post-primary stakeholders in relation to the provision of special classes.  In October 2022, my department wrote to all post-primary schools requesting that each school begin planning to provide for up to four special classes to meet the needs of students progressing from primary school. Last year my department issued a circular to all schools setting out new measures to support the forward planning of special education provision. Included in this circular was a reminder of the need for post-primary schools to continue planning for this level of provision.  In order to support the NCSE and forward planning my department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE through the Parent Notify process that they are seeking a special educational placement for their child. This year to facilitate earlier sanctioning of classes for the 2026/27 school year an earlier date of 1 October was set for parents to complete this process.  The NCSE is undertaking analysis of information provided through the Parents Notify process to plot demand for special class places for the 2026/27 school year. The NCSE will also consider vacant places in existing special classes and places that will become available through the regular transition of children from primary for post-primary schools. Once this analysis is completed the NCSE will be equipped to engage with schools to open new special classes in relevant areas. It is the aim of the NCSE to sanction the majority of new special classes by 31 December 2025.  I would like to stress that the NCSE will continue to support all children made known to them after the October deadline. However, it is critical that the NCSE has as much local information as possible as early as possible to effectively plan new provision. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 406. Deputy Donna McGettigan asked the Minister for Education and Youth the number of children in each county who need a place in an autism class in secondary school for September 2026; the number of school places available to them in each county; her plans to increase the number of places to provide for all children requiring them, in tabular form; and if she will make a statement on the matter. [69435/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_363",
          "debateSectionId": "dbsect_363",
          "showAs": "School Admissions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_363.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_406",
        "questionNumber": 406
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 420 and 421 together.  It is the objective of my Department, that all students will have the same accessibility to all information on all pathways. It is also the objective of my Department that Junior Cycle students will begin to receive age- and stage-appropriate information on pathways, and that this information will not be limited to senior cycle students. This objective is embedded in a wide range of work being undertaken within my Department including but not limited to the following:   National Strategic Framework for Lifelong Guidance   A National Policy Group for Lifelong Guidance was convened in 2022 and is chaired by my department. This National Policy Group published a strategic framework and action plan for lifelong guidance in Ireland in December 2023. A number of actions within these publications relate to the matter of career information, inclusion and parity of esteem for all pathways. For example, action 6.2 commits all NPG Departments, including my own, to “Promote the uptake of diverse pathways to education, training and the world of work.” With this framework and action at the fore of policy development in this area, the active promotion of apprenticeships and other pathways are a major theme in all activities undertaken by department.   Whole School Guidance   In order to meet the guidance-needs of students in our post-primary system, a model of whole-school guidance (WSG) has been formally developed and promoted through Teacher Professional Learning over the past decade. This model is advantageous for students (and their parents) as students’ educational and career development is supported by all staff members including but not limited to the guidance counsellor. In relation to accessibility of information on apprenticeships specifically, students can learn from all staff members. For example, a Transition Year (TY) Coordinator may discuss apprenticeship-options when a student is considering TY-work experience, a maths teacher may discuss apprenticeships when teaching trigonometry and a Year Head may organise a group-trip to a careers fair where apprenticeships are well represented. Each school has its own student-centred ‘Whole School Guidance Plan’ within which activities like this are described. As the guidance needs of each school community will vary, WSG programmes will vary from school to school. A WSG-plan will contain a WSG-programme which includes engagement with employers, experiential learning opportunities, and a focus on career-management skills which can further support informed choices and broaden students’ understanding of the diverse pathways open to them. This is a fundamental part of each WSG-plan.  Many WSG-plans are available to view via a school’s website.   Forthcoming Guidance Policy:   During 2025, my department has concluded a National Consultation on Post-Primary Guidance which will inform a number of policy actions in relation to Guidance. Draft guidelines for whole school guidance were published during this consultation. The draft guidelines contain a clear and detailed programme for guidance with learning objectives for all students, nationally to ensure consistency and standards within WSG-provision nationally. Early-intervention and access to information is highlighted within these guidelines and learning outcomes are identified for both junior- and senior cycle students. ‘Pathways’ is a clear theme within these guidelines and learning objectives focus on multiple pathways including apprenticeships. The final guidelines, which will incorporate points made by stakeholders within the national consultation, will be published in due course. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 420. Deputy Donna McGettigan asked the Minister for Education and Youth her plans to ensure there is better information about apprenticeships by guidance counsellors for senior cycle students; and if she will make a statement on the matter. [69803/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_374",
          "debateSectionId": "dbsect_374",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_374.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_420",
        "questionNumber": 420
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 420 and 421 together.  It is the objective of my Department, that all students will have the same accessibility to all information on all pathways. It is also the objective of my Department that Junior Cycle students will begin to receive age- and stage-appropriate information on pathways, and that this information will not be limited to senior cycle students. This objective is embedded in a wide range of work being undertaken within my Department including but not limited to the following:   National Strategic Framework for Lifelong Guidance   A National Policy Group for Lifelong Guidance was convened in 2022 and is chaired by my department. This National Policy Group published a strategic framework and action plan for lifelong guidance in Ireland in December 2023. A number of actions within these publications relate to the matter of career information, inclusion and parity of esteem for all pathways. For example, action 6.2 commits all NPG Departments, including my own, to “Promote the uptake of diverse pathways to education, training and the world of work.” With this framework and action at the fore of policy development in this area, the active promotion of apprenticeships and other pathways are a major theme in all activities undertaken by department.   Whole School Guidance   In order to meet the guidance-needs of students in our post-primary system, a model of whole-school guidance (WSG) has been formally developed and promoted through Teacher Professional Learning over the past decade. This model is advantageous for students (and their parents) as students’ educational and career development is supported by all staff members including but not limited to the guidance counsellor. In relation to accessibility of information on apprenticeships specifically, students can learn from all staff members. For example, a Transition Year (TY) Coordinator may discuss apprenticeship-options when a student is considering TY-work experience, a maths teacher may discuss apprenticeships when teaching trigonometry and a Year Head may organise a group-trip to a careers fair where apprenticeships are well represented. Each school has its own student-centred ‘Whole School Guidance Plan’ within which activities like this are described. As the guidance needs of each school community will vary, WSG programmes will vary from school to school. A WSG-plan will contain a WSG-programme which includes engagement with employers, experiential learning opportunities, and a focus on career-management skills which can further support informed choices and broaden students’ understanding of the diverse pathways open to them. This is a fundamental part of each WSG-plan.  Many WSG-plans are available to view via a school’s website.   Forthcoming Guidance Policy:   During 2025, my department has concluded a National Consultation on Post-Primary Guidance which will inform a number of policy actions in relation to Guidance. Draft guidelines for whole school guidance were published during this consultation. The draft guidelines contain a clear and detailed programme for guidance with learning objectives for all students, nationally to ensure consistency and standards within WSG-provision nationally. Early-intervention and access to information is highlighted within these guidelines and learning outcomes are identified for both junior- and senior cycle students. ‘Pathways’ is a clear theme within these guidelines and learning objectives focus on multiple pathways including apprenticeships. The final guidelines, which will incorporate points made by stakeholders within the national consultation, will be published in due course. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 421. Deputy Donna McGettigan asked the Minister for Education and Youth her plans to ensure that senior cycle students have the same accessibility to information on apprentices as senior cycle students pursuing CAO options; and if she will make a statement on the matter. [69804/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_374",
          "debateSectionId": "dbsect_374",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_374.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_421",
        "questionNumber": 421
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  In March 2022, an ambitious programme of Senior Cycle Redevelopment was announced to deliver “equity and excellence for all” and to empower students to meet the challenges of the 21st century with a focus on the development of key competencies.  Senior Cycle Redevelopment aims to develop a more integrated Senior Cycle where every student is supported in accessing and exploring different academic, learning and potential career pathways. By striving for this more integrated experience, Senior Cycle Redevelopment will ensure that all learning pathways in school are accessible and equally valued.  As part of the redevelopment of Senior Cycle programme, a new Transition Year Programme Statement (https://curriculumonline.ie/getmedia/5849acbf-0326-487a-beec-3db6b5878470/TY-Programme-Statement-ENG-INT.pdf), was published in September 2024, which provides schools with a framework for developing their own bespoke Transition Year programmes. The Programme Statement guides schools in developing innovative programmes that facilitate students to explore diverse future pathways, gain first-hand workplace experience, and develop career-related competencies so they can identify the links between education and career opportunities. This is inclusive of apprenticeships.  The Programme Statement sets out four Student Dimensions as the core foundations upon which Transition Year programmes should be designed including one centred on career development.  In the Career Development dimension, students explore diverse future pathways in a guided and coordinated manner, gaining first-hand workplace experience, and developing career-related competencies. This includes awareness and encouragement into many career avenues, inclusive of apprenticeships. Students are encouraged to identify and review career-related goals more regularly by developing greater capacity to research and critically reflect upon career pathways.  Schools can also offer students specific micro modules during Transition Year. A micro-module is typically designed to provide a concentrated learning experience, within the parameters of the Transition Year Programme Statement, to enhance the educational experience of students. They can be designed and delivered as standalone components or designed to be integrated with other TY components. These could apply to apprenticeship aspects.  In January 2025, the NCCA, in collaboration with ETBI and SOLAS published the initial vocational education and training (iVET) module. This is a flexible module that gives students the opportunity to engage in interactive programmes and off-site learning through collaboration with industry and Further Education and Training (FET) providers during their Transition Year.  Alongside these developments, a model of Whole School Guidance (WSG) is provided in schools. WSG means that all school personnel (including but not limited to the guidance counsellors) have an important role and responsibility to support students with their personal, social, educational and career choices. Guidance encompasses the three separate, but interlinked areas of personal and social development, educational development and career development.  Through whole school guidance, students are provided with a range of learning experiences provided in developmental sequence by all school staff. On a very regular basis, and beginning in Junior Cycle, students are supported to develop self-management and career-development skills which will lead to effective choices and decisions about their lives. In December 2023, the then Minister for Education and then Minister for Further and Higher Education, Research, Innovation and Science published the National Strategic Framework for Lifelong Guidance in Ireland (2024-2030) and accompanying Strategic Action Plan (2024-2030) marking a significant milestone for systems of guidance in Ireland.  My Department and I will continue to engage with all our education partners to ensure we deliver a redeveloped Senior Cycle that will significantly enrich the student experience, address academic and vocational pathways, and maintain the high-quality education system Ireland is well-known for. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 422. Deputy Donna McGettigan asked the Minister for Education and Youth her plans to ensure that transition year students have a more focused approach to ensure that apprenticeship type placements are encouraged more; and if she will make a statement on the matter. [69805/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_376",
          "debateSectionId": "dbsect_376",
          "showAs": "Apprenticeship Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_376.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_422",
        "questionNumber": 422
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  The State Claims Agency (SCA) has a statutory remit to manage personal injury and third-party property damage claims on behalf of State authorities including the Health Service Executive (HSE). The SCA has provided me with the information set out below.  The information contained within this response was extracted from the National Incident Management System (NIMS) as per the below criteria.  The following table contains the number of clinical claims for the six HSE Regions, created during the period 01/01/2020–30/11/2025, where the body part injured has been categorised as Ear, Nose, and Oral Cavity (including teeth, lips, and throat) on NIMS.  Due to the low volume of claims per year, and for confidentiality reasons, the figures are presented in an aggregated format.     Location at Level 2    Claims Created 2020-2025 (year to date)      HSE Dublin and Midlands Region    24      HSE Dublin and North East Region    20      HSE Dublin and South East Region    26      HSE Mid West Region    13      HSE South West Region    9      HSE West and North West Region    41      Grand Total    133      ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 825. Deputy Donna McGettigan asked the Minister for Health the number of clinical indemnity claims for ear nose and throat in each HSE region, in tabular form, for each year from 2020, to date in 2025; if there is an excessively high number in the HSE Mid-West Hospital Region comparative to other regions; if this is a cause of concern, and the actions undertaken, or planned, to resolve this; and if she will make a statement on the matter. [69002/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_674",
          "debateSectionId": "dbsect_674",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_674.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_825",
        "questionNumber": 825
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 826. Deputy Donna McGettigan asked the Minister for Health if a root cause analysis been undertaken into serious ENT incidents in the Health Service; and if she will make a statement on the matter. [69003/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_675",
          "debateSectionId": "dbsect_675",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_675.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_826",
        "questionNumber": 826
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 827. Deputy Donna McGettigan asked the Minister for Health if the HSE has completed a systematic serious adverse incident investigation process, as required, into any ENT incident in the past 10 years; and if she will make a statement on the matter. [69004/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_676",
          "debateSectionId": "dbsect_676",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_676.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_827",
        "questionNumber": 827
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 828. Deputy Donna McGettigan asked the Minister for Health the lessons that have been documented and shared from adverse ENT incidents nationally; and if she will make a statement on the matter. [69005/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_678",
          "debateSectionId": "dbsect_678",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_678.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_828",
        "questionNumber": 828
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1001. Deputy Donna McGettigan asked the Minister for Health if she will ensure that the care pathway for patients experiencing miscarriage is removed from the maternity unit in UHL and relocated, to ensure those suffering after a miscarriage are not mixing with expectant mothers, which inevitably adds to their trauma and suffering; and if she will make a statement on the matter. [69674/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_830",
          "debateSectionId": "dbsect_830",
          "showAs": "Hospital Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_830.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1001",
        "questionNumber": 1001
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  The Programme for Government sets an ambitious target of 12,500 annual apprentice registrations by 2030, with two-thirds in craft and construction. This reflects the vital role apprenticeships play in infrastructure delivery and economic growth. A diverse range of apprenticeship training is offered across Dublin city and county.  Significant investment underpins this commitment. Budget 2026 allocated €79 million to apprenticeship delivery nationally, and in addition, my Department recently announced a further €20.5 million capital investment to expand training capacity in higher education institutions nationally including Atlantic Technological University, Munster Technological University, Technological University of the Shannon, and Dundalk Institute of Technology.  Alongside this investment, my Department's Careers in Construction Action Plan, launched in August 2023, aims to make construction careers more accessible and attractive, supported by promotional initiatives such as WorldSkills Ireland.  These efforts are delivering results. Annual craft apprenticeship registrations have risen 63% from 4,377 in 2020, the year in which my department was formed, to 7,113 in 2024. In the same period Consortia-led registrations have grown from 949 to 2,239.  In addition, this investment has also supported a 34% growth in the number of apprenticeship programmes available from 58 to 78.  Currently, apprenticeship off-the-job training is offered through 16 Educational Training Boards and a further 10 Higher Educational Institutions via 96 training centres across the country as per the table attached. Of these, 74 are based outside of Dublin county.   Training locations and programmes offered  ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1093. Deputy Donna McGettigan asked the Minister for Further and Higher Education, Research, Innovation and Science his plans to improve the availability of apprenticeships outside Dublin and other larger towns and cities; and if he will make a statement on the matter. [69798/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_913",
          "debateSectionId": "dbsect_913",
          "showAs": "Apprenticeship Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_913.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1093",
        "questionNumber": 1093
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science (Deputy James Lawless)  On 2nd December, I secured cabinet support and subsequently announced a targeted investment of €65.8m for the technological sector and publicly funded specialist colleges under the  Targeted Enhancement Fund (TEF). The fund is managed by the Higher Education Authority (HEA) on behalf of my department.  The investment will be used by higher education institutions to advance digital transformation and business intelligence, support student success and engagement, increase professional development opportunities for staff, and support the attainment of Climate Action targets including monitoring of and reporting on Climate Action Roadmaps.  Additionally, the fund will be utilised to support collaborative activities including the development of solutions to enhance academic integrity, enhance TU data infrastructure and business intelligence and prepare for further developments in AI.  I was also very pleased to announce that this fund is the mechanism through which Technological Universities will gain the capacity to appoint Professorial grades. This is a critical step in their alignment with the 'traditional' university sectors and to support the enhanced research and innovation mission of TU's, enabling competitiveness regionally, nationally and internationally. My officials and I are working closely with colleagues across government to finalise the process for approvals for professors in the sector. I am confident that this will be completed in the coming weeks and will then be in a position to provide further details.  Allocated TEF for relevant HEIs as per the table below:         TEF Proposed Allocations      Institution    Proposed Allocation      ATU    €10,500,000.00      DkIT    €4,200,000.00      IADT    €5,000,000.00      MTU    €6,300,000.00      SETU    €12,000,000.00      TU Dublin    €10,000,000.00      TUS    €6,300,000.00      MIC    €1,500,000.00      NCAD    €4,500,000.00      CP:1 Enhancing Data Infrastructure    €4,500,000.00      CP2: Academic Integrity Project    €1,000,000.00          €65,800,000.00        ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1094. Deputy Donna McGettigan asked the Minister for Further and Higher Education, Research, Innovation and Science following his announcement that professorships roles will be part of TU, the number professorships available, by each TU; the percentage of professorships that will be available across all TUs, in tabular form; and if he will make a statement on the matter. [69799/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_914",
          "debateSectionId": "dbsect_914",
          "showAs": "Third Level Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_914.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1094",
        "questionNumber": 1094
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  I understand that finding suitable accommodation for study can be a challenge, particularly when training locations are not close to home. My Department has requested that SOLAS review the process for allocation of apprentice placements for any improvements.  Currently, the following supports are available for apprentices:  Structured Mentorship and Support: • Each apprentice has a dedicated Training Advisor, assigned by the Educational Training Board (ETB) that the apprentice has been registered to by their employer. The apprentice can discuss any concerns related to any aspect of their training for the duration of their programme. All registered apprenticeship programmes are required to provide workplace mentors who act as a point of contact for guidance and wellbeing. Workplace mentors for apprentices are experienced employees who guide, support, and train apprentices on-the-job, acting as role models to develop their technical skills, professional competencies, and confidence, ensuring they integrate workplace learning with academic study and meet industry standards for a successful career transition. They provide regular feedback, manage training needs, facilitate problem-solving, and help apprentices navigate company culture and career paths.  Peer Networks and Online Communities: • Through the national apprenticeship portal and sectoral bodies, apprentices have access to virtual peer-support groups and discussion forums. These platforms allow apprentices to connect, share experiences, and seek advice regardless of location.  Access to Wellbeing Services: • Guidance services are provided by ETBs and HEIs, these are available to apprentices during their off-the-job training phases.  Travel and Accommodation Supports: • For apprentices who must relocate, financial supports include allowances for travel and accommodation in certain circumstances.  The National Helpline: • apprentices can contact the national helpline should they need guidance or assistance. There is also a Freephone number available for advice and support: 1800 794 487.  Additionally, SOLAS's \"R U OK\" mental health campaign  signposts apprentices to mental health services should they need to access them. The initiative encourages conversations about mental health within the Generation Apprenticeship community, in the workplace, in education and training facilities, and anywhere there are apprentices. A series of videos have been released on the national apprenticeship social media platforms and support materials are available on apprenticeship.ie. The videos feature apprentices, graduates and employers speaking about the importance of talking about mental health and of supporting each other during times of challenge. Several employers have taken the step of adding the R U OK? tagline to their work t-shirts and sweaters and ESB Networks has added it to the lanyards worn by their employees. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1095. Deputy Donna McGettigan asked the Minister for Further and Higher Education, Research, Innovation and Science his plans to address the issue of isolation for apprentices who are in placements away from their support systems; and if he will make a statement on the matter. [69800/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_915",
          "debateSectionId": "dbsect_915",
          "showAs": "Apprenticeship Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_915.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1095",
        "questionNumber": 1095
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  Apprentices are employees from the beginning and as such they must first find an employer who is willing to take them on and register them as an apprentice. In this regard it is a different process from applying for a college course.  I recognise however that this can be a daunting process and more can be done to make this journey straightforward for the prospective apprentice.  In November 2022, information on apprenticeship options was added to the CAO application system. Links provided on the CAO website allow learners to view a number of full-time higher education, further education and training, and apprenticeship options that are available to post-second level applicants.  Further initiatives include:  • Pre-apprenticeship courses, level 5 PLCs aimed at preparing students to undertake an apprenticeship.  • iVET (Initial Vocational Education and Training) modules, optional Transition Year modules developed collaboratively by the NCCA, ETBI, and SOLAS which offer apprenticeship taster courses.  • A database of apprentice employers is available on the apprenticeship.ie website and is updated monthly.  • The National Apprenticeship Office has also held a workshops at the Institute for Guidance Councillors annual conference to promote apprenticeship as a pathway for learners.  In the context of the next Action Plan for Apprenticeship, my Department and its agencies will be looking at how better to link prospective apprentices with employers. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1096. Deputy Donna McGettigan asked the Minister for Further and Higher Education, Research, Innovation and Science his plans to improve the application process for apprenticeships similar to the CAO model; and if he will make a statement on the matter. [69801/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_916",
          "debateSectionId": "dbsect_916",
          "showAs": "Apprenticeship Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_916.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1096",
        "questionNumber": 1096
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  Staff in the National Apprenticeship Office are employed by SOLAS, the State agency with responsibility for further education and training. The Department sets the overall staffing numbers for SOLAS. It is then the responsibility of SOLAS to manage and allocate these resources effectively.  The approved staffing numbers for SOLAS in 2026 is 276 Full Time Equivalent (FTE), an increase from 261 FTE in 2025. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1097. Deputy Donna McGettigan asked the Minister for Further and Higher Education, Research, Innovation and Science his plans to address reports that the national apprenticeship office is understaffed; and if he will make a statement on the matter. [69802/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_917",
          "debateSectionId": "dbsect_917",
          "showAs": "Apprenticeship Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_917.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1097",
        "questionNumber": 1097
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  The Government is committed to maximising the number of people who start and finish apprenticeships.  In the recently published National Survey of Apprentices, 87% of apprentices reported that they are enjoying their apprenticeship experience and 84% have developed confidence in their ability to learn; 85% are glad they chose the apprenticeship route and feel part of their organisation, and 94% of apprentices believe their apprenticeship will provide good employment opportunities.  This positive experience is reflected in the relatively low non-progression rates. SOLAS data shows that approximately 90% of first year apprentices progress to their second year, figures that compare positively to other tertiary education options.  SOLAS does not collate information on progression by year by Phase of training. This is because apprenticeship programmes are on a continuous intake basis, and multiple phases can be completed in each year. Given this, the requested information cannot be provided. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1098. Deputy Donna McGettigan asked the Minister for Further and Higher Education, Research, Innovation and Science the total number of people who have dropped out of apprenticeships in the past five years, broken down by the phase in which they have dropped out, in tabular form; and if he will make a statement on the matter. [69952/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_918",
          "debateSectionId": "dbsect_918",
          "showAs": "Apprenticeship Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_918.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1098",
        "questionNumber": 1098
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  The Government is committed to growing apprenticeship opportunities for learners, recognising the important role they play in equipping Ireland’s workforce with the skills needed to meet national priorities, including infrastructure delivery.  In Budget 2026, my Department secured an additional €79 million investment in apprenticeship delivery - the largest since the formation of this Department. This investment will directly support the expansion of the craft apprenticeship system and support key trades such as plumbing and electrical, which are essential to delivering the National Development Plan.  All apprenticeships are national programmes. Since 2020, the apprenticeship offering has increased from 58 to 78 programmes, spanning sectors such as construction, engineering, electrical, ICT, finance, hospitality, amongst others.  Currently, there are 96 locations that offer apprenticeship training. This is provided across 16 Educational Training Boards and 10 Higher Education Institutions throughout the country. The locations of these training centres and the number of programmes offered are set out in the attached table.   Training locations and programmes offered  ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1099. Deputy Donna McGettigan asked the Minister for Further and Higher Education, Research, Innovation and Science the total number of training centres for apprenticeships across the country, broken down by their name, location and the number of apprenticeships offered, in tabular form; and if he will make a statement on the matter. [69953/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_919",
          "debateSectionId": "dbsect_919",
          "showAs": "Apprenticeship Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_919.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1099",
        "questionNumber": 1099
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  A key goal set out in the Apprenticeship Action Plan 2021-2025 is for apprenticeship to be recognised and valued by employers in many sectors of Ireland’s economy as a key route to recruiting a highly skilled workforce. At present, there is a total of 78 national apprenticeship programmes, 25 of which are craft Apprenticeships and 53 are consortia-Led programmes.  Investment in the apprenticeship system has been significant since my department was formed in 2020. €79 million has been invested in the apprenticeship system in Budget 2026, bringing the total current budget for apprenticeship to €411 million. This represents a significant increase of 123% in apprenticeship funding since 2020.  Annual apprenticeship registrations have grown strongly in recent years from 6,177 in 2019 to 9,352 in 2024. This includes a 41% increase in construction-related registrations since 2019 is helping to meet critical infrastructure workforce needs.  My department has also made good progress on implementing the Public Service Apprenticeship Plan, including the launch of the milestone social work and civil service digital marketing apprenticeships.  Work is continuing to improve the gender balance of apprenticeships, and to support underrepresented groups to access apprenticeships such as those from socioeconomically disadvantaged backgrounds and the Travelling community.  The Action Plan for Apprenticeship 2026–2030 will be launched in the first half of next year, delivering on a key commitment in the Programme for Government. A public consultation on the new Plan is expected to commence shortly. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1100. Deputy Donna McGettigan asked the Minister for Further and Higher Education, Research, Innovation and Science the progress made on the Action Plan for Apprenticeship 2021 to 2025; when a new plan will be published; and if he will make a statement on the matter. [69954/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_920",
          "debateSectionId": "dbsect_920",
          "showAs": "Apprenticeship Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_920.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1100",
        "questionNumber": 1100
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  At the end of November, the total apprenticeship population was 31,169. Of this, 25,852 were craft apprentices.This highlights the substantial growth of apprenticeship since 2020, when the overall population was 19,630, of which 17,183 were craft apprentices.  This government remains committed to the growth and development of the apprenticeship system. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1101. Deputy Donna McGettigan asked the Minister for Further and Higher Education, Research, Innovation and Science the total number of apprentices in the State; and the total number of craft apprentices; and if he will make a statement on the matter. [69955/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_921",
          "debateSectionId": "dbsect_921",
          "showAs": "Apprenticeship Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_921.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1101",
        "questionNumber": 1101
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I propose to take Questions Nos. 100 and 116 together.  Under EU Regulation 1008/2008 on common rules for the operation of air services in the Community, airlines have full pricing freedom in relation to setting air fares for intra-Community air services and other related services such as baggage.  The Regulation requires that air fares be transparent i.e. that passengers booking a flight must be aware of the final price of a flight including any supplemental elements selected by the passenger, at all times during the booking process.  Within this framework airlines regularly take into account various operational realities in setting these fares and charges over time, for example flights at peak times or with short advance bookings may attract higher prices, which is an industry norm. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 100. Deputy Donna McGettigan asked the Minister for Transport if he will investigate allegations of price gouging on airline tickets to the soccer world cup play offs, with flight prices to Prague increased by more than 3.5 times their original cost; the measures he will take to prevent such gouging; and if he will make a statement on the matter. [67559/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_91",
          "debateSectionId": "dbsect_91",
          "showAs": "Aviation Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_91.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_100",
        "questionNumber": 100
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, it has been referred to the Health Service Executive for attention and direct reply to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 529. Deputy Donna McGettigan asked the Minister for Health the action she will take to ensure a person (details supplied) receives the diagnostic testing they need promptly; and if she will make a statement on the matter. [67352/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_471",
          "debateSectionId": "dbsect_471",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_471.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_529",
        "questionNumber": 529
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "showAs": " 790. Deputy Donna McGettigan asked the Minister for Health to recognise student nurses as essential workers during placement; provide fair financial support or pay for the hours worked to ensure that no student is forced into unsafe levels of combined work simply to survive; and if she will make a statement on the matter. [65231/25] ",
        "debateSection": {
          "showAs": "Departmental Staff",
          "debateSectionId": "dbsect_704",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_704",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_704.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Donna McGettigan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "memberCode": "Donna-McGettigan.D.2024-11-29"
        },
        "questionNumber": 790,
        "answerText": " Minister for Health  A key Government priority is to protect and support the education of all students, including student nurses and midwives.  During years 1-3 of Undergraduate Nursing and Midwifery BSc Education Programmes, undergraduate student nurses and midwives complete clinical practice placements as supernumerary students.  Supernumerary practice placement is the optimum clinical learning environment, providing student nurses supervised placement periods of varying lengths during each year of their training. This ensures that students can safely learn, observe and participate in the wide variety of clinical skills required for qualification. These students are not employees and are additional to the workforce in a learning capacity and are therefore not paid.  The final year internship placement for student nurses and midwives consists of a continual 36-week rostered clinical placement. The internship placement is a paid placement and individual student nurses and midwives are considered as 0.5 WTE of the workforce. They are the only healthcare students who are paid a salary. This is in recognition of the fact that they work under reduced supervision which remains in place to support final learning weeks.  Clinical placement supports were examined in 2021 with a number of additional supports now in place to enhance the travel and subsistence available to student nurses during their supernumerary placements. Additional supports are also provided for students beginning their internships including the provision of additional uniforms and a uniform laundry allowance where required ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_790",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_170",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_170",
          "showAs": "Health Screening Programmes",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_170.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 151. Deputy Donna McGettigan asked the Minister for Health the resources that will be made available for the scanning of women with dense breasts, in whom cancer may not be detectable by mammogram; the protocols which would automatically refer such women for follow-up testing after a mammogram; and if she will make a statement on the matter. [64319/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_151",
        "answerText": " Minister for Health  I am committed to supporting our population screening programmes, which are a valuable part of our health service, enabling early treatment and care for many people, and improving the overall health of our population.  BreastCheck, the National Breast Screening Programme, currently invites women aged 50 to 69 years at regular intervals to have a mammogram. The Programme for Government commits to extend the ages for BreastCheck screening programme in line with updated standards from the Health Information and Quality Authority (HIQA).  I would note that proposed changes to Ireland’s screening programmes will be facilitated through established evidence-driven protocols. The National Screening Advisory Committee (NSAC) is the independent expert group that considers proposed changes by assessing the evidence in a robust and transparent manner, and against internationally accepted criteria, before making recommendations to myself as Minister for Health.  The rigorous processes utilised by NSAC are critical to ensure that our screening programmes are effective. This is particularly important when expert opinion is divided, and uncertainty remains about whether the potential benefits outweigh the possible harms.  With regards to breast density specifically, while some countries have introduced this into their screening programmes, there are significant differences in international clinical opinion on the effective incorporation of standardised notification into breast cancer screening. The recently updated ‘European Commission Initiative on Breast Cancer: European guidelines on breast cancer screening and diagnosis’, highlight the low certainty of evidence surrounding the incorporation of breast density measurement into population health screening programmes. This contrasts with the recommendation of the European Society for Breast Imaging (EUSOBI), which recommends that women with extremely dense breast tissue are offered screening with breast MRI.  This lack of consensus explains the need for a cautious, evidence-led approach to ensure that any decision serves the best interests of the population and maintains the integrity of the screening programme.  In this regard, I am pleased to report that HIQA have commenced their evidence review on proposed changes to the BreastCheck programme. This review will comprise of two elements; a proposed expansion of the age range eligibility to those aged 45-49 and 70-74, and the potential introduction of a standardised breast density measurement. Both elements are anticipated to be complex and will take time to ensure that any recommendations made to me by NSAC are underpinned by a robust evidence-base.  HTAs facilitate the assessment of relevant evidence and knowledge on the effects and consequences of healthcare technologies to guide decisions regarding the appropriate use of technology and efficient allocation of resources. They involve a multi-disciplinary assessment of the clinical, economic, ethical, legal and societal perspectives that may be impacted by the introduction of a new technology. They are time-intensive and rigorous processes.  Significant investment continues to be made in our national screening programmes. This includes allocating an additional €2.9 million in full-year costs to BreastCheck for 2025. This funding will help to future-proof the programme, allowing for increased capacity and enabling service developments to meet women's evolving needs and ensure equitable access across the entire population.  Finally, I would emphasise that population-based screening programmes are for people without symptoms. If anyone becomes aware of symptoms, or if they have concerns or worries, they should contact a medical professional immediately ",
        "questionNumber": 151,
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_215",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_215",
          "showAs": "Hospital Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_215.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 196. Deputy Donna McGettigan asked the Minister for Health if she will report on the three options outlined by HIQA into urgent and emergency healthcare services in the HSE Midwest region; her plans for their prompt implementation; and if she will make a statement on the matter. [64224/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_196",
        "answerText": " Minister for Health  I propose to take Questions Nos. 196 and 204 together.  HIQA published their independent and expert review of urgent and emergency healthcare services in the HSE Mid West Region on Tuesday 30th of September.  The HIQA report clearly identifies that the lack of sufficient acute inpatient beds in UHL and the Mid West region is the core issue that needs to be addressed urgently.  The report presents three options for how to best address the capacity gap. These include the expansion of capacity at UHL on the Dooradoyle site (Option A); the extension of the UHL hospital campus to include a second site in close proximity under a shared governance and resourcing model (Option B); and the development of a Model 3 hospital in HSE Mid West, providing a second emergency department (ED) for the region (Option C).  My officials and I are considering the comprehensive and detailed reports and advice provided by HIQA, including the three options identified. I will report back to Government on these options and considerations before the end of the year. ",
        "questionNumber": 196,
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29"
        },
        "showAs": " 316. Deputy Donna McGettigan asked the Minister for Children, Disability and Equality the efforts her Department is making to address the fact that childcare is a barrier for women taking up apprenticeships; and if she will make a statement on the matter. [64042/25] ",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_196.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_196",
          "showAs": "Childcare Services",
          "debateSectionId": "dbsect_196"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_316",
        "answerText": " Minister for Children, Disability and Equality  Improving access to quality and affordable early learning and childcare is a key priority of Government.  Early learning and childcare capacity is increasing. Data from the Annual Early Years Sector Profile 2023/24 shows that the estimated number of enrolments increased by approximately 19% from the 2021/22 programme year. However, it appears that demand for early learning and childcare remains higher than available supply in certain parts of the country, particularly for younger children.  The Department continues to support the ongoing development and resourcing of Core Funding which has given rise to a significant expansion of places since the scheme was first introduced. Core Funding, which is in its fourth programme year, funds services based on the number of places available.  Budget 2025 secured funding for the fourth programme year (2025/6) to facilitate a further 3.5% increase from September 2025. Budget 2026 has made provision for the fifth programme year (2026/7) for a further expansion in supply of 4.2%.  This increased investment will allow increases in growth of the sector driven both by new services joining the sector and existing services offering more places and/or longer hours to families.  The total allocation for Core Funding in 2026/2027 programme year will increase to at least €436.54 million, an additional €43.90 million on the current full year allocation.  Capital funding allocated to the early learning and childcare sector under the National Development Plan has enabled significant investment in early learning and childcare. This allows existing Core Funding Partner Services to extend their existing premises or, in the case of community services, to construct or purchase new premises.  The Building Blocks Extension Grant Scheme was launched in late 2024 with a closing date in January 2025. There were four strands to the scheme: Community Construction, Community Extension, Community Purchasing and Private Extension. A total of 78 applications were received with 50 applicants approved to progress to the next stage of the grant process. The scheme will deliver up to 1,500 places from next year.  As announced in the context of Budget 2026, €36 million will be available in 2026 for early learning and childcare capital programmes. This will include acquisitions of new buildings through the State-led early learning and childcare programme, investment in expansion of existing early learning and childcare operators through the Building Blocks scheme and a number of quality initiatives including supports to childminders.  The NCS establishes an equitable and progressive system of universal and income-assessed subsidies for children up to the age of 15.  The universal subsidy is set at a rate of €2.14 per hour and is available for up to 45 hours per week, for a child aged between 24 weeks and 15 years of age. Higher rates may be available through an income-assessed award however this depends on the family’s individual circumstances.  Where both the applicant and the applicant’s partner (if applicable) are engaged in work or study, or meet certain other enhanced hours criteria, an “enhanced hours subsidy” of up to 45 hours per week may be awarded. Where either the applicant or the applicant’s partner (if applicable) are not engaged in work or study (and do not qualify under other enhanced hours criteria), a “standard hours subsidy” of up to 20 hours per week may be awarded.  The definition of work is extremely broad, covering all forms of work arrangement, including apprenticeships. The study rule is also a generous one and allows parents to access 45 hours of childcare when completing any NFQ qualification, from level 1, for even a small number of hours per week. ",
        "questionNumber": 316
      },
      "contextDate": "2025-11-19"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Donna-McGettigan.D.2024-11-29",
          "showAs": "Donna McGettigan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Donna-McGettigan.D.2024-11-29"
        },
        "showAs": " 368. Deputy Donna McGettigan asked the Minister for Further and Higher Education, Research, Innovation and Science the efforts his Department is making to address the low uptake of apprenticeship places for the Travelling community; and if he will make a statement on the matter. [64039/25] ",
        "to": {
          "roleType": null,
          "showAs": "Further and Higher Education",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_249.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_249",
          "showAs": "Apprenticeship Programmes",
          "debateSectionId": "dbsect_249"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_368",
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  I propose to take Questions Nos. 368, 369 and 372 together.  Inclusiveness is a key goal in the Action Plan for Apprenticeship 2021-2025, with specific initiatives to support under-represented groups such as Travellers.  The Traveller Apprenticeship Incentivisation Programme (TAIP) was established in 2023 and is administered by the Irish Traveller Movement. It is funded by the Dormant Accounts Fund (DAF) and provides targeted support to members of the Traveller community when accessing and completing apprenticeships. This support is delivered through a €3,000 bursary, structured across three streams:  • New apprentices  • Existing apprentices  • Those attending pre-apprenticeship programmes  There are also grants of €2,000 for employers who take on Travellers as apprentices.  Since the programme started, a total of 150 grants have been approved across all streams.  TAIP actively engages employers across the public and private sectors through regular meetings and social media activity to promote Traveller participation in apprenticeships and to champion workplace diversity. In September 2025, over 40 employers attended TAIP’s “Traveller Employment – Recruitment and Retention” for employers session, as part of the IBEC Inclusive Leadership Forum. This was TAIP’s second employer training of the year.  Engaging with Traveller women is a key objective of the TAIP. In Q3 this year, the TAIP launched its Traveller Women in Apprenticeships poster and delivered a workshop on this theme to Galway Traveller Movement staff, in collaboration with Galway Technical Institute and the Galway Roscommon Educational Training Board Traveller and Roma SIT Officer, with two further workshops scheduled for Q4 2025. As of the end of September, women accounted for 21% of individuals expressing interest in the TAIP.  Boosting women’s participation in apprenticeships remains a priority, supported by a dedicated gender bursary to encourage female entrants. Since the department’s inception, the share of women among apprentices has grown from 5% to 10% of the total population. ",
        "questionNumber": 368
      },
      "contextDate": "2025-11-19"
    }
  ]
}