{
  "head": {
    "counts": {
      "questionCount": 8482,
      "resultCount": 8482
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  Responsibility for the regulation of the electricity market is a matter for the Commission for Regulation of Utilities (CRU) which is an independent regulator, accountable to the Oireachtas and not the Minister. The CRU was assigned responsibility for the regulation of the Irish electricity sector following the enactment of the Electricity Regulation Act, 1999 and subsequent legislation.  My Department has established a cross-Government National Energy Affordability Taskforce to identify, assess and implement measures that will enhance energy affordability for households and businesses, while delivering key renewable commitments and protecting security of supply and economic stability.  The taskforce's first report set out measures for consideration as part of the Budget 2026 process. This report has been published on Gov.ie, in advance of further analysis and the publication of the Energy Affordability Action Plan in 2026.  There are no plans to bring any privately owned energy infrastructure into public ownership. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 132. Deputy Richard Boyd Barrett asked the Minister for Climate, Energy and the Environment in light of persistently high household energy costs nationwide, whether he will bring any privately owned energy infrastructure into public ownership and thereby prevent profiteering in the sector. [73225/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_164",
          "debateSectionId": "dbsect_164",
          "showAs": "Energy Prices",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_164.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_132",
        "questionNumber": 132
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  ESB is a commercial State body, under the aegis of my Department, established under the Electricity Supply Act 1927. ESB is a body corporate, and a separate legal entity to the Department.  There are no plans to introduce legislation in relation to ESB’s mandate. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 156. Deputy Richard Boyd Barrett asked the Minister for Climate, Energy and the Environment whether he will introduce legislation creating a not-for-profit mandate for the Electricity Supply Board. [73224/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_185",
          "debateSectionId": "dbsect_185",
          "showAs": "Electricity Supply Board",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_185.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_156",
        "questionNumber": 156
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Deputy Richard Boyd Barrett  There is €125 million a year, I think, or probably higher, in section 481 film tax support for the film producers of this country. You can add in another €20 million or €30 million from Screen Ireland. It is a lot of money; billions over several decades. Is the Minister enforcing - I believe he is not - the quality employment and training condition? It is about guaranteeing decent quality employment and training for the people who work in the industry. In truth, actors are not being looked after in terms of their royalties and are being forced to sign buyout contracts, and crew are not having their rights vindicated. The Minister needs to monitor and police this properly. \n Deputy Simon Harris  I thank Deputy Boyd Barrett for raising this issue. I know it is an issue in which he has taken a keen interest since long before I was in this role. The Deputy and I, along with Deputy Ó Snodaigh, had some engagement on this matter during the Report Stage debate on the Finance Bill. Section 481 of the Taxes Consolidation Act 1997 provides a 32% payable credit for eligible expenditure on film production in Ireland. The scheme is intended to act as a stimulus to indigenous film industry in the State, to create quality employment opportunities and to support the expression of Irish culture.  The provision of quality employment forms part of the application process for the relief, as the Deputy said. Applicant companies are required to sign an undertaking of compliance with all relevant employment legislation. Adjudication of adherence to employment legislation is not within my direct remit as Minister for Finance. Monitoring of compliance with employment rights legislation is primarily a matter for the Department of enterprise through the Workplace Relations Commission. If there are any issues to be raised with regard to the application of employment law, they should be brought to that Department.  In relation to copyright, which is also within the remit of the Department of enterprise, my officials have directly engaged with relevant representative bodies to better understand issues relevant to the audiovisual sector. There are complex legal issues involved but processes are under way to address them. The Deputy will be aware that an independent facilitator was retained by Screen Ireland in 2023 to meet key stakeholders wherein copyright concerns were discussed and identified directly with industry. As a result of this process, stakeholders have agreed interim best practice industry guidelines while pursuing a path towards a collective bargaining agreement. This is a positive step. Several collective bargaining agreements have been reached in the industry in recent years including construction crew and shooting crew agreements. These agreements provide for improved rates of pay, for standardised work practices and for an industry pension scheme. This demonstrates the scope for positive engagement in the industry and the genuine willingness to reach compromises beneficial for both parties.  Regarding terms and conditions for film workers, it is not my place as Minister to dictate to creative professionals what their stance on pay and conditions should be. Rather, this is a decision for the workers themselves and for their unions to seek agreement in negotiations with employer representatives. It is not appropriate for legal rights to be linked only to one set of circumstances regarding tax credits. I want everybody's legal rights to be enforced regardless of the tax credit. It is important to recognise that the laws that underpin both copyright and employment rights apply regardless of whether a company applies for section 48. \n Deputy Richard Boyd Barrett  The Minister's Department gives out section 481. The idea that he is not responsible for policing the quality employment and training condition is ridiculous. We need joined-up thinking. Everybody is playing pass the parcel - the Department of arts, the Department of finance and the Department of enterprise - and nobody is responsible. Therefore, workers are blacklisted, overworked, stressed and not treated properly. Their rights are not vindicated. Actors, screenwriters and so on are forced to sign buyout contracts which essentially force them to sign away their residuals. If anybody kicks up, they are kicked out of the industry. That is the actuality of the industry. Is the Minister or the Department aware that Screen Guilds of Ireland, which is funded by Screen Ireland, did a survey of people in the film industry in the summer but never published the outcome? Initially, very few people knew about it but when they found out, 800 film workers painted a very unflattering picture of conditions in the film industry. I have it in front of me. I will read excerpts if I get a chance. It was never published or given to the union. Stagehands recently won cases in the High Court. Equity will tell the Minister, despite what he is being told, that their fight against buyout contracts is ongoing because producers are not responding seriously. \n Deputy Malcolm Byrne  I accept the Deputy's point that there are some examples in the sector but it is important to remember there are up to 16,000 people directly or indirectly employed in film, television and animation production in this country, including in the Tánaiste's constituency and in mine. For every €1 invested under section 481, the return to the State is estimated at nearly €4. It is a significant part of our economy. Deputy Boyd Barrett is correct that we need to be concerned about some of the residuals particularly with regard to the impact of artificial intelligence. The joint Oireachtas committee will look at the issue of the impact of AI on the creative industries and the long-term future for actors. This is a vibrant sector. While there are problems, I do not want it to be painted as a widespread phenomenon. There are a lot of really good employers creating incredible work that showcases Ireland nationally and internationally. \n Deputy Simon Harris  Deputy Byrne captured the point I would make. This tax credit has been extraordinarily successful. Deputy Boyd Barrett is not suggesting that it has not. It has created lots of employment and investment and an ecosystem. I happen to live in and represent a county, as does Deputy Byrne, which has benefited significantly from that, as have lots of parts of Ireland. We have seen progress in workers' rights and the enforcement of employment law in relation to this. I referenced a number of collective bargaining agreements. We want to see more. My job is to put in place a tax credit. People sign up and commit to adhering to certain things under the tax credit. I am making the point that those are policed or enforced by the Workplace Relations Commission primarily. There are a number of issues, of which I imagine Deputy Boyd Barrett is aware, before the High Court regarding substantive issues that arose from the Labour Court. I am often asked why we will not mandate PACT-Equity contracts, as used in the UK. They have been offered to Irish workers on a number of productions and they turned it down because the Irish contracts offered better terms. \n Deputy Richard Boyd Barrett  The Minister is getting his information from producers. \n Deputy Simon Harris  It is from my Department. \n Deputy Richard Boyd Barrett  On the work of crew, this survey was responded to by 800 workers. Has the Minister or Deputy Byrne seen it? No, because Screen Ireland has seen it but they have not published it because it paints a very unflattering picture. The words used by the film workers include, \"Producers' reluctance to give the crew their full needs\", \"night shoots and rest days that aren't paid properly\", \"tight schedules\", \"long hours\", \"being hired as a trainee when there are no leads or assistants\", \"overly long work day\", \"budget constraints\", \"ageism\", \"professional development and progression not happening\", \"grade progression\", \"stress and hours\", \"continuity of employment\", \"pay\", \"stress\" - it goes on. It was suppressed, effectively, because the people who did this survey do not want the Minister or anybody else to know about the outcome. Stagehands are in the High Court which found in their favour that their rights under the fixed-term workers Act are not being vindicated because of the DAC structure being abused by film producers in a way that means workers in the industry can never accumulate rights under fixed-term workers legislation. On buyout contracts, Equity made absolutely clear it wants PACT-Equity agreement. It is compliant with EU legislation. It has said this repeatedly. Whoever is telling the Minister they do not want it is not telling the truth. \n Deputy Simon Harris  I would welcome seeing that and I am sure the Deputy will give me what he has about the survey. I will also raise it through my Department with the Department of culture and Screen Ireland. If there is useful information that provides us with an insight into the industry, I would like to see that. It is important to see it and it should not be suppressed. I share that view. On whoever is giving me the information, the information is from my Department, to be clear. I am told there have been times when an Irish production has used PACT-Equity terms but there have also been cases where actors have been offered terms equivalent to UK PACT-Equity terms and have refused them on the basis of previous Irish contracts offering better terms, in particular on lower budget productions.  I am sharing that with the Deputy for the benefit of the discussion. Ultimately, as the Deputy knows, it is a matter for workers' and employers' representatives to reach agreement. \n Deputy Richard Boyd Barrett  It is blacklisting. \n Deputy Simon Harris  Ultimately, that is what we should all be trying to foster here. However, I take the issue seriously. I know this sector through my own constituency and I know many people who work in it. I am aware that the ecosystem has benefited. It is a really positive part of the Irish economy and the Irish offering. Many countries would love to have what we have. If there are areas in need of improvement, I will be very happy to consider them and engage further on them. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 175. Deputy Richard Boyd Barrett asked the Tánaiste and Minister for Finance if he is satisfied that film producer companies in receipt of the section 481 film tax credit or meeting the test for quality employment and fully vindicating the employment and copyright rights of those working in the film industry; and if he will make a statement on the matter. [69915/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_41",
          "debateSectionId": "dbsect_41",
          "showAs": "Film Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_41.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_175",
        "questionNumber": 175
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I thank the Deputy for his question on the assessment and analysis of tax expenditures, and comparisons between tax expenditure and direct investment. This is an important distinction as tax expenditures are spending conducted through the tax system rather than directly through public expenditure programmes; the distinction in approach continues to receive deserved and detailed scrutiny adding to our efforts to increase awareness and transparency relating to the costs of tax expenditures currently operating.  The Deputy may be aware that the recently updated Tax Expenditure Evaluation Guidelines, which are produced by my department, outline the Government’s approach to (i) when tax expenditures are best used, noting that these narrow the tax base, and (ii) how they should be evaluated. Information from the guidelines and the outcomes of past evaluations to ascertain value for money and effectiveness relating to policy objectives, can be used to determine the most effective intervention approach.  These Guidelines explain that Government policy is based on the principle that tax expenditures should be used in limited circumstances where a) a demonstrable market failure exists and, b) the measure is more efficient than a direct expenditure intervention.  To achieve this, the Guidelines provide a recommended pre-determined set of questions to be addressed in every ex-ante tax expenditure evaluation, culminating to whether a tax expenditure is the best approach to address the relevant market failure.  It will also be of interest to the Deputy that, in line with the same Guidelines, my Department has published numerous evaluations and reviews of existing tax expenditures. For example, this year, reviews of the Foreign Earnings Deduction, the Reduced Rate of USC for Medical Card Holders, the Special Assignee Relief Programme, and the Rent Tax Credit were carried out and published on Budget Day.  My Department also publish an annual report on tax expenditures. Tax Expenditures in Ireland – 2025 Report was published in July of this year and provides analysis of tax expenditures. The annex of the report provides a master list of each measure identified by my Department of meeting the definition of a tax expenditure provided for in Irish law.  As per the report, tax expenditures amounted to €8 billion in 2024, equivalent to 2 per cent of national income or, alternatively, to 8 per cent of total tax revenue.  As noted by the report, financing the level of revenue forgone associated with tax expenditures would be the equivalent of financing the expenditure of the fifth largest line of (voted) public expenditure in 2024, only spending by the Departments of Social Protection, Health, Education, and Housing, Local Government and Heritage were higher.  It may be of interest to the Deputy that a recent initiative of my Department – the Tax Expenditure Passports, were also published for the first time over the summer. These passports provide an easily accessible one-page summary of each tax expenditure currently in operation.  The Deputy may be interested in a paper prepared by my Department as part of this year's Tax Strategy Group process, which outlines the developments and improvements made in the area of tax expenditure reporting in recent years. This paper is available on the Department's website.  My Department remain committed to improving the transparency and reporting of tax expenditures and their evaluation, and I am satisfied with the current analysis and reporting. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 191. Deputy Richard Boyd Barrett asked the Tánaiste and Minister for Finance if he satisfied that his Departments current analysis of corporate tax expenditures is adequate to assess the benefit of those expenditures as against potential benefit of using those monies for more direct Government investment and expenditure to improve public services, infrastructure or achieve economic and social goals; and if he will make a statement on the matter. [69916/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_205",
          "debateSectionId": "dbsect_205",
          "showAs": "Economic Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_205.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_191",
        "questionNumber": 191
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Given the centrality of housing to the achievement of Government’s wider societal and economic goals, the Department of Finance closely monitors all aspects of the housing market including building activity, the labour market, costs and prices.  The Deputy may be aware that the Society of Chartered Surveyors Ireland published a report on 9 December titled “The Real Costs of New Apartment Delivery 2025”. Their analysis notes that State interventions are playing a critical role in closing the financial viability gap when it comes to building new apartments.  This report examined six categories of two-bedroom apartments (buy to sell) and found that just two were financially viable before any Government interventions. However, after Government interventions such as the reduction in VAT, together with Croí Cónaithe, it was found that five of the six categories became financially viable.  Department officials will continue to closely monitor developments in the housing market, including in relation to new apartments. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 221. Deputy Richard Boyd Barrett asked the Tánaiste and Minister for Finance the way in which he is planning to evaluate the effectiveness of the VAT cut on sale of apartments to build more homes; and if he will make a statement on the matter. [69918/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_235",
          "debateSectionId": "dbsect_235",
          "showAs": "Fiscal Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_235.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_221",
        "questionNumber": 221
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  There are currently a number of measures currently in place which disincentivise land hoarding and property speculation.   Residential Zoned Land Tax   The Residential Zoned Land Tax (RZLT) was introduced in Finance Act 2021 and first charged in 2025. It seeks to increase housing supply by encouraging the activation of residential development on lands which are suitably zoned and appropriately serviced.  RZLT legislation allows for a deferral of the tax where the landowner has either commenced residential development or has received planning permission within the past 12 months. Should works on the site permanently cease prior to the expiry of the planning permission period, without the lodgement of certificates of compliance on completion in respect of all of the residential development outlined in the planning permission, the tax deferred up to that point becomes due and payable. The liable person must amend all returns in which the deferral was claimed and pay the RZLT that was deferred and interest accordingly.  The policy objective is to ensure the land is activated in a timely manner. The most important metric for judging the success of this tax is the number of planning permission applications, and the number of activations of planning permissions. This is reflected in the high percentage of the liability which is deferred as it shows that land which meets the criteria for RZLT, is not being left idle and development is taking place.   Vacant Homes Tax   The Vacant Homes Tax (VHT) was announced in Budget 2023 and legislated for in Finance Act 2022. The main objective of this tax is to increase the supply of homes for rent or purchase by encouraging the owners of vacant, habitable, residential properties to bring those properties back into use. A residential property will be within the scope of the tax if it has been occupied as a dwelling for less than 30 days in a chargeable period.  VHT operates on a self-assessment basis, where the number of properties in scope and the amount of tax payable depends on the self-assessed returns submitted by property owners, the number of properties declared as liable, and the number of property owners entitled to claim available exemptions from the tax.  VHT is charged at a rate of seven times a property’s base local property tax (LPT) charge with effect from 1 November 2024.   Derelict Property Tax   In Budget 2026, Government agreed to the introduction of a new Derelict Property Tax. The aim of this tax is to encourage the activation of derelict properties. It will replace the Derelict Sites Levy and will be collected by the Revenue Commissioners. I intend to legislate for the Derelict Property Tax in 2026.  Local authorities need time and resources to identify properties in their areas so that preliminary registers of dereliction can be published in 2027. The tax will be implemented as soon as possible after these registers are published.   Stamp Duty   I would also like to bring to your attention the Stamp Duty rate of 15% which is applied where 10 or more houses (not apartments) are acquired in any 12-month period. This measure is designed to address the issue of property speculation  First introduced in May 2021, at a rate of 10%, it was increased to 15% in Budget 2025.  The higher Stamp Duty rate on bulk acquisitions is one of several measures introduced in 2021 with the intention of discouraging investment funds (and others) from buying up blocks of new houses, and sometimes whole estates, usually with the intention of placing them on the rental market. Such activity reduces the supply of new houses available to individual private buyers.  In conclusion, I am satisfied that the existing measures are having a positive impact on the issues of land hoarding and property speculation. I am also confident that the proposed Derelict Property Tax will be helpful in encouraging the activation of derelict properties. All of these measures are kept under review. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 238. Deputy Richard Boyd Barrett asked the Tánaiste and Minister for Finance if he is considering more aggressive tax measures to address the problem of land hoarding and property speculation; and if he will make a statement on the matter. [69914/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_251",
          "debateSectionId": "dbsect_251",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_251.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_238",
        "questionNumber": 238
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The Revenue Commissioners publish a quarterly report on property tax statistics. Their latest report was published in October 2025 and is available at the following link: www.revenue.ie/en/corporate/documents/statistics/property-taxes/pt-stats-update-211025.pdf  This report indicates that, in respect of the Local Property Tax (LPT) year 2025, there were 1,458,919 public and private owners in respect of 2,033,145 properties based on LPT returns filed. The distribution of owners is given in the following table:      Property ownership      Number of owners      Percentage       1    1,285,219    88.09%      2    122,721    8.41%      3    26,937    1.85%      4    9,784    0.67%      5-9    10,686    0.73%      10-19    2,296    0.16%      20-49    835    0.06%      50-99    203    0.01%      100 or greater    238    0.02%       All ownership      1,458,919      100.00%        I am advised by Revenue that they will be furnishing the next quarterly report on Property Tax statistics report in Q1 2026. Revenue will undertake to carry out further, more detailed analysis on property ownership, in addition to that provided in their latest property statistics paper, as requested by the Deputy.  Regarding the matter of property distribution, LPT is payable based on the market value of properties and represents a tax on wealth. LPT is payable in respect of each property owned by multi-property owners. Furthermore, Capital Gains Tax and Capital Acquisitions Tax also represent taxes on household wealth.  LPT revaluation took place on 1 November 2025, with the next valuation period commencing in 2026 for a duration of five years. The Finance (Local Property Tax and Other Provisions) Act 2025 was enacted in July 2025 and provided for a number of changes to LPT. Base LPT charges will increase by 5% or 6% for homes values under €1.26 million. Properties valued at greater than €1.26 million, or properties that have appreciated significantly in value since 2021, will pay proportionately higher LPT. These changes are expected to yield an additional €45 million in revenue.  The changes that were made this year were fair and progressive. Owners of multiple properties will also see their base LPT charges increase for each property they own. This will contribute to the additional funding for local services over the next five years. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 248. Deputy Richard Boyd Barrett asked the Tánaiste and Minister for Finance if he will provide all available information on the distribution of residential property held by the Revenue Commissioners for the purposes of local property tax (details supplied); his views on the matter of wealth and property distribution, particularly after recent reports on the dramatic growth in household wealth, in tabular form; and if he will make a statement on the matter. [69917/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_259",
          "debateSectionId": "dbsect_259",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_259.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_248",
        "questionNumber": 248
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I thank the Deputy for his question on the assessment and analysis of tax expenditures, and comparisons between tax expenditure and direct investment. There is an important distinction as tax expenditures are spending conducted through the tax system rather than directly through public expenditure programmes and this distinction in approach continues to receive deserved and detailed scrutiny adding to our efforts to increase awareness and transparency relating to the costs of tax expenditures.  The Deputy may be aware that the recently updated Tax Expenditure Evaluation Guidelines, which are produced by my department, outline the Government’s approach to (i) when tax expenditures are best used, noting that these narrow the tax base, and (ii) how they should be evaluated. Information from the guidelines and the outcomes of past evaluations to ascertain value for money and effectiveness relating to policy objectives, can be used to determine the most effective intervention approach.  These Guidelines explain that Government policy is based on the principle that tax expenditures should be used in limited circumstances where a) a demonstrable market failure exists and, b) the measure is more efficient than a direct expenditure intervention.  To achieve this, the Guidelines provide a recommended pre-determined set of questions to be addressed in every ex-ante tax expenditure evaluation, culminating to whether a tax expenditure is the best approach to address the relevant market failure.  It will also be of interest to the Deputy that, in line with the same Guidelines, my Department has published numerous evaluations and reviews of existing tax expenditures. For example, this year, reviews of the Foreign Earnings Deduction, the Reduced Rate of USC for Medical Card Holders, the Special Assignee Relief Programme, and the Rent Tax Credit were carried out and published on Budget Day.  My Department also publishes an annual report on tax expenditures. Tax Expenditures in Ireland – 2025 Report was published in July of this year and provides analysis of tax expenditures. The annex of the report provides a master list of each measure identified by my Department of meeting the definition of a tax expenditure provided for in Irish law.  As per the report, tax expenditures amounted to €8 billion in 2024, equivalent to 2 per cent of national income or, alternatively, to 8 per cent of total tax revenue.  As noted by the report, financing the level of revenue forgone associated with tax expenditures would be the equivalent of financing the expenditure of the fifth largest line of (voted) public expenditure in 2024, only spending by the Departments of Social Protection, Health, Education, and Housing, Local Government and Heritage were higher.  It may be of interest to the Deputy that a recent initiative of my Department – the Tax Expenditure Passports, were also published for the first time over the summer. These passports provide an easily accessible one-page summary of each tax expenditure currently in operation.  The Deputy may be interested in a paper prepared by my Department as part of this year's Tax Strategy Group process, which outlines the developments and improvements made in the area of tax expenditure reporting in recent years. This paper is available on the Department's website here: www.gov.ie/en/department-of-finance/publications/tax-expenditures-publications-and-guidelines/  My Department remains committed to improving the transparency and reporting of tax expenditures and their evaluation, and, I am satisfied with the current analysis and reporting. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 359. Deputy Richard Boyd Barrett asked the Tánaiste and Minister for Finance the assessments he has made in relation to the costs of tax expenditure comparing the way in which the same funds for direct investment will be more effective in achieving social and economic goals; and if he will make a statement on the matter. [70408/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_357",
          "debateSectionId": "dbsect_357",
          "showAs": "Fiscal Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_357.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_359",
        "questionNumber": 359
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 360. Deputy Richard Boyd Barrett asked the Tánaiste and Minister for Finance the assessments he has made in relation to the costs of tax expenditure, comparing the way in which the same funds for direct investment will be more effective in achieving social and economic goals; and if he will make a statement on the matter.  [70408/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_358",
          "debateSectionId": "dbsect_358",
          "showAs": "Fiscal Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_358.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_360",
        "questionNumber": 360
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The criteria for the award of incremental credit are set out in the Department’s Circulars 10/2001 for Primary teachers, 29/2007 and 29/2010 for post-primary teachers. The criteria for the award of incremental credit to recognised teachers was agreed under the auspices of the Teachers Conciliation Council (TCC).  To receive the qualified rate of pay, a teacher must be registered with the Teaching Council and have qualifications appropriate to the teaching sector for which they are employed. Teaching service prior to educational qualification as confirmed by the Teaching Council of Ireland is paid at the unqualified rate of pay.  The award of incremental credit is not an automatic entitlement, applicants must submit a fully completed incremental credit application in order to have prior service assessed. When an application for incremental credit is received in the Department, it is checked to ensure that it is fully completed. Applications are managed in date received order.  Applications can take up to 20 weeks to be fully processed but most are dealt with well within this timeframe. Factors that impact on this processing time include incomplete application forms and conflicting information on the application form such as email addresses. Please be advised that if the teacher meets the criteria set out in Circular 0029/2007, incremental credit will be awarded and any monies due paid accordingly.  With regard to the application to which you refer, the Department was not made aware that the teacher was awaiting a decision on her application due to applying for a mortgage. As this teacher is in the process of securing a mortgage, the application for incremental credit will be brought to the forefront to review by this Unit and a letter will issue to her regarding same. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 242. Deputy Richard Boyd Barrett asked the Minister for Education and Youth if her Department will expedite an incremental credit for a post-primary school teacher (details supplied) in recognition of earlier experience; and if she will make a statement on the matter. [72902/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_226",
          "debateSectionId": "dbsect_226",
          "showAs": "Education Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_226.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_242",
        "questionNumber": 242
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Defence  I propose to take Questions Nos. 122, 137 and 145 together.  As Minister for Defence, I am committed to introducing legislation to reform the Triple Lock. It is not acceptable to the Government that any one of five permanent members of the U.N. Security Council have an essential veto on Ireland participating in Peacekeeping missions overseas.  The General Scheme of the Defence (Amendment) Bill 2025 was approved by Government in March of this year.  The General Scheme was subsequently referred to the Joint Oireachtas Committee on Defence and National Security for consideration under the Pre-Legislative Scrutiny process.  The purpose of this Bill is to:  (a) revise and consolidate the current legislation, including the provisions concerning the operation of the so-called 'Triple Lock' mechanism, relating to the despatch of members of the Defence Forces for service outside the State; and,  (b) give effect to recommendations pertaining to suspension and associated provisions contained within the report prepared by Mr Peter Ward, Senior Counsel, concerning the management of members of the Defence Forces charged, with or convicted of, serious criminal offences.  Prior to my recent appointment as Minister for Defence, there has been very detailed engagement on this legislation, most recently as part of the pre-legislative scrutiny process which provided the Committee with the opportunity to examine the Heads and to consult relevant stakeholders on the proposed Bill.  The Committee conducted a very thorough piece of work which reflected the views of a wide range of stakeholders I would like to take this opportunity to thank the Committee for their report, which I am now considering as part of the drafting process for the Bill.  I can perfectly understand the concerns that some people have around this legislation and I want to assure them that this Bill will not impact on Ireland’s policy of military neutrality. Ireland's policy of military neutrality is characterised by the non-membership of military alliances or common or mutual defence arrangements. However, I ask that Deputies reflect on the much- changed geopolitical landscape over the last number of years and resulting challenges arising globally and at UN Security Council level. I believe that the Defence Forces have played a really key role in peace keeping abroad, but Deputies must also be aware that no new peacekeeping mission has been authorised in the U.N. since 2014.  Ireland has always taken an active approach to global challenges and making significant contributions to international peace and security, and will continue to do so. The proposed changes will remain fully consistent with the principles of the UN Charter and international law. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 137. Deputy Richard Boyd Barrett asked the Minister for Defence if she plans to introduce legislation on the triple lock; if so, when she intends to do so; and if she will make a statement on the matter. [71836/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_61",
          "debateSectionId": "dbsect_61",
          "showAs": "Legislative Measures",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_61.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_137",
        "questionNumber": 137
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  I propose to take Questions Nos. 122, 137 and 145 together.  As Minister for Defence, I am committed to introducing legislation to reform the Triple Lock. It is not acceptable to the Government that any one of five permanent members of the U.N. Security Council have an essential veto on Ireland participating in Peacekeeping missions overseas.  The General Scheme of the Defence (Amendment) Bill 2025 was approved by Government in March of this year.  The General Scheme was subsequently referred to the Joint Oireachtas Committee on Defence and National Security for consideration under the Pre-Legislative Scrutiny process.  The purpose of this Bill is to:  (a) revise and consolidate the current legislation, including the provisions concerning the operation of the so-called 'Triple Lock' mechanism, relating to the despatch of members of the Defence Forces for service outside the State; and,  (b) give effect to recommendations pertaining to suspension and associated provisions contained within the report prepared by Mr Peter Ward, Senior Counsel, concerning the management of members of the Defence Forces charged, with or convicted of, serious criminal offences.  Prior to my recent appointment as Minister for Defence, there has been very detailed engagement on this legislation, most recently as part of the pre-legislative scrutiny process which provided the Committee with the opportunity to examine the Heads and to consult relevant stakeholders on the proposed Bill.  The Committee conducted a very thorough piece of work which reflected the views of a wide range of stakeholders I would like to take this opportunity to thank the Committee for their report, which I am now considering as part of the drafting process for the Bill.  I can perfectly understand the concerns that some people have around this legislation and I want to assure them that this Bill will not impact on Ireland’s policy of military neutrality. Ireland's policy of military neutrality is characterised by the non-membership of military alliances or common or mutual defence arrangements. However, I ask that Deputies reflect on the much- changed geopolitical landscape over the last number of years and resulting challenges arising globally and at UN Security Council level. I believe that the Defence Forces have played a really key role in peace keeping abroad, but Deputies must also be aware that no new peacekeeping mission has been authorised in the U.N. since 2014.  Ireland has always taken an active approach to global challenges and making significant contributions to international peace and security, and will continue to do so. The proposed changes will remain fully consistent with the principles of the UN Charter and international law. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 145. Deputy Richard Boyd Barrett asked the Minister for Defence in the context of Government plans to introduce legislation on the triple lock; the particular deployments or type of deployments of the Defence Forces that she believes she is precluded from making under the current legislation; and if she will make a statement on the matter. [71837/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_61",
          "debateSectionId": "dbsect_61",
          "showAs": "Legislative Measures",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_61.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_145",
        "questionNumber": 145
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  The situation in Myanmar continues to be of grave concern to the Government. We have seen an appalling humanitarian tragedy unfold in that country since the military attempted to seize power in an illegal coup in 2021. Thousands of civilians have been killed, and millions have been displaced or forced into poverty and hunger.  My Department has been closely following developments in Myanmar, including the latest developments surrounding the electoral process announced earlier this year by the so-called State Security and Peace Commission. The European Union issued a strong and comprehensive statement on 10 December - International Human Rights Day - which Ireland fully supports, describing our shared concern regarding the holding of elections in the current context and the serious issues associated with such a move. The essential conditions for free and fair polls are not in place in Myanmar at this time. As the EU statement notes, widespread violence, restrictions on fundamental freedoms, mass detentions, and the exclusion of key political actors severely undermine the credibility of the process.  Ireland implements UN and EU sanctions in relation to Myanmar, which effectively target Myanmar’s military regime, and other groups and entities which threaten democracy, rule of law and peace and security. Ireland is open to consideration of further measures that would be effective in restoring Myanmar’s democratic path and encouraging the cessation of human rights abuses.  Since the coup in February 2021, neither I nor my Department have undertaken actions that would serve to confer the appearance of legitimacy on the military junta. In keeping with that principle, we have not held any bilateral meetings or engagements with the military authorities, or with the Myanmar Embassy in London.  Ireland's Embassy in Bangkok maintains ongoing contact with a range of stakeholders and contacts representing Myanmar civil society, human rights defenders, media and others who are working to support efforts to restore peace, stability and democracy to Myanmar.  My Department will continue to engage both with EU partners and at the UN to urge a return to democracy, stability, and respect for human rights. Ireland supports ASEAN’s efforts to this end, including the full and effective implementation of the ASEAN Five Point Consensus. Ireland joins with our EU partners in urging all stakeholders to prioritise an immediate ceasefire, an end to violence, an inclusive political dialogue, and unhindered humanitarian access. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 174. Deputy Richard Boyd Barrett asked the Minister for Foreign Affairs and Trade his engagements with the government of Burma/Myanmar and its embassy regarding reported election irregularities in the country (details supplied). [72177/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_108",
          "debateSectionId": "dbsect_108",
          "showAs": "Foreign Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_108.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_174",
        "questionNumber": 174
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  As Minister for Defence, I am committed to introducing legislation to reform the Triple Lock. It is not acceptable to the Government that any one of five permanent members of the U.N. Security Council have an essential veto on Ireland participating in Peacekeeping missions overseas.  The General Scheme of the Defence (Amendment) Bill 2025 was approved by Government in March of this year.  The General Scheme was subsequently referred to the Joint Oireachtas Committee on Defence and National Security for consideration under the Pre-Legislative Scrutiny process.  The purpose of this Bill is to:  (a) revise and consolidate the current legislation, including the provisions concerning the operation of the so-called 'Triple Lock' mechanism, relating to the despatch of members of the Defence Forces for service outside the State; and,  (b) give effect to recommendations pertaining to suspension and associated provisions contained within the report prepared by Mr Peter Ward, Senior Counsel, concerning the management of members of the Defence Forces charged, with or convicted of, serious criminal offences.  Prior to my recent appointment as Minister for Defence, there has been very detailed engagement on this legislation, most recently as part of the pre-legislative scrutiny process which provided the Committee with the opportunity to examine the Heads and to consult relevant stakeholders on the proposed Bill.  The Committee conducted a very thorough piece of work which reflected the views of a wide range of stakeholders I would like to take this opportunity to thank the Committee for their report, which I am now considering as part of the drafting process for the Bill.  I can perfectly understand the concerns that some people have around this legislation and I want to assure them that this Bill will not impact on Ireland’s policy of military neutrality. Ireland's policy of military neutrality is characterised by the non-membership of military alliances or common or mutual defence arrangements. However, I ask that Deputies reflect on the much- changed geopolitical landscapeover the last number of years and resulting challenges arising globally and at UN Security Council level. I believe that the Defence Forces have played a really key role in peace keeping abroad, but Deputies must also be aware that no new peacekeeping mission has been authorised in the U.N. since 2014.  Ireland has always taken an active approach to global challenges and making significant contributions to international peace and security, and will continue to do so. The proposed changes will remain fully consistent with the principles of the UN Charter and international law.   ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 241. Deputy Richard Boyd Barrett asked the Minister for Defence her plans to introduce legislation on the triple lock before the end of 2025; the timeframe for same; and if she will make a statement on the matter. [66249/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_160",
          "debateSectionId": "dbsect_160",
          "showAs": "Legislative Measures",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_160.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_241",
        "questionNumber": 241
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. In general, the drafting of employment legislation is a matter for the Department of Enterprise, Tourism and Employment and does not come under the remit of my Department.  However, the specific query raised by the Deputy relating to private income protection schemes is an operational matter for Dublin Bus. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 283. Deputy Richard Boyd Barrett asked the Minister for Transport his plans to introduce legislation to ensure that public transport employers, such as Dublin Bus, provide a full occupational sickness and long-term illness benefit to its drivers, which is to replace private income protection schemes; and if he will make a statement on the matter. [71819/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_199",
          "debateSectionId": "dbsect_199",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_199.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_283",
        "questionNumber": 283
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  In general, the drafting of employment legislation is a matter for the Department of Enterprise, Tourism and Employment and does not fall under the remit of my Department. However, the specific query raised by the Deputy relating to private income protection schemes is an operational matter for the bus operators involved who should be contacted directly in this instance. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 284. Deputy Richard Boyd Barrett asked the Minister for Transport if his attention has been drawn to the fact  that the only income protection provider in Ireland  (details supplied) to bus drivers is ceasing its income protection schemes to public transport drivers; if he is planning to intervene to provide full income protection to drivers through their employer; and if he will make a statement on the matter. [71820/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_200",
          "debateSectionId": "dbsect_200",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_200.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_284",
        "questionNumber": 284
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  There are robust legal protections in place for employees who are pregnant.  An employee cannot be made redundant, or be given notice of redundancy, while on maternity leave or additional maternity leave. This is provided for in section 23 of the Maternity Protection Act 1994, as amended.  In general, dismissal of an employee due to redundancy is not deemed to be an unfair dismissal for the purposes of the Unfair Dismissals Act 1977, as amended. In such cases, an employer must be able to demonstrate that the redundancy is genuine and the selection criteria and the redundancy process is substantively and procedurally fair.  The 1977 Act also provides for a number of grounds under which a dismissal is automatically considered unfair. This includes dismissals wholly or mainly related to pregnancy, giving birth or breastfeeding or any matters connected with pregnancy or birth. While normally employees require at least one year’s service with their employer to be covered under the Unfair Dismissals Act 1977, this does not apply if the dismissal wholly or mainly relates to the employee's pregnancy.  Pregnant employees are also protected under the Employment Equality Act 1998, as amended. This Act is the responsibility of the Minister for Children, Equality and Disability.  Where an employee believes their employer has breached their employment rights, they can make a complaint to the Workplace Relations Commission (WRC). In most cases, complaints must be made within 6 months of the alleged breach. The WRC can extend this to 12 months if the employee demonstrates reasonable cause. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 401. Deputy Richard Boyd Barrett asked the Minister for Enterprise, Tourism and Employment if his attention has been drawn to the possibility that the legislation governing redundancy entitlements can disadvantage pregnant women (details supplied); and if he will make a statement on the matter. [71310/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_298",
          "debateSectionId": "dbsect_298",
          "showAs": "Redundancy Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_298.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_401",
        "questionNumber": 401
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Trade and Employment  There are a range of protections under employment law for employees facing redundancy or the loss of their job.  Redundancy is where an employee loses their job because their employer is closing their business or reducing the number of staff. It occurs when a job no longer exists, an employee is let go and they are not replaced.  Where an employee has been made redundant, they may be entitled to a redundancy payment. Under the Redundancy Payments Act 1967, it is the employer’s responsibility to pay statutory redundancy to eligible employees.  In order to qualify for a statutory redundancy payment, an employee must have 104 weeks' continuous employment, have been an employed contributor in employment which was insurable for all benefits under the Social Welfare Acts, and be over the age of 16.  The requisite period of 2 years continuous service is to ensure the employee has a reasonable attachment to the employer that is making them redundant. There are no plans to make changes to the eligibility criteria to receive a statutory redundancy payment.  An employee with more than one year’s service is protected under the Unfair Dismissal Act 1977, as amended. In such cases, an employer must be able to demonstrate that the dismissal is both substantively and procedurally fair.  In general, dismissal of an employee due to redundancy is not deemed to be an unfair dismissal. However, in such cases, an employer must be able to demonstrate that the redundancy is genuine and the selection criteria and redundancy process adopted are fair.  Where an employee believes their employer has breached their employment rights, they can make a complaint to the WRC. In most cases, complaints must be made within 6 months of the alleged breach. The WRC can extend this to 12 months if the employee demonstrates reasonable cause. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 402. Deputy Richard Boyd Barrett asked the Minister for Enterprise, Tourism and Employment if his attention has been drawn to employers taking advantage of the legislation governing redundancy entitlements to prevent people from reaching the thresholds for entitlement; and his plans to address this. [71339/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_299",
          "debateSectionId": "dbsect_299",
          "showAs": "Redundancy Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_299.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_402",
        "questionNumber": 402
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The provision of a fire service in its functional area, including the establishment and maintenance of a fire brigade, the assessment of fire cover needs and the provision of fire station premises, is a statutory function of individual fire authorities under the Fire Services Act, 1981 & 2003. My Department supports fire authorities through setting general policy, providing a central training programme, issuing guidance on operational and other related matters and providing capital funding support for equipment and priority infrastructural projects. Fire service issues are managed in my Department by the National Directorate for Fire & Emergency Management (NDFEM).  I understand that DFB management and the staff side representatives remain in an industrial relations process under the auspices of the WRC. Engagement with staff side associations and internal communications are a matter for Dublin City Council as the employer of DFB personnel. I would encourage both sides to engage constructively with that process with a view to ensuring a satisfactory conclusion for all stakeholders. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 603. Deputy Richard Boyd Barrett asked the Minister for Housing, Local Government and Heritage following a failure to reach an agreement in the WRC, if his Department will go to the Labour Court to resolve a dispute with trade unions representing workers in the Dublin Fire Brigade, in line with the relevant codes of practice for industrial relations disputes involving essential services. [72228/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_475",
          "debateSectionId": "dbsect_475",
          "showAs": "Trade Unions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_475.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_603",
        "questionNumber": 603
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  Illness benefit is the primary short term income support provided by my Department to those who are unable to work due to illness of any type and who are covered by social insurance. Illness benefit is a contributory scheme and, therefore, eligibility is not determined on a means tested basis. Eligibility depends on the person’s PRSI record and class. The person must have made the required number of contributions under PRSI class A, E, H or P to qualify. The person must be certified as medically incapable of work by a GP.i  Social welfare legislation provides that a person in receipt of or entitled to illness benefit shall not engage in work. If the Deputy has a particular case in mind, the individual should provide the circumstances of such activity to the Department so that they receive the appropriate guidance on the matter.  Subject to the level of relevant PRSI contributions paid, illness benefit is only payable for a maximum period of two years. Where a person exhausts their entitlement to payment of illness benefit and is expected to remain unfit to attend work for a further period of at least 12 months, they have the option of making an application for invalidity pension, which is another social insurance scheme paid from the Social Insurance Fund. Eligibility is based on PRSI contributions and medical condition. To qualify, the person must have been incapable of work for at least 12 months and be likely to be incapable of work for at least another 12 months or they must be permanently incapable of work.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 647. Deputy Richard Boyd Barrett asked the Minister for Social Protection if a person in receipt of illness benefit is allowed to withdraw savings from their business account to their personal account to pay for long-term illness without this having an impact on their of social welfare receipts; and if he will make a statement on the matter. [71822/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_508",
          "debateSectionId": "dbsect_508",
          "showAs": "Social Welfare Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_508.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_647",
        "questionNumber": 647
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Deputy Richard Boyd Barrett  I just got off the phone with a lovely man in his 70s. Let us call him Stephen. He was absolutely savagely abused when he was nine years old and for quite a while. It is only recently, now that he is in his 70s, that he has been able to acknowledge the damage that was done to him. He wants to know when this investigation is going to be established so that he can tell his story. He also wants to know whether people like him, whose lives were affected for their rest of their lives, will get redress for the savage abuse they suffered at school. \n Deputy Michael Moynihan  I thank Deputy Boyd Barrett for the question. First of all, I want to welcome him back. It is great to see him and I wish him the very best of luck in everything.  To say that I find the question in front of me and the challenges faced by survivors challenging would be an understatement. It is extremely distressing even to read or study some of the documentation in relation to this. I find it horrendous to hear the legacy that has been left and the damage that has been done to the man the Deputy calls Stephen, not just in his school years, but in his lifetime.  The Government takes revelations of historical sexual abuse in schools with the utmost seriousness and has established a commission of investigation, chaired by Mr. Justice Michael MacGrath, to investigate the handling of complaints and allegations of historical sexual abuse in schools. The commission was the principal recommendation of the report of the scoping inquiry into historical sexual abuse in day and boarding schools run by religious orders. The scoping inquiry’s report also recognised the significance of the issue of redress for survivors and their expressed wish that those running schools where child sexual abuse occurred should be held financially accountable. It recommended that consideration be given by the Government to establishing a redress scheme for survivors.  The high-level interdepartmental group established to advise the Government on the recommendations of the scoping inquiry recognised redress as an important element of accountability for survivors. The group recognises that consideration of a redress scheme may have far-reaching implications and has advised that further work needs to be undertaken to ensure that the Government is fully informed in any decision it may take. The interdepartmental group has commenced this work, is committed to meeting regularly and aims to report to the Department of education within 18 months. This will not impede the progress of the commission of investigation, which will begin its work in parallel. The commission does not have a role in relation to redress. \n Deputy Richard Boyd Barrett  Stephen described to me in really emotive terms the sadistic abuse that he suffered as a nine-year-old boy and even earlier. He was savagely beaten, humiliated and stripped naked to such an extent that he fled school and never learned to read and write. He described in very emotional terms how he was never able to read bedtime stories to his children, how he imagined it was all his fault, and the shame he suffered all his life. He considered himself to be a dunce and stupid because they were the labels that were associated with him. He spoke of how his entire life was limited in terms of job opportunities. He could not admit that he could not read and write because he did not want to get into the reasons for that. He has only been able to come to terms with it and make a Garda complaint very recently. What he wants to know is when he will he get an acknowledgement and an apology from the State that allowed this to happen. When will he be able to tell his story? I note from what the Minister of State has said that the timeline for this sounds worryingly long. Stephen is in his 70s. Hopefully, he will be here for quite a while yet but people are getting old and they need to know they are going to have some opportunity to tell their story and get redress soon. \n Deputy Michael Moynihan  I take that point. I have met many families and survivors who have suffered enormous trauma such as the Deputy has outlined. Horrendous crimes were committed against them. People pass on and the family, the next generation, carry that challenge in respect of how their parents were treated in school. It is not just for the victims themselves but for the families. In many of the cases I have been involved with, the families have really been challenged. There is one commitment that I will give. The interdepartmental group has commenced its work. That work is ongoing. The group is meeting very regularly. The report is to be within the Department. There is a huge amount of work to be done. It has to be done meticulously and correctly. The group is committed to reporting within the 18 months. It is very important that the timeline is stuck to because, as the Deputy has said, many of the survivors are getting on in years. They really want some kind of closure - I mean that in the broadest possible sense because it may not be full closure - regarding the horrific crimes committed against them. \n Deputy Richard Boyd Barrett  We really need a clear timeline. That needs to happen soon. I am also worried that the terms of reference of this investigation may exclude people because of the type of abuse they suffered. What I described to the Minister of State was absolutely horrendous abuse. Whether it falls within a strict definition of sexual abuse is debatable but it was sadistic, brutal and life-changing abuse. Today, when he was describing the physical and mental damage done to him, he expressed concern about his classmates who also suffered this abuse. He does not know what happened to them but he is still worried about that and about the damage that was done to them because it was so savage and brutal. What he wants is a clear assurance and for the Minister of State or the Government to say that he will get an apology and an opportunity to tell his story and that there will be some redress for the lifelong damage done to him through the sadistic abuse he endured. \n Deputy Michael Moynihan  I will give the Deputy a commitment that we will work to make sure the timelines set out within the system are adhered to. A lot of work is ongoing across Government Departments in that regard. I appreciate that commitments are often given in relation to timelines but then, for a number of reasons, those timelines are not met. This cannot be missed. It has to be on time. Over the past 30 or 40 years, we have dealt with revelations and issues relating to abuse in our school system. We are still trying to come to terms with that. Cases are still coming forward, as we have recently seen in the courts. I will make sure the timelines we have set out are met for every individual who suffered within the school system. There is a lot of work to be done but the documentation I have been given says it will be done within 18 months. I will work to that timeline and report back to the House as soon as possible. ",
        "questionType": "oral",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 92. Deputy Richard Boyd Barrett asked the Minister for Education and Youth whether it is her intention to set up a redress scheme for victims of historical sexual abuse perpetrated by both lay and religious teachers in schools; and the timeline for the establishment of any such redress scheme. [70943/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/dbsect_23",
          "debateSectionId": "dbsect_23",
          "showAs": "Child Abuse",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/mul@/dbsect_23.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_92",
        "questionNumber": 92
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  School secretaries and caretakers are at the heart of the school and are the key interface between students, parents, school leaders and other staff. Without them, our schools would be unsustainable. In supporting these vital school staff members, we also support the school community as a whole.  My Department has been engaging with Fórsa over the past number of weeks under the auspices of the WRC, and with the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation, in relation to a number of claims including a claim for a comparable pension entitlement.  The matter has now been referred to the Labour Court, and a hearing will take place on 12th January 2026. The parties remain in process, and my department remains committed and ready to engage with Fórsa to reach a resolution on this important matter.  As with any industrial relations process, where engagement is sensitive and complex, the matters under discussion are confidential until this process concludes. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 175. Deputy Richard Boyd Barrett asked the Minister for Education and Youth her plans to ensure that school secretaries and caretakers do not suffer hardship following retirement due to loss of income. [70740/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_199",
          "debateSectionId": "dbsect_199",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_199.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_175",
        "questionNumber": 175
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I thank the Deputy for his question on the National Educational Psychological Service (NEPS). I would like to take this opportunity to outline the work of NEPS. All schools have access to:  • General support and advice from a NEPS psychologist, either through the school’s assigned psychologist or through the NEPS Advisory Support Line. The NEPS Advisory Support line provides access for schools to support and advice from a Senior Educational Psychologist in NEPS via a designated phone line available from Monday to Friday.  • Support from a NEPS psychologist in the event of a Critical Incident.  • National and Regional Support and Development service for school staff, which is advertised through the Education Support Centres of Ireland and covers areas such as trauma informed practice, cluster group support for post-primary special education teachers and special class teachers, training for Student Support Teams and supporting reluctant school attendance/school avoidance behaviour.  • Access to either a NEPS psychologist or a SCPA psychologist for individual pupil casework where a priority need is established. SCPA – the Scheme for Commissioning Psychological Assessments - is operated through the use of a panel of psychologists who must meet qualification criteria set by the Department. It is an interim measure intended to supplement the NEPS service and meet current urgent needs for psychological assessment of children and young people.  The total number of psychologists working in NEPS at present is 234 whole time equivalents.  With regard to staffing levels more generally, my department is making every effort to recruit additional educational psychologists. Since January 2023, NEPS has supported bursaries for Trainee Educational Psychologists who are enrolled in the University College Dublin Professional Doctorate in Educational Psychology and Mary Immaculate College Limerick’s Professional Doctorate in Educational and Child Psychology. This has also been extended to students enrolled in the new professional doctorate in educational psychology in Maynooth University. Those in receipt of a bursary commit to joining NEPS upon graduation. There are over 80 Trainee educational psychologists in receipt of a bursary who are expected to join NEPS upon graduation.  The Public Appointments Service recently concluded a recruitment campaign for Educational Psychologists and successful candidates are currently being appointed to NEPS. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 194. Deputy Richard Boyd Barrett asked the Minister for Education and Youth if she will consider expanding NEPS to provide psychological services in all schools. [70741/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_217",
          "debateSectionId": "dbsect_217",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_217.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_194",
        "questionNumber": 194
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Deputy Richard Boyd Barrett  There are in the region of 10,000 PhD researchers in this country. It is accurate to say that much of the higher education system is run on the basis of their exploitation, because the vast majority of them are earning less than the minimum wage for teaching in our universities and institutions. Will the Minister commit to treating them as workers and to paying them a minimum wage of at least €30,000 a year? \n Deputy James Lawless  Under budget 2025, additional funding was announced for Research Ireland in order to increase its PhD stipend level to €25,000, representing an increase of 31% in just two years. This announcement builds upon my Department's consistent focus and progression on this issue. That came into effect from 1 January this year and, given the significant growth in such a short space of time, I have no immediate plans to increase the figure further. The €25,000 was the ask very recently. It was a significant increase on what was there previously and we have done that now. As of this year, we have reached that €25,000 figure for PhD stipends.  My Department has also implemented the recommendations of the independent review of State supports for PhD researchers for an optimum stipend level of €25,000. This review exercise was the first time that PhD provision in Ireland was comprehensively reviewed. For those PhD students in receipt of stipends from national competitive funding agencies outside the remit of my Department, the level of stipend awarded is at the discretion of each funder and its parent Department. Put simply, those agencies under my remit and my Department and in receipt of funding from Research Ireland are providing the €25,000 stipend. There may be other funders outside the remit of my Department which have their own arrangements, but certainly they are all encouraged, at least, to reach that threshold. There are also institutional scholarship supports, sometimes provided by the higher education institution, primarily, and of course there are some private sector sponsorships, etc., as well.  In terms of the higher education institutions and universities, how they use and distribute their core funding is at their own discretion. They are autonomous institutions and those in the private sector will have their own arrangements they enter into with individuals freely. There is a degree of discretion on those but certainly the agencies I fund and control are required to meet the €25,000 stipend and I understand that they are doing so. \n Deputy Richard Boyd Barrett  First of all, only 30% of the people in question get the Research Ireland €25,000. That increase happened because of a sustained campaign by postgraduate workers and PhD researchers, but huge numbers of them do not get it. It should be a minimum requirement and €25,000 is also, frankly, poverty wages. It is a stipend, of course, so those in receipt of it do not get any of the normal benefits associated with working even though they are workers. In fact, I met with AMLÉ and the Postgraduate Workers Association during the week and one of their biggest demands was to be treated as workers, as is the case in other countries. This Government often goes on about research and development but, compared with their international counterparts, including in Germany and the Netherlands and best practice in the rest of Europe, our researchers, the people who actually do the front-line research and teach people in our higher level education institutions and universities, are treated terribly. Is the Minister not going to change that? \n Deputy James Lawless  One of the first things I changed was the equipment and infrastructure available to them. Just last month, I launched the new Inspire programme. This is a €750 million capital envelope to support research infrastructure and equipment across our higher education institutions. That was a very clear ask of me by the research community and it had long been sought. Coming into the role, it was something I was determined to address as soon as possible, and I was able to secure funding through the national development plan to do that. That is now live. That call is starting and will be opening in the new year. It has been welcomed almost universally across the research sector.  In terms of the PhD stipends, the statistics the Deputy mentioned are fair. I think 3,000 of the 10,000 students are supported by Research Ireland, 1,000 by other public funders, 2,000 by institutional scholarships from the universities directly, and then 4,000 are funded through the private sector or the employer. There are 4,000 supported by the private sector and 3,000 by Research Ireland and, for the 1,000 supported by other public funders, it is within the discretion of those public funders to choose how to use their funds. \n Deputy Richard Boyd Barrett  The very best figure of €25,000 is poverty level. In a cost of living crisis and with the cost of accommodation, it is poverty level and they do not get any of the benefits because it is a stipend, even though in reality it is work. They do not get maternity leave, sick pay or any of the normal benefits workers would receive, even though their counterparts in the Netherlands and Germany get much higher wages and are treated as workers, with a sliding scale of wages. That is good treatment of researchers, whereas ours are living in poverty in the most precarious of situations. I contrast it with the fact that hundreds of millions of euro extra were given out in the research and development tax credit during the budget. The big winners were the big corporations. The research and development tax credit is now up to €1.4 billion, with most of that going to a small number of multinationals. A small portion of that money could lift our PhD researchers out of poverty. Will the Minister address the fact that these PhD researchers who keep our system going are living in poverty? \n Deputy James Lawless  I fully support the research and development tax credit of 35%. In fact, I engaged with the then Minister, Paschal Donohoe, to seek it. I think it is really impactful for the research and innovation and advanced knowledge industries. That ultimately is what creates the resources, jobs and enterprise and, indeed, creates the tax intake that allows us to deliver the public good in other ways. Many of our PhD students may well aspire to work for those same institutions when they complete their education, and many of them may do so in actuality. I would not make any assumptions as to the recipients of that funding. I worked in the sector before I was in political life and a number of smaller institutions, including indigenous ones, also availed of those kinds of supports.  On the stipend itself, my understanding is that the ask was €25,000. The Deputy mentioned the campaign in that regard. A 31% increase was achieved in two years. That is quite a significant increase by any standard. Another point to note is that as the researchers not classed as workers, they do not pay any tax, PRSI or USC. It is entirely tax-free. That is a corollary to bear in mind on that. ",
        "questionType": "oral",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 214. Deputy Richard Boyd Barrett asked the Minister for Further and Higher Education, Research, Innovation and Science whether he will introduce a sectoral minimum wage of at least €30,000 for PhD researchers. [67836/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/dbsect_49",
          "debateSectionId": "dbsect_49",
          "showAs": "Research Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/mul@/dbsect_49.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_214",
        "questionNumber": 214
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Defence  To answer the Deputy's question, I can confirm that no Defence Forces personnel are deployed to Frontex Joint Operations, including Operation Poseidon. Furthermore, the Department of Defence and the Defence Forces hold no records regarding the deployment of any personnel to any Frontex joint operations. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 297. Deputy Richard Boyd Barrett asked the Minister for Defence the position regarding any deployment of Irish personnel (details supplied); the number of personnel, their roles, the duration of their deployment, and the locations of the operations; and if she will make a statement on the matter. [70899/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_312",
          "debateSectionId": "dbsect_312",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_312.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_297",
        "questionNumber": 297
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Defence  I am advised by the military authorities that the specified training facility opened in late-2025. I am informed that no Defence Forces personnel have undergone any training in the specified location during 2025 and none are currently scheduled to undergo training there during 2026. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 298. Deputy Richard Boyd Barrett asked the Minister for Defence if any member of the Defence Forces or other State staff have received or are scheduled to receive training at a location (details supplied); the details of the number of personnel, type of training, and dates training occurred or is planned; and if she will make a statement on the matter. [70901/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_313",
          "debateSectionId": "dbsect_313",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_313.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_298",
        "questionNumber": 298
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 453. Deputy Richard Boyd Barrett asked the Minister for Housing, Local Government and Heritage further to Parliamentary Question No. 550 of 30 September 2025, to list the aspects of the Ballymun regeneration project were uncompleted as of the end of 2013, when the project was \"largely completed,\" and those which remain incomplete today. [71223/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_444",
          "debateSectionId": "dbsect_444",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_444.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_453",
        "questionNumber": 453
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  On the 17 September, as required by section 7 of the Judicial Council Act 2019, I laid the revised personal injury guidelines before the Houses of the Oireachtas. Prior to the laying of the documents, I consulted Ministerial colleagues and the Attorney General in relation to the proposed increase in award amounts contained in the Judicial Council’s proposals.  It is my intention not to bring a Resolution before the Houses seeking the approval of the guidelines at this time. In effect, this means that the amended Guidelines cannot come into effect and the existing Guidelines will remain in place. In addition, I have received Government approval to draft a general scheme of a Bill to amend the Judicial Council Act 2019 to make reviews of the Personal Injuries Guidelines more comprehensive and transparent. The General Scheme of the Bill will be referred for Pre-Legislative Scrutiny in due course. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 460. Deputy Richard Boyd Barrett asked the Minister for Justice, Home Affairs and Migration to provide an update on any changes to the personal injuries guidelines proposed by his Department; and if he will make a statement on the matter. [71236/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_451",
          "debateSectionId": "dbsect_451",
          "showAs": "Personal Injury Claims",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_451.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_460",
        "questionNumber": 460
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 462 and 463 together.  As an EU Member State, Ireland is invited to participate at the Frontex Management Board in a non-voting capacity and can, should it wish to do so, seek to participate in certain training and joint operations co-ordinated by Frontex on behalf of EU Member States.  This generally amounts to Frontex training programmes being provided to relevant members of An Garda Síochána, usually members of the Garda National Immigration Bureau. Training programmes on document authentication, deportation practices and other relevant programmes have been provided to Garda members. I have requested the observations of the Commissioner of An Garda Siochana on the specific details of the Deputy's request and will forward any such details when provided.  I can clarify that Ireland is not involved directly in Frontex land/sea operations, as these activities are carried out by the Frontex Standing Corps in respect of the Schengen external border. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 462. Deputy Richard Boyd Barrett asked the Minister for Justice, Home Affairs and Migration the position regarding any deployment of Irish personnel (details supplied); the number of personnel, their roles, the duration of their deployment, and the locations of the operations; and if he will make a statement on the matter. [70898/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_453",
          "debateSectionId": "dbsect_453",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_453.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_462",
        "questionNumber": 462
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 462 and 463 together.  As an EU Member State, Ireland is invited to participate at the Frontex Management Board in a non-voting capacity and can, should it wish to do so, seek to participate in certain training and joint operations co-ordinated by Frontex on behalf of EU Member States.  This generally amounts to Frontex training programmes being provided to relevant members of An Garda Síochána, usually members of the Garda National Immigration Bureau. Training programmes on document authentication, deportation practices and other relevant programmes have been provided to Garda members. I have requested the observations of the Commissioner of An Garda Siochana on the specific details of the Deputy's request and will forward any such details when provided.  I can clarify that Ireland is not involved directly in Frontex land/sea operations, as these activities are carried out by the Frontex Standing Corps in respect of the Schengen external border. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 463. Deputy Richard Boyd Barrett asked the Minister for Justice, Home Affairs and Migration if any member of An Garda Síochána or other State staff have received or are scheduled to receive training at a location (details supplied); the details of the number of personnel, type of training, and dates training occurred or is planned; and if he will make a statement on the matter. [70900/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_453",
          "debateSectionId": "dbsect_453",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_453.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_463",
        "questionNumber": 463
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 629. Deputy Richard Boyd Barrett asked the Minister for Further and Higher Education, Research, Innovation and Science whether he is aware there are no pathways for professional advancement for emergency service personnel that can be undertaken alongside full-time work in the field (details supplied); and his plans to address this. [71235/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_603",
          "debateSectionId": "dbsect_603",
          "showAs": "Emergency Planning",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_603.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_629",
        "questionNumber": 629
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 31, 32 and 33 together.  The Cabinet Committee on Housing works to ensure a coordinated, cross Government, approach to the implementation of Programme for Government commitments regarding housing policy.  The Programme for Government sets out our ambition to accelerate housing supply, building on progress already achieved, recognising housing as a major social and economic challenge.  Last month, Government launched the new National Housing Plan, Delivering Homes, Building Communities 2025-2030,  which aims to speed up the delivery of new homes and tackle homelessness. The plan targets the construction of 300,000 homes, including 72,000 social homes and 90,000 affordable housing supports. Building on the progress of Housing for All, which saw 137,000 homes delivered since 2021, the new plan will enable the State, public bodies, and the private sector to further play a critical part in accelerating delivery.  The Cabinet Committee on Housing last met on Monday, 10th November, and is scheduled to meet again on Monday, 15th December. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 33. Deputy Richard Boyd Barrett asked the Taoiseach when the Cabinet committee on housing will next meet. [65780/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_67",
          "debateSectionId": "dbsect_67",
          "showAs": "Cabinet Committees",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_67.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_33",
        "questionNumber": 33
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " The Taoiseach  The Department of the Taoiseach does not operate any means-tested services or schemes. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 73. Deputy Richard Boyd Barrett asked the Taoiseach whether contributions from the State or from employers towards the My Future Fund pension scheme will be reckonable as income for the purposes of assessing the eligibility of an individual or household for any means-tested services or schemes operated by his Department. [70029/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_87",
          "debateSectionId": "dbsect_87",
          "showAs": "Pension Provisions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_87.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_73",
        "questionNumber": 73
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  There are no schemes or programmes under the remit of my Department for which a means test applies. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 79. Deputy Richard Boyd Barrett asked the Minister for Foreign Affairs and Trade whether contributions from the State or from employers towards the My Future Fund pension scheme will be reckonable as income for the purposes of assessing the eligibility of an individual or household for any means-tested services or schemes operated by her Department. [70022/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_92",
          "debateSectionId": "dbsect_92",
          "showAs": "Pension Provisions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_92.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_79",
        "questionNumber": 79
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I have no function in relation to means testing. The responsibility for My Future Fund and means testing more broadly lies with my colleague the Minister for Social Protection. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 132. Deputy Richard Boyd Barrett asked the Minister for Climate, Energy and the Environment whether contributions from the State or from employers towards the My Future Fund pension scheme will be reckonable as income for the purposes of assessing the eligibility of an individual or household for any means-tested services or schemes operated by his Department. [70016/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_126",
          "debateSectionId": "dbsect_126",
          "showAs": "Pension Provisions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_126.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_132",
        "questionNumber": 132
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Defence  My Department does not operate any means-tested services or schemes. As such the question of assessing means-test eligibility does not arise.  At this point in time, contributions to the My Future Fund pension scheme in respect of Defence Forces Personnel, Civilian Employees and Civil Servants are not expected to arise, as such personnel are covered by various existing pension schemes. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 167. Deputy Richard Boyd Barrett asked the Minister for Defence whether contributions from the State or from employers towards the My Future Fund pension scheme will be reckonable as income for the purposes of assessing the eligibility of an individual or household for any means-tested services or schemes operated by her Department. [70018/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_157",
          "debateSectionId": "dbsect_157",
          "showAs": "Pension Provisions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_157.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_167",
        "questionNumber": 167
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Transport  The Department of Transport does not currently operate any services or schemes with a means testing component which would fall under the category of this question. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 263. Deputy Richard Boyd Barrett asked the Minister for Transport whether contributions from the State or from employers towards the My Future Fund pension scheme will be reckonable as income for the purposes of assessing the eligibility of an individual or household for any means-tested services or schemes operated by his Department. [70030/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_242",
          "debateSectionId": "dbsect_242",
          "showAs": "Pension Provisions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_242.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_263",
        "questionNumber": 263
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I wish to advise that while the Disabled Drivers and Disabled Passengers Scheme Fuel Grant is under the remit of my Department, my Department is not the direct administrator of any means-tested services or schemes . ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 321. Deputy Richard Boyd Barrett asked the Tánaiste and Minister for Finance whether contributions from the State or from employers towards the My Future Fund pension scheme will be reckonable as income for the purposes of assessing the eligibility of an individual or household for any means-tested services or schemes operated by his Department. [70021/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_287",
          "debateSectionId": "dbsect_287",
          "showAs": "Pension Provisions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_287.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_321",
        "questionNumber": 321
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The Department Public Expenditure; Infrastructure; Public Service Reform and Digitalisation does not any operate means-tested services or schemes. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 339. Deputy Richard Boyd Barrett asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation whether contributions from the State or from employers towards the My Future Fund pension scheme will be reckonable as income for the purposes of assessing the eligibility of an individual or household for any means-tested services or schemes operated by his Department. [70027/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_305",
          "debateSectionId": "dbsect_305",
          "showAs": "Pension Provisions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_305.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_339",
        "questionNumber": 339
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Enterprise, Tourism and Employment  The Department of Enterprise, Tourism and Employment does not operate any means-tested schemes or services.  Therefore, contributions from the State or from employers towards the My Future Fund pension scheme are not assessed by this Department for eligibility purposes. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 375. Deputy Richard Boyd Barrett asked the Minister for Enterprise, Tourism and Employment whether contributions from the State or from employers towards the My Future Fund pension scheme will be reckonable as income for the purposes of assessing the eligibility of an individual or household for any means-tested services or schemes operated by his Department. [70020/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_334",
          "debateSectionId": "dbsect_334",
          "showAs": "Pension Provisions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_334.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_375",
        "questionNumber": 375
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The report of the Scoping Inquiry into Historical Sexual Abuse in Day and Boarding Schools Run by Religious Orders was published on 3rd September 2024 and the Government approved the principal recommendation of the report, to establish a Commission of Investigation.  The report of the Scoping Inquiry made a number of further recommendations, including that the terms of reference of the Commission of Investigation be extended to all day and boarding schools. A high level Inter-Departmental Group (IDG) was convened to examine those recommendations and to prepare draft terms of reference for the Commission of Investigation.  The report of the IDG was published on 8 July 2025 and Government accepted its recommendations. The Minister for Education and Youth announced the establishment of the Commission of Investigation into the Handling of Historical Child Sexual Abuse in Day and Boarding Schools and that Mr Justice Michael MacGrath, a judge of the Court of Appeal, would be appointed as Chair of the Commission, effective from 1st October 2025.  Under the Commissions of Investigation Act 2024, the Commission is independent in the performance of its functions and it is a matter for the Commission to determine the approach it will take to investigating the handing of historic child sexual abuse in schools within its terms of reference. The Commission will have a five-year timeframe in which to complete its investigation and furnish a report to the Minister for Education and Youth.  The Commission is now in its establishment phase and is currently undertaking essential preparatory work. When it is ready to hear from those who may wish to provide it with information, this will be widely advertised.  The Deputy may wish to note that the Chair of the Commission has recently published the following update: www.gov.ie/en/commission-of-investigation-into-the-handling-of-historical-child-sexual-abuse-in-schools/publications/commission-of-investigation-into-the-handling-of-historical-child-sexual-abuse-in-schools/#an-update-from-the-chair-of-the-commission-mr-justice-michael-macgrath-4-december-2025. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 409. Deputy Richard Boyd Barrett asked the Minister for Education and Youth to report on her Department’s Scoping Inquiry into Historical Sexual Abuse in Schools; and the way in which it will address historic abuse perpetrated by both lay and religious teachers. [69511/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_366",
          "debateSectionId": "dbsect_366",
          "showAs": "Child Abuse",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_366.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_409",
        "questionNumber": 409
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  As the Deputy will be aware, a Commission of Investigation has been established by the Government to investigate the handling of historical child sexual abuse in all day and boarding schools. The Chair of the commission was appointed effective from 1st October 2025 and is currently undertaking initial technical and preparatory work on the systems and processes required to support the work of the Commission. The Commission is independent in the performance of its functions and, when it is ready to begin its engagement with survivors of child sexual abuse in schools, this will be widely advertised.  The high level Inter Departmental Group (IDG) that was established to advise government on the recommendations of the Scoping Inquiry, advised in its report that further work needs to be undertaken on any potential redress scheme that may be established in the future. This work will continue in parallel to the work of the Commission, which does not have a role in relation to redress.  It is open to any individual to pursue litigation through the courts and individuals affected by historical sexual abuse can seek independent legal advice in this regard. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 410. Deputy Richard Boyd Barrett asked the Minister for Education and Youth the options individuals affected by historic sexual abuse in schools have for seeking redress from the State or from the relevant school, religious order or patronage body. [69513/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_367",
          "debateSectionId": "dbsect_367",
          "showAs": "Child Abuse",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_367.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_410",
        "questionNumber": 410
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  There are no means tested schemes operated by my Department, therefore the question asked by the Deputy is not currently relevant.  The Deputy should be aware that The National Automatic Enrolment Retirement Savings Authority (NAERSA) will administer the auto-enrolment scheme. Further details are available on www.gov.ie and MyFutureFund.ie. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 435. Deputy Richard Boyd Barrett asked the Minister for Education and Youth whether contributions from the State or from employers towards the My Future Fund pension scheme will be reckonable as income for the purposes of assessing the eligibility of an individual or household for any means-tested services or schemes operated by her Department. [70019/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_388",
          "debateSectionId": "dbsect_388",
          "showAs": "Pension Provisions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_388.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_435",
        "questionNumber": 435
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  Cost Rental is a key element of the Government's strategy to improve affordability in the rental sector and to provide secure, long-term homes for moderate-income households.  The nature of the Cost Rental model means that, unlike differential rents in social housing for low-income households, the rent is not set according to the income of the tenant. The core principle of Cost Rental is that the rents cover the development, management, and maintenance costs of the homes, so that the long-term future of the homes is financially secure, but that rents are not subject to the pressures of the open market.  It is not intended for Cost Rental to overlap with, or replace existing social housing supports for low-income households, which remain a parallel priority for me and the Government. Cost Rental is designed to assist middle-income households who do not qualify for social housing supports such as the Housing Assistance Payment (HAP), but who are facing affordability pressures on the private rental market.  However, in recognition of the potential changes in household circumstances that can occur during a tenancy, Section 34 of the Affordable Housing Act 2021 provides that the HAP may be available to Cost Rental tenants, where they are assessed as eligible for social housing supports, after the Cost Rental tenancy has lasted for more than six months. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 495. Deputy Richard Boyd Barrett asked the Minister for Housing, Local Government and Heritage if he will provide information and clarification about a cost rental housing issue (details supplied); and if he will make a statement on the matter. [69356/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_430",
          "debateSectionId": "dbsect_430",
          "showAs": "Rental Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_430.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_495",
        "questionNumber": 495
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  Approved Housing Bodies (AHBs) play a vital role in the delivery of social housing and are key partners in the Government's National Housing Plan; Delivering Homes, Building Communities 2025 - 2030.  The Approved Housing Bodies Regulatory Authority (AHBRA), which is a State agency under the aegis of my Department, is responsible for the regulation of AHB sector. The AHBRA Governance Standard establishes a set of outcomes that AHBs are required to achieve in relation to the governance and management of their organisations. It relates to responsibility and accountability of the Board in ensuring an AHB complies with all relevant legal, regulatory, funding and statutory obligations. While AHBRA does not adjudicate on individual tenant complaints, they deal with significant concerns regarding the governance or performance of an AHB.  The contact email address for AHBRA is: oireachtasqueries@ahbregulator.ie.  It is important to note that AHBs are independent, not-for-profit organisations and are not bodies under the aegis of my Department. While they may receive some State funding for the provision of housing, they are legally distinct from the State and operate under their own separate constitutions and boards of management.  My Department respects the operational independence of the AHB sector. As independent corporate entities, the day-to-day management of their operations, including their administrative arrangements and communication protocols, is a matter for the individual AHBs themselves. Consequently, AHBs are not statutorily obligated to maintain dedicated communication lines for Oireachtas members or to respond to representations in the same manner as Government Departments or State Agencies.  However, I understand that many AHBs maintain positive working relationships with public representatives and often engage constructively on issues raised on behalf of tenants. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 499. Deputy Richard Boyd Barrett asked the Minister for Housing, Local Government and Heritage if he will, in cooperation with Approved Housing Bodies, establish dedicated phone numbers and email addresses for Oireachtas members to contact AHBs to obtain policy information and to raise constituents’ issues; and if he will make a statement on the matter. [69495/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_434",
          "debateSectionId": "dbsect_434",
          "showAs": "Approved Housing Bodies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_434.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_499",
        "questionNumber": 499
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The information requested is being compiled and will be forwarded to the Deputy in accordance with Standing Orders. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 512. Deputy Richard Boyd Barrett asked the Minister for Housing, Local Government and Heritage whether contributions from the State or from employers towards the My Future Fund pension scheme will be reckonable as income for the purposes of assessing the eligibility of an individual or household for any means-tested services or schemes operated by his Department. [70025/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_447",
          "debateSectionId": "dbsect_447",
          "showAs": "Pension Provisions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_447.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_512",
        "questionNumber": 512
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  It has not been possible to collate the information requested by the Deputy in the time available. I will write to the Deputy directly once the information is to hand. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 695. Deputy Richard Boyd Barrett asked the Minister for Justice, Home Affairs and Migration whether contributions from the State or from employers towards the My Future Fund pension scheme will be reckonable as income for the purposes of assessing the eligibility of an individual or household for any means-tested services or schemes operated by her Department. [70026/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_555",
          "debateSectionId": "dbsect_555",
          "showAs": "Pension Provisions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_555.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_695",
        "questionNumber": 695
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  There are no schemes or programmes under the remit of my Department for which a means test applies, so the question is not applicable. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 740. Deputy Richard Boyd Barrett asked the Minister for Agriculture, Food and the Marine whether contributions from the State or from employers towards the My Future Fund pension scheme will be reckonable as income for the purposes of assessing the eligibility of an individual or household for any means-tested services or schemes operated by his Department. [70014/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_594",
          "debateSectionId": "dbsect_594",
          "showAs": "Agriculture Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_594.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_740",
        "questionNumber": 740
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The Department is currently collating the information requested and a reply will issue directly to the Deputy on this matter as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 802. Deputy Richard Boyd Barrett asked the Minister for Children, Disability and Equality whether contributions from the State or from employers towards the My Future Fund pension scheme will be reckonable as income for the purposes of assessing the eligibility of an individual or household for any means-tested services or schemes operated by her Department. [70015/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_650",
          "debateSectionId": "dbsect_650",
          "showAs": "Pension Provisions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_650.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_802",
        "questionNumber": 802
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  Eligibility for a Medical Card or GP Visit Card is primarily based on a financial assessment which is conducted by the HSE in accordance with the Health Act 1970 (as amended). The HSE assesses each medical and GP visit card application on a qualifying financial threshold. This is the amount of money that an individual can earn a week and still qualify for a card. It is specific to the individual’s own financial circumstances.  Persons aged 70 or older are assessed under medical card income thresholds which are based on gross income. Furthermore, the Deputy may be aware that, since 2015, every individual aged 70 and over has automatic eligibility for a GP visit card. Persons aged 69 and under are assessed under the general means tested medical card or GP visit card thresholds which are based on an applicant’s household income after tax and the deduction of PRSI and the Universal Social Charge. Certain expenses are also taken into account. Detailed guidelines on allowable expenses and incomes not assessed are available at: www.hse.ie/eng/staff/pcrs/medical-card-and-gp-visit-card-assessment-guidelines.pdf.  Under the Nursing Homes Support Scheme Act (2009), responsibility lies with the HSE to consider each individual application and accept it or reject it on the basis of legislative and operational guidelines.  The Nursing Home Support Scheme (NHSS), commonly referred to as 'Fair Deal', is a system of financial support for people who require long-term residential care. The primary legislation underpinning the NHSS is the Nursing Home Support Scheme Act 2009. Participants in the NHSS contribute to the cost of their care according to their means while the State pays the balance of the cost. The Scheme aims to ensure that long-term nursing home care is accessible and affordable for everyone, and that people are cared for in the most appropriate settings.  Participants within the NHSS contribute up to 80% of their income (40% if part of a couple) and 7.5% per annum of the value of their assets (3.75% if part of a couple). The first €36,000 (€72,000 if part of a couple) is excluded from assessment. The value of a person's principal residence is only assessed for contributions for their first three years on the scheme.  Assets assessed include cash assets as well as non-cash assets such as the principal private residence, other property and land, including farmland.  For the purposes of financial assessment, income includes:  • Earnings, including income from farming or business activities.  • Pension income.  • Social welfare benefits/allowances.  • Rental income.  • Income from holding an office or directorship.  • Income from fees, commissions, dividends or interest.  • Any income which you have deprived yourself of in the five years prior to application.  Transferred assets and income, defined as assets or income transferred to another person up to five years before a person's application to the scheme, are also assessed.  The Department of Social Protection has oversight over the My Future Fund Pension Scheme and details are available at: www.gov.ie/en/department-of-social-protection/campaigns/auto-enrolment/. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1048. Deputy Richard Boyd Barrett asked the Minister for Health whether contributions from the State or from employers towards the My Future Fund pension scheme will be reckonable as income for the purposes of assessing the eligibility of an individual or household for any means-tested services or schemes operated by her Department. [70024/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Richard-Boyd-Barrett.D.2011-03-09",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Richard-Boyd-Barrett.D.2011-03-09",
          "showAs": "Richard Boyd Barrett"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_871",
          "debateSectionId": "dbsect_871",
          "showAs": "Pension Provisions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_871.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1048",
        "questionNumber": 1048
      },
      "contextDate": "2025-12-09"
    }
  ]
}