{
  "head": {
    "counts": {
      "questionCount": 3695,
      "resultCount": 3695
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Deputy Claire Kerrane  I raise again the regulations put in place for some time now for childminders and the many issues they are facing. We know about 150 childminders out of 14,000 or 15,000 have registered with Tusla, which is a small amount. Will the review of the regulations take place early in the new year? \n Minister for Children, Disability and Equality (Deputy Norma Foley)  As the Deputy is aware, the phase 1 report of the early years action plan, Shaping the Future, was published yesterday. It makes clear that childminding remains central to the Government's vision for the future of early learning and care and school-age childcare. The national action plan for childminding 2021-2028 sets out a pathway for the extension of regulation and supports to childminders. Implementation of that plan will continue under Shaping the Future, as I said at yesterday’s launch. The regulation of childminding services is critical to the safeguarding of children. I believe we all agree on that.  The childminding-specific regulations, which came into effect in September 2024, are designed to be proportionate and appropriate to the home and family setting in which childminders work. The route to registration under the new regulations requires childminders to undertake a short pre-registration training course as well as meet certain regulatory requirements, including Garda vetting, proof of insurance, first aid certification and child safeguarding training. We are now in a three-year transition period to September 2027, during which childminders are being encouraged and supported to register but registration is not yet mandatory. This phased approach aims to facilitate the largest possible number of childminders to enter the regulated sector and sphere of quality assurance and access Government subsidies, while also recognising the time and supports required for childminders to learn about and prepare for registration.  The Department has committed to undertake a review of the initial implementation of the childminding-specific regulations during the transition period. The review will include consultation with childminders and other stakeholders.  It will provide an important opportunity to learn lessons from initial experiences with the regulations.  As I have said previously, the review will commence in 2026. The timing of the review is crucial. In addition to hearing from childminders who have not yet registered, it is important that the review adequately captures and benefits from the experiences of those who have registered, been through the registration process and operated within the new regulations.  September 2025 marked the end of the first full year since the introduction of the regulations. Those childminders who have registered need time to thoroughly test the regulations in practice. The number of childminders who have registered will impact upon the thoroughness of this testing also. We are in a three-year process from the introduction of the regulations to the end of the transition period. \n Deputy Claire Kerrane  I am sure the Minister will agree that the fact that just 150 childminders to date have registered with Tusla should be causing concern. It is a tiny number compared with the overall number of childminders out there. Childminding Ireland has been excellent in its engagement on issues with the regulations. One such issue I have mentioned to the Minister before is the regulation regarding having a close contact, that is, a person who will be available at all times. That is next to near impossible. Some of the regulations are unworkable, like that one. I have met childminders and been in their homes and the big issue I am coming across relates to the inspections. They are being asked to register with Tusla but they have no idea what those inspections will look like. These are their family homes and, at the very least, they deserve clarity in that regard. Many of us would not like a person coming in and going around our homes. They need clarity as to what the inspection regime will look like. They should get that clarity. \n Deputy Norma Foley  I wish to be clear: childminders are an incredible resource in the entire system. I know the value of them and they are particularly important in rural areas, like my area. We want childminders to be fully engaged but we also need them to be registered because we need regulation. I think the House is unanimous on that. We are within the three-year timeframe now and I have committed to carrying out a review, which will take place in 2026. It will take place as early as I possibly can and as close to quarter 1 as possible. I know that was in the Deputy’s original question. It will be as close to that as possible. It is to give the maximum benefit to those who have registered and those who will register within that period or timeframe. I hear many of the queries the Deputy has raised. I hear them too. There will be inspections, however. While not comparing like for like, anyone who has a family property and runs a bed and breakfast is subject to inspection in order to be registered with Fáilte Ireland. Childminders will have to be subject to inspections, but I hear what the Deputy is saying when it comes to how that is managed and what form the inspection will take. \n Deputy Claire Kerrane  We have to be clear; I have not met a childminder who has an issue with regulations. Most of them have first aid training, insurance and Garda vetting. They have much of it in place for so many years already. That is not the issue. Rather, the issue lies with the inspections. Inspections will form part of the regulations – we all know that – but it is about what those inspections will look like and the rooms in the family home the inspector will go into. These are details that childminders should have before and while they are registering with Tusla. Clarification like that would probably increase the numbers registering with Tusla because they are being asked to register without knowing the ins and outs of what they are signing up to. That is a mistake and it is probably why we only have 150 registered out of tens of thousands of childminders in this State. That should cause concern. I welcome that the Minister said the review will be as close as possible to quarter 1 of 2026. I welcome that because I am not making it up - I hope the Minister takes me at my word - that childminders are leaving the sector. We cannot afford to lose them. We need that review as quickly as possible in the new year. \n Deputy Norma Foley  I absolutely understand the anxiety that is out there. Change is never comfortable and I absolutely accept that. I hear it myself when I engage on the ground. I absolutely accept the Deputy's bona fides in this regard too. She has raised this issue on a number of occasions. I am happy to engage further. I said I would engage prior to the review and I will do that. I will hold the review as close to quarter 1 of 2026 as I can, but I will not give a firm date because things and timeframes can change. It is my intention to do it as early as we possibly can. I want childminders to remain within the system. They are an incredibly valuable resource. Many issues have been raised. For example, the Deputy raised the issue in respect of properties and all of that. I am conscious of that, but it does not fall within my gift. Rather, it falls to the Department of housing but I am also engaging in that regard. I am conscious of the issues that are there. We will begin the review as quickly as possible. We have until 2027 for the complete registration. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 1. Deputy Claire Kerrane asked the Minister for Children, Disability and Equality if she will carry out a review of the regulations for childminders in Q1 of 2026; and if she will make a statement on the matter. [71885/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_3",
          "debateSectionId": "dbsect_3",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_3.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_1",
        "questionNumber": 1
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Deputy Claire Kerrane  I want to give the Minister the opportunity to respond to the HIQA report that has been published recently in relation to Tusla services in Dublin north city. \n Deputy Norma Foley  The HIQA inspection was carried out between 24 June and 30 June 2025. The inspection was a monitoring inspection of the Dublin north child protection and welfare service to assess the progress made on the actions identified to address non-compliance during the previous inspection in May 2024. The inspection identified that significant system risks previously escalated to the Tusla regional chief officer following the April 2024 inspection had not been addressed, and required escalation to the Tusla national office following this inspection. In this inspection, HIQA found that of the five standards assessed for compliance with the national standards for protection and welfare of children, all five standards were deemed to be non-compliant.  The HIQA findings from its inspection of Tusla’s Dublin north city service area have been escalated within the Department. Tusla has submitted an action plan to address all areas outlined for improvement as a matter of urgency. This plan was accepted by HIQA. Since the inspection, Tusla has made significant improvements and rectified almost all areas highlighted by HIQA, with any remaining actions being addressed as a matter of priority. To oversee the implementation of this compliance plan, Tusla has established a child protection and welfare governance implementation group, which meets weekly.  Following the inspection in June 2025, Tusla’s practice assurance and service monitoring team completed a 12-month, full audit of child-in-care referrals categorised as abuse. This was to ensure that screening, assessment and notifications were completed as required.  Tusla has increased the number of social workers at the front door of the service from three to eight and 94% of child protection and welfare referrals in Dublin north city are now screened within two working days. In relation to staffing shortages noted in the inspection report, Tusla is currently reviewing administrative capacity in the service area to ensure staff are being utilised effectively and to identify areas for improvement. The agency continues to move to a more multidisciplinary way of working to address challenges in recruiting a sufficient number of social workers from a very competitive and limited market. Since the inspection, Tusla has also undertaken a review of the governance structure and oversight processes in the service area relating to the receipt and management of referrals and case allocation in accordance with relevant policy, procedures and guidance. \n Deputy Claire Kerrane  I am glad to hear, and obviously the Minister has had it confirmed, that progress has been made in relation to the very serious findings not only in the initial inspection in April 2024 but also when HIQA went in well over a year later in June 2025 and things were not much improved at all. One example HIQA gave was a child with a disability who was non-verbal awaiting completion of a preliminary inquiry and safety planning for over two months. It reminded me, I have to say, of the Grace case - a non-verbal child with a disability waiting two months. Many other examples were given. There was an allegation of physical abuse by a parent against a child and they waited over four weeks. It was found the service was not safe, adequate or timely and where the screening for Tusla is supposed to be 24 hours, it was taking six months. I welcome if it is now two days. The likes of these cases really need to be checked on. We know the service also said things were done that were not done which was found when the inspection follow-up took place. I ask that a really close eye is kept on this. \n Deputy Norma Foley  I accept that there is and was incredible urgency to ensure matters were rectified as a matter of priority. I acknowledge the work of Tusla in that respect. It has increased the number of social workers and 94% of all cases are now seen within two days. There is very strong oversight of the operation. The Dublin north city area team, with support from Tusla’s regional and national teams, has worked diligently in an incredibly challenging environment to make significant improvements and rectify almost all areas highlighted by HIQA. Plans are in place to address any outstanding items and Tusla has been in close communication with HIQA during the implementation of the compliance plan. It is really important that HIQA is kept in the loop. Concerning Tusla more generally, budget 2026 saw Tusla receive increased funding of €165 million to continue providing vital child welfare and family support services, bringing its funding up by 14% to €1.37 billion. \n Deputy Claire Kerrane  When the word \"allocated\" is used, the figures look like a child is allocated to a social worker and therefore getting support but we also know from the HIQA report that some children were allocated to staff on extended statutory leave and had received no contact. We need to be careful in relation to what \"allocated\" actually means and that it is not just that a case is allocated but the case and the child concerned in that case is actually being seen and getting the support needed. There is also a need for consistent oversight. The HIQA report stated, \"It was a significant concern, given that the significant risk’s identified in the April 2024 inspection, that the Self-Assessment Questionnaire (SAQ) returned by the provider in advance of the [June 2025] inspection had deemed the service area to be substantially compliant ...\" Of course, it was not. HIQA was misled. I would like to take the opportunity to acknowledge the very many good social workers but where they do not have the resources, their hands are tied. This should be a lesson to all of us in terms of what can go on in some of these services. Consistent oversight is needed. \n Deputy John McGuinness  The HIQA report on Dublin referred to by the Deputy sets out specifics. The questions raised by parents all over the country are similar to the questions raised in the context of the HIQA report and Tusla. What is the process in Tusla to respond to individual complaints of a serious nature? Is it expected to respond to and deal with issues or is it the case that parents have to go further? I referred to the Jones case recently in the Chamber and I refer to it again now. I referred to a child being cared for in a hotel setting which is unacceptable. All of these things are in breach of proper procedure and standards. Given the reports I have read, Tusla needs a complete reform and overhaul in order to deal with this. I ask the Minister to insist that the CEO of Tusla respond to queries and not make false promises. \n Deputy Norma Foley  To go back to the case highlighted, in the intervening time, it has to be an absolute priority. I welcome the HIQA report because where things are not right, it must be highlighted and rectified. Tusla submitted the action plan which was accepted by HIQA. Since the time of inspection, Tusla has made significant improvements and rectified almost all of the issues, for example, 94% of all cases are now screened within two days. That is really important. I do not take from the challenges and I appreciate that Deputy Kerrane has acknowledged the very strong work ethic of really good people on the ground dealing with very changed, different and challenging circumstances. I acknowledge that work as well. New oversight has been put in place. Resources were referenced by Deputy McGuinness. Resources for Tusla have increased significantly to €1.37 billion, a significant uplift which Tusla itself has acknowledged. In terms of attracting staff, there are new schemes such as earn and learn for social workers and recruitment from abroad. More will be done in this area going forward. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 15. Deputy Claire Kerrane asked the Minister for Children, Disability and Equality if she will respond to a HIQA report published following an inspection of Tusla services in Dublin north city; and if she will make a statement on the matter. [71909/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_12",
          "debateSectionId": "dbsect_12",
          "showAs": "Child and Family Agency",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_12.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_15",
        "questionNumber": 15
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Deputy Claire Kerrane  I want to ask the Minister about the awaited annual reports from the special rapporteur on child protection and when they will be published. The special rapporteur was appointed in February 2023; it is now almost 2026. It is actually coming to the end of her term and we have not seen any report whatsoever unless the Minister has. I would appreciate an update on this. \n Deputy Norma Foley  The special rapporteur on child protection plays an important role in examining and reporting to Government on legal, legislative and litigation-related matters in respect of child protection. The annual reports of the special rapporteur provide important input to the development and review of child protection policy and legislation as well as an objective and independent expert view of the child protection system in Ireland. The reports have been influential in informing policy responses across government to improve the lives of children and young people. The Department has not yet received any annual report or part of any report in respect of the current term of the special rapporteur on child protection. Department officials are engaging on an ongoing basis with the special rapporteur on the matter of the submission of the annual reports prior to the completion of the rapporteur's term of office on 31 January 2026. The special rapporteur has indicated that she expects to submit a report in respect of the period 1 February 2023 to 31 December 2024 imminently. She has indicated that this report will also include her observations and important developments from July 2022 to January 2023, before her term of office commenced. The special rapporteur has also indicated that an annual report in respect of 2025 will be delivered by the end of March 2026. The annual reports of previous special rapporteurs have tended to cover a wide range of policy areas and certain commentary and recommendations relating to several Departments and agencies.  Once submitted, a copy of the report will be provided to all relevant Departments for appropriate review. On completion of this review process, I will submit the report to Cabinet for approval to publish. Once approved, the report will be laid before the Houses of the Oireachtas and published on the Department's website. With the end of the current term of the special rapporteur approaching, I recently secured Cabinet approval to fill the position of the next special rapporteur on child protection for a two-year term. It is my intention to progress the selection of the nominee for the position by way of an open competition run in conjunction with publicjobs.ie as soon as possible. \n Deputy Claire Kerrane  Unless I am missing something, the Minister should have received by now an annual report from somebody who was appointed in February 2023 and who is almost at the end of her three-year term. I would have expected the reports to have been annual.  I take the Minister’s point entirely that the role is extremely important. It is about our child protection system in Ireland. There are few things more important, particularly in the Minister’s Department. Was there an expectation or a timeline concerning annual reports when the position was filled in February 2023? Has she raised the issue of having no annual report as we come to the end of the three-year term? \n Deputy Norma Foley  I thank the Deputy. I want to be clear. I acknowledge the work of the special rapporteur. I have engaged with her and she has made herself available. I acknowledge that there has been considerable engagement between the Department and the special rapporteur on making the reports available in a timely manner. The special rapporteur has indicated that she expects to submit her report for the period February 2023 to December 2024 imminently. She has indicated that the report will include observations on a period in which she was not in office, namely the period from July 2022 to January 2023. She has also indicated that an annual report in respect of 2025 will be delivered by the end of March 2026. \n Deputy Claire Kerrane  I thank the Minister. I appreciate that the special rapporteur is considering the year before she took up her role. It would be great to see the reports from her term in the first instance, but I welcome that the reports are imminent, if that is the case. I find it bizarre that, despite someone being appointed to the role in February 2023, we are now almost at the end of her term and still have not had an annual report. I hope that with the next appointment, we will have annual reports. As the Minister said, this is a really important body of work. I cannot fathom how, despite somebody’s having been appointed in February 2023 in the expectation that they would publish three annual reports, we have not had a single annual report at the end the person’s three-year term. I ask that for the next term, which the Minister has said will be two years, a time frame be put in place so an annual report can be expected annually. \n Deputy Norma Foley  Again, I appreciate the Deputy raising of the question. I accept the word of the special rapporteur that she will present the report for February 2023 to December 2024 imminently and that she will furnish the report for the period July 2022 to January 2023 before the end of her term of office. The annual report for 2025 will be delivered in March 2026. I expect that will be done with priority. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 18. Deputy Claire Kerrane asked the Minister for Children, Disability and Equality when a report by the special rapporteur on child protection will be published; if part of the annual report has been furnished to her; and if she will make a statement on the matter. [71911/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_13",
          "debateSectionId": "dbsect_13",
          "showAs": "Child Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_13.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_18",
        "questionNumber": 18
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Deputy Claire Kerrane  I ask the Minister for a timeframe for the implementation of the recent recommendations that have been published by the national review panel. Given the Kyran Durnin case, which the NRPl examined, it is really important that we have a very clear timeframe for when each of these recommendations must be implemented. \n Deputy Norma Foley  This is very similar to the issue raised by the Deputy's colleague. I reiterate that any case relating to a missing child is of enormous concern to all of us and is a priority for all of us because we know that at the heart of it is a child and child welfare. All of us share in the sense of devastation and loss that a child could be missing for such a long time.  The national review panel delivered its report on the review of the Kyran Durnin case on 29 October. I was always clear that it was my personal wish that the details would only be published if it were not to the detriment of an ongoing Garda investigation and that I would seek the advice and wisdom of the expert legal authority, the Attorney General. On seeking that advice, the Attorney General recommended or determined that it would not be possible at this particular time, given the ongoing Garda investigation, to publish the report in full because it had the potential to prejudice any future potential prosecutions. He has also said that it may be possible to publish the report at a future date but that would obviously be on the advice of the Attorney General and the DPP.  What has been agreed on foot of the Attorney General's advice is that the recommendations in the report would be published. As I have said, they were published on 3 December. The recommendations fall to a number of different Departments and agencies to implement. As Deputy Ó Murchú outlined, they involve: the tracking of pupil movements North and South; review of GDPR; guidance to social workers; development of procedures for wait-list management; development of a framework for quality assurance, monitoring and review, and outcome measurement for family support provider agencies; and review of the Tusla and Garda Síochána protocol.  The Department is engaging with all the relevant Departments and Government agencies, including Tusla, on the implementation of the recommendations relevant to them. I can confirm to the House that Tusla has already commenced the process to implement the recommendations that come under its remit. I am clear that the implementation of the recommendations should be completed as soon as possible and that has been advised to all the Departments and agencies involved. \n Deputy Claire Kerrane  With a number of Departments and agencies involved, it is really important that one person has oversight for ensuring that each of the recommendations is implemented as quickly as possible. I imagine that recommendations such as guidance, reviewing the protocol between the Garda and Tusla, and reviews of GDPR should all be initiated very quickly and some of them will be able to be implemented very quickly. Given the nature of the review panel's work, it is really important that we have a clear timeline for each of the Departments and the agencies involved so they are working to a specific timeframe to complete the work that needs to be done. That would be really important given we are going to see further recommendations from further reviews of the NRP. That makes it really important that the ones we have in front of us now are implemented as quickly as possible. It goes without saying that is exactly what the Minister wants. When a number of agencies and Departments are involved, a timeframe would be helpful. \n Deputy Norma Foley  The recommendations were issued on 3 December. There has been a genuine willingness from all the Departments and agencies to move with haste and priority, but also to do it right. I chaired a cross-departmental meeting on moving forward with the sharing of information and ensuring that this duty to co-operate can very much come into being. Outside of the work under way in the Department, that interdepartmental group is seeking opportunities for the sharing of information that one Department has and where there might be gaps in another Department.  I have brought forward the Bill to update and modernise the Child Care Act. Some of the key provisions will include the introduction of the duty to co-operate with all the relevant bodies. It will also include a clear basis for the sharing of information between agencies and organisations where they work together on child protection and child welfare matters. I will also bring forward the amendment, which is important from the NRP point of view, to put it on a statutory footing. All of that is being done as a matter of priority. \n Deputy Claire Kerrane  I appreciate all of that and I thank the Minister for those updates. It would be really helpful for her to provide to the Departments and agencies involved a time frame to ensure that each of the recommendations made by the national review panel is met. As I said, we will get further recommendations and more work is needed in these areas. That is why it is so important to have a clear and specific timeframe that the Department and agencies, particularly Tusla, are working towards. These recommendations need to be implemented as quickly as possible; nobody disagrees with that. As the Minister in this Department, she should provide them with a time frame for this really important work. \n Deputy Norma Foley  These recommendations were published on 3 December. From a legislative point of view, it is being given priority through my Department's work on the child care (amendment) Bill, which we move very rapidly through the House. I know that there will be very strong co-operation forthcoming from the Deputy and right across the House. We will continue to engage with all the Government agencies and Departments involved. Implementation of some of the recommendations is well advanced. In particular I am conscious of the Department of Education and Youth's North-South initiative because I have engaged in that myself. We will continue to ensure that these will be delivered as a matter of priority. It is important to recognise that some of the recommendations may be more complex than others but they will all be given priority. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 32. Deputy Claire Kerrane asked the Minister for Children, Disability and Equality the timeframe for implementation for each of the recommendations made by the national review panel following its examination of the case of a child (details supplied); and if she will make a statement on the matter.  [71912/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_15",
          "debateSectionId": "dbsect_15",
          "showAs": "Child Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_15.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_32",
        "questionNumber": 32
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 60. Deputy Claire Kerrane asked the Minister for Children, Disability and Equality the way in which she will urgently build childcare capacity; and if she will make a statement on the matter. [71913/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_103",
          "debateSectionId": "dbsect_103",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_103.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_60",
        "questionNumber": 60
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Shaping the Future: the Early Years Action Plan, Phase 1 Report was published on 17th December 2025.  Shaping the Future sets out the next steps in delivery of the key commitments in the Programme for Government to improve affordability, quality, and access in early learning and care (ELC) and school-age childcare (SAC). While the Action Plan is ambitious in outlook and it will take the full lifetime of the Government to complete, the issues it addresses are affecting families, providers and educators here and now. There is a need for rapid action. That is why we are using a phased approach.  This publication sets out Phase 1 actions, which will be carried out in 2026 using existing policy tools. In fact, progress has already been made. In September 2025 maximum fee caps were extended to all Partner Services in Core Funding – an important step towards the ambition of reducing parental fees to a maximum of €200 per month over the lifetime of this Government.  2026 actions on affordability will include further reduction in some of the highest fees paid by parents by lowering the maximum fees that Core Funding Partner Services can charge. In addition, from autumn 2026 we will reduce fees for lower-income families through the National Childcare Scheme, to ensure that families with incomes below the relative income poverty line receive the maximum subsidies.  Phase 1 actions will include increasing supply through investment in State-led ELC and SAC services as well as co-funding the expansion of existing providers. The allocation for Core Funding will be increased to €482m for programme year 2026-27 (an increase of up to 23%) to support capacity growth in the sector and sustainability of providers, and to support providers to meet the costs of increases in staff minimum wage rates through a possible 2026 round of negotiations for new Employment Regulation Orders.  To enhance the quality of provision, during 2026 comprehensive regulations will be introduced for School-Age Childcare services as part of a wider revision of regulations.  Phase 2 actions will be undertaken from 2027 to 2029. While we need to make progress quickly, the actions we take must be sustainable, underpinned by public consultation and research, and delivered in a way that supports families, the workforce and service providers. That is why a broad public consultation will be undertaken, in line with the Programme for Government commitment, to inform the identification of further actions. Phase 2 actions will be published later in 2026.  There is a lot to be done, but I look forward to working with all stakeholders to move towards an ELC and SAC system that is of high quality, affordable and accessible for all, supporting children, families, educators, and providers. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 87. Deputy Claire Kerrane asked the Minister for Children, Disability and Equality when the action plan on childcare will be published; and if she will make a statement on the matter. [71910/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_131",
          "debateSectionId": "dbsect_131",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_131.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_87",
        "questionNumber": 87
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  I am aware that eligibility for the State Pension (Contributory) is an area of genuine concern for foster carers.  Eligibility for the State Pension (Contributory) is a matter which falls under the remit of my colleague, the Minister for Social Protection. The Department of Social Protection has in place a number of schemes for family carers that may already be of benefit to foster carers where they meet the criteria.  The Programme for Government contains a commitment for the Department of Social Protection to develop a pension solution for foster carers in recognition of the enormous contribution they make to vulnerable children in our society, and to acknowledge their long-term commitment and to ensure that they are supported and valued after their fostering years. Officials from this Department will engage with their counterparts in the Department of Social Protection to ensure this commitment is realised.  Additionally, the Government has committed to the development of a national plan on alternative care, to include a short-term action plan addressing current issues in accessing appropriate care places, and a longer-term vision for how the care system will operate into the future. In delivering on this commitment, work is underway within the Department on the development of a National Policy Framework for Alternative Care. This Framework will articulate the collective vision and responsibilities of the State to children and their families in the alternative care system. Development of the Framework will be informed by evidence and robust consultation with stakeholders, including foster carers and their representative bodies.  I will continue to work closely with Minister Calleary and Government colleagues regarding the progression of pension provision for foster carers. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 629. Deputy Claire Kerrane asked the Minister for Children, Disability and Equality to provide an update on the introduction of a State pension for foster carers; and if she will make a statement on the matter. [71886/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_602",
          "debateSectionId": "dbsect_602",
          "showAs": "State Pensions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_602.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_629",
        "questionNumber": 629
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school to which the Deputy refers to was approved funding under the Additional School Accommodation (ASA) Scheme 2024: Provision of Modular Accommodation under the Department’s Special Education Needs (SEN) Reconfiguration and Modular Accommodation programme for reconfiguration works to provide 2 X SEN.  As the proposed annex building is not viable, the reconfiguration works were placed on hold until a more viable solution could be devised.  The DEY are currently working closely with the Project Management Team who are overseeing this project and a solution is currently in design stage.  The Project Management team are currently carrying out surveys in relation to this proposed solution & are also in contact with the Local Authority to ensure further progress. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 485. Deputy Claire Kerrane asked the Minister for Education and Youth further to Parliamentary Question No. 406 of 21 October 2025, the progress made to reconfigure an annex building to provide two special education classrooms at a school (details supplied) so children are not walking off site daily to access a classroom elsewhere (in a domestic dwelling); to meet enrolment needs for September 2026, given the school caters for all of Connacht; and give certainty to parents and the school community; and if she will make a statement on the matter. [72182/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_376",
          "debateSectionId": "dbsect_376",
          "showAs": "School Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_376.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_485",
        "questionNumber": 485
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  Under the Assistive Technology Scheme, as set out in my Department’s Circular 0010/2013, funding is provided to schools towards the cost of computers and specialist equipment, which are required for educational purposes.  All equipment provided under this scheme supports children with more complex disabilities who, in order to access the school curriculum, require essential specialist equipment. It must be clear that the existing I.T. equipment in the school is insufficient to meet the child's needs. Where necessary, schools may also purchase new or additional equipment or software for students from normal school resources or funds.  The Assistive Technology Scheme, provided by my department, supplements the overall funding approach for digital technology and equipment to support children for education purposes. All equipment provided under this scheme supports children who require essential specialist equipment to access the school curriculum. For children with more complex disabilities who require such equipment to access the school curriculum, which they do not already have or which cannot be provided for them through the schools' existing provisions, schools can apply for this equipment under the terms of the Assistive Technology Scheme.  To do this, schools make applications directly to their local Special Educational Needs Organiser (SENO), providing details of the student’s special educational needs or disability, including details of the approach taken by the school in making relevant interventions.  To qualify for equipment under the Assistive Technology Scheme, a student must have been diagnosed with a physical or communicative disability and must also have a recommendation in a professional assessment that the equipment is essential to allow the student to access the curriculum.  SENOs will review the application, and professional reports provided in support of same, to establish whether the criteria of the scheme have been met. They will then make a recommendation to my department as to whether or not assistive technology is required; and based on this recommendation, my department will decide on the level of grant, if any, to be provided.  The level of funding granted depends on the type of equipment requested and the information submitted by the school in support of the application, such as quotes and other documentation. In the vast majority of Assistive Technology applications, the Department sanctions sufficient funding to cover the cost of the required equipment.  Where an Assistive Technology grant has been sanctioned, but the school wishes to appeal the amount of the grant, or the specific equipment for which sanction has been granted, the can do so using the following appeal form: assets.gov.ie/static/documents/assistive-technology-appeal-by-school-form.pdf. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 494. Deputy Claire Kerrane asked the Minister for Education and Youth if her Department fully covers the cost of assistive technology advised for students in schools. [72274/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_385",
          "debateSectionId": "dbsect_385",
          "showAs": "Education Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_385.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_494",
        "questionNumber": 494
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The Vacant Property Refurbishment Grant introduced in July 2022, provides a grant of up to €50,000 for the refurbishment of vacant properties for occupation as a principal private residence and for properties which will be made available for rent. A top-up grant of up to €20,000 is available where the property is confirmed to be derelict, bringing the total grant available for a derelict property up to a maximum of €70,000. In order to qualify for the grant, the property must be vacant for two years or more at the time of application.  This grant may be used in combination with S.I. No. 75/2022 - Planning and Development Act (Exempted Development) Regulations 2022 which provides an exemption from the requirement for planning permission for the conversion of certain types of vacant commercial property into residential use, such as ‘living over the shop’ accommodation, up to a maximum of 9 residential units. The Regulations, which were first extended in 2022 under SI 75/2022 to include an exemption for the conversion of vacant pubs, have now been extended to the end of 2028. Up to the end of 2024, local authorities received 1,457 notifications from developers intending to avail of the exemptions. If acted on, this would result in 3,429 new homes across the Country. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 599. Deputy Claire Kerrane asked the Minister for Housing, Local Government and Heritage if there are any financial supports available to a person seeking to buy a large derelict building in a town and develop apartments, to provide a number of apartments as private rented accommodation in the town; and if he will make a statement on the matter. [72183/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_471",
          "debateSectionId": "dbsect_471",
          "showAs": "Derelict Sites",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_471.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_599",
        "questionNumber": 599
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The Government is firmly committed to ratification of the Second Optional Protocol to the UNCRC, and work is ongoing to ratify the protocol as soon as possible.  In Irish treaty practice, the State must be in a position to meet the obligations it assumes under the terms of an international agreement from the moment it enters into force. Often it will not be possible for the State to meet these obligations without first taking steps required by domestic law, or otherwise, enabling it to do so.  As work towards ratification of the protocol continues, the State is obliged to ensure that all legislative provisions are in place for it to meet these obligations. Considering this, the Department is seeking the advice of the Office of the Attorney General. As soon as we can proceed with ratification of the Second Optional Protocol, we will do so without delay. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 818. Deputy Claire Kerrane asked the Minister for Children, Disability and Equality when Ireland will ratify the UNCRC second optional protocol; and if she will make a statement on the matter. [71521/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_643",
          "debateSectionId": "dbsect_643",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_643.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_818",
        "questionNumber": 818
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The State is not the employer of staff in the sector therefore neither I nor the Department can set wage levels or determine working conditions for staff in the sector.  However, financial reporting is a key feature of Core Funding, as recommended by the Expert Group in their report Partnership for the Public Good.  Partner Services, those services signed up to Core Funding, are required to provide validated financial returns to the Department for each programme year that they participate in. As part of a transitional arrangement, the reporting requirements for the first two years of the scheme, 2022/2023 and 2023/2024, were reduced to require just an income and expenditure report. These reports were submitted by registered accountants.  Apteligen Limited were awarded a contract for the analysis of the first two years financial data collected through Core Funding in September 2025. Work is underway, and the project is scheduled to be completed in the first quarter of 2026 with a report to be published thereafter. As with any new system or reporting requirement, some user errors are to be expected. This project therefore includes a robust process of data cleaning. The Department are not be in a position to provide an accurate response to the information requested until this cleaning process has concluded.  A chart of accounts has been prepared for the purpose of this financial reporting to ensure that reporting is consistent across all Partner Services. This greatly improves the quality of analysis that can be carried out on the data. The nominal codes are updated annually to reflect feedback from Partner Services and accountants as well as any changes to the income or expenditure of services.  I would like to take this opportunity to clarify that one of the codes referenced – 4008: Gross wages/salaries directors – has been included in the chart of accounts for the third year of reporting, which are due to be collected in the first quarter of 2026.  From this submission and thereafter, Partner Services are required to submit a full trial balance via a registered accountant. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 834. Deputy Claire Kerrane asked the Minister for Children, Disability and Equality to provide gross wage amounts for employees (details supplied) in early years, as collected through the financial returns. [71857/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_658",
          "debateSectionId": "dbsect_658",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_658.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_834",
        "questionNumber": 834
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Under the Core Funding Partner Service Funding Agreement, Partner Services can choose how to spend their Core Funding grant in accordance with the approved areas of expenditure outlined in the Funding Agreement.  Approved areas of Expenditure include:  • Costs relating to staffing of Partner Services in the provision of early learning and childcare, which may include non-contact time in preparation and review of early learning and childcare provision;  • Costs of staff/owner participation in Continuing Professional Development relating to early learning and childcare including cost of cover for absence due to such participation;  • Costs relating to the administration of the Partner Service including the administration of schemes funded by the Department;  • Overheads pertaining to running of the early learning and childcare service including rent, rates, utilities and insurance, and;  • Any other operational costs, excluding capital costs, which may reasonably be asserted to enhance the quality of early learning and childcare service provision.  The Staff Funding Additional Contribution is a new funding element for the 2025/26 programme year that can only be used towards staff pay and conditions. The Staff Funding Additional Contribution cannot be spent on non-staff overheads, operational costs or other non-staff-related purposes.  For the avoidance of doubt, ineligible expenditure allowed under the Core Funding includes:  • Capital costs, and;  • Any other costs which may not reasonably be asserted to enhance the quality of early learning and childcare service provision.  I am required to ensure all Exchequer funding is managed in a clear and transparent manner. This includes a requirement to ensure robust and transparent Financial Reporting structures are in place.  Due to these requirements, and as part of their agreement with the Department of Children, Disability and Equality, Core Funding Partner Services are required to submit comprehensive and validated financial returns.  All financial reports must be provided to the Department by being uploaded to the Core Funding Contractual Requirements Reporting System no later than 6 months after the end of the given programme year. All financial reports submitted to the Department must be validated and submitted by a Registered Accountant. Failure to do so may mean the withholding of funding until the report is submitted.  For the 2024/25 Programme Year onwards, services must submit a Trial Balance.  The financial reporting structures in place ensure that providers are able to sufficiently demonstrate that their Core Funding allocation is spent on approved areas of expenditure. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 835. Deputy Claire Kerrane asked the Minister for Children, Disability and Equality the approved areas of expenditure for core funding; and if she is satisfied that all core funding is being spent on the approved areas of expenditure. [71858/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_659",
          "debateSectionId": "dbsect_659",
          "showAs": "Departmental Expenditure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_659.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_835",
        "questionNumber": 835
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1110. Deputy Claire Kerrane asked the Minister for Health the considerations when providing a buggy for children with cerebral palsy; and if it is possible for parents to top-up the HSE contribution and purchase an alternative model. [72373/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_924",
          "debateSectionId": "dbsect_924",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_924.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1110",
        "questionNumber": 1110
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The major building project for the school referred to by the Deputy is now at an advanced stage of Architectural Planning - Stage 2(b) - Detailed Design, which includes the application for statutory approvals, which have been secured, and the preparation of tender documents.  My department received the Stage 2b submission report from the Design Team earlier this year in March 2025. My department commenced a detailed review of this report by the multi disciplinary team and comments were issued to the Design Team requesting clarification. The Design Team have addressed these comments and the responses to those queries are currently under ongoing detailed review.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 149. Deputy Claire Kerrane asked the Minister for Education and Youth to provide an update on the progress of a project (details supplied);  when it is expected to move beyond the stage 2b process; and if she will make a statement on the matter. [69001/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_172",
          "debateSectionId": "dbsect_172",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_172.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_149",
        "questionNumber": 149
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The major building project for the school referred to by the Deputy is now at an advanced stage of Architectural Planning - Stage 2(b) - Detailed Design, which includes the application for statutory approvals, which have been secured, and the preparation of tender documents.  My department received the Stage 2b submission report from the Design Team earlier this year in March 2025. My department commenced a detailed review of this report by the multi disciplinary team and comments were issued to the Design Team requesting clarification. The Design Team have addressed these comments and the responses to those queries are currently under ongoing detailed review.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 157. Deputy Claire Kerrane asked the Minister for Education and Youth to provide an update on an application (details supplied); and if she will make a statement on the matter. [69000/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_180",
          "debateSectionId": "dbsect_180",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_180.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_157",
        "questionNumber": 157
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  In line with the programme for government, the Education Therapy Service (ETS) has been established as an additional support for children and young people in their school environment. It is not a replacement for existing children’s services from which provision will continue. It will commence in specials schools and rollout in time to special classes and mainstream school.  It is anticipated that the service will commence in 45 special schools at a later stage in the 2025/26 school year. Further roll out of the service will occur on a phased basis with a wider roll-out in special schools commencing in the 2026/27 school year.  As referenced, on the 28th November the recruitment campaign for therapists to the new ETS was launched. This campaign will initially see 90 occupational therapists and speech and language therapists consisting of staff and senior grades join their therapy team.  In line with the phased approach for implementation, the current recruitment campaign has included the following counties: Carlow, Cork, Dublin, Galway, Kildare, Kilkenny, Laois, Limerick, Longford, Louth, Meath, Monaghan, Tipperary, Westmeath, Wexford & Wicklow. This ensures that supports are provided to schools aligning with the current National Council for Special Education (NCSE) regional structure for therapy. As this is a national service which will grow and expand to include all schools. It is envisioned that there will be rolling recruitment campaign commencing in 2026 covering all counties to meet the therapy needs of the children in the school system. It is envisioned that further recruitment campaigns will also include additional therapy grades including therapy managers, clinical specialists and therapy assistants.  In addition, the NCSE have been developing an education -based therapy support service known as the previously as the Education Therapy Supports Service (ETSS), which will now be subsumed into the ETS. This service provides two strands of support to all schools: Sustained In-School Therapy and Regional Therapy Supports.  Sustained in-school support (SIT) is provided to schools for a defined period of 18-24 months in line with the School Inclusion Model. 22 schools in the Eastern region and 28 schools in the Western region are receiving support under SIT in the 2025/2026 school year.  Regional therapy support provides Teacher Professional Learning (TPL) with follow on/implementation support by NCSE therapists. The focus of this support is to build the capacity of schools and to embed the learning from TPL into their teaching practice, through In-school coaching and co-facilitation of interventions, strategies and resources. Regional Therapy Supports are available nationally for the 2025/2026 school year. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 193. Deputy Claire Kerrane asked the Minister for Education and Youth the reason the entire north 2est of Ireland-Sligo, Mayo Donegal, Roscommon Leitrim and Cavan has been excluded in the current NCSE recruitment drive for senior and staff grade occupational therapists and speech and language therapists for the national educational therapy service (ETS) in special schools, with the plan for it to be extended to special classes in mainstream schools; if this to be a phased roll out; when will the OTs and SLTs be recruited for Sligo, Mayo, Donegal, Roscommon, Leitrim and Cavan; and if she will make a statement on the matter. [70556/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_157",
          "debateSectionId": "dbsect_157",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_157.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_193",
        "questionNumber": 193
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Neither my Department nor the State Examinations Commission (SEC) have any role in relation to the setting, running and marking of mock examinations and consequently no role in mock examination fees. Decisions to hold mock examinations are taken by individual schools and the format of these examinations and the fees involved is a matter for each individual school. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 195. Deputy Claire Kerrane asked the Minister for Education and Youth her views on the financial challenges faced by some parents regarding the payment of mock examination fees at a school (details supplied); and if she will make a statement on the matter. [70570/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_159",
          "debateSectionId": "dbsect_159",
          "showAs": "School Costs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_159.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_195",
        "questionNumber": 195
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The Department of Finance has overall responsibility for policy matters in relation to insurance, including flood insurance.  The Department of Finance engages with the insurance industry on all aspects of insurance reform, including flood cover issues. These matters are a priority for the Government and efforts continue to be made to encourage a responsive approach to the provision of flood insurance from the insurance industry. The Minister of State at the Department of Finance with special responsibility for Financial Services, Credit Unions and Insurance has met with the CEOs of the major insurers where he strongly emphasised to industry the need to take a reasonable approach to the provision of cover where properties are proven to be in low risk areas, including after investment in flood defences.  The OPW has a role to assist insurance companies to take into account the protection provided by completed flood defence schemes. In this regard, the OPW has a Memorandum of Understanding (MoU) with Insurance Ireland, the representative body of the insurance industry. The MoU sets out principles of how the two organisations work together to ensure that appropriate and relevant information on these completed schemes is provided to insurers to facilitate, to the greatest extent possible, the availability to the public of insurance against the risk of flooding.  While the MoU does not guarantee the availability of insurance, Insurance Ireland members have committed to take into account all information provided by the OPW when assessing exposure to flood risk within these protected areas. The decision on whether to offer insurance, the level of premiums charged and the policy terms applied are matters for individual insurers. Insurance companies make commercial decisions on the provision of insurance cover based on their assessment of the risks they would be accepting on a case-by-case basis. Neither the Minister for Finance or the Central Bank of Ireland can direct the provision or pricing of insurance products, in accordance with the EU framework for insurance (Solvency II Directive).  Insurance Ireland operates an Insurance Information Service for those who have queries, complaints or difficulties in relation to obtaining insurance, which can be contacted at 01 676 1914 or feedback@insuranceireland.eu. Similarly, Brokers Ireland, the representative body for insurance brokers in Ireland, has access to a wide range of providers and products, and can offer advice for customers when sourcing cover. Brokers Ireland can be reached at 01 661 3067. Furthermore, where an individual considers that they have been treated unfairly, they have the option of making a complaint to the Financial Services and Pensions Ombudsman (FSPO). The FSPO can be contacted either by email at info@fspo.ie or by telephone at 01 567 7000. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 335. Deputy Claire Kerrane asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if he will engage with insurance companies who refuse to give the residents of Derrymullen, Ballinasloe, County Galway flood cover, given that there has been no flooding in this area since the erection of the flood wall in 2011. [69582/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_301",
          "debateSectionId": "dbsect_301",
          "showAs": "Insurance Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_301.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_335",
        "questionNumber": 335
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I wish to advise the Deputy that the Tetra communications network was designed to provide a reliable and robust emergency network for the State's emergency personnel with the widest possible coverage. The coverage provided by the Tetra Network is far in excess of the sum of the commercial mobile networks in Ireland.  In order to provide maximum coverage and resilience, all areas in the country are covered by overlapping service from at least two base stations with battery backup in place for key sites.  During Storm Éowyn some base stations experienced power outages and automatically switched over to operate on battery backups. Due to the protracted nature of the power cuts, the batteries became depleted at a large number of sites in the west and north-west of the country, which resulted in a loss of service in parts of those geographic areas. Service for the rest of the country did not see the same impact.  A number of measures have since been taken to increase resilience at the base station sites and to reduce the risk of disruption due to future adverse weather events.  A preventative maintenance programme has been completed at all Tetra base station sites which included verification that battery backup units are performing as designed. Tetra Ireland has also sourced additional generator units that can be deployed quickly to maintain service in the event of another sustained power outage. A number of base station sites in the West and Northwest have also been upgraded to allow for both additional battery and generator capacity.  A new emergency response protocol has been established by Tetra Ireland and ESB Networks whereby power outages at Tetra Base Station sites will be prioritised for rapid power restoration in the event of an outage. This protocol was executed successfully during and after Storm Amy in October of this year. Additionally, a number of satellite units have been procured to provide service in the event of total loss of telecommunications services in the future. These units will be available following extensive integration testing with the existing network.  With regards to the future, the Tetra Network will continue to provide connectivity to the emergency services at least in the medium term but officials in my Department are investigating what other technologies may be suitable in the future. A number of trials were carried out earlier this year using a combination of private 5G networks and satellite backhaul. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 336. Deputy Claire Kerrane asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the work that has been done to ensure greater access to Tetra across Galway and Roscommon; the status of the review into Tetra; if it is planned to be replaced; if so, the technology that will be used; and if he will make a statement on the matter. [69686/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_302",
          "debateSectionId": "dbsect_302",
          "showAs": "Information and Communications Technology",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_302.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_336",
        "questionNumber": 336
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The project referred to by the Deputy has been devolved for delivery to the Laois Offaly Education Training Board (LOETB).  The project is currently at Stage 2A of the architectural design process. In Quarter 2 2025, a Stage 2A report was submitted to the Department for review and is undergoing an intensive review from both a technical and cost perspective in accordance with the requirements of the Public Spending Code.  LOETB have proposed an option to acquire an alternative site for this project. This proposal has been reviewed by the Department and following further engagement, LOETB are now finalising cost comparisons on the two sites.  In July, the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my Department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  All Government Departments are expected to publish their sectoral NDP Implementation Plans shortly. My Department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 390. Deputy Claire Kerrane asked the Minister for Education and Youth when a decision will be made regarding a school (details supplied); and if she will make a statement on the matter. [69179/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_350",
          "debateSectionId": "dbsect_350",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_350.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_390",
        "questionNumber": 390
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The Apply to School pilot was introduced to simplify and improve the admissions process for post-primary schools in five pilot areas. This new system provides families, for the first time, with a single online application and introduces synchronised, streamlined timelines for schools to manage admissions, issue offers, and update a central database to record accepted places.  I wish to advise the Deputy that schools continue to operate in line with the Education (Admission to Schools) Act 2018 and their own Admissions Policies. Under this process, some applicants may receive more than one offer, while others may not receive an offer until later in the process. The centralised system helps identify duplicate acceptances and supports families in achieving certainty on school places earlier.  As part of this process, a second round of offers issued on 4 December. This ensures that any places that become available after the first round are allocated fairly and that every child is considered.  The Deputy will appreciate that there can often be significant overlap across areas and schools, and the nature of the admissions processes is quite complex. As a result, there can be multiple iterations, where applicants may accept a place but subsequently be offered and accept a place at a second school, freeing up capacity at the first school accepted. In that context, it may take some time for my department to fully review the availability of post-primary school places while the admissions process continues to progress.  I want to reassure parents that there are sufficient first-year places in each pilot area for local children seeking a place. The Department will closely monitor the outcomes of the admissions process to ensure that all local children are accommodated and to identify any required solutions if necessary. The Apply to School pilot will provide early clarity and robust data to support this commitment.  As referred by the Deputy, common application systems are in place in a small number of specific areas, such as at post primary level in Limerick and Ennis, and for primary special classes in Dublin 15. There are a lot of benefits to the system, particularly in terms of identifying capacity pressures at an early point and avoiding duplication on waiting lists. My department is taking lessons from the implementation of these systems and feedback from the ongoing Apply to School pilot. This will inform development towards the Programme for Government commitment for a national system.  I can assure the Deputy department officials will continue to work in consultation with stakeholders to develop an evidence-informed, tested, equitable solution for a nationwide Common Application System and to deliver this in an incremental way that ensures the admissions process safeguards the best interest of children. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 418. Deputy Claire Kerrane asked the Minister for Education and Youth if she is aware of the issues with the pilot secondary school enrolment scheme in Tullamore that has seen some students offered multiple places while other students have been offered none; the reforms she plans to make to this scheme in light of these failings; the reason her Department did not follow the model in Limerick; and if she will make a statement on the matter. [69760/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_372",
          "debateSectionId": "dbsect_372",
          "showAs": "School Admissions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_372.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_418",
        "questionNumber": 418
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The Vacant Property Refurbishment Grant, introduced in July 2022, provides a grant of up to €50,000 for the refurbishment of vacant properties for occupation as a principal private residence and for properties which will be made available for rent. A top-up grant of up to €20,000 is available where the property is confirmed to be derelict, bringing the total grant available for a derelict property up to a maximum of €70,000. In order to qualify for the grant, the property must be vacant for two years or more at the time of application.  The grant is currently available for the refurbishment of apartments, where scheme conditions are met. Information on the scheme and conditions is available for applicants on my Department's website at www.gov.ie/en/department-of-housing-local-government-and-heritage/services/vacant-property-refurbishment-grant/. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 501. Deputy Claire Kerrane asked the Minister for Housing, Local Government and Heritage if the vacant properties grant applies to apartments; the additional supports which are available to those seeking to do up a derelict apartment; and if he will make a statement on the matter. [69644/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_436",
          "debateSectionId": "dbsect_436",
          "showAs": "Vacant Properties",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_436.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_501",
        "questionNumber": 501
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  Illness benefit is the primary short term income support provided by my Department to those who are unable to work due to illness of any type and who are covered by social insurance. Eligibility for illness benefit depends on the person’s PRSI record and class. The person must have made the required number of contributions under class A, E, H or P to qualify. In general, self-employed people make PRSI contributions at class S which does not provide entitlement to illness benefit.  Self-employed contributors pay class S PRSI at a rate of 4.2%. This is 11.25 percentage points lower than the combined employer and employee contribution of 15.45% made in respect of employed contributors. However, self-employed contributors do have access to over 90% of benefits available to employed contributors.  The only benefits that class S PRSI does not provide access to are health and safety benefit, illness benefit and occupational injuries benefits. Self-employed contributors who are ill may qualify for invalidity pension.  In circumstances where people are ill but do not qualify for illness benefit or invalidity pension, my Department provides means tested supports under the disability allowance scheme and the supplementary welfare allowance scheme. An additional needs payment may also be available to people who have expenses that they cannot pay from their weekly income.  The Programme for Government includes an action to explore the option of giving self-employed workers access to illness benefit by means of making a higher PRSI contribution. My Department has commenced work in this regard.  Any changes to the current system would need to be considered in an overall policy and budgetary context.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 570. Deputy Claire Kerrane asked the Minister for Social Protection the reason self-employed workers who pay PRSI, when they get sick, have no access to income supports, despite working and paying taxes; if this anomaly will be examined; if illness benefit will be extended to the self-employed; and if he will make a statement on the matter. [70098/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_488",
          "debateSectionId": "dbsect_488",
          "showAs": "Social Welfare Benefits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_488.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_570",
        "questionNumber": 570
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  As the Deputy will be aware, under the provisions of the Courts Service Act 1998, management of the courts is the responsibility of the Courts Service, which is independent in exercising its functions. The conduct of court cases is furthermore a matter for the presiding judges, who are independent in the exercise of their judicial function, subject to only the Constitution and the law.  My Department is fully committed to reforming the family justice system in Ireland through implementation of the Family Justice Strategy 2022-2025. This is an ambitious programme of reform which sets out a vision for a system refocused on the needs and rights of children, who are central to many family justice matters.  The Family Courts Act 2024 is a key component of my Department's Family Justice Strategy and contains a number of provisions designed to make the family court process more user-friendly and less costly. Commencing the Family Courts Act 2024 is a priority for Government and an implementation team has been established within my Department. As committed to in the Programme for Government, I intend to publish an implementation plan for a new Family Court System by the end of January 2026.  The Act provides for the establishment of family court divisions within the existing court structures, namely a Family High Court, a Family Circuit Court and a Family District Court, each dealing with family law matters as appropriate to its jurisdiction. Each of these Family Courts will have judges with appropriate specialist knowledge assigned to them on a full-time basis, and the Act also provides for ongoing professional training in the area of family law.  The Act includes a set of guiding principles for the family court system to make the best interests of the child a primary consideration in all family law proceedings, which all parties to proceedings will be required to have regard to.  The principles include:  • In family proceedings in which the welfare of a child is involved or likely to be affected, ensuring that the best interests of the child are a primary consideration; the child is informed in an age-appropriate manner; and the views of the child are ascertained and taken into account; and, there is no unreasonable delay in determining the proceedings.  • The court placing an emphasis to minimise risk to the safety of any party to family law proceedings in cases where this is a concern.  • Conducting proceedings in a manner which is user-friendly and accessible.  • Encouraging and facilitating the use of alternative dispute resolution methods, such as mediation, to resolve family law disputes without recourse to the courts, in so far as is possible and appropriate.  • Operating in an efficient manner which is likely to minimise the cost of the proceedings and encouraging active case management by the courts.  Many families make their own arrangements in relation to access or contact. Where support is needed, this can be accessed initially via the range of universal and targeted parenting supports provided by the Minister for Children, Disability and Equality, the Child and Family Agency Tusla, and the network of family resource centres and other voluntary and community family support services which it funds.  Where additional support is required, I am committed to facilitating the increased use of mediation, in line with the principles of the Family Courts Act 2024. Mediation offers people the opportunity to resolve their disputes without the adversarial strain of the courtroom. Goal 4 of the Family Justice Strategy aims to promote more co-operative, less adversarial ways for individuals, children and families to try to resolve disputes. This goal contains a number of actions relating to the role of mediation in family justice. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 653. Deputy Claire Kerrane asked the Minister for Justice, Home Affairs and Migration the specific legal or resource barrier that currently prevents the Department from mandating a four-week timeline for initial child contact assessments, mirroring the EU-based Danish family law system (Pillar 1); and if he will make a statement on the matter. [69702/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_530",
          "debateSectionId": "dbsect_530",
          "showAs": "Legislative Programme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_530.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_653",
        "questionNumber": 653
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As Minister for Health, I am committed to supporting our population screening programmes, which are a valuable part of our health service, enabling early treatment and care for many people, and improving the overall health of our population.  The Programme for Government commits to extending the ages for the BreastCheck Screening Programme, in line with updated standards from HIQA.  BreastCheck, the National Breast Screening Programme, currently invites women aged 50 to 69 years at regular intervals to have a screening mammogram. In Budget 2025, an additional €2.9 million was allocated to the BreastCheck programme to support the recruitment of 22 Whole Time Equivalent posts. This will assist in expanding and future-proofing the programme to meet increased demand.  CervicalCheck, the National Cervical Screening Programme, offers free cervical screening tests to all women and people with a cervix aged between 25 and 65.  I would note that any proposed changes to Ireland’s cancer screening programmes, will be facilitated through established evidence-driven protocols.  The National Screening Advisory Committee (NSAC) is the independent expert group that considers proposed changes to Ireland’s screening programmes. NSAC assesses the evidence in a robust and transparent manner and against internationally accepted criteria, before making recommendations to myself as Minister.  NSAC continues to progress work to consider the further expansion of our cancer screening programmes and has submitted several requests to the Health Information and Quality Authority (HIQA).  HIQA has commenced a Health Technology Assessment (HTA) to consider proposals for the expansion of the BreastCheck programme. This review will comprise two elements; the proposed extension of the age range eligibility to those aged 45-49 and 70-74, and also the potential introduction of a standardised breast density notification.  HTAs facilitate the assessment of relevant evidence and knowledge on the effects and consequences of healthcare technologies to guide decisions regarding the appropriate use of technology and efficient allocation of resources. They involve a multi-disciplinary assessment of the clinical, economic, ethical, legal and societal perspectives that may be impacted by the introduction of a new technology. They are time intensive and rigorous processes.  In relation to CervicalCheck, NSAC has not received proposals to extend the programme beyond the current age range eligibility. However, it is worth noting that that NSAC holds annual Calls for Submissions, which invite proposals from all stakeholders and organisations, including members of the public, the HSE and other medical professionals, for the introduction of new screening programmes or changes to existing programmes.  The 2025 Call for Submissions closed on 12 September 2025. Further information the list of conditions currently on NSAC’s work programme is available on the NSAC webpage at www.nsacommittee.gov.ie.  Finally, I would emphasise that screening programmes are for people without symptoms. If anyone becomes aware of symptoms, or if they have concerns or worries, they should contact a medical professional immediately. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 989. Deputy Claire Kerrane asked the Minister for Health to consider reducing the age for free breast and cervical checks; and if she will make a statement on the matter. [69584/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_819",
          "debateSectionId": "dbsect_819",
          "showAs": "Health Screening Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_819.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_989",
        "questionNumber": 989
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  As this is a service matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1012. Deputy Claire Kerrane asked the Minister for Health the reason a service (details supplied) is no longer available; if this service can be returned to avoid long journeys elsewhere for essential appointments, especially given the well documented levels of deprivation; and if she will make a statement on the matter. [69742/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_837",
          "debateSectionId": "dbsect_837",
          "showAs": "Hospital Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_837.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1012",
        "questionNumber": 1012
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, it has been referred to the Health Service Executive for attention and direct reply to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1013. Deputy Claire Kerrane asked the Minister for Health if it has been brought to her attention that the current waiting times for primary care psychology in Midlands Regional Hospital, Tullamore which are currently in excess of two years (details supplied), her plans to address these waiting times; if she intends to provide additional primary care psychology and psychology administrative supports; the timeframe for these; and if she will make a statement on the matter. [69743/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_838",
          "debateSectionId": "dbsect_838",
          "showAs": "Hospital Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_838.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1013",
        "questionNumber": 1013
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, it has been referred to the Health Service Executive for attention and direct reply to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1015. Deputy Claire Kerrane asked the Minister for Health if she is aware that the current wait time for primary care psychology in Midlands Regional Hospital Tullamore is in excess of two years; that the head of primary care services in the Midlands Louth Meath CHO has attributed these waiting times to ‘capacity challenges due to no additional primary care psychology and psychology administrative support’, and that ‘new and additional posts would assist the wait times and waiting lists; if and when she intends to provide these additional posts; and, if not, how she intends to address the wait times and waiting lists in Midlands Louth Meath CHO; and if she will make a statement on the matter. [69752/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_840",
          "debateSectionId": "dbsect_840",
          "showAs": "Hospital Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_840.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1015",
        "questionNumber": 1015
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  Applications for the delivery and upgrade of playgrounds are welcome under a number of schemes operated by my Department such as the CLÁR Programme, the LEADER programme, and the Town and Village Renewal Scheme.The CLÁR programme provides funding for small-scale projects in rural areas that have experienced significant levels of de-population. It supports a wide range of community facilities and amenities, including playgrounds. I hope to launch the 2026 programme early in the new year.The LEADER Programme provides support to rural communities under a broad range of themes. The decision to approve a project for LEADER funding is a matter for the Local Action Groups (LAGs) who administer the Programme on behalf of my Department. Prospective applicants can contact the LAG in their area to discuss potential projects.The Town and Village Renewal Scheme is designed to support the revitalisation of rural Ireland by focusing on stimulating town centre economic and social regeneration. This includes the development of recreational spaces/amenities such as playgrounds in town centres.Further information on all of these schemes is available on my Department's website.The Deputy may also wish to contact my colleague, the Minister for Children, Disability and Equality in respect of the Capital Grant Scheme for Play and Recreation delivered by her Department. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 1110. Deputy Claire Kerrane asked the Minister for Rural and Community Development and the Gaeltacht the grants available in 2026 for communities seeking to develop new playgrounds; and if he will make a statement on the matter. [69741/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_929",
          "debateSectionId": "dbsect_929",
          "showAs": "Community Development Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_929.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1110",
        "questionNumber": 1110
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Deputy Claire Kerrane  I raised with the Minister previously the situation in County Roscommon where they are having major difficulties in sourcing a building that meets the requirements to become a refuge. Will the Minister look at areas such as County Roscommon that, despite best efforts, are struggling to find such a building? \n Deputy Jim O'Callaghan  It is an essential part of the Government strategy in respect of responding to domestic violence that we have in place appropriate refuges and safe houses throughout the country.  Under the third national domestic, sexual and gender-based violence strategy, this Government has committed to doubling domestic violence safe accommodation capacity to 282 units by the end of next year. Cuan, the statutory body that has responsibility under my guidance for this, has been working to accelerate the delivery of safe accommodation across the country.  Following a request from me, Cuan worked with services and partners to assess and review progress and identify a series of actions to accelerate delivery and to bring safe accommodation on stream as quickly as possible to meet the needs of those fleeing violence.  On foot of this review, completed in spring 2025, the following will be delivered: 52 new family refuge units by the end of 2026; 45 new safe homes by the end of 2026; and 50 new units will be under construction by the end of 2026. Cuan has a total budget of nearly €67 million to respond to that.  In the Deputy's area, plans are under way to develop an eight-unit purpose-built refuge in County Roscommon. Cuan has established a local stakeholder group to lead and support the development of domestic violence accommodation. This group includes representation from Roscommon Safe Link, Roscommon County Council, Cuan and other important agencies. Site feasibility is being completed on a potential site. Safe home accommodation was developed in the county with two safe homes being operational in July 2025 and Roscommon Safe Link received additional funding from Cuan for the development and delivery of these safe homes. \n Deputy Claire Kerrane  I acknowledge Cuan, the agency, and the work it is doing and the efforts that are being made to increase capacity when it comes to refuge spaces and safe houses for those who are fleeing domestic violence or violence typically in their own home.  A number of sites had been identified by Roscommon Safe Link but, because of the criteria being so rigid, none of those sites was found to meet the criteria in place. We all hope that the site identified now will be the site. I would ask that in certain areas, such as County Roscommon which is rural, where the need is established and where genuine efforts have been made to find a site, that the criteria could be looked at with a little flexibility in engagement with both the safe link and the local authority because it has been a challenge in County Roscommon. \n Deputy Jim O'Callaghan  I thank Deputy Kerrane for her question. No doubt there will be an element of flexibility in respect of considering locations for refuges.  It is essential that we have refuges spread geographically throughout the country. What I want to see is not necessarily a refuge in every county, because in some counties you may need two because of the size of them, but locations that are close to where people are and are equidistant from each other so that where there are higher population levels people will know that there is a refuge available.  I have visited many refuges since I have become Minister. I visited a refuge last week and I was impressed with what was going on and the level of commitment there.  It is also important to point out, however, that we cannot have it as the automatic response that when there is domestic violence, the women has to leave the home. We need to look at barring orders as well. There will be an immediate requirement for emergency accommodation but the solution should be that the abuser leaves the home and the victim gets back into her home. \n Deputy Claire Kerrane  I hope we will see that development of a refuge in County Roscommon because, as I said, the need is there. I hope the site that has been identified will be successful.  The Minister is correct that in most of these cases, it is the woman who flees the home. That should not be the case. We should be looking at turning that around, where the abuser is the one who has to lose his home, typically, as the case may be. That is the way we should look at it. For the refuges we need, particularly in the west in counties like Roscommon and the county part of Galway, there is a need to ensure there is an adequate number of refuges, particularly in parts like the west, where there are many very rural areas. I thank the Minister. I hope we will be successful in the refuge for County Roscommon. \n Deputy Jim O'Callaghan  I should have pointed out that the refuge I visited on Monday was in Clonmel. I was extremely impressed by the service provided and the commitment of the staff. I was also at another event this week which is relevant to the discussion we are having about domestic violence. That was the launch of a report by an organised called Men Overcoming Violence, MOVE. We are never going to be really able to resolve or properly confront the scourge of domestic violence unless we engage with and try to give counselling and an avenue out of it for men involved in committing violence. MOVE produced a useful report and gave an insight into the motivating factors that led men to perpetrate violence against their intimate partners. In many instances, it was insecurities, fear of losing the partner and substance abuse. It can be difficult for State bodies or State-funded bodies to engage with perpetrators. It is extremely important that we continue to do that because we will not be able to confront this issue without doing so. ",
        "questionType": "oral",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 90. Deputy Claire Kerrane asked the Minister for Justice, Home Affairs and Migration if he will seek greater supports for counties where there are difficulties in acquiring domestic violence refuges; and if he will make a statement on the matter. [67257/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/dbsect_30",
          "debateSectionId": "dbsect_30",
          "showAs": "Domestic Violence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/mul@/dbsect_30.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_90",
        "questionNumber": 90
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  Combatting all forms of domestic, sexual and gender-based violence, and ensuring that victims and survivors receive the support and care they need, is an absolute priority for me. Since its establishment last year, Cuan has been working to accelerate the delivery of safe emergency accommodation across the country.  Working with services and partners, Cuan assessed progress to date and identified actions to speed up delivery and bring additional safe emergency accommodation on stream as quickly as possible to meet the needs of those fleeing violence.  On foot of this review, completed in spring 2025, the following will be delivered by the end of 2026:  • 52 new family refuge units  • 45 new safe homes  • 50 additional units under construction  At the outset of the Zero Tolerance strategy, there were 49 safe homes in place. By the end of 2026, it is expected that there will be 94 safe homes, and 193 refuge units completed, bringing total safe accommodation to 287 units, with a further 50 refuge units under construction.  In County Roscommon, plans are underway for the development of an eight-unit purpose-built refuge and work is progressing on this. Cuan have established a local Stakeholder Group to lead and support the development of the accommodation - this group includes representation from Roscommon Safe Link, Roscommon County Council, Cuan, Department of Housing, Local Government and Heritage, the Housing Agency and Sonas. I am informed that site feasibility is being completed on a potential site.  Safe Home accommodation was developed in the county with two safe homes becoming operational in July of this year. Roscommon Safe Link received additional funding from Cuan for the development and delivery of these safe homes. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 117. Deputy Claire Kerrane asked the Minister for Justice, Home Affairs and Migration to provide an update on a domestic violence refuge in County Roscommon; and if he will make a statement on the matter. [67256/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_141",
          "debateSectionId": "dbsect_141",
          "showAs": "Domestic Violence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_141.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_117",
        "questionNumber": 117
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 440. Deputy Claire Kerrane asked the Minister for Health if she plans to extend funding through the community primary care service to include battery packs for CPAP devices; and if she will make a statement on the matter. [68606/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_392",
          "debateSectionId": "dbsect_392",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_392.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_440",
        "questionNumber": 440
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  My Department recognises the importance of community spaces including community gardens. Funding for such facilities may be eligible under a number of funding programmes administered by my Department.  The CLÁR programme provides funding under a number of different measures for small-scale infrastructural projects in designated rural areas, including for the development of community facilities and amenities such as community gardens. I hope to launch the 2026 programme early in the new year.  Funding for community gardens may also be available through the LEADER programme. Details of all the funding opportunities available through my Department can be found on my Departments website. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 551. Deputy Claire Kerrane asked the Minister for Rural and Community Development and the Gaeltacht the supports available for a community garden; and if he will make a statement on the matter. [68620/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_495",
          "debateSectionId": "dbsect_495",
          "showAs": "Community Care",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_495.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_551",
        "questionNumber": 551
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  The Employment Permits Section of the Department informs me that the application in respect of the person referred to in the details supplied was received on 6 November 2025 and is currently awaiting processing. The current processing date for new applications is 29 October.  Processing dates are made available on the Department's website so that applicants are informed of the processing time frame - [ Current processing dates - DETE ] (enterprise.gov.ie/en/what-we-do/workplace-and-skills/employment-permits/current-application-processing-dates/).  To further support applicants, the Department has this year introduced a Self-Service Portal. This system allows both employers and applicants to check the real-time status of their applications directly. These tools are designed to provide timely updates and reduce the need for individual queries, helping us to focus resources on processing applications efficiently.  In addition, a dedicated TD mailbox is available for Oireachtas members to raise queries where appropriate: tdepqueries@enterprise.gov.ie. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 123. Deputy Claire Kerrane asked the Minister for Enterprise, Tourism and Employment when a general permit application (details supplied) will be determined; and if he will make a statement on the matter. [68252/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_117",
          "debateSectionId": "dbsect_117",
          "showAs": "Work Permits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_117.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_123",
        "questionNumber": 123
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Health  The Health Service Executive (HSE) provides hearing aids and associated maintenance free of charge to children under the age of 18 (non-means tested) and to adults with a medical card. Further information regarding the HSE's audiology service can be found at: www2.hse.ie/services/audiology/.  In accordance with the provisions of the Health Act 1970 (as amended), eligibility for a medical card is determined by the HSE. In certain circumstances, the HSE may exercise discretion and grant a medical card, even though an applicant exceeds the income guidelines, where he or she faces difficult financial circumstances, such as extra costs arising from illness. Further information can be found at: www2.hse.ie/services/schemes-allowances/medical-cards/.  The Treatment Benefit Scheme, operated by the Department of Social Protection, provides for healthcare services to qualified people who have the required number of PRSI contributions. This includes up to €1,000 for a pair of hearing aids, and up to €100 toward repairs, within a 4-year calendar period. Further information can be found at: www.gov.ie/en/service/1fb655-treatment-benefit-scheme/. Any changes to these grants would need to be considered in an overall policy and budgetary context.  Individuals who do not possess a medical card or who are not eligible for the Treatment Benefit Scheme would have to purchase hearing aids privately from a commercial provider. If the individual has private health insurance, it may cover hearing aid costs. Hearing aids are exempt from VAT. People may also be entitled to claim tax relief at the standard rate of tax (20%) on the purchase of hearing aids where prescribed.  The Minister for Health established the National Hearing Care Plan Working Group in August 2024. The Group is jointly chaired by the Department of Health and the Health Service Executive (HSE).  Membership of the Working Group is drawn from relevant stakeholders, including HSE clinicians and management, the Irish Society of Hearing Aid Audiologists (ISHAA), the Irish Academy of Audiology (IAA), and the Department of Social Protection.  The Hearing Care Plan Working Group has been tasked with developing recommendations for a holistic model of hearing care in Ireland. To support this, a structured workstream has been developed, including subgroups focused on progressing priority issues. Significant progress has been made to date. There have been 16 meetings of the Working Group and associated subgroups since formation.  The Group is examining:  • The existing level of hearing care provision in Ireland.  • Capacity constraints and opportunities within the HSE.  • Workforce planning, including improved recruitment and retention in the public system.  • The appropriate level of regulation of the audiology profession.  • Improving referral pathways and the integration between acute and community care.  • The effective linkage between public and private care to improve patient outcomes, including reductions in waiting times.  This is wide-ranging work, and it is the intention of the Group to ensure that the final report is comprehensive in its treatment of these matters.  A public consultation will be launched soon. This will further inform the Group’s final recommendations. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 255. Deputy Claire Kerrane asked the Minister for Health her views on the creation of a non-means tested audiology entitlement for persons born deaf; and if she will make a statement on the matter. [68281/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_219",
          "debateSectionId": "dbsect_219",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_219.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_255",
        "questionNumber": 255
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 266, 276 and 279 together.  Recognising the vitally important role of secretaries and caretakers within school communities, Department officials have been working intensively with stakeholders, with the Workplace Relations Commission (WRC) and with the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation, to establish a platform for meaningful discussion and resolution.  I believe that all parties have a responsibility to make sure that these talks succeed and that both sides must come together with an open mind without preconditions or preconceived ideas of a final outcome.  My Department has been engaging with Fórsa over the past number of weeks under the auspices of the WRC. The matter has now been referred to the Labour Court. The parties remain in process, and my Department remains committed and ready to engage with Fórsa to reach a resolution on this important matter. As with any industrial relations process the matters under discussion are confidential until this process concludes. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 266. Deputy Claire Kerrane asked the Minister for Education and Youth for an update on the talks regarding school secretaries and caretakers; and if she will make a statement on the matter. [67717/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_244",
          "debateSectionId": "dbsect_244",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_244.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_266",
        "questionNumber": 266
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 320 and 321 together.  Government is committed to delivering housing at scale, and continuing to accelerate housing supply across all tenures. Overall, over 16,900 affordable housing solutions have been delivered by our range of delivery partners since 2021, including 183 in the Galway County Council area.  The Affordable Housing Fund (AHF) is open on a continuous basis and available to support all local authorities to address any affordability needs identified in their area. Circular 23/2021 issued to all local authorities on 25 June 2021 and provides guidance on preparing an application for AHF assistance.  Currently Galway County Council has a programme in place that will deliver 130 affordable homes with AHF support, with further proposals being examined and developed by the local authority, including in Loughrea. The programme continues to grow and expand as further affordable housing projects are identified, considered, and advanced by the local authority.  The Local Authority Affordable Purchase Scheme (LAAPS) was introduced to assist first-time buyers purchasing Local Authority-delivered new homes. This scheme uses an equity share model to give eligible purchasers the opportunity of home ownership. The assessment of eligibility and the level of support available is household-specific, so purchasers are supported when they need this assistance to afford the home.  The same overall eligibility criteria apply for all persons applying for a Local Authority Affordable Purchase Scheme nationwide, including for those applying under the fresh start principle. Section 10 of the Affordable Housing Act 2021 outlines the criteria, which include confirmation of the combined financial means of the applicants; that none of the persons making the application has previously purchased or built a dwelling and that none of the persons making the application owns, or is beneficially entitled to an estate or interest in any dwelling.  Eligibility under Section 10 of the Act is further set out in the S.I. No. 20/2023 – Affordable Housing Regulations 2023 www.irishstatutebook.ie/eli/2023/si/20/made/en/print#:~:text=Housing%20Act%202021-,2.,-(1)%20An%20applicant and S.I. No. 21/2023 Affordable Housing Regulations 2023 www.irishstatutebook.ie/eli/2023/si/21/made/en/print. This includes the provision that the equity share required to support the purchase cannot be less than 5% and not greater than 40% of the market value of the dwelling concerned.  In line with Part 2 of the Affordable Housing Act 2021 the administration of affordable purchase housing schemes is a matter for each local authority who will have the specific information relating to the delivery of affordable homes by municipal district in their functional area.  Finally, it is also worth noting that the First Home Scheme, which supports first-time buyers in purchasing new houses and apartments in the private market through the use of an equity share model, is also available to support eligible new home purchasers in all local authority areas nationwide.  My Department, along with the Housing Agency and the Housing Delivery Coordination Office of the Local Government Management Agency will continue to advise and support Galway County Council in respect of its planned response to affordable housing needs in all key urban locations within its administrative area. The emphasis is on proactively collaborating to identify, develop and deliver viable affordable housing opportunities. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 320. Deputy Claire Kerrane asked the Minister for Housing, Local Government and Heritage his plans for affordable housing schemes in County Galway; the location for same and the criteria to apply for said housing; and if he will make a statement on the matter. [67439/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_293",
          "debateSectionId": "dbsect_293",
          "showAs": "Housing Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_293.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_320",
        "questionNumber": 320
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 320 and 321 together.  Government is committed to delivering housing at scale, and continuing to accelerate housing supply across all tenures. Overall, over 16,900 affordable housing solutions have been delivered by our range of delivery partners since 2021, including 183 in the Galway County Council area.  The Affordable Housing Fund (AHF) is open on a continuous basis and available to support all local authorities to address any affordability needs identified in their area. Circular 23/2021 issued to all local authorities on 25 June 2021 and provides guidance on preparing an application for AHF assistance.  Currently Galway County Council has a programme in place that will deliver 130 affordable homes with AHF support, with further proposals being examined and developed by the local authority, including in Loughrea. The programme continues to grow and expand as further affordable housing projects are identified, considered, and advanced by the local authority.  The Local Authority Affordable Purchase Scheme (LAAPS) was introduced to assist first-time buyers purchasing Local Authority-delivered new homes. This scheme uses an equity share model to give eligible purchasers the opportunity of home ownership. The assessment of eligibility and the level of support available is household-specific, so purchasers are supported when they need this assistance to afford the home.  The same overall eligibility criteria apply for all persons applying for a Local Authority Affordable Purchase Scheme nationwide, including for those applying under the fresh start principle. Section 10 of the Affordable Housing Act 2021 outlines the criteria, which include confirmation of the combined financial means of the applicants; that none of the persons making the application has previously purchased or built a dwelling and that none of the persons making the application owns, or is beneficially entitled to an estate or interest in any dwelling.  Eligibility under Section 10 of the Act is further set out in the S.I. No. 20/2023 – Affordable Housing Regulations 2023 www.irishstatutebook.ie/eli/2023/si/20/made/en/print#:~:text=Housing%20Act%202021-,2.,-(1)%20An%20applicant and S.I. No. 21/2023 Affordable Housing Regulations 2023 www.irishstatutebook.ie/eli/2023/si/21/made/en/print. This includes the provision that the equity share required to support the purchase cannot be less than 5% and not greater than 40% of the market value of the dwelling concerned.  In line with Part 2 of the Affordable Housing Act 2021 the administration of affordable purchase housing schemes is a matter for each local authority who will have the specific information relating to the delivery of affordable homes by municipal district in their functional area.  Finally, it is also worth noting that the First Home Scheme, which supports first-time buyers in purchasing new houses and apartments in the private market through the use of an equity share model, is also available to support eligible new home purchasers in all local authority areas nationwide.  My Department, along with the Housing Agency and the Housing Delivery Coordination Office of the Local Government Management Agency will continue to advise and support Galway County Council in respect of its planned response to affordable housing needs in all key urban locations within its administrative area. The emphasis is on proactively collaborating to identify, develop and deliver viable affordable housing opportunities. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 321. Deputy Claire Kerrane asked the Minister for Housing, Local Government and Heritage his plans for affordable housing at a location (details supplied); the criteria potential buyers will need to meet to be eligible to purchase; the way in which the process will work; and if he will make a statement on the matter. [67440/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_293",
          "debateSectionId": "dbsect_293",
          "showAs": "Housing Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_293.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_321",
        "questionNumber": 321
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  The Programme for Government 2025 – Securing Ireland’s Future commits to ensure the managed development of solar energy and battery power through the development of national planning guidelines. It also commits to advance battery development and take-up to allow portable energy and reduce grid dependence and reaffirms Ireland’s ambitious targets of 8 GW of solar capacity connected to the grid by 2030, to assist with meeting the requirement of 80% of electricity demand supplied by renewables.  Therefore, my Department will prepare a new National Planning Statement on Solar Energy, which will consider developments that include battery storage, under the provisions of the Planning and Development Act 2024. My Department has begun an initial scoping process to identify the component factors relevant to the preparation of the National Planning Statement for solar energy development, including consideration of any appropriate environmental assessment and public consultation requirements and other relevant European obligations such as the Renewable Energy Directive (RED III), which will determine the timeframe for publication of said guidelines.  As part of the initial scoping process by the Department to identify the component factors relevant to the preparation of a National Planning Statement for solar energy development, the Department is considering factors for consideration in the National Planning Statement, to include solar energy developments that use battery storage as part of the development.  It is important to note that many of the issues concerning battery storage are more appropriate for consideration under building control and fire safety codes, and may be more appropriately dealt with by way of best practice guidance issued through these codes rather than by way of a National Planning Statement.  This scoping process remains at an early stage but I am satisfied that the existing and evolving planning system, supported by Government policy more generally, provides a sufficiently robust policy and legislative framework to facilitate the rollout of solar energy development, including solar energy developments that use battery storage as part of the development, in a sustainable manner and to assist with meeting our renewable electricity requirements while balancing the perspectives of local communities and allowing for public and stakeholder engagement.  In the interim, there are currently no statutory planning guidelines in place in respect of solar energy or battery storage development. Proposals for individual solar energy developments, including developments that include battery storage, are subject to the statutory requirements of the Planning and Development Act 2000, as amended, and the Planning and Development Act 2024, as amended, in the same manner as other proposed developments, with planning applications made to the relevant local planning authority, or An Coimisiún Pleanála on appeal.  The Programme for Government also committed to a Land Use Review to ensure that optimal land use options inform all relevant Government decisions. The second phase of the Land Use Review, which is currently underway, will seek to identify the key demands on land (both public and private) to inform policies for land use across key government objectives, improving socioeconomic, climate, biodiversity, water, and air quality outcomes. The Department of Climate, Energy and the Environment and the Department of Agriculture, Food and the Marine are working towards the conclusion of the second stage of the review. Any National Planning Statement on solar energy development or battery storage will take into careful consideration any finding of the Land Use Review. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 352. Deputy Claire Kerrane asked the Minister for Housing, Local Government and Heritage the guidelines in place for battery storage units, to protect communities, similar to the guidelines that have been in place for wind energy; if he is aware of local resident's concerns when planning for such facilities are sought; the safeguards which are in place for communities; and if he will make a statement on the matter. [68008/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_315",
          "debateSectionId": "dbsect_315",
          "showAs": "Renewable Energy Generation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_315.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_352",
        "questionNumber": 352
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  I wish to inform the Deputy that neither this Department nor Tusla currently have capital funding to support the building of new or refurbishment or extension of existing Family Resource Centres. Tusla does not have a dedicated budget for capital or building works for third party organisations such as Family Resource Centres.  The Family Resource Centre Programme is a community development programme that is financially supported by many State agencies in a partnership approach. Centres may draw on various sources of funding provided by other Government Departments, agencies and private sources. In relation to any immediate or urgent requirements, I would suggest that the local County or City Council be considered as a starting point in the context of any capital funding requests. Tusla also recommends that FRC Programme members look into any Government schemes available such as Rural Integrated Development schemes operated by the Department of Rural and Community Development. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 482. Deputy Claire Kerrane asked the Minister for Children, Disability and Equality the options available to an existing family resource centre, under the national forum to buy a premises as a permanent home in order to develop; the funding which is available; if an existing vacant building can be purchased; and if she will make a statement on the matter. [67441/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_424",
          "debateSectionId": "dbsect_424",
          "showAs": "Family Resource Centres",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_424.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_482",
        "questionNumber": 482
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  I can inform the Deputy it is expected that an announcement of a decision on the ten new Family Resource Centres will be made in the coming months.  The securing of additional funding in Budget 2026, allowing Tusla to increase Programme membership to 136 members, is a very welcome development for an additional ten communities in need of the comprehensive range of services offered by Family Resource Centres.  In relation to annual funding, I recently announced in a press release on 14th November 2025 that the minimum core funding level for Family Resource Centres will be increased from to €160,000 to €180,000 from January 2026. The 10 new Family Resource Centres will each receive €180,000 in annual core funding. The increase to minimum core funding will also benefit 100 of the 126 existing Family Resource Centres around the country, whose current core funding is below the new €180,000 minimum level. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 492. Deputy Claire Kerrane asked the Minister for Children, Disability and Equality when a decision will be made on the ten family resource centres to be included in the national forum and annual funding as per Budget 2026; and if she will make a statement on the matter. [67699/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_434",
          "debateSectionId": "dbsect_434",
          "showAs": "Family Resource Centres",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_434.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_492",
        "questionNumber": 492
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Pobal are a non- commercial agency operating under the aegis of the Department of Rural and Community Development and the Gaeltacht and engaged by DCDE under the terms of a service level agreement (SLA). As such, Pobal are responsible for ensuring that staffing and skill levels are adequate to achieve the objectives of this Agreement and are solely responsible for any and all personnel and all costs arising from the employment of the Company’s personnel.  The Department strongly encourages all sides to utilise the industrial relations framework and the Workplace Relations Commission to achieve a resolution in the best interests of children and families. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 502. Deputy Claire Kerrane asked the Minister for Children, Disability and Equality if she is aware that Pobal is withholding the 3% pay increase as agreed in Building Momentum; if this is acceptable to her; and if she will make a statement on the matter. [67979/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_445",
          "debateSectionId": "dbsect_445",
          "showAs": "State Bodies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_445.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_502",
        "questionNumber": 502
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Pobal are a non-commercial agency operating under the aegis of the Department of Rural and Community Development and the Gaeltacht and engaged by DCDE under the terms of a service level agreement (SLA). As such, Pobal are responsible for ensuring that staffing and skill levels are adequate to achieve the objectives of this Agreement and are solely responsible for any and all personnel and all costs arising from the employment of the company’s personnel.  The Department strongly encourages all sides to utilise the industrial relations framework and the Workplace Relations Commission to achieve a resolution in the best interests of children and families. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 503. Deputy Claire Kerrane asked the Minister for Children, Disability and Equality if she is aware of Pobal's failure to pay a 2% wage increase due in March 2025 to grade 2 early years specialist; if she has engaged with Pobal to resolve this given it is an important Department initiative; and if she will make a statement on the matter. [67980/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_446",
          "debateSectionId": "dbsect_446",
          "showAs": "State Bodies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_446.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_503",
        "questionNumber": 503
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The National Action Plan for Childminding 2021-2028 set out a pathway for the extension of regulation to childminders. The childminding-specific Regulations, which came into effect in September 2024, are designed to be proportionate and appropriate to the home and family setting in which childminders work. Childminders were consulted on and involved in all aspects of the development of the regulations. Both the Steering Group for the National Action Plan for Childminding, and the Advisory Groups that have supported it, have included childminders, as well as organisations representing childminders.  In addition, an independent external review of the draft regulations was carried out by Dr Bill Maxwell, the former CEO of Education Scotland, former Chief Inspector in both Scotland and Wales, and OECD consultant, which confirmed that the approach was proportionate for childminding in Ireland. The external review was commissioned in 2024 by the then Minister for Children, Equality, Disability, Integration and Youth to provide an independent, external assessment of the Draft Childminding Regulations before their finalisation. I will explore the possibility of publishing the review in the near future. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 505. Deputy Claire Kerrane asked the Minister for Children, Disability and Equality to provide a copy of the independent external review of the draft Childminding Regulations which was carried out by a person (details supplied); and if she will make a statement on the matter. [68018/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_448",
          "debateSectionId": "dbsect_448",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_448.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_505",
        "questionNumber": 505
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The Government appointed Ms Caoilfhionn Gallagher KC as Special Rapporteur on Child Protection for a three-year term from 1 February 2023.  The functions of the Rapporteur are to keep under review and to audit legal developments for the protection of children; to assess the impact, if any, litigation in national and international courts will have on child protection; to prepare a report annually and to examine, upon request, the scope and application of existing or proposed legislative provisions and to make comments/recommendations as appropriate.  Upon receipt and review of the annual report, the Department of Children, Disability, and Equality submit the report to Cabinet for approval to publish, following a circulation period for review by the range of relevant Government Departments. Once approved, the report is laid before the Houses of the Oireachtas and then published on the Department’s website.  The Department awaits the Annual Reports in respect of the current term of Special Rapporteur on Child Protection. Officials in the Department are engaging with the Special Rapporteur on the matter of the submission of the annual reports prior to the completion of the rapporteur's term of office on the 31st of January 2026. Following receipt of the annual reports, it is intended that they will be published once the above process has been completed. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 513. Deputy Claire Kerrane asked the Minister for Children, Disability and Equality when a report by the Special Rapporteur on Child Protection will be published; if she Minister has received the report; and if she will make a statement on the matter. [68113/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_456",
          "debateSectionId": "dbsect_456",
          "showAs": "Child Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_456.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_513",
        "questionNumber": 513
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  Under the Health (Pricing and Supply of Medical Goods) Act 2013, the HSE has statutory responsibility for decisions on the pricing and reimbursement of medicines and medical devices; therefore, the matter has been referred to the HSE for attention and direct reply to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 632. Deputy Claire Kerrane asked the Minister for Health if a drug (details supplied) can be made available under the HSE drugs scheme given the very high monthly cost of €7,600 which is out of reach, given this drug provides lifesaving treatment; and if she will make a statement on the matter. [67985/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08",
          "showAs": "Claire Kerrane"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_566",
          "debateSectionId": "dbsect_566",
          "showAs": "Medicinal Products",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_566.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_632",
        "questionNumber": 632
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 24 and 92 together.  I am aware of this case and of the Deputy's consistent and constructive interest in it.  The subject of this case is an Australian citizen, and so primary consular responsibility falls to Australia. But as an Irish resident, with an Irish family, the Government have been very active on his behalf, in support of the efforts by Australia.  This has involved continuously raising this case with the Iraqi authorities, at diplomatic level both with the Iraqi Embassy in Dublin and the Irish Ambassador in Jordan travelling to Baghdad to make direct representations. At political level, the Tánaiste, when Minister for Foreign Affairs, was actively engaged in the case and spoke with the Iraqi Minister for Foreign Affairs by telephone, and more recently in person when they met in New York. He also maintained close contact with the family in Ireland. Previous Ministers for Foreign Affairs have also raised the case with the Iraqi Foreign Minister and the Taoiseach recently wrote to the Iraqi Prime Minister about it. We have made clear that in our view the person's conviction was unsound, and that he should be allowed now to return home to his family in Ireland.  The person completed his prison sentence in January, but continued to be detained in prison. In June he was released on bail, but required to remain in Iraq due to what the Iraqi administration claim to be outstanding fines and possible further proceedings. Our hopes that he would be allowed to leave soon after release have therefore been frustrated. We have made clear to the Iraqi authorities that we consider him to be still detained in Iraq, and this should end. We will continue to make every effort to secure his release, consistent with the efforts by Australia.  Iraq has made good progress in recent years in rebuilding after long years of dictatorship and war. It is regrettable that the continuation of this case is hampering the better development of relations which we would like to see. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Claire Kerrane",
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_58.xml"
            }
          },
          "debateSectionId": "dbsect_58",
          "showAs": "Irish Prisoners Abroad",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_58"
        },
        "questionNumber": 24,
        "date": "2025-11-27",
        "showAs": " 24. Deputy Claire Kerrane asked the Minister for Foreign Affairs and Trade the steps she will take to bring an Irish resident (details supplied) home to County Roscommon; and if she will make a statement on the matter. [66114/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_24"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 24 and 92 together.  I am aware of this case and of the Deputy's consistent and constructive interest in it.  The subject of this case is an Australian citizen, and so primary consular responsibility falls to Australia. But as an Irish resident, with an Irish family, the Government have been very active on his behalf, in support of the efforts by Australia.  This has involved continuously raising this case with the Iraqi authorities, at diplomatic level both with the Iraqi Embassy in Dublin and the Irish Ambassador in Jordan travelling to Baghdad to make direct representations. At political level, the Tánaiste, when Minister for Foreign Affairs, was actively engaged in the case and spoke with the Iraqi Minister for Foreign Affairs by telephone, and more recently in person when they met in New York. He also maintained close contact with the family in Ireland. Previous Ministers for Foreign Affairs have also raised the case with the Iraqi Foreign Minister and the Taoiseach recently wrote to the Iraqi Prime Minister about it. We have made clear that in our view the person's conviction was unsound, and that he should be allowed now to return home to his family in Ireland.  The person completed his prison sentence in January, but continued to be detained in prison. In June he was released on bail, but required to remain in Iraq due to what the Iraqi administration claim to be outstanding fines and possible further proceedings. Our hopes that he would be allowed to leave soon after release have therefore been frustrated. We have made clear to the Iraqi authorities that we consider him to be still detained in Iraq, and this should end. We will continue to make every effort to secure his release, consistent with the efforts by Australia.  Iraq has made good progress in recent years in rebuilding after long years of dictatorship and war. It is regrettable that the continuation of this case is hampering the better development of relations which we would like to see. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Claire Kerrane",
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_58.xml"
            }
          },
          "debateSectionId": "dbsect_58",
          "showAs": "Irish Prisoners Abroad",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_58"
        },
        "questionNumber": 92,
        "date": "2025-11-27",
        "showAs": " 92. Deputy Claire Kerrane asked the Minister for Foreign Affairs and Trade the engagement she has had with Iraqi authorities in relation to the case of an Irish resident (details supplied) and their repatriation to County Roscommon; and if she will make a statement on the matter. [66115/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_92"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  Bovine TB is an ongoing challenge for Irish farmers. I am acutely aware of the emotional and financial impacts of bovine TB on farmers, their families and rural Ireland.  My Department provides a range of financial supports that focus on compensating farmers for both direct and indirect losses incurred as a result of a TB breakdown on the farm.  The primary support scheme is the On Farm Market Valuation scheme, where animals removed as reactors receive compensation equivalent to what their market value would have been if they had not been disclosed as TB reactors, subject to scheme ceilings. Further supports are available through the Income Supplement Scheme, Depopulation Grant scheme and the Hardship Grant scheme.  In the period up to 31st of October, of the 32,860 animals valued under the On Farm Market Valuation scheme, just under 97% of animals were valued below the scheme ceilings.  As part of the work of the TB Forum, a dedicated Financial Working Group was established to review the financial modelling of various elements of the bovine TB Eradication programme.  As a result of the agreement reached in this Group in 2023, there were rate enhancements to the Income Supplement Scheme, the Hardship Grant and the Depopulation Grant as well as enhanced ceilings for select animals being removed as part of the On Farm Market Valuation Scheme.  In addition, the Financial Working Group also expanded the eligibility criteria under the Income Supplement Scheme and Hardship Grant Schemes.  Due to the increased cost of the bTB programme in recent years, the focus at present is on reducing the levels of disease which will reduce the impact of bTB on Irish farm families and reduce the cost of the programme which rose to over €100 million in 2024, a figure which will be exceeded in 2025. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Claire Kerrane",
          "memberCode": "Claire-Kerrane.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Claire-Kerrane.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_120.xml"
            }
          },
          "debateSectionId": "dbsect_120",
          "showAs": "Animal Diseases",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_120"
        },
        "questionNumber": 121,
        "date": "2025-11-27",
        "showAs": " 121. Deputy Claire Kerrane asked the Minister for Agriculture, Food and the Marine if he will examine the current valuation ceilings for farmers where their animals are infected by TB; and if he will make a statement on the matter. [66116/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_121"
      },
      "contextDate": "2025-11-27"
    }
  ]
}