{
  "head": {
    "counts": {
      "questionCount": 1926,
      "resultCount": 1926
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Capital Acquisitions Tax (CAT) is a tax which applies to both gifts and inheritances and is charged at a rate of 33%. For CAT purposes, the relationship between the person giving a gift or inheritance and the person who receives it determines the maximum amount, known as the “Group threshold”, below which CAT does not arise. The group thresholds were most recently increased in Budget 2025.  The Group A threshold increased to €400,000 from €335,000. This threshold applies where the beneficiary is a child of the disponer. This includes adopted children, stepchildren and some foster children. Parents may also fall within this threshold where they take an inheritance from a child.  The Group B threshold increased to €40,000 in Budget 2025 from €32,500. This threshold applies where the beneficiary is a brother, sister, niece, nephew, or lineal ancestor or lineal descendant of the disponer. Following recent changes made to Capital Acquisitions Tax legislation, the Group B threshold also applies to persons who receive gifts and inheritances from the wider family of their foster parents, for example, from their foster siblings, uncles, aunts and grandparents.  The Group C threshold increased to €20,000 in Budget 2025 from €16,250, with this threshold applying to all other cases.  I am advised by Revenue that provisional 2025 CAT receipts to the end of November are €1.075 billion.  I am further advised that statistics on CAT receipts are available on the Revenue website at: www.revenue.ie/en/corporate/information-about-revenue/statistics/capital-taxes/cat/receipts-breakdown.aspx  Finally, any changes to CAT must be considered among various demands within the overall Budget package, as they have been in the past. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 194. Deputy Cormac Devlin asked the Tánaiste and Minister for Finance if he will report on CAT receipts to date in 2025; and if he will make a statement on the matter. [69700/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_208",
          "debateSectionId": "dbsect_208",
          "showAs": "Tax Collection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_208.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_194",
        "questionNumber": 194
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  While neither I as Tánaiste and Minister for Finance, nor the Central Bank, can intervene directly in pricing under EU Solvency II rules, ensuring that consumers have access to affordable insurance cover is a key priority for this Government.  Considerable progress in this area has already been made. A significant number of reforms were delivered under the 2020 Action Plan for Insurance Reform  that have contributed to stabilising the market, including the introduction of the Personal Injuries Guidelines, rebalancing of the duty of care, and legislative enhancements to the Injuries Resolution Board.  Together, these steps have helped reduce claims costs, improve consistency in personal injury awards, and create a more predictable environment for insurers. They have also supported the entry of new providers into the market and encouraged existing companies to broaden their risk appetite.  The 2025 Action Plan for Insurance Reform, launched on 24 July, sets out a comprehensive set of targeted measures to further improve affordability, availability, and transparency across the insurance sector. Among the priority actions is a strong emphasis on enhancing market competitiveness by engaging directly with the international insurance market to attract new providers to Ireland. This approach aims to expand supply, drive greater competition, and reduce cost.  The Office to Promote Competition in the Insurance Market (OPCIM) also continues to play a central role in enhancing competition to address rising premiums. With its mandate expanded under the Programme for Government, the Office remains instrumental in promoting competition and in identifying opportunities to attract additional providers.  Securing a more sustainable and competitive market through deepening and widening the supply of insurance in Ireland remains a key priority, with the goal of enhancing affordability and availability for consumers across all types of insurance. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 224. Deputy Cormac Devlin asked the Tánaiste and Minister for Finance the steps being taken to address rising insurance premiums for consumers; and if he will make a statement on the matter. [72877/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_238",
          "debateSectionId": "dbsect_238",
          "showAs": "Insurance Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_238.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_224",
        "questionNumber": 224
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has been responsibility for the development of public transport infrastructure, including ticketing and technology projects.  The NTA's Next Generation Ticketing project will provide for transformative upgrade to the ticketing system for public transport passengers in Ireland. The project will facilitate a variety of payment methods on public transport services, involving a new-generation 'Account Based Ticketing' scheme incorporating both mobile and card-based payments for passengers.  Following a competitive procurement process, in April 2024 the NTA awarded an overall framework contract for the design, supply, installation and operation of the new multi-modal ticketing system to a Spanish information technology company, Indra Sistemas, who have designed, installed and operated similar systems internationally.  In August 2024, the NTA and Indra initiated the first call-off contract to equip the entire State subsidised public transport network in the Greater Dublin Area with new validation equipment capable of accepting bank cards, Apple Pay, Google Pay, QR Codes (both paper and app-based), TFI Leap Cards, and Free Travel Passes.  A huge effort is being put in by NTA to ensure that this transformational and beneficial project for public transport passengers is delivered as effectively as possible. It is anticipated that the new ticketing system across the Greater Dublin Area will be implemented in 2028, with further rollouts thereafter.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 334. Deputy Cormac Devlin asked the Minister for Transport the expected timeline for the roll-out of contactless fare payments on all public transport; and if he will make a statement on the matter. [73745/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_337",
          "debateSectionId": "dbsect_337",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_337.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_334",
        "questionNumber": 334
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 216, 348, 353 and 356 together.  The November Exchequer returns showed that, at a headline level, our public finances are in reasonably good shape.  Of course, tax revenues last year were heavily distorted by the once-off proceeds arising from the Court of Justice of the European Union decision, so for clarity I will exclude those receipts from the figures.  Tax revenues of €19.9 billion were collected in the month. That is up by €3½ billion or over 20 per cent on last year.  For the year to date, receipts amounted to €97 billion, up on last year by €7.3 billion, or a little over 8 per cent. Growth has been strong across almost all revenue streams, but particularly in the largest tax heads: income tax, VAT and corporation tax.  Income tax receipts to end-November stood at €33.7 billion, up by €1½ billion or just over 4½ per cent. This is a reflection of the continued resilience in our labour market.  November was the final VAT-due month of the year, with receipts standing at €22½ billion, which is €1.1 billion, or 5 per cent, up on last year – another demonstration of the fundamental strength of our economy.  The total amount of corporation tax received in November amounted to €10 billion. To put this in context, that is around the same amount we received in an entire year in 2018, just seven years ago. For the year to date, receipts stand at €29.4 billion, up by €3.8 billion or just under 15 per cent.  In Budget 2026 my Department projected a headline Exchequer tax revenue yield of €106.3 billion this year, rising to €109.2 billion next year. This was consistent with a projected Exchequer balance on Budget Day of just shy of €1 billion this year, and a deficit of €1.8 billion next year.  The Government Expenditure Ceiling has since been raised for 2025: all else equal this would result in a lower Exchequer position than set out on Budget Day. Nonetheless the General Government position, which is a more comprehensive metric, is expected to remain in surplus in both 2025 and 2026.  Taken as a whole, the tax performance to end-November was very much in line with expectations and consistent with the revised Budget 2026 revenue projections, suggesting we remain on track to reach around €106 billion in tax receipts this year. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 348. Deputy Cormac Devlin asked the Tánaiste and Minister for Finance if he will report on VAT receipts to date in 2025; and if he will make a statement on the matter. [69699/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_229",
          "debateSectionId": "dbsect_229",
          "showAs": "Tax Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_229.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_348",
        "questionNumber": 348
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Ireland will receive approximately €1.15 billion in funding from the Recovery and Resilience Facility (RRF) in respect of measures included in our National Recovery and Resilience Plan (NRRP). The programme period runs from 2021 to 2026.  The NRRP is pre-funded through the estimates process and the National Development Plan. RRF allocated funding is then recouped from the EU after the agreed milestones and targets within the Plan have been achieved and verified.  The RRF is a performance-based instrument with payment contingent on evidenced completion of agreed milestones and targets. The RRF allocation will be paid to Ireland in five instalments.  Following the successful submission of our first payment request, Ireland received €324m in July 2024 from the EU’s Recovery and Resilience Facility.  Ireland’s second payment request of €116m was submitted in December 2024. Following a positive preliminary assessment by the Commission, payment of €115 million was lodged to the Exchequer in July 2025.  The third payment request worth approximately €240 million was submitted in August 2025, and payment received in November 2025. This means that Ireland has now successfully achieved 60% of the milestones and targets within our Plan and has secured 60% of the €1.15 billion funding.  Since July 2025, an extensive exercise has been ongoing between the Commission, Implementing Body and Accountable Departments to deliver a final revision of the NRRP to maximise Ireland’s financial drawdown and will ensure delivery within the RRF timelines. It is expected that these amendments will be formally adopted early in 2026.  Ireland has two extant payment requests to submit before the programme period for the Recovery and Resilience Facility ends, the ambition is to submit the fourth payment request in early 2026 and the fifth and final payment request to be submitted by the regulatory deadline of Q3 2026. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 392. Deputy Cormac Devlin asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation to outline Ireland’s progress under the National Recovery and Resilience Plan as part of the European Union’s NextGenerationEU Recovery Plan; and if he will make a statement on the matter. [73753/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_382",
          "debateSectionId": "dbsect_382",
          "showAs": "EU Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_382.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_392",
        "questionNumber": 392
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I wish to advise the Deputy that a member of staff from the Non-Teaching Staff payroll was in contact with the staff member who is the subject of this question, we have confirmed that payment of basic pay and all arrears due will be processed on the 01/01/2026 which is the next available pay date. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 471. Deputy Cormac Devlin asked the Minister for Education and Youth if she is aware of an issue (details supplied); and if she will make a statement on the matter. [73744/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_445",
          "debateSectionId": "dbsect_445",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_445.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_471",
        "questionNumber": 471
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Irish Prison Service has advised that information relating to prison capacity and the numbers of prisoners in custody is collated daily by the Irish Prison Service Statistics Unit and published on its website at Daily Prisoner Population - Irish Prison Service.  The Future Prison Capacity Working Group (FPCWG) was established in July 2024 and published its report on 4 July 2025. The report highlighted that, like other prison systems in Europe, the Irish prison system is facing significant capacity challenges. The report made a number of recommendations about the prison estate, as well as projecting that numbers in prison would continue to grow.  Since 2022, capacity across the prison estate has been increased by 407 new spaces, with 126 delivered in 2024, 70 delivered to date in 2025 with plans to deliver a further 101 spaces by end of 2026.  Reflecting the Government's commitment to increase prison capacity by 1,500, as part of the NDP Review in July 2024, IPS were allocated a record capital investment of €527m from 2026 to 2030. €495m of this total will be invested in building projects.  In the recently published Justice Sector Investment Plan, a number of the major projects and timelines for prison expansion were outlined. This will be the largest ever building programme in the prison estate. The programme will include a new block in Wheatfield, an additional block extension at Midlands prison, an extension to Cork Prison, as well as additional spaces at Castlerea, Mountjoy, Cloverhill, Portlaoise, Limerick and Dóchas. The plans also include commencement of the construction of a new prison at the Thornton site in North County Dublin. This new revised capital plan will deliver on several of the recommendations in the FPCWG report.  In line with the recommendations of the FPCWG, Minister O’Callaghan secured an exemption for six projects (960 prison spaces) to move straight to Approval Gate 2 – Pre Tender Approval of the Infrastructure Guidelines, a measure which is expected to speed up the delivery of these projects by 12 to 18 months.  A master plan for the Thornton site will be developed in 2026, determining its future use as a combined site for use by the IPS, International Protection Accommodation Services and An Garda Síochána. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 578. Deputy Cormac Devlin asked the Minister for Justice, Home Affairs and Migration to publish the current number of prisoners in each prison, broken down by gender; to outline the plans under the Future Prison Capacity Working Group established in 2024 to increase prison capacity in the State; and if he will make a statement on the matter. [73746/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_551",
          "debateSectionId": "dbsect_551",
          "showAs": "Prison Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_551.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_578",
        "questionNumber": 578
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I have requested the information sought by the Deputy but it was not received in time. I will contact the Deputy directly once the information is to hand. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 579. Deputy Cormac Devlin asked the Minister for Justice, Home Affairs and Migration to outline the progress of each of the four existing projects under the Youth–Joint Agency Response to Crime (Y-JARC); the number of individuals who have benefited from each project, by year, since 2017; and if he will make a statement on the matter. [73748/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_552",
          "debateSectionId": "dbsect_552",
          "showAs": "Youth Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_552.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_579",
        "questionNumber": 579
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  The Bail Supervision Scheme (BSS) offers courts an alternative option to detaining a young person who comes before them. It provides for the possibility of granting bail with intensive supervision. By reducing the need for remand places, this also provides an opportunity to focus on developing successful community resources designed to prevent young people being detained in a youth justice facility and reduce the risk of them going further down the path of criminality. The BSS currently serves the Children Courts in Dublin, Limerick and Cork. Table 1 below details the number of young people involved in the scheme between 2019 and 2025.  In 2019, an evaluation of the BSS was published by the then Department of Children and Youth Affairs (www.gov.ie/en/department-of-children-disability-and-equality/publications/evaluation-of-the-bail-supervision-scheme-for-children-pilot-scheme/). The pilot scheme had been based out of the Dublin Children Court and as a result of the positive impact of BSS, as identified in this evaluation, the scheme was expanded to Limerick and Cork Children Courts.  Following consultations with the Probation Service and other stakeholders, oversight of the Bail Supervision Scheme is set to transfer to the Probation Service on 1 January 2026. Recognising that the BSS plays a valuable role in diverting young people away from criminality and ultimately detention, I have asked my officials to explore how the scheme might be rolled out nationally.   Table 1 Bail Supervision Scheme 2019 - 2024  ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 580. Deputy Cormac Devlin asked the Minister for Justice, Home Affairs and Migration the number of individuals who have availed of the bail supervision scheme in each of the years 2019 to 2025; and if he will make a statement on the matter. [73749/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_553",
          "debateSectionId": "dbsect_553",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_553.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_580",
        "questionNumber": 580
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Government is committed to ensuring that An Garda Síochána has the resources it needs to fight crime. The 2026 allocation provides a budget of over €2.59 billion to An Garda Síochána. This is a 33% increase since 2021. This unprecedented budget will strengthen the work of specialist units such as the Garda National Cyber Crime Bureau (GNCCB).  The GNCCB is tasked with the forensic examination of digital devices that have been seized during the course of any criminal investigations. These include incidents of cyber-crime, online harassment, computer intrusions, child exploitation offences, murder and any other criminal investigation in which digital devices are seized or may contain evidential data. This may include devices belonging to both suspects and witnesses.  The table below provides for the total number of new applications for cases created at GNCCB and the number of cases closed each year by the Bureau as follows:      Year      Cases Created      Cases Closed        2020     400    350       2021     501    381       2022     511    633       2023     380    630       2024     626    754       2025 (YTD)     607    569     To note, cases closed in one year may have been created in a previous year.  The Table below provides for an overview of the top ten categories of offences relating to the cases created above as follows:      Number      Incident Type        1     Child Sexual Exploitation Material       2     Theft and Fraud Offences       3     Child Exploitation/Grooming       4     Harassment       5     Murder - Suspect       6     Sexual Assault Rape       7     Drug Offences       8     Terrorism       9     Unauthorised Access       10     Human Trafficking      ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 581. Deputy Cormac Devlin asked the Minister for Justice, Home Affairs and Migration the number of cases dealt with by the Garda National Cyber Crime Bureau in each of the years 2020 to 2025; the top ten categories of offences addressed by the Bureau; and if he will make a statement on the matter. [73750/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_554",
          "debateSectionId": "dbsect_554",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_554.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_581",
        "questionNumber": 581
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Road Traffic (Electric Scooters) Regulations 2024 provide that an e-scooter must have a maximum design speed of 20 kilometres per hour or less. An e-scooter which does not meet the technical requirements may not legally be used on public roads.  An Garda Síochána undertook a Proof of Concept project for the introduction of mobile dynamometers for the purpose of enforcing these e-scooter regulations at the roadside. Four mobile dynamometers were distributed across the four Garda Regions (one in each Region). Dedicated targeted operations took place with a particular focus on urban areas and larger towns.  I am advised by the Garda authorities the Proof of Concept evaluation period has now been concluded following the use of the four dynamometer devices nationally.  They have further advised an evaluation report is currently being completed which will guide the future use of these devices and include recommendations as to future purchases of such devices. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 582. Deputy Cormac Devlin asked the Minister for Justice, Home Affairs and Migration whether the pilot project involving the use of dynamometers has been completed across all four Dublin Metropolitan Region divisions; if not, when the pilot is expected to be completed; and if he will make a statement on the matter. [73752/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_555",
          "debateSectionId": "dbsect_555",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_555.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_582",
        "questionNumber": 582
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality (Deputy Norma Foley)  Significant Capital funding has been allocated through the NDP review process to refurbish an accommodation unit currently not in use in Oberstown Detention School. Department officials have recently written to the OPW requesting commencement of planning and design of this vacant unit onsite as soon as possible. It should be noted refurbishment will likely take a minimum of two years to complete.  I continue to consider the matter in detail with the Oberstown team. I believe it may be necessary to provide for a small increase in the near future in the maximum number of boys that may be detained at Oberstown. The Director has been asked to consider what preparations may need to be made on the Oberstown Campus for that.  Detention of children is used as a last resort and Oberstown is one part of a wider Youth Justice system with many effective alternatives to detention available in the Irish Youth Justice system such as the highly successful Youth Diversion Programmes operating nationwide. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 596. Deputy Cormac Devlin asked the Minister for Children, Disability and Equality to outline the plans in place to increase capacity at Oberstown Children Detention Campus, including any timelines for delivery; and if she will make a statement on the matter. [73747/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_570",
          "debateSectionId": "dbsect_570",
          "showAs": "Child Detention Centres",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_570.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_596",
        "questionNumber": 596
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Defence  The Director of Military Prosecutions (DMP) is statutory position, provided for in the Defence Acts, and clearly distinguishable from other posts, at the rank of Colonel. Defence Force Regulation (DFR) 02/2020, provides that the holder of the post of Director of Military Prosecutions (DMP) cannot be a member of a Representative Association.  The Department is progressing the amendment to the Regulations to remove the prohibition of membership of RACO for the Director of Military Prosecutions with a view to having this matter resolved as soon as practicable. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 132. Deputy Cormac Devlin asked the Minister for Defence when she expects to sign the Defence regulation in order to allow the Director of Military Prosecutions to once again be a member of a representative association; and if she will make a statement on the matter. [71656/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_71",
          "debateSectionId": "dbsect_71",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_71.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_132",
        "questionNumber": 132
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  I intend to meet with the Defence Force Representative associations in the New Year. I am very proud to be Minister for Defence and I know that the dedication, duty and patriotism demonstrated by members of our Defence Forces is second to none.  As you know, I launched the Defence Sectoral National Development Plan(NDP) 2026-2030 last week, which is worth €1.7 billion and is the most significant investment package in the Defence Forces in the history of the State. I am determined to ensure that members of our Defence Forces have the equipment, infrastructure and capabilities they need to operate safely and effectively, at home and abroad. The global geopolitical situation is more volatile today than at any time since the end of the Second World War.  I look forward to engaging with the Representative Associations, and getting further insight into the issues of interest to them. I know a lot of progress has been made in recent years on pay and conditions. I am interested to hear the key issues currently affecting their members. I am also interested to hear PDFORRA and RACOs views on the implementation of the Working Time Directive. In short, I am committed to constructive and meaningful engagement with the Associations in the months and years to come. I very much appreciate the work of the Representative Associations on behalf of our personnel in the Defence Forces. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 156. Deputy Cormac Devlin asked the Minister for Defence her plans to meet with the Defence Forces representative associations; and if she will make a statement on the matter. [71655/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_92",
          "debateSectionId": "dbsect_92",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_92.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_156",
        "questionNumber": 156
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 36 and 41 together.  Capital Acquisitions Tax (CAT) is a beneficiary-based tax on gifts and inheritances that is payable on the value of the property received. For CAT purposes, the relationship between the person giving a gift or inheritance (i.e. the disponer) and the person who receives it (i.e. the beneficiary) determines the maximum amount, known as the “Group threshold”, below which CAT does not arise. CAT is charged at a rate of 33% above each Group threshold.  There are three Group thresholds:  • the Group A threshold (currently €400,000) applies where the beneficiary is a child of the person giving the gift or inheritance  • the Group B threshold (currently €40,000) applies where the beneficiary is a brother, sister, nephew, niece, lineal ancestor or lineal descendant of the person giving the gift or inheritance  • the Group C threshold (currently €20,000) applies in all other cases.  In light of this issue being raised, my officials examined Capital Acquisitions Tax as part of the annual Tax Strategy Group exercise. The resultant papers outlined the tax policy considerations for the Government and the options available to it in forming this year’s Budget. They were published in advance of the Budget and are the best means of considering issues such as inheritance tax in an analytical and transparent way. The Tax Strategy Group is not a decision-making body and the papers produced by my Department are simply a list of options and issues to be considered in the Budgetary process.  Revenue have indicated that it is very difficult to cost the measure indicated by the Deputy, and have estimated that uplifting Group B to €400,000 would cost approximately €305 million. This cost is estimated on the basis that there would be two separate €400,000 thresholds. In reality however, if this measure were to be implemented, there would be just the one Group A threshold for beneficiaries from parents, aunts, uncles and brothers and sisters which may lower this cost. However, this cannot be accurately costed at this time.  A link to this year’s paper on Capital Taxes which includes some cost modelling can be found here: www.gov.ie/en/department-of-finance/collections/budget-2026-tax-strategy-group-papers/.  There is a significant cost in making changes to CAT. As such the options available for setting CAT thresholds must be balanced against competing demands, but I recognise the burden of capital taxation and will, like all taxation measures, continue to keep it under review.  In addition, I am advised by Revenue that provisional CAT receipts to the end of November 2025 are €1.076 billion.  I am further advised that statistics on CAT receipts are available on the Revenue website at: www.revenue.ie/en/corporate/information-about-revenue/statistics/capital-taxes/cat/receipts-breakdown.aspx. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 41. Deputy Cormac Devlin asked the Tánaiste and Minister for Finance if he will report on CAT receipts to date in 2025; and if he will make a statement on the matter. [64106/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_56",
          "debateSectionId": "dbsect_56",
          "showAs": "Tax Yield",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_56.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_41",
        "questionNumber": 41
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 47, 57, 64 and 66 together.  The latest Exchequer returns published at the beginning of the month show that the public finances are in a relatively good position with all tax heads recording growth in the year-to-date.  Tax revenues collected to end-October amounted to €78.8 billion, an increase of €2.4 billion or 3.2 per cent on the previous year. However, both the 2025 and 2024 tax figures are distorted by the tax component of the once-off proceeds arising from the Court of Justice of the European Union (CJEU) ruling of 2024. When these revenues are excluded underlying tax receipts stood at €77.0 billion, a €3.8 billion or 5.3 per cent increase on last year driven primarily by growth in income tax, VAT and corporation tax receipts.  Income tax and VAT have grown at a steady pace over the course of the year with income tax up by €1.1 billion on last year and VAT ahead by €0.8 billion.  Underlying corporation tax receipts (excluding CJEU proceeds from both 2025 and 2024) of €19.4 billion were ahead of the same period last year by €1.1 billion.  The fiscal position at end-October is skewed in both 2025 and 2024 by one-off revenues arising from the CJEU ruling of 2024. When these revenues are excluded an underlying deficit of €4.2 billion was recorded, a decline of €2.3 billion on the same period last year, with the decline largely due to a transfer this year to the Infrastructure, Climate and Nature Fund , which did not take place in 2024.  To date, the performance of our public finances has been broadly in line with the updated fiscal projections set out in Budget 2026 . Overall tax revenues for 2026 are forecast at €109.2 billion. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 64. Deputy Cormac Devlin asked the Tánaiste and Minister for Finance if he will report on VAT receipts to date in 2025; and if he will make a statement on the matter. [64105/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_66",
          "debateSectionId": "dbsect_66",
          "showAs": "Tax Yield",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_66.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_64",
        "questionNumber": 64
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Defence  I wish to advise the Deputy that my Department has taken the lead in the development of a National Maritime Security Strategy following identification of maritime security as a priority in last year’s Defence Policy Review. This strategy is being developed in consultation with national and international stakeholders. I look forward to its delivery to me in the coming weeks. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 164. Deputy Cormac Devlin asked the Minister for Defence the position regarding the National Maritime Security Strategy; and if she will make a statement on the matter. [69216/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_154",
          "debateSectionId": "dbsect_154",
          "showAs": "National Security",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_154.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_164",
        "questionNumber": 164
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Deputy Darragh O'Brien  As Minister for Transport, my role concerns overall policy direction and funding for public transport. There is a commitment under the Programme for Government to ensure that public transport operators provide safe and accessible access for all passengers and a commitment to work with Local Authorities and national bodies to improve public transport options and infrastructure.  Day-to-day operational decisions – such as service scheduling and capacity – are the statutory responsibility of the National Transport Authority (NTA), working with the relevant transport providers. I continue to engage with the NTA on an ongoing basis in relation to maintaining high operational standards on all forms of public transport.  The DART+ West and DART+ Coastal South projects will serve areas along the E-spine including, Broombridge (DART+ West) and Bray, Dún Laoghaire and Greystones (DART+ Coastal South). In addition, DART+ Fleet will provide a ten-year procurement framework for electric and battery-electric train fleet. The first trains of the new fleet have started arriving and are currently undergoing certification and testing.  The progression of DART+ West, Dart+ Coastal South, and DART+ Fleet is identified in the NDP Sectoral Investment Plan for Transport which was published in November 2025.  In relation to BusConnects Dublin, which is the most advanced of the programmes, there have been some positive developments recently, with An Coimisiún Pleanála having approved all 12 of the BusConnects Dublin Core Bus Corridor Schemes. The first of these Schemes, the Liffey Valley to City Centre Core Bus Corridor, is due to enter construction this month, while the contract for the second, the Ballymun-Finglas Core Bus Corridor, was signed this week and will enter construction in 2026.  The first seven phases of new bus service routes as part of the bus network in Dublin have been implemented. The NTA rolled out Phase 7, the F-Spine (Finglas to Tallaght) in October 2025.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 195. Deputy Cormac Devlin asked the Minister for Transport if he will request the National Transport Authority to set out its plans to increase capacity and frequency on DART and bus services an area (details supplied); and if he will make a statement on the matter. [69196/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_185",
          "debateSectionId": "dbsect_185",
          "showAs": "National Transport Authority",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_185.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_195",
        "questionNumber": 195
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators.  In light of the NTA’s responsibility in this area, I have forwarded the Deputy's question to the NTA for direct reply to the unanswered queries. Please advise my private office if you do not receive a response within ten working days. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 196. Deputy Cormac Devlin asked the Minister for Transport if the National Transport Authority will respond to representations regarding a matter (details supplied); when the relevant real-time passenger information display will be repaired; and if he will make a statement on the matter. [69201/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_186",
          "debateSectionId": "dbsect_186",
          "showAs": "National Transport Authority",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_186.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_196",
        "questionNumber": 196
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the planning, design and construction of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals.  The National Transport Authority's (NTA) Greater Dublin Area Strategy does not envisage the progression of a Leinster Orbital Route in it's original form.  However, it proposed the provision of offline improvements in the existing road network to cater for orbital demand. It is important to point out that it is for the relevant local authorities, in the first instance, to engage with TII regarding the progression of any proposed national road project. All projects, including those listed in the NDP or any revision to the NDP, require statutory approval and compliance with the Infrastructure Guidelines.  Noting the above position, I have referred your question to TII for a direct reply regarding the development of improvements to the national road network which may facilitate orbital traffic. Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 197. Deputy Cormac Devlin asked the Minister for Transport in view of increased capacity pressures on the existing M50 motorway, the plans to advance proposals for an outer orbital motorway around Dublin; and if he will make a statement on the matter. [69202/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_187",
          "debateSectionId": "dbsect_187",
          "showAs": "Road Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_187.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_197",
        "questionNumber": 197
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I can advise the deputy that there are no “European red notices” that are issued for aircraft.  The EU Air Safety List (ASL) is a list of air carriers that do not fulfil international safety standards. This list is provided in two parts, the first details air carriers banned from operating in the EU, with exceptions and the second are those air carriers that are subject to operational restrictions within the EU. This second set of air carriers are not banned per se, they are however restricted from operating with certain aircraft.  It should be noted that, in both cases, operations may still be possible using wet-leased aircraft from an air carrier not subject to an operating ban and that complies with all relevant aviation safety standards.  The list is publicly available and can be accessed here: https://transport.ec.europa.eu/transport-themes/eu-air-safety-list_en  As of December 2025 there are 169 air carriers banned from EU skies, this includes both individual airlines and, in some cases, all carriers licensed in particular states. If the safety authorities of a third country are not able to fulfil their international safety oversight obligations, all the carriers of that country can be put on the ASL.  The ASL is updated by the EU Air Safety Committee (ASC), which is comprised of aviation safety experts from Member States and chaired by the Commission with support from the European Aviation Safety Agency (EASA).  In considering applications for flight authorisations, the Department of Transport consults the ASL.  Separately, air operators from certain countries are subject to restrictive measures which ban them from operating in the EU, as provided for in EU regulations.  In this regard, the Department of Transport is party to a network of Member States who exchange information on the implementation of restrictive measures. Furthermore, in accordance with the applicable legislation on restrictive measures the Department of Transport can seek additional information from air operators, when required, to ensure compliance. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 198. Deputy Cormac Devlin asked the Minister for Transport the number of European red notices for aircraft that have been issued in Irish airspace over the past ten years; and if he will make a statement on the matter. [69207/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_188",
          "debateSectionId": "dbsect_188",
          "showAs": "Air Safety",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_188.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_198",
        "questionNumber": 198
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Transport  The Programme for Government includes a clear commitment to engage with relevant stakeholders to establish air connectivity between Dublin and City of Derry airports.  My Department is progressing the preparatory work necessary to establish a Dublin-Derry Public Service Obligation (PSO) air service in 2026. Stakeholder engagement is also vital and in this regard a market sounding exercise is being finalised by my Department for publication shortly. This exercise will seek views from potential passengers and stakeholders on the specification required to meet expected demand for the service in terms of aircraft capacity, fare structures, frequency and timing of services. It is also expected that this engagement will confirm the interest in and recognised benefits of the PSO air service for stakeholders in Derry and the wider North West region.  Following this, it is anticipated that a tender for the PSO air service will be published by my Department early in the new year with a view to services commencing by October 2026, or earlier if operationally feasible.  I can assure the Deputy that this current timeline is the optimal timeline to ensure that the detailed work required to establish a service on this route can be completed so that a new service can be launched successfully. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 199. Deputy Cormac Devlin asked the Minister for Transport the plans and progress in relation to the recently announced air service between Dublin Airport and City of Derry Airport; and if he will make a statement on the matter. [69211/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_189",
          "debateSectionId": "dbsect_189",
          "showAs": "Air Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_189.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_199",
        "questionNumber": 199
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is, in the first instance, the primary body responsible for the matter the Deputy has raised. I will arrange for your query to be forwarded to the NCSE for their attention and direct reply.  Deputies are also welcome to raise such queries with the NCSE directly through their dedicated Oireachtas query line at oireachtasqueries@ncse.ie.  The NCSE advise that there are four schools closing in June 2025 and consequently the special need assistant (SNA) posts have been removed. No other SNA post will be removed from any other schools for the 2025/26 school year.  While the NCSE has identified at this time approximately 70 posts in schools where the care needs have reduced, in preparation for the SNA Redeployment scheme currently in development it is not intended that these posts will be removed from a school’s overall allocation until the end of the 2025/26 academic year.  This will allow for the SNAs involved to continue to support the school community for an additional year at which point the recently announced SNA re-deployment scheme will become fully operational and available to the affected SNAs. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 391. Deputy Cormac Devlin asked the Minister for Education and Youth the status of a case (details supplied); if a review of the case can be undertaken; and if she will make a statement on the matter. [69212/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_351",
          "debateSectionId": "dbsect_351",
          "showAs": "Departmental Reviews",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_351.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_391",
        "questionNumber": 391
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 392 and 393 together.  My Department successfully secured REPowerEU funding to expand the School Pathfinder Decarbonisation and Retrofit Programme during summer 2025. The Department’s submission drew on data collected through the Energy Inventory Pilot, this pilot did not include the Dublin area, the pilot included counties Kildare, Meath, Offaly, Wicklow and Wexford.  A condition of the funding from the RePowerEU Programme was that the works must be delivered within a specified timeframe. A total of 40 schools across these five counties were included in the initial assessment phase. The Programme targeted schools of a scale and size that enabled significant works to be completed within a single school term or summer holiday period. As such, the schools selected are typically eight- to ten-classroom primary schools and post-primary schools of similar floor area. Participation in the programme is by selection rather than by application.  As part of a risk management approach to ensure the achievement of Value for Money and the full utilisation of the EU funding within the tight timelines, a total of 40 schools participated in the planning and design stages of the programme on the agreed basis that not all projects would proceed to construction. This provided flexibility in managing risks such as planning delays, ESB Networks infrastructure requirements, and challenges in tendering or project delivery.  Each school underwent a detailed, staged assessment process with final decisions based on key criteria including technical feasibility, value for money, alignment with programme timelines and compatibility with the overall funding envelope. In the case of the schools that did not proceed to works at this stage, factors such as value for money, delays in securing planning permission and challenges during the tendering process influenced the outcome.  The typical works included in the programme entailed retrofit to achieve a minimum Building Energy Rating (BER) of B, through the installation of heat pumps, LED lighting and mechanical heat recovery ventilation. Fabric and airtightness upgrades will also be carried out, alongside the installation of electric vehicle chargers.  Of the 40 schools assessed, 28 were successfully brought to construction stage this summer.  This REPowerEU support represented a once-off allocation to Ireland, and therefore no additional schools will be added to this programme. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 392. Deputy Cormac Devlin asked the Minister for Education and Youth the number of schools that have applied for retrofitting under the REPowerEU pathfinder programme to date; the number of these applications from Dublin; the current stage of these schools in the process; when the next round of announcements for retrofitting projects under the programme will be made; and if she will make a statement on the matter. [69214/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_352",
          "debateSectionId": "dbsect_352",
          "showAs": "School Management",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_352.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_392",
        "questionNumber": 392
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I propose to take Questions Nos. 392 and 393 together.  My Department successfully secured REPowerEU funding to expand the School Pathfinder Decarbonisation and Retrofit Programme during summer 2025. The Department’s submission drew on data collected through the Energy Inventory Pilot, this pilot did not include the Dublin area, the pilot included counties Kildare, Meath, Offaly, Wicklow and Wexford.  A condition of the funding from the RePowerEU Programme was that the works must be delivered within a specified timeframe. A total of 40 schools across these five counties were included in the initial assessment phase. The Programme targeted schools of a scale and size that enabled significant works to be completed within a single school term or summer holiday period. As such, the schools selected are typically eight- to ten-classroom primary schools and post-primary schools of similar floor area. Participation in the programme is by selection rather than by application.  As part of a risk management approach to ensure the achievement of Value for Money and the full utilisation of the EU funding within the tight timelines, a total of 40 schools participated in the planning and design stages of the programme on the agreed basis that not all projects would proceed to construction. This provided flexibility in managing risks such as planning delays, ESB Networks infrastructure requirements, and challenges in tendering or project delivery.  Each school underwent a detailed, staged assessment process with final decisions based on key criteria including technical feasibility, value for money, alignment with programme timelines and compatibility with the overall funding envelope. In the case of the schools that did not proceed to works at this stage, factors such as value for money, delays in securing planning permission and challenges during the tendering process influenced the outcome.  The typical works included in the programme entailed retrofit to achieve a minimum Building Energy Rating (BER) of B, through the installation of heat pumps, LED lighting and mechanical heat recovery ventilation. Fabric and airtightness upgrades will also be carried out, alongside the installation of electric vehicle chargers.  Of the 40 schools assessed, 28 were successfully brought to construction stage this summer.  This REPowerEU support represented a once-off allocation to Ireland, and therefore no additional schools will be added to this programme. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 393. Deputy Cormac Devlin asked the Minister for Education and Youth the way in which schools can apply for retrofitting under the REPowerEU pathfinder programme; the way in which applications are assessed; the criteria used in determining eligibility and priority; the way in which schools are ultimately selected for inclusion in the programme; and if she will make a statement on the matter. [69215/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_352",
          "debateSectionId": "dbsect_352",
          "showAs": "School Management",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_352.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_393",
        "questionNumber": 393
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 487 and 488 together.  My Department sets national-level policy in relation to Cost Rental and provides funding for delivery of new Cost Rental homes. Operational matters like the management of homes and tenancies are handled by the particular Cost Rental landlords.  Where an Approved Housing Body (AHB) has purchased or constructed a Cost Rental property that is in their ownership, the responsibility for management and maintenance of that property is a matter for the AHB. Each AHB typically has their own tenant handbook/tenancy agreement whereby both the roles of the AHB and the tenant are clearly defined.  AHBs must comply with Private Rental Standards, just as with any tenancy in the private rental sector. If a tenant thinks their accommodation is sub-standard or their landlord refuses to carry out repairs that are needed, they may ask the Local Authority to have the landlord comply with the standards.  All Cost Rental tenancies are also required to be registered annually with the Residential Tenancy Board (RTB) whereby both the AHB and the tenant can avail of the RTB's legally-binding dispute resolution service, where relevant. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 487. Deputy Cormac Devlin asked the Minister for Housing, Local Government and Heritage if he will engage with an organisation (details supplied) to request information in relation to a matter (details supplied); and if he will make a statement on the matter. [69203/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_424",
          "debateSectionId": "dbsect_424",
          "showAs": "Defective Building Materials",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_424.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_487",
        "questionNumber": 487
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 487 and 488 together.  My Department sets national-level policy in relation to Cost Rental and provides funding for delivery of new Cost Rental homes. Operational matters like the management of homes and tenancies are handled by the particular Cost Rental landlords.  Where an Approved Housing Body (AHB) has purchased or constructed a Cost Rental property that is in their ownership, the responsibility for management and maintenance of that property is a matter for the AHB. Each AHB typically has their own tenant handbook/tenancy agreement whereby both the roles of the AHB and the tenant are clearly defined.  AHBs must comply with Private Rental Standards, just as with any tenancy in the private rental sector. If a tenant thinks their accommodation is sub-standard or their landlord refuses to carry out repairs that are needed, they may ask the Local Authority to have the landlord comply with the standards.  All Cost Rental tenancies are also required to be registered annually with the Residential Tenancy Board (RTB) whereby both the AHB and the tenant can avail of the RTB's legally-binding dispute resolution service, where relevant. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 488. Deputy Cormac Devlin asked the Minister for Housing, Local Government and Heritage if he has engaged with an organisation (details supplied) regarding a matter; and if he will make a statement on the matter. [69204/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_424",
          "debateSectionId": "dbsect_424",
          "showAs": "Defective Building Materials",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_424.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_488",
        "questionNumber": 488
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  I am advised by the Social Welfare Appeals Office that an Appeals Officer, having fully considered all of the available evidence, has decided to disallow the appeal of the person concerned by way of a summary decision.  According to the supporting evidence provided, the appellant was out of the State during the backdating period, and therefore was not entitled to Jobseeker's Pay Related Benefit for that period. His application was awarded from the date he returned to the state. The original application was processed from the earlier date in order to establish his entitlement to the appropriate rate of Pay Related Benefit.  The person concerned will be notified of the Appeals Officer’s decision in the coming days. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 541. Deputy Cormac Devlin asked the Minister for Social Protection if his attention has been drawn to the case of a person (details supplied); and if he will make a statement on the matter. [69200/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_469",
          "debateSectionId": "dbsect_469",
          "showAs": "Departmental Correspondence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_469.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_541",
        "questionNumber": 541
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  The naturalisation application referred to by the Deputy was refused by my Department. The person cited did not supply the requested documentation, therefore, the application was deemed ineligible and subsequently closed.  It is open to the person cited to make a new application at any time. There is no time limit within which they can make a new application, nor is there any maximum limit on the number of applications.  To maintain the integrity of the file on record, Citizenship Division do not return documentation submitted. However, should applicants wish to lodge a new application, they may request all relevant documents previously submitted to be associated with the new application.  Citizenship Division have produced a guidance document for all potential applicants, outlining which documents are required for the application. This document is published on my Department's Irish Immigration website and is available here: www.irishimmigration.ie/wp-content/uploads/2024/04/Citizenship-Guidance-Document-April-2024.pdf .  Detailed information on how to apply for naturalisation and other resources is available here: www.irishimmigration.ie/how-to-become-a-citizen/.  As an Oireachtas member, you can also request the status of individual immigration cases by e-mail, using the Oireachtas Mail facility at: IMoireachtasmail@justice.ie, which has been specifically established for this purpose. This service enables up to date information on such cases to be obtained without the need to seek information by way of the Parliamentary Question process. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 597. Deputy Cormac Devlin asked the Minister for Justice, Home Affairs and Migration if his attention has been drawn to the case of a person (details supplied); if he will review the details of the case and provide an update on its current status; and if he will make a statement on the matter. [69197/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_506",
          "debateSectionId": "dbsect_506",
          "showAs": "Departmental Correspondence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_506.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_597",
        "questionNumber": 597
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The removal of people who are involved in criminality and those who are a danger to society is a priority for me as Minister and my Department works closely with An Garda Síochána and the Irish Prison Service to ensure high risk persons are prioritised for removal from Ireland.  I can advise the Deputy that on Monday 13 October 2025, removal orders were enforced against 23 Romanian citizens who were removed from Ireland by charter flight. These orders were made in accordance with the Free Movement Directive (Directive 2004/38/EC), on grounds of criminality and re-entry bans of up to 10 years have been applied to prevent their return to Ireland.  Under the European Communities (Free Movement of Persons) Regulations 2015, which transposes the Free Movement Directive (Directive 2004/38/EC) into Irish law, orders can be made for both the removal and exclusion of citizens of the European Union, European Economic Area and Switzerland or their family members who represent a danger to public policy or public security. These orders can be made on the grounds of that the individual’s personal conduct represents a genuine, present and sufficiently serious threat affecting one of the fundamental interests of society.  A removal order means the person must leave Ireland and if an exclusion order is made a re-entry ban can be imposed for a specified period, of up to ten years.  The table below details the number of orders which have been enforced under the European Communities (Free Movement of Persons) Regulations 2015 from 2019 to 05 December 2025.     Year    2019    2020    2021    2022    2023    2024    2025*      Removal Orders Enforced    64    32    42    37    21    18    49     *(to 05/12/2025)  * Please note, figures are correct at time of issue, however, all statistics may be subject to data cleansing.  Information regarding the reasons for removal, the date on which each order was made and implemented, and whether a ten-year ban was applied in each case is recorded on each individual person’s file and is not available in a format which would readily allow detailed data to be extracted in the manner sought by the Deputy. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 598. Deputy Cormac Devlin asked the Minister for Justice, Home Affairs and Migration for a breakdown, by year, of the number of individuals removed from the State under the European Communities (Free Movement of Persons) Regulations 2015, which transpose the free movement directive; the reasons for removal in each case; the date on which each order was made and implemented; whether a ten-year ban was applied in each case; and if he will make a statement on the matter. [69208/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_507",
          "debateSectionId": "dbsect_507",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_507.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_598",
        "questionNumber": 598
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As the Health Service Executive (HSE) holds responsibility for the provision, along with the maintenance and operation of Primary Care Centres, I have asked the HSE to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 891. Deputy Cormac Devlin asked the Minister for Health to provide an update on the capital project referred (details supplied); if she will request that local TDs are consulted prior to any report being finalised; and if she will make a statement on the matter. [69210/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_737",
          "debateSectionId": "dbsect_737",
          "showAs": "Primary Care Centres",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_737.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_891",
        "questionNumber": 891
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 1 to 12 together.  The UK Prime Minister Keir Starmer and I both attended the recent G20 Summit in South Africa. We had a number of conversations in the margins of meetings there, including on the situation in Ukraine, on which an informal meeting of the coalition of the willing took place. Previously, I met with Prime Minister Starmer at Chequers on 12 September. We discussed a broad range of matters, including the positive state of bilateral relations between Ireland and the UK. We also discussed the legacy framework - this was one of the reasons I went to Chequers - which was published subsequently on 19 September. The Prime Minister and I took note of progress on the UK-Ireland 2030 programme of strategic co-operation since the summit on 6 March on implementation across each of the programme’s four pillars of security, justice and global issues; climate, energy and innovation; growth, trade and investment; and culture, education and people-to-people links. We looked ahead to the second UK-Ireland summit, which Ireland will host in the spring of 2026. This work complements that undertaken under the British-Irish Council, which will meet in Wales later this week, and the British-Irish Intergovernmental Conference, which took place in Dublin on 17 November.  The Prime Minister and I also discussed a range of international issues, including the catastrophic situation in Gaza. We agreed in particular on the then urgent need for a ceasefire, the release of hostages and the delivery of humanitarian aid at scale, as well as finding a pathway to a two-state solution for a lasting peace. We committed to continue to work together with the coalition of the willing to strengthen support for Ukraine and increase pressure on Russia to stop its war of aggression on the people of Ukraine.  Deputies may wish to be aware that the First Minister of Scotland, John Swinney, was in Ireland last week to mark the agreement of a new bilateral co-operation framework between Ireland and Scotland. The new framework includes six broad areas for future co-operation, including in the context of a strengthened Ireland-UK relationship. I also met with First Minister Swinney in Government Buildings during his visit. \n Deputy Brendan Smith  I have had numerous opportunities in this House to welcome in general terms the legacy framework that was agreed between the British and Irish Governments and published in early September. There is an urgent need to enact legislation to give effect to the provisions outlined in the framework. Did the Taoiseach detect an urgency or a very strong commitment from the UK Prime Minister on the need to get this issue dealt with? Many families have waited for justice for decades and decades. We have to move on and get progress on the rights, the concerns and the grief that engulfs so many families of victims for many decades now. At the end of this month, we will mark the 53rd anniversary of the Belturbet bombing, which cost the lives of two young teenagers. We also have had significant dates in relation to commemorations, for example marking the terrible atrocities in Monaghan and Dublin in May 1974. There are so many atrocities for which nobody has been brought to justice. We cannot ever attach enough urgency to trying to deal, once and for all, with legacy issues. \n Deputy Ruth Coppinger  The right to protest against the genocide in Palestine is being severely undermined the UK and this is being carried through to the North as well. I want to raise a case with the Taoiseach that he could raise with the Prime Minister. This is the case of Saoirse Wagner, a student at Queen's University in Belfast, who is being threatened with expulsion for taking part in a peaceful, calm and non-threatening protest on the issue of Palestine. The Palestine assembly in the college protested at the careers fair to highlight companies that are participating in the genocide. I think the Taoiseach will agree with me that taking part in student protest is a fundamental right and so important in our democracy. To threaten a student with their whole third level education being completely taken away for participating in a peaceful protest is something we should take a stand against. I ask the Taoiseach to make representations to the college. Saoirse is known to me. I know that she would not participate in anything violent. I ask the Taoiseach to take this case on board. \n Deputy Ruairí Ó Murchú  We are coming up to the 50th anniversary of the Dundalk bombing, which happened on 19 December 1975. Dundalk lost Hugh Watters, who was a local tailor and a well-respected man, and Jack Rooney, a fireman and a man who worked for the council. Obviously, this was devastating for their families. A memorial event has been organised by the families. It is going to happen near the courthouse, where there is a plaque, at 6.15 p.m. on Friday, 19 December. I think it is very important that we commemorate this 50th anniversary. It was the same night as the attack on Donnelly's Bar in Silverbridge where three people were killed. This was carried out by the Glenanne gang. We know this was a UVF gang which had members of the UDR and the RUC within it and obviously, the British state was up to its neck in relation to it. I would ask about the engagement around producing a framework that will actually deliver for families like these that have been failed and that Britain does not walk away from its role and its dirty war that it fought in Ireland. \n Deputy Richard Boyd Barrett  The Taoiseach said he discussed Gaza and Palestine with Keir Starmer. A standard tactic of the Israeli state has been to say that anybody who criticises Israel for genocide, apartheid, ethnic cleansing or the persecution of Palestinians, is somehow antisemitic. Keir Starmer, of course, has a record of going along with that nonsense and attacking people like Jeremy Corbyn, who is one of the most long-standing anti-racists and an absolute opponent of antisemitism. It is an outrageous accusation. We have now seen an instance of our own ambassador being dressed down by an Israeli minister, who accused the Irish people and the Irish Government of antisemitism. I would like to know what the Taoiseach thinks about that. Is he capitulating to that bullying by the Israeli state by intervening on the proposal to rename Herzog Park? This is an entirely justified proposal, given Chaim Herzog's history of involvement in ethnic cleansing of Palestinians. \n Deputy Peadar Tóibín  A series health crisis is arising in the North of Ireland at the moment. Sinn Féin, the DUP, the UUP and the Alliance Party are closing down key hospital services in Daisy Hill Hospital, Enniskillen and Causeway Hospital in Derry. These closures are having a significant effect on services. Patients in Craigavon hospital are waiting for 19 hours to see their emergency doctor. The waiting time at the emergency department in the Royal Victoria Hospital is nine hours.  One day, there were 40 ambulances stuck at hospitals trying to deliver their patients. The longest waiting time was 13 hours. I pay tribute to the SOS Causeway Hospital campaign and Gemma Brolly, who is involved in that.  The boss of the British Medical Association in the North stated that an all-Ireland GP service would be a way to help resolve these crises. Daisy Hill, Enniskillen and Causeway all have hinterlands that feed into the South of Ireland in areas where there is great need for hospital services too. Is the Taoiseach speaking to the British Prime Minister about developing an all-Ireland health service? \n Deputy Liam Quaide  When I asked the Taoiseach about flood relief for east Cork villages last week, he accused me of being sly in how I had raised the question. That adjective could be more fairly levelled at his British counterpart, Keir Starmer, who built his political career on the basis of being a human rights lawyer and unifier of the left. In power, he has enthusiastically supported the imprisonment of people for years who protest against climate inaction, along with the designation of protesters of genocide as terrorists. I fully appreciate that the UK makes its own political decisions and that we have to maintain good relations with political leaders with whom we often might have major disagreements, but it is also true that Irish citizens are affected by Starmer’s authoritarian crackdown on peaceful protests. Acclaimed novelist Sally Rooney has been prevented from collecting a prestigious Sky Arts award in person due to fears of arrest for her support of Palestine Action. Great-grandmother Máire Ní Mhurchú, originally from Douglas in Cork, was arrested in London in September, along with her sisters Gráinne and Olga, for a peaceful protest against genocide. When the Taoiseach met Keir Starmer, did he raise with him his government's aggressive and authoritarian approach to peaceful protest and its impact on Irish as well as British citizens? \n Deputy Shane Moynihan  With reference to the Taoiseach’s meeting with British Prime Minister, Keir Starmer, I note the progress made by the UK Government with regard to dealing with legacy, and I compliment Deputy Smith on his work in this area in particular.  I note the publication this week by the House of Commons Northern Ireland Affairs Committee around legacy. One of the more interesting recommendations was that Ireland needs to do more with regard to legacy. I would love to hear the Taoiseach's thoughts on that given that all of the legacy investigations of this country have been ECHR compliant, which is not necessarily something that can be said in the case of the UK.  I call for increased and accelerated action on, in particular, the Dublin and Monaghan bombings. That has been raised many times in this House and it needs to fall under the ambit of the legacy issues as well.  What engagement has the Taoiseach had with the Prime Minister on the ongoing humanitarian disaster of a crisis in Sudan, somewhere the international community needs to step up and pay attention? I wish to hear his thoughts on their engagement on that matter. \n Deputy Rose Conway-Walsh  There can be no watering-down of the commitments made in the British and Irish Governments' joined legacy framework. There are parts of that framework I question but it is very important. I welcome the Northern Ireland Affairs Committee report on this legacy legislation. The primary legislation underpinning the political framework is moving through Westminster. The bottom line is that the legislation must command the confidence of the families and be human rights compliant in order for it to properly deal with the legacy of the past. Reports that the legislation, which is already weak in parts, could be watered down are extremely concerning and will not be accepted. It is deeply concerning that any legislation would provide the British Secretary of State with the power to veto disclosure on national security grounds for family reports from the information retrieval body, the ICIR and the new legacy commission. All families and survivors have the right to have an Article 2-compliant investigation into the deaths of their loved ones. \n Deputy Paul Murphy  A new defence co-operation agreement with Britain is to be signed soon. Members of the House of Lords are saying it will mean a stronger defence relationship between Ireland and the UK. The Taoiseach himself has said there must be very close co-operation with the British when it comes to security. Does he really think that is what Irish people want? Has he forgotten that our neutrality originates from an anti-imperialist struggle against Britain, a struggle Fianna Fáll once fought for? Can he tell us what will be in this new military agreement? Britain is increasing its military expenditure by £67.7 billion. It is an active participant in the genocide in Gaza. Are we going to be expected to massively increase our military expenditure, too, as part of this new agreement? \n The Taoiseach  I thank all of the Deputies for raising a range of issues. Deputy Smith was the first to raise the issue of legacy. I believe there is a sincere commitment on behalf of the British Government as to the implementation of the legacy framework. That is shared by Prime Minister Starmer and, indeed, Secretary of State Hilary Benn, who has acted honourably in all of the negotiations and discussions in respect of the legacy framework. I visited Chequers last September specifically on legacy, along with other issues. It was important to meet with Keir Starmer on that. He has experience of the North from a former role there.  I know the Deputy has been a strong advocate on Belturbet and Monaghan and Dublin. From our perspective, it is important that the Denton report may shed some light on the Monaghan bombing and related issues Deputy Ó Murchú raised. This is relevant also to the activities of the Glennane gang and we eagerly await its publication. Operation Kenova was quite good, in my view, particularly in terms of the victims, who were very impressed with Jon Boutcher when he was in charge of Kenova. They articulated to me that he was one of the first people they met who understood where the families of the victims are coming from.  Deputy Moynihan also raised legacy. We have responsibilities in our jurisdiction. If assertions are made about us, we need to robustly deal with them, but the most effective way to do it is to make sure we respond properly to legacy. As part of the framework agreement, the British Government has, with speed, produced its legislation. That demonstrates the seriousness with which it is approaching this essential work. We are also producing legislation once the UK legislation is enacted. The Minister, Deputy O'Callaghan, has said he is hopeful the general scheme of the Bill will be published in April or May of next year. Enabling reciprocal co-operation between the two jurisdictions is at the heart of the agreed joint framework on legacy.  Additionally, as part of the joint framework agreement, the Garda Commissioner has agreed to the establishment by the end of this year of a dedicated unit as a central point of contact in relation to Troubles-related investigations undertaken by An Garda Síochána. That is an important step forward. Unionist communities in the North have always had a view. We did the Smithwick tribunal and we dealt with it quickly as part of the commitment of earlier agreements, but we do also have to be upfront in terms of the legacy framework and respond properly and comprehensively in relation to that.  I say to Deputy Ó Murchú and all those concerned about legacy that it is not about British state violence alone. It is about that, but it is also about the role of the paramilitaries, such as the Provisional IRA. I have met families of victims who have had no closure at all in terms of atrocities committed by the Provisional IRA or the Ulster loyalist groups. The focus has to be broad-based. There is an opportunity in this legacy framework to give closure to families once and for all, after decades of a lack of closure.  Deputy Coppinger raised the issue of Saoirse Wagner and asked me to talk to the Queen's University authorities. The right to protest is sacrosanct. A number of Deputies have raised this issue. Sometimes protests impede other people from doing their normal work, which is a problem. People are entitled to protest. When the war in Gaza started, I was addressing a group of 100 law students, but the objective of a protest was to stop me and to interfere with the exercise and engagement with about 100 law students. People were shouting internally, security asked them to leave and eventually they did. I was in no doubt that the whole purpose was that I would not have that engagement. Where is the balance of rights there in terms of my freedom to speak as a public representative or the freedom of people in the community to hear me? A lot of protests have crossed the line, in my opinion, with a view to stopping things happening. During a consultative forum on security challenges that I hosted as Minister for foreign affairs two years ago, the protests at that were not about protests. They were deliberately calculated to disrupt the event. \n Deputy Paul Murphy  The forum was not about consultation either, was it? \n The Taoiseach  It was a legitimate consultation. If the Deputy believes in freedom of assembly and freedom of speech, what he and like-minded people were about was stopping that from even happening.  They never complain about that. It is fair play for them to do that. There is balance here. \n Deputy Ruth Coppinger  I do not know about the protest. \n The Taoiseach  Of course the Deputy knows about the protests. She knows all about them. \n Deputy Ruth Coppinger  I have no idea what the Taoiseach is on about. \n The Taoiseach  They were on the public television, for God's sake. \n Deputy Ruth Coppinger  I do not organise every protest in Ireland. \n The Taoiseach  They were on the public television, in the media and everywhere. In this House----- \n Deputy Paul Murphy  That does not make it terrorism. \n The Taoiseach  -----assertions were made. I am not calling it that. \n An Ceann Comhairle  The Deputies are only delaying the next question. \n The Taoiseach  The point I am illustrating is that there are different forms of protest on the continuum and some of those forms are unacceptable----- \n Deputy Ruth Coppinger  We did not organise----- \n An Ceann Comhairle  Deputy, stop engaging, please. \n The Taoiseach  -----as an infringement of the rights of people generally. That is the point I am making. \n An Ceann Comhairle  The time has elapsed. \n Deputy Ruth Coppinger  I am just correcting a mistruth there. \n The Taoiseach  It is not a one-way street----- \n An Ceann Comhairle  It does not matter. \n The Taoiseach  -----all of the time. That is the point I am making. Ramming gates at Shannon Airport is not a legitimate form of protest. Stopping trade through Dublin Port is not a legitimate form of protest----- \n Deputy Ruth Coppinger  We are not. \n The Taoiseach  -----because people's livelihood depends on it. Eighty per cent of trade in this country goes through Dublin Port. Having a problem with a company is not a justification, in my view, for disrupting the entire port. I have no problem having a debate. I participated in protests as a student. I think student protests are important. \n Deputy Ruth Coppinger  Did you? \n An Ceann Comhairle  This is not a debate. \n The Taoiseach  I did, actually \n Deputy Ruth Coppinger  Okay, I will look that one up. \n The Taoiseach  The Deputy can do that. Joe Duffy was put in prison as a result of that protest. It was to do with medical cards. There you are now. Students in this country automatically had medical cards at one time. That was taken away in the eighties. The point is that legitimate protests----- \n Deputy Ruth Coppinger  Which party was that? \n An Ceann Comhairle  Ah please, Deputy, we have to get through this. \n The Taoiseach  I think it was the Deputy's former colleagues in the Labour Party. \n An Ceann Comhairle  Taoiseach, are we moving on? \n The Taoiseach  That is history. Protests happen, and I have no issue with that, but there is a continuum. I will take the Ceann Comhairle's advice.  To Deputy Ó Murchú, I have dealt with some of the legacy issues, which Deputy Conway-Walsh also raised. I will talk to Queen's University on that point. In terms of the Dundalk bombing and the Glennane gang, I hope Operation Denton will shed light on that. \n Deputy Peadar Tóibín  What about the health services? \n The Taoiseach  I will come to that. On Deputy Boyd Barrett's question, there is no relationship between the strategy and policy of the Israeli Government and my views on the renaming of Herzog Park. I have a very basic view. Throughout the history of the State, there have been namings and renamings. I am, and have been, a student of history and I taught students. I always showed them that the names of parks could be the remnants of empire or anything, but they are windows to explain the history of a given subject or personality. If we keep shutting down everything that is named after somebody, there will be no history left. \n Deputy Paul Murphy  When was it named Herzog Park? \n The Taoiseach  There will not be a history left. \n Deputy Paul Murphy  When was it named Herzog Park? It was ten or 20 years ago. \n An Ceann Comhairle  Please move on, Taoiseach. \n The Taoiseach  That is not the point. \n Deputy Paul Murphy  That is not history. \n The Taoiseach  It is, actually, if you go back through his father and before that and examine how Jewish communities came to Ireland in the first instance. There is huge history there, for God's sake. \n Deputy Paul Murphy  But not the park. \n An Ceann Comhairle  Deputy----- \n Deputy Paul Murphy  It is still history if you change the name of the park. \n The Taoiseach  As a historian and someone who is interested in history, I would be very careful. \n An Ceann Comhairle  -----you are verging on disruptive. \n The Taoiseach  Breandán Ó hEithir wrote in Lig Sinn i gCathú about the thirties when places were being shut down left, right and centre. \n An Ceann Comhairle  Seven more Deputies, Taoiseach. \n The Taoiseach  There is a lot more to it than that, but it has nothing to do with this. I can put Deputy Boyd Barrett at ease in that regard. \n An Ceann Comhairle  There are seven more Deputies to answer, Taoiseach. \n The Taoiseach  By the way, I object, like the Deputy does, to Israel's consistent messaging that if you are not onside, you are offside or antisemitic. That is wrong. You are entitled to be against Israeli Government policy and criticise it and not be labelled antisemitic. That is absolutely correct and I support it.  Deputy Tóibín should talk to his former colleagues in Sinn Féin in earnest and engage with them on the health services in Northern Ireland. That is one issue. There are broader problems with the National Health Service generally, but there are real issues in Northern Ireland. There is no question about the pressures on the health service there. \n Deputy Peadar Tóibín  There are benefits to an all-Ireland health service. \n An Ceann Comhairle  Deputy, this is not a continuous back-and-forth. I am not allowing that. This is Taoiseach's Questions. The Deputy has asked a question and is getting an answer. \n The Taoiseach  Under the shared island initiative, we are trying to do specific projects and programmes, for example in paediatric and cardiovascular health, cardiac surgery and the cancer centre at Altnagelvin hospital. Those are good programmes that have worked very well.  Deputy Quaide referred to Prime Minister Starmer. I do not see him as an authoritarian person when I meet him. I spoke about the continuum of protest. I am not au fait with British security services or why they came to do what they did in respect of Palestine Action. We have proceeded differently in this country. When I meet Prime Minister Starmer, I will have an opportunity to deal fundamentally with a range of issues although we cannot deal with every single issue. The UK has had challenges on both sides of the political spectrum in respect of protests and the nature of those protests.  I dealt with the points raised by Deputy Shane Moynihan about Operation Denton. The Sudan issue is one I have raised consistently with leaders, including publicly, at the G20 summit and at the Africa-European Union summit. It is catastrophic. It rarely gets mentioned in this House, but 12 million people have been displaced. Genocide against the civilian population is happening there. Some of the rebel forces are being supported by neighbouring countries with arms and so forth.  To respond to Deputy Conway-Walsh, the framework is Article 2 compliant. It is far stronger than its predecessor as a legacy Bill.  Deputy Murphy raised the new co-operation agreement. It absolutely makes sense that we co-operate very closely with the United Kingdom on the gas connectors, for example. Those are a huge security vulnerability for both the UK and Ireland, but particularly for Ireland. Within a week, our economy would come to a standstill if anything untoward were to happen to those interconnectors. I hope the Deputy would agree that we should have close defence co-operation for our economic security, in particular, and for our subsea cables. That will mean a lot of technological co-operation. When a Russian shadow fleet crosses over those pipes or subsea cables, very often divers have to go down and check that the pipes are okay. That is co-operation. Letting people know that somebody who might be up to not good is in your terrain is co-operation. Intelligence services sharing information about terrorists or potential attacks is co-operation. There should be no big deal about co-operation.  By the way, on the origin of our neutrality, it was not an anti-imperialist origin. In fact, at the consultative forum, there was a very good seminar on our neutrality and its origins. Obviously, the Second World War was at the core. We were neutral in not having issues with Britain and the occupation of Northern Ireland and so on, but the more fundamental issue was that it was a neutrality of survival. No one was in a position to defend Ireland in 1939, 1940 or 1941. There were good presentations made at that consultative forum but Deputy Murphy boycotted it because he felt it was not worthwhile. It would have been informative had he gone. It would have provided a more nuanced view----- \n Deputy Paul Murphy  It is a shame the Taoiseach scrapped the idea of a citizens' assembly. \n The Taoiseach  -----of the origins of our neutrality. \n An Ceann Comhairle  I thank the Taoiseach and ask him to move to the next question. \n The Taoiseach  I apologise. I thank the Ceann Comhairle for her tolerance. \n An Ceann Comhairle  It is not my tolerance. I get complaints at the Business Committee that this forum is not working. We are going to take it to the Dáil reform committee for change. ",
        "questionType": "oral",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 2. Deputy Cormac Devlin asked the Taoiseach for a report on his recent meeting with the UK Prime Minister.  [50002/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/debate/dbsect_15",
          "debateSectionId": "dbsect_15",
          "showAs": "Official Engagements",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/debate/mul@/dbsect_15.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_2",
        "questionNumber": 2
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 5. Deputy Cormac Devlin asked the Minister for Foreign Affairs and Trade the position regarding the hostage situation in Nigeria; and if she will make a statement on the matter. [67303/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_14",
          "debateSectionId": "dbsect_14",
          "showAs": "Foreign Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_14.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_5",
        "questionNumber": 5
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The application from the person referred to by the Deputy was refused on 28 November 2025.  A decision letter issued to the person concerned via the Immigration Service Delivery (ISD) Online Forms platform outlining the reasons for refusal and the next steps they should now take.  The person concerned can now directly raise queries, and check the status of their applications, on the Immigration Service’s Customer Service Portal. They can register for, or log in to their existing account, at: www.portal.irishimmigration.ie/en/ .  As an Oireachtas member, the Deputy can also request the status of individual immigration cases by email, using the Oireachtas Mail facility at: IMoireachtasmail@justice.ie, which has been specifically established for this purpose. This service enables up to date information on such cases to be obtained without the need to seek information by way of the Parliamentary Question process. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 436. Deputy Cormac Devlin asked the Minister for Justice, Home Affairs and Migration if his attention has been drawn to an issue (details supplied); and if he will make a statement on the matter. [67963/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_386",
          "debateSectionId": "dbsect_386",
          "showAs": "Immigration Status",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_386.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_436",
        "questionNumber": 436
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Deputy Seán Ó Fearghaíl  I want to return to the question of Ukraine and to ask the Minister if she agrees that there can be no peace agreement imposed on Ukraine without its support and the support of the European Union generally. \n Deputy Helen McEntee  As the Minister of State said in reply to an earlier question, there can be nothing about Ukraine without Ukraine. That is something that has consistently been said at a European level. At this critical juncture for Ukraine, after almost four years of brutal Russian aggression, I want to again emphasise Ireland's unequivocal support and solidarity with Ukraine. I welcome the ongoing efforts of President Trump and the United States to end Russia's war of aggression against Ukraine and to achieve a just and lasting peace and security for Ukraine but also for the wider European region.  It is more important than ever that Europe and the United States continue to work together to achieve this as it can only happen with the support of Europe as well as the US. The emerging US proposals, as well as plans for further negotiations, represent a very welcome step forward. I also welcome the progress made at Sunday's meetings between the US and Ukraine in Geneva. I welcome the fact that EU institutions and member states were also present. We look forward to these talks continuing in a positive manner and to further progress being achieved.  Ukraine is engaging positively - we can see that from the commentary and President Zelenskyy himself. They are engaging constructively in these discussions despite the ongoing military assault on their towns, cities, ports and critical energy infrastructure. I do not believe the actions of Russia are the actions of a country that wants peace. However, we have to work towards that sole objective and goal.  A massive attack on Kharkiv on Sunday resulted in the loss of more innocent lives. This follows an appalling attack on Ternopil in recent weeks that killed 34 people, including six children. It is crucial that any agreement upholds Ukraine's sovereignty and independence and is based on respect for the principles of the UN Charter. The fundamental principle that borders cannot be changed by force must be upheld. Any agreement must also protect Ukraine's and Europe's vital security. That means strong, credible guarantees that ensure Ukraine can defend its sovereignty and territorial integrity to avoid a repetition of the past.  This is not just vital for Ukraine - it is also vital for the European Union and all its member states, including Ireland. It is welcome that assurances have been given that the EU will be involved in discussions on issues that directly relate to it, such as enlargement and immobilised assets. \n Deputy Seán Ó Fearghaíl  I am not sure that I agree with the Minister in welcoming the nature of the American involvement in this particular situation. It has been characterised as being on Putin's side, appearing to be on Ukraine's side, and now being back on the Putin side again. Some people think that the current peace plan was written in Russian and translated via Google Translate. I am deeply concerned about many of the provisions in that plan, which seems to have the enthusiastic support of President Trump. One could believe, given recent statements, that Secretary Rubio is perhaps more realistic in his approach and is trying to inject a level of realism into the debate, but the bottom line is that Europe must be involved so as to ensure that, as the Minister quite rightly says, nothing is done about Ukraine without Ukraine's full involvement and without Ukraine being able to benefit at the end of the day. \n Deputy Helen McEntee  We have to acknowledge that there are very clear efforts on the part of the US to try and bring about a ceasefire, while at the same time acknowledging that elements of the 28 point plan that we saw put forward very clearly need further work. We cannot have a situation where land is ceded by force. That simply cannot be the basis for any type of ceasefire. We cannot have a situation where a country cannot in the future be able to defend itself should something like this happen again. Likewise, we cannot have a situation where Europe is committed to certain things without Europe being around the table. It is really important that Europe is part of the conversations, negotiations and discussions and that Ukraine agrees to whatever is put forward.  There is a recommendation or a proposal for an unconditional ceasefire that has been on the table since March. Ukraine has been very clear that it will sign up to that. It would ensure that all lines as they currently stand would be frozen, that people would come around the table and that negotiations on many of the matters that we have seen in the 28 point plan could be discussed at that stage. I would encourage that it would be something that is still on the table. We need to make sure that we support any discussions and negotiations but that our absolute commitment and priority is that Ukraine is supported and that it agrees to whatever is on the table in the proposals. \n Deputy Seán Ó Fearghaíl  We all want peace, but what is certain is that Russia cannot be rewarded for its crimes. It should not be readmitted to the G8 or reintegrated into the global economy.  The plan, for example, demands Ukrainian denazification, effectively validating Russia's absurd narrative that Ukraine is riddled with Nazis. I have been there, as have other Members of this House, and I do not think there is any evidence available to that end.  There have been war crimes committed in Bucha, Irpin and other places, forced relocations to Russia of children, repeated strikes on apartment buildings, most recently in the western city of Ternopil, and the torture, abuse and execution of Ukrainian prisoners of war. Despite all this, the plan, as it currently stands, grants the Kremlin full immunity from prosecution. Does the Minister agree that whatever agreement might be reached there can be no normalisation of EU relations with Russia while the monster Putin is president? \n Deputy Brian Brennan  I welcome the Government providing over €100 million in non-lethal military support to Ukraine. I welcome 116,000 Ukrainians here under the temporary protection directive, with it being estimated that some 80,000 will stay. I have a huge concern, though, over the peace process itself and the role Europe has played in it. The 28-point plan was made up without the involvement of Ukraine, and that is so wrong. Additionally, could the Minister give us an update on President Zelenskyy's outstanding invitation to Ireland? \n Deputy Helen McEntee  I thank the Deputy. I again stress that there are very clearly elements of the plan put forward that are not realistic, not credible and will not be accepted by Ukraine and will certainly not be accepted by the EU. We must, though, use this as a framework and basis for discussions, which, to date, have not taken place. It is very clear that this is an illegal war, very clear that Vladimir Putin is responsible for war crimes and very clear that these are continuing as we speak, so we need to make sure that Ireland's voice is strong. We must continue to put pressure on Russia. In our conversations last week at the Foreign Affairs Council - and the 19th sanctions package is currently under way - there was a proposal and suggestion on a 20th package of sanctions. It is about how we can make sure we impose as much pressure on Russia as possible to try to bring it to the table, so that any negotiations around a peace process and a ceasefire are fair and balanced. It is important that Russia does feel pressure because, to date, for a lot of this ongoing war, Russia has not felt the pressure that it needs to. In Europe, we need to do everything we can through sanctions, diplomatic channels and our work with the US to make sure we can bring about a lasting peace. Again, this is not just about Ukraine, albeit that country is front and centre. This is already starting to seep into the security of European member states and we need to make sure it does not go any further. \n An Cathaoirleach Gníomhach (Deputy David Maxwell)  With the agreement of the House, I will go back to Question No. 10. Is that agreed? Agreed. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Cormac Devlin",
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08"
        },
        "questionType": "oral",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/mul@/dbsect_12.xml"
            }
          },
          "debateSectionId": "dbsect_12",
          "showAs": "Ukraine War",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/dbsect_12"
        },
        "questionNumber": 12,
        "date": "2025-11-27",
        "showAs": " 12. Deputy Cormac Devlin asked the Minister for Foreign Affairs and Trade her views on whether there can be no peace agreement imposed on Ukraine without its support and the support of the European Union; and if she will make a statement on the matter. [66597/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_12"
      },
      "contextDate": "2025-11-27"
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 3. Deputy Cormac Devlin asked the Taoiseach when the Cabinet committee on Northern Ireland will next meet. [50001/25] ",
        "answerText": " The Taoiseach  I propose to take Questions Nos. 1 to 13, inclusive, together.  The Cabinet subcommittee on Northern Ireland was created on 18 February 2025 to oversee implementation of relevant programme for Government commitments and ongoing developments in relation to Northern Ireland, Irish-British relations, and the shared island initiative. As well as considering issues relevant to the Government's position as a co-guarantor of the Good Friday Agreement, including our role in Good Friday Agreement institutions such as the North-South Ministerial Council, the British-Irish Council and the British-Irish Intergovernmental Conference, topics for discussion also include the annual UK-Ireland summits and their agreed programme of work and the continued roll-out and development of the investment, research and dialogue strands of the shared island initiative.  On 17 October, I chaired the 30th plenary meeting of the North-South Ministerial Council in Farmleigh House, Dublin. The Northern Ireland Executive was led by the First Minister, Michelle O'Neill, MLA, and the deputy First Minister, Emma Little-Pengelly, MLA. We had constructive discussions on areas of mutual issues, including business and trade matters, infrastructure and investment co-operation, and tackling gender-based violence. Our discussion also included a new agenda item on emergency planning and preparedness. We also had updates by all Ministers on North-South co-operation under their portfolios, ranging from day-to-day cross-Border engagement to major infrastructural projects. The event was preceded by a dinner at Farmleigh with Government and Northern Ireland Ministers on 16 October.  On 18 November, the Government announced allocations of over €50 million from the shared island fund for ten new projects to be delivered as part of the initiative over 2026 to 2030. Among the projects are €14 million for a major new shared island media initiative to be taken forward by Coimisiún na Meán, €5.9 million to develop cross-Border emergency management capacity on flood response and rescue operations, particularly with resources for technology and so forth, and €2 million to enable a new Dublin-Derry PSO air service to start in 2026.  Next week, along with the Tánaiste, I will attend a summit meeting of the British-Irish Council in Wales where the focus of our discussions will be on the creative industries across these islands. The Cabinet committee on Northern Ireland will continue to meet biannually on these and related matters. We will be meeting again next on 8 December. \n An Ceann Comhairle  I ask Members to please be brief and concise, as the Taoiseach needs to respond. \n Deputy Brendan Smith  I thank the Taoiseach for his reply. As he is aware, there was a general welcome for the legacy framework that was published jointly by the Irish and British Governments in early September. Could he let us know what progress is being made in bringing forward the necessary legislation to enact that framework and to ensure that all of these issues are dealt with through putting the victims first and at the centre of the framework and the modus operandi of dealing with these legacy issues?  Another thing I have consistently raised is the Belturbet bombing of December 1972 and the Dublin-Monaghan bombings of 1974. Again, the British Government has not co-operated to the extent necessary to ensure a comprehensive investigation into the Dublin-Monaghan bombings. Will the Taoiseach let us know if that will continue to be on the agenda in all discussions at Government level with his British counterparts? \n Deputy Erin McGreehan  I would like the Taoiseach to outline whether the Cabinet committee discussed the cross-Border economy, particularly in counties such as Louth where these issues are felt most acutely. Will there be specific actions in relation to tax and administrative complications facing cross-Border workers, including the differentiations between the pricing of alcohol and fuel between both jurisdictions and the impact of that in the distortion of local trade and the undermining of businesses and broader communities?  I support my colleague Deputy Smith in relation to the bombings. I also highlight that it will have been 50 years this December since the Dundalk bombing where people tragically lost their lives. \n Deputy Barry Heneghan  Regarding the cross-Border organisation Foras na Gaeilge, if it had the same growth as the Arts Council, Foras na Gaeilge's budget would now be €50 million. Instead of that, níl sé ach €17 milliún. I welcome the raise in the recent budget to Foras na Gaeilge's funding, but how will the Taoiseach ensure that this additional funding is made available, given that 25% of it is from the North? \n Deputy Ruairí Ó Murchú  I have often brought up the positives regarding the shared island unit. I believe the project in relation to DkIT and its partnership with Queen's University Belfast could fit into that. However, a number of other issues arise, whether we are talking about the remote working issues that have an impact on taxation or exam certification. In fairness to Deputy McGreehan, she has brought up the issue of the disparity regarding fuel. I have spoken before about the need for some sort of means of putting these issues on the agenda properly and dealing with them.  We have made the call for a long time to get down to the issue of constitutional change and the need for a means - call it a citizens' assembly or a forum - by which this conversation can happen. The State must properly prepare for Irish unity. There has been an abject failure to do so and we cannot just wait until everybody gets on together. We need to prepare now and the onus is on the State to do it. \n Deputy Cormac Devlin  I thank the Taoiseach for the update on the work of the Cabinet subcommittee. As Cathaoirleach of the Committee on the Implementation of the Good Friday Agreement, we have had good engagements North and South. That is continuing next week with visiting MPs from Westminster. Dialogue is important in terms of the Government's good relationship with London as well as Belfast.  May I also raise the case of the 265 students and teachers who were kidnapped in Niger state in Nigeria? It is a very serious case and I would like to know what is happening there. \n Deputy Richard Boyd Barrett  Last week, I raised with the Taoiseach - I want to do so again because it is important - the fact that, as part of a wider attack by the British Government on those standing in solidarity with the people of Palestine and against Israel's genocide in Gaza, people in the North are being arrested and charged, including one of our councillors, Councillor Shaun Harkin in Derry, for indicating supporting support for Palestine Action. The designation by the Starmer Government of Palestine Action as a terrorist group is outrageous when what the group has been trying to do is stop Israeli terrorism and genocide by trying to disrupt the ability of the British state and Israeli companies to collaborate with Israel in the genocidal assault on the people of Palestine. It is happening in the North. Arrests are taking place. There was a protest this weekend where people declared their support for Palestine Action. It should not be a chargeable offence and the Taoiseach should speak out against it. \n Deputy Paul Murphy  For 15 months, an Irish citizen from County Antrim has been held without trial in an English prison and has had his rights denied. Jordan Devlin is being locked inside for 23 and a half hours per day. He is being strip searched twice daily. His mail has been withheld, his visits are blocked and his calls are denied. His sister said, \"They put him on public protection so he can't speak to anyone\". She also said:  They often don’t have vegetarian food so he can't eat. They're x-raying him and strip-searching him twice a day. He's freezing too.  He is a Palestine solidarity activist. He is charged with regard to a protest action at Elbit Systems. Elbit is the largest supplier of weapons to the Israeli genocide. He denies all the charges. His trial begins today but his judge was swapped out yesterday with no stated justification. The question is whether the Irish Government has made any representations on his behalf and whether the Taoiseach has sought to ensure that his basic rights as a prisoner and a defendant are defended as opposed to being ridden roughshod over like many other Palestine protesters. \n Deputy Ivana Bacik  I thank the Taoiseach for the update. I welcome the developments with the shared island fund. It is now clearer than it has ever been that conversations about the constitutional future of the island are picking up steam. I would dispute the Secretary of State for Northern Ireland's recent claim that there was no appetite for constitutional change in Northern Ireland. I see that the leader of the SDLP Claire Hanna and others contested that claim. In the absence of leadership from the British Government and in keeping with the principles in the Good Friday Agreement-Belfast Agreement, it is essential for our Government to take on a role of preparing in earnest for the work necessary to lay the groundwork and foundations for running a referendum on unity. We need a clear timeline to allow for that necessary groundwork to take place, to develop Green and White Papers, to allow for the work of citizens' assemblies to take place and to see progress made building on the work of the shared island unit in advance of the 30th anniversary of the Good Friday Agreement-Belfast Agreement. The Taoiseach said that the next meeting of the Cabinet subcommittee would be on 8 December. As we approach 2028, what substantive steps will that Cabinet subcommittee be announcing in terms of bringing the debate further? \n Deputy Rose Conway-Walsh  At last week's session of the Committee on the Implementation of the Good Friday Agreement, we had a profound contribution from the All-Island Cancer Research Institute and the All-Island Congenital Heart Disease Network. It highlighted once again what we have known for some time, namely, that lives can be saved and healthcare can only be delivered to an optimum level across the island when we have an all-island approach to healthcare for the 7 million people living on the island. It makes zero sense on a small island such as ours financially or otherwise to have two healthcare systems operating simultaneously. Until such time as we have a referendum on Irish unity and an opportunity to design a new and modern all-island, world-class service, I ask the Taoiseach and the Minister for Health to set aside a permanent allocation in the health budget for the delivery of healthcare on an all-island basis, utilising North-South collaboration to improve outcomes for patients in both jurisdictions and maximise the wonderful clinical expertise on the island. \n Deputy Eoin Hayes  The renewed calls for a border poll on reunification in recent months point to a definite direction of travel on the issue of a united Ireland and on that question moving from the realm of the idealistic to the practical. My party and I would welcome the opportunity to advocate for reunification and believe that a united Ireland achieved by truly informed communities North and South in a process defined by consent and deliberative consensus has the real potential to benefit the people of the entire island. However, I am concerned that as the chances of a border poll in the next ten or 15 years continue to rise to that of political inevitability, we are running out of time to ensure it takes place in such an environment. Will the Government commit to the establishment of citizens' assemblies, work towards cross-Border fora on health, economics and education and set out a positive vision? \n Deputy Peadar Tóibín  The purpose of the British legacy Bill was to grant to amnesty to those who had killed innocent civilians. There appears to be a significant contradiction in the position of the Irish and British Governments in the new joint framework that seeks to replace that. The British Government is briefing that there will be safeguards for British army veterans. I asked Simon Harris this question and he said that was separate from the joint framework and that the British were looking for their own safeguards in their own legislation. Would that separate treatment for British army veterans not undermine a joint framework? Would it not create a lop-sided justice system in the Six Counties? Will that protection for veterans apply to both sides of the conflict? Will the British secretary of state retain a veto over the disclosure of the role of paid British agents in the Troubles and will former RUC officers who played a significant role in the Troubles be part of the investigative system that is put in place? \n Deputy Conor D. McGuinness  Tá Coimisinéir Teanga nua ceaptha sna Sé Chontae, Pól Deeds. Is coiscéim chun tosaigh é seo i ndiaidh tréimhse an-fhada ag feitheamh dá leithéid. Tá Gaeilge agus pobal na Gaeilge faoi ionsaí sna Sé Chontae faoi láthair. Conas a dhéanfaidh an Taoiseach cosaint ar an bpobal seo, ar lucht labhartha na Gaeilge ó Thuaidh?  While I am on my feet, I want to raise the situation of Jordan Devlin, an Irish citizen from County Antrim who is on remand in Britain awaiting charges relating to pro-Palestinian activism there. I see this in the wider context of a crackdown on political dissent and political protest in Britain. Has the Taoiseach raised, or will he raise, this situation with the British authorities to ensure he is treated fairly in prison and will be afforded a fair trial? \n The Taoiseach  I thank all of the Deputies for raising a variety of issues. Deputy Brendan Smith was first up. In respect of the legacy framework, the measures announced in the joint framework were published in September and provide a pathway to truth and accountability. That is why I went to London to meet Keir Starmer. It was one of those trips. I take it that people accept that we have to go to London every now and again to meet the Prime Minister. It was to make sure we got the legacy Bill over the line because it is an important piece of legislation that is certainly far superior to the previous legacy Act of the last British Government.  The British Government published the Bill amending the 2023 legacy Act on 14 October, so that is the progress the Deputy was asking for. The second reading of that Bill took place in the House of Commons on 18 November. To be fair, we believe that represents speed and demonstrates the seriousness with which they are approaching this essential work. The key test for us will be whether it faithfully reflects what is in the joint framework. The Minister, Deputy McEntee, and the UK secretary of state, Hilary Benn, discussed the legacy framework in their introductory call last week.  The Tánaiste and the Minister, Deputy O'Callaghan, also discussed this with the secretary of state, Mr. Benn, at the British-Irish Intergovernmental Conference, which took place on 17 November because we, too, have responsibilities in this jurisdiction. While we can only legislate once the UK legislation is enacted, the Minister for justice, Jim O'Callaghan, has said he is hopeful that the general scheme of the Bill will be published in April or May of next year. Enabling reciprocal co-operation between the two jurisdictions is absolutely at the heart of the agreed joint framework on legacy. The Garda Commissioner is also committed to the establishment by the end of this year of a dedicated unit as a central point of contact in relation to Troubles-related investigations undertaken by An Garda Síochána. That is also in the joint framework. An Garda Síochána has also committed, where possible, to answer questions that a family may have in relation to the investigation of a Troubles-related incident and provide a report to the family.  In respect of the Belturbet and Dublin-Monaghan bombings, the publication of the Denton report may very well shed light on the Dublin-Monaghan bombings. We have to await the outcome of that. I know it is into the Glenanne Gang and the atrocities they perpetrated, but that will be important. I know that Deputy Smith has been a strong advocate on the Belturbet and Dublin-Monaghan bombings.  Deputy McGreehan raised a very important point about the treatment for tax purposes of workers who cross the Border. We do not have that resolved yet. There have been ongoing issues, or attempts to do that, between the respective Departments of finance and I am pushing through the cross-Border bodies and through the Department of Finance to get some progress on that. We are also working with employers and unions through the LEEF process to see can we make progress on it. It is an issue for the seamless transfer of workers North to South and South to North.  It is more difficult in terms of harmonisation of prices North and South. Different Governments have different policies. I have not seen today's budget in respect of the UK yet but that could even bring in more taxation. We do not know how that will manifest.  I am conscious also that it is 50 years since the Dundalk bombing.  Maidir le ceist an Teachta Heneghan, tá deacracht ann toisc an gaol atá ann. Tá dualgas ar an Executive airgead a chur ar fáil d’Fhoras na Gaeilge agus caithfimid an rud céanna a dhéanamh. Is féidir linn níos mó a chur ar fáil. Trí shared island, tá níos mó á dhéanamh againn, maraon leis an méid atá ag teacht go hoifigiúil ón Rialtas, chun gnóthaí trí Ghaeilge a chothú agus tacaíocht a thabhairt. Mar sin beimid ag déanamh sin. I will come back to the shared island initiative later.  Deputy Ó Murchú and others raised constitutional issues and so on. I think reconciliation cannot be postponed, Deputy. \n Deputy Ruairí Ó Murchú  I did not say it could be. \n The Taoiseach  The Deputy kind of said we could not wait. \n Deputy Ruairí Ó Murchú  The Taoiseach said waiting on a perfect----- \n The Taoiseach  I know. I am not trying to----- \n Deputy Ruairí Ó Murchú  He said we wait on a perfect----- \n An Ceann Comhairle  Deputy, please. The Taoiseach is answering the questions. \n The Taoiseach  I just think we need to really focus on reconciliation on a constant, constant basis. \n Deputy Ruairí Ó Murchú  That is okay. \n The Taoiseach  It is hard work but it does bear great fruit in terms of the North and South and different traditions and political backgrounds within the North as well. \n Deputy Peadar Tóibín  It is more likely to happen in a united Ireland. \n An Ceann Comhairle  Deputy, this is not a back and forth. \n The Taoiseach  It is very important that we consistently do that. I do not think citizens' assemblies are in any shape or form an appropriate route for discussing the future of Ireland or the constitutional framework into the future. \n Deputy Ruairí Ó Murchú  In a forum. \n Deputy Peadar Tóibín  The New Ireland Forum. \n The Taoiseach  I just do not believe it at all, because anyone who knows anything about the North - and I have been involved all my life politically; I have been involved in discussions about the devolution of justice, for example, and I was in the Government when the Good Friday Agreement was first signed - knows it means people-to-people engagement. It means political parties engaging. It means political traditions as well as independent politicians or people who have a view. Citizens' assemblies can be closed enough in some respects and they can be a percentage of a random percentage of the population. There were some good citizens' assemblies but for something as overarching as a future constitutional framework - I just want to give my view on this - from my experience, it simply would not cut it. You would end up with a report----- \n Deputy Peadar Tóibín  The New Ireland Forum. \n Deputy Ruairí Ó Murchú  Then come up with an alternative. \n An Ceann Comhairle  Sorry, there is a structure on this debate. \n The Taoiseach  What I am always amused by----- \n Deputy Peadar Tóibín  We are just giving suggestions. \n An Ceann Comhairle  It is not allowed. \n The Taoiseach  Fianna Fáil as a party has committed to the North with great substance over the years - Charles Haughey, Albert Reynolds and Bertie Ahern in terms of the Good Friday Agreement. In this Government and the last, we did something that has never been done in the shared island initiative. Some €1 billion from 2020 to 2025 and beyond and another €1 billion in this programme for Government, which is bringing real substance. Instead of all the rhetoric and everything else, we are doing things. Part of that has also been a very important investment in real research into the different systems North and South - into our health systems, into education completion, into energy, into enterprise, and into ecology and climate. Good stuff has been done by the Economic and Social Research Institute. I defy the Deputies to go back over the last 100 years and come up with anything that parallels the level of research we have undertaken to try to understand better the different systems and different approaches.  Now, I will put a challenge to Sinn Féin. It has been talking about this for decades but it has not produced a scrap of paper in terms of----- \n Deputy Ruairí Ó Murchú  That is not true. \n Deputy Rose Conway-Walsh  That is not true. \n The Taoiseach  One second, please. I am just trying to make a point. \n Deputy Rose Conway-Walsh  Yes, but it is not the truth. \n An Ceann Comhairle  It is not a back and forth. \n Deputy Rose Conway-Walsh  Do not tell untruths. \n The Taoiseach  In terms of a blueprint, why is Sinn Féin afraid to bring forward a blueprint? \n Deputy Rose Conway-Walsh  You are the Taoiseach. \n An Ceann Comhairle  There are seven other Deputies, Taoiseach. \n Deputy Rose Conway-Walsh  You are the leader. \n The Taoiseach  I know. \n An Ceann Comhairle  It is not a back and forth. \n The Taoiseach  We are taking our responses in terms of the Good Friday Agreement. \n Deputy Conor D. McGuinness  You lead the Government. \n The Taoiseach  I believe in the unity of the Irish people, okay,----- \n An Ceann Comhairle  Seven other Deputies, Taoiseach. \n The Taoiseach  -----but I would say to the Deputies that with everything Sinn Féin does, the onus is on the Government. The Government will take its responsibilities in relation to this but----- \n Deputy David Cullinane  I have brought forward a plan for healthcare. I will send it on to you. \n The Taoiseach  -----fo a party I would have thought was so committed as Sinn Féin is rhetorically - it keeps going on about it - it has produced very little in terms of what it believes the blueprint should be. \n Deputy Rose Conway-Walsh  We have done several studies. \n An Ceann Comhairle  Just to remind----- \n The Taoiseach  That is the point I would make----- \n Deputy Ruairí Ó Murchú  And we have engaged. \n The Taoiseach  -----because the party always wants us to produce the blueprint. \n Deputy Ruairí Ó Murchú  That is because we are not in power. \n The Taoiseach  By the way, Fianna Fáil will not be found wanting, nor will other parties, in terms of delivering substance in respect of this issue. \n Deputy Ruairí Ó Murchú  You are the Government. \n An Ceann Comhairle  Taoiseach, just to remind you there are seven other Deputies. \n The Taoiseach  That is covering all the seven really. There are a good few----- \n Deputy Peadar Tóibín  But it is not getting us anywhere. \n An Ceann Comhairle  No, the next seven, including Deputy Boyd Barrett. \n The Taoiseach  Deputy Devlin made a very important point and he has done very good work as Chair of the Good Friday committee. I certainly think he is correct in respect of what has happened in Nigeria. At the European Union-African Union Summit, that was raised in terms of what Boko Haram and various jihadist groups were doing in terms of the persecution and killing of many people, but Christians as well, and the kidnapping of young girls and so on. I appreciate the point the Deputy raised there.  To Deputy Boyd Barrett on the issues around Palestine Action, all of our embassies and so on provide whatever consular supports to any Irish citizen who is on remand or in prison. We always provide whatever supports we can or whatever assistance but we do not and obviously cannot interfere in the criminal justice system. I will review the case of Jordan Devlin and I will ask again our ambassador in London for an update in respect of that. \n Deputy Richard Boyd Barrett  You should speak out against Starmer's policy. \n An Ceann Comhairle  Please, Deputy. \n Deputy Richard Boyd Barrett  It is a disgraceful policy. \n The Taoiseach  I have no issue with people - obviously, I do not - supporting Palestinians. I do have an issue - I am not saying this happened in these cases at all because I do not know the full detail of them - but I read recently of a case where there was a ramming of building in London, so it is not as black and white as the Deputy has articulated, or even here where people drive through gates and barriers and do criminal damage. TDs' offices have had criminal damage by, I would say, more extreme elements of people who were involved in supporting the Palestinian movement, unfortunately. It is true. My own office was damaged three times. I know other TDs whose offices were damaged. \n Deputy Erin McGreehan  Hear, hear. \n The Taoiseach  So, is that acceptable? Is that legitimate protest? No, it is not. When there are people working in those offices, they do not think it is legitimate. All I am saying is we all have to be clear on the demarcation line. I am not familiar with the individual cases here in terms of the alleged crimes and so on like that, but let us not try to pretend that everything is just all one way because----- \n Deputy Paul Murphy  But in Britain, if you just hold a sign saying \"Free Palestine Action\", you can be arrested. \n An Ceann Comhairle  Please, Deputy Murphy. \n The Taoiseach  -----one thing I do know----- \n Deputy Paul Murphy  That is crazy. \n An Ceann Comhairle  This is orchestrated. I ask you to stop interrupting. \n The Taoiseach  One thing I do know is either on the far right or the far left, people do transgress the lines and let us not pretend they do not. They have in this country in the past. There clearly are other issues in the UK----- \n Deputy Richard Boyd Barrett  I think you will find the Israelis are the transgressors. \n The Taoiseach  -----and so on like that. Look, some people were trying to stop Dublin Port the other day. \n Deputy Paul Murphy  And they got bashed, did they not? \n An Ceann Comhairle  Taoiseach, I do not know if you intend to take any other questions. \n Deputy Paul Murphy  They got battered by gardaí, did they not? \n The Taoiseach  Well, they should not be trying to stop----- \n Deputy Paul Murphy  Did the Taoiseach support the gardaí battering them? \n The Taoiseach  Some 80% of trade in this country goes through Dublin Port and you guys want to wreck it. That is bread on the table. Workers all over the country depend on trade going through Dublin Port. As far as the Deputies are concerned, that should be stopped in its tracks. There are demarcation lines that we have to be very clear about. The right to protest----- \n Deputy Paul Murphy  They were protesting trade with Israel. \n The Taoiseach  -----is a sacred right in this country. We should cherish that and we should never do anything to damage it, nor should others.  I think I have dealt with the issue Deputy Bacik raised in my general response. I do not believe a citizens' assembly is the right way to go.  Deputy Conway-Walsh spoke about the cancer consortium. I helped to set that up originally. We are supporting it. On congenital heart disease, there was a very good agreement and there are cross-Border health initiatives including, for example, an initiative to treat children's hearts in Crumlin. There is more we can do. There is a cancer centre at Altnagelvin. I do not know if the Deputy has seen that. The Republic provided a lot of funding for that. There are also other services. I am all for that. We are researching whether we can provide better primary care services North and South and whether hospital resources can be combined. Deputy McGreehan made a point to me about two hospitals, one of which was Daisy Hill Hospital, where more stuff could be done. We have been working on that through various initiatives. I am all for that. We will continue to do that in conjunction with the ESRI and NESC.  I have given my views on the issue raised by Deputy Eoin Hayes. We have established all-island forums through the shared island initiative. Through that initiative, we have created a climate and biodiversity network, an all-island women's forum and an all-island youth forum where young people get together and talk about the future and about their lives. We have also developed the first all-island music archive, combining music from different traditions in the one archive. That is being funded through the shared island unit. There is a lot happening on the ground. People are just getting together. I was at an event two weeks ago. It was fantastic. People from east Belfast were doing tapestries with people from Inishbofin. Some of them had never been in the Republic before. Some of those from the South had never been in the North. We have a long way to go but we need to do this right and properly.  To respond to Deputy Conor McGuinness, is maith an rud é go bhfuil an coimisinéir teanga nua ann sa Tuaisceart. Tá Acht ann anois. Tá reachtaíocht curtha i láthair. Is dócha go bhfuil an-chuid oibre le déanamh ag an gcoimisinéir chun é sin a chur i bhfeidhm. Níl an reachtaíocht sin lán-cosúil leis an reachtaíocht atá againn anseo. Más féidir linn aon tacaíocht a thabhairt dó agus do ghluaiseacht na Gaeilge sa Tuaisceart, beimid sásta é sin a dhéanamh. Tá a lán déanta againn ach táimid sásta i bhfad níos mó a dhéanamh. \n Deputy Peadar Tóibín  Will the Taoiseach address the lopsided protections for veterans? \n The Taoiseach  Again, they were not negotiated by this Government, nor are they part of the joint framework. It is our understanding that the accommodation made for witnesses should apply in the cases of all victims equally, regardless of the perspective being brought to the matter. \n Deputy Peadar Tóibín  It is a problem then. \n An Ceann Comhairle  The Taoiseach has another 15 minutes. Did he answer Deputy McGuinness's question? \n The Taoiseach  I did. \n An Ceann Comhairle  You did. I am sorry; I was distracted. I would like to welcome a member of the Down's syndrome community, Declan Moran, who is here with Deputy Albert Dolan. You are very welcome, Declan. \n The Taoiseach  You are very welcome, Declan. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_3",
        "debateSection": {
          "showAs": "Cabinet Committees",
          "debateSectionId": "dbsect_16",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/debate/mul@/dbsect_16.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/debate/dbsect_16"
        },
        "date": "2025-11-26",
        "questionNumber": 3,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Cormac Devlin",
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08"
        },
        "questionType": "oral",
        "to": {
          "showAs": "Taoiseach",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_29",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/debate/dbsect_29",
          "showAs": "Mental Health Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/debate/mul@/dbsect_29.xml"
            }
          }
        },
        "questionType": "oral",
        "showAs": " 83. Deputy Cormac Devlin asked the Minister for Health the funding being provided for mental health crisis supports and suicide prevention in 2026; and if she will make a statement on the matter. [64090/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_83",
        "answerText": " Deputy Martin Daly  The question is in the context of significant additional funding for mental health services over the past five years, resulting in a €1.6 billion investment in mental health services for 2026. For the sixth year in a row, there has been an increase in staffing. I would like the Minister to make a statement on the funding provided for mental health crisis supports and suicide prevention in 2026. \n Deputy Jennifer Murnane O'Connor  I thank the Deputy. I am taking this question on behalf of the Minister of State, Deputy Mary Butler, who unfortunately cannot be here today. The total allocation for mental health services in 2026 is almost €1.6 billion, the sixth year in a row in which the mental health budget has increased. This increase in funding for mental health services will enable continued policy implementation and service improvements in line with our national mental health policy, Sharing the Vision, and our national suicide and self harm reduction strategy, Connections for Life. Across the board, we have seen mental health promotion and early intervention through specialist mental health services.  This record budget will allow for a focus on improving support for people in mental health crises in hospitals and in the community through an additional €15 million for crisis supports and suicide prevention. Significant progress has been made over the past three years to develop alternative crisis mental health pathways. However, emergency departments continue to see high volumes of mental health presentations.  Investment this year will be used to establish specialist nursing teams in all model 4 hospital emergency departments, three new crisis resolution services in Donegal, Kerry and the midlands, 12 additional suicide crisis assessment nurses and several Traveller-specific suicide prevention initiatives, the development of the new crisis response pathway for children and young people, increased funding for suicide prevention community and voluntary organisations and funding to implement the new suicide reduction strategy. As occurs each year following the budget, discussions take place with HSE on details relating to specific service initiatives in the context of preparing the HSE service plan for 2026, including that for mental health. \n Deputy Martin Daly  I thank the Minister of State. It is extremely important that we continue to progress investment in our mental health services. We still lag behind the internationally accepted norms for spending on mental health as a proportion of our budget. The Minister of State, Deputy Butler, has done some tremendous work in this regard. We have identified the tsunami of mental health issues that have arisen since Covid. As a practising GP, it is important to me that when we refer people who are in crisis that there are adequate pathways for them to achieve treatment. I have dealt with situations where young people in crisis, who are actively suicidal, have sat in emergency rooms for eight or nine hours waiting for an assessment. Putting specialist nursing teams into all model 4 emergency departments is a good initiative because it will provide an immediate assessment by a specialist nurse. \n Deputy Jennifer Murnane O'Connor  I absolutely agree. The Minister of State, Deputy Butler, is very passionate about this and has been working very hard on it. There are three new crisis resolution services, that is, crisis cafés, to support people in distress. They are located in Donegal, Kerry and Tullamore in the midlands. An allocation of €4 million has been given for this. Funding of €1 million has been provided for 12 additional suicide services where nurses support people in distress who present to GPs in the community. There is funding of €415,000 for several Traveller-specific suicide prevention initiatives, which have been codesigned with the Traveller community. There is increased funding of €1.7 million for suicide prevention in the community and for voluntary organisations, including Pieta. Funding of €1 million has been given to implement a new suicide reduction strategy. There is €4 million to develop a new crisis response pathway for children and young people, with 19 new CAMHS specialist doctors for out-of-hours emergency liaison, as well as five new adult liaison psychiatrists. There is more but my time is up. \n Deputy Martin Daly  I welcome all those initiatives. It is really important that they are integrated with existing mental health services. Initiatives must be even and consistent throughout the country, with adequate access. In addition, we need to look at acute mental health capacity in its totality in terms of beds. In the acute psychiatric unit in Roscommon University Hospital, up to a third of beds are taken by people who would be better served in supported situations in the community. In County Roscommon, there were many community hospitals and problems were identified with them. However, after the closure of the psychiatric hospital in Castlerea, there has been no replacement capacity in the community to step people down into those beds and create space for acute presentations to the psychiatric unit in Roscommon University Hospital. \n Deputy Jennifer Murnane O'Connor  I certainly will go back to the Minister of State, Deputy Butler, on those very important points. I absolutely agree we need more beds. The Minister, Deputy Carroll MacNeill, is very much aware of that. It is something the Government is looking at and the Minister definitely will work on it.  There is a challenge in dealing with suicide in extremely complex cases. We have seen cases where a single event is the factor that leads someone to take his or her own life. There are huge issues there. We need to get supports in place for families, individuals and communities. An action the Minister of State is working on is the new suicide reduction strategy. It is being drafted and will include information on beds and so on. Implementation of this new strategy will be developed in quarter 1 of 2026. I will convey the Deputy's concerns about the need for more beds and I thank him for highlighting it. ",
        "questionNumber": 83,
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_156",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_156",
          "showAs": "Hospital Staff",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_156.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 137. Deputy Cormac Devlin asked the Minister for Health the plans to provide mental health specialist nursing teams in the emergency departments of all model 4 hospitals out-of-hours; and if she will make a statement on the matter. [64091/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_137",
        "answerText": " Minister of State at the Department of Health  The total allocation for mental health services in 2026 is over €1.5 billion, which is the sixth year in a row in which the mental health budget has been increased.  This increase in funding for mental health services represents a significant investment which will enable continued policy implementation and service improvement in line with our national mental health policy, Sharing the Vision, and our national suicide and self-harm reduction strategy Connecting for Life , across a broad continuum from mental health promotion, prevention and early intervention, through to specialist mental health services. This year’s budget provided the opportunity to focus on investing in crisis support and suicide prevention; youth mental health and CAMHS, and expanding the National Clinical Programmes.  This includes funding for Specialist Nursing Teams made up of Advanced Nurse Practitioners and Clinical Nurse Specialists in all ‘Model 4’* hospital emergency departments out-of-hours (6pm-2am) to support people in crisis.  As occurs each year following the Budget, discussions will now take place with the HSE on details relating to specific service initiatives in the context of preparing the HSE Service Plan 2025, including that for Mental Health.  Accordingly, this initiative will have to operationalised by the HSE in due course. ",
        "questionNumber": 137,
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Transport",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_249",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_249",
          "showAs": "Departmental Strategies",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_249.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 234. Deputy Cormac Devlin asked the Minister for Transport the progress in delivering the commitment in the Programme for Government to publish an electric vehicle strategy; his plans to ensure that public charging infrastructure stays ahead of demand; and if he will make a statement on the matter. [65073/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_234",
        "answerText": " Minister for Transport  My Department is fully committed to supporting a significant expansion and modernisation of the EV charging network over the coming years.  While over 80% of charging is expected to happen at home, there is a vital need for a seamless public charging network that will provide for situations or instances where home charging is not possible.  The National EV Charging Infrastructure Strategy outlines the requirements for publicly accessible charging. The objective is to be ahead of demand and deliver on the AFIR requirements and install EV Infrastructure that is capable of meeting user needs. This strategy is currently being revised with a refreshed strategy for 2026-2028 to be published for consultation in the coming months. ",
        "questionNumber": 234,
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Transport",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_250",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_250",
          "showAs": "Electric Vehicles",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_250.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 235. Deputy Cormac Devlin asked the Minister for Transport the total level of Exchequer funding allocated and drawn down for electric vehicle charging infrastructure in 2021 to 2025, including specific allocations to zero emission vehicles Ireland and to local authority-led charging projects, in tabular form; and if he will make a statement on the matter. [65074/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_235",
        "answerText": " Minister for Transport  The Government is fully committed to supporting a significant expansion and modernisation of the EV charging network over the coming years and reaching climate targets. Having an effective and reliable charging network is an essential part of enabling drivers to make the switch to electric vehicles.  Zero Emission Vehicles Ireland (ZEVI) is a dedicated Office within the Department of Transport charged with supporting consumers, the public sector and businesses to continue to make the switch to zero emission vehicles. The Office leads on the delivery of Ireland’s ambitious targets under the Climate Action Plan 2023 to have an expected 30% of our private car fleet switched to electric by 2030.  ZEVI was established in July 2022 and funding was allocated for EV charging infrastructure as set out below:      Year      Infrastructure Allocation      Drawdown        2022     €17m    €11.7m       2023     €27m    €16.7m       2024     €45.8m    €12.3m       2025     €40.5m    €8m (to date)       The difference between allocation of funding and and drawdown of funding for EV infrastructure in the years as set out above is primarily as a result of delays in scheme delivery after approval. This has been in some cases as a result of planning and procurement at Local Authority level, and in others due to delays in connecting EV infrastructure to the electrical grid. A number of improvements have been made in the past year in relation to both, and I anticipate that a significant scale up in delivery of exchequer funded EV infrastructure will be seen in approved schemes in early 2026.  Local authorities are funded by ZEVI to develop local and regional EV charging network strategies and implementation plans. While strategies are being finalised, ZEVI is funding pilot infrastructure projects in a number of Local Authorities, so as not to delay any initial rollout. ZEVI is also funding EV infrastructure officers in every local authority to manage delivery and roll out of EV infrastructure networks. ",
        "questionNumber": 235,
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Transport",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_252",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_252",
          "showAs": "Electric Vehicles",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_252.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 236. Deputy Cormac Devlin asked the Minister for Transport the number of publicly accessible electric vehicle charge points currently available in the State, by county and by charger type (slow, fast, high power); the equivalent figures for 2020 to 2024, in tabular form; and if he will make a statement on the matter. [65075/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_236",
        "answerText": " Minister for Transport  The Government is fully committed to supporting a significant expansion and modernisation of the electric vehicle (EV) charging network over the coming years. Having an effective and reliable charging network is an essential part of enabling drivers to make the switch to electric vehicles.  Zero Emission Vehicles Ireland (ZEVI), a dedicated Office which oversees and accelerates Ireland’s transition to zero emission vehicles, has significant funding available in 2025 for the installation of EV charging across Ireland.  The number of publicly accessible charge points in Ireland increased from 1,700 in September 2022 to approximately 2,400 in 2024. In order to achieve Ireland’s EU targets under the Alternative Fuel Infrastructure Regulation (AFIR), it is expected that there will be 3,200 – 6,210 public chargers required nationally, depending on the level of power supplied at each.  Currently, the Department of Transport does not track the number of publicly accessible EV charging stations by region. However, ZEVI is developing a Data Strategy and associated data platforms that will, once in place, enhance the Department’s ability to monitor this infrastructure.  The system will enable the collection of data from charge-points in near real time and provide it on an Open Data basis. The obligation on charge-point operators and owners to share this data is legislated for in the EU Alternative Fuel Infrastructure Regulation. ",
        "questionNumber": 236,
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Transport",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_253",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_253",
          "showAs": "Electric Vehicles",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_253.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 237. Deputy Cormac Devlin asked the Minister for Transport the current status of the National Road Network EV Charging Plan; the number of motorway and national road service areas where high power charging hubs are now operational; the number that are in procurement or construction; the expected completion dates for each site, in tabular form; and if he will make a statement on the matter. [65076/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_237",
        "answerText": " Minister for Transport  The Government is fully committed to supporting a significant expansion and modernisation of the EV charging network over the coming years.  While over 80% of charging is expected to happen at home, there is a vital need for a seamless public charging network that will provide for situations or instances where home charging is not possible.  The National Road EV Charging Network Plan, published May 2024, identifies the level of charging that will be needed on our national primary and secondary road network 2024-2030.  The EV Recharging Infrastructure LDV En-Route Grant Schemes are funded by Zero Emission Vehicles Ireland (ZEVI) and administered by Transport Infrastructure Ireland (TII). Procurement is complete on all of the schemes outlined below, and they have moved to construction and delivery.  In 2024, a total of 131 high-powered recharging points to be built across 17 recharging pools, providing an additional 24,260 kilowatts (24 megawatts) recharging capacity, under the LDV1 scheme on the motorway were announced.  In June 2025, a total of 175 high-powered recharging points to be built across 53 recharging pools, providing an additional 20,000 kilowatts (20 Megawatts) of recharging capacity, under Phase 2 of the scheme covering national primary roads, were announced.  In October 2025, we announced the locations of 90 new high-powered recharging pools, a total of 192 high-powered recharging points, to be rolled out under Phase 3 of the scheme covering national secondary roads. These hubs are due to be in place by end 2026.  Each of these recharging pools will provide fast and ultra-fast recharging points, so that people can charge their EVs quickly. ",
        "questionNumber": 237,
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Transport",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_254",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_254",
          "showAs": "Electric Vehicles",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_254.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 238. Deputy Cormac Devlin asked the Minister for Transport the role assigned to local authorities in planning, delivering and operating public electric vehicle charging infrastructure; the formal guidance that has issued to local authorities on this matter; and the supports available to them in terms of funding, technical assistance and data; and if he will make a statement on the matter. [65077/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_238",
        "answerText": " Minister for Transport  The Government is fully committed to supporting a significant expansion and modernisation of the EV charging network over the coming years.  The Regional and Local EV Charging Network Plan provides a pathway for the accelerated delivery of public destination and neighbourhood charging and will be led by Local Authorities.  Local authorities will be funded by Zero Emission Vehicles Ireland (ZEVI) to develop local and regional EV charging network strategies and implementation plans. This process will identify the number of charge points required in each area, including on-street chargers to serve residents without access to private off-street parking.  While strategies are being finalised, ZEVI is funding 26 pilot infrastructure projects across 15 Local Authorities and dedicated EV charging infrastructure officers. ZEVI will continue to work directly with the local authority groups as they develop their strategies and will provide other supports and resources as necessary.  ZEVI has prepared a Local and Regional EV Infrastructure plan to assist and guide Local Authorities in the development of their network plans. ZEVI also has developed site selection guidelines, Universal Design Guidelines, and is identifying a range training supports to support Local Authorities in this delivery role. ",
        "questionNumber": 238,
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Transport",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_255",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_255",
          "showAs": "Electric Vehicles",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_255.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 239. Deputy Cormac Devlin asked the Minister for Transport if each local authority has prepared or is preparing a regional or local electric vehicle charging plan; the status of these plans by local authority; the way in which they align with national targets under the EV Charging Infrastructure Strategy and the National Road Network EV Charging Plan; and if he will make a statement on the matter. [65078/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_239",
        "answerText": " Minister for Transport  The Government is fully committed to supporting a significant expansion and modernisation of the EV charging network over the coming years and reaching climate targets. Having an effective and reliable charging network is an essential part of enabling drivers to make the switch to electric vehicles.  The National EV Charging Infrastructure Strategy outlines the requirements for publicly accessible charging. The objective is to be ahead of demand and deliver on the AFIR requirements and install EV Infrastructure that is capable of meeting user needs. This strategy, is currently being revised with a refreshed strategy for 2026-2028 to be published for consultation in the coming months.  The Regional and Local EV Charging Network Plan, which focuses on destination and neighbourhood charging, was published in April this year. This plan focuses on EV Infrastructure for Light Duty Vehicles based on user needs and AFIR Fleet based targets to 2030. With Government support and in partnership with the public and private sector, the roll out will be led by Local Authorities.  Local authorities are funded by Zero Emission Vehicles Ireland (ZEVI) to develop local and regional EV charging network strategies and implementation plans. This process will identify the capacity and number of charge points required in each area, including on-street chargers to serve residents without access to private off-street parking. These strategies, combined with the delivery of LDV charging on the National Road network, led by TII, are designed to meet national targets for the provision of EV charging infrastructure.  Some authorities have already completed their strategies, while others are in progress. It is anticipated that most of these plans will be finalised by end of 2025. While strategies are being finalised, ZEVI is funding 26 pilot infrastructure projects across 15 Local Authorities and dedicated EV charging infrastructure officers. ",
        "questionNumber": 239,
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Transport",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_256",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_256",
          "showAs": "Electric Vehicles",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_256.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 240. Deputy Cormac Devlin asked the Minister for Transport the agencies and offices with responsibility for electric vehicle charging infrastructure, including his Department, Zero Emission Vehicles Ireland, Transport Infrastructure Ireland, the SEAI and others; the specific remit of each body; the coordination mechanisms in place between them; and if he will make a statement on the matter. [65079/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_240",
        "answerText": " Minister for Transport  Zero Emission Vehicles Ireland is a dedicated Office within the Department of Transport, charged with supporting consumers, the public sector and businesses to continue to make the switch to zero emission vehicles.  The Office leads on the delivery of Ireland’s ambitious targets under the Climate Action Plan 2023 to have an expected 30% of our private car fleet switched to electric by 2030.  To deliver on this target, ZEVI work in partnership with stakeholders from across the public and private sector. ZEVI's governance structures include formal participation from ESB networks, the SEAI, TII and the NTA, as well as regular but less formalised contacts between ZEVI, Eirgrid and the Commission for Regulation of Utilities.  Regarding EV charging infrastructure, over €100m has been allocated in 2025 to support the continued transition to electric vehicles which includes funding for EV grants and EV charging infrastructure.  There is a suite of incentives and a range of new charging infrastructure schemes in place to support the continued transition to EVs and for the rollout of EV charging infrastructure, including:  • a home charging scheme administered by SEAI;  • an apartment charging scheme administered by SEAI;  • a ZEHDV scheme to assist companies and enterprises who wish to buy zero-emission heavy duty vehicles, and was expanded to include purchase grants for recharging infrastructure, administered by TII, and;  • EV Recharging Infrastructure LDV En-Route Grant Schemes, administered by TII. ",
        "questionNumber": 240,
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Transport",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_257",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_257",
          "showAs": "Electric Vehicles",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_257.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 241. Deputy Cormac Devlin asked the Minister for Transport the supports available to install electric vehicle charging infrastructure in apartment complexes, multi-unit developments and publicly owned car parks; the number of such projects approved and completed to date, by local authority area; his plans to expand these schemes; and if he will make a statement on the matter. [65080/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_241",
        "answerText": " Minister for Transport  The Government is fully committed to supporting a significant expansion and modernisation of the electric vehicle (EV) charging network over the coming years. Having an effective and reliable charging network is an essential part of enabling drivers to make the switch to electric vehicles.  Home charging is the primary charging method for most Irish EV owners as it’s convenient and cheaper for the consumer as well as assisting in the overall management of the national grid. Over 80% of charging is expected to happen at home.  The apartment charger grant, administered by by the Sustainable Energy Authority of Ireland (SEAI), assists residents and owners of apartments and other multi-unit developments who want to install a home charger for their Electric Vehicle (EV) and which are not covered by the pre-existing grants.  The grant is designed for bulk installation of chargers at a single location, and supports cabling, infrastructure, labour, and construction costs. Owners’ management companies, housing bodies, local authorities, commercial and private landlords can apply.  As of end of October a total of 135 applications have been received with 9 in review, 59 committed, 47 complete, and 20 cancelled.  The Government remains firmly committed to creating the conditions necessary for widespread EV adoption.  The Department regularly reviews EV incentives and grants to ensure that they are delivering value for money and supporting delivery of EV targets. We will continue to pursue a balanced and evidence-based approach, one that is ambitious in its climate objectives, yet grounded in deliverability and value for money. ",
        "questionNumber": 241,
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Transport",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_258",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_258",
          "showAs": "Electric Vehicles",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_258.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 242. Deputy Cormac Devlin asked the Minister for Transport the key performance indicators used by his Department and Zero Emission Vehicles Ireland to measure progress on public electric vehicle charging infrastructure, including chargers per electric vehicle, geographic coverage and reliability or uptime; the way in which current performance compares with national targets and with the State's obligations under the EU Alternative Fuels Infrastructure Regulation; and if he will make a statement on the matter. [65082/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_242",
        "answerText": " Minister for Transport  The Government is fully committed to supporting a significant expansion and modernisation of the EV charging network over the coming years.  EV infrastructure standards are mandated through European regulations, the ITS Directive, the Alternative Fuel Infrastructure Regulation, and Irish legislation and regulations.  The Alternative Fuels Infrastructure Regulation (AFIR) has been in force since 13 April 2024 and is an important part of the EU’s Fit for 55 policy package to reduce EU emissions by 55% by 2030 and make the EU climate-neutral by 2050.  The Regulation establishes mandatory minimum alternative fuels infrastructure targets and obligations, to ensure that a sufficient and interoperable recharging and refuelling infrastructure network is in place across EU Member States.  AFIR sets targets and timeframes for the deployment of infrastructure in urban nodes and across the main transport corridors in each Member State (the Trans-European Network-Transport network (TEN-T), including electric vehicle recharging infrastructure for light- and heavy-duty vehicles.  National targets under AFIR take the form of publicly available charging capacity (kw) on the network, rather than a national target for the number of EV chargepoints. A minimum number of high powered chargepoints are also to be provided on the Ten-T core and comprehensive networks under AFIR, and ZEVI and TII have put in place tender processes to deliver these charging requirements on the national road network. The Department of Transport reports to the EU annually on progress under the AFIR.  The National EV Charging Infrastructure Strategy sets out the ambition and strategy for the delivery of a national EV charging network across the country that will meet users' needs, and includes the practical steps to deliver this network and AFIR infrastructure targets. This strategy is currently being revised with a refreshed strategy for 2026-2028 to be published for consultation in the coming months.  ZEVI is developing a Data Strategy that will, once in place, enhance the Department’s ability to monitor this infrastructure. The system will enable the collection of data from charge-points in near real time and provide it on an Open Data basis. ",
        "questionNumber": 242,
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Transport",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_259",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_259",
          "showAs": "Road Network",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_259.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 243. Deputy Cormac Devlin asked the Minister for Transport the impact that Circular RW18 and the new regime for exceptional abnormal loads has had on the timing and cost of moving very heavy loads, including for grid and energy project;, if his Department has undertaken or plans to undertake a formal review of the regime in light of stakeholder feedback; and if he will make a statement on the matter. [65099/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_243",
        "answerText": " Minister for Transport  Exceptional Abnormal Loads can cause significant damage and deterioration to pavements, bridges and bridge components along the Irish road network. The presence of these vehicles and loads will increase over time and pose a significant risk to the road transport network, in particular where overloading and potential damage can be caused to bridge structures and other pieces of infrastructure such as water mains, and gas mains.  Due to their age and service life, some bridges have experienced deterioration over their lifetime and are particularly vulnerable to extreme load events due to their reduced capacity over time. Medium span bridges and ageing structures are particularly vulnerable, but even modern bridges in Ireland have not been designed to carry such exceptional abnormal loads.  Traditionally, Abnormal Load Applications to Local Authorities in Ireland were for loads below 180 tonnes, and usually below 150 tonnes. In recent years, energy sector requirements mean requests for the movement of exceptionally heavy abnormal loads have increased significantly and are expected to continue. Numerous loads programmed to be moved over the coming years are far in excess of 180 tonnes, with some large generators identified by the energy sector as up to 570 tonnes.  This puts significant pressure on Ireland’s road and bridge infrastructure. Modern bridge structures have been designed to accommodate loading of 180 tonnes; numerous ‘legacy’ bridges have a design loading significantly lower than 180 tonnes.  Consequently, additional structural assessment requirements apply to heavy loads and particularly loads over 180 tonnes to help protect road assets and the safety of road users.  Despite large loads such as transformers being ordered 2-3 years before delivery, little early engagement and consultation with stakeholders has taken place and have submitted late requests to transport these exceptional loads.  In many cases exceptional loads are being ordered with no consideration for route selection and no guarantee they can be delivered to their destinations.  Appropriate assessments are required to ensure the Local Authorities have the necessary information to approve the safe movement of these loads.  As a result, Department of Transport Circular RW18/2024 was issued to clarify this assessment process, which is needed both to protect state infrastructure and to assist applicants in the management of exceptionally heavy abnormal loads. The circular sets out the process for compliance with structural assessment standards and provides applicants with additional clarity. The Department of Transport keeps all circulars under review and issues notifications where updates or clarifications are required.  The increase in movement of exceptionally heavy abnormal loads puts the road and bridge network at significant risk of damage or indeed failure, with clear implications for other road users. The increase needs to be managed appropriately.  Early project engagement with the relevant bodies, including local authorities, is key.  In addition, options to reduce these loads to expedite the process and reduce risk need to be considered by the energy sector.  Both the Department of Transport and the Department of Climate, Energy and the Environment and their agencies are aware of the technical and administrative difficulties in this area and are working to address the issues and ensure adequate dedicated expert technical resources are put in place to manage the process over the coming years. ",
        "questionNumber": 243,
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Transport",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_260",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_260",
          "showAs": "Road Network",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_260.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 244. Deputy Cormac Devlin asked the Minister for Transport how the Eirspan bridge management system is currently used to assess the suitability of bridges and structures for abnormal and exceptional abnormal load movements; if promoters and hauliers can access or obtain relevant capacity data to inform route selection in advance of applications; and if he will make a statement on the matter. [65101/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_244",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the operation and management of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals. In this context, TII is best placed to advise you in relation to the Eirspan bridge management system.  Noting the above position, I have referred your question to TII for a direct reply.  Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionNumber": 244,
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Transport",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_261",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_261",
          "showAs": "Road Network",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_261.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 245. Deputy Cormac Devlin asked the Minister for Transport if there is a formal protocol, working group or memorandum of understanding between his Department, Transport Infrastructure Ireland, the Department of Climate, Energy and the Environment, EirGrid and ESB Networks regarding the planning and permitting of very heavy loads associated with strategic energy infrastructure, including transformers, generators and related equipment; and if he will make a statement on the matter. [65102/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_245",
        "answerText": " Minister for Transport  Traditionally, Abnormal Load Applications to Local Authorities in Ireland were for loads below 180 tonnes, and usually below 150 tonnes. In recent years, energy sector requirements mean requests for the movement of exceptionally heavy abnormal loads have increased significantly, and are expected to continue. Numerous loads programmed to be moved over the coming years are far in excess of 180 tonnes, with some large generators identified by the energy sector as up to 570 tonnes.  This puts significant pressure on Ireland’s road and bridge infrastructure. Modern bridge structures have been designed to accommodate loading of 180 tonnes; numerous ‘legacy’ bridges have a design loading significantly lower than 180 tonnes.  Consequently, additional structural assessment requirements apply to heavy loads and particularly loads over 180 tonnes to help protect road assets and the safety of road users.  Despite large loads such as transformers being ordered 2-3 years before delivery, developers and promoters, have to date, little or no early engagement in advance consultation with stakeholders and have submitted late requests to transport these exceptional loads.  Some exceptional loads are being ordered with no consideration for route selection and no guarantee they can be delivered to their destinations.  This is currently causing unnecessary project delay and risk.  As a result, Department of Transport Circular RW18/2024 was issued to clarify this assessment process, which is needed both to protect state infrastructure and to assist applicants in the management of exceptionally heavy abnormal loads. The circular sets out the process for compliance with structural assessment standards and provides applicants with additional clarity. The Department of Transport keeps all circulars under review and issues notifications where updates or clarifications are required.  Through stakeholder engagement with the Road Sector and Energy Sector a Local Authority Central Support Unit has been identified to coordinate delivery of its infrastructure going forward.  This would include the assessment and delivery of exceptional abnormal loads with adequate dedicated expert technical resources in place to manage the process over the coming years.  The Department of Climate, Energy and the Environment is currently considering resource and funding requirements for this Central Support Unit. ",
        "questionNumber": 245,
        "by": {
          "memberCode": "Cormac-Devlin.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Cormac-Devlin.D.2020-02-08",
          "showAs": "Cormac Devlin"
        }
      },
      "contextDate": "2025-11-20"
    }
  ]
}