{
  "head": {
    "counts": {
      "questionCount": 4944,
      "resultCount": 4944
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The Office of Public Works (OPW) did not pay any of the utility bills referred to in respect of the property on the Spa Road in the Phoenix while it was occupied by the former Garda Commissioner. Routine maintenance of the boundary hedge between the property and Spa Road was performed by the OPW horticultural team, consistent with practices elsewhere in Phoenix Park. This involved approximately two to three visits annually to prevent the hedge from encroaching on the road and footpath and did not involve any work within the garden area itself. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 387. Deputy Alan Kelly asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if a range of utilities were paid for by a former Garda Commissioner (details supplied) in respect of a property at Spa Road, Phoenix Park, which was provided to him for a seven-year contract period by the OPW, through An Garda Síochána, or if the cost of any such utilities were paid for by the OPW or the Exchequer. [73275/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_377",
          "debateSectionId": "dbsect_377",
          "showAs": "Office of Public Works",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_377.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_387",
        "questionNumber": 387
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  As the Deputy will be aware, under the provisions of the Public Service Management Act, 1997, as Minister I am  responsible for the performance of functions that are assigned to the Department and the Secretary General is responsible for assigning responsibilities to officers of the Department.  In line with a number of Programme for Government commitments, my Department has undergone very significant structural change since I was appointed as Minister on 23 January last.  Responsibility for integration, International Protection Accommodation Services (IPAS), and the Ukraine Division transferred to my Department from, what was then, the Department of Children, Equality, Disability, and Integration on 1 May 2025. This included the transfer of all staff, approximately 340 people, alongside a substantial budget transfer of approximately €2.1 billion. As my Department already had responsibility for immigration and migration and the processing of applications for international protection, this transfer underpins a more cohesive and strategic approach to migration and integration.  In addition, responsibility for cyber security policy and the National Cyber Security Centre (NCSC) transferred to my Department from the then Department of the Environment, Communications and Climate on 2 June. The NCSC is the lead government agency on cyber security.  These transfers involved the transfer of all staff involved in this work including, at senior level, a Deputy Secretary General, two Assistant Secretaries General, three Directors and some 30 Principal Officers join the Department.  On 1 August, responsibility for the Property Services Regulatory Authority and its Appeals Board moved from my Department to the Department of Housing, Local Government and Heritage, while responsibility for the Irish Film Classification Office transferred from my Department to the Department of Culture, Communications and Sport.  In addition to the structural changes and associated personnel changes outlined above, a new Head of Finance and Operations post at Assistant Secretary level was sanctioned and recruited following an open recruitment competition carried out under the Top Level Appointments Committee. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 557. Deputy Alan Kelly asked the Minister for Justice, Home Affairs and Migration the structural and-or senior personnel changes he has made, or that have been made, in his Department since he became Minister. [73277/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_530",
          "debateSectionId": "dbsect_530",
          "showAs": "Departmental Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_530.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_557",
        "questionNumber": 557
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 644. Deputy Alan Kelly asked the Minister for Health if her Department will support a call from the board of directors of a day centre (details supplied) and have a meeting with the board and also the HSE; and if she will make a statement on the matter.  [73357/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_618",
          "debateSectionId": "dbsect_618",
          "showAs": "Care Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_618.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_644",
        "questionNumber": 644
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  The Higher Education Authority (HEA) have advised that subsequent to University College Cork's (UCC) submission of its Section 64 report on 2 May 2024, the HEA established a series of meetings with the UCC Chair and senior executives. Through this mechanism, the HEA and UCC met on four occasions between June 2024 and June 2025, as part of the process following on from the Section 64 request and the initiation of the remedial measure under Section 66 of the Higher Education Authority Act 2022. These meetings were in addition to the normal engagements between the HEA and UCC.  Following on from a meeting on 3 June 2025, in view of the established plan, progress to date and the independent validation provided by Internal Audit, the HEA-UCC engagement moved to the regular regime of oversight and reporting with assurance provided by the UCC Governing Authority. The HEA re-affirmed its expectation that the plan is monitored appropriately and reported accordingly.  UCC continue to progress the implementation of their Section 64 plan (Governance Ireland Action Plan). This is overseen by the UCC Audit and Risk Committee, and the most recent confirmation, as at 9 December, continues to provide assurance that progress has been reviewed and endorsed by the UCC Governing Authority. In January 2024, capital spending was paused pending the outcome of a review of the University’s Capital Development Programme by UCC.  In June 2024, following consideration of this review and information provided by UCC, the capital pause was released on strategic projects on the basis that UCC’s standard governance procedures for such capital projects would apply. In June 2025, following the move to a regular regime of oversight and reporting, the HEA notified UCC of the lifting of the capital pause and that normal UCC Governance Procedures and Oversight would apply in respect of all capital projects going forward. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 787. Deputy Alan Kelly asked the Minister for Further and Higher Education, Research, Innovation and Science the number of meetings that have taken place between the Higher Education Authority and University College Cork (UCC) subsequent to the submission by UCC of its report of a matter under Section 64 of the Higher Education Authority Act 2022; if the Higher Education Authority is still monitoring UCC; and if any specific controls related to capital spending were or are currently in place. [73621/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_753",
          "debateSectionId": "dbsect_753",
          "showAs": "Further and Higher Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_753.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_787",
        "questionNumber": 787
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  University College Cork is an autonomous institution responsible for the oversight, planning and management of its capital development plan, including the development of a new business school. In that regard, any engagement UCC has with lenders, such as European Investment Bank, is a matter for the institute and its governing authority. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 788. Deputy Alan Kelly asked the Minister for Further and Higher Education, Research, Innovation and Science the current status of a €50 million loan provided by the European Investment Bank (EIB) to University College Cork for the development of a new business school; whether his Department or the Higher Education Authority has received correspondence from the EIB regarding the loan; the amount of the loan drawn down to date; the amount of interest paid on the loan; the potential amount of future interest costs; and if he will make a statement on the matter. [73622/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_754",
          "debateSectionId": "dbsect_754",
          "showAs": "Further and Higher Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_754.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_788",
        "questionNumber": 788
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The mandatory retirement age for public and civil service roles generally is 70 years under the Public Service Pensions (Single Scheme and Other Provisions) Act 2012 and the Public Service Superannuation (Age of Retirement) Act 2018.  This applies to members of the Single Public Service Pension Scheme and to members of pre-existing pension schemes who are not classified as New Entrants under the Public Service Superannuation (Miscellaneous Provisions) Act 2004. For those who are deemed to be New Entrants they have no maximum retirement age.  There are no provisions or mechanisms in place to allow for retention in employment beyond an individual’s mandatory retirement age.  Note that the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation does not have responsibility for retirement ages or retention policy in respect of members of An Garda Síochána, the Defence Forces, Fire Services, or the Irish Prison Service. These matters fall within the remit of the respective Ministers with responsibility for these services.  Further, the retirement ages in commercial state bodies are set out in the rules of the relevant pension scheme. Any terms and conditions of employment allowing staff to continue in employment beyond retirement age is a matter in the first instance for the parent Minister of the commercial body. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 189. Deputy Alan Kelly asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the circumstances in which each Government Department, State agency or semi-State agency can allow employees to stay on in employment beyond retirement age. [73127/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_181",
          "debateSectionId": "dbsect_181",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_181.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_189",
        "questionNumber": 189
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I have been advised by publicjobs, the centralised recruiter for the Civil and Public Service and a body under the aegis of my Department, that they are currently administering a bespoke recruitment competition for Assistant Principal Officer positions requiring fluency in Irish for the Department of Rural and Community Development and the Gaeltacht. These positions are based in Galway.  This competition closed for applications on the 13 November with 44 candidates applying. The recruitment process is ongoing and is expected to conclude in Q1 2026. The shortlisting process will commence shortly and, as a result, no applicants have yet been placed on a panel.  In addition, as part of the application stage for the Assistant Principal Officer (Standard) Nationwide competition, publicjobs included an Irish language stream. This allowed candidates to indicate their interest in being considered for vacancies requiring fluency in Irish that may arise during the lifetime of the competition.  Based on requests received from departments, candidates who expressed interest in such vacancies for Dublin and Galway were progressed through the standard Assistant Principal Officer selection process. Those successful at the final stage (Interview and Strategic Analysis exercise) were then required to complete full certification examinations at C1 proficiency level through Teastas Eorpach na Gaeilge (TEG). Six candidates achieved this standard: five were placed on the Dublin panel (Irish stream) and one on the Galway panel (Irish stream).To date, four vacancies have been filled from the Dublin panel and one from the Galway panel.  Additional candidates who indicated interest in Irish language vacancies for other locations remain available; however, they have not yet undertaken the assessment stages outlined above, as no departmental requests for such vacancies have been received to date. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 387. Deputy Alan Kelly asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the number of Assistant Principal Officer applicants that are fluent in Irish currently on a panel arising from the most recent civil service recruitment campaign. [72170/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_286",
          "debateSectionId": "dbsect_286",
          "showAs": "Civil Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_286.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_387",
        "questionNumber": 387
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Local coastal erosion and flooding issues are a matter, in the first instance, for each local authority to investigate and address.  The Minor Flood Mitigation Works and Coastal Protection Scheme was introduced by the Office of Public Works (OPW) in 2009. The purpose of the scheme is to provide 90% funding to local authorities to undertake minor flood mitigation works or studies to address localised flooding or coastal erosion problems within their administrative areas. The scheme generally applies where a solution can be readily identified and achieved in a short time frame. The criteria for the Minor Flood Mitigation Works and Coastal Protection Scheme are currently under review, and any new application under the scheme will be considered against revised criteria. The OPW expect to advise Local Authorities of the revised criteria for the Scheme shortly.  Since 2022 to date, the OPW has approved some €641,000 in funding to Tipperary County Council for some 9 projects. Details of the approved projects are provided in table below.     Project Location    Project Details    Approved Funding    Date  Approved      Marlfield, Clonmel    Install temporary works to support the large retaining wall and parapet, if deemed necessary; Remove all vegetation and trees within the vicinity of the culvert. TTC propose to partly remove and strengthen the existing stone masonry and concrete retaining walls to the upstream embankments.    Additional funding was approved to remove the top section of collapsing wall. Batter back clay and associated works. Disposal of removed items.    €72,000    20/06/2025  &  17/10/2024        Ardfinnan    Replace old barriers with a modern reliable new system that is fit for purpose.    €27,000    20/12/2024      Ballylooby    To construct a reinforced earth embankment/masonry wall along river bank within affected property, and install non-return valves on storm pipes draining to river. The installation of temporary flood barriers at strategic locations on the affected property.    €25,200    20/12/2024      Blackcastle Rd, Templemore    To construct an additional 6m culvert beside an existing bridge and to raise the road in addition to widening an existing channel.    €181,000    08/07/2024      Greenan, Templederry    The removal of existing boundary wall at the affected property including the sections that have collapsed. To excavate silt deposits under bridge arch no. 1 and to increase the headroom. The importation and compaction of 6-12\" rock to restored river bed. Deposition/relocation of existing river bed material and placing of Rock Armour and the creation of earth retaining bund. The placing of suitable fill material behind rock armour.    €31,613    24/06/2024      Coopers Lot, Cashel, Thurles    Ground investigation surveys and site investigation. Additional funding was approved for geomorphological analysis, hydrological modelling and modelling assessment.    €174,600    16/11/2023,  07/03/2023  &  04/10/2022      Gortnahoe    To construct a new surface water storm drain 200 metres long including manholes and chambers and civils works, outfall to existing open channel.    €22,500    28/07/2023      Gortnahoola, Drombane, Thurles    To construct a new 750mm surface water storm line 155 metres along public road    €29,700    14/04/2023      Holycross, Thurles    The construction a new surface water storm drain 315m long including manholes and chambers and civils works and outfall to existing open drain.    €77,400    28/04/2022      Total        €641,013          ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 388. Deputy Alan Kelly asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if he will detail each allocation made to Tipperary County Council under the OPW minor flood mitigation works and coastal protection scheme for each of the years 2022 to 2025, in tabular form. [72171/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_287",
          "debateSectionId": "dbsect_287",
          "showAs": "Flood Risk Management",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_287.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_388",
        "questionNumber": 388
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Enterprise, Tourism and Employment  The Workplace Relations Commission (WRC) is an independent, statutory body under the aegis of my Department, established on 1st October 2015 under the Workplace Relations Act 2015. The WRC’s primary functions include the inspection of employment law compliance, the provision of information on employment law, mediation, adjudication, conciliation, facilitation, and advisory services. WRC inspectors carry out inspections of employer records with a view to determining compliance with employment rights legislation.  The table below sets out the number of WTE inspectors, by grade, working in the WRC in 2024 and to date in 2025. There is an ongoing recruitment campaign in place through Publicjobs to hire additional inspectors and we expect to make more assignments in early 2026:         2024    2025      Labour Inspector (Executive Officer)    47    53      Inspector Team Manager (Higher Executive Officer    7    6      ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 409. Deputy Alan Kelly asked the Minister for Enterprise, Tourism and Employment the number of WTE inspectors by grade working within the workplace relations commission in each of the years of 2024 and to-date in 2025, in tabular form. [72172/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_307",
          "debateSectionId": "dbsect_307",
          "showAs": "Workplace Relations Commission",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_307.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_409",
        "questionNumber": 409
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In addition, over 200 SEN Repurposing projects have been delivered maximising the use of existing accommodation while creating opportunities for inclusion and integration.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published shortly and the first tranche of projects to progress to construction will be published in January 2026. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  My department has invested over €171m in capital expenditure since 2020 in County Tipperary. This investment in County Tipperary has supported the completion of 66 school building projects, including 2 new school buildings. Currently there are 8 school building projects in construction.  The current status of all projects is set out, under item number ten, at the following link (www.gov.ie). This is updated on a regular basis to reflect project progress through the various stages of capital appraisal, site acquisition, design, tender and construction. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 484. Deputy Alan Kelly asked the Minister for Education and Youth If she will publish a list of schools in Tipperary awaiting major works approval. [72175/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_375",
          "debateSectionId": "dbsect_375",
          "showAs": "School Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_375.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_484",
        "questionNumber": 484
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I propose to take Questions Nos. 694, 695, 696, 697, 698 and 699 together.  I can advise the Deputy that my Department has not developed any plans or proposals to introduce civic and language courses or tests for applicants seeking an immigration permission to remain in the State or as part of the naturalisation process.  Last month Minister O'Callaghan and I secured Government approval to introduce new policies and legislative changes to strengthen Ireland’s migration and asylum system to ensure it is rules-based, efficient and more aligned with EU Member States.  In this context, my Department is reviewing many aspects of our current immigration regime, including the requirements for naturalisation.  As my Department does not record details of the English-language competence of individuals who receive an immigration permission or a certificate of naturalisation, the statistics the Deputy has requested are not available. However, the Central Statistics Office, through Census 2022, has gathered data on the English-language ability of people living in Ireland whose speak a language other than English or Irish at home, which is set out at data.cso.ie/table/F5015.  As the Deputy may be aware, the Programme for Government 2025 contains a commitment to publish a National Migration and Integration Strategy detailing how we intend to meet the demands and the opportunities facing Ireland’s society and economy over the next decade. My Department is working with other Government departments to develop this, with the aim of publishing Ireland’s first overarching whole-of-government National Migration and Integration Strategy in 2026.  The provision of accessible language supports remains an important element of our broader approach to integration. Education and Training Boards across the country offer free ‘English for Speakers of Other Languages’ (ESOL) classes for migrants. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 694. Deputy Alan Kelly asked the Minister for Justice, Home Affairs and Migration to introduce a compulsory English language course concluding with an oral and written examination for non-European Union adults as a provision for achieving right to remain status in Ireland, excluding those who can demonstrate an oral and written competency in the language. [71525/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_551",
          "debateSectionId": "dbsect_551",
          "showAs": "Immigration Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_551.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_694",
        "questionNumber": 694
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I propose to take Questions Nos. 694, 695, 696, 697, 698 and 699 together.  I can advise the Deputy that my Department has not developed any plans or proposals to introduce civic and language courses or tests for applicants seeking an immigration permission to remain in the State or as part of the naturalisation process.  Last month Minister O'Callaghan and I secured Government approval to introduce new policies and legislative changes to strengthen Ireland’s migration and asylum system to ensure it is rules-based, efficient and more aligned with EU Member States.  In this context, my Department is reviewing many aspects of our current immigration regime, including the requirements for naturalisation.  As my Department does not record details of the English-language competence of individuals who receive an immigration permission or a certificate of naturalisation, the statistics the Deputy has requested are not available. However, the Central Statistics Office, through Census 2022, has gathered data on the English-language ability of people living in Ireland whose speak a language other than English or Irish at home, which is set out at data.cso.ie/table/F5015.  As the Deputy may be aware, the Programme for Government 2025 contains a commitment to publish a National Migration and Integration Strategy detailing how we intend to meet the demands and the opportunities facing Ireland’s society and economy over the next decade. My Department is working with other Government departments to develop this, with the aim of publishing Ireland’s first overarching whole-of-government National Migration and Integration Strategy in 2026.  The provision of accessible language supports remains an important element of our broader approach to integration. Education and Training Boards across the country offer free ‘English for Speakers of Other Languages’ (ESOL) classes for migrants. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 695. Deputy Alan Kelly asked the Minister for Justice, Home Affairs and Migration to introduce a compulsory English language course for all European Union adult citizens wishing to achieve Irish citizenship (details supplied). [71526/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_551",
          "debateSectionId": "dbsect_551",
          "showAs": "Immigration Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_551.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_695",
        "questionNumber": 695
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I propose to take Questions Nos. 694, 695, 696, 697, 698 and 699 together.  I can advise the Deputy that my Department has not developed any plans or proposals to introduce civic and language courses or tests for applicants seeking an immigration permission to remain in the State or as part of the naturalisation process.  Last month Minister O'Callaghan and I secured Government approval to introduce new policies and legislative changes to strengthen Ireland’s migration and asylum system to ensure it is rules-based, efficient and more aligned with EU Member States.  In this context, my Department is reviewing many aspects of our current immigration regime, including the requirements for naturalisation.  As my Department does not record details of the English-language competence of individuals who receive an immigration permission or a certificate of naturalisation, the statistics the Deputy has requested are not available. However, the Central Statistics Office, through Census 2022, has gathered data on the English-language ability of people living in Ireland whose speak a language other than English or Irish at home, which is set out at data.cso.ie/table/F5015.  As the Deputy may be aware, the Programme for Government 2025 contains a commitment to publish a National Migration and Integration Strategy detailing how we intend to meet the demands and the opportunities facing Ireland’s society and economy over the next decade. My Department is working with other Government departments to develop this, with the aim of publishing Ireland’s first overarching whole-of-government National Migration and Integration Strategy in 2026.  The provision of accessible language supports remains an important element of our broader approach to integration. Education and Training Boards across the country offer free ‘English for Speakers of Other Languages’ (ESOL) classes for migrants. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 696. Deputy Alan Kelly asked the Minister for Justice, Home Affairs and Migration if she plans to introduce a compulsory course of English, to exclude a demand for fluency in English applicants for right to remain or citizenship people who are of retirement age or who have special learning difficulties. [71527/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_551",
          "debateSectionId": "dbsect_551",
          "showAs": "Immigration Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_551.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_696",
        "questionNumber": 696
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I propose to take Questions Nos. 694, 695, 696, 697, 698 and 699 together.  I can advise the Deputy that my Department has not developed any plans or proposals to introduce civic and language courses or tests for applicants seeking an immigration permission to remain in the State or as part of the naturalisation process.  Last month Minister O'Callaghan and I secured Government approval to introduce new policies and legislative changes to strengthen Ireland’s migration and asylum system to ensure it is rules-based, efficient and more aligned with EU Member States.  In this context, my Department is reviewing many aspects of our current immigration regime, including the requirements for naturalisation.  As my Department does not record details of the English-language competence of individuals who receive an immigration permission or a certificate of naturalisation, the statistics the Deputy has requested are not available. However, the Central Statistics Office, through Census 2022, has gathered data on the English-language ability of people living in Ireland whose speak a language other than English or Irish at home, which is set out at data.cso.ie/table/F5015.  As the Deputy may be aware, the Programme for Government 2025 contains a commitment to publish a National Migration and Integration Strategy detailing how we intend to meet the demands and the opportunities facing Ireland’s society and economy over the next decade. My Department is working with other Government departments to develop this, with the aim of publishing Ireland’s first overarching whole-of-government National Migration and Integration Strategy in 2026.  The provision of accessible language supports remains an important element of our broader approach to integration. Education and Training Boards across the country offer free ‘English for Speakers of Other Languages’ (ESOL) classes for migrants. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 697. Deputy Alan Kelly asked the Minister for Justice, Home Affairs and Migration the number of adults in 2021 to 2025 which have received right to remain in Ireland without a competence in English. [71529/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_551",
          "debateSectionId": "dbsect_551",
          "showAs": "Immigration Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_551.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_697",
        "questionNumber": 697
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I propose to take Questions Nos. 694, 695, 696, 697, 698 and 699 together.  I can advise the Deputy that my Department has not developed any plans or proposals to introduce civic and language courses or tests for applicants seeking an immigration permission to remain in the State or as part of the naturalisation process.  Last month Minister O'Callaghan and I secured Government approval to introduce new policies and legislative changes to strengthen Ireland’s migration and asylum system to ensure it is rules-based, efficient and more aligned with EU Member States.  In this context, my Department is reviewing many aspects of our current immigration regime, including the requirements for naturalisation.  As my Department does not record details of the English-language competence of individuals who receive an immigration permission or a certificate of naturalisation, the statistics the Deputy has requested are not available. However, the Central Statistics Office, through Census 2022, has gathered data on the English-language ability of people living in Ireland whose speak a language other than English or Irish at home, which is set out at data.cso.ie/table/F5015.  As the Deputy may be aware, the Programme for Government 2025 contains a commitment to publish a National Migration and Integration Strategy detailing how we intend to meet the demands and the opportunities facing Ireland’s society and economy over the next decade. My Department is working with other Government departments to develop this, with the aim of publishing Ireland’s first overarching whole-of-government National Migration and Integration Strategy in 2026.  The provision of accessible language supports remains an important element of our broader approach to integration. Education and Training Boards across the country offer free ‘English for Speakers of Other Languages’ (ESOL) classes for migrants. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 698. Deputy Alan Kelly asked the Minister for Justice, Home Affairs and Migration the number of adults in 2021 to 2025 which have received Irish citizenship without a competence in English. [71530/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_551",
          "debateSectionId": "dbsect_551",
          "showAs": "Immigration Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_551.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_698",
        "questionNumber": 698
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I propose to take Questions Nos. 694, 695, 696, 697, 698 and 699 together.  I can advise the Deputy that my Department has not developed any plans or proposals to introduce civic and language courses or tests for applicants seeking an immigration permission to remain in the State or as part of the naturalisation process.  Last month Minister O'Callaghan and I secured Government approval to introduce new policies and legislative changes to strengthen Ireland’s migration and asylum system to ensure it is rules-based, efficient and more aligned with EU Member States.  In this context, my Department is reviewing many aspects of our current immigration regime, including the requirements for naturalisation.  As my Department does not record details of the English-language competence of individuals who receive an immigration permission or a certificate of naturalisation, the statistics the Deputy has requested are not available. However, the Central Statistics Office, through Census 2022, has gathered data on the English-language ability of people living in Ireland whose speak a language other than English or Irish at home, which is set out at data.cso.ie/table/F5015.  As the Deputy may be aware, the Programme for Government 2025 contains a commitment to publish a National Migration and Integration Strategy detailing how we intend to meet the demands and the opportunities facing Ireland’s society and economy over the next decade. My Department is working with other Government departments to develop this, with the aim of publishing Ireland’s first overarching whole-of-government National Migration and Integration Strategy in 2026.  The provision of accessible language supports remains an important element of our broader approach to integration. Education and Training Boards across the country offer free ‘English for Speakers of Other Languages’ (ESOL) classes for migrants. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 699. Deputy Alan Kelly asked the Minister for Justice, Home Affairs and Migration to introduce a compulsory examination course on Irish culture and institutions for all immigrants seeking right to remain or citizenship; and to ensure a cohort of permanent teachers be established to deliver such a course either online or in person (details supplied). [71535/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_551",
          "debateSectionId": "dbsect_551",
          "showAs": "Immigration Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_551.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_699",
        "questionNumber": 699
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 735 and 737 together.  The Garda Commissioner is responsible for the management and administration of An Garda Síochána under section 33 of the Policing, Security and Community Safety Act 2024. This includes all operational policing matters, including the allocation and deployment of Garda members to specialist units.  I am advised by An Garda Síochána that the below table outlines the Garda allocations in respect of Gardaí trained and currently deployed in specialist units for immigration, public order, serious and organised crime and cybercrime within Cork City and Limerick Garda divisions:     Division    Immigration    Public Order    Serious Crime Hub    Cybercrime      Cork City    15    79    135    8      Limerick    5    58    132    2     Cybercrime is a national unit which is attached to Garda National Cyber Crime Bureau.  With regard to public order policing, I understand that Gardaí are trained in public order and are deployed from across the organisation for operational requirements when the need arises. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 735. Deputy Alan Kelly asked the Minister for Justice, Home Affairs and Migration the number of Gardaí trained and currently deployed in specialist units for serious and organised crime, immigration, public order and cyber-crime within Cork city division. [72167/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_585",
          "debateSectionId": "dbsect_585",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_585.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_735",
        "questionNumber": 735
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Government is committed to providing An Garda Síochána with the resources needed to keep people safe. This is reflected in the unprecedented allocation of over €2.59 billion in Budget 2026. This is allowing for sustained investment in recruitment, equipment, technology, and vehicles.  I am advised by the Garda authorities that the current age profile of the Garda vehicle fleet within the Laois-Offaly Division is broken down in the table below:     Age    Number of Vehicles      <1 year    12      1-2 years    16      2-4 years    8      4-6 years    26      6+ years    18      Total    80     The Garda authorities have further advised all vehicles are operated up to the manufacturer's durability limits or uneconomic repair, irrespective of age. A comprehensive Service Repair and Maintenance programme is in place to ensure that all vehicles are operating to manufacturer's specifications  The responsibility for the efficient deployment of all official Garda vehicles in each Division is assigned to the Divisional Officer, who may allocate vehicles between Stations as required by operational circumstances. The allocation of these vehicles is monitored and reviewed on a continual basis.  An Garda Síochána publishes detailed information on the Garda fleet from 2008 to date, including a Divisional monthly breakdown. Monthly fleet reports are currently available from 2020 to November 2025 and are publicly available on the Garda website at the following link:  [ www.garda.ie/en/about-us/our-departments/finance-services/finance-fleet-management.html ] . ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 736. Deputy Alan Kelly asked the Minister for Justice, Home Affairs and Migration the age profile of the Garda fleet within Laois-Offaly division, in tabular form. [72168/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_586",
          "debateSectionId": "dbsect_586",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_586.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_736",
        "questionNumber": 736
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 735 and 737 together.  The Garda Commissioner is responsible for the management and administration of An Garda Síochána under section 33 of the Policing, Security and Community Safety Act 2024. This includes all operational policing matters, including the allocation and deployment of Garda members to specialist units.  I am advised by An Garda Síochána that the below table outlines the Garda allocations in respect of Gardaí trained and currently deployed in specialist units for immigration, public order, serious and organised crime and cybercrime within Cork City and Limerick Garda divisions:     Division    Immigration    Public Order    Serious Crime Hub    Cybercrime      Cork City    15    79    135    8      Limerick    5    58    132    2     Cybercrime is a national unit which is attached to Garda National Cyber Crime Bureau.  With regard to public order policing, I understand that Gardaí are trained in public order and are deployed from across the organisation for operational requirements when the need arises. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 737. Deputy Alan Kelly asked the Minister for Justice, Home Affairs and Migration the number of Gardai trained and currently deployed in specialist units for serious and organised crime, immigration, public order and cyber-crime within the Limerick division. [72169/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_585",
          "debateSectionId": "dbsect_585",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_585.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_737",
        "questionNumber": 737
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  My Department has a network of Counsellors and Attachés who are seconded to the Department of Foreign Affairs and Trade and based in Irish Embassies and Missions in eleven locations around the world. This network works at fostering and maintaining relationships with key decision makers, stakeholders and colleagues in the country/region of their posting. The Counsellors and Attachés also work closely with the Bord Bia overseas team to support trade development efforts in local markets.  The roles of the Attachés are continuously reviewed in line with the strategic priorities for my Department. The UK remains our largest agricultural food export market, and we also have significant imports from the UK. There are long established and mutually beneficial trading relationships between food producers in Ireland and food businesses and retailers in the UK.  With regards to the London Embassy, my Department's representation is led at Counsellor (Principal Officer) level, with additional posts assigned depending on business needs. My Department continues to have ongoing positive engagement at all levels with UK counterparts. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 797. Deputy Alan Kelly asked the Minister for Agriculture, Food and the Marine the reason his Department abolished the agricultural attache post in London, contrary to his Department’s management board July 2025 decision, and replace it with a more junior grade administrative officer; and the way in which this is this consistent with the UK’s importance as Ireland’s largest agricultural food export market and ongoing post-Brexit regulatory divergence. [71951/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_622",
          "debateSectionId": "dbsect_622",
          "showAs": "Departmental Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_622.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_797",
        "questionNumber": 797
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 848. Deputy Alan Kelly asked the Minister for Children, Disability and Equality the vacant rate for Children's Disability Network Teams in CHO3 as of 30 November 2025. [72173/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_671",
          "debateSectionId": "dbsect_671",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_671.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_848",
        "questionNumber": 848
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 849. Deputy Alan Kelly asked the Minister for Children, Disability and Equality the number of WTE clinical nurse specialist in intellectual disabilities within CHO3, in 2024 and to-date in 2025, in tabular form. [72174/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_672",
          "debateSectionId": "dbsect_672",
          "showAs": "Mental Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_672.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_849",
        "questionNumber": 849
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1044. Deputy Alan Kelly asked the Minister for Health the number of WTE consultant ophthalmic surgeons based at Nenagh Hospital in the years of 2023, 2024 and to-date in 2025, in tabular form. [72164/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_857",
          "debateSectionId": "dbsect_857",
          "showAs": "Hospital Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_857.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1044",
        "questionNumber": 1044
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1045. Deputy Alan Kelly asked the Minister for Health the number of WTE dentists and dental nurse staff, by grade, based at Tyone health centre, County Tipperary in the years of 2024 and to-date in 2025, in tabular form. [72165/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_858",
          "debateSectionId": "dbsect_858",
          "showAs": "Dental Services ",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_858.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1045",
        "questionNumber": 1045
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1046. Deputy Alan Kelly asked the Minister for Health the number of cataract surgeries carried out at Nenagh Hospital in the years of 2024 and to-date in 2025, in tabular form. [72166/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_859",
          "debateSectionId": "dbsect_859",
          "showAs": "Hospital Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_859.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1046",
        "questionNumber": 1046
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science (Deputy James Lawless)  In the Further Education and Training (FET) sector, all 16 Education and Training Boards (ETBs) offer free English to Speakers of Other Languages (ESOL) classes, as part of their Adult Literacy provision, to meet the day-to-day social, cultural and work-related language needs of new community members. Priority is given to unemployed migrants, International Protection Applicants (IPAs) and refugees with limited or no English language skills. The goal is to help them achieve functional language proficiency, fostering social cohesion and creating pathways to education, training, pre-vocational opportunities, and work.  ESOL provision is available at all levels, from beginner to advanced. Courses be unaccredited or accredited at levels 1 to 6 of the National Framework for Qualifications or through other systems such as Cambridge English Qualifications.  SOLAS has advised my officials that provisional figures from its Programme Learner Support System (PLSS) reports that from January until end of November 2025, ETBs have provided 4,572 ESOL courses.  It is important to note that PLSS does not collect data on the numbers availing of such courses before being granted leave to remain. However, SOLAS has provided provisional PLSS figures relating to the enrolment of IPAs in ESOL since 2022 in the table below.     Unique Learner Enrolments in ESOL    2022    2023    2024    End of November 2025      IPAs    1,522    3,211    4,555    3,949       Comparable data for 2020 and 2021 is not available.  PLSS does not gather data from learners relating to Irish citizenship. However, the following provisional PLSS figures may be of interest to the Deputy.     Unique Learner Enrolments in ESOL    2021    2022    2023    2024    End of November 2025      Non-nationals    7,949    16,619    38,693    36,913    28,042       Comparable data for 2020 is not available. Not all learners provide information about their nationality.  Since the onset of the war in Ukraine in early 2022, the FET sector mobilised rapidly to support Ukrainian refugees, particularly through the significant scaling up of ESOL courses. This impact is clearly demonstrated in the figures presented in the table above. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1161. Deputy Alan Kelly asked the Minister for Further and Higher Education, Research, Innovation and Science the courses in English as a second language currently available for EU and non-EU citizens resident in Ireland; the number of adults who have availed of such courses over the past five years before being granted right to remain; and the number of adults who have availed of such courses over the past five years before achieving Irish citizenship.  [71528/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_977",
          "debateSectionId": "dbsect_977",
          "showAs": "Education and Training Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_977.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1161",
        "questionNumber": 1161
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  I would like to take this opportunity to acknowledge the exceptional work carried out by tutors delivering English for Speakers of Other Languages (ESOL) programmes in the Education and Training Boards (ETBs) since 2022 in response to the significant demand arising from the arrival of people displaced by the war in Ukraine. Their efforts have been critical in supporting integration and access to education for those affected.  ETBs employ staff to deliver ESOL programmes under the terms and conditions of tutors or the new Adult Educator grade. It is important to note that there is no separate grade of “teacher of English” within the Further Education and Training sector.Substantial work has been undertaken over a number of years by my Department, the Department of Education and Youth, the Department of Public Expenditure, Education and Training Boards Ireland, SIPTU and TUI to improve pay and conditions for these tutors. In March 2024, agreement was reached between all parties to establish a new Adult Educator grade. This grade provides a standardised pay scale aligned to the Youthreach Resource Person grade, offering incremental progression, including those delivering ESOL programmes. Existing tutors may opt to convert to the new grade or remain on the hourly tutor rate.  ETBs are currently overseeing the implementation process for the new grade. My Department is continuing to monitor progress to ensure full implementation of these measures. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1162. Deputy Alan Kelly asked the Minister for Further and Higher Education, Research, Innovation and Science for an update on the measures being introduced to improve pay and conditions for teachers of English as a second language to adult immigrants. [71531/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_978",
          "debateSectionId": "dbsect_978",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_978.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1162",
        "questionNumber": 1162
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1163. Deputy Alan Kelly asked the Minister for Further and Higher Education, Research, Innovation and Science to introduce legislation establishing a permanent cohort of English as a second language teachers, in order to better provide for the needs of adult immigrants lacking a fluency in English; and to ensure that such teachers are given a contract that allows for teaching to be done in the evening, as well as during the day and during the summer holidays (details supplied).  [71534/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_979",
          "debateSectionId": "dbsect_979",
          "showAs": "Education and Training Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_979.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1163",
        "questionNumber": 1163
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  At the request of the Office of Public Works in 2018, the Valuation Office provided their opinion of the current market rental value of the Spa Lodge as being €1,800 per month. There were no annual revisions made to the valuation.  The OPW understands from An Garda Síochána that the former Garda Commissioner took up occupancy of the Lodge in February 2019. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 368. Deputy Alan Kelly asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the full details of the market valuation of Spa Lodge in the Phoenix Park in October 2018, when it was first occupied by the former Garda Commissioner (details supplied) in 2018; and the details of the annual revisions made to the valuation of that property for each of the years 2018-2025 inclusive. [70990/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_364",
          "debateSectionId": "dbsect_364",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_364.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_368",
        "questionNumber": 368
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I can assure the Deputy that I have provided him with all the information available to me in relation to the former Commissioner's remuneration and benefits.  In particular, I would refer the Deputy to my reply to oral parliamentary question 74 on this matter on 4 December that addressed the cost of accommodation that was provided to the former Commissioner, replies to parliamentary questions 707, 708, 712 and 713 on 9 December that addressed questions in relation to the pension contribution that was waived by the former Commissioner, and costs associated with the provision of security and the reply to parliamentary questions 268 that comprehensively addressed these matters.  In respect of utility bills I am informed that these were paid by the former Commissioner.  As the Deputy will be aware, the Office of Public Works is under the aegis of the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation and any questions in relation to expenditure by the OPW should be directed to him. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 469. Deputy Alan Kelly asked the Minister for Justice, Home Affairs and Migration the full details of all the payments made, for domestic utilities, waste collection, home maintenance, cleaning services, security and gardening services and any other contractual services paid for by the State at tax payers expense and provided to a person (details supplied) while they lived at Spa Lodge in the Phoenix Park between September 2018 and August 2025. [70991/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_458",
          "debateSectionId": "dbsect_458",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_458.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_469",
        "questionNumber": 469
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  As the Deputy will be aware, under the Garda Síochána Act 2005, as amended, the Policing Authority was responsible for the nomination of a person for appointment by the Government as Garda Commissioner from 2016 to 2025.  Following the retirement of Commissioner O'Sullivan in September 2017 the Policing Authority commenced preparations for a competition to fill the post of Garda Commissioner that would attract a wide pool of candidates.  In November 2017, the Policing Authority advised the Minister for Justice and Equality on the salary for the post and other matters such as removal expenses, accommodation and educational support for children.  With regard to accommodation, the Authority advised that in the case of a successful external candidate, it may be appropriate to provide for accommodation or an accommodation allowance given the requirement for the Garda Commissioner to reside in Dublin, and in light of the fact that the Commissioner is on call 24/7 throughout the year.  Contemporaneous media reports from late 2017 outlined that the Government may pay the accommodation costs and education fees for dependent children if an international candidate were to be selected for the role of Garda Commissioner.  The Information Booklet for the Commissioner competition was published in March 2018. The booklet included information on renumeration, including salary and pension details and that appropriate removal and relocation terms would be available, depending on the personal circumstances of the successful candidate. The booklet was available publicly for all prospective candidates, and the fact that accommodation may be provided was also covered in the media.  The Public Appointments Service (PAS) ran the competition and its report on the competition can be accessed at the following link: www.publicjobs.ie/documents/Report_on_appointment_of_new_Garda_Commissioner.pdf  Former Commissioner Harris was appointed as Garda Commissioner on 26 June 2018, and took up office on 3 September 2018. Commissioner Harris was the first Garda Commissioner who resided outside the State at the time of his appointment. Further to the appointment of Commissioner Harris in June 2018, suitable accommodation was identified for the Commissioner. As has been clarified, the former Garda Commissioner was provided with a house in the Phoenix Park by the Office of Public Works, the rent for which was paid by An Garda Síochána in the sum of €1,800 per month. As is also a matter of public record the former Commissioner paid benefit-in-kind in respect of the accommodation provided.  The Appropriation Accounts for An Garda Síochána since 2022, when reporting requirements changed, show that the former Commissioner's remuneration and benefits included benefit-in-kind of approximately €22,000 each year, which was the cost of the accommodation provided. The Appropriation Accounts note that the calculated value for the purpose of deducting tax was in accordance with Revenue requirements. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 470. Deputy Alan Kelly asked the Minister for Justice, Home Affairs and Migration the reason the provision of such a significant benefit as the provision of housing at the total expense of the taxpayer was not made known to any of the candidates on the shortlist for the role of Garda Commissioner in the course of the public competition held for the role in the Spring of 2018. [70992/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_459",
          "debateSectionId": "dbsect_459",
          "showAs": "Housing Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_459.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_470",
        "questionNumber": 470
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Garda Commissioner is responsible by law for all operational policing matters under Section 33 of the Policing, Security and Community Safety Act 2024.  I am informed by the Garda authorities that the matter referenced by the Deputy concerns a number of livescan (digitised) fingerprints, and relates to an ICT issue whereby two Garda systems, namely PULSE and the Automated Fingerprint Identification System (AFIS), do not appear to be communicating between each other fully.  In some instances, when the fingerprinting process has not been fully completed it is designated on PULSE as “suspended”. However, this “suspended” category does not appear on the AFIS database.  I understand that there has been significant engagement within An Garda Síochána, including Garda ICT, to identify the cause of the issue, its full extent, and remedies. This work is ongoing.  This review to date has found that there are approximately 23,000 “suspended” records that do not appear on the AFIS database. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 471. Deputy Alan Kelly asked the Minister for Justice, Home Affairs and Migration if he or his Department are now finally aware that in July 2021 the Garda National Technical Bureau (GNTB), with the expert assistance of the Garda ICT Department, diligently unearthed a catastrophic loss of biometric data amounting to in excess of 17,000 livescan fingerprint records that had fallen into ‘suspended’ status during the period June 2009 to July 2021. [70998/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_460",
          "debateSectionId": "dbsect_460",
          "showAs": "Data Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_460.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_471",
        "questionNumber": 471
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Garda Commissioner is responsible for the management and administration of An Garda Síochána under Section 33 of the Policing, Security and Community Safety Act 2024, which includes the training of Garda personnel throughout the State. As Minister I have no role in these independent functions.  I have been informed by the Garda authorities that at present no member of the Garda National Technical Bureau (GNTB) has a current CBRNe certification. Furthermore, no member of the Bureau is currently in possession of CBRNe suits or masks.  This situation is not however reflective of the overall preparedness of An Garda Síochána to deal with CBRN-related events.  Arrangements in respect of major emergencies are set out in the Framework for Major Emergency Management (MEM) which is intended to enable the Principal Response Agencies to prepare for and make a coordinated response to such emergencies.  I am advised by the Garda authorities that Chemical, Biological, Radioactive or Nuclear (CBRN) attacks or events have a multi-agency response under the MEM Framework and training and exercises are conducted between agencies at a strategic and operational level for such incidents.  An Garda Síochána are the lead agency in a malign CBRN attack and conduct training with first responders, armed units and intervention teams for such an attack. An Garda Síochána has a large cohort of trained CBRN responders. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 472. Deputy Alan Kelly asked the Minister for Justice, Home Affairs and Migration the number of members of the Garda National Technical Bureau (GNTB) who are currently certified in the area of CBRNe; when such certification is due to expire; and the expiration dates of the CBRN suits/masks on issue to them. [71004/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_461",
          "debateSectionId": "dbsect_461",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_461.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_472",
        "questionNumber": 472
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  It has not been possible to collate the information requested by the Deputy in the time available. I will write to the Deputy directly once the information is to hand. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 473. Deputy Alan Kelly asked the Minister for Justice, Home Affairs and Migration if his attention has been drawn to the servicing and repair of privately owned firearms being undertaken by Garda armourer personnel attached to the Garda firearms stores section in 2018, where such firearms were belonging to a hunt and pony club based in the Kildare area and where the cost of such servicing and repair was defrayed by public funds. [71009/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_463",
          "debateSectionId": "dbsect_463",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_463.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_473",
        "questionNumber": 473
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I can assure the Deputy that I have provided him with all the information available to me in relation to the former Commissioner's remuneration and benefits. In particular, I would refer the Deputy to my reply to oral parliamentary question 74 on this matter on 4 December that addressed the cost of accommodation that was provided to the former Commissioner and replies to parliamentary questions 707, 708, 712 and 713 on 9 December that addressed questions in relation to the pension contribution that was waived by the former Commissioner, and costs associated with the provision of security. However, in order to be of assistance to the Deputy, I have again set out the replies to these parliamentary questions in this reply.The former Commissioner was recruited on an annual salary of €250,000. In line with public service pay increases this salary increased to €317,657 during the Commissioners tenure. The former Commissioner had the option of joining the Single Public Service Pension Scheme or having a pension contribution equivalent to 18.4% of salary made to a pension scheme nominated by him. The former Commissioner chose not to avail of either option and waived his right to the pension entitlements available to him. The former Commissioner received no retirement gratuity on his retirement and is not in receipt of any pension in respect of his service as Commissioner. It may be noted that had the former Commissioner exercised the second option referred to above, the cost to the Exchequer over the seven years of his service is estimated at over €350,000.The former Commissioner was provided with a house in the Phoenix Park by the Office of Public Works, the rent for which was paid by An Garda Síochána in the sum of €1,800 per month. While personal tax details are confidential, I can confirm that the former Commissioner paid benefit-in-kind in respect of the accommodation provided. The published Appropriation Accounts for An Garda Síochána since 2022, when reporting requirements changed, show that the former Commissioner's remuneration and benefits included benefit-in-kind of approximately €22,000 each year, ie, the cost of the accommodation provided. The Appropriation Accounts note that the calculated value for the purpose of deducting tax was in accordance with Revenue requirements. The former Commissioner also received a Uniform Allowance of €890 per annum which is reflected in the Appropriations Accounts. Uniform allowances are payable to all members of An Garda Síochána. As I also outlined last week, the position of Garda Commissioner requires enhanced security for the officeholder due to the nature of his or her role as head of the State’s police and security service. Further to a security assessment, expenditure of €212,000 was incurred by An Garda Síochána in relation to the property occupied by the former Commissioner. As is standard, the detail of such security arrangements is not made public. An annual monitoring fee of €2,500 was also paid from the Garda budget in respect of these security arrangements. As the Deputy will be aware, the Office of Public Works is under the aegis of the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation and any questions in relation to expenditure by the OPW should be directed to him. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 268. Deputy Alan Kelly asked the Minister for Justice, Home Affairs and Migration if he has provided full and comprehensive details in relation to all aspects of the remuneration package of a former Garda Commissioner (details supplied) and all costs to the Exchequer associated with providing accommodation for the former Garda Commissioner during their tenure.; and if he will make a statement on the matter. [70726/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_212",
          "debateSectionId": "dbsect_212",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_212.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_268",
        "questionNumber": 268
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The valuation to ascertain the level of rent payable in respect of the house referred to was carried out by the Valuation Office. A copy of the report has been provided to the Deputy with some minor redactions to protect the identity of individuals. The floor plans attached to the Report have also been redacted for data protection reasons. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 340. Deputy Alan Kelly asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation who professionally carried out the market valuation upon which the monthly or annual rent was based on a property (details supplied); and if he will provide a copy of the report. [70196/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_306",
          "debateSectionId": "dbsect_306",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_306.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_340",
        "questionNumber": 340
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I propose to take Questions Nos. 341 and 342 together.  The Office of Public Works (OPW) engages with both the Department of Justice, Home Affairs and Migration and An Garda Síochána (AGS) on a regular basis on a broad range of issues. Much of this engagement is operational and takes place on a daily basis for example reactive call outs to various Garda Stations around the country by the OPW Regional Staff.  During 2017 and 2018 a monthly meeting was held between the OPW and AGS to discuss Garda Estate Management with a focus on the Garda Building Programme.  These meetings were generally attended by staff at Principal and Assistant Principal Level from AGS, Department of Justice, Home Affairs and Migration and the OPW.  Concurrently, there were several capital projects underway. Regular meetings were held between OPW and AGS in accordance with project governance arrangements. These projects included:  • Wexford Divisional Garda Station  • Kevin St Divisional Garda Station  • Galway Divisional Garda Station  • Walter Scott House, Military Road  • Athlone Divisional Garda Station Redevelopment Stage 2  • Fitzgibbon St Garda Station  • Garda Headquarters Phoenix Park – Masterplan  With respect to property matters, there are regular meetings held with the Department of Justice to discuss various accommodation issues. These are attended at Principal and Assistant Principal level. During 2017 and 2018 the OPW engaged with the Department to design and deliver a range of small projects in some of their Dublin offices that would facilitate the release of a high cost lease at number 94 St. Stephens Green that was due to expire in June 2018.  A high level meeting between the OPW and the Department was held to discuss these projects in August 2017 attended by the Secretary General and the Principal Officer from the Department. Attendees from the OPW included the then Chairman, Assistant Secretary, Principal Officer and Assistant Principal Officer.  There were also regular high-level meetings held between the Department of Justice, Home Affairs and Migration, the OPW and AGS to discuss key issues, the progress of key projects and the strategic approach to Garda Estate Management. These meetings were attended by staff at Assistant Secretary and Principal Officer Levels from the three organisations. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 341. Deputy Alan Kelly asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the dates and attendees at all meetings between the OPW and the Department of Justice, Home Affairs and Migration in 2017 and 2018, by date and attendees, in tabular form. [70203/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_307",
          "debateSectionId": "dbsect_307",
          "showAs": "Departmental Meetings",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_307.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_341",
        "questionNumber": 341
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I propose to take Questions Nos. 341 and 342 together.  The Office of Public Works (OPW) engages with both the Department of Justice, Home Affairs and Migration and An Garda Síochána (AGS) on a regular basis on a broad range of issues. Much of this engagement is operational and takes place on a daily basis for example reactive call outs to various Garda Stations around the country by the OPW Regional Staff.  During 2017 and 2018 a monthly meeting was held between the OPW and AGS to discuss Garda Estate Management with a focus on the Garda Building Programme.  These meetings were generally attended by staff at Principal and Assistant Principal Level from AGS, Department of Justice, Home Affairs and Migration and the OPW.  Concurrently, there were several capital projects underway. Regular meetings were held between OPW and AGS in accordance with project governance arrangements. These projects included:  • Wexford Divisional Garda Station  • Kevin St Divisional Garda Station  • Galway Divisional Garda Station  • Walter Scott House, Military Road  • Athlone Divisional Garda Station Redevelopment Stage 2  • Fitzgibbon St Garda Station  • Garda Headquarters Phoenix Park – Masterplan  With respect to property matters, there are regular meetings held with the Department of Justice to discuss various accommodation issues. These are attended at Principal and Assistant Principal level. During 2017 and 2018 the OPW engaged with the Department to design and deliver a range of small projects in some of their Dublin offices that would facilitate the release of a high cost lease at number 94 St. Stephens Green that was due to expire in June 2018.  A high level meeting between the OPW and the Department was held to discuss these projects in August 2017 attended by the Secretary General and the Principal Officer from the Department. Attendees from the OPW included the then Chairman, Assistant Secretary, Principal Officer and Assistant Principal Officer.  There were also regular high-level meetings held between the Department of Justice, Home Affairs and Migration, the OPW and AGS to discuss key issues, the progress of key projects and the strategic approach to Garda Estate Management. These meetings were attended by staff at Assistant Secretary and Principal Officer Levels from the three organisations. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 342. Deputy Alan Kelly asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the dates and attendees at all meetings between the OPW and An Garda Síochána in 2017 and 2018, by date and attendees, in tabular form. [70204/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_307",
          "debateSectionId": "dbsect_307",
          "showAs": "Departmental Meetings",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_307.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_342",
        "questionNumber": 342
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The Living Alone Increase (LAI) is not a scheme or a stand-alone payment, but it is a supplement to a primary social protection payment of €22 per week made to people aged 66 years or over, who are in receipt of certain social welfare payments and who are living alone.  LAI is available for those aged 66 or over, where the person is in receipt of Death Benefit under the Occupational Injuries Benefit Scheme.  LAI is also available for those aged 66 or over, where the person is in receipt of State Pension (Contributory), State Pension (Non-Contributory), Bereaved Partner’s (Contributory) Pension, Incapacity Supplement under the Occupational Injuries Benefit Scheme and Deserted Wife's Benefit.  LAI is also paid to people aged under 66 who live alone and are in receipt of Disability Allowance, Invalidity Pension, Incapacity Supplement or Blind Pension.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 575. Deputy Alan Kelly asked the Minister for Social Protection if he will consider changing the rules so that a person in receipt of death benefit is entitled to the living alone allowance upon reaching the age of 66. [70229/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_493",
          "debateSectionId": "dbsect_493",
          "showAs": "Social Welfare Benefits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_493.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_575",
        "questionNumber": 575
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 698, 699 and 700 together.  As the three questions relate to biometric data and terrorism, I intend to answer them together. In order to do so, I have requested material from An Garda Síochána and will provide the Deputy with a comprehensive reply once that is to hand. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 698. Deputy Alan Kelly asked the Minister for Justice, Home Affairs and Migration the legislative and operational measures he has undertaken to develop and implement systems to collect biometric data to responsibly identify terrorists. [70083/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_558",
          "debateSectionId": "dbsect_558",
          "showAs": "Data Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_558.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_698",
        "questionNumber": 698
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 698, 699 and 700 together.  As the three questions relate to biometric data and terrorism, I intend to answer them together. In order to do so, I have requested material from An Garda Síochána and will provide the Deputy with a comprehensive reply once that is to hand. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 699. Deputy Alan Kelly asked the Minister for Justice, Home Affairs and Migration the challenges being faced in setting capacity to collect biometric data to responsibly identify terrorists. [70088/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_558",
          "debateSectionId": "dbsect_558",
          "showAs": "Data Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_558.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_699",
        "questionNumber": 699
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 698, 699 and 700 together.  As the three questions relate to biometric data and terrorism, I intend to answer them together. In order to do so, I have requested material from An Garda Síochána and will provide the Deputy with a comprehensive reply once that is to hand. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 700. Deputy Alan Kelly asked the Minister for Justice, Home Affairs and Migration if he is sharing biometric data relating to terrorist activities with other relevant states, Interpol and other relevant international bodies. [70089/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_558",
          "debateSectionId": "dbsect_558",
          "showAs": "Data Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_558.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_700",
        "questionNumber": 700
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  Biometric data is collected for a range of criminal justice and immigration management purposes. Biometric data is collected by the Irish Immigration Service and the International Protection Office and agencies and statutory bodies under the aegis of my Department including An Garda Síochána and Forensic Science Ireland. The collection and storage of such data is subject to appropriate safeguards and is underpinned in all cases by relevant legislation to permit the collection and sharing of such data.  The data collected is stored in a number of databases such as the Automated Fingerprint Identification System (AFIS) and the Garda National Immigration Bureau Information System (GNIB-IS) or the National DNA Database System.  The key piece of domestic legislation that provides for the taking of biometric samples is the Criminal Justice (Forensic Evidence and DNA Database System) Act 2014, which sets out in law the strict procedural guidelines with regard to the collection, transfer and retention of biometric data.  There are long-standing sharing arrangements in place with international policing and security partners. Access to the national DNA database and automated fingerprint information system by other States is strictly controlled and has regard to data protection requirements in respect of personal data.  In this regard privacy rights are protected in accordance with the EU General Data Protection Regulation, 2016/679 (GDPR), the EU Law Enforcement Directive 2016/680 (LED) and the Data Protection and the Data Protection Act 2018. Securing and managing personal data in accordance with the GDPR principles is a priority and is governed by a comprehensive set of policies, procedures and systems.  My Department has implemented appropriate measures to ensure that all data held under its control is secure and is not at risk from unauthorised access. Measures for the protection of personal data are reviewed and upgraded where appropriate, on an ongoing basis.  Insofar as DNA is concerned, the DNA Database System Oversight Committee oversees the management and operation of the DNA Database System for the purposes of maintaining the integrity and security of the System and for that purpose to satisfy itself that the provisions of the 2014 Act in relation to the System are being complied with. The Committee is independently chaired by Justice Catherine Murphy. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 701. Deputy Alan Kelly asked the Minister for Justice, Home Affairs and Migration the way in which he is ensuring that the collection and exchange of biometric data is carried out in compliance with domestic and international human rights law. [70090/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_559",
          "debateSectionId": "dbsect_559",
          "showAs": "Data Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_559.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_701",
        "questionNumber": 701
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  My Department carries out public awareness campaigns, where appropriate, in order to increase public understanding of key issues in the justice sector. Public information campaigns have also been undertaken from time to time to highlight career opportunities recruitment campaigns in the Justice sector.  The information requested by the Deputy in relation to these campaigns is contained in the table below.   Department of Justice, Home Affairs and Migration             2024 Expenditure      2025 Expenditure*      Total       Department of Justice, Home Affairs and Migration    €4,892,898    €4,078,600     €8,971,498       *To 30/11   I am informed that the information requested with regard to expenditure by agencies under the aegis of my Department is provided in the table below.      Agency/Body      2024 Expenditure      2025 Expenditure*      Total       Courts Service    €96,350    €59,219     €155,569       Cuan    €3,038,570    €4,497,492     €7,536,062       Data Protection Commission    €0    €623,292     €623,292       Fiosrú    €129,316    €20,670     €149,986       Gambling Regulatory Authority of Ireland    €0    €92,619     €92,619       Insolvency Service of Ireland    €669,043    €352,433     €1,021,476       Legal Aid Board    €43,000    €54,066     €97,066       Legal Services Regulatory Authority    €14,986    €843     €15,829       Irish Prison Service    €83,903    €74,993     €158,896       Office of the Inspector of Prisons    €0    €7,644     €7,644       Parole Board    €137,253    €11,210     €148,463       Policing and Community Safety Authority    €1,088    €5,924     €7,012       Private Security Authority    €154,528    €143,992     €298,520        Total      €4,368,037      €5,944,397      €10,312,434       *To 30/11   I am informed that it has not been possible for An Garda Síochána to provide the information requested within the timeline provided. I will write to the Deputy directly once this is available. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 703. Deputy Alan Kelly asked the Minister for Justice, Home Affairs and Migration the total cost of all advertising and promotional activity his Department and all bodies under his aegis had in each of the years 2024 and up to 1 December 2025, in chronological order. [70138/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_562",
          "debateSectionId": "dbsect_562",
          "showAs": "Departmental Advertising",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_562.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_703",
        "questionNumber": 703
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 707, 708 and 712 together.  The former Commissioner had the option of joining the Single Public Service Pension Scheme or having a pension contribution equivalent to 18.4% of salary made to a pension scheme nominated by him.  The former Commissioner chose not to avail of either option and waived his right to the pension entitlements available to him. Therefore, the former Commissioner received no retirement gratuity on his retirement and is not in receipt of any pension in respect of his service as Commissioner.  It is to be noted that had the former Commissioner exercised the second option referred to above, the cost to the Exchequer over the seven years of his service is estimated at over €350,000. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 707. Deputy Alan Kelly asked the Minister for Justice, Home Affairs and Migration if recent statements by him and his Department regarding a person (details supplied) waiving their entitlement to a pension contribution of 18.4% of salary is confirmation that they did not or will not receive any pension arising from their employment as Garda Commissioner. [70167/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_566",
          "debateSectionId": "dbsect_566",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_566.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_707",
        "questionNumber": 707
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 707, 708 and 712 together.  The former Commissioner had the option of joining the Single Public Service Pension Scheme or having a pension contribution equivalent to 18.4% of salary made to a pension scheme nominated by him.  The former Commissioner chose not to avail of either option and waived his right to the pension entitlements available to him. Therefore, the former Commissioner received no retirement gratuity on his retirement and is not in receipt of any pension in respect of his service as Commissioner.  It is to be noted that had the former Commissioner exercised the second option referred to above, the cost to the Exchequer over the seven years of his service is estimated at over €350,000. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 708. Deputy Alan Kelly asked the Minister for Justice, Home Affairs and Migration whether, despite recent statements by him and his Department regarding a person (details supplied) waiving their entitlement to a pension contribution of 18.4% of salary, they did or will receive any pension arising from his employment in their former role; and if so, the precise amount of the pension and any gratuity paid to them or yet to be paid to them by the Irish State. [70168/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_566",
          "debateSectionId": "dbsect_566",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_566.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_708",
        "questionNumber": 708
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  As the Deputy will be aware Irish passports are issued by the Irish Government through the Passport Service of the Department of Foreign Affairs and Trade and I have no role in the issuance of passports. The entitlement to an Irish passport is governed by the Constitution and laws.   ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 709. Deputy Alan Kelly asked the Minister for Justice, Home Affairs and Migration if a person (details supplied) will continue to hold an Irish passport, which was only sought and provided to him in advance of their employment as Garda Commissioner; and if not, if they will now return their Irish passport and revert to the British passport they held/used in advance of taking up the role of Garda Commissioner and Head of Service for the Irish Intelligence Service. [70169/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_567",
          "debateSectionId": "dbsect_567",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_567.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_709",
        "questionNumber": 709
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Single Public Service Pension Scheme is a statutory Public Service Career-Average Defined Benefit Pension Scheme, established on 1 January 2013 under the Public Service Pensions (Single Scheme and Other Provisions) Act 2012.  All new-entrant pensionable public servants commencing employment from 1 January 2013, including members of An Garda Síochána, are eligible to be members of the Single Public Service Pension Scheme (“Single Scheme”), as provided for under sections 9 and 10 of the Public Service Pensions (Single Scheme and Other Provisions) Act 2012.  Membership of the Single Scheme is, in general, a condition of employment for new-entrant pensionable public servants from 1 January 2013 and is the applicable pension scheme for members of An Garda Síochána, including Gardaí who may have previously served in other police services.  More broadly, the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation retains responsibility for policy matters related to the Single Public Service Pension Scheme and the Public Service Pensions (Single Scheme and Other Provisions) Act 2012. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 710. Deputy Alan Kelly asked the Minister for Justice, Home Affairs and Migration if the career averaging pension scheme, as applied to all newly attested members of An Garda Síochána and other new entrants to the public/civil service since 2012, is applied in the precise same manner to ex-members of the Police Service of Northern Ireland (PSNI)/Royal Ulster Constabulary (RUC) who joined and were attested to An Garda Síochána since 2012. [70170/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_568",
          "debateSectionId": "dbsect_568",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_568.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_710",
        "questionNumber": 710
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 707, 708 and 712 together.  The former Commissioner had the option of joining the Single Public Service Pension Scheme or having a pension contribution equivalent to 18.4% of salary made to a pension scheme nominated by him.  The former Commissioner chose not to avail of either option and waived his right to the pension entitlements available to him. Therefore, the former Commissioner received no retirement gratuity on his retirement and is not in receipt of any pension in respect of his service as Commissioner.  It is to be noted that had the former Commissioner exercised the second option referred to above, the cost to the Exchequer over the seven years of his service is estimated at over €350,000. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 712. Deputy Alan Kelly asked the Minister for Justice, Home Affairs and Migration if the career averaging pension scheme, as applied to all newly attested members of An Garda Síochána since and other new entrants to the public/civil service since 2012, is applied in the precise same manner to any pension being provided to a person (details supplied), given that their employment with an Garda Síochána only took effect in September 2018 following their retirement from the Police Service of Northern Ireland (PSNI)/Royal Ulster Constabulary (RUC). [70176/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_566",
          "debateSectionId": "dbsect_566",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_566.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_712",
        "questionNumber": 712
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The position of Garda Commissioner requires enhanced security for the officeholder due to the nature of the role as head of the State’s police and security service. Further to a security assessment, expenditure of €212,000 was incurred by An Garda Síochána in relation to the property occupied by the former Commissioner. As is standard, the detail of such security arrangements is not made public.  An annual monitoring fee of €2,500 was also paid from the Garda budget in respect of these security arrangements. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 713. Deputy Alan Kelly asked the Minister for Justice, Home Affairs and Migration the total costs of the additional security features implemented on a property prior to the occupancy and during the occupancy of a person (details supplied) in each of the years 2017 to 2025, in tabular form. [70195/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Alan-Kelly.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Alan-Kelly.S.2007-07-23",
          "showAs": "Alan Kelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_570",
          "debateSectionId": "dbsect_570",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_570.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_713",
        "questionNumber": 713
      },
      "contextDate": "2025-12-09"
    }
  ]
}