{
  "head": {
    "counts": {
      "questionCount": 1159,
      "resultCount": 1159
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Early learning and childcare capacity is increasing. Data from the Annual Early Years Sector Profile shows that the estimated number of enrolments increased by approximately 19% between 2022 and 2024. In Dublin City, there has been an increase of 22% in the numbers of children enrolled during this period demonstrating the substantial increase in the numbers of children benefitting from services.  However, it appears that demand for early learning and childcare remains higher than available supply in certain parts of the country, particularly for younger children.  The Building Blocks Extension scheme allowed Core Funding Partner Services to extend their existing premises or, in the case of community services, to construct or purchase new premises. The Scheme will deliver up to 1,500 full-day care places, beginning to become available from 2026.  As part of the National Development Plan, €197 million has been made available for capital investment in early learning and childcare in the period 2026-2030. This will include investment in buildings through the State-led early learning and childcare programme, investment in expansion of existing early learning and childcare operators through the Building Blocks scheme and a number of quality initiatives including supports to childminders.  Preparatory work for this programme of capital investment is underway, with the multi-year programme planned to commence from 2026 onwards.  Early learning and care and school-age childcare should serve the public good, giving children opportunities, enabling families to make decisions that work for them, and providing an important support for economic growth and social equity. This Government recognises that to achieve their full potential, parents need support, and Early Learning and Care and School-Age Childcare are key enablers of work life balance. Shaping the Future, the new Early Years Action Plan, sets out the next steps in delivery of the key commitments in the Programme for Government to improve affordability, quality, and access.  Phase 2 actions will be published later in 2026 following a broad consultation and will include a roadmap to reduce parental fees to a maximum of €200 per month over the lifetime of the Government.  Core Funding is a funding scheme designed to support affordability for parents through:  • ensuring no increases in fees,  • capping the maximum fees that can be charged, and  • offering the National Childhood Scheme (NCS) and the Early Childhood Care and Education (ECCE) programme to all eligible children  €20.6 million has been secured in Budget 2026 to support providers in adhering to Core Funding fee management conditions. This will guarantee that Core Funding’s monetary protections will continue to be passed on to families. New, lower maximum fee levels will be set during the course of 2026, when full details of Core Funding for the 2026-27 programme year are announced.  The NCS provides subsidies to reduce the costs of childcare for families. A minimum of €2.14 per child per hour is available to all families through the universal subsidy. A Review of the NCS is due to commence early in 2026 which will, among other things, look at the impact of NCS subsidies on the labour market participation of parents across all income groups.  Yesterday I announced adjustments to the NCS income assessed subsidy. From September 2026, the NCS income thresholds and multiple child deductions (MCD) will be increased. The lower and upper income thresholds will be increased from the existing €26,000 to €60,000, up to between €34,000 and €68,000.  The multiple child discount (MCD) component of the NCS subsidy will also be increased from €4,300 to €5,500 for families with 2 children and from €8,600 to €11,000 for families with 3 or more children, to reduce the cumulative burden of childcare costs.  These changes will improve the affordability of childcare for up to 47,000 children from lower income families. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 11. Deputy Barry Heneghan asked the Minister for Children, Disability and Equality the steps her Department is taking to address the ongoing lack of affordable early learning and childcare places, particularly for working families; whether she has assessed the impact of rising childcare costs on parents’ ability to remain in employment, including in areas such as Dublin Bay North; and if she will make a statement on the matter. [73237/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_59",
          "debateSectionId": "dbsect_59",
          "showAs": "Early Childhood Care and Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_59.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_11",
        "questionNumber": 11
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 49. Deputy Barry Heneghan asked the Minister for Children, Disability and Equality the current average waiting times for assessment of need determinations under the Disability Act 2005, broken down by CHO area, in tabular form; the steps her Department is taking to reduce delays and ensure timely access to statutory assessments for children, including those in Dublin Bay North; and if she will make a statement on the matter. [73237/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_91",
          "debateSectionId": "dbsect_91",
          "showAs": "Disabilities Assessments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_91.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_49",
        "questionNumber": 49
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 93. Deputy Barry Heneghan asked the Minister for Children, Disability and Equality the way in which her Department is ensuring that multi-annual capital funding for disability services in Dublin Bay North is aligned with rising local demand, particularly in relation to respite provision, therapy spaces, and residential supports; and if she will make a statement on the matter. [70844/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_137",
          "debateSectionId": "dbsect_137",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_137.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_93",
        "questionNumber": 93
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 94. Deputy Barry Heneghan asked the Minister for Children, Disability and Equality if she will provide an update on the current and future funding allocations for an organisation (details supplied), including any planned increases to support service delivery and disability provision; and if she will make a statement on the matter. [64600/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_138",
          "debateSectionId": "dbsect_138",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_138.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_94",
        "questionNumber": 94
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  Having received Government approval for the Private Wires Policy Statement in July this year, my Department has initiated the process of drafting the subsequent necessary Private Wires legislation.  Officials have begun engagement on the drafting of this legislation with the Commission for Regulation of Utilities, system operators and other relevant Government Departments.  The Heads of Bills were approved by Government this week. Following on from this approval, the Heads of Bill along with the Regulatory Impact Assessment will be published on the Department’s website imminently. Formal drafting of the Bill will begin as soon as possible.  Departmental Officials will work closely with the Commission for Regulations of Utilities and system operators EirGrid and ESB Networks to ensure private wires are regulated to the same safety and technical standards and do not interfere with the efficient development or financing of the National Electricity Grid. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 116. Deputy Barry Heneghan asked the Minister for Climate, Energy and the Environment the current status of the proposed private wires legislative framework; the timeline for bringing forward primary legislation to allow direct electricity supply arrangements between renewable generators and consumers; how his Department is engaging with EirGrid, the CRU and ESB Networks on implementation; and if he will make a statement on the matter. [73230/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_148",
          "debateSectionId": "dbsect_148",
          "showAs": "Legislative Process",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_148.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_116",
        "questionNumber": 116
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  Government is committed to having 5 gigawatts of offshore wind capacity in development by 2030, with a longer-range target of 20 gigawatts by 2040.  Five offshore wind projects off our East coast, with planned capacity of 3.8 gigawatts, are presently in development, with planning determinations anticipated by the end of 2026. I anticipate these projects being in construction by 2030 and operational by 2031/32.  Earlier this month, I announced that a consortium of ESB and Orsted had won my Department’s second offshore wind auction and will be developing a 900-megawatt project off the coast of Waterford. This project was the first of four to be brought to auction from the South Coast DMAP, designated by the Oireachtas in October 2024 for offshore wind development off the coasts of Cork, Waterford and Wexford.  I am presently developing proposals for an auction of the second site, Lí Ban, with potential capacity of up to 1.5 GW. My Department is working closely with Eirgrid to develop grid connection options and is separately commissioning surveys of the Lí Ban site to inform the auction. The remaining sites will follow soon after.  In September, my Department started the process of developing a National DMAP that will designate sufficient additional sites around our coast to deliver on the 2040 target of 20 GW. This process will complete by the end of 2027.  In relation to port capacity, new dedicated offshore wind port infrastructure is already in construction at the Port of Cork and will be ready for use in 2026, well in advance of expected demand. Separately, the Ports of Waterford, Rosslare, Shannon Foynes and Cork (Phase 2) all have further plans for new port facilities in the consenting system.  In relation to planning, my Department is working closely with the Department of Housing, Local Government and Heritage to transpose the Renewable Energy Directive III and to accelerate the delivery of offshore wind by further streamlining the maritime development consent system. This includes the introduction of mandatory timelines for decisions by An Coimisúin Pleanála and other consenting bodies. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 149. Deputy Barry Heneghan asked the Minister for Climate, Energy and the Environment the steps his Department is taking to accelerate the delivery of offshore wind energy projects, including grid connection, planning timelines and port infrastructure readiness; the key barriers currently delaying deployment; and if he will make a statement on the matter. [73231/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_178",
          "debateSectionId": "dbsect_178",
          "showAs": "Offshore Renewable Energy Development Plan",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_178.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_149",
        "questionNumber": 149
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Significant progress has been achieved through the 2020 Action Plan for Insurance Reform, including the introduction of the Personal Injuries Guidelines, legal reforms to rebalance the duty of care, and the establishment of the Office to Promote Competition in the Insurance Market (OPCIM).  A key focus of the reform agenda was addressing personal injury costs, which historically accounted for around 70% of overall motor insurance claims costs. Thanks to the introduction of the Personal Injuries Guidelines and related reforms, that figure has now moved to 46%. However, the last few years has seen the emergence of inflationary pressures. This rise is driven by a combination of external factors, including increased vehicle technology, supply chain disruptions, and a tightening labour market; all of which have raised the cost of repairs.  The Government is firmly committed to delivering further action to drive down insurance costs impacting consumers, with the publication of a new Action Plan for Insurance Reform on 24th July. It sets out a comprehensive set of targeted measures to further improve affordability, availability, and transparency across the insurance sector. As part of the Action Plan, a transparency code for the insurance industry is under development. The Code will require insurers to provide simple, understandable explanations of how premiums are formed and what broader factors influence pricing.  Similarly, the work of the Office to Promote Competition in the Insurance Market has been instrumental in restoring insurance availability in sectors that previously struggled, such as equestrian activities, inflatable hire, adventure tourism, childcare, and high-footfall SMEs like pubs and hospitality. In addition, feedback from insurance stakeholders has indicated that more capacity is entering the market and certain insurance rates are reducing. This is an indication that the Government’s reform agenda is having an impact.  Fostering a more open and competitive insurance market, and ensuring that all consumers benefit from increased capacity, better pricing, and greater choice across all types of insurance, remains a key priority for this Government. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 212. Deputy Barry Heneghan asked the Tánaiste and Minister for Finance his views on the continuing rise in insurance costs for households small businesses and community groups including the reasons for recent premium increases; the extent to which further reductions in claims costs have been passed on to consumers; the actions his Department will take to improve affordability competition and transparency in the insurance market; and if he will make a statement on the matter. [69891/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_226",
          "debateSectionId": "dbsect_226",
          "showAs": "Insurance Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_226.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_212",
        "questionNumber": 212
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  My Department is developing Ireland’s National Building Renovation Plan which will outline our approach to ensuring the renovation of the national stock of residential and non-residential buildings, both public and private, into a highly energy-efficient and decarbonised building stock by 2050, with the objective of transforming existing buildings into zero-emission buildings.  As part of the development of the National Building Renovation Plan, a public consultation on the draft plan must take place ahead of its submission to the European Commission for review.  Work is still ongoing between my Department and multiple Government Departments and State Agencies on certain elements of the Energy Performance of Buildings Directive, to ensure that the National Building Renovation Plan will be able to provide clarity or sufficient detail for stakeholders to engage with and make substantive submissions for consideration.  My officials are engaging with the European Commission with regard to this process and are continuing to work cross-Departmentally to progress these matters and to provide the public with a draft National Building Renovation Plan for public consultation ahead of the submission of the final plan, which is to take place by the 31 December 2026. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 293. Deputy Barry Heneghan asked the Minister for Climate, Energy and the Environment when the public consultation on Ireland’s National Building Renovation Plan will be launched, having regard to the requirement under Article 3 of the Energy Performance of Buildings Directive for the plan to be finalised by 26 December 2025; and if he will make a statement on the matter. [73741/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_297",
          "debateSectionId": "dbsect_297",
          "showAs": "Building Energy Rating",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_297.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_293",
        "questionNumber": 293
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  My Department will be introducing retrofitting assistance facilities for the energy performance of buildings, in line with Article 18 of the recast Energy Performance of Buildings Directive, to assist all building owners and actors involved in energy renovations who wish to retrofit or renovate their building to achieve better energy performance with a focus on vulnerable households, people affected by energy poverty and low-income households. These facilities will align with our existing structures in providing independent advice and deliver streamlined information in person on technical and financial measures to support improved energy performance to building owners, as well as dedicated services to vulnerable households and individuals. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 294. Deputy Barry Heneghan asked the Minister for Climate, Energy and the Environment how the one-stop shops for the energy performance of buildings, required under Article 18 of the Energy Performance of Buildings Directive 2024 and due to be launched by the end of May 2026, will be implemented in Ireland; whether these one-stop shops will provide supports beyond energy renovation, including guidance on adaptive reuse of existing buildings and wider building related challenges faced by citizens; and if he will make a statement on the matter. [73742/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_298",
          "debateSectionId": "dbsect_298",
          "showAs": "Building Energy Rating",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_298.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_294",
        "questionNumber": 294
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  The matter outlined in the Question falls under the remit of my colleague the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation. Having consulted officials in that Department, I am advised that under the Infrastructure Guidelines economic appraisal is required for all public capital projects with an estimated cost greater than €20m.  Economic appraisals under the Infrastructure Guidelines are required to estimate the greenhouse gas (GHG) emissions a project or proposal may give rise to or reduce. These GHG emissions should then be monetised using the Shadow Price of Carbon set out in the Infrastructure Guidelines. As such, should any of the actions in the Delivering Homes, Building Communities Action Plan be subject to the economic appraisal requirements under the Infrastructure Guidelines, the value of the estimated GHG emissions or GHG emissions reductions associated with the project should be included as part of the economic appraisal.  While the shadow price of carbon relates to the emissions of the constructed asset (post completion) this does not account for decarbonisation during design and construction. I am further advised that the Department of Enterprise, Tourism and Employment have issued some interim guidance in this regard ahead of the 1 January, 2027 introduction of the Energy Performance of Buildings Directive (recast) 2024 (EPBD). Housing projects will be included later in the phased introduction of the EPBD. “ Procurement guidance for public bodies: Reducing embodied carbon in construction ” published on the DETE website here: enterprise.gov.ie/en/publications/guidance-public-bodies-reducing-embodied-carbon-in-construction.html  From 1 September 2025, public bodies that are commencing design for new buildings for projects in receipt of Exchequer funding in excess of €10 million in the case of non-residential buildings, or in excess of €60 million in the case of residential buildings, should produce or procure a Whole Life-Cycle Greenhouse Gas Emissions assessment in accordance technical guidance to be provided by SEAI in 2025, consistent with the Energy Performance of Buildings Directive.  Subject to a review of the first step, from 1 June 2026, projects in receipt of Exchequer funding in excess of €5 million in the case of non-residential buildings, or in excess of €30 million in the case of residential buildings, should produce such an assessment. Projects below this scale should also consider implementing this assessment.  There are no current mandatory reporting requirements because of the statement above. Currently each Department is responsible for acting on this requirement when procuring projects. The transposition and implementation of the EPBD are the responsibility of the Department of Housing. The EPBD will introduce the mandatory reporting of Global Warming Potential (GWP) in buildings which aligns with EU Level(s) Framework for Sustainable Buildings. (green-forum.ec.europa.eu/green-business/levels_en). ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 295. Deputy Barry Heneghan asked the Minister for Climate, Energy and the Environment whether a full analysis of the carbon impact of all actions contained in the policy framework Delivering Homes Building Communities will be carried out and published; and if he will make a statement on the matter. [73743/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_299",
          "debateSectionId": "dbsect_299",
          "showAs": "Greenhouse Gas Emissions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_299.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_295",
        "questionNumber": 295
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 496 to 498, inclusive, together.  The Renewable Energy Directive III (RED III) permitting provisions have been transposed into the Irish planning code primarily through the European Union (Planning and Development) (Renewable Energy) Regulations 2025 (S.I. No. 274 of 2025), supported by Departmental guidance issued to planning authorities and An Coimisiún Pleanála (the Commission).  The existing statutory framework, under the Planning and Development Act 2000, as amended, continues to determine whether a renewable energy proposal is made to the relevant planning authority or to An Coimisiún Pleanála, having regard to the nature, scale and legislative provisions applicable to the particular development type (including, where relevant, the Strategic Infrastructure Development arrangements). The RED III transposition measures are focused on process and consent timelines and do not, of themselves, alter the general allocation of functions between planning authorities and the Commission.  One statutory requirement that RED III did introduce is that where an application for relevant categories of renewable energy development is made to a planning authority, the authority must within 45 days either:  • acknowledge completeness (where satisfied the application includes the information required to process it), or  • request that the applicant submit a complete application without undue delay.  My Department has issued circulars and supporting material to assist consistent implementation (including CEPP 1/2025 and CEPP 2/2025, and subsequent circulars reflecting any amendments).  My Department recognises the importance of robust pre-application engagement and front-loading of information (including environmental assessment material) to support timely assessment and decisions on high-quality applications within RED III permit-granting timelines.  In this regard, I have been advised by An Coimisiún Pleanála that it will advise applicants during pre-application consultations on the information required to facilitate the completeness check, including issuing a schedule or checklist to inform that process. The Commission has also published RED III information guides (including guidance for prospective applicants and for planning authorities), which explain the Commission’s approach to the completeness check and the information it expects to be addressed through pre-application consultation.  In addition, my Department has published a RED III “Further Information” / FAQ document on gov.ie, to address practical or operational queries received from the local government sector.  The FAQ document is being treated as a live document that may be updated as required.  RED III also provides for a Single Point of Contact to be designated in each Member State.  In Ireland the Sustainable Energy Authority of Ireland (SEAI) has been appointed to this role, with planning authorities and the Commission required to notify SEAI of relevant RED III application milestones for permit-granting timeline purposes.  In relation to the National Parks and Wildlife Service (NPWS), National Monuments Service and other prescribed bodies, my Department continues to engage with key stakeholders as implementation of the RED III measures beds in. The resourcing of the National Parks and Wildlife Service falls within the broader remit of my Department as part of the annual budgetary process. In that broader context, Budget 2026 included an increase in funding for nature and heritage, including an increase for the NPWS.  My Department will continue to engage with planning authorities, the Commission and relevant prescribed bodies on implementation issues as the RED III measures bed in, including in relation to guidance, pre-application engagement, and the practical operation of the new completeness check arrangements. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 496. Deputy Barry Heneghan asked the Minister for Housing, Local Government and Heritage the plans in place to improve the pre-application engagement process for renewable energy projects under the implementation of the RED III directive; if he intends to increase resources or staffing within the National Parks and Wildlife Service, National Monuments Service or other relevant bodies to enable developers to submit more robust applications; and if he will make a statement on the matter. [73519/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_469",
          "debateSectionId": "dbsect_469",
          "showAs": "Planning Issues",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_469.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_496",
        "questionNumber": 496
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 496 to 498, inclusive, together.  The Renewable Energy Directive III (RED III) permitting provisions have been transposed into the Irish planning code primarily through the European Union (Planning and Development) (Renewable Energy) Regulations 2025 (S.I. No. 274 of 2025), supported by Departmental guidance issued to planning authorities and An Coimisiún Pleanála (the Commission).  The existing statutory framework, under the Planning and Development Act 2000, as amended, continues to determine whether a renewable energy proposal is made to the relevant planning authority or to An Coimisiún Pleanála, having regard to the nature, scale and legislative provisions applicable to the particular development type (including, where relevant, the Strategic Infrastructure Development arrangements). The RED III transposition measures are focused on process and consent timelines and do not, of themselves, alter the general allocation of functions between planning authorities and the Commission.  One statutory requirement that RED III did introduce is that where an application for relevant categories of renewable energy development is made to a planning authority, the authority must within 45 days either:  • acknowledge completeness (where satisfied the application includes the information required to process it), or  • request that the applicant submit a complete application without undue delay.  My Department has issued circulars and supporting material to assist consistent implementation (including CEPP 1/2025 and CEPP 2/2025, and subsequent circulars reflecting any amendments).  My Department recognises the importance of robust pre-application engagement and front-loading of information (including environmental assessment material) to support timely assessment and decisions on high-quality applications within RED III permit-granting timelines.  In this regard, I have been advised by An Coimisiún Pleanála that it will advise applicants during pre-application consultations on the information required to facilitate the completeness check, including issuing a schedule or checklist to inform that process. The Commission has also published RED III information guides (including guidance for prospective applicants and for planning authorities), which explain the Commission’s approach to the completeness check and the information it expects to be addressed through pre-application consultation.  In addition, my Department has published a RED III “Further Information” / FAQ document on gov.ie, to address practical or operational queries received from the local government sector.  The FAQ document is being treated as a live document that may be updated as required.  RED III also provides for a Single Point of Contact to be designated in each Member State.  In Ireland the Sustainable Energy Authority of Ireland (SEAI) has been appointed to this role, with planning authorities and the Commission required to notify SEAI of relevant RED III application milestones for permit-granting timeline purposes.  In relation to the National Parks and Wildlife Service (NPWS), National Monuments Service and other prescribed bodies, my Department continues to engage with key stakeholders as implementation of the RED III measures beds in. The resourcing of the National Parks and Wildlife Service falls within the broader remit of my Department as part of the annual budgetary process. In that broader context, Budget 2026 included an increase in funding for nature and heritage, including an increase for the NPWS.  My Department will continue to engage with planning authorities, the Commission and relevant prescribed bodies on implementation issues as the RED III measures bed in, including in relation to guidance, pre-application engagement, and the practical operation of the new completeness check arrangements. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 497. Deputy Barry Heneghan asked the Minister for Housing, Local Government and Heritage if he intends to introduce measures to ensure greater consistency across local authorities in their approach to assessing and issuing certificates of completeness for renewable energy planning applications; and if he will make a statement on the matter. [73520/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_469",
          "debateSectionId": "dbsect_469",
          "showAs": "Planning Issues",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_469.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_497",
        "questionNumber": 497
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 496 to 498, inclusive, together.  The Renewable Energy Directive III (RED III) permitting provisions have been transposed into the Irish planning code primarily through the European Union (Planning and Development) (Renewable Energy) Regulations 2025 (S.I. No. 274 of 2025), supported by Departmental guidance issued to planning authorities and An Coimisiún Pleanála (the Commission).  The existing statutory framework, under the Planning and Development Act 2000, as amended, continues to determine whether a renewable energy proposal is made to the relevant planning authority or to An Coimisiún Pleanála, having regard to the nature, scale and legislative provisions applicable to the particular development type (including, where relevant, the Strategic Infrastructure Development arrangements). The RED III transposition measures are focused on process and consent timelines and do not, of themselves, alter the general allocation of functions between planning authorities and the Commission.  One statutory requirement that RED III did introduce is that where an application for relevant categories of renewable energy development is made to a planning authority, the authority must within 45 days either:  • acknowledge completeness (where satisfied the application includes the information required to process it), or  • request that the applicant submit a complete application without undue delay.  My Department has issued circulars and supporting material to assist consistent implementation (including CEPP 1/2025 and CEPP 2/2025, and subsequent circulars reflecting any amendments).  My Department recognises the importance of robust pre-application engagement and front-loading of information (including environmental assessment material) to support timely assessment and decisions on high-quality applications within RED III permit-granting timelines.  In this regard, I have been advised by An Coimisiún Pleanála that it will advise applicants during pre-application consultations on the information required to facilitate the completeness check, including issuing a schedule or checklist to inform that process. The Commission has also published RED III information guides (including guidance for prospective applicants and for planning authorities), which explain the Commission’s approach to the completeness check and the information it expects to be addressed through pre-application consultation.  In addition, my Department has published a RED III “Further Information” / FAQ document on gov.ie, to address practical or operational queries received from the local government sector.  The FAQ document is being treated as a live document that may be updated as required.  RED III also provides for a Single Point of Contact to be designated in each Member State.  In Ireland the Sustainable Energy Authority of Ireland (SEAI) has been appointed to this role, with planning authorities and the Commission required to notify SEAI of relevant RED III application milestones for permit-granting timeline purposes.  In relation to the National Parks and Wildlife Service (NPWS), National Monuments Service and other prescribed bodies, my Department continues to engage with key stakeholders as implementation of the RED III measures beds in. The resourcing of the National Parks and Wildlife Service falls within the broader remit of my Department as part of the annual budgetary process. In that broader context, Budget 2026 included an increase in funding for nature and heritage, including an increase for the NPWS.  My Department will continue to engage with planning authorities, the Commission and relevant prescribed bodies on implementation issues as the RED III measures bed in, including in relation to guidance, pre-application engagement, and the practical operation of the new completeness check arrangements. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 498. Deputy Barry Heneghan asked the Minister for Housing, Local Government and Heritage if consideration is being given to maintaining the current system whereby renewable energy developers may choose to submit their planning applications either to local authorities or to An Coimisiún Pleanála; the rationale for any proposed changes; and if he will make a statement on the matter. [73521/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_469",
          "debateSectionId": "dbsect_469",
          "showAs": "Planning Issues",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_469.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_498",
        "questionNumber": 498
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 687 and 688 together.  The Model of Care for Fertility was developed by the Department of Health in conjunction with the HSE’s National Women & Infants Health Programme to ensure that fertility-related issues are addressed through the public health system at the lowest level of clinical intervention necessary.  Referrals for publicly-funded, privately-provided assisted human reproduction (AHR) treatment commenced in September 2023, subject to patients meeting the criteria agreed by the Department and the HSE. The access criteria were developed by a multi-disciplinary group, with reproductive medicine expertise and followed consultation with experts in the field along with a review of the international evidence. These criteria are in keeping with those applied in other jurisdictions.  Up to December 5th 2025, over 3,500 couples have been referred by a Reproductive Specialist Consultant for AHR treatment, following extensive investigations and/or secondary level treatment within the Regional Fertility Hubs. Furthermore, the Hubs have successfully and directly managed thousands more patients presenting with fertility-related issues who have been referred by their GP. Not all couples experiencing fertility challenges actually require such advanced and invasive interventions as IVF.  Earlier this year, an important criterion for accessing state-funded AHR treatment was broadened. Couples with one existing child in their relationship, and who meet all the other current access criteria, can now access publicly-funded AHR treatment, including one full cycle of IVF or ICSI, if they are referred for same by a Reproductive Specialist Consultant within one of the Regional Fertility Hubs. Previously, couples with one child in their current relationship were not eligible to access publicly-funded AHR treatment.  There are complex regulatory and clinical issues to be considered in respect of certain categories of AHR treatment. In the case of treatment involving the use of donated gametes – whether by opposite-sex or same-sex couples - there is regulation at European level concerning the quality and safety of procedures involving donated gametes. Furthermore, the Children and Family Relationships Act 2015 deals with matters relating to parentage and the right to identity of donor-conceived children arising from such procedures, there are a number of further clinical and regulatory requirements regarding the donation and use of donated gametes which are being considered.  The access criteria and the terms of the AHR treatment initiative are being kept under ongoing review. Further potential changes to the access criteria or expansion of the initiative requires continued extensive consultation between Department officials, colleagues in the HSE, and also with relevant specialists in the field of reproductive medicine. This will include consideration of additional funding requirements which may ensue from any proposed expansion of the initiative.  There are no plans to introduce public funding of AHR treatment undertaken in pursuance of a surrogacy arrangement.  It should be noted that supports previously available to patients who access IVF, or other AHR treatment, privately, whereby tax relief on the costs involved can be claimed under the tax relief for medical expenses scheme, continues to be provided.  In addition, a defined list of fertility medicines needed for fertility treatment is covered under the High Tech Arrangements administered by the HSE. Medicines covered by the High Tech Arrangements must be prescribed by a consultant/specialist and authorised for supply to the client’s nominated community pharmacy by the High Tech Hub managed by the Primary Care Reimbursement Service. The cost of the medicines is then covered, as appropriate, under the client’s eligibility, i.e., Medical Card or Drugs Payment Scheme. The annual cost to the State of the financial support for these medicines is far from insignificant.  Regarding the very separate particular query regarding same-sex couples undergoing fertility treatment abroad and the recognition of parentage, the Deputy would be aware that the Health (Assisted Human Reproduction) Act 2024 was signed into law in July 2024. While the legislation was progressing through the Houses of Oireachtas, issues were identified which required further consideration and consultation with the Office of the Attorney General.  These included issues of parentage and citizenship arising from Irish residents undertaking donor-assisted human reproduction (DAHR) procedures abroad or from Irish citizens domiciled abroad undertaking DAHR procedures or surrogacy arrangements.  The Government has approved the drafting of a Bill, the Health (Assisted Human Reproduction) (Amendment) Bill, to legislate for provisions in respect of these issues, as well as making other necessary changes to the AHR Act 2024.  Formal drafting of this supplementary Bill is at an advanced stage, led by the Office of Parliamentary Counsel, in conjunction with officials from my Department, the Department of Justice, Home Affairs and Migration, and the Department of Children, Disability and Equality.  My officials and I have met with relevant stakeholder groups in relation to the AHR legislation.  I want to reassure you that my Department and the Government are focused, through the full implementation of the Model of Care for Fertility, on ensuring that patients receive care at the appropriate level of clinical intervention and then those requiring, and eligible for, advanced AHR treatment such as IVF will be able to access same through the most effective deployment of finite public resources. Similarly, I can absolutely assure the Deputy that publishing and progressing the AHR Amendment Bill is a priority for Government and for me personally, and we will continue to work to achieve this as soon as practicable.  Finally, it is important to note that all provisions in the Children and Family Relationships Act 2015, the AHR Act 2024, and the forthcoming AHR Amendment Bill in respect of donor-assisted human reproduction and surrogacy apply equally, irrespective of whether the intending parents are a same-sex couple or an opposite-sex couple, or if there is a single intending parent. A similar principle of equal access also underpins the terms of the publicly-funded AHR treatment initiative. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 687. Deputy Barry Heneghan asked the Minister for Health the expected timeline for the inclusion of donor assisted fertility treatments within the publicly funded assisted human reproduction scheme; the measures being taken to ensure that same sex couples who undergo fertility treatment abroad are afforded the same legal recognition and parentage as heterosexual couples under Irish law (details supplied); and if she will make a statement on the matter. [73522/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_658",
          "debateSectionId": "dbsect_658",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_658.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_687",
        "questionNumber": 687
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  I propose to take Questions Nos. 687 and 688 together.  The Model of Care for Fertility was developed by the Department of Health in conjunction with the HSE’s National Women & Infants Health Programme to ensure that fertility-related issues are addressed through the public health system at the lowest level of clinical intervention necessary.  Referrals for publicly-funded, privately-provided assisted human reproduction (AHR) treatment commenced in September 2023, subject to patients meeting the criteria agreed by the Department and the HSE. The access criteria were developed by a multi-disciplinary group, with reproductive medicine expertise and followed consultation with experts in the field along with a review of the international evidence. These criteria are in keeping with those applied in other jurisdictions.  Up to December 5th 2025, over 3,500 couples have been referred by a Reproductive Specialist Consultant for AHR treatment, following extensive investigations and/or secondary level treatment within the Regional Fertility Hubs. Furthermore, the Hubs have successfully and directly managed thousands more patients presenting with fertility-related issues who have been referred by their GP. Not all couples experiencing fertility challenges actually require such advanced and invasive interventions as IVF.  Earlier this year, an important criterion for accessing state-funded AHR treatment was broadened. Couples with one existing child in their relationship, and who meet all the other current access criteria, can now access publicly-funded AHR treatment, including one full cycle of IVF or ICSI, if they are referred for same by a Reproductive Specialist Consultant within one of the Regional Fertility Hubs. Previously, couples with one child in their current relationship were not eligible to access publicly-funded AHR treatment.  There are complex regulatory and clinical issues to be considered in respect of certain categories of AHR treatment. In the case of treatment involving the use of donated gametes – whether by opposite-sex or same-sex couples - there is regulation at European level concerning the quality and safety of procedures involving donated gametes. Furthermore, the Children and Family Relationships Act 2015 deals with matters relating to parentage and the right to identity of donor-conceived children arising from such procedures, there are a number of further clinical and regulatory requirements regarding the donation and use of donated gametes which are being considered.  The access criteria and the terms of the AHR treatment initiative are being kept under ongoing review. Further potential changes to the access criteria or expansion of the initiative requires continued extensive consultation between Department officials, colleagues in the HSE, and also with relevant specialists in the field of reproductive medicine. This will include consideration of additional funding requirements which may ensue from any proposed expansion of the initiative.  There are no plans to introduce public funding of AHR treatment undertaken in pursuance of a surrogacy arrangement.  It should be noted that supports previously available to patients who access IVF, or other AHR treatment, privately, whereby tax relief on the costs involved can be claimed under the tax relief for medical expenses scheme, continues to be provided.  In addition, a defined list of fertility medicines needed for fertility treatment is covered under the High Tech Arrangements administered by the HSE. Medicines covered by the High Tech Arrangements must be prescribed by a consultant/specialist and authorised for supply to the client’s nominated community pharmacy by the High Tech Hub managed by the Primary Care Reimbursement Service. The cost of the medicines is then covered, as appropriate, under the client’s eligibility, i.e., Medical Card or Drugs Payment Scheme. The annual cost to the State of the financial support for these medicines is far from insignificant.  Regarding the very separate particular query regarding same-sex couples undergoing fertility treatment abroad and the recognition of parentage, the Deputy would be aware that the Health (Assisted Human Reproduction) Act 2024 was signed into law in July 2024. While the legislation was progressing through the Houses of Oireachtas, issues were identified which required further consideration and consultation with the Office of the Attorney General.  These included issues of parentage and citizenship arising from Irish residents undertaking donor-assisted human reproduction (DAHR) procedures abroad or from Irish citizens domiciled abroad undertaking DAHR procedures or surrogacy arrangements.  The Government has approved the drafting of a Bill, the Health (Assisted Human Reproduction) (Amendment) Bill, to legislate for provisions in respect of these issues, as well as making other necessary changes to the AHR Act 2024.  Formal drafting of this supplementary Bill is at an advanced stage, led by the Office of Parliamentary Counsel, in conjunction with officials from my Department, the Department of Justice, Home Affairs and Migration, and the Department of Children, Disability and Equality.  My officials and I have met with relevant stakeholder groups in relation to the AHR legislation.  I want to reassure you that my Department and the Government are focused, through the full implementation of the Model of Care for Fertility, on ensuring that patients receive care at the appropriate level of clinical intervention and then those requiring, and eligible for, advanced AHR treatment such as IVF will be able to access same through the most effective deployment of finite public resources. Similarly, I can absolutely assure the Deputy that publishing and progressing the AHR Amendment Bill is a priority for Government and for me personally, and we will continue to work to achieve this as soon as practicable.  Finally, it is important to note that all provisions in the Children and Family Relationships Act 2015, the AHR Act 2024, and the forthcoming AHR Amendment Bill in respect of donor-assisted human reproduction and surrogacy apply equally, irrespective of whether the intending parents are a same-sex couple or an opposite-sex couple, or if there is a single intending parent. A similar principle of equal access also underpins the terms of the publicly-funded AHR treatment initiative. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 688. Deputy Barry Heneghan asked the Minister for Health whether she plans to engage with LGBTQ advocacy organisations in the development and implementation of the expanded assisted human reproduction scheme and associated legislation in order to ensure that their specific needs are adequately addressed (details supplied); and if she will make a statement on the matter. [73523/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_658",
          "debateSectionId": "dbsect_658",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_658.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_688",
        "questionNumber": 688
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Culture, Communications and Sport  The Complex is a multidisciplinary arts and creative venue in Dublin’s North Inner City, governed by a not-for-profit company limited by guarantee. The Complex has been leasing its building from a private landlord on a site ringfenced for redevelopment.  Proposals for the development of local arts centres are a matter in the first instance for the relevant local authority. County and city development plans are drawn up by local authorities in accordance with their functions under the Planning and Development Acts. This would include policy objectives for development in that county, including the arts.  Annual support, including programming and revenue supports, is provided to arts and culture centres by local authorities and the Arts Council. The Department of Culture, Communications and Sport provides grants as a contribution towards maintaining and enhancing existing arts and culture facilities but does not provide funding for the purchase of buildings.  Officials from my Department met with the Chair of The Complex and other members of the team in December 2024 and advised them of this position. Further communication in June 2025 reiterated that position. No funding was sought from this Department for the purchase of the building by the Complex and any refurbishment support would require chargeable title to be in place. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 252. Deputy Barry Heneghan asked the Minister for Culture, Communications and Sport for an update on the notice of closure issued to an organisation (details supplied); the engagement his Department has had, or plans to have, with the organisation; the supports available to protect vital cultural infrastructure of this kind; and if he will make a statement on the matter. [73082/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_231",
          "debateSectionId": "dbsect_231",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_231.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_252",
        "questionNumber": 252
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Health  Healthcare regulators in Ireland are independent statutory organisations who work to protect the public through the promotion of high standards of education, training, and professional conduct and ensuring the safety and quality of health products. Certain areas of healthcare are multi professional and multi sectoral, requiring all regulators to work together to meet these aims.  I understand that the relevant regulators, i.e. the Medical Council (MC), the Nursing and Midwifery Board of Ireland (NMBI), the Dental Council, and the Health Products Regulatory Authority, have collaborated closely in the development of guidelines for regulated professionals in relation to the prescribing and administration of Botulinum Toxin products. I am reassured that these statements accurately set out the current position and are mutually aligned. [ NMBI ] guidance and the [ MC ] statement can be accessed on their websites. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 417. Deputy Barry Heneghan asked the Minister for Health if she is aware of the concerns raised by an association (details supplied) regarding the recent statement of the Irish Medical Council on the prescribing and administration of Botulinum Toxin which asserts that this medicine may only be prescribed by a registered medical practitioner or dentist; and if she will make a statement on the matter. [73078/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_368",
          "debateSectionId": "dbsect_368",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_368.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_417",
        "questionNumber": 417
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Health  Healthcare regulators in Ireland are independent statutory organisations who work to protect the public through the promotion of high standards of education, training, and professional conduct and ensuring the safety and quality of health products. Certain areas of healthcare are multi professional and multi sectoral, requiring all regulators to work together to meet these aims.  The Minister understands that the relevant regulators, i.e. the Medical Council, the Nursing and Midwifery Board of Ireland, the Dental Council, and the Health Products Regulatory Authority, have collaborated closely in the development of guidelines for regulated professionals in relation to the prescribing and administration of Botulinum Toxin products. She has been reassured that these statements accurately set out the current position and are mutually aligned. [ NMBI ] guidance and the [ MC ] statement can be accessed on their websites. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 418. Deputy Barry Heneghan asked the Minister for Health the legal basis, if any, for the Irish Medical Council to issue guidance that appears to restrict or contradict the prescriptive authority of Registered Nurse Prescribers as provided for under Regulation 5A of the Medicinal Products Prescription and Control of Supply Regulations 2003 to 2020 and related amendments (details supplied); and if she will make a statement on the matter. [73079/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_369",
          "debateSectionId": "dbsect_369",
          "showAs": "Registration of Nurses",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_369.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_418",
        "questionNumber": 418
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Health  Healthcare regulators in Ireland are independent statutory organisations who work to protect the public through the promotion of high standards of education, training, and professional conduct and ensuring the safety and quality of health products. Certain areas of healthcare are multi professional and multi sectoral, requiring all regulators to work together to meet these aims.  The Minister understands that the relevant regulators, i.e. the Medical Council, the Nursing and Midwifery Board of Ireland, the Dental Council, and the Health Products Regulatory Authority, have collaborated closely in the development of guidelines for regulated professionals in relation to the prescribing and administration of Botulinum Toxin products. She has been reassured that these statements accurately set out the current position and are mutually aligned. NMBI guidance - see www.nmbi.ie/Standards-Guidance/More-Standards-Guidance/Guidance-for-Registered-General-Nurses-Who-Perform- and the MC statement - see www.medicalcouncil.ie/news-and-publications/position-statements/statement-from-the-medical-council-on-the-prescribing-and-administration-of-botox.html - can be accessed on their websites. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 419. Deputy Barry Heneghan asked the Minister for Health if she will confirm that the regulation of nursing practice including nurse prescribing and the scope of practice for nurses administering prescription only medicines such as Botulinum Toxin is a matter for the Nursing and Midwifery Board of Ireland as the statutory regulator (details supplied); and if she will make a statement on the matter. [73080/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_370",
          "debateSectionId": "dbsect_370",
          "showAs": "Departmental Regulations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_370.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_419",
        "questionNumber": 419
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Health  The immunisation programme in Ireland is based on the advice of the National Immunisation Advisory Committee (NIAC). The committee's recommendations are based on the prevalence of the relevant disease in Ireland and international best practice in relation to immunisation. Following on from the successful Respiratory Syncytial Virus (RSV) Immunisation pathfinder programme in 2024/2025, an expanded RSV Immunisation programme is in place throughout Winter 2025/2026. This immunisation offers protection ahead of the seasonal upsurge in infection with RSV.The risk of severe RSV infection is highest in the youngest infants, especially those born during the RSV season.The RSV Immunisation programme will offer immunisation to:  • babies born between 1 September 2025 and 28 February 2026;  • babies who are six months old or younger on 1 September;  • premature babies (born before 30 weeks gestation or less than 1.25kg at birth) and other higher risk infants (due to underlying medical conditions) born during RSV season.  The RSV Immunisation Programme is operated by the HSE, with immunisations being administered from 1 September 2025 in maternity hospitals to newborn babies. The catch-up aspect of the RSV infant immunisation programme has now ended.  A Health Technology Assessment (HTA) on RSV immunisation for infants and adults is currently being undertaken by the Health Information and Quality Authority (HIQA).  The primary objective of this HTA is to provide advice to my Department to inform a policy decision on the most appropriate RSV immunisation strategy for infants and adults aged 65 and older. HIQA’s assessment will assess the clinical effectiveness, cost effectiveness and budget impact of alternative strategies for the immunisation of infants and adults aged 65 years and older against RSV. This HTA will also consider the organisational, resource, ethical, patient and social implications associated with these alternative strategies.  A draft report is currently available for public consultation and it is open for review and comment by the public until 20 January 2026.The outcome of the HTA will inform the development of any longer-term programme and future decision making on the matter of RSV immunisation in Ireland.  It is open to individuals with any queries to discuss their immunisation needs with their GP. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 434. Deputy Barry Heneghan asked the Minister for Health the reason the RSV vaccination for children cannot be purchased privately by parents for children who are outside the age bracket for immunisation but who have underlying health conditions which has already resulted in hospitalisation when the child contracts RSV; if she will make the vaccine available to people who wish to purchase it; and if she will make a statement on the matter. [73153/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_385",
          "debateSectionId": "dbsect_385",
          "showAs": "Vaccination Programme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_385.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_434",
        "questionNumber": 434
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the HSE to respond to the deputy directly. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 435. Deputy Barry Heneghan asked the Minister for Health the current status of a minor injuries unit for Merlin Park, Galway; and if she will make a statement on the matter. [73155/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_386",
          "debateSectionId": "dbsect_386",
          "showAs": "Hospital Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_386.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_435",
        "questionNumber": 435
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 1 to 15, inclusive, together.  The Cabinet committee on housing last met yesterday, Monday, 15 December. The committee works to ensure a cross-Government approach to the implementation of our commitments regarding housing policy. This week’s meeting was specifically focused on our homelessness challenge, in particular the national housing plan commitments in this regard, including the development of a homeless prevention framework and a child and family homelessness action plan.  We are making good progress on the delivery of homes to those most in need across the country, with the new housing plan committed to delivering 72,000 social homes over its lifetime. However, as we increase supply, we also recognise that those experiencing, or at risk of, homelessness have a wide and complex variety of needs. We need to ensure that the appropriate services and policies are in place to support them. Housing is our single biggest issue as a country, with profound social and economic consequences. That is why it is at the centre of the Government’s focus.  Along with the largest ever commitment on social housing, the new national housing plan commits to delivering 300,000 new homes, including 90,000 affordable supports to help people who are struggling to have a home of their own. The plan sets out the highest ever commitment of State funding for housing, with €28 billion over the next five years, coupled with additional funding through State vehicles, including the Land Development Agency, the Housing Finance Agency, Home Building Finance Ireland, the First Home Scheme and the Irish Strategic Investment Fund. Housing delivery, along with infrastructure and utility investment to enable delivery at scale, is at the core of the agreed national development plan published in July, and, at €275 billion, the largest ever capital injection in the history of the State.  To build homes at the scale now required, we need improved and more resilient water, energy and transport services. We will see large-scale investment in all of these areas over the coming years. Last month under price review 6, the investment plan for energy infrastructure was finalised, including funding allocations of up to €18 billion to ESB and EirGrid, leveraged by the Government injection of €3.5 billion in equity to these companies. This will enable thousands more homes to be connected to the grid.  We have also published the investment plan for water, which sets out over €12 billion investment in our water infrastructure, the majority of which will support the delivery of our housing targets. In addition, we are tackling barriers to delivery, through the accelerating infrastructure report and action plan, which includes reforms which will support public and private sector delivery of homes at scale.  Housing is at the centre of the State’s investment and focus for the coming years. However, to meet our targets, we will also need significant delivery from the private sector and we have implemented a number of measures and reforms in support of this. We have focused on making apartment delivery more financially viable, reformed our planning process and created a stable policy environment to enable the private sector to deliver at scale.  We are seeing indications now that our measures are beginning to take effect, evidenced by CSO data showing that we have had an increase of almost 30% in homes approved for planning in quarter 3 of this year, in comparison with the same time period last year, with the number of apartments approved up by over 50%. These are clear indications of confidence. Work is under way to zone a significantly higher quantum of land across the country. Now is the time for ambitious execution, and we have set out a clear framework and roadmap for the coming years to do this. I am confident that we can build on our success to date and bring about a very significant scale-up in our delivery of housing over the lifetime of this Government. \n Deputy Séamus McGrath  I thank the Taoiseach. I welcome today's announcement in relation to the vacant property refurbishment grant and the extension of this grant until 2030. This provides important certainty from a policy point of view in relation to vacant properties. We know they are still a very significant challenge. I also welcome the new initiative in relation to the above the shop grant. Up to €140,000, where multiple properties are involved, is potentially available. That is very significant and the fact that it will be available by quarter 1 of the new year is very important. It is important to look at the local authorities and their resourcing in terms of being able to deal with this grant. I ask the Taoiseach to also look at that. We want these grants to be processed in a timely manner so that we can get on with utilising this currently under-occupied space. The resourcing of local authorities is important and I ask the Taoiseach to look at that. \n Deputy Paul McAuliffe  In my constituency between Shanowen Road and Collins Avenue there are proposals to build new apartment developments. While the additional new housing is incredibly welcome, unfortunately the under-utilised industrial estate there is currently occupied by Santry Boxing Club. Would the Taoiseach agree as well as powering ahead with the provision of new housing, Dublin City Council needs to have a more proactive strategy of making land available to sports clubs so they can avail of programmes like the sports capital grant? Santry Boxing Club is an amazing local facility and will be a great facility for those new homes that will be built. As well as enabling new homes, we need to put in place new facilities, and Dublin City Council needs to be more proactive in making land available to sports clubs. \n Deputy Shane Moynihan  As the Taoiseach said, the delivery of housing is the number one priority for this Government. That is why it is strategically important that all sectors of the Government support that aim, namely through the national development plan's transport sectoral plan, which was published recently. In my constituency, which the Taoiseach visited, we see it as one of the fastest-growing constituencies in the country, with large developments like Adamstown and Clonburris flying ahead. In its county development plans, South Dublin County Council is setting very ambitious targets for zoning. The key to enabling this zoning and to enabling delivery of those homes is the deployment and development of DART+ South West as a transport programme, to intensify the capacity on that line, not only benefitting commuters in Dublin Mid-West but also Kildare North, Dublin South-Central and Dublin-Central.  I am asking the Taoiseach for his support to do all we can to prioritise and bring forward, where possible, the delivery of Dart+ South West as a long overdue infrastructure requirement to not only allow catch-up on public transport in my area but also to plan for the future. \n Deputy John Connolly  One of the actions in the recently published housing plan is that the Department will be publishing quarterly and annual performance tables for new-build output versus targets per local authority, thereby ensuring transparency and accountability.  I understand that will commence next June in relation to social housing. We should also provide similar tables in relation to affordable housing. The local authorities should also be assessed on their output of affordable housing. What actions will the Government take with local authorities that are not meeting their housing targets? \n Deputy Ryan O'Meara  Last February the Government announced its intention to remove the requirement for planning permission for log cabins and modular homes in backyard developments. By the end of the Christmas recess, it will be nearly a year since we heard that announcement. One-off houses in rural Ireland can benefit if we allow log cabins and modular homes to be built not just in backyard developments. They are also one of the few affordable houses out there for young people in rural Ireland whom I speak to. I could give numerous examples of log cabins and modular homes across north Tipperary and north-west Kilkenny that are at threat of enforcement proceedings because they do not have planning permission. Enforcement should not be ongoing until we know what these regulations say. In addition, the development contributions for one-off rural houses should be scrapped again. They are simply a privilege for building on your own land. First, will we see these planning regulations that will exempt log cabins? Second, will this go beyond backyard developments and allow them in rural areas? Third, when will we see the regulations? \n An Ceann Comhairle  I call Deputy Ruth Coppinger. One question. \n Deputy Ruth Coppinger  I also send my solidarity to the Jewish community in Sydney following the appalling attack.  I am sure the Taoiseach agrees with me that cities should be liveable and should have culture as well as venues where people can meet, socialise and enjoy themselves. Will the Cabinet committee on housing and local government discuss the issue of The Complex, a very important cultural space in our capital where artists are currently housed but have been given an eviction notice for the middle of January? A protest on this will come to the Dáil tomorrow. I have attended meetings and other get-togethers in The Complex. In fact, it was the venue for the launch of one of the presidential campaigns. Dublin City Council is open to buying The Complex but only if it can be given 80% to 90% of the funding. We need to intervene to buy this for €10 million. It would be €80 million to buy or to build a similar space. \n Deputy Rose Conway-Walsh  I ask the Taoiseach to consider issuing an upfront fund to local authorities, but to Mayo County Council in particular, in order that they can turn around the vacant properties they have without having to go through the bureaucratic nightmare of applying for funding from central government on a house-by-house, unit-by-unit basis. Can the Taoiseach imagine what it is like to be a homeless person in Mayo watching council houses remain empty month after month while nothing is done? I will give him an example from a young mother in my constituency:  I am homeless, living in a friend's house. I've just had my first baby. She's now a month old. She was born at 36 weeks. I've been in and out of hospital the whole of the pregnancy with stress and anxiety. I developed diabetes also. I was rushed to a Dublin hospital for a week from bleeding and pains. I had a terrible experience. A lot of this stress has been brought on because of my homeless situation.  That is the case for many people. \n Deputy Barry Heneghan  I too join in the condolences on the attack that happened on the Jewish community in Australia.  I also support the plea for funding for The Complex.  Regarding the Cabinet committee on housing, across the country AHBs have signed turnkey deals that then collapse. In Dún Laoghaire-Rathdown, there was a recent scheme that had the contract signed, everything was above board, they were all ready and, at the last minute, when they were looking for funding, the Department denied the funding for 40 turnkey units. If we are to bring medium-sized and small developers into the market, this risk cannot be acceptable. We will not get the funding from the funding schemes, and it is putting all the risk on the developers. The homes are built, the deal collapses and the investor walks away. We want these small-scale developers to meet the housing targets. I have hundreds of people in my constituency looking for affordable housing, and this cannot happen. \n Deputy Darren O'Rourke  I want to raise the issue of child homelessness. In October there were 5,274 children in emergency accommodation. More than 150 of those were in my county, Meath. There is an expectation that at Christmas there will be more than 5,000 and that almost 1,000 of those will be in emergency accommodation for their second or third Christmas. Are there specific measures the Government will take in advance of Christmas, now a handful of days away, to minimise the number of children in homelessness this Christmas? \n Deputy Ruairí Ó Murchú  We all know the issue that exists in relation to housing, whether it is homelessness, the lack of supply, those who cannot get houses, whether from a rental point of view or a purchase point of view, and those languishing on social housing lists. However, we also have to look at the issue of estate management. I do not believe the local authorities, like Louth County Council, have the necessary powers when dealing with chaotic tenants. They may need supports, but even beyond that, we have seen outright criminality and drug-dealing. We know that AHBs have greater levels of power even in relation to the nuclear action of eviction. That should be the last thing that is looked at but, at the end of the day, it is a requirement. I have worked alongside the Louth local authority, the Garda and others in dealing with some situations and we have attempted to move people sideways to deal with the issue. Some very good work has been done, but we do not have the necessary tools, and that is the problem. \n Deputy Liam Quaide  One of the most infuriating parts of the housing crisis is the tens of thousands of properties that have been left idle and decaying throughout the country. Youghal's potential to be on a par with Kinsale for economic prosperity and tourism has been thwarted by the epic scale of dereliction that has been allowed to take place there over many years. Likewise, Castlemartyr and Midleton have many prime-location properties left like deserted husks where boutiques could be flourishing or community hubs or accommodation created. In Holland or Germany this would not be tolerated. Landlords would have to sell up or repurpose a vacant property within a reasonable period or face losing it. The Government's softly-softly approach to vacancy and dereliction is clearly not working, and our towns and villages are haunted by this policy failure. We need to see swift direct action by our local authorities with landlords who blight our streets with decaying properties and a much more urgent pursuit of derelict site levies. The collection of derelict site levies by Revenue is welcome, but why is the Government waiting until 2027 to implement this? \n Deputy Peadar Tóibín  The housing crisis has had varied and wide ramifications in Irish society. One of them is a serious fall in the fertility rate in this State. There has been a 30% fall in the number of births annually. There has been a 20,000 fall in the number of births annually since Celtic tiger times. Some 69% of people aged 25 years or under are living with their parents. Well over 40% of adults who are under 30 are living with their parents. That is changing the very nature of Irish society. The ability for adults to form relationships to have children is being deleted for hundreds of thousands of people. This is having massive ramifications. Schools are now noticing that there is a fall in the number of children being enrolled. An unbalanced demographic structure has serious consequences for our workforce and our pensions. Planning, permitting, licensing, tendering and judicial reviews here are among the slowest in the whole of the European Union. While the Taoiseach's Government has announced plans, they are not ambitious enough and I do not believe they will be implemented in a timely fashion. \n The Taoiseach  There were quite a number of questions there, beginning with Deputy Séamus McGrath. I welcome also the good initiative we have announced today, namely the extension of the vacant refurbishment grant to 2030, but specifically on the commercial properties and the €140,000 plus a €5,000 grant for assistance to support the owner to design a project. The Deputy is right in saying that we need to make sure that the local authorities prioritise this - in other words, that they put a project manager or whatever in charge of this operation in the towns and the cities to make this a reality. It needs to be driven with someone who is accountable and who is doing this every single day, in my view. I will talk to the Minister about that.  We need to alert all the business committees in towns and cities because people need to know. If you combine it with the living city initiative, there are real prospects of, once and for all, getting activity in towns and city centres to address dereliction and allow for change of use. Due to changing patterns of trade and so on, many commercial uses are no longer sustainable, so there is an opportunity for increased numbers residential units in towns and cities.  Deputy McAuliffe raised the topic of the Santry Boxing Club. I was recently with the Land Development Agency, LDA, on the southside, where an existing boxing club has been incorporated into a housing development. A new boxing club is being built in the housing development. That is the way to go. Is the local authority involved in the specific development to which the Deputy referred? It is. The local authority should look seriously at that example. Amenities matter in communities and society. They give young people opportunities. It seems to me that some accommodation must be made for Santry Boxing Club. The other example was a good initiative. The name of the boxing club escapes me now, but the people will have a first-class boxing club as a result of the development. It might be a bigger development. In fairness to the LDA, it saw that needed to be done. The Deputy might give me the details.  Deputy Shane Moynihan spoke about the interdependence of the national transport plan in terms of infrastructure and housing delivery. Housing delivery will depend on infrastructure delivery. I am acutely aware of planning considerations. South Dublin County Council is looking at 10,000 to 18,000 new zonings for housing. That will be dependent on DART+ South West. I have had meetings with the Minister for public expenditure and the Minister for climate and transport, Deputy Darragh O'Brien, to ensure we can underpin the development of DART+ South West. We can make progress on that to give the certainty that the council, Deputy Moynihan and the people in the area require.  Deputy Connolly asked about quarterly tables for social housing. He asked about applying such an approach to affordable housing. I will talk to the Minister. It is a fair point. The councils control a bit more for social housing, but outputs should be across the board. The first issue is to highlight those councils that are not performing. It becomes fairly obvious in a league table scenario which councils are not performing. The actions can take a number of forms. We have to work through the actions. There could be disincentives or limited finance. We have to work through that, but there must be consequences or direct action from the State to override councils that are not performing in respect of housing more generally.  Deputy O'Meara spoke about log cabins and modular homes. I hope that the Minister will in February have a list of exempted developments. I understand it has expanded significantly. There have been a lot of submissions from Government Departments and agencies, particularly those with acute issues, including health, for example, where we need urgent public services. The Minister recently indicated to me that it would be February that we will have completion of that. It is fairly complex and much bigger than we originally anticipated.  The rural housing guidelines need to be published. I have asked the Minister to prioritise that. I fully accept what the Deputy is saying about the potential for enabling and helping young people in rural Ireland to afford housing at a reasonable cost when it comes to buying or renting. We will keep an eye on that. We will look at the development levies over time in respect of rural buildings on people's land although services of one kind or another are required.  I fundamentally agree with Deputy Coppinger that cities should be liveable and that there should be strong social support and creative cultural amenities. The Deputy said the local authority is depending on someone else. Other local authorities tend to get on with it and are in a position to facilitate either the acquisition or purchase of a building without having to do the simple equation and getting the Department to pay out for every single acquisition. The Minister for public expenditure has taken an interest in this issue. I will check the current lie of the land in respect of the Complex. I know Deputy Heneghan also raised that issue.  To Deputy Conway-Walsh, I say that there is no reason why voids should take so long. There has to be some framework of control for the Department. We discovered recently with the tenant in situ scheme that houses were being bought with people living in them. Those houses are bought by councils and suddenly there is €80,000 or €100,000 going into the house. The original objective of that was to stop people going into homelessness. When a local authority house becomes vacant, unless there is something majorly wrong structurally, it should be occupied within a month. We have given huge money to local authorities for voids over the past five years. They should get on with it. They let the houses lie idle for too long. It is inexcusable. In some councils, there is inertia. I have seen it. People leave very good houses for one reason or another, the shutters go up and the houses are left there for three or four months. Those houses should be reoccupied once the electrics and everything else are grand. If we have to get around to repairing them, we can at least give someone the house. That is my view. I get impatient about it from time to time, to be honest. I hear what the Deputy is saying. If you give an upfront grant, there is no guarantee it will be spent on voids, and that is the problem.  I do not have the details of the 40-turnkey units to which Deputy Heneghan referred. Are they in Dún Laoghaire? \n Deputy Barry Heneghan  Yes. \n The Taoiseach  Has the Deputy moved across? \n Deputy Barry Heneghan  I am national now. \n The Taoiseach  The Deputy has a wide compass. He is national now. I ask him to give me the details and I will follow through. It should not happen. I do not know the background to that.  I appreciate the Deputy's comments about the Jewish community in Ireland and the impact that what happened in Bondi Beach has had on the Jewish community globally and in Ireland. The murder that took place was quite shocking. Others were injured. The Deputy also referenced the Complex.  Deputy O'Rourke spoke about child homelessness. The meeting of the Cabinet subcommittee on housing yesterday was entirely about different aspects of homelessness. We had good presentation of data. The data illustrates that there is a wide variety of reason why people become homeless. There are different factors. There is a high rate for singles in homelessness as well as children. There are different elements to the issue. An increasing amount of those who leave direct provision end up homeless. Family reunification comes with that. The link between migration and housing has grown, but is not the only factor. Family separation is a factor. Different factors give rise to homelessness, and specifically child homelessness. The Minister has specific measures. He achieved €100 million in the budget to acquire social housing and housing more generally to take more families out of emergency accommodation and get them into either local authority houses or acquired homes. There is a specific programme ahead now.  Have I dealt with everyone? I have not. \n An Ceann Comhairle  Deputies Ó Murchú and Tóibín. \n The Taoiseach  How could I forget Deputy Ó Murchú? He spoke about estate management powers to deal with what he described as \"chaotic tenants\". There are powers. I am not sure that the AHBs have different powers. They just have a different way of operating. \n Deputy Ruairí Ó Murchú  It is about eviction. \n The Taoiseach  They have a different of operating. They lay it down from the beginning. \n Deputy Ruairí Ó Murchú  It is easier for them to evict people. \n The Taoiseach  Local authorities have struggled with this for quite a long time. My own belief is that persistent misbehaviour and so on should mean you lose the tenancy. That is what should happen. It is hard. We know of housing estates that have awful tensions, difficulties and challenges. I would be glad to work with the Deputy on the issue. I will talk to the Minister about it.  Deputy Quaide spoke about the thousands of houses that have been left lying idle. We give responsibilities to the local authorities. Deputy Connolly talked about league tables. There is a league table showing which local authorities did what in respect of derelict sites. It is very telling. There are two or three that did an exceptional job. If they can do it, why cannot others? It begs the question of whether there is, or has been historically, inertia in local authorities about the Derelict Sites Act. Revenue will now be charged with it. That will bring about a change and better behaviour. The reason for the length of time, and I hope it can be accelerated, is the mapping. I have challenged officials from the Department of Finance and Revenue about this issue. I have asked why the maps are not there already and why they would take so long. Apparently, at the time of the land tax and others, the mapping was not as comprehensive as people would have expected.  That is the issue there. I think it is a game-changer and will be a game-changer.  Deputy Tóibín is making a link between falling fertility and the housing issue. Again, there are a number of variables, I imagine, responsible for that. The bottom line is we do need to provide more housing more quickly to as many young people as possible. It is a social need. Every young person in the country has a right to aspire to owning a home, and many do aspire to owning a home, or some young families being able to rent a home at an affordable cost. We are building substantially more houses than we did five years ago. We are doing about 30,000 odd now compared to 20,000 in 2020. We need to go to 50,000 and we need all hands on deck in that respect. I do not think enrolments are going down in schools yet, I think they are going up. \n Deputy Peadar Tóibín  They are; 30 schools are falling this year. And childcare. ",
        "questionType": "oral",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 10. Deputy Barry Heneghan asked the Taoiseach when the Cabinet committee on housing will meet next. [69689/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/dbsect_11",
          "debateSectionId": "dbsect_11",
          "showAs": "Cabinet Committees",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/mul@/dbsect_11.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_10",
        "questionNumber": 10
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  Preparations for the Presidency are now intensifying across Government. Our Presidency of the Council of the European Union in 2026 is going to be a major national undertaking.  The EU Presidency will be a key opportunity for Ireland to shape and manage the EU’s agenda for that six-month period. Within the European Union, it is accepted that security and defence is a national competence and that any decisions as regards EU defence arrangements, including any deepening of EU co-operation, does require unanimity. To that end, I am working very closely with colleagues and we know exactly what we need to do to make sure that we have a successful presidency.  It is important to note that National Security rests primarily with the Department of Justice and An Garda Síochána. The Defence Forces’ role, as always, is to provide support to An Garda Síochána where specific capabilities are required under the Aid to the Civil Power (ATCP) framework.  An Garda Síochána is central to the security planning and preparation. It has established a dedicated European Union Presidency co-ordination office to oversee all aspects of operational planning, logistics and inter-agency engagement.  Support during the Presidency may include security-related and logistical assistance from across the Defence Forces — the Army, Naval Service and Air Corps — in response to requirements identified by An Garda Síochána. The Defence Forces and An Garda Síochána maintain a strong working relationship, and engagement has already taken place in respect of preliminary security planning. Further engagement with colleagues in the Department of Justice and AGS will ensure early visibility of any formal requests for Defence Forces assistance and capability and options, if required will be assessed.  I can confirm to the Deputy that my Department of Defence has not engaged, nor is it intended to, with the Office of Public Works and Áras an Uachtaráin regarding a proposal to rename a section of the Phoenix Park. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 104. Deputy Barry Heneghan asked the Minister for Defence if she has requested or intends to request naval support from France for Ireland’s 2026 Presidency of the Council of the European Union, including any consideration of a French Navy vessel operating in Irish waters; if her Department has engaged with the Office of Public Works and Áras an Uachtaráin regarding a proposal to rename a section of the Phoenix Park (details supplied) in honour of General Charles de Gaulle; and if she will make a statement on the matter. [71897/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_44",
          "debateSectionId": "dbsect_44",
          "showAs": "EU Presidency",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_44.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_104",
        "questionNumber": 104
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  The Naval Service currently has a fleet of eight vessels. Four of the vessels are regularly deployed on Maritime Defence and Security Operations (MDSO). These four vessels consist of three P60 class vessels as well as the L.É. Aoibhinn (P71) with all four vessels conducting patrols on a rotation basis. The Naval Service have completed 521 patrol days this year up to the end of November 2025, which exceeds the total patrol days completed in 2024. In addition to at sea monitoring, the Naval Operations Command Centre in Haulbowline carries out remote monitoring twenty four hours a day, seven days a week.  The strength of the Naval Service as of 31 October 2025, the latest date for which data is available, is 784 WTE. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 119. Deputy Barry Heneghan asked the Minister for Defence the current operational naval capacity available to monitor and secure Ireland’s maritime area, including patrol days, vessel availability and staffing levels, in order to protect critical national infrastructure at sea; and if she will make a statement on the matter. [71898/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_57",
          "debateSectionId": "dbsect_57",
          "showAs": "Naval Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_57.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_119",
        "questionNumber": 119
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has responsibility for the planning and development of public transport infrastructure, including the BusConnects routes in Dublin.  As the Deputy may be aware, BusConnects is a transformative programme of investment in the bus system, with the aim to provide better bus services across five cities. It is the largest investment in the bus system in the history of the State and is managed by the NTA.  The roll-out of the remaining phases of the BusConnects Dublin Network Redesign will occur over the coming years, subject to funding and operational readiness.  Noting the NTA's responsibility in the matter, I have referred the Deputy's questions to the NTA for a direct reply. Please contact my private office if you do not receive a reply within 10 days.   ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 329. Deputy Barry Heneghan asked the Minister for Transport when phase eight of BusConnect Dublin will be operational; and if he will make a statement on the matter. [72330/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_238",
          "debateSectionId": "dbsect_238",
          "showAs": "Bus Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_238.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_329",
        "questionNumber": 329
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As the Deputy may be aware, the National Transport Authority (NTA) has responsibility for the planning and development of public transport infrastructure in the Greater Dublin Area (GDA) including, in consultation with Iarnród Éireann, the DART+ programme.  The DART+ programme, which comprises five different projects in and around the GDA, will triple the length of the electrified network from circa 50km to 150km and double city centre capacity from 26,000 passengers per hour per direction to 52,000 during peak hours. This will significantly enhance access to high capacity public transport across the GDA.  DART+ South West will extend DART services from the City Centre to Hazelhatch and Celbridge including four-tracking from Park West to Heuston. A Railway Order was approved for DART+ South West by An Coimisiún Pleanála in November 2024. In addition, procurement for DART+ South West and West is progressing with pre-qualification questionnaires (PQQ) notices for Design and Build works advertised in May 2025.  The NDP Sectoral Investment Plan, published by the Department in November, sees the allocation of €22.3 billion in Exchequer resources to Transport, along with an additional allocation of €2 billion from the country's Infrastructure, Climate and Nature Fund to support the development of MetroLink. Of this total allocation, funding of circa €10 billion for public transport infrastructure is earmarked from 2026 to 2030, in addition to the €2 billion for MetroLink, primarily in line with the Department’s NIFTI intervention hierarchy of Maintain, Optimise, Improve, and New. This approach involves prioritising investment in the protection and renewal of existing assets before investing in new ones, on economic and environmental grounds.  The funding under the NDP Sectoral Investment Plan will see significant advancements made in a number of public transport projects, including elements of the DART programme. This funding will allow Compulsory Purchase Orders to progress for DART+ South West starting next year and provide for procurement progress for the project, with some of the framework contracts being established in common for DART+ West and DART+ South West.  The Department of Transport will continue to explore opportunities for additional funding, including through funding streams such as the European Union Connecting Europe Facility (CEF), to compliment national Exchequer funding which may allow some projects to proceed to construction earlier than currently anticipated, including DART+ South West.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a more detailed reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 333. Deputy Barry Heneghan asked the Minister for Transport the reasons for the revised National Development Plan timeline that now pushes delivery of DART Plus South-West into the 2030s; the impact this revised schedule will have on housing development and on providing reliable alternatives to car travel for commuters; and if he will make a statement on the matter. [72359/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_242",
          "debateSectionId": "dbsect_242",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_242.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_333",
        "questionNumber": 333
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  This government is fully committed to supporting students with special educational needs to fulfil their full potential and the Programme for Government makes a number of commitments to deliver on this objective.  In 2026, over €3 billion will be spent supporting students with special educational needs. It will ensure that specialist capacity continues to grow by providing 3,000 specialist places. The majority of these places will be available in special classes within mainstream schools.  It will increase our special educational posts by 860 special education teacher and over 1,700 special needs assistant (SNA) posts. This will mean we will have almost 46,000 professionals dedicated to supporting students with special educational needs in our schools. This is one of the highest annual increases in posts to date and is a firm reminder of this government’s commitment to supporting students with special educational needs. Salary scales for school staff are available via my Department's website on www.gov.ie.  Budget 2026 has also afforded a number of new initiatives such as funding for the roll out of the Education Therapy Service (ETS), the introduction of extra special education teaching hours for post-primary schools to support coordination and transition efforts and indeed a special school package to support the unique challenges these schools face.  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 425. Deputy Barry Heneghan asked the Minister for Education and Youth the number of personnel employed across all State agencies who support special education in post primary schools (details supplied); the total annual expenditure associated with these roles, in tabular form; and if she will make a statement on the matter. [71387/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_319",
          "debateSectionId": "dbsect_319",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_319.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_425",
        "questionNumber": 425
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The department does not hold centralised comparative data on the level of individual student needs.  Such data is maintained at individual school level and detailed within the individual student support file held by the school.  The Continuum of Support is the framework developed by NEPS for schools to identify, plan and provide support for children and young people who experience difficulties with their learning.  The National Educational Psychological Service (NEPS) supports schools in implementing the Continuum of Support framework with each school taking responsibility for initial assessment, educational planning and supports for children and young people with special educational needs.  Under this model, a child or young person does not require a psychological assessment diagnosis in order to access additional support at school.  This Continuum of Support framework recognises that special educational needs occur along a continuum, ranging from mild to more significant, and from transient to enduring. It recognises that children require different levels of support depending on their identified educational needs, and that needs may change over time.  Using this framework helps to ensure flexible and timely allocation of supports, so that those children with the greatest level of need have access to the greatest level of support. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 426. Deputy Barry Heneghan asked the Minister for Education and Youth if her Department collects centralised comparative data on levels of student need across post primary schools; if so, if she will provide these data in tabular form; and if not, the rationale for requiring schools to determine need in the absence of national benchmarks given delays for professional assessments; and if she will make a statement on the matter. [71398/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_320",
          "debateSectionId": "dbsect_320",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_320.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_426",
        "questionNumber": 426
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  While there is no specific estimate available of the number of hours spent by each school on applications for either RACE or assistive technology, both the SEC and my Department are reviewing respective processes currently.  In relation to the RACE scheme, the SEC, directed by the Board of Commissioners, is leading a comprehensive system wide review of the Scheme which will seek to address relevant issues and take account of best practice internationally. Work is underway as part of the Review to review the RACE application process with a view to moving applications online, reducing the administrative burden on schools and resulting in a more streamlined decision-making process.  The RACE scheme is school-based, and applications are made through schools on behalf of students. Schools also undertake the testing required to support the application. Applications for reasonable accommodations are considered in line with the published Framework of Principles and can only be approved in accordance with the principles and requirements of the scheme which are set out in RACE Instructions for Schools.  In line with established practice, all Junior Cycle and Leaving Certificate RACE applications are subject to quality assurance. The focus of the quality assurance process continues to be assisting schools to comply with the demands of the RACE scheme. In the event that problems are identified, the SEC assisted by the National Educational Psychologist Service (NEPS) provides schools with guidance and advice as to how they should improve their RACE application process.  NEPS also provides advice to the SEC on the eligibility criteria and the testing arrangements required to assess eligibility for RACE supports on grounds of learning difficulty. There is no longer any need to undertake tests of general cognitive ability for the purposes of the RACE scheme as there is no requirement to distinguish between specific and general learning difficulties.  In relation to assistive technology, the Assistive Technology Scheme supplements the overall approach to providing funding to schools for digital technology and equipment to support children for education purposes. All equipment provided under this scheme supports children who require essential specialist equipment in order to access the school curriculum.  I can confirm to the Deputy that my Department is currently finalising a review of this scheme to ensure it is effectively supporting the children it is intended to serve, and that resources are being allocated as efficiently as possible.  There has been widespread consultation in relation to the scheme, and the consensus from stakeholders was that the application system needs to be quicker and easier and that all of the children who need assistive technology to access the curriculum should receive it.  In addition, the application process is being streamlined so that children can get the equipment in the shortest time possible. This will be a simpler process for schools by way of a new portal for schools to submit applications. This portal is currently under development and is intended to be rolled out as soon as possible.  The review will be finalised early in 2026, and in advance of this, I'm pleased to say that I have secured additional funding for this scheme in Budget 2026 to recognise the growing need for assistive technology in our schools.   ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 427. Deputy Barry Heneghan asked the Minister for Education and Youth the estimated number of administrative hours that schools spend each year on reasonable accommodations in the certificate examinations applications and assistive technology applications; if she will provide these estimates in tabular form; if she will consider introducing a high trust model similar to the Irish Exemption system to streamline this workload; and if she will make a statement on the matter. [71399/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_321",
          "debateSectionId": "dbsect_321",
          "showAs": "Schools Administration",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_321.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_427",
        "questionNumber": 427
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  This government is fully committed to supporting students with special educational needs to fulfil their full potential and the Programme for Government makes a number of commitments to deliver on this objective.  Providing inclusive education to children with special educational needs is a fundamental principle of the education system. This principle is observed through Department policies, Teaching Council requirements for initial teacher education, curriculum provision and the range of supports provided to schools by the National Council for Special Education (NCSE) and Oide. Schools are supported through building the capacity of teachers to deliver an inclusive education system.  The Teaching Council registers teachers under the Teaching Council Act 2001-2015 and in line with the Teaching Council Registration Regulations, 2016. As set out in the Schedule of the Regulations, the Council registers teachers under five routes of registration: Route 1 - Primary, Route 2 - Post-primary, Route 3 - Further Education, Route 4 - Other and Route 5 - Student Teacher.  Central to Initial Teacher Education policy in Ireland is that all teachers teaching children with Special Educational Needs (SEN) should be qualified Primary or Post-primary teachers in the first instance.  Inclusive education is a mandatory element of initial teacher education (ITE) programmes. Within further updated standards which the Teaching Council adopted in 2020, known as Céim Standards for Initial Teacher Education, inclusive education was further strengthened as one of seven core elements which must underpin all aspects of programmes of ITE.  Furthermore, the department has initiated a process to move towards a mandatory assessed placement period in a special education needs setting for all student teachers. As part of this, it is envisaged the Teaching Council, on behalf of the department, has conducted a survey across all Initial Teacher Education (ITE) providers to gain a deeper understanding of the current landscape of school placement provision in special education settings. This will support the consideration of the Teaching Council in the development and approval of a Guidance Note for Higher Education Institutions, around an assessed student placement period in a SEN setting, working with a view to supporting initial change in September 2026.  Additionally, funded by the Department, Oide works with teachers and school leaders to provide ongoing support and professional development, which promotes inclusive practices.  The Department funds over 300 places on postgraduate professional development programmes in collaboration with HEI nationally.  The Department provides a suite of professional development programmes developed and delivered by NEPS in supporting children and young people with special educational needs.  The NCSE provides supports to teachers and schools in a way that builds capacity, supports the inclusion of all children, including students with special educational needs, at a whole school level. The NCSE Support Service manages, co-ordinates and develops a range of supports in response to identified teacher training needs. This included Teacher Professional Learning (TPL). The NCSE continues to update current TPL courses and design new courses in response to the needs of teachers.  The Department does not maintain records regarding the additional qualifications of qualified teachers however, my department is committed to ensuring that all teachers, at primary and post-primary level, have the skills they need to support the diverse needs of all our children and young people in our schools. It is critical that our teachers are equipped with the knowledge and skills needed to continue to deliver high quality and inclusive education. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 428. Deputy Barry Heneghan asked the Minister for Education and Youth the number of teachers currently working in special education teaching roles hold a recognised qualification in special education; if she will provide this information in tabular form; if the Department plans to expand conversion or upskilling routes; the training is provided to external professionals who work with schools; and if she will make a statement on the matter. [71400/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_322",
          "debateSectionId": "dbsect_322",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_322.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_428",
        "questionNumber": 428
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Consideration has not been given to redeploying elements of the Inspectorate to provide in-school training and collaborative planning support. Oide is the Department-funded body with a specific remit to provide professional learning for teachers and school leaders. The Inspectorate has a statutory evaluative, advisory and capacity-building functions in schools, Early Learning and Care (ELC) settings and centres for education. The Inspectorate’s programme of evaluation is not focused primarily on compliance-based inspections. As set out in its published Inspection Policy (2025), the Inspectorate is committed to carrying out a balanced approach to regulation, quality improvement and provision of policy advice at school and system levels. It provides an evaluative account of the work of education settings and schools, affirming good practice and promoting improvement. The Inspectorate and Oide work closely to support improvement in the quality of education provision at both school and system levels. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 429. Deputy Barry Heneghan asked the Minister for Education and Youth if consideration has been given to redeploying elements of the Inspectorate to provide in school training and collaborative planning support rather than focusing primarily on compliance based inspection; and if she will make a statement on the matter. [71426/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_323",
          "debateSectionId": "dbsect_323",
          "showAs": "School Inspections",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_323.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_429",
        "questionNumber": 429
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The Assessment of Need (AON) is a statutory process under the Disability Act (2005) whereby the Health Service Executive (HSE) reports on the health and education needs of a child/young person. The provision of Guidelines, including any data sharing arrangements for the assessment of needs process is a matter for the Department of Children, Equality, Disability, Integration and Youth and the HSE.  It is Department policy, in accordance with the principles of inclusive education, that, to the greatest extent possible, students with additional learning needs are supported in mainstream classes along with their peers, with additional supports provided as necessary.  The Continuum of Support is the framework developed by NEPS for schools to identify, plan and provide support for children and young people who experience difficulties with their learning. The National Educational Psychological Service (NEPS) supports schools in implementing the Continuum of Support framework with each school taking responsibility for initial assessment, educational planning and supports for children and young people with special educational needs. Under this model, a child or young person does not require a psychological assessment diagnosis in order to access additional support at school. This Continuum of Support framework recognises that special educational needs occur along a continuum, ranging from mild to more significant, and from transient to enduring. It recognises that children require different levels of support depending on their identified educational needs, and that needs may change over time. Using this framework helps to ensure flexible and timely allocation of supports, so that those children with the greatest level of need have access to the greatest level of support.  Primary and post-primary schools make provision for students with special educational needs (SEN) through a continuum of interventions ranging from additional support teaching in mainstream schools through to more specialist placements either in a special class or a special school depending on the level of complexity of need. Schools are required to target their additional resources at those students requiring the greatest level of support. Children/young people do not require a psychological assessment or a diagnosis in order to access additional support at school.  Schools are provided with the resources, through the special education teacher allocation model, to assist them in meeting the needs of their students. It is a matter for schools to monitor and utilise their allocation of additional teaching support to best support the needs of identified students, in accordance with the Department's guidance. Guidelines for schools on the organisation, deployment and use of their special education teachers have been published on the Department’s website, at - gov.ie - SET Guidelines and supporting documentation to aid schools in supporting Children/Young people with Special Education Needs.  It is important to note that since 2017 children and young people in mainstream classes have not required a specific diagnosis to access mainstream supports from the 15,000 special education teachers in our school system. In addition, the Department has removed the requirement for any health-based information to support transitions from a primary to a post-primary special class and/or for additional SNA requirements.  The AON process as it applies to schools and as outlined in DEY Circular 0069/2025 will remain in place. For clarity, there is no change to the AON process as it applies in schools. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 430. Deputy Barry Heneghan asked the Minister for Education and Youth the data sharing arrangements that exist for students identified through the continuum of support who are also on assessment of need or child and adolescent mental health services waiting lists; if a shared national system is planned; and if she will make a statement on the matter. [71429/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_324",
          "debateSectionId": "dbsect_324",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_324.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_430",
        "questionNumber": 430
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for children with special educational needs.  In order to support the NCSE and forward planning my department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE that they are seeking a special educational placement for their child.  This notification process will provide the NCSE with critical information on children who continue to need a special class as they progress to post-primary level as well as details on students who require a place for the first time.  The NCSE is undertaking analysis of information provided through the Parents Notify process which closed on 1 October to plot demand for special class places for the 2026/27 school year. The NCSE will also consider vacant places in existing special classes and places that will become available through the regular transition of children from primary to post-primary schools. Once this analysis is completed the NCSE will be equipped to engage with schools to open new special classes in relevant areas.  The new timeline was publicised widely and communicated with schools and special education advocacy groups and parent representative bodies. The NCSE also undertook a lot of work at local level to ensure that families were aware of the process and timeline, and consequently report a significant level of engagement from families before 1 October.  I would like to stress that the NCSE will continue to support all children and young people made known to them after 1 October in their existing placement with appropriate resources. However, it is critical that the NCSE has as much local information as possible, as early as possible, to effectively plan what new provision.  My department and the NCSE are committed to ensuring that sufficient special education placements remain available for children with special educational needs and will continue to review where new specialist provision is required. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 469. Deputy Barry Heneghan asked the Minister for Education and Youth the number of parents who have submitted a notification to the NCSE by the 1 October deadline requesting a special school place for the 2026-2027 school year in Dublin, by postcode, in tabular form; and if she will make a statement on the matter. [71947/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_359",
          "debateSectionId": "dbsect_359",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_359.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_469",
        "questionNumber": 469
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Central Statistics Office (CSO), as the national statistical agency, is responsible for the compilation and publication of all crime statistics.  The CSO produces these statistics using data recorded on An Garda Síochána’s PULSE system and makes regular releases in relation to various crime statistics. The most recent statistics were released on 24 September 2025, providing statistics for Recorded Crime for Quarter 2, 2025.  Recorded crime statistics are published by the CSO for Burglary and Related Offences at Garda Station level, including Coolock, Raheny, Howth and Clontarf, annually for the 2003 to 2024 period:  www.data.cso.ie/table/CJA07  Recorded crime statistics are also published by the CSO for Burglary and Related Offences at Garda Division level (including DMR North) quarterly for the Q1 2003 to Q2 2025 period:  www.data.cso.ie/table/CJQ06  The Garda Commissioner is responsible for the operational policing response to burglary and the Deputy may be aware that Operation Thor is the Garda national response to burglary.  It is worth noting the strong progress made since Operation Thor was launched in 2015. There has been a 75% reduction in residential burglaries nationwide.  An Garda Síochána launched the Winter Phase (2025/2026) of Operation Thor on 1 October 2025.  Under Operation Thor, the Garda National Drugs and Organised Crime Bureau (GNDOCB) co-ordinates and supports local Gardaí by actively targeting organised crime gangs and repeat offenders, particularly those involved in burglaries, through enforcement activity based on intelligence and the latest crime trends.  Gardaí conduct high-visibility patrols and check-points at specific times of day in known ‘hot-spots’ to reduce the movement of burglars, gathering intelligence on known offenders and regularly communicating with those in the community about crime prevention measures. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 717. Deputy Barry Heneghan asked the Minister for Justice, Home Affairs and Migration the trend in reported burglary activity across the Coolock, Raheny, Howth and Clontarf Garda districts including any notable increases or decreases compared with 2022 to 2024, to date in 2025, in tabular form; and if he will make a statement on the matter. [71946/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_567",
          "debateSectionId": "dbsect_567",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_567.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_717",
        "questionNumber": 717
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  Following engagement with legal representatives of the families of the victims of the Stardust fire, the Government, in August 2024, approved a two-phased approach to redress arrangements. Phase one of the redress, for the families of the 48 victims of the fire, was recently completed.  In line with the Government's 2024 decision, work to develop phase two proposals, concerning survivors of the fire, continues to be advanced by my Department. This assessment will, in developing an appropriate mechanism, consider the compensation awards made by the Stardust Victims’ Compensation Tribunal established in 1985.  This assessment is at an advanced stage and I look forward to bringing proposals to Government for consideration, following which the Department will make the necessary arrangements for implementation. Those arrangements will include the provision of additional information, including timelines, for survivors on this important matter. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 718. Deputy Barry Heneghan asked the Minister for Justice, Home Affairs and Migration the stage reached in the preparation of the Stardust redress scheme; the remaining steps before proposals are brought to Government for approval; the indicative timeline for the commencement of payments; and if he will make a statement on the matter. [71949/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_568",
          "debateSectionId": "dbsect_568",
          "showAs": "Stardust Fire",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_568.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_718",
        "questionNumber": 718
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 748 and 750 together.  The Garda Commissioner is responsible for the distribution and stationing of Garda personnel throughout the State under section 33 of the Policing, Security and Community Safety Act 2024. As Minister I have no role in these independent functions.  In the interest of transparency, An Garda Síochána publishes detailed breakdowns on the allocation of Gardaí including the allocation of Community Gardaí by Division. This information is updated on a monthly basis and can be found at the following link:  [ https://www.garda.ie/en/about-us/our-departments/human-resources-and-people-development/garda-hr-directorate/garda-strength-breakdown-2025/ ]  I am advised by the Garda authorities that as of 31 October  2025 , the latest date for when figures are available, there were nine Community Gardaí allocated to Coolock Station, including one Sergeant, and 12 Community Gardaí allocated to Clontarf Station, which includes two Sergeants.   ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 748. Deputy Barry Heneghan asked the Minister for Justice, Home Affairs and Migration the number of Gardaí by rank attached to a unit (details supplied) as of 9 December 2025, in tabular form; and if he will make a statement on the matter. [72334/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_595",
          "debateSectionId": "dbsect_595",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_595.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_748",
        "questionNumber": 748
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I have requested the information sought by the Deputy but it was not received in time. I will contact the Deputy directly once the information is to hand. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 749. Deputy Barry Heneghan asked the Minister for Justice, Home Affairs and Migration the number of Gardaí by rank attached to a unit (details supplied) as of 9 December 2025, in tabular form; and if he will make a statement on the matter. [72335/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_596",
          "debateSectionId": "dbsect_596",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_596.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_749",
        "questionNumber": 749
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 748 and 750 together.  The Garda Commissioner is responsible for the distribution and stationing of Garda personnel throughout the State under section 33 of the Policing, Security and Community Safety Act 2024. As Minister I have no role in these independent functions.  In the interest of transparency, An Garda Síochána publishes detailed breakdowns on the allocation of Gardaí including the allocation of Community Gardaí by Division. This information is updated on a monthly basis and can be found at the following link:  [ https://www.garda.ie/en/about-us/our-departments/human-resources-and-people-development/garda-hr-directorate/garda-strength-breakdown-2025/ ]  I am advised by the Garda authorities that as of 31 October  2025 , the latest date for when figures are available, there were nine Community Gardaí allocated to Coolock Station, including one Sergeant, and 12 Community Gardaí allocated to Clontarf Station, which includes two Sergeants.   ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 750. Deputy Barry Heneghan asked the Minister for Justice, Home Affairs and Migration the number of Gardaí, by rank attached to a unit (details supplied) as of 9 December 2025, in tabular form; and if he will make a statement on the matter. [72336/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_595",
          "debateSectionId": "dbsect_595",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_595.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_750",
        "questionNumber": 750
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  The need to dredge Howth FHC to ensure its long-term viability as a commercial fishing port, leisure harbour and tourism destination is widely accepted by the industry and the community and has been long recognised as an urgent issue by my Department.  Unfortunately, the project experienced significant delays in obtaining the relevant planning and consents. Planning permission was granted by Fingal County Council in August 2022. A third party subsequently made an appeal to An Coimisiún Pleanála (ACP formerly An Board Pleanála ABP). Progress on this project was delayed by 20 months until a decision which was made in favour of my Department in August 2024.  My Department submitted an application for a waste licence to the Environmental Protection Agency (EPA) in December 2023 in anticipation of the ACP decision. Ideally the EPA assessment would have commenced immediately. However, the application was not scheduled on either the 2024 or 2025 application lists.  I am now pleased to inform the Deputy that I was recently informed by the EPA that that they are now treating the application as a matter of urgency and importance, and the project will be a priority application on their 2026 scheduled application list. Following their decision, the potential timeline for the construction phase of the project is for construction over three budgetary years, subject to funding availability, and national priorities, with actual construction time being 24-34 months. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 796. Deputy Barry Heneghan asked the Minister for Agriculture, Food and the Marine to provide an update on the Howth Harbour dredging project; the timeframe for the commencement of dredging works; and if he will make a statement on the matter. [71948/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_621",
          "debateSectionId": "dbsect_621",
          "showAs": "Harbours and Piers",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_621.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_796",
        "questionNumber": 796
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 858. Deputy Barry Heneghan asked the Minister for Children, Disability and Equality the number of WTE administrative staff, by grade posts filled at a service (details supplied) in 2024 and to-date in 2025, in tabular form; and if she will make a statement on the matter. [72337/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_677",
          "debateSectionId": "dbsect_677",
          "showAs": "Education and Training Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_677.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_858",
        "questionNumber": 858
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 901. Deputy Barry Heneghan asked the Minister for Health the number of personnel employed across all State agencies who support special education in post-primary schools (details supplied); the total annual expenditure associated with these roles, in tabular form; and if she will make a statement on the matter.  [71388/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_716",
          "debateSectionId": "dbsect_716",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_716.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_901",
        "questionNumber": 901
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 911. Deputy Barry Heneghan asked the Minister for Health if an audit has been carried out on the number of hours that Health Service Executive professionals spend in post primary schools, in tabular form; the mechanisms that exist to coordinate assessments when multiple students in the same school require support; and if she will make a statement on the matter. [71427/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_727",
          "debateSectionId": "dbsect_727",
          "showAs": "Health Service Executive",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_727.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_911",
        "questionNumber": 911
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  As this is a service matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 912. Deputy Barry Heneghan asked the Minister for Health if consideration has been given to aligning primary care, child and adolescent mental health services and children’s disability network team boundaries with school addresses rather than home addresses in order to improve service coordination and data collection; and if she will make a statement on the matter. [71428/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_728",
          "debateSectionId": "dbsect_728",
          "showAs": "Mental Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_728.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_912",
        "questionNumber": 912
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  As this is a service matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 913. Deputy Barry Heneghan asked the Minister for Health the data sharing arrangements that exist for students identified through the continuum of support who are also on assessment of need or child and adolescent mental health services waiting lists; if a shared national system is planned; and if she will make a statement on the matter. [71430/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_729",
          "debateSectionId": "dbsect_729",
          "showAs": "Mental Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_729.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_913",
        "questionNumber": 913
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  This a matter for the Department of Education and should be redirected to that Department. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 914. Deputy Barry Heneghan asked the Minister for Health if a cross departmental cost analysis has been undertaken of total expenditure across the National Council for Special Education, Oide, the National Educational Psychological Service, Child and Adolescent Mental Health Services, children’s disability network teams and primary care teams; if she will provide any available expenditure data, in tabular form; if restructuring this funding into multidisciplinary school based teams has been considered; and if she will make a statement on the matter. [71432/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_730",
          "debateSectionId": "dbsect_730",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_730.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_914",
        "questionNumber": 914
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  The Food Safety Authority of Ireland (FSAI) has overall responsibility for the enforcement of food law in Ireland; therefore, as this is an operational matter, I have asked the FSAI to reply directly to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1100. Deputy Barry Heneghan asked the Minister for Health the number of inspections, compliance notices, closure orders or enforcement actions issued by Food Safety Authority of Ireland and authorised officers in meat processing facilities over the past two years; the types of breaches detected; the follow-up actions taken in each category, in tabular form; and if she will make a statement on the matter. [72331/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_914",
          "debateSectionId": "dbsect_914",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_914.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1100",
        "questionNumber": 1100
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health (Deputy Jennifer Carroll MacNeill)  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1101. Deputy Barry Heneghan asked the Minister for Health the current waiting list for chronic pain services at Beaumont Hospital; the number of patients waiting more than four months; the number of patients aged over 65 years within those lists; and if she will make a statement on the matter. [72332/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_915",
          "debateSectionId": "dbsect_915",
          "showAs": "Hospital Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_915.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1101",
        "questionNumber": 1101
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the HSE to reply to the Deputy directly as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1102. Deputy Barry Heneghan asked the Minister for Health the additional resources and personnel that will be provided to D-Doc Services during the upcoming Christmas-New Year period; and if she will make a statement on the matter. [72333/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_916",
          "debateSectionId": "dbsect_916",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_916.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1102",
        "questionNumber": 1102
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The NDP Review 2025 was published on 22 July 2025, in line with the Programme for Government commitment. The Plan committed €275.4 billion in public capital investment to 2035 – the largest and most significant capital injection in our economy in the history of the State.  Arising from this, €19.1 billion in Exchequer capital investment will be provided in 2026. On Budget day, Ministers set out the capital projects and programmes that they will prioritise within their allocation in 2026.  The Programme for Government set out the clear prioritisation for the NDP Review to ensure that investment can be maximised in the coming five years for strategic infrastructure. This includes the key energy, water and transport networks on which all future development relies. This is critical to allow Government to meet the additional 300,000 homes target and to support competitiveness.  Following the allocation of the NDP Ministerial Expenditure Ceilings, it is a matter for each Minister to assign funding as appropriate at programme and subhead level for their Departments and the agencies under their remit, accounting for the demands for services in different areas and regions and having regard to demographics and other relevant factors. Within this process, both current and capital expenditure are allocated on a Departmental basis and not a geographic basis.  More broadly, the achievement of balanced regional development is a key priority of this Government and is at the heart of Project Ireland 2040, which includes the National Planning Framework (NPF), which sets out the overarching spatial strategy, along with the National Development Plan.  Since Project Ireland 2040 was first launched in 2018, the Government has overseen the delivery of many impactful NDP projects across the country, including in Dublin, and including in the priority sectors of energy, water and waste water, transport, housing and health.  My Department tracks investment by county and some of the critical infrastructure delivered in Dublin is to the benefit of all its residents, including people in Dublin Bay North.  These works include for example Bus Connects Dublin, and enhancements to wider public transport capacity; water and wastewater works in Ringsend, Saggart Reservoir and Upper Liffey Valley. Further delivery under the NDP has included investment in further education infrastructure at the TU Dublin Grangegorman, Tallaght and Blanchardstown campuses, completing the Polaris Building in DCU and redevelopments of the Royal Irish Academy of Music.  Significant education construction has been completed in North Dublin including works on Stapolin, Belmayne and St. Francis of Assisi National School & Belmayne Educate Together Schools.  In recent weeks, individual Ministers have developed sectoral level plans, for priority investment programmes and projects within their additional capital allocations for delivery across the country. Considering sectoral needs and Ministerial decisions, these plans reflect Government priorities, including the National Planning Framework commitment to balanced regional development.  The plans published to date include planned investment and projects across the country, and are available on each Department’s website with full details. These include a range of projects across Dublin county and city, which will serve both national and local level needs.  For example:  • investment in health infrastructure includes works at the National Children’s Hospital and supporting the relocation of the National Maternity Hospital;  • housing investment includes delivering over 1,400 new social housing units and over 1,600 new affordable housing units across the county;  • investment in our justice infrastructure including Mountjoy and Wheatfield Prisons and the Dublin Family Courts; and  • and investment in culture and heritage infrastructure including the RDS arena and the Samuel Beckett Civic Campus.  An upfront injection of €2billion is to be provided for Uisce Éireann in 2025, and another €2.5billion is available for drawdown by Uisce Éireann up to 2030. This is to support delivery of critical water and wastewater infrastructure including works for the Greater Dublin Area Drainage Project, a significant investment in regional wastewater treatment with capacity to serve 500,000 people. This critical investment will underpin the Government’s commitment to delivery of 300,000 new housing units by 2030.  Full details on each Department’s sectoral investment plans for capital projects across the country are available on each Department’s website. Final plans by all Departments are expected to be published by the end of the year. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 6. Deputy Barry Heneghan asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the priority capital projects in Dublin Bay North that fall under his Department’s oversight, including planned investment to expand community infrastructure such as primary care capacity, school buildings, and targeted disability facilities to meet projected population growth; and if he will make a statement on the matter. [70843/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_59",
          "debateSectionId": "dbsect_59",
          "showAs": "Strategic Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_59.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_6",
        "questionNumber": 6
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Deputy Barry Heneghan  I ask for an update on post-primary capacity planning in Clontarf, Killester and Raheny, including the current assessment of projected enrolment pressure and the steps the Department is taking to ensure an adequate supply of secondary school places, particularly in co-educational schools as a survey has shown that 89% of parents in the area want co-educational education. \n Deputy Michael Moynihan  I am pleased to assure the House that there are more than sufficient places for all local children in the area referred to by the Deputy. While primary enrolments have been declining in the area since 2018, 16% of first year places at post-primary schools went unfilled for the last school year. This reflects an overall decline in post-primary enrolments for the area since 2023 and the fact that there are more first year places available than sixth class students in the area for the forthcoming school year. Enrolment pressures in an area may not always relate to capacity. They may instead relate to school choice and external draw factors. The Department’s responsibility is to ensure that schools in an area can collectively cater for local demand.  Under the national development plan, the Department of education has invested over €6 billion in our schools throughout the country, including in the area referred to by the Deputy, since 2020. This involves the completion of over 1,300 school building projects. There are four projects planned at post-primary schools in the area, including a large-scale major project which is at construction and which will cater for over 1,000 pupils. This will provide good additional capacity relative to the school’s current enrolment. This investment will ensure that all pupils will continue to have access to an appropriate education place.  Delivery of school building projects is underpinned by strong forward planning processes. Robust demographic analysis takes account of various data sources, including the census, child benefit data and school enrolments, and additional factors including planned residential development in each area. Furthermore, as with other areas, the Department will continue to liaise with the local authority in respect of its county development plan with a view to identifying any potential evolving long-term school accommodation requirements. \n Deputy Barry Heneghan  I appreciate that every child has a space but these spaces are not where parents desire to send their children. It is bananas. I was recently at an event with a load of up-and-coming parents, the new generation, and they were unanimously for this. The report submitted to the Minister's office shows a community that is ready for change and parents who are willing to support that change. Is there an indication of whether the Department is actively considering the establishment of new co-educational secondary schools in the area because there is clearly a demand?  I would appreciate clarity as to whether Education Equality will be included in the national convention on education. It has emailed the office but has not got a reply. It wishes to discuss the ongoing issues around children's rights and the need for schools to uphold freedom of religion and belief in practice. With the new generation of parents and the new generation coming up in Ireland, it is very important that we provide this option. We can see the statistics. We need to act on them. \n Deputy Michael Moynihan  There were a number of questions there, along with a number of grenades. The planning and building unit in the Department is very conscious that we need to ensure adequate capacity right across the system in primary schools, post-primary schools, special classes and special schools. We are working to that. Resources are not endless but it is important to work with what is available. The Deputy raised the issue of school choice and so forth. There is a lot of work and research going on behind the scenes in that regard. Co-educational schools are hugely important. It is very important that we embrace that right across the school spectrum. I will come back to the Deputy on the specific issues he raised.  The education convention is hugely important. This was set up by the previous senior Minister, Deputy McEntee, with whom I had the honour of working for the past number of months. I pay tribute to her and her team for the work they did. It is hugely important that the education convention is embraced because we will have to plan for education for the next 25 years and beyond. \n Deputy Barry Heneghan  I appreciate that. It is very important that Education Equality is invited to the national convention on education. It represents a large cohort of parents and a large cohort of the future generation. It needs to be replied to. We can be assured that representatives from State bodies and patrons will be there to fight their cases. It is important that Education Equality is there to show the other side on behalf of people who want change.  I thank the Minister of State on the record of the House for all the help he has given me in my work in Dublin Bay North with regard to Stapolin Educate Together National School in Baldoyle and for everything he has done in relation to special education. It is really appreciated. His visit was brilliant. Will he provide an update on the current assessment of projected enrolment figures for the area? Chris Joyce and all of the parents involved in the Killester Raheny Clontarf school campaign are working tirelessly to show the Department what is needed. They have submitted a report to the Department but feel they are not being listened to. I appreciate what the Minister of State said about the volume of work involved. I understand the number of enrolments is huge and that everything must be processed but the campaign has done the work.  Of 1,800 parents interviewed, 89% want co-education. \n Deputy Michael Moynihan  The information has been given to the Department and work is ongoing in relation to it.  Regarding the education convention, the Deputy reflected the truth in the phrase he used when he said that every sector would be there fighting its corner. However, I genuinely believe that this is a very serious attempt being made by the Department of education to engage with all the stakeholders in a meaningful way to embrace all the issues that are out there. We have to drop the sense that you either have to fight your corner to ensure something happens or surrender it. This is about having the best possible education system. We have prided ourselves the world over on our education system over the last 50 years, and on the outcomes it has delivered in any comparison. However, we have to make sure that everybody is in and everybody's voice is heard and that we bring forward an education that we can be proud of again into the next generation and beyond. It is also important that it is done in a cohesive way, that we come to agreement on it and that everyone can stand together on it. ",
        "questionType": "oral",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 93. Deputy Barry Heneghan asked the Minister for Education and Youth to provide an update on post primary capacity planning for locations (details supplied), including the current assessment of projected enrolment pressure; the steps her Department is taking to ensure an adequate supply of secondary school places in the coming years; and if she will make a statement on the matter. [70838/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Barry-Heneghan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Barry-Heneghan.D.2024-11-29",
          "showAs": "Barry Heneghan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/dbsect_25",
          "debateSectionId": "dbsect_25",
          "showAs": "School Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/mul@/dbsect_25.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_93",
        "questionNumber": 93
      },
      "contextDate": "2025-12-11"
    }
  ]
}