{
  "head": {
    "counts": {
      "questionCount": 6669,
      "resultCount": 6669
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Ireland for Finance is a whole-of-government strategy for the development of the international financial services sector in Ireland. In line with Programme for Government commitments, the Department of Finance has commenced work on a new Ireland for Finance Strategy to be published in H1 2026.  Significant engagement and consultation has and will continue to take place to inform this work, including a public consultation held earlier this year which received 57 written submissions, input from the standing quarterly Ireland for Finance Joint Committee forum, and a wide range of bilateral, national and international stakeholder engagements. While the strategy is still under development, how to best support enhanced retail investment activity in Ireland, including the matter of deemed disposal, is a topic that has been raised during these engagements.  The development of a strong international financial services sector has been a key part of Ireland’s industrial policy since the 1980s, and the new whole-of government Ireland for Finance strategy will be another integral part of this.  At the end of 2024, the state enterprise agencies, Enterprise Ireland and IDA Ireland, estimated that around 60,100 people are now in direct employment in the international financial services sector.  I am committed to supporting Irish investors in leveraging the benefits of the sector. I am aware of the position of a number of stakeholders in relation to the taxation of retail investment and the application of deemed disposal in particular. It is important to ensure that any changes in this area achieve the balance between the supporting retail investment and maintaining appropriate anti-avoidance protections.  In terms of recent developments, a reduction from 41% to 38% in the taxation rate that applies to Irish and equivalent offshore funds and Irish and certain foreign life assurance products was announced in Budget 2026. This is an important first step.  I am conscious of the need to ensure that retail investment is encouraged. Work is continuing on the development of the roadmap for the taxation of retail investment, as announced in budget 2026. The roadmap is to be published early next year and will set out an approach to simplify and adapt the tax framework to further support retail investment while retaining necessary and important anti-avoidance protections in a proportionate manner. This roadmap will facilitate due consideration of the Funds Sector 2030 Report and take into account the European Commission’s recommendation on Savings and Investment Accounts.  Given the composition of the financial services sector in Ireland and its role as a gateway to Europe for global firms, Ireland has a significant role to play in achieving both EU and Irish policy goals, including in the Savings and Investments Union. This will include activity progressed under the new Ireland for Finance strategy when completed.  I am committed to taking the necessary action to support retail investment in Ireland and believe that further progress can be made to address some of the existing obstacles to greater retail investment in the coming years within the usual Budget and Finance Bill processes. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 183. Deputy Sean Fleming asked the Tánaiste and Minister for Finance for if the new Ireland for Finance strategy will address the issue of deemed disposal; and if he will make a statement on the matter. [72575/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_198",
          "debateSectionId": "dbsect_198",
          "showAs": "Fiscal Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_198.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_183",
        "questionNumber": 183
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 188, 213 and 245 together.  The Deputy has asked about the taxation regime for Exchange Traded Funds (ETFs). An ETF is a collective investment fund that is traded on a regulated stock exchange. There is no separate taxation regime specifically for ETFs. The domicile of the ETF will generally determine whether the ETF falls within the domestic gross roll-up regime or the offshore funds regime.  In general, for exit taxes applying to investment funds, the investment fund calculates and deducts any exit tax due, including for deemed disposal. However, where units in an investment fund are traded and cleared on a recognised clearing system, investors are required to calculate, return and pay the income tax on the income and gains arising from their investment in the fund on a self-assessed basis, as the fund does not have the information necessary to apply an exit tax. Investors in offshore funds also have to account for tax due through Revenue’s self-assessment system. Therefore, self-assessment applies to most ETF investments.  I am aware that the current system for the taxation of investments is complex and that the requirement for self-assessment for ETFs can contribute to this. I am committed to taking the necessary action to support retail investment in Ireland and recognise the importance of this sector. The reduction in the taxation rate that applies to Irish and equivalent offshore funds, and Irish and certain foreign life assurance products, from 41% to 38% announced in Budget 2026 is an important first step in this regard. This reduction applies to ETFs that fall within these taxation regimes.  However, I am conscious of the need for continued engagement on this issue. Budget 2026 also included a commitment to publish a roadmap for the taxation of retail investment. The roadmap is to be published early next year and will set out an approach to simplify and adapt the tax framework to further support retail investment while retaining necessary and important anti-avoidance protections in a proportionate manner, and existing legislation is being considered as part of the process of developing the roadmap.   This roadmap will facilitate due consideration of the Funds Sector 2030 Report and take into account the European Commission’s recommendation on Savings and Investment Accounts. I hope further progress can be made across coming budgets to address some of the existing obstacles to greater retail investment. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 245. Deputy Sean Fleming asked the Tánaiste and Minister for Finance for an update on tax measures to incentivise retail investing in Ireland, particularly in relation to ETFs; and if he will make a statement on the matter. [72576/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_202",
          "debateSectionId": "dbsect_202",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_202.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_245",
        "questionNumber": 245
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the planning, design and construction of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals.  Noting the above position, I have referred your question to TII for a direct reply regarding the Portlaoise Northern Orbital Route. Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 314. Deputy Sean Fleming asked the Minister for Transport the position regarding a proposed road, details supplied; and if he will make a statement on the matter.  [73315/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_318",
          "debateSectionId": "dbsect_318",
          "showAs": "Road Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_318.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_314",
        "questionNumber": 314
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  RZLT was first charged on 1 February 2025 and therefore there were no receipts prior to 2025.  RZLT is an annual tax, calculated at a rate of 3% of the market value of the land within its scope, known as a relevant site. Relevant sites are identified by reference to maps published by local authorities, which are revised on an annual basis, and reflect land that the local authority has determined meets the relevant criteria for the tax, being that the land is zoned for residential or mixed-use (including residential) purposes and that it is serviced. Owners of such land, including local authorities, are required to register and pay the tax by 23 May each year.  I am advised by Revenue that information in respect of the amount of residential zoned land tax collected to date, including collections from local authorities, is published on the Revenue website. Please see a link to the latest publication at: www.revenue.ie/en/corporate/documents/statistics/property-taxes/pt-stats-update-211025.pdf ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 365. Deputy Sean Fleming asked the Tánaiste and Minister for Finance to provide details in relation to the residential zoned tax paid by each local authority for the years 2021, 2022, 2023, 2024, and to date in 2025; and if he will make a statement on the matter. [73326/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_361",
          "debateSectionId": "dbsect_361",
          "showAs": "Tax Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_361.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_365",
        "questionNumber": 365
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  As previously advised to the Deputy in September, the Office of Public Works does not have any ongoing works or plans to undertake significant works at the Rock of Dunamase but continues to carry out routine maintenance.  It is the OPW's understanding that Laois County Council is currently working on the public car park, picnic area and landscaping adjacent to the monument. The OPW regrets that it cannot provide any specific details in relation to this programme of works.  The OPW is unsure to what the Deputy refers when referencing making the location safe and asks that his office contacts this organisation directly in this regard.  It is intended that management of hedgerows and cutting back of vegetation will be completed on site in Quarter 1 2026. This work will happen in adherence with legislation and as part of the maintenance scehdule for the site. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 388. Deputy Sean Fleming asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation to provide detailed information in relation to works carried out at a location (details supplied); and if he will make a statement on the matter. [73316/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_378",
          "debateSectionId": "dbsect_378",
          "showAs": "Office of Public Works",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_378.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_388",
        "questionNumber": 388
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Enterprise, Tourism and Employment  The Employment Permits system operates within the parameters set out in the Employment Permits Acts and Regulations. Under these provisions, certain occupations, including Dairy Farm Assistants, are subject to an annual quota.  The Employment Permits Regulations 2024 (Statutory Instrument No. 444/2024) established that, from 2nd September 2024, the maximum number of General Employment Permits that may be granted for Dairy Farm Assistants is 406. This quota has now been filled.  The applicant was informed on 01 December 2025, that the application was refused on this basis, and the associated fee is to be refunded. It is not possible to carry over applications in anticipation of the next quota being announced or to grant priority treatment to any individual application.  When the new quota opens, a new application submission will be required. Applications will be assessed in the order in which they are received and in accordance with the relevant statutory criteria.  My Department appreciates the challenges faced by employers in sourcing skilled workers and continues to keep the operation of the employment permits system under review to ensure that it meets the needs of the labour market while safeguarding the integrity of the system. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 401. Deputy Sean Fleming asked the Minister for Enterprise, Tourism and Employment if an application for a work permit be re-examined due to the urgent situation of the employer needing to employ this person (details supplied); and if he will make a statement on the matter. [73661/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_390",
          "debateSectionId": "dbsect_390",
          "showAs": "Work Permits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_390.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_401",
        "questionNumber": 401
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The furniture and equipment (F&E) area within my Department deals with the provision of furniture and equipment across a number of different streams including the replacement of specialist F&E, to which the issue the deputy has raised refers. As part of the planning for the provision of F&E generally, there has to be a balance between the volume of demand, and the ability of my Department to provide funding to meet this demand.  As part of business planning the F&E area identifies the main pressure points within the area and allocates resources accordingly. The provision of specialist equipment has been identified as a key area for focus in 2025 and it is anticipated that the area will focus on the progression of applications on hand, which will include the school in question. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 415. Deputy Sean Fleming asked the Minister for Education and Youth when funding will be approved for an application for furniture and equipment in the practical rooms in a school (details supplied); and if she will make a statement on the matter. [73291/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_401",
          "debateSectionId": "dbsect_401",
          "showAs": "School Equipment",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_401.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_415",
        "questionNumber": 415
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for students with special educational needs.  In order to support the NCSE and forward planning my department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE through the Parent Notify process that they are seeking a special educational placement for their child.  This notification process will provide the NCSE with critical information on children who continue to need a special class as they progress to post-primary level as well as details on students who require a place for the first time.  This year to facilitate earlier sanctioning of classes for the 2026/27 school year, an earlier date of 1 October was set for parents to complete the process. It is expected that many of these special classes will be sanctioned in the coming weeks.  The NCSE is undertaking analysis of information provided through the Parents Notify process which closed on 1 October to plot demand for special class places for the 2026/27 school year. The NCSE will also consider vacant places in existing special classes and places that will become available through the regular transition of children from primary to post-primary schools. Once this analysis is completed the NCSE will be equipped to engage with schools to open new special classes in relevant areas.  I would like to stress that the NCSE will continue to support all children and young people made known to them after 1 October in their existing placement with appropriate supports. However, it is critical that the NCSE has as much local information as possible, as early as possible, to effectively plan what new provision.  The NCSE remains available to provide advice and support to all families seeking specialist placement and will continue to examine where provision is required for the 2026/27 school year.  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 470. Deputy Sean Fleming asked the Minister for Education and Youth if a child will be facilitated in a school (details supplied); and if she will make a statement on the matter. [73676/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_444",
          "debateSectionId": "dbsect_444",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_444.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_470",
        "questionNumber": 470
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 491. Deputy Sean Fleming asked the Minister for Culture, Communications and Sport the dates the final payments were made to an organisation (details supplied) in respect of sports capital grants; and if he will make a statement on the matter.  [73396/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_464",
          "debateSectionId": "dbsect_464",
          "showAs": "Sports Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_464.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_491",
        "questionNumber": 491
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 492. Deputy Sean Fleming asked the Minister for Culture, Communications and Sport when the final payments in respect of sports capital grants will be paid to an organisation (details supplied); and if he will make a statement on the matter. [73398/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_465",
          "debateSectionId": "dbsect_465",
          "showAs": "Sports Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_465.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_492",
        "questionNumber": 492
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  A Stage 1 Capital Assistance Scheme (CAS) funding application submitted by Laois County Council for the development of a Domestic Violence Refuge in Portlaoise cannot be approved by my Department at this time. Unfortunately, the Approved Housing Body identified to bring the project forward is currently unable to meet essential funding criteria. The decision not to approve the application was notified to Laois County Council on 27 November last.  I understand Cuan, the State agency for Domestic, Sexual, and Gender Based Violence and Laois County Council are working with Laois Domestic Abuse Service to identify a new Approved Housing Body partner to advance this project. I expect a new CAS funding application to be submitted as a matter of urgency when this process is complete. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 515. Deputy Sean Fleming asked the Minister for Housing, Local Government and Heritage the date on which stage one of an application was approved by his Department; the next steps; an estimated completion date for this project (details supplied); and if he will make a statement on the matter. [73557/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_487",
          "debateSectionId": "dbsect_487",
          "showAs": "Domestic Violence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_487.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_515",
        "questionNumber": 515
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 523. Deputy Sean Fleming asked the Minister for Housing, Local Government and Heritage his views on a general scenario between a landlord and a tenant (details supplied); and if he will make a statement on the matter. [73666/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_494",
          "debateSectionId": "dbsect_494",
          "showAs": "Rental Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_494.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_523",
        "questionNumber": 523
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  My Department's Second Hand Acquisitions Programme provides funding to local authorities to support acquisitions for certain priority categories including:  • exits from homelessness,  • urgent responses for priority cohorts such as persons with physical or intellectual disabilities, older persons, care leavers, &c., and  • tenancy sustainment (tenant in situ).  First and foremost, only those households that qualify for social housing can be supported under the programme. Thereafter, it is a matter for respective local authorities to satisfy themselves as to the fit of supported households under one or other of the priority categories.  Support for second hand acquisitions is intended only to complement new build delivery of social housing by local authorities. Such acquisitions should only be used to address very urgent cases and should not be a standard response or first of call for local authorities. Ideally, social housing qualified households should be accommodated within a local authority's available housing stock, including the growing level of new build homes coming on stream each year.  I expect the 2026 Second Hand Acquisitions Programme to maintain support for these priority categories. Pending the notification of 2026 allocations local authorities can enter into commitments for 2026 to a value of up to 30% of their original 2025 acquisitions budget. This flexibility effectively provides for a multi-annual approach to programme delivery, facilitating local authorities to plan and progress acquisitions from one year to the next with a higher level of certainty vis-à-vis future funding availability. This flexibility provides Laois County Council with scope to commit in 2025 up tp €900,000 for acquisitions that will likely only to complete and drawdown in 2026. This includes acquisitions to support persons with disabilities, older person, exits from homelessness and tenancy sustainment via tenant in situ.  Individual local authority allocations for 2026, will be agreed and notified to local authorities early next year. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 525. Deputy Sean Fleming asked the Minister for Housing, Local Government and Heritage to outline the criteria guidelines, rules and regulations in relation to requirements by Local Authorities to purchase houses for people with special requirements; the total amount of funding provided to Laois County Council for 2026 for this purpose; the expected number of properties that can be purchased for these situations; and if he will make a statement on the matter. [73704/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_496",
          "debateSectionId": "dbsect_496",
          "showAs": "Housing Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_496.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_525",
        "questionNumber": 525
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 551. Deputy Sean Fleming asked the Minister for Social Protection his views on correspondence arising from Budget 2026 (details supplied); and if he will make a statement on the matter. [73589/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_523",
          "debateSectionId": "dbsect_523",
          "showAs": "Budget 2026",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_523.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_551",
        "questionNumber": 551
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  As Minister for Justice, Home Affairs and Migration, I have no role in the exercise of Probate functions. The Probate Office is an office of the High Court. Management of the courts, operational matters and logistical functions are the responsibility of the judiciary and Courts Service, which are independent in the exercise of their functions under the Courts Service Act 1998 and given the separation of powers in the Constitution.  To be of assistance, my officials have made enquiries with the Courts Service. The Courts Service have advised that the Kilkenny Office provides a probate service for 3 counties, Carlow, Laois and Kilkenny. At present the waiting time in Kilkenny is approximately 4 months. However, there are 21 cases that are over 6 months, due the Kilkenny Office having to return them for outstanding queries. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 561. Deputy Sean Fleming asked the Minister for Justice, Home Affairs and Migration the number of probate applications lodged in a probate office (details supplied) and waiting over six months to be completed; and if he will make a statement on the matter. [73384/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_534",
          "debateSectionId": "dbsect_534",
          "showAs": "Probate Applications",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_534.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_561",
        "questionNumber": 561
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  As this is a service matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 643. Deputy Sean Fleming asked the Minister for Health the number of people admitted to the Central Mental Hospital, and the number of persons discharged in 2024, as the information provided to date has been queried (details supplied); and if she will make a statement on the matter. [73339/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_617",
          "debateSectionId": "dbsect_617",
          "showAs": "Mental Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_617.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_643",
        "questionNumber": 643
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  As the Health Service Executive is responsible for the delivery of public healthcare infrastructure projects, I have asked the HSE to respond to you directly in relation to this matter. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 651. Deputy Sean Fleming asked the Minister for Health when planning and design will commence for a project and the estimated time for completion of this project (details supplied); and if she will make a statement on the matter. [73408/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_624",
          "debateSectionId": "dbsect_624",
          "showAs": "Departmental Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_624.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_651",
        "questionNumber": 651
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 655. Deputy Sean Fleming asked the Minister for Health the alternative options for a health centre which is being explored by the HSE in respect of the improvement works or an extension (details supplied); and if she will make a statement on the matter. [73431/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_628",
          "debateSectionId": "dbsect_628",
          "showAs": "Healthcare Infrastructure Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_628.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_655",
        "questionNumber": 655
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter I have asked the HSE to respond to the deputy as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 697. Deputy Sean Fleming asked the Minister for Health the number of activities carried out under a heading in the midlands region in 2024 and to date in 2025; the number of autopsies carried out in Mullingar, Tullamore and Portlaoise; the number of histologies carried out in each of the three hospitals; the number of consultants working on these works in each of these hospitals; and if she will make a statement on the matter. [73585/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_668",
          "debateSectionId": "dbsect_668",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_668.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_697",
        "questionNumber": 697
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  I recognise that the waiting times for Primary Care therapy services are too long and that there is an urgent need to improve timely access to services across the country.  The Health Service Executive (HSE) has advised that Primary Care therapy services are experiencing increased pressure due to an increase in referrals, alongside increasing complexity of presentations (leading to longer interventions), and challenges related to the recruitment and retention of health and social care professionals. The HSE further advised that efforts to recruit Primary Care Occupational Therapists in Laois/Offaly are ongoing and these posts are currently a high priority for senior management.  In response to the current challenges, I have asked the CEO of the HSE to put measures in place to scale-up successful local initiatives to the national level to address the Speech & Language Therapy, Physiotherapy, and Occupational Therapy waiting lists in order to reduce the waiting times for these three Primary Care therapies to less than 10 months. It is expected that between now and December 2026, over 60,000 people will be removed from these three waiting lists.  I expect that this initiative will result in a significant improvement on where we are now as waiting times for these three therapy services improve for all, including service users in County Laois. I would like to assure you that this Department will continue to engage with, and support, the HSE to address the current challenges in Primary Care therapy services. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 726. Deputy Sean Fleming asked the Minister for Health to reply to correspondence (details supplied); and if she will make a statement on the matter. [73689/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_698",
          "debateSectionId": "dbsect_698",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_698.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_726",
        "questionNumber": 726
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  Under the Health Act 2004, the Health Service Executive (HSE) is required to manage and deliver, or arrange to be delivered on its behalf, health and personal social services. The Minister for Health is prohibited from directing the HSE to provide a treatment or a personal service to any individual or to confer eligibility on any individual.In relation to the particular query raised, as this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 753. Deputy Sean Fleming asked the Minister for Health when an appointment will be made for a person (details supplied); and if she will make a statement on the matter. [73779/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_726",
          "debateSectionId": "dbsect_726",
          "showAs": "Hospital Appointments Status",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_726.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_753",
        "questionNumber": 753
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  I propose to take Questions Nos. 791 to 796, inclusive, together.  The Town and Village Renewal Scheme (TVRS) was introduced in 2016 and is one of a number of measures designed to rejuvenate rural towns and villages throughout Ireland. Almost €184 million has been allocated to over 1,800 projects since the launch of the scheme.  The 2025 Scheme was launched in March 2025 and places particular emphasis on projects that have a renewed focus on town centre economic and social recovery and regeneration.  The closing date for receipt of applications for the 2025 Main Scheme and the Project Development Measure was Friday 25 July 2025. I can confirm that applications have been submitted by Laois County Council in respect of each of the proposals referred to by the Deputy.  The Scheme is heavily subscribed, and all applications received are being assessed for suitability against scheme criteria and objectives. Other factors such as the geographical spread of projects, the quality of the proposed projects, and the available budget is also being considered to maximise the impact of this funding. The assessment process is nearing completion, and I expect to be in a position to announce the successful projects in the near future. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 791. Deputy Sean Fleming asked the Minister for Rural and Community Development and the Gaeltacht if grant funding can be provided to an applicant under the town and village renewal scheme (details supplied); and if he will make a statement on the matter. [73303/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_758",
          "debateSectionId": "dbsect_758",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_758.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_791",
        "questionNumber": 791
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  I propose to take Questions Nos. 791 to 796, inclusive, together.  The Town and Village Renewal Scheme (TVRS) was introduced in 2016 and is one of a number of measures designed to rejuvenate rural towns and villages throughout Ireland. Almost €184 million has been allocated to over 1,800 projects since the launch of the scheme.  The 2025 Scheme was launched in March 2025 and places particular emphasis on projects that have a renewed focus on town centre economic and social recovery and regeneration.  The closing date for receipt of applications for the 2025 Main Scheme and the Project Development Measure was Friday 25 July 2025. I can confirm that applications have been submitted by Laois County Council in respect of each of the proposals referred to by the Deputy.  The Scheme is heavily subscribed, and all applications received are being assessed for suitability against scheme criteria and objectives. Other factors such as the geographical spread of projects, the quality of the proposed projects, and the available budget is also being considered to maximise the impact of this funding. The assessment process is nearing completion, and I expect to be in a position to announce the successful projects in the near future. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 792. Deputy Sean Fleming asked the Minister for Rural and Community Development and the Gaeltacht if grant funding can be provided to an applicant under the town and village renewal scheme (details supplied); and if he will make a statement on the matter. [73304/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_758",
          "debateSectionId": "dbsect_758",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_758.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_792",
        "questionNumber": 792
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  I propose to take Questions Nos. 791 to 796, inclusive, together.  The Town and Village Renewal Scheme (TVRS) was introduced in 2016 and is one of a number of measures designed to rejuvenate rural towns and villages throughout Ireland. Almost €184 million has been allocated to over 1,800 projects since the launch of the scheme.  The 2025 Scheme was launched in March 2025 and places particular emphasis on projects that have a renewed focus on town centre economic and social recovery and regeneration.  The closing date for receipt of applications for the 2025 Main Scheme and the Project Development Measure was Friday 25 July 2025. I can confirm that applications have been submitted by Laois County Council in respect of each of the proposals referred to by the Deputy.  The Scheme is heavily subscribed, and all applications received are being assessed for suitability against scheme criteria and objectives. Other factors such as the geographical spread of projects, the quality of the proposed projects, and the available budget is also being considered to maximise the impact of this funding. The assessment process is nearing completion, and I expect to be in a position to announce the successful projects in the near future. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 793. Deputy Sean Fleming asked the Minister for Rural and Community Development and the Gaeltacht if grant funding can be provided to an applicant under the town and village renewal scheme (details supplied); and if he will make a statement on the matter. [73305/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_758",
          "debateSectionId": "dbsect_758",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_758.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_793",
        "questionNumber": 793
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  I propose to take Questions Nos. 791 to 796, inclusive, together.  The Town and Village Renewal Scheme (TVRS) was introduced in 2016 and is one of a number of measures designed to rejuvenate rural towns and villages throughout Ireland. Almost €184 million has been allocated to over 1,800 projects since the launch of the scheme.  The 2025 Scheme was launched in March 2025 and places particular emphasis on projects that have a renewed focus on town centre economic and social recovery and regeneration.  The closing date for receipt of applications for the 2025 Main Scheme and the Project Development Measure was Friday 25 July 2025. I can confirm that applications have been submitted by Laois County Council in respect of each of the proposals referred to by the Deputy.  The Scheme is heavily subscribed, and all applications received are being assessed for suitability against scheme criteria and objectives. Other factors such as the geographical spread of projects, the quality of the proposed projects, and the available budget is also being considered to maximise the impact of this funding. The assessment process is nearing completion, and I expect to be in a position to announce the successful projects in the near future. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 794. Deputy Sean Fleming asked the Minister for Rural and Community Development and the Gaeltacht if grant funding can be provided to an applicant under the town and village renewal scheme (details supplied); and if he will make a statement on the matter. [73306/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_758",
          "debateSectionId": "dbsect_758",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_758.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_794",
        "questionNumber": 794
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  I propose to take Questions Nos. 791 to 796, inclusive, together.  The Town and Village Renewal Scheme (TVRS) was introduced in 2016 and is one of a number of measures designed to rejuvenate rural towns and villages throughout Ireland. Almost €184 million has been allocated to over 1,800 projects since the launch of the scheme.  The 2025 Scheme was launched in March 2025 and places particular emphasis on projects that have a renewed focus on town centre economic and social recovery and regeneration.  The closing date for receipt of applications for the 2025 Main Scheme and the Project Development Measure was Friday 25 July 2025. I can confirm that applications have been submitted by Laois County Council in respect of each of the proposals referred to by the Deputy.  The Scheme is heavily subscribed, and all applications received are being assessed for suitability against scheme criteria and objectives. Other factors such as the geographical spread of projects, the quality of the proposed projects, and the available budget is also being considered to maximise the impact of this funding. The assessment process is nearing completion, and I expect to be in a position to announce the successful projects in the near future. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 795. Deputy Sean Fleming asked the Minister for Rural and Community Development and the Gaeltacht if grant funding can be provided to an applicant under the town and village renewal scheme (details supplied); and if he will make a statement on the matter. [73308/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_758",
          "debateSectionId": "dbsect_758",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_758.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_795",
        "questionNumber": 795
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  I propose to take Questions Nos. 791 to 796, inclusive, together.  The Town and Village Renewal Scheme (TVRS) was introduced in 2016 and is one of a number of measures designed to rejuvenate rural towns and villages throughout Ireland. Almost €184 million has been allocated to over 1,800 projects since the launch of the scheme.  The 2025 Scheme was launched in March 2025 and places particular emphasis on projects that have a renewed focus on town centre economic and social recovery and regeneration.  The closing date for receipt of applications for the 2025 Main Scheme and the Project Development Measure was Friday 25 July 2025. I can confirm that applications have been submitted by Laois County Council in respect of each of the proposals referred to by the Deputy.  The Scheme is heavily subscribed, and all applications received are being assessed for suitability against scheme criteria and objectives. Other factors such as the geographical spread of projects, the quality of the proposed projects, and the available budget is also being considered to maximise the impact of this funding. The assessment process is nearing completion, and I expect to be in a position to announce the successful projects in the near future. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 796. Deputy Sean Fleming asked the Minister for Rural and Community Development and the Gaeltacht if grant funding can be provided to an applicant under the town and village renewal scheme (details supplied); and if he will make a statement on the matter. [73309/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_758",
          "debateSectionId": "dbsect_758",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_758.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_796",
        "questionNumber": 796
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  I propose to take Questions Nos. 797 and 798 together.  The Outdoor Recreation Infrastructure Scheme (ORIS) provides funding under several measures for the development of new outdoor recreational infrastructure and for the necessary repair, enhancement or promotion of existing outdoor recreational infrastructure in countryside areas across Ireland. Since 2020, my Department has provided funding of over €2.6 million to support 48 projects in County Laois. In some cases, the projects funded may traverse lands in the ownership or management of the organisations referenced by the deputy. The full list of projects is available on my Department's website.  My Department has not received any direct applications through the Outdoor Recreation Infrastructure Scheme for the development or maintenance of recreational infrastructure from the organisations referenced by the deputy in the locations specified. My Department has a strategic partnership in place with both of the organisations referred to by the deputy for the development or maintenance of recreational facilities at various locations across the country. In recent years this would have included maintenance and repair work at Coillte sites such as Bishops Wood, Lacca, Cullahill, Emo Court, Glenbarrow, and Monicknew Recreation Area. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 797. Deputy Sean Fleming asked the Minister for Rural and Community Development and the Gaeltacht to provide details in respect of recreation sites and works carried out and planned to be carried out (details supplied); and if he will make a statement on the matter. [73327/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_759",
          "debateSectionId": "dbsect_759",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_759.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_797",
        "questionNumber": 797
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  I propose to take Questions Nos. 797 and 798 together.  The Outdoor Recreation Infrastructure Scheme (ORIS) provides funding under several measures for the development of new outdoor recreational infrastructure and for the necessary repair, enhancement or promotion of existing outdoor recreational infrastructure in countryside areas across Ireland. Since 2020, my Department has provided funding of over €2.6 million to support 48 projects in County Laois. In some cases, the projects funded may traverse lands in the ownership or management of the organisations referenced by the deputy. The full list of projects is available on my Department's website.  My Department has not received any direct applications through the Outdoor Recreation Infrastructure Scheme for the development or maintenance of recreational infrastructure from the organisations referenced by the deputy in the locations specified. My Department has a strategic partnership in place with both of the organisations referred to by the deputy for the development or maintenance of recreational facilities at various locations across the country. In recent years this would have included maintenance and repair work at Coillte sites such as Bishops Wood, Lacca, Cullahill, Emo Court, Glenbarrow, and Monicknew Recreation Area. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 798. Deputy Sean Fleming asked the Minister for Rural and Community Development and the Gaeltacht to provide details in respect of recreation sites and works carried out and planned to be carried out (details supplied); and if he will make a statement on the matter. [73328/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_759",
          "debateSectionId": "dbsect_759",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_759.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_798",
        "questionNumber": 798
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 182 and 183 together.  I have been informed by Revenue that questions regarding arrangements between Revenue and the Department of Social Protection regarding the notification of commencements of the State pension are more appropriate for my colleague, the Minister for Social Protection. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 182. Deputy Sean Fleming asked the Tánaiste and Minister for Finance the number of notifications received (details supplied) in each year since 2020 to date in 2025; and if he will make a statement on the matter. [73213/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_175",
          "debateSectionId": "dbsect_175",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_175.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_182",
        "questionNumber": 182
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 182 and 183 together.  I have been informed by Revenue that questions regarding arrangements between Revenue and the Department of Social Protection regarding the notification of commencements of the State pension are more appropriate for my colleague, the Minister for Social Protection. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 183. Deputy Sean Fleming asked the Tánaiste and Minister for Finance the arrangements/protocol between the Revenue Commissioners and the Department of Social Protection (details supplied); and if he will make a statement on the matter. [73216/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_175",
          "debateSectionId": "dbsect_175",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_175.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_183",
        "questionNumber": 183
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The Department of Social Protection issues a weekly report to the Revenue Commissioners advising of taxable payments that issued to State Pension (contributory) recipients.  This weekly report includes year to date amounts and highlights when payments have issued for previous tax years.  The table below includes the number of customers who have been awarded State Pension (contributory) from 01/01/2020 to 31/10/2025.  Table 1: Annual number of people awarded State Pension (contributory)     -    2020    2021    2022    2023    2024    2025      SPC Awarded    17,155    19,220    18,776    21,096    18,423    26,500       I hope this clarifies the position for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 320. Deputy Sean Fleming asked the Minister for Social Protection the number of notifications being issued by his Department in each year from 2020,to date in 2025 (details supplied); and if he will make a statement on the matter. [73253/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_284",
          "debateSectionId": "dbsect_284",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_284.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_320",
        "questionNumber": 320
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 393. Deputy Sean Fleming asked the Minister for Health the current position in relation to a facility under the HSE (details supplied); and if she will make a statement on the matter. [72803/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_345",
          "debateSectionId": "dbsect_345",
          "showAs": "Hospital Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_345.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_393",
        "questionNumber": 393
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Defence  There is currently an extensive programme of investment in accommodation for serving Defence Forces personnel across all military installations. Since the launch of the Infrastructure Development Plan in January 2020, numerous accommodation projects, at a combined cost of approximately €49.7m, have been completed and provided 775 beds.  In terms of the Defence Forces residential housing stock, there are currently three (3) properties which are vacant and require a medium level of refurbishment. A further eighty (80) residential properties are uninhabitable and none of these properties can be brought up to a habitable standard without significant work, and many were built prior to the introduction of building regulations. As such, considerable work is needed to bring them up to modern standards. My officials are engaged with the Defence Forces to have these projects included into the existing infrastructure development plan. It is intended to begin the procurement phase for this refurbishment programme in 2026.   Question No. 145 answered with Question No. 122.  ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 144. Deputy Sean Fleming asked the Minister for Defence her views on whether much of the Defence Forces housing stock is badly in need of repair; and if she will make a statement on the matter. [71651/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_83",
          "debateSectionId": "dbsect_83",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_83.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_144",
        "questionNumber": 144
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  I can confirm that officials in my Department, including in the relevant Irish mission, are aware of this case and are providing consular assistance.  As with all consular cases, a dedicated consular officer has been assigned to the family of the Irish citizen who is missing and they remain in contact. The consular officer has provided support and advice to the citizen and their family in accordance with the Department’s Consular Assistance Charter.  I wish to assure the Deputy that officials in my Department will continue to provide all appropriate consular assistance to the citizen. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 171. Deputy Sean Fleming asked the Minister for Foreign Affairs and Trade if she will review the case of a missing Irish person in Gran Canaria (details supplied); and if she will make a statement on the matter. [71721/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_105",
          "debateSectionId": "dbsect_105",
          "showAs": "Missing Persons",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_105.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_171",
        "questionNumber": 171
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The principle of abatement of a public service pension is longstanding within the rules of various public service pension schemes, and pension abatement is an important aspect of the Public Service Pensions (Single Scheme and Other Provisions) Act 2012 (the “2012 Act”).  As per Section 52 of the 2012 Act, where an individual in receipt of a public service pension is appointed to work in a public service body, their pension will be subject to abatement. Prior to this, abatement applied only to individuals who returned to work in the same sector from which they were receiving their pension. Section 52(1)-(5) were commenced on 1 November 2012, and applied to all appointments after that date.  As such, anyone who was in receipt of a public service pension, who was appointed to a role in the public service (outside of the sector from which they receive their pension) prior to that date, is not subject to abatement in respect of that role.  Circular 24/2022 provides further guidance on the application of abatement under the 2012 Act. Please note that as per Section 6 of Circular 24/2022, if the individual takes up a new role (other than under compulsory re-deployment, temporary \"acting-up\", or secondment), is promoted, or takes up a position in a new body, this constitutes a new appointment, and the individual will be subject to abatement in that appointment. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 392. Deputy Sean Fleming asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the employees which are covered under the legislation that came into effect on 1 January 2013 regarding pension abatement for the public service, and in relation to a case specifically (details supplied); and if he will make a statement on the matter. [72284/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_291",
          "debateSectionId": "dbsect_291",
          "showAs": "Pension Provisions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_291.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_392",
        "questionNumber": 392
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  My Department has received an initial enquiry from South Dublin County Council regarding the potential leasing of existing social housing units - developed with the support of Departmental funding - to an alternative care provider operating within the wider disability sector. The purpose of the proposal is to ensure the continued use of these units as supported or social housing.  My Department is currently examining the details of the request. Once this assessment has been completed, my Department will revert to the local authority with its observations and any further required guidance in due course. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 575. Deputy Sean Fleming asked the Minister for Housing, Local Government and Heritage when he will give approval to the HSE to occupy apartments for people in their care (details supplied); and if he will make a statement on the matter. [71917/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_454",
          "debateSectionId": "dbsect_454",
          "showAs": "Health Service Executive",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_454.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_575",
        "questionNumber": 575
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I can advise the Deputy that the Join Family visa application referred to was created on 21 August 2025. Supporting documentation was received in the Canberra office on 28 August 2025. The application was received in the Dublin Visa Office on 15 September 2025 where it awaits examination and processing.  My Department's business target for join family visa applications is 12 months. It must be made clear that these are business targets for the immigration service and some applications can take longer than others. The business target reflects the detailed and often complex assessment that is required to be carried out in relation to applications for family reunification.  While I acknowledge the personal difficulties an applicant might be experiencing; it is not possible to give a definitive date as to when this application will be finalised. All applications are processed in chronological order, based on date order of receipt.  While every effort is made to process applications as soon as possible, processing times will vary having regard to the volume and complexity of applications, the possible need for the Immigration Service Delivery function of my Department to investigate, inquire into, or seek further information, and the resources available.  The current processing times for Dublin visa decisions is available here: www.irishimmigration.ie/visa-decisions/ .  The date published on the website is the oldest date of application currently being processed under a given category. However, it should be noted that the Visa team continue to process and make decisions on applications received after the published processing date. If a particular application takes longer to consider this may result in the published processing date remaining unchanged. I can assure you that this does not indicate the processing of these applications has halted overall.  I am acutely aware that join family applications are very important for the people impacted. I understand that people are eager to have their families join them in Ireland, and I am committed to improving the service my Department provides.  The person concerned can now directly check the status of their visa application on the Immigration Service’s Customer Service Portal. They can register for, or log in to their existing account, at: www.portal.irishimmigration.ie/en/  As an Oireachtas member, you can also request the status of individual immigration cases by e-mail, using the Oireachtas Mail facility at: IMoireachtasmail@justice.ie, which has been specifically established for this purpose. This service enables up to date information on such cases to be obtained without the need to seek information by way of the Parliamentary Question process. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 722. Deputy Sean Fleming asked the Minister for Justice, Home Affairs and Migration his views on correspondence (details supplied) regarding visa processing times; and if he will make a statement on the matter. [72030/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_572",
          "debateSectionId": "dbsect_572",
          "showAs": "Visa Applications",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_572.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_722",
        "questionNumber": 722
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I can advise the Deputy that the Join Family visa application referred to was created on 21 June 2024. Supporting documentation was received in the Manila office on 25 July 2024. The application was received in the Dublin Visa Office on 25 July 2024 where it awaits examination and processing.  My Department's business target for join family visa applications is 12 months. It must be made clear that these are business targets for the immigration service and some applications can take longer than others. The business target reflects the detailed and often complex assessment that is required to be carried out in relation to applications for family reunification.  While I acknowledge the personal difficulties an applicant might be experiencing; it is not possible to give a definitive date as to when this application will be finalised. All applications are processed in chronological order, based on date order of receipt.  While every effort is made to process applications as soon as possible, processing times will vary having regard to the volume and complexity of applications, the possible need for the Immigration Service Delivery function of my Department to investigate, inquire into, or seek further information, and the resources available.  The current processing times for Dublin visa decisions is available here:  www.irishimmigration.ie/visa-decisions/  The date published on the website is the oldest date of application currently being processed under a given category. However, it should be noted that the Visa team continue to process and make decisions on applications received after the published processing date. If a particular application takes longer to consider this may result in the published processing date remaining unchanged. I can assure you that this does not indicate the processing of these applications has halted overall.  I am acutely aware that join family applications are very important for the people impacted. I understand that people are eager to have their families join them in Ireland, and I am committed to improving the service my Department provides.  The person concerned can now directly check the status of their visa application on the Immigration Service’s Customer Service Portal. They can register for, or log in to their existing account, at: https://portal.irishimmigration.ie/en/  As an Oireachtas member, you can also request the status of individual immigration cases by e-mail, using the Oireachtas Mail facility at: [ IMoireachtasmail@justice.ie ], which has been specifically established for this purpose. This service enables up to date information on such cases to be obtained without the need to seek information by way of the Parliamentary Question process. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 734. Deputy Sean Fleming asked the Minister for Justice, Home Affairs and Migration the position regarding a visa application by a person (details supplied); and if he will make a statement on the matter. [72161/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_584",
          "debateSectionId": "dbsect_584",
          "showAs": "Visa Applications",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_584.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_734",
        "questionNumber": 734
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  My Department received an Environmental Impact Assessment (EIA) screening application, which was submitted by an advisor on behalf of the applicants named in this Parliamentary Question. On examination my Department concluded that the application did not fall under the remit of EIA (Agriculture) Screening.  The permission/consent that the applicants are seeking is an Activity Requiring Consent (ARC) in respect of designated land and which is administered by the National Parks and Wildlife Services (NPWS) section of the Department of Housing, Local Government and Heritage. The applicant's advisor and the NPWS were informed of this decision. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 800. Deputy Sean Fleming asked the Minister for Agriculture, Food and the Marine when an application for an EIA screening decision will be approved (details supplied); and if he will make a statement on the matter. [72205/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_624",
          "debateSectionId": "dbsect_624",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_624.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_800",
        "questionNumber": 800
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the HSE to reply to the Deputy directly as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1018. Deputy Sean Fleming asked the Minister for Health when the practice support grant will be paid to a doctor (details supplied); and if she will make a statement on the matter. [72099/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_831",
          "debateSectionId": "dbsect_831",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_831.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1018",
        "questionNumber": 1018
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I propose to take Questions Nos. 22, 23, 29, 32, 38, 54, 57, 66, 74, 78, 79 and 80 together.  Last week, the Government published the Accelerating Infrastructure Report and Action Plan. This is a comprehensive programme of actions designed to speed up the delivery of critical infrastructure across the State. This Action Plan responds to well-documented challenges of lengthy development timelines, fragmented processes, and rising costs. These have all been identified as major barriers to achieving Ireland’s housing, energy, and climate objectives.  The report is evidence-based. It has been built on the research and analysis of my Department, the views received during the public consultation and stakeholder engagement undertaken by my Department over the summer, and the expert input and advice from the members of the Accelerating Infrastructure Taskforce.  The Plan sets out 30 targeted actions grouped under four pillars, each addressing a key area of reform. The actions address the twelve barriers to the timely delivery of infrastructure that were highlighted in the Report on Stakeholder Consultation and Engagement with Emerging Themes on Infrastructure , published by my department in July.  A four-week online and in-person public consultation last summer supported the preparation of that Report published in July, by providing an opportunity for stakeholders and the general public, from across the country, to feed into this work. I hosted events during this consultation period, including a regional event in Athlone.  The actions selected represent a transformative approach to streamlining development processes and significantly reducing delivery timelines, ensuring a more efficient and timely delivery of critical infrastructure nationwide.  Together, these actions will ensure that the record investment under the National Development Plan (NDP) translates into faster, more efficient delivery of housing, energy, and transport infrastructure, supporting Ireland’s economic growth, climate commitments and Delivering Homes, Building Communities. This will benefit every county and region of Ireland as infrastructure projects play an essential role in supporting Ireland’s balanced economic growth across all local areas and meeting the demands of a rapidly expanding population. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 54. Deputy Sean Fleming asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the way in which the new infrastructure plan will accelerate the delivery of critical infrastructure in the midlands; and if he will make a statement on the matter. [70487/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_67",
          "debateSectionId": "dbsect_67",
          "showAs": "Strategic Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_67.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_54",
        "questionNumber": 54
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  As Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitisation I am responsible for setting the overall capital allocations across Departments and for monitoring monthly expenditure at Departmental level.  In the 2021 NDP review, the Government originally committed €165 billion in capital investment for the period 2021-30, and subsequently agreed to additional funding of €2.25 billion in March 2024 for 2024-2026.  The revised National Development Plan, published in July, set out €275.4 billion in public capital investment to 2035 – the largest and most significant capital injection in our economy in the history of the State. Following the agreement of the revised NDP in July 2025, annual sectoral capital allocations have been agreed for departments for 2026 to 2030. Each Minister is responsible for deciding on the priority programmes and projects that will be delivered under their remit within the NDP and for setting out the timelines for delivery.  Following the agreement of annual sectoral capital allocations in the NDP Review, Departments have been publishing their sectoral plans of the capital projects and programmes to be prioritised within their NDP allocation. In setting out their plans, Departments are required to outline how their investment plans support the National Planning Framework (NPF) objectives they are responsible for. Compact Growth is national strategic outcome 1 in the NPF and is supported by strategic investment priorities, primarily Housing and Sustainable Urban Development.  Delivering Homes, Building Communities is the Government's Action Plan on housing supply and targeting homelessness and is aligned with the NPF. The plan notes that zoning sufficient land is a key enabler for the NPF's objective of ensuring sustainable compact growth for future development in Ireland. The NPF enables a plan-led and joined up approach to compact growth with investment in housing and transport links to unlock delivery at scale.  As part of the NDP Review, over €28 billion in exchequer funding was allocated to the Department of Housing for investment (excluding investment in Water), which is the largest Housing budget in the history of the state. In addition, the prioritisation of housing-enabling infrastructure sectors of water, energy and transport supports the objective of the Review and of the Housing Plan, to enable the delivery of 300,000 additional homes by 2030. The combination of record levels of funding and central coordination of the delivery of infrastructure in these critical sectors will support a joined up and plan-led approach to unlock compact growth and delivery at scale. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 64. Deputy Sean Fleming asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the progress made to date under National Strategic Outcome (NSO) 1 of the National Development Plan 2021-2030; the additional funding allocated under this NSO following the review of the NDP;; and if he will make a statement on the matter. [70488/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_104",
          "debateSectionId": "dbsect_104",
          "showAs": "National Development Plan",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_104.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_64",
        "questionNumber": 64
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  I have outlined on several occasions that I want to make improvements to student supports that are equitable, funded and fair, and which bring certainty to families.  I was, therefore, delighted in Budget 2026 to be in a position to make real, permanent changes to support students from all backgrounds and to reduce the cost of education.  • I increased all non-adjacent maintenance grant rates under the Student Grant Scheme, (administered by SUSI) by at least €200 effective from September 2026 with a pro-rata benefit for students this academic year. This benefits PLC/Undergraduate and Postgraduate Students whose normal residence is 30km or more from their institution.  • I reduced the Student Contribution Charge for free fees eligible students permanently by €500 supporting around 108,000 undergraduate students.  • I also permanently reduced the contribution fee for 14,000 apprentices in higher education by 17%, recognising their unique role in Ireland’s economic future.  • I permanently increased the Post Graduate Fee Contribution Grant by €500 from €4,000 to €4,500 for eligible students.  • From January 2026, I am increasing FET learner allowances in line with social welfare rates.  In addition, students in the 2026/27 academic year will benefit from the following improvements: -  • The Special Rate of Maintenance Threshold will increase from €27,400 to €28,600 in line with Social Welfare increases supporting students who are from socio-economically disadvantaged backgrounds.  • The income threshold for the €500 student contribution will increase from €115,000 to €120,000 effective from September 2026. Combined with the permanent fee reduction, this means that eligible undergraduate students whose households earning are under €120,000 will pay no more than €2,000 towards the student contribution charge in the 26/27 academic year.  I recognise that students also need support beyond financial assistance and importantly I secured in Budget 2026:-  • €1 million for student mental health and healthy campus initiatives - supporting wellbeing across higher education institutions; and  • €3 million in additional funding for students with disabilities supporting over 22,000 further and higher education students and building a more inclusive education system.  I am also very happy to announce that I am increasing the Student Assistance Fund for 2025/26 by over €10.2million, bringing the fund to over €19.3 million for this academic year, which exceeds the amount allocated last year.  I am committed to ensuring that cost is never a barrier to education and this increase in funding will benefit the most vulnerable students who may be struggling with the cost of attending Higher Education. I encourage any student experiencing financial hardship to contact their college’s Access Office to learn more about this important support. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 220. Deputy Sean Fleming asked the Minister for Further and Higher Education, Research, Innovation and Science the way in which recent budget reforms to student supports, including the SUSI system and cost-of-education measures, reflect his approach to targeted support for learners from all backgrounds. [67827/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_232",
          "debateSectionId": "dbsect_232",
          "showAs": "Further and Higher Education",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_232.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_220",
        "questionNumber": 220
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science (Deputy James Lawless)  In advance of the new Student Accommodation Strategy, our immediate priority has been to increase the supply of purpose-built student accommodation and ensure affordability for students from priority groups. Under the Short-Term Activation Programme, the initial target was to deliver over 1,000 additional student beds. Following due diligence and value-for-money assessments, the revised total now stands at 967 beds that have either been delivered or are progressing.  Maynooth University has successfully completed its 116-bed project. University College Dublin is advancing its 493-bed development, with approval to proceed to construction given in September 2025. Trinity College Dublin’s project is progressing towards tender stage this year. These developments will provide additional capacity in the short term. The Dublin City University 405-bed project will not be progressed at this time, reflecting cost and value-for-money considerations.  In parallel, the Technological Sector Student Accommodation Programme, or TSSAP, is supporting technological universities to expand student accommodation. Phase 1, completed in 2025, generated 53 strategic proposals for future developments, while Phase 2 will develop preliminary business cases, including financial and operational models. This will ensure that future projects are strategically aligned, financially viable, and responsive to local demand.  I will publish the new Student Accommodation Strategy 2025–2035 shortly. It will prioritise increasing supply and enhancing affordability for students facing the greatest financial challenges. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 241. Deputy Sean Fleming asked the Minister for Further and Higher Education, Research, Innovation and Science the outcomes of the various student accommodation programmes he has initiated, including the student accommodation strategy, to date, and how these investments are improving affordability and regional balance in higher-education provision. [67828/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_254",
          "debateSectionId": "dbsect_254",
          "showAs": "Student Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_254.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_241",
        "questionNumber": 241
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The Wage Subsidy Scheme is a key disability employment support. It aims to encourage employers to offer substantial and sustainable employment to people with disabilities through a subsidy. It supports the employer to cover the costs of significantly adapting the job’s tasks or role.  As a result of Budget 2026, the base rate of the Wage Subsidy Scheme will be increased by €1.20 from €6.30 to €7.50 per hour from April 2026, the top rate to €10 per hour and a middle rate of €8.50 will be in place. These are the first rate increases since 2022.  Employers in all bands will see an increase in the subsidy they receive under the scheme. 90% of employers employ 1-2 employees on the scheme and will therefore receive the €1.20 increase.  Expenditure on the scheme was €23.4 million in 2024. The budget measure to increase rates is estimated to cost an additional €3.1 million in 2026 and €4.1 million in a full year. It is estimated that 1,500 employers and 2,500 employees will benefit in 2026.  As outlined in the details provided by the Deputy, some of the bigger employers had hoped for larger increases in the Wage Subsidy Scheme rates. These are employers on the higher rates of subsidy due to the number of employees they have covered by the scheme.  The six largest employers availing of the Wage Subsidy Scheme received a combined total of almost €4 million or 17% of the total expenditure on the scheme in 2024.  I acknowledge the additional support costs that being a large-scale employer of disabled people may bring. This is why an employer who employs 25 or more employees on the Wage Subsidy Scheme can avail of a grant of €30,000 towards the cost of employing an Employment Assistance Officer. Up to five such officers can be covered per company depending on the number of employees on the scheme. This grant is provided so these officers can assist the relevant employees with their needs in employment and support employers who employ a large number of disabled people.  As part of Budget 2026, the PRSI bands have been increased to ensure that those working full-time on the new National Minimum Wage will fall into the lower band for employer PRSI.  Budget 2026 has also provided for the expansion of Wage Subsidy Scheme to people who acquire a disability while in employment, those who have a progressive or degenerative condition that worsens and to those who transfer from Invalidity Pension to Partial Capacity Benefit.  I trust this clarifies the matter for the Deputy.   ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 237. Deputy Sean Fleming asked the Minister for Social Protection if he will respond to correspondence (details supplied); and if he will make a statement on the matter. [70610/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_188",
          "debateSectionId": "dbsect_188",
          "showAs": "Question Heading for question(s)  237",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_188.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_237",
        "questionNumber": 237
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The Deputy has asked about deemed disposal and ETFs.  Deemed disposal is an anti-avoidance measure that applies to investments in Irish domiciled investment funds and life assurance products, as well as equivalent offshore funds and certain foreign life assurance products. Under the deemed disposal rule, tax is levied eight years after an investment is made, and every subsequent eight years, regardless of whether or not a disposal has in fact occurred. The tax is levied on any gain in the value of the investment from the date of acquisition to the date of the deemed disposal. On the ultimate disposal of the investment, any tax paid is allowed as a credit against the final tax liability. The purpose of deemed disposal is to prevent the indefinite roll-up of income and gains and the associated loss of tax to the Exchequer.  I am aware of the position of a number of stakeholders in relation to the taxation of retail investment and the application of deemed disposal in particular.  I am committed to taking the necessary action to support retail investment in Ireland. As an important and positive first step in encouraging and supporting retail investment, in line with goals of the EU Savings and Investment Union, Budget 2026 included a reduction in the taxation rate that applies to Irish and equivalent offshore funds, and Irish and certain foreign life assurance products, from 41% to 38%.  However, I am very conscious of the continued concern of retail investors. Work will continue on the roadmap announced in Budget 2026. The roadmap is to be published early next year and will set out an approach to simplify and adapt the tax framework, to further support retail investment while retaining necessary and important anti-avoidance protections in a proportionate manner. This roadmap will facilitate due consideration of the Funds Sector 2030 Report and take into account the European Commission’s recommendation on Savings and Investment Accounts. I hope further progress can be made across coming budgets to address some of the existing obstacles to greater retail investment. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 319. Deputy Sean Fleming asked the Tánaiste and Minister for Finance if he will respond to correspondence (details supplied) regarding EFTs through the deemed disposal rule; and if he will make a statement on the matter. [69948/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_285",
          "debateSectionId": "dbsect_285",
          "showAs": "Departmental Correspondence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_285.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_319",
        "questionNumber": 319
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school to which the Deputy refers submitted an application for funding under the Emergency Works Scheme (EWS) for external environment works.  As the Deputy may be aware, the purpose of the Emergency Works Scheme (EWS) is to provide funding specifically for unforeseen emergencies. It does so by ensuring the availability of funding for urgent works to those schools that are in need of resources as a result of an emergency situation.  An emergency is deemed to be a situation which poses an immediate risk to health, life, property, or the environment, which is sudden, unforeseen and requires immediate action, and in the case of a school, if not corrected would prevent the school or part thereof from opening.  The EWS operates on the basis of a minimal scope works only to address the emergency situation. The EWS is intended to remedy an emergency situation and usually provides only an interim measure until a permanent solution can be delivered under the Summer Works Scheme (SWS) which deals with upgrade works to the school.  The school's original application was refused as the application did not fit the remit of the Emergency Works Scheme. However, the option remains open to the school to appeal this decision. Appeals will only be considered if additional relevant information that was not provided as part of the original application is submitted to the EWS team. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 408. Deputy Sean Fleming asked the Minister for Education and Youth when emergency works can be carried out for a school (details supplied); and if she will make a statement on the matter. [69475/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_365",
          "debateSectionId": "dbsect_365",
          "showAs": "School Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_365.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_408",
        "questionNumber": 408
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The purpose of the Climate Action Summer Works Scheme (CASWS) is to enable individual school authorities to undertake small-scale building works on a devolved basis that, ideally, can be carried out during the summer months or at other times that avoid disrupting the operation of the school. The CASWS operates on a multi-annual basis across a number of categories of works.  It is envisaged that approvals in any given year will involve a spread of categories rather than the traditional single category at a time. This is aimed at managing market capacity and maximising value for money opportunities for school authorities.  The CASWS will operate on a multi-annual basis. In November 2025, my colleague the former Minister of Education and Youth, Helen McEntee TD, announced the first tranche of approvals under the new Climate Action Summer Works Scheme. 297 projects were approved to proceed and involve primary, post primary and special schools, along with projects in all counties and across all categories of works.  My Department can confirm an application was received from the school in question however the school was not on the list of approvals in the first tranche. Given that funding is limited in any particular year it is necessary to prioritise applications. Under the new CASWS which operates on a multi annual basis, like previous summer works schemes, applications from schools that are not reached for funding or market prioritisation reasons in 2026 will qualify to be assessed for purposes of the funding available for climate action summer works in subsequent years.  An announcement on the CASWS approvals for the 2027 calendar year will be issued in due course.  Full details of the of the announcement and the list of schools approved in the first tranche, the Circular (0029/2025) for the scheme and guidance documents for schools can be found at the below link; www.gov.ie/en/department-of-education/services/summer-works-scheme/. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 430. Deputy Sean Fleming asked the Minister for Education and Youth if she will respond to correspondence (details supplied); and if she will make a statement on the matter. [69983/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_383",
          "debateSectionId": "dbsect_383",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_383.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_430",
        "questionNumber": 430
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for children with special educational needs. The NCSE actively encourage expressions of interest from schools to open special classes, and I appreciate and commend the efforts taken by boards of management in expressing their interest.  In order to support the NCSE and forward planning my department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE through the Parent Notify process that they are seeking a special educational placement for their child.  This notification process will provide the NCSE with critical information on children who continue to need a special class as they progress to post-primary level as well as details on students who require a place for the first time.  This year to facilitate earlier sanctioning of classes for the 2026/27 school year an earlier date of 1 October was set for parents to complete this process. It is the aim of the NCSE to sanction the majority of new special classes by 31 December 2025.  The NCSE is undertaking analysis of information provided through the Parents Notify process which closed on 1 October to plot demand for special class places for the 2026/27 school year. The NCSE will also consider vacant places in existing special classes and places that will become available through the regular transition of children from primary for post-primary schools. Once this analysis is completed the NCSE will be equipped to engage with schools to open new special classes in relevant areas.  I would like to stress that the NCSE will continue to support all children made known to them after the October deadline. However, it is critical that the NCSE has as much local information as possible as early as possible to effectively plan new provision. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 433. Deputy Sean Fleming asked the Minister for Education and Youth if she will respond to matters raised in correspondence (details supplied); and if she will make a statement on the matter. [69992/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Seán-Fleming.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Seán-Fleming.D.1997-06-26",
          "showAs": "Sean Fleming"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_386",
          "debateSectionId": "dbsect_386",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_386.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_433",
        "questionNumber": 433
      },
      "contextDate": "2025-12-09"
    }
  ]
}