{
  "head": {
    "counts": {
      "questionCount": 690,
      "resultCount": 690
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Education and Youth  The project to which the Deputy refers is devolved for delivery to the National Development Finance Agency (NDFA) as part of a programme of school building projects.  The project brief provides for the development of a New 12 Classroom Primary School with a 2 class Special Education Needs (SEN) base.  The project is currently at Stage 2b of the architectural process (post planning permission), which allows for detailed design/planning, obtaining the necessary statutory permissions and the preparation of tender documents.  The length of time a project takes to go through each stage varies and depends on a number of factors, including scale and complexity. At this early stage it is not possible to provide a timeline for completion of this project.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects.  In addition, repurposing and optimisation of existing accommodation capacity across the school estate has been a key enabler of timely, local provision of special class capacity in a way that supports best practice in inclusion and integration. Circa 80% of new special classes in 2025/26 are being facilitated in repurposed classroom accommodation. Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July, the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs.  In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  Government Departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 467. Deputy Michael Collins asked the Minister for Education and Youth the proposed start date for a new school project (details supplied) in Kinsale, County Cork. [71944/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_357",
          "debateSectionId": "dbsect_357",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_357.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_467",
        "questionNumber": 467
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  As Minister of State at the Department of Transport with special responsibility for Rural Transport, I have responsibility for policy and overall funding in relation to rural public transport service provision; however, I am not involved in the day-to-day operations.  The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally. In light of the NTA responsibilities I have referred your question to the NTA for direct reply to you. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 257. Deputy Michael Collins asked the Minister for Transport the reason the National Transport Authority (NTA) has suspended part of the bus service on the Westport–Louisburgh–Killeen–Killadoon route; the reason the request from local representatives to reinstate the Killeen–Killadoon section has been refused; and if he will make a statement on the matter. [69937/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_236",
          "debateSectionId": "dbsect_236",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_236.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_257",
        "questionNumber": 257
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  As Minister of State at the Department of Transport with special responsibility for Rural Transport, I have responsibility for policy and overall funding in relation to rural public transport service provision; however, I am not involved in the day-to-day operations.  The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally. In light of the NTA responsibilities I have referred your question to the NTA for direct reply to you. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 258. Deputy Michael Collins asked the Minister for Transport the measures that will be taken to address underserved by public transport including the provision of a Local Link service in an area (details supplied); and if he will make a statement on the matter. [69939/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_237",
          "debateSectionId": "dbsect_237",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_237.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_258",
        "questionNumber": 258
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Transport  As Minister of State at the Department of Transport with special responsibility for Rural Transport I recognise the importance of boosting connectivity in County Mayo. In 2025, with funding under the Climate Action Fund, the NTA implemented a pilot Smart DRT service in three areas as part of the Connecting Ireland Rural Mobility Plan.  Using the ‘TFI Anseo’ app, passengers in Achill, Killarney Town and north east of Limerick City are now able to book on-demand rides with ease, bringing the convenience of modern rideshare together with reliability and affordability of public transport. For rural areas and communities, this has the huge potential to integrate ‘first and last mile’ connections.  Each of the pilots will run for one year and will then be reviewed before consideration is given to adopting the app on existing Local Link DRT services and to expanding it's use to other areas.  In light of the NTA's responsibilities for the provision of rural transport services, I have referred the Deputy's question to the Authority for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 259. Deputy Michael Collins asked the Minister for Transport to consider extending the ANSEO rural link pilot scheme, currently operating in Achill, to the Louisburgh–Killeen–Drummin–Roonagh Harbour hinterland, given its potential to provide a sustainable and climate-friendly transport solution for these communities; and if he will make a statement on the matter. [69941/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_238",
          "debateSectionId": "dbsect_238",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_238.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_259",
        "questionNumber": 259
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Transport  For the transport sector, we are required to pursue a decarbonisation pathway to achieve a 50% reduction in transport emissions by 2030 (relative to 2018 levels) in a manner that is consistent with sectoral emission ceilings that were agreed by Government in August 2022. Despite continued economic and population growth, transport emissions have started to decline year-on-year.  The transport chapter of the annually updated national Climate Action Plan (CAP) sets out the policy pathway to achieve these emission reductions and uses an Avoid-Shift-Improve framework where the aim is to:  • Avoid: generating unsustainable additional transport demand through, for example, better spatial, urban, and land-use planning.  • Shift: to more sustainable modes of transport, such as active travel and public transport.  • Improve: the efficiency of residual vehicle journeys through widespread electrification and the use of renewable alternative fuels.  Avoid: My department is finalising a new national strategy called Moving Together. The development of this Strategy was guided by four key principles – one is Rural Recognition. Within this context, the Strategy acknowledges that people in rural areas are more dependent on cars and, on average, use cars more than those in urban areas. While the approach to managing transport demand and congestion will typically be ‘urban first’, there are many recommendations in the Strategy that recognise the challenge for captive car users, particularly those in rural communities. The Rural Recognition principle will be carried forward into the implementation phase of Strategy and I look forward to progressing work on the recommendations following Government approval.  Moving Together will also complement and mutually reinforce the significant investment that is being made in public transport services and active travel infrastructure through the implementation of the National Sustainable Mobility Policy (SMP). Goal 4 of the SMP commits to expanding the availability of sustainable mobility in regional and rural areas, and its accompanying SMP Action Plan 2022-2025 provided for a significant ramping up in the delivery of active travel and greenway projects since the launch of the Policy. A new SMP Action Plan 2026-2030 is currently under development, with many actions expected to support the rural transport objectives set out in Goal 4 of the SMP. These will help to ‘Shift’ people to more sustainable modes like walking, cycling, public and shared transport in rural as well as urban areas whereas Moving Together will help people to ‘Avoid’ more unsustainable journeys, in line with Ireland’s Avoid-Shift-Improve approach to decarbonisation.  Shift: With regards to active travel, this Government has allocated funding to ensure all parts of the country – not just the five cities – benefit from improved active travel infrastructure. Since the publication of the Climate Action Plan 2021, my department has invested over €1 billion in active travel projects through the National Transport Authority’s (NTA’s) Active and Sustainable Transport Investment Programme, delivering over 1,000 km of walking and cycling projects around the country. In 2025 approximately €293 million has been allocated to this Programme, in addition to a commitment by my Department and TII to spending €67 million on Greenways and National Roads Active Travel infrastructure. It is expected that approximately 200km of walking and cycling infrastructure will be delivered in 2025.  Under the NTA Connecting Ireland Rural Mobility Plan, 70% of people in rural Ireland will have buses that provide at least 3 trips daily to nearby towns by 2030. Since the launch of this plan in 2022, over 180 new and enhanced services have been delivered. The plan also outlines the need for improved mobility options for those in remote areas with the provision of Demand Responsive and other innovative transport services.  Improve: Where it is simply not feasible for people in more rural settings to reduce their car travel (in terms of number of car journeys, as well as distance travelled), such people are encouraged to consider EV’s when they come to make their next car purchase. We are seeing steady growth in the number of EV registrations, and I announced in October that Ireland has already met its Climate Action Plan target of 195,000 electric vehicles on the road by the end of 2025, a key milestone in the nation's transition to cleaner transport. Additionally, the Renewable Transport Fuel Obligation (RTFO) continues to see increases in our biofuel blend rates and increased the volume of biofuel supply by 60% between 2021 and 2023, representing displacement of two hundred thousand tonnes of CO2 each year.   ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 260. Deputy Michael Collins asked the Minister for Transport the way in which rural transport policy will be aligned with Ireland’s climate action targets, particularly in areas where the absence of public transport forces reliance on private cars (details supplied); and if he will make a statement on the matter. [69943/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_239",
          "debateSectionId": "dbsect_239",
          "showAs": "Public Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_239.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_260",
        "questionNumber": 260
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I note the Deputy's question in relation to whether Revenue classifies income tax refunds as adjustments to tax liability rather than earnings. I understand that the Department of Housing will be providing answers in respect of the Social Housing and HAP elements of the original question. I'm sure the Deputy will appreciate that I cannot provide answers on those matters.  I am advised by Revenue that “taxable income” for the purposes of the Income Tax Acts is defined by section 3 of the Taxes Consolidation Act (“TCA”) 1997 as having the meaning assigned to it by section 458 TCA 1997. This section clarifies that Revenue considers income tax refunds arising as a result of tax credits as adjustments to tax liabilities rather than earnings.  Section 458 TCA 1997 provides that an individual who makes a claim shall be entitled to have deductions (specified in Part 1 of the Table to that section) made from their total income for the purpose of ascertaining the amount of income on which they will be charged tax, and to have their income tax reduced by the relevant tax credits and other reductions specified in Part 2 of that Table. The rent tax credit and relief for health expenses are included for this purpose. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 291. Deputy Michael Collins asked the Tánaiste and Minister for Finance to clarify whether Revenue classifies tax refunds, tax credits (including the rent tax credit), and medical-expense relief refunds strictly as adjustments to tax liability rather than earnings; and if he will make a statement on the matter. [69301/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_268",
          "debateSectionId": "dbsect_268",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_268.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_291",
        "questionNumber": 291
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  I propose to take Questions Nos. 359, 362, 367, 369 and 371 together.  Ireland's employment permits system is designed to facilitate the entry of appropriately skilled non-EEA nationals to fill skills or labour shortages in the State in the short to medium term. This objective must be balanced by the need to ensure that there are no suitably qualified Irish or EEA nationals available to undertake the work and that the shortage is genuine.  The system is managed through the operation of the Critical Skills Occupation List and the Ineligible Occupations List which are subject to review. Each review takes account of research undertaken by SOLAS's Skills and Labour Market Research Unit and the Expert Group on Future Skills Needs and input from the Economic Migration Inter-Departmental Group which includes the Department of Agriculture, Food and the Marine.  The role of dairy farm assistant has been provided with a quota of 1,100 General Employment Permits since eligibility was first introduced in 2018. This quota was exhausted in November 2025.  Typically, quotas are not automatically extended when they are exhausted and further engagement from the sector is generally required. Where a sector wishes to have a quota extended, or a role fully removed from the ineligible occupations list (i.e. not subject to a quota), evidence should demonstrate a continuing need for access to employment permits for the role, supported by the department with lead responsibility for the sector.  My department has received a submission from the agri-food sector with regard to the role of dairy farm assistant to the current review which closed to receipt of submissions on Friday, 19th of September. Consideration of submissions and evidence supporting changes is currently in progress including where occupations that currently have assigned quotas are undergoing review.  My Department is currently engaging with the Department of Agriculture, Food and the Marine in relation to the eligibility for employment permits and quotas affecting the sector as part of this review. Final recommendations are expected to be published at the beginning of 2026.  It is important to note that employment permit policy is part of the response to addressing skills deficits which exist and are likely to continue into the medium term. It is not intended to act as a long term substitute for meeting the challenge of up-skilling Ireland’s resident workforce, and is instead focused on maximising the potential of EEA nationals to fill our skills deficits. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 359. Deputy Michael Collins asked the Minister for Enterprise, Tourism and Employment if he will give consideration to increasing the current quota for dairy farm assistants under the general employment permit system; in view of the fact that dairy farmers in Cork South-West have been unable to recruit staff locally despite extensive efforts over a two-year period, and that the existing quota has now been filled, leaving farms in a critical position; and if he will make a statement on the matter. [69299/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_322",
          "debateSectionId": "dbsect_322",
          "showAs": "Employment Support Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_322.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_359",
        "questionNumber": 359
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  Applications for social housing support are assessed by the relevant local authority, in accordance with the eligibility and need criteria set down in section 20 of the Housing (Miscellaneous Provisions) Act 2009 and the associated Social Housing Assessment Regulations 2011, as amended.  The 2011 Regulations prescribe maximum net income limits for each local authority, in different bands according to the area concerned, with income being defined and assessed according to a standard Household Means Policy.  Local authorities have discretion to disregard income that is once-off, temporary or short-term in nature and which is outside the regular pattern of a person’s annual income. It is a matter for the relevant local authority to make a determination whether a specific payment should be considered as temporary in the overall context of an applicant household's income.  More detail on what income is assessable and the full list of disregards is available on my Department's website at the following link: www.gov.ie/en/publication/fb1f2-social-housing-support-household-means-policy/  As to whether Revenue classifies these refunds strictly as adjustments to tax liability rather than earnings, this remains under the remit of the Department of Finance and is therefore a matter for the Minister for Finance. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 491. Deputy Michael Collins asked the Minister for Housing, Local Government and Heritage to clarify if tax refunds, tax credits (including the rent tax credit), and medical-expense relief will be treated as one-off income for the purposes of Social Housing and HAP means assessments; whether Revenue classifies these refunds strictly as adjustments to tax liability rather than earnings; whether guidance will be issued to ensure local authorities apply a consistent approach so that one-off tax refunds cannot inflate income above eligibility thresholds such as the €36,500 limit; and if he will make a statement on the matter. [69300/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_427",
          "debateSectionId": "dbsect_427",
          "showAs": "Housing Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_427.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_491",
        "questionNumber": 491
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The project to which the deputy refers has been devolved to the National Development Finance Agency (NDFA) for delivery as part of a programme of school building projects. The brief for this project is provide a new build post primary school to accommodate a long-term projected enrolment of 1,000 pupils including a 6 class SEN base.  The project is currently at Stage 3 of the architectural design process – Tender Stage. The length of time a project takes to go through each stage varies and depends on a number of factors, including scale and complexity. The NDFA will be engaging directly with the school authority to keep it informed of progress.  My Department is committed to ensuring appropriate school accommodation is available for all children in St Marys College and will in the wider context outlined, ensure that this project - as for all projects on the school building programme - is subject to the due diligence required under the public Infrastructure Guidelines.  In July, the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs.  In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  All Government Departments are expected to publish their sectoral NDP Implementation Plans shortly. My Department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. This will be the context for assessing all project rollout for the 2026 to 2030 period.  The current status of all projects is listed on a county-by-county basis at www.gov.ie. under item number 10 and this is updated on a regular basis to reflect project progress through the various stages of capital appraisal, site acquisition, design, tender and construction. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 268. Deputy Michael Collins asked the Minister for Education and Youth the current status of a new school building project for a post-primary school in Naas (details supplied), first promised by Minister Jan O'Sullivan in November 2015. [67733/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_246",
          "debateSectionId": "dbsect_246",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_246.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_268",
        "questionNumber": 268
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The large scale project for the school referred to by the Deputy is now at Architectural Planning Stage 4 – Construction.  The project brief for the Major Project comprises of the phased demolition of the existing school and the phased construction of a new two storey school with associated site works to provide accommodation for a new 12-classroom school with 3 classrooms for pupils with Special Educational Needs.  The Department is unable to release costs associated with a project until Stage 5 is complete. The information is commercially sensitive until this stage. As the project is still at Stage 4 we will be unable to release this information. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 278. Deputy Michael Collins asked the Minister for Education and Youth the estimated cost of the major project at a school (details supplied). [67926/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_255",
          "debateSectionId": "dbsect_255",
          "showAs": "Departmental Budgets",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_255.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_278",
        "questionNumber": 278
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  Disablement Benefit is a compensatory payment for persons who have suffered a loss of faculty due to injury arising out of and in their insurable employment.  Constant attendance allowance is an increase to Disablement Benefit, If an individual requires daily care because of an accident at work or work-related illness. To qualify for constant attendance allowance, an applicant must be in receipt of Disablement Benefit of over 50%. A payment of €261 constant attendance allowance is paid directly to the person on Disablement Benefit. There are currently 14,331 persons in receipt of Disablement Benefit and 117 in receipt of constant attendance allowance.  An individual on Disablement Benefit may become a care recipient on Carers Allowance or Carers Benefit. Payment of Carers Allowance or Carers Benefit is paid directly to the carer. A person in receipt of constant attendance allowance must provide for their own care needs and cannot be a care recipient on either Carers Allowance or Carers Benefit.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 386. Deputy Michael Collins asked the Minister for Social Protection the current number of disablement benefit recipients who also receive constant attendance allowance (CAA); the number of disablement benefit recipients that have a level of disablement assessed at 50% or above; the reason the number of recipients of CAA appears disproportionately low compared to the total number of disablement benefit recipients; if his Department is actively reviewing the criteria or processes to ensure eligible individuals are not being excluded from receiving CAA; and if he will make a statement on the matter. [67921/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_345",
          "debateSectionId": "dbsect_345",
          "showAs": "Social Welfare Benefits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_345.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_386",
        "questionNumber": 386
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 621. Deputy Michael Collins asked the Minister for Health if she will address the urgent need for improved facilities and additional dedicated space for the rheumatology outpatient department at Cork University Hospital; the plans in place to provide a designated area for multidisciplinary consultations, patient education, and administrative work to ensure patient confidentiality and efficient service delivery; and if she will make a statement on the matter. [67925/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_554",
          "debateSectionId": "dbsect_554",
          "showAs": "Hospital Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_554.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_621",
        "questionNumber": 621
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 622. Deputy Michael Collins asked the Minister for Health if she will provide the most recent national data regarding the number of people on waiting lists for glaucoma treatment; and if she will make a statement on the matter. [67946/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_555",
          "debateSectionId": "dbsect_555",
          "showAs": "Health Services Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_555.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_622",
        "questionNumber": 622
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  In relation to the particular query raised, adult and child waiting list information by hospital, specialty, and time band is published monthly by the National Treatment Purchase Fund (NTPF) on its website: www.ntpf.ie/home/nwld.htm.  The information is now being made available through an interactive visual tool which provides users with a much-improved way of accessing and analysing waiting list information.  The NTPF has advised my Department that it is unable to provide specific reports for cornea and refractive surgery. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 623. Deputy Michael Collins asked the Minister for Health if she will provide the most recent national data regarding the number of people on waiting lists for cornea and refractive surgery; and if she will make a statement on the matter. [67947/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_556",
          "debateSectionId": "dbsect_556",
          "showAs": "Hospital Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_556.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_623",
        "questionNumber": 623
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 624. Deputy Michael Collins asked the Minister for Health if she will provide the most recent national figures regarding the number of people on waiting lists for age-related macular degeneration; and if she will make a statement on the matter. [67948/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_557",
          "debateSectionId": "dbsect_557",
          "showAs": "Health Services Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_557.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_624",
        "questionNumber": 624
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 625. Deputy Michael Collins asked the Minister for Health if she will provide the most recent figures regarding the number of people on waiting lists for diabetic retinopathy; and if she will make a statement on the matter. [67949/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_558",
          "debateSectionId": "dbsect_558",
          "showAs": "Health Services Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_558.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_625",
        "questionNumber": 625
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 626. Deputy Michael Collins asked the Minister for Health if she will provide the most recent figures regarding the number of people on waiting lists for dry eye disease, or ocular surface disease; and if she will make a statement on the matter. [67950/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_559",
          "debateSectionId": "dbsect_559",
          "showAs": "Health Services Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_559.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_626",
        "questionNumber": 626
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 627. Deputy Michael Collins asked the Minister for Health if she will provide the most recent figures regarding the number of people on waiting lists for retinal detachment; and if she will make a statement on the matter. [67951/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_560",
          "debateSectionId": "dbsect_560",
          "showAs": "Health Services Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_560.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_627",
        "questionNumber": 627
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "showAs": " 559. Deputy Michael Collins asked the Minister for Housing, Local Government and Heritage whether local authorities should be required, under the Social Housing Assessment Regulations and the National Household Means Policy, to deduct private-sector occupational pension contributions, PRSA contributions, or AVCs, when made through payroll on a pre-tax basis and functionally equivalent to public-sector additional superannuation contributions (ASC), when assessing income for social housing and HAP eligibility; when current local authority practice must be aligned with national policy, and that national policy should explicitly include private-sector pension contributions, as it already includes ASC, which only benefits public-service workers; and the steps which will be taken to ensure fair and consistent treatment of private-sector workers, particularly with compulsory pension auto-enrolment from January 2025; and if he will make a statement on the matter. [66123/25] ",
        "debateSection": {
          "showAs": "Departmental Inquiries",
          "debateSectionId": "dbsect_509",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_509",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_509.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Michael Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "memberCode": "Michael-Collins.D.2016-10-03"
        },
        "questionNumber": 559,
        "answerText": " Minister for Housing, Local Government and Heritage  Applications for social housing support are assessed by the relevant local authority, in accordance with the eligibility and need criteria set down in section 20 of the Housing (Miscellaneous Provisions) Act 2009 and the associated Social Housing Assessment Regulations 2011, as amended.  The 2011 Regulations prescribe maximum net income limits for each local authority, in different bands according to the area concerned, with income being defined and assessed according to a standard Household Means Policy. Net income means that income tax, Universal Social Charge, PRSI and Additional Superannuation Contribution (ASC) are deducted from the relevant assessable gross income. With the exception of the specific payments listed in the Policy as being disregarded, all income from social insurance and social assistance payments, allowances and benefits, and occupational and social welfare pensions is assessable.  More detail on what income is assessable and the full list of disregards is available on my Department's website at the following link: www.gov.ie/en/publication/fb1f2-social-housing-support-household-means-policy/  My Department is currently in the process of reviewing the Household Means Policy to ensure it is consistent with the policy objectives of the introduction of the compulsory pension auto-enrolment scheme effective from January 2026. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_559",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 356,
        "showAs": " 356. Deputy Michael Collins asked the Minister for Finance to provide a breakdown of the maintenance costs of the MV Matthew, which was seized in September 2023 for drug trafficking, and has been docked in Cork for the past two years; and the reason for the delay in the sale of this cargo ship. [63167/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Finance"
        },
        "by": {
          "showAs": "Michael Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "memberCode": "Michael-Collins.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_356",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_297",
          "showAs": "Illicit Trade",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_297",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_297.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Finance (Deputy Paschal Donohoe)  I am advised by Revenue that the following table outlines payments made in respect of maintaining the vessel alongside in the Port of Cork since its detention in September 2023 up to end of October 2025.      Payments made by the Revenue Commissioners in respect of maintenance and management of MV Matthew from Sept 2023 to end Oct 2025     Total (€)       Berthing     2,936,661       includes all costs associated with berthing, unberthing and movement of the vessel            Maintenance     4,814,532       Includes all costs (other than berthing or crewing) of maintaining the ship alongside in Port such as ship’s stores and provisions, bunkering fuel, waste removal, misc repairs and maintenance, agent & professional fees, insurance, etc            Crewing     4,185,259       TOTAL      11,936,453            Following the vessel’s seizure and forfeiture, immediate steps were taken by Revenue to prepare for the disposal of the MV Matthew.  In November 2023, initial consultation commenced with a shipping broker with a view to marketing the vessel for sale. In December 2023, Revenue was advised by the Office of the DPP that the disposal of the vessel could not proceed as the vessel was required for evidential purposes in the associated criminal trial. On 2nd December 2024 the Special Criminal Court authorised the release of the MV Matthew and a shipping broker was then formally engaged by Revenue to market the vessel. The bidding process concluded in Q1 2025 when a preferred bidder was identified. Revenue continues to engage with the bidder’s representative.  There are significant regulatory and legal obligations which must be fulfilled in order to finalise the disposal of the MV Matthew and to facilitate the removal of the vessel from Cork Harbour.  Since March 2025, Revenue has been actively engaging with the vessel’s Flag State (Panama) to ensure that these regulatory requirements are satisfied. It should be noted, however, that the manner in which regulatory processes were conducted by the previous owner has resulted in certain difficulties and delays in Revenue being in a position to progress the disposal. Following engagement between Revenue, the Department of Foreign Affairs and Trade and Panamanian officials, progress has been made in addressing some of these difficulties, including the registration of Revenue’s ownership of the vessel in the Flag State which was a necessary requirement to facilitate Revenue’s disposing of the vessel. Accordingly, it is anticipated that progress can now be made in the disposal process.  Delays and difficulties in the disposal process have been created by the complexity of registration of ownership and regulatory processes created by the conduct of the previous owner (Matthew Maritime Inc) and the use of the vessel as a conveyance for international drug smuggling. The Revenue Commissioners has engaged robustly with the market through an international shipping broker and has actively engaged with parties interested in acquiring the vessel. However, it has not been possible to agree a contract for sale with interested parties at this time and the Revenue Commissioners will be proceeding to arrange a Class survey to advance the certification and clearance processes necessary to facilitate the departure of the vessel.  However, as it stands, there remains certain regulatory and Port State Control matters to be addressed. Revenue is engaging with the necessary State agencies to progress these matters. As such, it is not possible to give a firm timeline for the disposal and departure of the vessel at this point. However, Revenue is considering all options, including the recycling of the vessel, such that the disposal and removal of the vessel can proceed in the most expedient manner. ",
        "date": "2025-11-18"
      }
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Enterprise",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 594. Deputy Michael Collins asked the Minister for Enterprise, Tourism and Employment if the increased cost of business scheme grant and power up grant, for small and medium-sized businesses to help with rising operational costs, will in fact be re-opened in 2026 (details supplied); and if he will make a statement on the matter. [58426/25] ",
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_594",
        "questionNumber": 594,
        "answerText": " Minister for Enterprise, Tourism and Employment  The Increased Cost of Business grant and the Power Up grant opened to applications in 2024. Both grant schemes are now closed having paid out over €400 million to businesses across the country.  As both grant schemes are now closed it is not possible to reopen them at this stage. However in terms of broader Government supports for businesses, I'd like to draw your attention to the National Enterprise Hub online portal provides all business owners with a centralised signposting service of over 250 Government supports from 30 Departments and Agencies. The Hub has a team of expertly trained advisors who can help to diagnose the needs of your business and direct you to the appropriate available supports or indeed put you in direct contact with the relevant agency. The Hub team can be contacted through the website (www.neh.gov.ie) via live chat or by phone on 01 727 2100. ",
        "debateSection": {
          "showAs": "Business Supports",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_542",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_542.xml"
            }
          },
          "debateSectionId": "dbsect_542"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Justice",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1278. Deputy Michael Collins asked the Minister for Justice, Home Affairs and Migration whether his Department can confirm how an individual subject to a live deportation order was permitted to remain in the State and subsequently gain access to the Citywest campus when there are children housed there (details supplied); how a vulnerable child in the care of Tusla could be on the campus unknown to security; the length of time for which that individual had been the subject of a deportation order prior to this incident; the number of persons currently in the State who are subject to a deportation order but have not been removed, including those previously accommodated in IPAS who have since left the system but remain in the State; whether his Department tracks, supervises or monitors such individuals; the basis on which no enforcement action has been taken in their regard; and if he will make a statement on the matter. [58365/25] ",
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1278",
        "questionNumber": 1278,
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 1278 and 1279 together.  The Department, An Garda Siochana, and a range of local partners and stakeholders have been working hard to respond to the ongoing very difficult events of recent weeks in the vicinity of Citywest Hotel and Convention Centre.  The serious incident alleged to have occurred within the vicinity of Citywest, and the violent protests that took place have raised significant concerns, particularly for people living in the area.  In relation to the alleged crime, a person has been arrested and charged in relation to this incident and is now before the Courts.  Where a criminal act has occurred, the Department is precluded from commenting or providing detailed information relating to the case or the circumstances, as this may prejudice any consequent investigations or court cases.  It is important to note, notwithstanding this alleged crime, An Garda Síochána has clearly stated that there is no correlation between an increase in crime rates and the location of international protection accommodation.  In relation to security arrangements on the site, my officials are working closely with An Garda Síochána at this time, and keeping such arrangements under careful review in order to protect all people living and working in the vicinity. It is not appropriate for the Department to disclose detailed information about security arrangements in this context.  The number of people resident in the International Protection Accommodation Service (IPAS) centres who have been refused permission to remain in the State is a small proportion of our total resident population of nearly 33,000 people.  Currently, there are approximately 500 people subject to deportation orders residing in IPAS accommodation. This number fluctuates regularly as people leave Ireland under the relevant return pathways, and as new orders are made.  Some people subject to deportation orders may have the enforcement of their order suspended due to legal proceedings or due to personal circumstances such as health grounds. Others will be in the process of arranging to leave the State as directed.  My Department works closely with the Garda National Immigration Bureau to arrange for the removal of persons subject to deportation orders.  My officials and the Department’s Community Engagement Team have remained in touch with all key local stakeholders throughout the last weeks, and will continue to assist and work with local representatives and community groups in the areas. ",
        "debateSection": {
          "showAs": "Deportation Orders",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1098",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1098.xml"
            }
          },
          "debateSectionId": "dbsect_1098"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Justice",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1279. Deputy Michael Collins asked the Minister for Justice, Home Affairs and Migration how an individual who was not a resident of an IPAS facility, and who is believed to be subject to a deportation order, was able to gain access to the Citywest campus; and how a vulnerable child in the care of Tusla ended up there (details supplied); the perimeter or access-control procedures currently in place at IPAS and any Tusla accommodation centres to prevent unauthorised entry by non-residents; whether she accepts that previous FOI disclosures confirming the presence of non-residents on such campuses indicate a systemic security failure; whether any safeguarding risk assessments were carried out prior to housing children on this campus with open or uncontrolled access, and any other State accommodation that houses children; the measures now being taken to prevent a recurrence of this in these types of accommodation centres; and if he will make a statement on the matter. [58366/25] ",
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1279",
        "questionNumber": 1279,
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 1278 and 1279 together.  The Department, An Garda Siochana, and a range of local partners and stakeholders have been working hard to respond to the ongoing very difficult events of recent weeks in the vicinity of Citywest Hotel and Convention Centre.  The serious incident alleged to have occurred within the vicinity of Citywest, and the violent protests that took place have raised significant concerns, particularly for people living in the area.  In relation to the alleged crime, a person has been arrested and charged in relation to this incident and is now before the Courts.  Where a criminal act has occurred, the Department is precluded from commenting or providing detailed information relating to the case or the circumstances, as this may prejudice any consequent investigations or court cases.  It is important to note, notwithstanding this alleged crime, An Garda Síochána has clearly stated that there is no correlation between an increase in crime rates and the location of international protection accommodation.  In relation to security arrangements on the site, my officials are working closely with An Garda Síochána at this time, and keeping such arrangements under careful review in order to protect all people living and working in the vicinity. It is not appropriate for the Department to disclose detailed information about security arrangements in this context.  The number of people resident in the International Protection Accommodation Service (IPAS) centres who have been refused permission to remain in the State is a small proportion of our total resident population of nearly 33,000 people.  Currently, there are approximately 500 people subject to deportation orders residing in IPAS accommodation. This number fluctuates regularly as people leave Ireland under the relevant return pathways, and as new orders are made.  Some people subject to deportation orders may have the enforcement of their order suspended due to legal proceedings or due to personal circumstances such as health grounds. Others will be in the process of arranging to leave the State as directed.  My Department works closely with the Garda National Immigration Bureau to arrange for the removal of persons subject to deportation orders.  My officials and the Department’s Community Engagement Team have remained in touch with all key local stakeholders throughout the last weeks, and will continue to assist and work with local representatives and community groups in the areas. ",
        "debateSection": {
          "showAs": "Deportation Orders",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1098",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1098.xml"
            }
          },
          "debateSectionId": "dbsect_1098"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_511.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_511",
          "debateSectionId": "dbsect_511"
        },
        "to": {
          "showAs": "Justice",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Justice, Home Affairs and Migration  Details of payments made to specific providers for specific locations are not publicly supplied by my Department as such details are commercially sensitive. However, the Deputy may wish to note that payments over €20,000 to suppliers of the Department generally, including accommodation providers, are periodically published officially. The most recent figures are published at the URL www.gov.ie/en/collection/dfdadb-department-of-children-and-youth-affairs-purchase-orders-for-20000-o/  The property to which the Deputy refers had previously provided 90-Day accommodation from March 2024 to March 2025 for people fleeing the war in Ukraine. When this initial contract was due for renewal, there were sufficient beds available to the Department to meet the then lowering demand for 90-day accommodation and it was decided not to renew the contract for Newhall.  To address the recent increase in arrivals from Ukraine a new contract has been agreed with this property for a six-month period which is viewed as appropriate and in line with the contractual duration of other 90-day Designated Accommodation Centres. The requirement for this facility will be kept under review. ",
        "questionType": "written",
        "showAs": " 619. Deputy Michael Collins asked the Minister for Justice, Home Affairs and Migration the total payments made to a company in a relation to a site (details supplied); and if he will make a statement on the matter. [57388/25] ",
        "questionNumber": 619,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Michael Collins",
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_619"
      }
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Further and Higher Education, Research, Innovation and Science (Deputy Marian Harkin)  The Government remains firmly committed to apprenticeships and has significantly expanded the opportunities for learners in recent years. We fully recognise the vital role that apprentices play in equipping Ireland’s workforce with the skills needed to meet national priorities. That includes infrastructure delivery. The Minister, Deputy Lawless, and I have prioritised this area and in budget 2026 we secured an additional €79 million investment in apprenticeships. That is the largest investment since the formation of the Department. This investment will directly support the expansion of the craft apprenticeship system and support key trades such as plumbing and electrical, which are essential to delivering the national development plan 2025.  To further support apprentices, €2.5 million was also secured to reduce the cost of attending higher education. Generally we are talking here about phase 4 and phase 6 apprenticeships. What is important is that this will permanently lower fees by 17% for over 14,000 apprentices in the 2025 to 2026 academic year, including more than 11,000 craft apprentices. As can be seen, the Government not only recognises the need to increase the number of apprentices, especially in the craft trades, but we are supporting this objective by ensuing additional funding.  The evidence is there. In recent years, the apprenticeship system has grown significantly. For example, annual craft apprenticeship registrations rose by 63% from 2020 to 2024 and the number of apprentices in construction has risen by 50% between 2020 and 2025. \n Deputy Michael Collins  I welcome the recent announcement of funding of €339 million for craft apprenticeships for 2025. It is my understanding that this funding will be used to support the expansion of training places, the recruitment and retention of instructors, and the provision of more places, especially in trades needed for housing infrastructure, including, as the Minister of State said, plumbers and electricians. The recent documentary \"Who's Building Ireland?\" explored the construction industry and who is building the 300,000 new homes needed by 2030. There are 170,000 people working in the construction industry in Ireland. We need between 30,000 and 40,000 skilled workers to build these homes. How does the Minister of State propose to incentivise the fully trained craftspeople to remain in Ireland once they have finished their apprenticeships? \n Deputy Marian Harkin  As the Deputy said, this funding will increase the numbers of apprentices already here. We see that phase 2 training capacity has increased from 5,600 in 2023 to over 7,000 in 2025 across the country.  He also mentioned the fact that more instructors are being put in place. Over 80 instructors were converted from fixed term to permanent, and that supports retention, which is the question the Deputy asks: how we will retain apprenticeships in this country? It is also worth noting that over 130 new instructors have been recruited.  He can see from that that the Government is determined to grow this sector. Retention of apprentices obviously depends on the work being there. We can see that. There is full employment in the sector. We need more apprentices, and the objective of this Government is to see that that pipeline of apprentices continues to grow. \n Deputy Michael Collins  We are depending on migrant workers to build these houses. These workers have come from Poland, Latvia, Moldova, Bolivia, South Africa and other places across the world. As I said, there are 300,000 new homes needed by 2030 and there are 170,000 people working in construction, but 30,000 to 40,000 is a lot of people to be found between now and 2030. All these workers need to be trained. How many years will it take to achieve the number of qualified craftspeople necessary to meet the demand for housing supply? \n Deputy Marian Harkin  The Government's objective is that by 2030 we will have 12,500 apprenticeships in the system. We are already well on track to achieving that, with, I think, about 9,300 last year. The Deputy said we are relying on migrant workers. Certainly, they play an important role in the sector. We are pleased to see that the sector is working but we also have a responsibility to grow the number of apprenticeships. There is our action plan for construction, which is there up to this year, and we are launching a new action plan. Our objective is to ensure that more people, especially women, see apprenticeships as a viable, exciting, interesting career pathway. I use the word \"pathway\" because it is not just an end in itself; an apprenticeship is a pathway into so many different areas in the construction sector, some on site, some off site. We are working very diligently to get that message across. ",
        "by": {
          "showAs": "Michael Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "memberCode": "Michael-Collins.D.2016-10-03"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "date": "2025-10-16",
        "questionNumber": 5,
        "questionType": "oral",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/debate/dbsect_7",
          "debateSectionId": "dbsect_7",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/debate/mul@/dbsect_7.xml"
            }
          },
          "showAs": "Apprenticeship Programmes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-16/pq_5",
        "showAs": " 5. Deputy Michael Collins asked the Minister for Further and Higher Education, Research, Innovation and Science the further actions he intends to take to increase craft apprenticeship participation given the additional funding announced in budget 2026 and the urgent need to increase the number of people qualified in the trades; and if he will make a statement on the matter. [56315/25] "
      },
      "contextDate": "2025-10-16"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  The current Action Plan was launched in 2021 with key goals for apprenticeship around growth, improving the profile of apprenticeship, improving access and supports for apprentices and employers, along with increasing the footprint of apprenticeship in the public service.  We have seen strong progress across these headings. Since 2019, the last pre-pandemic year, the total apprentice population has grown from 17,829 to 29,772 as of the end of 2024. This has been matched by an increase in investment from €142m in 2019 to the over €400m earmarked for apprenticeship in 2026.  There has been growth both in terms of new programmes and expansion of existing ones.  Earlier this year for example, I was pleased to welcome the first intake of apprentices on the new Digital Marketing Apprenticeship. All twelve of this intake are employed by government departments both equipping our communications teams for the fast-changing digital world and helping us reach the targets set out in the Public Service Apprenticeship Plan.  In the long-standing aircraft mechanic apprenticeship, and following engagement with industry, I was pleased to announce a major investment in training provision which almost doubled the number of places available from 79 in 2024 to 155 from this September.  I am committed to developing a new Action Plan for Apprenticeship to cover the period 2026-2030. The proposed Action Plan will seek to update current apprenticeship policy to reflect present and anticipated challenges posed within Ireland’s apprenticeship environment.  The development of the Action Plan, which is a Programme for Government commitment, will recognise priority government strategies such as the National Development Plan, Housing for All and the Climate Action Plan.  I will be launching a public consultation shortly to seek the views of all stakeholders on how the system can be improved, made more inclusive, and better aligned with national skills needs. ",
        "by": {
          "showAs": "Michael Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "memberCode": "Michael-Collins.D.2016-10-03"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "date": "2025-10-16",
        "questionNumber": 401,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/dbsect_381",
          "debateSectionId": "dbsect_381",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/mul@/dbsect_381.xml"
            }
          },
          "showAs": "Apprenticeship Programmes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-16/pq_401",
        "showAs": " 401. Deputy Michael Collins asked the Minister for Further and Higher Education, Research, Innovation and Science when his department WILL publish a renewed strategy to replace the Action Plan for Apprenticeship 2021-2025; and if he will make a statement on the matter. [56316/25] "
      },
      "contextDate": "2025-10-16"
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Maritime Jurisdiction",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_147.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_147",
          "debateSectionId": "dbsect_147"
        },
        "to": {
          "showAs": "Defence",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Tánaiste and Minister for Defence  At their outset, it is important to note that the United Nations Convention on the Law of the Sea (UNCLOS) allows for all vessels, including military vessels, to transit through the territorial waters of coastal states when conducting innocent passage. Furthermore, naval vessels are permitted to conduct exercises outside of territorial waters in a country’s Exclusive Economic Zone so long as this does not unduly interfere with the Coastal State. Any vessels transiting Irish waters must do so in compliance with international law and may be subject to sighting and observation by the Naval Service and Air Corps without their innocent passage being infringed.  The Defence Forces monitor activity within Irish territorial waters and the Irish EEZ on a continual basis. For security and operational reasons the Deputy will appreciate it would not be appropriate for me to comment any further. ",
        "questionType": "written",
        "showAs": " 223. Deputy Michael Collins asked the Tánaiste and Minister for Defence the total number of vessels that were found to have unlawfully entered Irish territorial waters or the States exclusive economic zone in each of the years 2020 to 2024 and to date in 2025; and if he will make a statement on the matter. [54660/25] ",
        "questionNumber": 223,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Michael Collins",
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_223"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Abortion Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/mul@/dbsect_739.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/writtens/dbsect_739",
          "debateSectionId": "dbsect_739"
        },
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Health  GPs are reimbursed via the Primary Care Reimbursement Scheme (PCRS) for the consultations undertaken with patients in respect of terminations as set out below:     1.    Patient’s first visit for purpose of termination in accordance with the Act of 2018    €150      2.    Termination of pregnancy in accordance with the Act of 2018 which is carried out by service provider, including aftercare    €300      3.    Aftercare visit with service provider where termination of pregnancy in accordance with the Act of 2018 is not carried out by service provider but is carried out in a hospital    €100     Fees paid to GPs by the HSE for the provision of relevant medical services form part of their relevant income which is subject to taxation in the normal way. ",
        "questionType": "written",
        "showAs": " 893. Deputy Michael Collins asked the Minister for Health the amount a GP is currently reimbursed for each abortion, after a claim for a woman's first consultation, after a claim for her second consultation; the other payments to the GP for further consultations; if these payments are liable for tax or are exempt from tax; and if she will make a statement on the matter. [55342/25] ",
        "questionNumber": 893,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Michael Collins",
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_893"
      }
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03"
        },
        "showAs": " 394. Deputy Michael Collins asked the Minister for Justice, Home Affairs and Migration if any engagement took place with local representatives, NGOs, schools, healthcare providers, or community groups in relation to the use of facilities (details supplied) prior to the establishment of the Community Engagement Team in 2023; and if he will publish minutes or summaries of the eight stakeholder meetings and seven information notes referenced in the reply. [53082/25] ",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_373.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_373",
          "showAs": "International Protection",
          "debateSectionId": "dbsect_373"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_394",
        "answerText": " Minister for Justice, Home Affairs and Migration  The State purchase of the Citywest Hotel and Convention Centre for international protection accommodation is now completed.  The purchase of the site is a key part of the Government’s strategy to develop a stable and sustainable accommodation system for people seeking international protection. State-owned centres are part of the Government’s long-term plan to reduce the reliance on private accommodation providers resulting in better value for money of public funds and a more efficient international protection system.  The Community Engagement Team was established at the end of 2023. In line with commitments in the Programme for Government, since the purchase of the site was confirmed, the Community Engagement Team has been engaging broadly with local stakeholders, including members of the Community Integration Forum in South Dublin County Council.  Prior to the establishment of the Community Engagement Team, the Department of Children, Equality, Disability, Integration, and Youth (DCEDIY) would have had engagement with local stakeholders in relation to some sites. However, a formal team and approach to engagement was not in place before the establishment of the Community Engagement Team at the end of 2023.  The Department is committed to ensuring that the local community has access to accurate information and that structures to plan for provision of essential and support services, such as healthcare and education, are in place to assist with the integration process.  Since 19 June 2025, the Community Engagement Team has held 8 engagement meetings with stakeholders and provided 7 information notes to local elected representatives.  A dedicated webpage to support the community to keep them informed of developments has been published at www.gov.ie/citywest.  The website is updated with all issues raised at engagement meetings, or included in information notes. ",
        "questionNumber": 394
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03"
        },
        "showAs": " 395. Deputy Michael Collins asked the Minister for Justice, Home Affairs and Migration if any portion of the associated land at a location (details supplied) is intended for use in developing modular homes or additional accommodation blocks in future; and if consultation has taken place with South Dublin County Council or other planning authorities regarding land-use. [53086/25] ",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_374.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_374",
          "showAs": "International Protection",
          "debateSectionId": "dbsect_374"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_395",
        "answerText": " Minister for Justice, Home Affairs and Migration  The State purchase of the Citywest Hotel and Convention Centre for international protection accommodation is now completed.  As stated in previous updates issued to local elected representatives and residents’ groups, the Department can confirm that there are no plans in place to increase capacity on the site or on the grounds.  It is important to emphasise that accommodation for people seeking international protection and responses to crisis events, like the invasion of Ukraine in 2022, are demand-led. The Department will engage with elected representatives and the local authority if any emergency use or further capacity development is required.  The Department has no plans to develop the cemetery area and has no plans to use this land for any other purpose.  The Department hopes to seek approval for the development of a solar farm on the site, allowing for the necessary technical assessments needed. This would be a positive development for the site and make a contribution to sustainability for the site.  Any such plans will include advance engagement with local elected representatives, South Dublin County Council and other partners. ",
        "questionNumber": 395
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03"
        },
        "showAs": " 396. Deputy Michael Collins asked the Minister for Justice, Home Affairs and Migration if the Comptroller &amp; Auditor General or an independent external auditor has reviewed the value-for-money assessment underpinning the €148m purchase of a facility (details supplied); and to publish the detailed methodology used to support the claim that the purchase price will be recouped within four years.; and if he will make a statement on the matter. [53087/25] ",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_375.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_375",
          "showAs": "International Protection",
          "debateSectionId": "dbsect_375"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_396",
        "answerText": " Minister for Justice, Home Affairs and Migration  As the Deputy will be aware, Cabinet approval for the State purchase of the Citywest Hotel and Convention Centre for international protection accommodation was secured this year, on 17 June 2025.  The purchase of the site is a key part of the Government’s strategy to develop a stable and sustainable accommodation system for people seeking international protection. State-owned centres are part of the Government’s long-term plan to reduce the reliance on private accommodation providers resulting in better value for money of public funds and a more efficient international protection system.  The purchase was approved following an extensive due diligence process, including appropriate survey, legal review and independent valuation, in line with the Government Infrastructure Guidelines. These guidelines set out the value for money guidelines for the evaluation, planning and management of public investment projects, including purchase or acquisitions of assets or shareholdings, in Ireland.  The full purchase price for the Citywest centre (including VAT) was €148,253,530 which is in line with the Government decision of 17 June 2025.  Compared to the costs of the previous leasing model, the savings to the State will pay back the purchase price within 4 years.  This estimate is based on expenditure in 2024 under the previous leasing model for accommodation for people from Ukraine and international protection at this location. It also includes consideration of the ongoing running costs to the State of providing accommodation at the site after the purchase.  The purchase model represents prudent financial sense for the State in this regard, while also delivering a permanent State asset.  As the purchase expenditure was incurred in 2025, it will form part of the 2025 Appropriation Account in due course which will be subject to audit by the Office of the Comptroller and Auditor General (C&AG) next year. ",
        "questionNumber": 396
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03"
        },
        "showAs": " 397. Deputy Michael Collins asked the Minister for Justice, Home Affairs and Migration if legal advice was sought from the Attorney General in relation to proceeding with the use of facilities (details supplied) without planning permission; and whether any monitoring mechanism has been put in place to ensure that the exempted development provisions of S.I. 605 of 2022 and S.I. 376 of 2023 are properly applied in this case.; and if he will make a statement on the matter. [53091/25] ",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_376.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_376",
          "showAs": "International Protection",
          "debateSectionId": "dbsect_376"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_397",
        "answerText": " Minister for Justice, Home Affairs and Migration  The Citywest Hotel and Convention Centre is an existing accommodation centre for people seeking international protection, and for people fleeing the war in Ukraine who are Beneficiaries of Temporary Protection.  The Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022) were introduced to assist the State in meeting Ireland’s legal obligation to provide accommodation to international protection applicants.  As a hotel and convention centre, the Citywest Hotel and Convention Centre’s change of use is permitted as exempt development under the provisions of Class 20F of the Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022).  The Regulations 2023 (S.I. 376 of 2023) extended the planning exemption provided by S.I. 605 of 2022, from 31 December 2024 to 31 December 2028.  This means that the Citywest Hotel and Convention Centre can continue to operate as an accommodation centre for people seeking international protection under the provisions of that legislation for as long as it is applicable. ",
        "questionNumber": 397
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03"
        },
        "showAs": " 398. Deputy Michael Collins asked the Minister for Justice, Home Affairs and Migration given that 134 submissions were received under the 2024 Expression of Interest process for potential international protection accommodation, the reason the purchase of facilities (details supplied) proceeded before assessments of these submissions were completed; and if this indicates that the decision to purchase the facilities was pre-determined irrespective of the outcome of the EOI process. [53093/25] ",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_377.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_377",
          "showAs": "International Protection",
          "debateSectionId": "dbsect_377"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_398",
        "answerText": " Minister for Justice, Home Affairs and Migration  In line with the Programme for Government 2025, and the Comprehensive Accommodation Strategy (CAS) for International Protection approved in 2024, the State is working to develop more State-owned international protection accommodation, and reduce reliance on commercial providers over time.  This will see a move away from full reliance on private providers and towards a core of State-owned accommodation, delivering a targeted 14,000 State-owned beds by 2028. This will be supplemented, as required, by high standard commercial providers.  This strategy is being implemented through a range of strands:  • Use of State land for prefabricated and modular units  • Conversion of commercial buildings  • Targeted purchase of medium and larger turnkey properties  • Design and build of new Reception and Integration Centres  • Upgrading of IPAS centres.  In terms of purchases, an Expression of Interest (EOI) process was launched in 2024 for the sourcing of suitable properties for acquisition or lease. 134 submissions have been received to date, and these options are being assessed.  Separate to this expression of interest process, Cabinet approval for the State purchase of the Citywest Hotel and Convention Centre for international protection accommodation was secured this year, on 17 June 2025.  The EOI process mentioned above and the direct purchase of Citywest are separate strands of the same strategy, and do not interfere with one another, but rather allow the State to progress towards its goals.  With the purchase of Citywest now complete, the IPAS system has increased its State-owned beds from 900 in mid-2024, to 4,000 today. ",
        "questionNumber": 398
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-30/pq_948",
        "answerText": " Minister for Health  As the Deputy's question relates to service matters, I have referred it to the HSE for direct reply. ",
        "date": "2025-09-30",
        "questionNumber": 948,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/dbsect_808",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/mul@/dbsect_808.xml"
            }
          },
          "debateSectionId": "dbsect_808",
          "showAs": "Health Services"
        },
        "showAs": " 948. Deputy Michael Collins asked the Minister for Health if the National Women and Infants Health Programme pilot system to collect more information about abortion services in Irish maternity hospitals will record the severity of post-abortion complications; if it will capture data on previous abortions; when it will be initiated; whether the data will be published in the Government's annual reports or otherwise made available publicly; and if she will make a statement on the matter. [52140/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Health",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-30"
    },
    {
      "question": {
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-24/pq_103",
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 103 to 112, inclusive, together.  The State purchase of the Citywest Hotel and Convention Centre for international protection accommodation is now completed.  The purchase of the site is a key part of the Government’s strategy to develop a stable and sustainable accommodation system for people seeking international protection. State-owned centres are part of the Government’s long-term plan to reduce the reliance on private accommodation providers resulting in better value for money of public funds and a more efficient international protection system.  The full purchase price for the Citywest centre (including VAT) was €148,253,530 which is in line with the Government decision of 17 June 2025. Compared to the costs of the previous leasing model, the savings to the State will pay back the purchase price within 4 years. The State is estimated to save €1 billion over 25 years, compared to the current model for leasing the site, while also delivering a permanent State asset.  The Department carried out a number of surveys including technical, mechanical and fire safety for the site as part of a detailed due diligence process followed to secure this purchase  A 12-month transitional service agreement has been put in place with the current provider to oversee the management and provision of accommodation services for both the main hotel and the convention centre. The existing workforce has been maintained under the transitional agreement. Over the coming 12 months a process to tender for a provider to run the Citywest complex will be completed.  The Citywest Hotel and Convention Centre has successfully supported accommodation and decision-processing by the State for a number of years, and currently provides capacity for 2,300 people, with both international protection applicants and people from Ukraine resident in the Hotel and Convention Centre.  The Department does not routinely publish occupancy figures for accommodation centres, for privacy and security reasons, and also because occupancy levels vary from day to day for operational reasons.  In terms of planning permission, this is an existing accommodation centre for people seeking international protection and for people fleeing the war in Ukraine who are Beneficiaries of Temporary Protection which is deemed an exempted development under the Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022).  The Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022) were introduced to assist the State in meeting Ireland’s legal obligation to provide accommodation to international protection applicants.  As a hotel and convention centre, the Citywest Hotel and Convention Centre’s change of use is permitted as exempt development under the provisions of Class 20F of the Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022).  The Regulations 2023 (S.I. 376 of 2023) extended the planning exemption provided by S.I. 605 of 2022, from 31 December 2024 to 31 December 2028.  In terms of other potential purchases, an Expression of Interest (EOI) process was launched in 2024 for the sourcing of suitable properties for acquisition or lease. 134 submissions have been received. These options are being assessed.  IPAS centres are subject to rigorous inspection and oversight. Centres are contractually obligated to be maintained to National Standards, with independent inspection and quality control through either the Health Information and Quality Authority (HIQA) or IPAS-commissioned inspections.  IPAS accommodation centres are staffed by accommodation providers who employ managers and staff working in centres. Centre management is responsible for ensuring that appropriate vetting is in place for various centres and staff, and for providing assurance to IPAS and the Department that this is in place.  Contracts for international protection accommodation are treated as confidential and commercially sensitive, but details of all payments to accommodation providers are published regularly on gov.ie at [ IPAS Statistics/Facts and Figures ].  The Community Engagement Team was established at the end of 2023. In line with commitments in the Programme for Government, since the purchase of the site was confirmed, the Community Engagement Team has been engaging broadly with local stakeholders, including members of the Community Integration Forum in South Dublin County Council.  The Department is committed to ensuring that the local community has access to accurate information and that structures to plan for provision of essential and support services, such as healthcare and education, are in place to assist with the integration process.  Since 19 June 2025, the Community Engagement Team has held 8 engagement meetings with stakeholders and provided 7 information notes to local elected representatives.  A dedicated webpage to support the community to keep them informed of developments has been published at www.gov.ie/citywest and is updated regularly. ",
        "date": "2025-09-24",
        "questionNumber": 103,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/dbsect_137",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/mul@/dbsect_137.xml"
            }
          },
          "debateSectionId": "dbsect_137",
          "showAs": "International Protection"
        },
        "showAs": " 103. Deputy Michael Collins asked the Minister for Justice, Home Affairs and Migration to provide details of all individuals, community groups, elected representatives, NGOs, or other stakeholders met by his Department’s community engagement team in relation to the use of locations (details supplied) for international protection accommodation since January 2021; and the dates and locations of such meetings. [50551/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Justice",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-24"
    },
    {
      "question": {
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-24/pq_104",
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 103 to 112, inclusive, together.  The State purchase of the Citywest Hotel and Convention Centre for international protection accommodation is now completed.  The purchase of the site is a key part of the Government’s strategy to develop a stable and sustainable accommodation system for people seeking international protection. State-owned centres are part of the Government’s long-term plan to reduce the reliance on private accommodation providers resulting in better value for money of public funds and a more efficient international protection system.  The full purchase price for the Citywest centre (including VAT) was €148,253,530 which is in line with the Government decision of 17 June 2025. Compared to the costs of the previous leasing model, the savings to the State will pay back the purchase price within 4 years. The State is estimated to save €1 billion over 25 years, compared to the current model for leasing the site, while also delivering a permanent State asset.  The Department carried out a number of surveys including technical, mechanical and fire safety for the site as part of a detailed due diligence process followed to secure this purchase  A 12-month transitional service agreement has been put in place with the current provider to oversee the management and provision of accommodation services for both the main hotel and the convention centre. The existing workforce has been maintained under the transitional agreement. Over the coming 12 months a process to tender for a provider to run the Citywest complex will be completed.  The Citywest Hotel and Convention Centre has successfully supported accommodation and decision-processing by the State for a number of years, and currently provides capacity for 2,300 people, with both international protection applicants and people from Ukraine resident in the Hotel and Convention Centre.  The Department does not routinely publish occupancy figures for accommodation centres, for privacy and security reasons, and also because occupancy levels vary from day to day for operational reasons.  In terms of planning permission, this is an existing accommodation centre for people seeking international protection and for people fleeing the war in Ukraine who are Beneficiaries of Temporary Protection which is deemed an exempted development under the Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022).  The Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022) were introduced to assist the State in meeting Ireland’s legal obligation to provide accommodation to international protection applicants.  As a hotel and convention centre, the Citywest Hotel and Convention Centre’s change of use is permitted as exempt development under the provisions of Class 20F of the Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022).  The Regulations 2023 (S.I. 376 of 2023) extended the planning exemption provided by S.I. 605 of 2022, from 31 December 2024 to 31 December 2028.  In terms of other potential purchases, an Expression of Interest (EOI) process was launched in 2024 for the sourcing of suitable properties for acquisition or lease. 134 submissions have been received. These options are being assessed.  IPAS centres are subject to rigorous inspection and oversight. Centres are contractually obligated to be maintained to National Standards, with independent inspection and quality control through either the Health Information and Quality Authority (HIQA) or IPAS-commissioned inspections.  IPAS accommodation centres are staffed by accommodation providers who employ managers and staff working in centres. Centre management is responsible for ensuring that appropriate vetting is in place for various centres and staff, and for providing assurance to IPAS and the Department that this is in place.  Contracts for international protection accommodation are treated as confidential and commercially sensitive, but details of all payments to accommodation providers are published regularly on gov.ie at [ IPAS Statistics/Facts and Figures ].  The Community Engagement Team was established at the end of 2023. In line with commitments in the Programme for Government, since the purchase of the site was confirmed, the Community Engagement Team has been engaging broadly with local stakeholders, including members of the Community Integration Forum in South Dublin County Council.  The Department is committed to ensuring that the local community has access to accurate information and that structures to plan for provision of essential and support services, such as healthcare and education, are in place to assist with the integration process.  Since 19 June 2025, the Community Engagement Team has held 8 engagement meetings with stakeholders and provided 7 information notes to local elected representatives.  A dedicated webpage to support the community to keep them informed of developments has been published at www.gov.ie/citywest and is updated regularly. ",
        "date": "2025-09-24",
        "questionNumber": 104,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/dbsect_137",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/mul@/dbsect_137.xml"
            }
          },
          "debateSectionId": "dbsect_137",
          "showAs": "International Protection"
        },
        "showAs": " 104. Deputy Michael Collins asked the Minister for Justice, Home Affairs and Migration to provide monthly data on the occupancy of a location (details supplied) since December 2021, showing maximum and average occupancy figures, categories of residents accommodated for example international protection applicants and beneficiaries of temporary protection from Ukraine; the details of services provided onsite; the number of staff employed by the service providers at the facility; and the total State payments made for this accommodation in 2021 to 2024 and to date in 2025. [50552/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Justice",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-24"
    },
    {
      "question": {
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-24/pq_105",
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 103 to 112, inclusive, together.  The State purchase of the Citywest Hotel and Convention Centre for international protection accommodation is now completed.  The purchase of the site is a key part of the Government’s strategy to develop a stable and sustainable accommodation system for people seeking international protection. State-owned centres are part of the Government’s long-term plan to reduce the reliance on private accommodation providers resulting in better value for money of public funds and a more efficient international protection system.  The full purchase price for the Citywest centre (including VAT) was €148,253,530 which is in line with the Government decision of 17 June 2025. Compared to the costs of the previous leasing model, the savings to the State will pay back the purchase price within 4 years. The State is estimated to save €1 billion over 25 years, compared to the current model for leasing the site, while also delivering a permanent State asset.  The Department carried out a number of surveys including technical, mechanical and fire safety for the site as part of a detailed due diligence process followed to secure this purchase  A 12-month transitional service agreement has been put in place with the current provider to oversee the management and provision of accommodation services for both the main hotel and the convention centre. The existing workforce has been maintained under the transitional agreement. Over the coming 12 months a process to tender for a provider to run the Citywest complex will be completed.  The Citywest Hotel and Convention Centre has successfully supported accommodation and decision-processing by the State for a number of years, and currently provides capacity for 2,300 people, with both international protection applicants and people from Ukraine resident in the Hotel and Convention Centre.  The Department does not routinely publish occupancy figures for accommodation centres, for privacy and security reasons, and also because occupancy levels vary from day to day for operational reasons.  In terms of planning permission, this is an existing accommodation centre for people seeking international protection and for people fleeing the war in Ukraine who are Beneficiaries of Temporary Protection which is deemed an exempted development under the Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022).  The Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022) were introduced to assist the State in meeting Ireland’s legal obligation to provide accommodation to international protection applicants.  As a hotel and convention centre, the Citywest Hotel and Convention Centre’s change of use is permitted as exempt development under the provisions of Class 20F of the Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022).  The Regulations 2023 (S.I. 376 of 2023) extended the planning exemption provided by S.I. 605 of 2022, from 31 December 2024 to 31 December 2028.  In terms of other potential purchases, an Expression of Interest (EOI) process was launched in 2024 for the sourcing of suitable properties for acquisition or lease. 134 submissions have been received. These options are being assessed.  IPAS centres are subject to rigorous inspection and oversight. Centres are contractually obligated to be maintained to National Standards, with independent inspection and quality control through either the Health Information and Quality Authority (HIQA) or IPAS-commissioned inspections.  IPAS accommodation centres are staffed by accommodation providers who employ managers and staff working in centres. Centre management is responsible for ensuring that appropriate vetting is in place for various centres and staff, and for providing assurance to IPAS and the Department that this is in place.  Contracts for international protection accommodation are treated as confidential and commercially sensitive, but details of all payments to accommodation providers are published regularly on gov.ie at [ IPAS Statistics/Facts and Figures ].  The Community Engagement Team was established at the end of 2023. In line with commitments in the Programme for Government, since the purchase of the site was confirmed, the Community Engagement Team has been engaging broadly with local stakeholders, including members of the Community Integration Forum in South Dublin County Council.  The Department is committed to ensuring that the local community has access to accurate information and that structures to plan for provision of essential and support services, such as healthcare and education, are in place to assist with the integration process.  Since 19 June 2025, the Community Engagement Team has held 8 engagement meetings with stakeholders and provided 7 information notes to local elected representatives.  A dedicated webpage to support the community to keep them informed of developments has been published at www.gov.ie/citywest and is updated regularly. ",
        "date": "2025-09-24",
        "questionNumber": 105,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/dbsect_137",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/mul@/dbsect_137.xml"
            }
          },
          "debateSectionId": "dbsect_137",
          "showAs": "International Protection"
        },
        "showAs": " 105. Deputy Michael Collins asked the Minister for Justice, Home Affairs and Migration the number of responses received to the expression of interest issued in or around May 2024 regarding the acquisition, lease, or use of properties for International protection accommodation; if locations (details supplied) were referenced in any such responses; and to provide a list of general geographic areas of properties proposed. [50553/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Justice",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-24"
    },
    {
      "question": {
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-24/pq_106",
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 103 to 112, inclusive, together.  The State purchase of the Citywest Hotel and Convention Centre for international protection accommodation is now completed.  The purchase of the site is a key part of the Government’s strategy to develop a stable and sustainable accommodation system for people seeking international protection. State-owned centres are part of the Government’s long-term plan to reduce the reliance on private accommodation providers resulting in better value for money of public funds and a more efficient international protection system.  The full purchase price for the Citywest centre (including VAT) was €148,253,530 which is in line with the Government decision of 17 June 2025. Compared to the costs of the previous leasing model, the savings to the State will pay back the purchase price within 4 years. The State is estimated to save €1 billion over 25 years, compared to the current model for leasing the site, while also delivering a permanent State asset.  The Department carried out a number of surveys including technical, mechanical and fire safety for the site as part of a detailed due diligence process followed to secure this purchase  A 12-month transitional service agreement has been put in place with the current provider to oversee the management and provision of accommodation services for both the main hotel and the convention centre. The existing workforce has been maintained under the transitional agreement. Over the coming 12 months a process to tender for a provider to run the Citywest complex will be completed.  The Citywest Hotel and Convention Centre has successfully supported accommodation and decision-processing by the State for a number of years, and currently provides capacity for 2,300 people, with both international protection applicants and people from Ukraine resident in the Hotel and Convention Centre.  The Department does not routinely publish occupancy figures for accommodation centres, for privacy and security reasons, and also because occupancy levels vary from day to day for operational reasons.  In terms of planning permission, this is an existing accommodation centre for people seeking international protection and for people fleeing the war in Ukraine who are Beneficiaries of Temporary Protection which is deemed an exempted development under the Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022).  The Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022) were introduced to assist the State in meeting Ireland’s legal obligation to provide accommodation to international protection applicants.  As a hotel and convention centre, the Citywest Hotel and Convention Centre’s change of use is permitted as exempt development under the provisions of Class 20F of the Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022).  The Regulations 2023 (S.I. 376 of 2023) extended the planning exemption provided by S.I. 605 of 2022, from 31 December 2024 to 31 December 2028.  In terms of other potential purchases, an Expression of Interest (EOI) process was launched in 2024 for the sourcing of suitable properties for acquisition or lease. 134 submissions have been received. These options are being assessed.  IPAS centres are subject to rigorous inspection and oversight. Centres are contractually obligated to be maintained to National Standards, with independent inspection and quality control through either the Health Information and Quality Authority (HIQA) or IPAS-commissioned inspections.  IPAS accommodation centres are staffed by accommodation providers who employ managers and staff working in centres. Centre management is responsible for ensuring that appropriate vetting is in place for various centres and staff, and for providing assurance to IPAS and the Department that this is in place.  Contracts for international protection accommodation are treated as confidential and commercially sensitive, but details of all payments to accommodation providers are published regularly on gov.ie at [ IPAS Statistics/Facts and Figures ].  The Community Engagement Team was established at the end of 2023. In line with commitments in the Programme for Government, since the purchase of the site was confirmed, the Community Engagement Team has been engaging broadly with local stakeholders, including members of the Community Integration Forum in South Dublin County Council.  The Department is committed to ensuring that the local community has access to accurate information and that structures to plan for provision of essential and support services, such as healthcare and education, are in place to assist with the integration process.  Since 19 June 2025, the Community Engagement Team has held 8 engagement meetings with stakeholders and provided 7 information notes to local elected representatives.  A dedicated webpage to support the community to keep them informed of developments has been published at www.gov.ie/citywest and is updated regularly. ",
        "date": "2025-09-24",
        "questionNumber": 106,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/dbsect_137",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/mul@/dbsect_137.xml"
            }
          },
          "debateSectionId": "dbsect_137",
          "showAs": "International Protection"
        },
        "showAs": " 106. Deputy Michael Collins asked the Minister for Justice, Home Affairs and Migration to publish or place in the Oireachtas Library the current contracts or service-level agreements governing the use of locations (details supplied) for International protection accommodation; the clauses which exist within these agreements to ensure compliance with statutory requirements including planning permission, fire safety certification, and building control laws; and to confirm whether such compliance documentation has been received and inspected by his Department. [50554/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Justice",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-24"
    },
    {
      "question": {
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-24/pq_107",
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 103 to 112, inclusive, together.  The State purchase of the Citywest Hotel and Convention Centre for international protection accommodation is now completed.  The purchase of the site is a key part of the Government’s strategy to develop a stable and sustainable accommodation system for people seeking international protection. State-owned centres are part of the Government’s long-term plan to reduce the reliance on private accommodation providers resulting in better value for money of public funds and a more efficient international protection system.  The full purchase price for the Citywest centre (including VAT) was €148,253,530 which is in line with the Government decision of 17 June 2025. Compared to the costs of the previous leasing model, the savings to the State will pay back the purchase price within 4 years. The State is estimated to save €1 billion over 25 years, compared to the current model for leasing the site, while also delivering a permanent State asset.  The Department carried out a number of surveys including technical, mechanical and fire safety for the site as part of a detailed due diligence process followed to secure this purchase  A 12-month transitional service agreement has been put in place with the current provider to oversee the management and provision of accommodation services for both the main hotel and the convention centre. The existing workforce has been maintained under the transitional agreement. Over the coming 12 months a process to tender for a provider to run the Citywest complex will be completed.  The Citywest Hotel and Convention Centre has successfully supported accommodation and decision-processing by the State for a number of years, and currently provides capacity for 2,300 people, with both international protection applicants and people from Ukraine resident in the Hotel and Convention Centre.  The Department does not routinely publish occupancy figures for accommodation centres, for privacy and security reasons, and also because occupancy levels vary from day to day for operational reasons.  In terms of planning permission, this is an existing accommodation centre for people seeking international protection and for people fleeing the war in Ukraine who are Beneficiaries of Temporary Protection which is deemed an exempted development under the Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022).  The Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022) were introduced to assist the State in meeting Ireland’s legal obligation to provide accommodation to international protection applicants.  As a hotel and convention centre, the Citywest Hotel and Convention Centre’s change of use is permitted as exempt development under the provisions of Class 20F of the Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022).  The Regulations 2023 (S.I. 376 of 2023) extended the planning exemption provided by S.I. 605 of 2022, from 31 December 2024 to 31 December 2028.  In terms of other potential purchases, an Expression of Interest (EOI) process was launched in 2024 for the sourcing of suitable properties for acquisition or lease. 134 submissions have been received. These options are being assessed.  IPAS centres are subject to rigorous inspection and oversight. Centres are contractually obligated to be maintained to National Standards, with independent inspection and quality control through either the Health Information and Quality Authority (HIQA) or IPAS-commissioned inspections.  IPAS accommodation centres are staffed by accommodation providers who employ managers and staff working in centres. Centre management is responsible for ensuring that appropriate vetting is in place for various centres and staff, and for providing assurance to IPAS and the Department that this is in place.  Contracts for international protection accommodation are treated as confidential and commercially sensitive, but details of all payments to accommodation providers are published regularly on gov.ie at [ IPAS Statistics/Facts and Figures ].  The Community Engagement Team was established at the end of 2023. In line with commitments in the Programme for Government, since the purchase of the site was confirmed, the Community Engagement Team has been engaging broadly with local stakeholders, including members of the Community Integration Forum in South Dublin County Council.  The Department is committed to ensuring that the local community has access to accurate information and that structures to plan for provision of essential and support services, such as healthcare and education, are in place to assist with the integration process.  Since 19 June 2025, the Community Engagement Team has held 8 engagement meetings with stakeholders and provided 7 information notes to local elected representatives.  A dedicated webpage to support the community to keep them informed of developments has been published at www.gov.ie/citywest and is updated regularly. ",
        "date": "2025-09-24",
        "questionNumber": 107,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/dbsect_137",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/mul@/dbsect_137.xml"
            }
          },
          "debateSectionId": "dbsect_137",
          "showAs": "International Protection"
        },
        "showAs": " 107. Deputy Michael Collins asked the Minister for Justice, Home Affairs and Migration to provide the timelines, assessments, or consultations relating to the decision to make the use of locations (details supplied) for International protection accommodation permanent, and the intended use of associated land included in the purchase; and if the Government will commit that no additional buildings will be developed on this land, or no modular homes will be installed for accommodation purposes in the future. [50555/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Justice",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-24"
    },
    {
      "question": {
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-24/pq_108",
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 103 to 112, inclusive, together.  The State purchase of the Citywest Hotel and Convention Centre for international protection accommodation is now completed.  The purchase of the site is a key part of the Government’s strategy to develop a stable and sustainable accommodation system for people seeking international protection. State-owned centres are part of the Government’s long-term plan to reduce the reliance on private accommodation providers resulting in better value for money of public funds and a more efficient international protection system.  The full purchase price for the Citywest centre (including VAT) was €148,253,530 which is in line with the Government decision of 17 June 2025. Compared to the costs of the previous leasing model, the savings to the State will pay back the purchase price within 4 years. The State is estimated to save €1 billion over 25 years, compared to the current model for leasing the site, while also delivering a permanent State asset.  The Department carried out a number of surveys including technical, mechanical and fire safety for the site as part of a detailed due diligence process followed to secure this purchase  A 12-month transitional service agreement has been put in place with the current provider to oversee the management and provision of accommodation services for both the main hotel and the convention centre. The existing workforce has been maintained under the transitional agreement. Over the coming 12 months a process to tender for a provider to run the Citywest complex will be completed.  The Citywest Hotel and Convention Centre has successfully supported accommodation and decision-processing by the State for a number of years, and currently provides capacity for 2,300 people, with both international protection applicants and people from Ukraine resident in the Hotel and Convention Centre.  The Department does not routinely publish occupancy figures for accommodation centres, for privacy and security reasons, and also because occupancy levels vary from day to day for operational reasons.  In terms of planning permission, this is an existing accommodation centre for people seeking international protection and for people fleeing the war in Ukraine who are Beneficiaries of Temporary Protection which is deemed an exempted development under the Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022).  The Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022) were introduced to assist the State in meeting Ireland’s legal obligation to provide accommodation to international protection applicants.  As a hotel and convention centre, the Citywest Hotel and Convention Centre’s change of use is permitted as exempt development under the provisions of Class 20F of the Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022).  The Regulations 2023 (S.I. 376 of 2023) extended the planning exemption provided by S.I. 605 of 2022, from 31 December 2024 to 31 December 2028.  In terms of other potential purchases, an Expression of Interest (EOI) process was launched in 2024 for the sourcing of suitable properties for acquisition or lease. 134 submissions have been received. These options are being assessed.  IPAS centres are subject to rigorous inspection and oversight. Centres are contractually obligated to be maintained to National Standards, with independent inspection and quality control through either the Health Information and Quality Authority (HIQA) or IPAS-commissioned inspections.  IPAS accommodation centres are staffed by accommodation providers who employ managers and staff working in centres. Centre management is responsible for ensuring that appropriate vetting is in place for various centres and staff, and for providing assurance to IPAS and the Department that this is in place.  Contracts for international protection accommodation are treated as confidential and commercially sensitive, but details of all payments to accommodation providers are published regularly on gov.ie at [ IPAS Statistics/Facts and Figures ].  The Community Engagement Team was established at the end of 2023. In line with commitments in the Programme for Government, since the purchase of the site was confirmed, the Community Engagement Team has been engaging broadly with local stakeholders, including members of the Community Integration Forum in South Dublin County Council.  The Department is committed to ensuring that the local community has access to accurate information and that structures to plan for provision of essential and support services, such as healthcare and education, are in place to assist with the integration process.  Since 19 June 2025, the Community Engagement Team has held 8 engagement meetings with stakeholders and provided 7 information notes to local elected representatives.  A dedicated webpage to support the community to keep them informed of developments has been published at www.gov.ie/citywest and is updated regularly. ",
        "date": "2025-09-24",
        "questionNumber": 108,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/dbsect_137",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/mul@/dbsect_137.xml"
            }
          },
          "debateSectionId": "dbsect_137",
          "showAs": "International Protection"
        },
        "showAs": " 108. Deputy Michael Collins asked the Minister for Justice, Home Affairs and Migration whether any value for money assessments or independent evaluations have been conducted in relation to the State’s purchase of a location (details supplied); and if he will publish the results. [50556/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Justice",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-24"
    },
    {
      "question": {
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-24/pq_109",
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 103 to 112, inclusive, together.  The State purchase of the Citywest Hotel and Convention Centre for international protection accommodation is now completed.  The purchase of the site is a key part of the Government’s strategy to develop a stable and sustainable accommodation system for people seeking international protection. State-owned centres are part of the Government’s long-term plan to reduce the reliance on private accommodation providers resulting in better value for money of public funds and a more efficient international protection system.  The full purchase price for the Citywest centre (including VAT) was €148,253,530 which is in line with the Government decision of 17 June 2025. Compared to the costs of the previous leasing model, the savings to the State will pay back the purchase price within 4 years. The State is estimated to save €1 billion over 25 years, compared to the current model for leasing the site, while also delivering a permanent State asset.  The Department carried out a number of surveys including technical, mechanical and fire safety for the site as part of a detailed due diligence process followed to secure this purchase  A 12-month transitional service agreement has been put in place with the current provider to oversee the management and provision of accommodation services for both the main hotel and the convention centre. The existing workforce has been maintained under the transitional agreement. Over the coming 12 months a process to tender for a provider to run the Citywest complex will be completed.  The Citywest Hotel and Convention Centre has successfully supported accommodation and decision-processing by the State for a number of years, and currently provides capacity for 2,300 people, with both international protection applicants and people from Ukraine resident in the Hotel and Convention Centre.  The Department does not routinely publish occupancy figures for accommodation centres, for privacy and security reasons, and also because occupancy levels vary from day to day for operational reasons.  In terms of planning permission, this is an existing accommodation centre for people seeking international protection and for people fleeing the war in Ukraine who are Beneficiaries of Temporary Protection which is deemed an exempted development under the Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022).  The Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022) were introduced to assist the State in meeting Ireland’s legal obligation to provide accommodation to international protection applicants.  As a hotel and convention centre, the Citywest Hotel and Convention Centre’s change of use is permitted as exempt development under the provisions of Class 20F of the Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022).  The Regulations 2023 (S.I. 376 of 2023) extended the planning exemption provided by S.I. 605 of 2022, from 31 December 2024 to 31 December 2028.  In terms of other potential purchases, an Expression of Interest (EOI) process was launched in 2024 for the sourcing of suitable properties for acquisition or lease. 134 submissions have been received. These options are being assessed.  IPAS centres are subject to rigorous inspection and oversight. Centres are contractually obligated to be maintained to National Standards, with independent inspection and quality control through either the Health Information and Quality Authority (HIQA) or IPAS-commissioned inspections.  IPAS accommodation centres are staffed by accommodation providers who employ managers and staff working in centres. Centre management is responsible for ensuring that appropriate vetting is in place for various centres and staff, and for providing assurance to IPAS and the Department that this is in place.  Contracts for international protection accommodation are treated as confidential and commercially sensitive, but details of all payments to accommodation providers are published regularly on gov.ie at [ IPAS Statistics/Facts and Figures ].  The Community Engagement Team was established at the end of 2023. In line with commitments in the Programme for Government, since the purchase of the site was confirmed, the Community Engagement Team has been engaging broadly with local stakeholders, including members of the Community Integration Forum in South Dublin County Council.  The Department is committed to ensuring that the local community has access to accurate information and that structures to plan for provision of essential and support services, such as healthcare and education, are in place to assist with the integration process.  Since 19 June 2025, the Community Engagement Team has held 8 engagement meetings with stakeholders and provided 7 information notes to local elected representatives.  A dedicated webpage to support the community to keep them informed of developments has been published at www.gov.ie/citywest and is updated regularly. ",
        "date": "2025-09-24",
        "questionNumber": 109,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/dbsect_137",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/mul@/dbsect_137.xml"
            }
          },
          "debateSectionId": "dbsect_137",
          "showAs": "International Protection"
        },
        "showAs": " 109. Deputy Michael Collins asked the Minister for Justice, Home Affairs and Migration if his Department has carried out an assessment of the impact of the use on local services including schools, healthcare, and transport of a facility (details supplied); and if he will provide copies of the assessments. [50557/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Justice",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-24"
    },
    {
      "question": {
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-24/pq_110",
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 103 to 112, inclusive, together.  The State purchase of the Citywest Hotel and Convention Centre for international protection accommodation is now completed.  The purchase of the site is a key part of the Government’s strategy to develop a stable and sustainable accommodation system for people seeking international protection. State-owned centres are part of the Government’s long-term plan to reduce the reliance on private accommodation providers resulting in better value for money of public funds and a more efficient international protection system.  The full purchase price for the Citywest centre (including VAT) was €148,253,530 which is in line with the Government decision of 17 June 2025. Compared to the costs of the previous leasing model, the savings to the State will pay back the purchase price within 4 years. The State is estimated to save €1 billion over 25 years, compared to the current model for leasing the site, while also delivering a permanent State asset.  The Department carried out a number of surveys including technical, mechanical and fire safety for the site as part of a detailed due diligence process followed to secure this purchase  A 12-month transitional service agreement has been put in place with the current provider to oversee the management and provision of accommodation services for both the main hotel and the convention centre. The existing workforce has been maintained under the transitional agreement. Over the coming 12 months a process to tender for a provider to run the Citywest complex will be completed.  The Citywest Hotel and Convention Centre has successfully supported accommodation and decision-processing by the State for a number of years, and currently provides capacity for 2,300 people, with both international protection applicants and people from Ukraine resident in the Hotel and Convention Centre.  The Department does not routinely publish occupancy figures for accommodation centres, for privacy and security reasons, and also because occupancy levels vary from day to day for operational reasons.  In terms of planning permission, this is an existing accommodation centre for people seeking international protection and for people fleeing the war in Ukraine who are Beneficiaries of Temporary Protection which is deemed an exempted development under the Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022).  The Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022) were introduced to assist the State in meeting Ireland’s legal obligation to provide accommodation to international protection applicants.  As a hotel and convention centre, the Citywest Hotel and Convention Centre’s change of use is permitted as exempt development under the provisions of Class 20F of the Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022).  The Regulations 2023 (S.I. 376 of 2023) extended the planning exemption provided by S.I. 605 of 2022, from 31 December 2024 to 31 December 2028.  In terms of other potential purchases, an Expression of Interest (EOI) process was launched in 2024 for the sourcing of suitable properties for acquisition or lease. 134 submissions have been received. These options are being assessed.  IPAS centres are subject to rigorous inspection and oversight. Centres are contractually obligated to be maintained to National Standards, with independent inspection and quality control through either the Health Information and Quality Authority (HIQA) or IPAS-commissioned inspections.  IPAS accommodation centres are staffed by accommodation providers who employ managers and staff working in centres. Centre management is responsible for ensuring that appropriate vetting is in place for various centres and staff, and for providing assurance to IPAS and the Department that this is in place.  Contracts for international protection accommodation are treated as confidential and commercially sensitive, but details of all payments to accommodation providers are published regularly on gov.ie at [ IPAS Statistics/Facts and Figures ].  The Community Engagement Team was established at the end of 2023. In line with commitments in the Programme for Government, since the purchase of the site was confirmed, the Community Engagement Team has been engaging broadly with local stakeholders, including members of the Community Integration Forum in South Dublin County Council.  The Department is committed to ensuring that the local community has access to accurate information and that structures to plan for provision of essential and support services, such as healthcare and education, are in place to assist with the integration process.  Since 19 June 2025, the Community Engagement Team has held 8 engagement meetings with stakeholders and provided 7 information notes to local elected representatives.  A dedicated webpage to support the community to keep them informed of developments has been published at www.gov.ie/citywest and is updated regularly. ",
        "date": "2025-09-24",
        "questionNumber": 110,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/dbsect_137",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/mul@/dbsect_137.xml"
            }
          },
          "debateSectionId": "dbsect_137",
          "showAs": "International Protection"
        },
        "showAs": " 110. Deputy Michael Collins asked the Minister for Justice, Home Affairs and Migration the inspections which have been carried out by independent bodies such as fire services, local authorities, or HIQA in relation to the use of a facilities (details supplied) as accommodation; and to publish the findings. [50558/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Justice",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-24"
    },
    {
      "question": {
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-24/pq_111",
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 103 to 112, inclusive, together.  The State purchase of the Citywest Hotel and Convention Centre for international protection accommodation is now completed.  The purchase of the site is a key part of the Government’s strategy to develop a stable and sustainable accommodation system for people seeking international protection. State-owned centres are part of the Government’s long-term plan to reduce the reliance on private accommodation providers resulting in better value for money of public funds and a more efficient international protection system.  The full purchase price for the Citywest centre (including VAT) was €148,253,530 which is in line with the Government decision of 17 June 2025. Compared to the costs of the previous leasing model, the savings to the State will pay back the purchase price within 4 years. The State is estimated to save €1 billion over 25 years, compared to the current model for leasing the site, while also delivering a permanent State asset.  The Department carried out a number of surveys including technical, mechanical and fire safety for the site as part of a detailed due diligence process followed to secure this purchase  A 12-month transitional service agreement has been put in place with the current provider to oversee the management and provision of accommodation services for both the main hotel and the convention centre. The existing workforce has been maintained under the transitional agreement. Over the coming 12 months a process to tender for a provider to run the Citywest complex will be completed.  The Citywest Hotel and Convention Centre has successfully supported accommodation and decision-processing by the State for a number of years, and currently provides capacity for 2,300 people, with both international protection applicants and people from Ukraine resident in the Hotel and Convention Centre.  The Department does not routinely publish occupancy figures for accommodation centres, for privacy and security reasons, and also because occupancy levels vary from day to day for operational reasons.  In terms of planning permission, this is an existing accommodation centre for people seeking international protection and for people fleeing the war in Ukraine who are Beneficiaries of Temporary Protection which is deemed an exempted development under the Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022).  The Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022) were introduced to assist the State in meeting Ireland’s legal obligation to provide accommodation to international protection applicants.  As a hotel and convention centre, the Citywest Hotel and Convention Centre’s change of use is permitted as exempt development under the provisions of Class 20F of the Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022).  The Regulations 2023 (S.I. 376 of 2023) extended the planning exemption provided by S.I. 605 of 2022, from 31 December 2024 to 31 December 2028.  In terms of other potential purchases, an Expression of Interest (EOI) process was launched in 2024 for the sourcing of suitable properties for acquisition or lease. 134 submissions have been received. These options are being assessed.  IPAS centres are subject to rigorous inspection and oversight. Centres are contractually obligated to be maintained to National Standards, with independent inspection and quality control through either the Health Information and Quality Authority (HIQA) or IPAS-commissioned inspections.  IPAS accommodation centres are staffed by accommodation providers who employ managers and staff working in centres. Centre management is responsible for ensuring that appropriate vetting is in place for various centres and staff, and for providing assurance to IPAS and the Department that this is in place.  Contracts for international protection accommodation are treated as confidential and commercially sensitive, but details of all payments to accommodation providers are published regularly on gov.ie at [ IPAS Statistics/Facts and Figures ].  The Community Engagement Team was established at the end of 2023. In line with commitments in the Programme for Government, since the purchase of the site was confirmed, the Community Engagement Team has been engaging broadly with local stakeholders, including members of the Community Integration Forum in South Dublin County Council.  The Department is committed to ensuring that the local community has access to accurate information and that structures to plan for provision of essential and support services, such as healthcare and education, are in place to assist with the integration process.  Since 19 June 2025, the Community Engagement Team has held 8 engagement meetings with stakeholders and provided 7 information notes to local elected representatives.  A dedicated webpage to support the community to keep them informed of developments has been published at www.gov.ie/citywest and is updated regularly. ",
        "date": "2025-09-24",
        "questionNumber": 111,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/dbsect_137",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/mul@/dbsect_137.xml"
            }
          },
          "debateSectionId": "dbsect_137",
          "showAs": "International Protection"
        },
        "showAs": " 111. Deputy Michael Collins asked the Minister for Justice, Home Affairs and Migration to provide details of Garda vetting and training requirements for staff working at facilities (details supplied); and if audits have been carried out to ensure compliance. [50559/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Justice",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-24"
    },
    {
      "question": {
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-24/pq_112",
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 103 to 112, inclusive, together.  The State purchase of the Citywest Hotel and Convention Centre for international protection accommodation is now completed.  The purchase of the site is a key part of the Government’s strategy to develop a stable and sustainable accommodation system for people seeking international protection. State-owned centres are part of the Government’s long-term plan to reduce the reliance on private accommodation providers resulting in better value for money of public funds and a more efficient international protection system.  The full purchase price for the Citywest centre (including VAT) was €148,253,530 which is in line with the Government decision of 17 June 2025. Compared to the costs of the previous leasing model, the savings to the State will pay back the purchase price within 4 years. The State is estimated to save €1 billion over 25 years, compared to the current model for leasing the site, while also delivering a permanent State asset.  The Department carried out a number of surveys including technical, mechanical and fire safety for the site as part of a detailed due diligence process followed to secure this purchase  A 12-month transitional service agreement has been put in place with the current provider to oversee the management and provision of accommodation services for both the main hotel and the convention centre. The existing workforce has been maintained under the transitional agreement. Over the coming 12 months a process to tender for a provider to run the Citywest complex will be completed.  The Citywest Hotel and Convention Centre has successfully supported accommodation and decision-processing by the State for a number of years, and currently provides capacity for 2,300 people, with both international protection applicants and people from Ukraine resident in the Hotel and Convention Centre.  The Department does not routinely publish occupancy figures for accommodation centres, for privacy and security reasons, and also because occupancy levels vary from day to day for operational reasons.  In terms of planning permission, this is an existing accommodation centre for people seeking international protection and for people fleeing the war in Ukraine who are Beneficiaries of Temporary Protection which is deemed an exempted development under the Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022).  The Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022) were introduced to assist the State in meeting Ireland’s legal obligation to provide accommodation to international protection applicants.  As a hotel and convention centre, the Citywest Hotel and Convention Centre’s change of use is permitted as exempt development under the provisions of Class 20F of the Planning and Development (Exempted Development) (No. 4) Regulations (S.I. 605 of 2022).  The Regulations 2023 (S.I. 376 of 2023) extended the planning exemption provided by S.I. 605 of 2022, from 31 December 2024 to 31 December 2028.  In terms of other potential purchases, an Expression of Interest (EOI) process was launched in 2024 for the sourcing of suitable properties for acquisition or lease. 134 submissions have been received. These options are being assessed.  IPAS centres are subject to rigorous inspection and oversight. Centres are contractually obligated to be maintained to National Standards, with independent inspection and quality control through either the Health Information and Quality Authority (HIQA) or IPAS-commissioned inspections.  IPAS accommodation centres are staffed by accommodation providers who employ managers and staff working in centres. Centre management is responsible for ensuring that appropriate vetting is in place for various centres and staff, and for providing assurance to IPAS and the Department that this is in place.  Contracts for international protection accommodation are treated as confidential and commercially sensitive, but details of all payments to accommodation providers are published regularly on gov.ie at [ IPAS Statistics/Facts and Figures ].  The Community Engagement Team was established at the end of 2023. In line with commitments in the Programme for Government, since the purchase of the site was confirmed, the Community Engagement Team has been engaging broadly with local stakeholders, including members of the Community Integration Forum in South Dublin County Council.  The Department is committed to ensuring that the local community has access to accurate information and that structures to plan for provision of essential and support services, such as healthcare and education, are in place to assist with the integration process.  Since 19 June 2025, the Community Engagement Team has held 8 engagement meetings with stakeholders and provided 7 information notes to local elected representatives.  A dedicated webpage to support the community to keep them informed of developments has been published at www.gov.ie/citywest and is updated regularly. ",
        "date": "2025-09-24",
        "questionNumber": 112,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/dbsect_137",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-24/writtens/mul@/dbsect_137.xml"
            }
          },
          "debateSectionId": "dbsect_137",
          "showAs": "International Protection"
        },
        "showAs": " 112. Deputy Michael Collins asked the Minister for Justice, Home Affairs and Migration the legal basis on which the use of locations (details supplied) proceeded without planning permission or exemption being sought; and if his Department accepts that this sets a precedent for future developments [50560/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Justice",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-24"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03"
        },
        "showAs": " 1075. Deputy Michael Collins asked the Minister for Children, Disability and Equality the number of early years services, excluding child minders, which have signed up to the core funding partnership from September 2025 to September 2026. [48254/25] ",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_887.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_887",
          "showAs": "Childcare Services",
          "debateSectionId": "dbsect_887"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_1075",
        "answerText": " Minister for Children, Disability and Equality  As of 15 September 2025, 4,250 early learning and childcare services, excluding childminders, have signed up for the fourth year of Core Funding. This is nearly 5% higher than the number of services signed up to Core Funding at this time last year, and represents nearly 90% uptake by eligible services.  Core Funding remains open year-round to applicants and we will continue to see this number grow. For this reason, it is not yet possible to make an accurate assessment regarding the number of services that will sign up between now and the end of the programme year in August 2026.  I welcome the services entering into this partnership with the State. Widespread uptake of Core Funding will ensure that these services will benefit from over €390 million in State funding for the fourth programme year of Core Funding, while guaranteeing that affordability measures are passed on to as many families as possible. I look forward to working with these services in the coming year in the delivery of this invaluable service for the public good. ",
        "questionNumber": 1075
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03"
        },
        "showAs": " 1076. Deputy Michael Collins asked the Minister for Children, Disability and Equality the number of early years services, excluding child minders, which are on the Tusla register in September 2025. [48255/25] ",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_888.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_888",
          "showAs": "Childcare Services",
          "debateSectionId": "dbsect_888"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_1076",
        "answerText": " Minister for Children, Disability and Equality  As the subject matter of the Deputy's question relates to an operational matter for Tusla, I have referred the matter to them for a direct reply. ",
        "questionNumber": 1076
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03"
        },
        "showAs": " 1077. Deputy Michael Collins asked the Minister for Children, Disability and Equality the number of early years services, excluding child minders, in existence before the core funding partnership started in September 2021. [48256/25] ",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_889.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_889",
          "showAs": "Childcare Services",
          "debateSectionId": "dbsect_889"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_1077",
        "answerText": " Minister for Children, Disability and Equality  As the subject matter of the Deputy's question relates to an operational matter for Tusla, I have referred the matter to them for a direct reply. ",
        "questionNumber": 1077
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03"
        },
        "showAs": " 1084. Deputy Michael Collins asked the Minister for Children, Disability and Equality the number of child protection officers working with Tusla in 2023, 2024 and 2025. [48475/25] ",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_896.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_896",
          "showAs": "Child and Family Agency",
          "debateSectionId": "dbsect_896"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_1084",
        "answerText": " Minister for Children, Disability and Equality  Statutory and operational responsibility for the delivery of child protection and welfare services is a matter for Tusla, the Child and Family Agency. The Deputy is seeking information in relation to an operational matter for Tusla. Consequently, I have referred the matter to Tusla, and requested that a direct response be provided to the Deputy. ",
        "questionNumber": 1084
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Culture",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1064. Deputy Michael Collins asked the Minister for Culture, Communications and Sport if he will expedite the approval process for a project (details supplied); and if he will make a statement on the matter. [44717/25] ",
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_1064",
        "questionNumber": 1064,
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  The organisation referred to by the Deputy was provisionally allocated grant funding of €347,490 under the 2023 round of the Community Sport Facilities Fund. My Department has been in contact with the organisation and formal approval was granted for this funding on 20 August 2025. ",
        "debateSection": {
          "showAs": "Horse Racing Industry",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_903",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_903.xml"
            }
          },
          "debateSectionId": "dbsect_903"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Social",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1327. Deputy Michael Collins asked the Minister for Social Protection to consider waiving the means test on foster care families (details supplied); and if he will make a statement on the matter. [44606/25] ",
        "by": {
          "memberCode": "Michael-Collins.D.2016-10-03",
          "showAs": "Michael Collins",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Michael-Collins.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_1327",
        "questionNumber": 1327,
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 1327, 1339, 1340 and 1352 together.  This Government acknowledges the important role that carers, including foster carers, play and remains fully committed to supporting them. That is why I was really pleased to announce extending eligibility for the Back-to-School Clothing and Footwear Allowance to children for whom Foster Care Allowance is being paid on the same basis as all other eligible families.  The Back-to-School Clothing and Footwear Allowance scheme provides a once-off payment to eligible families to assist with the costs of clothing and footwear when children start or return to school each autumn. The scheme operates from June to September each year.  In order to qualify for Back-to-School Clothing and Footwear Allowance, an applicant must satisfy a number of qualifying conditions, including the applicant must be in receipt of a qualifying payment and the applicant’s household income must be within the relevant income limits. The income limits for the scheme are increased annually as part of the budget process.  The Weekly Household Income Limits for 2025 are:      No. of Children      Income Limit       1 child    €694.00      2 children    €756.00      3 children    €818.00      4 children*    €880.00     * Limit is increased by €62 for each additional child.  The household income includes weekly social protection payments, gross income from employment, minus employees PRSI and a €20 travel allowance and any other income the household may have.  Any income from Foster Care Allowance, Working Family Payment, Child Benefit, Rent Supplement, Back to Work Family Dividend, Guardian’s Payments, Domiciliary Care Allowance, Blind Welfare Allowance and Higher-Level Education grants is not assessable. Rehabilitative employment (up to €165 per week) is also not assessable.  It is expected some 2,300 children in foster care will now be eligible for the Back-to-School Clothing and Footwear Allowance and I encourage foster care families to apply for the allowance.  Any proposed changes to the Back to School Clothing and Footwear Allowance scheme would have to be considered in a wider budgetary context and within the scope of the overall resources available for welfare improvements.  I trust this clarifies the matter for the Deputy. ",
        "debateSection": {
          "showAs": "Social Welfare Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_1109",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_1109.xml"
            }
          },
          "debateSectionId": "dbsect_1109"
        }
      },
      "contextDate": "2025-09-08"
    }
  ]
}