{
  "head": {
    "counts": {
      "questionCount": 2502,
      "resultCount": 2502
    }
  },
  "results": [
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 48. Deputy Mairéad Farrell asked the Minister for Children, Disability and Equality the way in which her Department intends to support and develop Irish language naíonraí, particularly those in the Gaeltacht; if she plans to develop a new recognition scheme for Irish language naíonraí; and if she will make a statement on the matter. [73193/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_90",
          "debateSectionId": "dbsect_90",
          "showAs": "Irish Language",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_90.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_48",
        "questionNumber": 48
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 52. Deputy Mairéad Farrell asked the Minister for Children, Disability and Equality the work her Department is undertaking to improve access to respite in Galway; and if she will make a statement on the matter. [73191/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_95",
          "debateSectionId": "dbsect_95",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_95.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_52",
        "questionNumber": 52
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 141, 143 and 290 together.  The Climate Action Plan sets out policies, measures and actions to be taken to achieve sectoral emissions ceilings for the residential sector. These measures include the retrofit of existing homes and installation of heat pumps to support the achievement of the required emissions reductions.  The National Retrofit Plan sets out the Government’s approach to delivering on these targets. The plan itself is built on four key pillars of demand, supply, financing and governance, with actions and initiatives flowing from each.  A range of measures has been introduced under the National Retrofit Plan across recent years to support continued growth, including simplifying application processes, expanding eligibility, prioritising worst performing homes, expanding deep retrofits, growing the numbers of One Stop Shops, as well as progressing projects piloting new supports.  The measures introduced are translating into delivery. SEAI data show that in the ten years since 2015 almost 274,000 home energy upgrades were supported and, of these, almost 60,500 were to a BER B2 or better energy efficiency rating, representing sustained and significant increases each year. This is despite the significant interruption across most of 2020 and 2021 due to the COVID-19 pandemic. Regarding 2025, data from SEAI to end November show the number of home energy upgrades at 52,416 of which 23,304 were to a BER rating of B2 or higher.  Budget 2026 announced a record Exchequer funding allocation of €558 million from the carbon tax for SEAI residential and community energy upgrades, including the Solar PV Scheme. This is an €89 million increase on last year’s carbon tax allocation and means that more funding than ever will be available to make homes warmer, healthier and less expensive to heat.  Increasing the uptake of energy efficiency measures among homeowners continues to be a key priority for my Department working in partnership with the SEAI. Further policies and measures will be introduced on an annual basis to support the achievement of our retrofit and heat pump targets.  The most recently published statistics for SEAI residential and community energy retrofit programmes by scheme, county, measure type, and more can be found on the SEAI website at: www.seai.ie/grants/home-energy-grants/home-upgrades ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 141. Deputy Mairéad Farrell asked the Minister for Climate, Energy and the Environment if he could provide an update on the retrofitting schemes; and provide a detailed timeline of how the 2030 target of 500,000 retrofitted homes will be met; and if he will make a statement on the matter. [73222/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_172",
          "debateSectionId": "dbsect_172",
          "showAs": "Energy Conservation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_172.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_141",
        "questionNumber": 141
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 142 and 157 together.  Regulation of retail energy markets is solely a matter for the Commission for Regulation of Utilities (CRU) since the enactment of the Electricity Regulation Act 1999, and subsequent legislation. The CRU is an independent regulator, accountable to the Oireachtas and not to me as Minister. However, officials from my Department engage with the CRU on an ongoing basis to track developments in retail and wholesale energy markets.  The latest data from Eurostat shows that, in nominal terms, Ireland ranked fifth for electricity prices and eighth for household gas prices among European countries in the first half of 2025. When adjusting for purchasing power parity, Ireland is mid-table in terms of energy affordability with the twelfth highest electricity and gas prices among European countries.  The CRU published a report on retail energy markets in September 2023 in relation to competition and supplier pricing in the energy market. The report was in response to a request by the then Minister for the Environment, Climate and Communications to examine supplier hedging practices and pricing strategies in the Irish energy market. Based on a review of supplier prices and wholesale market costs, the CRU considered that retail prices are broadly continuing to reflect underlying cost drivers, such as wholesale gas and electricity prices, but with a lag period due to supplier hedging strategies.  The CRU also published a report comparing household electricity and gas prices between Ireland and other European countries in 2024. This report outlined that hedging strategies employed by energy suppliers lessened the impact of price increases for households but resulted in elevated retail prices when compared to other European countries.  Under the Programme for Government 2025, we have committed to commissioning an independent review into the speed and level of pass through from wholesale prices to retail prices, with an additional assessment of the overall price dynamics and a focus on the competitiveness of the Irish economy. I have written to the CRU to commence work on this review and my officials have held initial discussions with the regulator in relation to progressing this commitment.  My Department has also established a cross-Government National Energy Affordability Taskforce to identify, assess and implement measures that will enhance energy affordability for households and businesses, while delivering key renewable commitments and protecting security of supply and economic stability.  The taskforce's first report set out measures for consideration as part of the Budget 2026 process. This report has been published on Gov.ie, in advance of further analysis and the publication of the Energy Affordability Action Plan in 2026. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 157. Deputy Mairéad Farrell asked the Minister for Climate, Energy and the Environment if his attention has been drawn to the gap between retail and wholesale prices of energy in Ireland, which is the highest in the world, and how energy prices have fallen much more slowly in Ireland relative to other EU countries; and if he will make a statement on the matter. [73223/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_173",
          "debateSectionId": "dbsect_173",
          "showAs": "Energy Prices",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_173.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_157",
        "questionNumber": 157
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 201 and 363 together.  I am advised by Revenue that it is estimated that just under 36.5 per cent of taxpayer units (approximately 1.28 million) will remain outside the income tax net in 2026 (7.4 per cent exempt and 29.1 per cent whose income tax liability will be fully covered by their tax credits). This equates to approximately 23,000 taxpayer units or 1.0 per cent who in 2026 have a net income tax liability where they did not have a liability in 2025.  I am further advised by Revenue, that it is estimated that an additional 76,400 taxpayer units will be subject to the higher rate of income tax in 2026 compared to 2025. As a result, it is expected that approximately 30.3 per cent of taxpayer units will pay the higher rate of income tax in 2026 compared to 28.3 per cent in 2025.  As the Deputy will be aware, Budgets are about choices. This Budget was designed to boost our economic resilience and to support workers and growth in their income by investing in jobs and in their future. This is the first of five Budgets to be delivered by this Government, and the Government remains committed and will stand by the Programme for Government commitment to make progressive changes to personal income tax, if the economy remains strong. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 201. Deputy Mairéad Farrell asked the Tánaiste and Minister for Finance the number of workers his Department has forecast to move up an income tax band in 2026, as a result of the freezing of income tax bands within Budget 2026; and if he will make a statement on the matter. [73184/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_215",
          "debateSectionId": "dbsect_215",
          "showAs": "Tax Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_215.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_201",
        "questionNumber": 201
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I am aware of the issue of payment fraud, including payment fraud that is carried out through online banking apps offered by both traditional and digital banks.  The introduction of strong customer authentication under the second Payment Services Directive reduced unauthorised payment fraud, where a stolen payment instrument such as a card is used to make fraudulent payment transactions.  However, fraudsters have adapted by manipulating victims into authorising fraudulent payments often via online banking apps. This type of fraud is known as impersonation or Authorised Push Payment (APP) fraud and has been on the rise across the EU.  The Instant Payments Regulation introduced an IBAN/name check, which applies to both instant payments and standard credit transfers and is now in effect. This measure reduces payment fraud by alerting the payer when the name of the account they are sending money to does not match the name they have inputted.  In the EU, the Payment Services Regulation has recently reached political agreement. Anti-fraud measures in the regulation include bank liability for losses from impersonation fraud when the bank is impersonated, spending limits, expanded transaction monitoring, fraud information sharing arrangements, and anti-fraud education and awareness.  The compromise agreement includes a requirement for search engines and social media platforms to verify that persons advertising financial services on their platforms have the necessary regulatory authorisation to provide those financial services. This measure is based on a proposal brought forward by Ireland during legislative negotiations. It aims to prevent fraudsters from placing adverts for fake financial services on online platforms.  Domestically, the National Payments Strategy makes several recommendations related to payment fraud. One key outcome has been the establishment of the BPFI anti-fraud forum. The anti-fraud forum fosters cross-sectoral cooperation in fraud prevention between key players such as banks, social media platforms, telecommunications, and regulatory authorities. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 205. Deputy Mairéad Farrell asked the Tánaiste and Minister for Finance if his attention has been drawn to payment app fraud using digital banks; and if he will make a statement on the matter. [73185/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_219",
          "debateSectionId": "dbsect_219",
          "showAs": "Banking Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_219.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_205",
        "questionNumber": 205
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  On 3 December 2025, the Government published the Accelerating Infrastructure  Report and Action Plan. One of the 30 specific actions listed is Action 15 titled “Enable Developer-led Infrastructure”. Advancing regulations to enable private wire electricity connection in line with the Government's Private Wires Policy Statement is listed as a sub-action under Action 15.  Having received Government approval for the Private Wires Policy Statement in July this year, my Department has initiated the process of drafting the subsequent necessary Private Wires legislation. The Private Wires Policy Statement signals a significant reform of the rules that govern electricity infrastructure. It will unlock private sector investment in electricity infrastructure, particularly renewable generation and storage. Under the Private Wires Policy, it will be permissible for an electricity wire to be privately owned in 4 limited circumstances, namely to:  1. permit for a private wire to link a single user of electricity to a separate singular generation asset. This connection may also include storage technologies;  2. facilitate Hybrid connections;  3. allow on street charging of Electric Vehicles; and  4. allow a customer that self-supplies electricity to provide electricity to a separate customer in a contiguous premises.  Engagement with key stakeholders such as ESBN, the CRU, the Department of Transport and others has commenced and is ongoing. The General Scheme of the Private Wires Bill was approved by Government on 16 December. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 273. Deputy Mairéad Farrell asked the Minister for Climate, Energy and the Environment to provide more detail on the private wires element of Action 15, Enable Developer-led Infrastructure, within the Government’s new infrastructure plan, Accelerating Infrastructure Report and Action Plan; and if he will make a statement on the matter. [71511/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_282",
          "debateSectionId": "dbsect_282",
          "showAs": "Energy Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_282.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_273",
        "questionNumber": 273
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 201 and 363 together.  I am advised by Revenue that it is estimated that just under 36.5 per cent of taxpayer units (approximately 1.28 million) will remain outside the income tax net in 2026 (7.4 per cent exempt and 29.1 per cent whose income tax liability will be fully covered by their tax credits). This equates to approximately 23,000 taxpayer units or 1.0 per cent who in 2026 have a net income tax liability where they did not have a liability in 2025.  I am further advised by Revenue, that it is estimated that an additional 76,400 taxpayer units will be subject to the higher rate of income tax in 2026 compared to 2025. As a result, it is expected that approximately 30.3 per cent of taxpayer units will pay the higher rate of income tax in 2026 compared to 28.3 per cent in 2025.  As the Deputy will be aware, Budgets are about choices. This Budget was designed to boost our economic resilience and to support workers and growth in their income by investing in jobs and in their future. This is the first of five Budgets to be delivered by this Government, and the Government remains committed and will stand by the Programme for Government commitment to make progressive changes to personal income tax, if the economy remains strong. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 363. Deputy Mairéad Farrell asked the Tánaiste and Minister for Finance the number of people the Government expects to move up an income tax band in 2026, as a result of the freezing of income tax bands within b##udget 2026; and if he will make a statement on the matter.  [69527/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_215",
          "debateSectionId": "dbsect_215",
          "showAs": "Tax Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_215.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_363",
        "questionNumber": 363
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  The scientific catch advice on salmon fisheries for the 2026 season is provided by the Technical Expert Group on Salmon (TEGOS). The TEGOS Report is available on Inland Fisheries Ireland’s website at www.fisheriesireland.ie/publications.  Inland Fisheries Ireland (IFI) have advised that the stock assessment and associated catch advice given for the Corrib is primarily based on the fish counter at the Galway Weir and uses the most recent five-year period of data (i.e. 2021-2025). The counter is a partial counter so the raw count data is doubled. Ranched salmon passing through the counter are removed from the estimates of the run as the stock assessment and catch advice is based on wild salmon. Harvest of wild salmon below the counter are added to the counter run to get a full estimate of returns of salmon to the river. Essentially the average of the five years of the stock estimate is used to forecast the number of adults that will return to the river for the upcoming season (i.e. 2026).  Using five-years of data ensures that a single very good or bad year doesn’t over or under-estimate the forecast. It also generally reflects the life cycle period of salmon. The forecasted number of adults that return is then compared to the conservation limit for the river (i.e. minimum number of returning fish a river requires to ensure its stock remains healthy) and any returns above this are considered surplus to the health of the stock and thus available for sustainable harvest.  A level of certainty is required that the conservation limit will be achieved at the surplus quota advised to account for the risks in the catch advice. The standard basis for the stock assessment and associated catch advice provides for a high probability (i.e. 75% chance) that the conservation limit will be met by the forecasted returns at the quota set. IFI have decided that more certainty is warranted (i.e. 85% probability that the conservation limit will be met at the quota advised) over the base scientific advice. This reduces the quota that would be otherwise advised.  At the 85% probability level, no quota for sustainable harvest is available and as such catch and release-only fishing is advised for this stock in 2026. This better aligns with North Atlantic Salmon Conservation Organisation advice that stock exploitation should not solely be managed to the standard conservation limits themselves but should also have management targets above this to build in an extra level of precaution. These precautions are deemed necessary in the context of the uncertain future trajectory of our salmon stocks in general which have continued to progressively decline in Ireland in recent decades. Such an approach is also considered necessary to uphold the long-term term viability of the stock in the context of the many threats and pressures this species continues to be subject to. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 214. Deputy Mairéad Farrell asked the Minister for Climate, Energy and the Environment to provide further details on the updated scientific advice, which he received in November 2025, showing that Lough Corrib SAC salmon stocks will not have a sustainable surplus available for harvest in 2026; and if he will make a statement on the matter. [72488/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_141",
          "debateSectionId": "dbsect_141",
          "showAs": "Inland Fisheries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_141.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_214",
        "questionNumber": 214
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  Inland Fisheries Ireland (IFI) have advised that coarse fish and pike have been present in the Lough Corrib catchment for many years. IFI regularly monitor fish populations in several waterbodies in the Lough Corrib Catchment to assess their composition, abundance, age structure and ecological status. Lough Corrib, along with six other large freshwater lakes in the west of Ireland are currently being managed preferentially as recreational salmonid fisheries and the information gathered through IFI surveys is used as an ecological indicator and to inform fishery management decisions. Coarse fish and pike stocks are managed at some locations.  The conservation bye-laws referred to in the question, which currently underpin the protection and management of coarse fish in Ireland, are currently under review. A public consultation process has recently closed and I look forward to the review process concluding in due course. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 215. Deputy Mairéad Farrell asked the Minister for Climate, Energy and the Environment if his Department will continue to validate the presence of invasive/non-native fish such as pike, roach and carp in the Corrib Catchment through conservation bye-laws considering his comments on 4 December 2025 regarding significant coarse fisheries within the catchment; and if he will make a statement on the matter. [72489/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_142",
          "debateSectionId": "dbsect_142",
          "showAs": "Inland Fisheries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_142.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_215",
        "questionNumber": 215
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  I have been advised by Inland Fisheries Ireland that the promotion of angling is outside the proposed Western Lakes Management Plan. While the plan includes management options for all fish species that are present, it is not an angling promotion plan. Anglers will, however, play an important role as stakeholders in the implementation and success of the plan. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 216. Deputy Mairéad Farrell asked the Minister for Climate, Energy and the Environment if the proposed Western Lakes Management Plan (WLMP) facilitates further promotion of coarse angling on Lough Corrib SAC and its catchment; and if he will make a statement on the matter. [72490/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_143",
          "debateSectionId": "dbsect_143",
          "showAs": "Inland Fisheries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_143.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_216",
        "questionNumber": 216
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  A review process is underway in relation to the Conservation of Pike Bye-Law (No. 809) 2006 and the Conservation and Prohibition on Sale of Coarse Fish Bye-Law (No. 806) 2006.  A public consultation process, to inform the review, was completed by Inland Fisheries Ireland (IFI) in November. The 214 submissions received are being analysed and IFI intends to publish copies of these submissions on its website in early January.  I look forward to the review process concluding in due course. I will consider the advice and recommendations brought forward by IFI before deciding whether legislative or policy changes are required. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 217. Deputy Mairéad Farrell asked the Minister for Climate, Energy and the Environment if his Department will be instigating any legislative or policy changes as a result of the public consultation that ended recently regarding the Conservation of Pike Bye-Law (No. 809) 2006 and the Conservation and Prohibition on Sale of Coarse Fish Bye-Law (No. 806) 2006; and if he will make a statement on the matter. [72492/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_144",
          "debateSectionId": "dbsect_144",
          "showAs": "Inland Fisheries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_144.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_217",
        "questionNumber": 217
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  I can confirm to the Deputy that the number of officials in my Department at principal officer level who have held the post with responsibility for Inland Fisheries since 1 January 2015 is three. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 218. Deputy Mairéad Farrell asked the Minister for Climate, Energy and the Environment the number of departmental officials that have held the post of principal officer of the Inland Fisheries Division since 1 January 2015; and if he will make a statement on the matter. [72495/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_145",
          "debateSectionId": "dbsect_145",
          "showAs": "Inland Fisheries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_145.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_218",
        "questionNumber": 218
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  The conservation limit (CL), applied by the Technical Expert Group on Salmon (TEGOS), to establish the status of individual stocks is the “maximum sustainable yield” (MSY) (also known as the stock level that maximises the long-term average surplus) as defined and used by the International Council for the Exploration of the Sea (ICES) and the North Atlantic Salmon Conservation Organisation (NASCO).  The CL is essentially the minimum number of returning salmon a river requires to ensure its stock remains healthy. In the absence of an advised surplus on a river, ‘Catch and Release only’ options are proposed for rivers meeting between 65% -100% of their CL for 2026 in line with scientific advice.  The harvesting of salmon is only permitted in stocks in rivers or associated estuaries which are above their CL, so that any harvest quota set will ensure that a stock is fished sustainably without impacting the viability of that stock.  The River Suir is currently below its CL and falls into the 65% -100% bracket and therefore it is proposed that it will be Catch and Release only for the 2026 season. The management recommendation, following the TEGOS advice for the last number of years on the River Suir, is for a catch and release regime. This is because there is not a surplus available for harvest.  Ireland manages its salmon populations on a river-by-river basis based on robust conservation-focused scientific advice. This is based on scientific stock assessments and associated sustainable catch advice provided by the independent TEGOS. Our salmon management regime follows international best practice as advised by the NASCO and ICES.  Estimates of direct catch and release caused-mortalities in Atlantic salmon vary between individual studies, with values ranging from as low as 3% mortality to as high as 40% mortality. Numerous interacting factors can influence the reported mortality rate including gear/angling technique (e.g. barbless or barbed hook, fly or lure, play time, air-exposure time) and life-stage (grilse, multi-sea winter, kelt) with higher water temperature consistently emerges as a major factor controlling mortality probability.  To date, the lethal and sub-lethal effects of catch and release angling have not directly been accounted for in the Irish salmon stock assessment and catch advice process. However, it is important to note that the current catch advice provided by TEGOS gives a measure of protection to particularly vulnerable river stocks (i.e. those meeting 65% of their conservation limit) by advising that no recreational fisheries should operate and thus such stocks are fully protected from any potential negative effects of catch and release as outlined above when the scientific thresholds are adhered to. In general, facilitating catch and release-only fishing on stocks somewhat below their CL, generates valuable catch data that can be used for stock assessment purposes which otherwise may not be available while also providing a socio-economic benefit.  The proposed salmon fisheries management measures for the 2026 season are currently available for Public Consultation. The Public Consultation process, conducted by my Department, is open for 30 days so as to allow stakeholder who have a vested interest review and submit comments during this period. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 219. Deputy Mairéad Farrell asked the Minister for Climate, Energy and the Environment the reason the Suir River in the Waterford fishery district will remain open for salmon angling in 2026 on a ‘catch and release’ basis considering that there is a known mortality with releasing fish alive after handling as per peer reviewed literature; and if he will make a statement on the matter. [72496/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_146",
          "debateSectionId": "dbsect_146",
          "showAs": "Inland Fisheries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_146.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_219",
        "questionNumber": 219
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Revenue has provided my Department with the following table which illustrates the number of enforcement staff at Dublin Airport between the years 2022 and 2025:      Frontier Management Dublin Airport Branch      31/12/2022      31/12/2023      31/12/2024      Total No. of Staff at 30/11/25       Dublin Airport (All Staff)    211    191    198    195      Enforcement Staff    79    65    88    93      ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 378. Deputy Mairéad Farrell asked the Tánaiste and Minister for Finance he breakdown of the number of enforcement staff at Dublin Airport in the years 2022-2025; and if he will make a statement on the matter. [73313/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_276",
          "debateSectionId": "dbsect_276",
          "showAs": "Dublin Airport Authority",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_276.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_378",
        "questionNumber": 378
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage (Deputy Christopher O'Sullivan)  I refer to my reply to Question No. 571 of 18 November which sets out the position in this matter.  My Department's National Parks and Wildlife Service is engaging with the relevant agencies and stakeholders and, pending the results of ongoing surveys, testing and monitoring, will carefully consider with them the next steps to mitigate the impact of this species on our waterways. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 620. Deputy Mairéad Farrell asked the Minister for Housing, Local Government and Heritage if the National Parks and Wildlife Service has contingency plans in place if the invasive demon shrimp (dikerogammarus haemobaphes) infiltrates Lough Corrib SAC; and if he will make a statement on the matter. [72497/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_484",
          "debateSectionId": "dbsect_484",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_484.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_620",
        "questionNumber": 620
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  First 5 is Ireland’s Whole-of-Government Strategy for babies, young children and their families. It focuses on the period of early childhood, from the antenatal period to age five, and takes a joined-up, cross-government approach to supporting babies, young children and their families during these critical early years.  The Strategy has a pivotal focus on providing a broader range of options for parents to balance working and caring. First 5 seeks to support parents to be at home for the child's first year, based on research evidence that suggests that children benefit particularly from parental care in the first year of life.  Under First 5, from 1 July 2022, Parent’s Leave and Benefit of seven weeks per parent was introduced. It was further increased to nine weeks per parent per child with effect from August 2024. The combined durations of Maternity, Paternity and Parent’s Leave and Benefit now equate to 46 weeks of paid leave for a two-parent family. This is supplemented by an entitlement to 16 weeks of unpaid Maternity Leave, 26 weeks of unpaid parental leave per parent as well as annual leave entitlements.  Further supports will be considered in the context of the development of the new First 5 Implementation Plan for 2026-2028, in line with the Programme for Government commitments to both examine the extension of Parent’s Leave and Benefit and to introduce Pay Related Parent’s Benefit.  Shaping the Future: the Early Years Action Plan Phase 1 Report will also be published on 17th December 2025. It sets out the next steps in delivery of the key commitments in the Programme for Government to improve affordability, quality, and access of both Early Learning and Care and School-Age Childcare.  The National Childcare Scheme (NCS) provides financial support to help parents reduce the cost of early learning and childcare in the form of a subsidy paid directly to the childcare provider. Subsidies are available for children between 24 weeks and 15 years of age at a minimum rate of €2.14 per hour, available for up to 45 weekly hours. Depending on the family’s income, there are additional income assessed subsidies available. All Tusla registered providers are eligible to offer the National Childcare Scheme and avail of the supports the subsidy provides. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 825. Deputy Mairéad Farrell asked the Minister for Children, Disability and Equality if she will provide an update on childcare supports for children under the ECCE age range; and if she will make a statement on the matter. [71780/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_651",
          "debateSectionId": "dbsect_651",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_651.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_825",
        "questionNumber": 825
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Deputy Mairéad Farrell  Dia duit ar maidin, a Aire. The Minister has outlined a new infrastructure plan and clearly we have a serious infrastructural deficit, which I have raised with him numerous times. This infrastructure deficit, particularly in the west of Ireland, is as a result of decades of neglect by Fianna Fáil and Fine Gael governments. The Government has promised the earth and has delivered really nothing in terms of infrastructure for the west of Ireland. Why should anybody trust that these action plans will be any different? \n Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation (Deputy Jack Chambers)  Gabhaim buíochas leis an Teachta Farrell. Last week, the Government published the Accelerating Infrastructure Report and Action Plan. It is a comprehensive programme of actions designed to speed up the delivery of critical infrastructure across the State. This action plan responds to well-documented challenges of lengthy development timelines, fragmented processes and rising costs. These have all been identified as major barriers to achieving Ireland’s housing, energy, and climate objectives.  The report is evidence-based. It has been built on the research and analysis of my Department, the views received during the public consultation and stakeholder engagement over the summer, and the expert input and advice from the members of the accelerating infrastructure task force.  The plan sets out 30 targeted actions under four pillars, each addressing a key area of reform. The first pillar is legal reform. Reforms here aim to achieve a better balance towards the common good by addressing the incentives that drive a disproportionate reliance on the courts in planning and regulatory matters. While access to justice remains protected, the reforms will reduce incentives for excessive litigation, clarify rules on standing and remedies, and introduce fast-track pathways for nationally significant projects that are in the common good, through new legislation.  The second pillar is regulatory simplification and reform. This means identifying where regulation leads to excessive process, rather than improved outcomes. It also means examining the structure of our regulatory environment, the practices applied by regulatory bodies and how they communicate with one another and with applicants. In practical terms, there is scope for improved outcomes by applying parallel processes, mandatory statutory timelines and measuring the performance of our regulatory bodies.  The third pillar is co-ordination and delivery reform. This implements the reforms outlined in the programme for Government. It means my Department assumes a more central co-ordination role on the delivery of critical infrastructure, providing certainty to other Departments through multi-year funding commitments to underpin five-year sectoral plans and reforms to the infrastructure guidelines. Across government, it means driving and embedding a delivery-first culture, including a balance between risk and delivery that incorporates the potential cost of delay.  The final pillar is public acceptance. I will set out greater detail on that. \n Deputy Mairéad Farrell  Gabhaim buíochas leis an Aire. One of the things I noticed when I was reading the plan was that there are the 30 actions and it seems to me that every single one of them will be delivered in quarter two of 2027. This is a ten-year action plan and it seems that, from what I have read, 2026 to 2027 is when they are going to be delivered. That is obviously a two-year timeframe. My query is in relation to the ten-year period. Is it that they are the actions, that is what happens and then it is left until 2035, or what are the actions coming out of that? Will new action plans be agreed coming out of those or how exactly is that going to work? \n Deputy Jack Chambers  The first aspect is on the actions which relate to reform and the majority of them fall in 2026. We have tried to front-load the interventions and actions we make so we can see the benefits of having legal reform, regulatory reform and simplification, better co-ordination delivery and improved public acceptance. They are the four areas identified. Most of those are to be progressed in 2026. We have already set out the national development plan review, which the Deputy will know about, and sectoral plans have been published in recent weeks setting out the trajectory of projects and of priorities across all areas of Government for the next number of years. The Deputy's point about five and ten years obviously relates to the overall capital investment. We have set out the €275 billion over ten years in the five-year sectoral plans. However, the reforms here are not about the investment. They are about how we change the practice and the delivery which is too slow. Doing that quickly is imperative to ensure the investment we have set aside yields improved delivery and that is the nature of what is set out. \n Deputy Mairéad Farrell  I have to be very honest here. I want to this to work. The reality is that the way previous Governments have treated infrastructure has been abysmal and we see the direct results that has had. We see it particularly when storms hit or when people want to be able to build housing, providing housing or be able to attract jobs to areas. The state of our infrastructure has been horrific. I have a number of questions in relation to this. One of the things that makes me a bit nervous when it is Fianna Fáil, is whether there is much of an approach in terms of deregulation. We have seen what Fianna Fáil did previously and the impact that it had and I have to ask that question. I was also a bit concerned that it seemed to me that there was an awful lot of blame-shifting. Of course, we know there are serious issues but it did seem like a lot of blame-shifting from Government and other people. First and foremost, it is very clear that the reason we do not have the infrastructure is because of a lack of investment from Governments. \n Deputy Jack Chambers  We have fronted up an investment and taking the investment profile over the next five years, it means we will be one of the biggest investors in infrastructure per capita in Europe and have about 5% GNI*. We have responded to that around the investment piece. However, there is a well-documented need and an evidence base to drive reform and infrastructure delivery and that is why there needs to be much more balance around regulation. We need to cut some rules, regulations and processes which are not adding value but are causing excessive delay. We also need to have a wider debate about the level of regulation around certain areas within the economy to ensure we have growth and delivery as a means to drive the strategic direction of the State. This is all about co-ordination and delivery of reform as well, and that is why the practical measures we have set out in this report will do what the Deputy said earlier in her remarks when she said we all want this to work. Ultimately, it is about how our energy systems, our transport infrastructure and our water infrastructure yields greater abundance across the economy so we can improve investment and increase the opportunities for job creation. That is what we have sought to do in this report. ",
        "questionType": "oral",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 1. Deputy Mairéad Farrell asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the status of the Government’s new infrastructure plan, Accelerating Infrastructure-Report and Action Plan; and if he will make a statement on the matter. [70883/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/dbsect_3",
          "debateSectionId": "dbsect_3",
          "showAs": "Departmental Reports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/mul@/dbsect_3.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_1",
        "questionNumber": 1
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Deputy Mairéad Farrell  This question relates to protected disclosures. We all recognise the importance of whistleblowers and the incredible work they do for our society in calling out wrongdoing. Unfortunately, doing so for the better of society often comes at their own expense. There was a debate on a Private Members' motion on this issue a few weeks ago. Will the Minister provide an update on whistleblower legislation? \n Deputy Jack Chambers  As the Deputy is aware, the Protected Disclosures Act 2014 is Ireland's national whistleblower protection law. Significant amendments to the Act were signed into law in July 2022. The amended Act gives effect to EU Directive 2019/1937 and provides for the establishment of the Office of the Protected Disclosures Commissioner within the Ombudsman's office.  As Minister, I am obligated to commence a statutory review of the Act no later than five years after the date of enactment, which is July 2027. That review must be completed and a report made to the Oireachtas no later than July 2028. I will arrange for the review to commence in advance of 2027 and for a public consultation to take place during 2026.  A number of stakeholders have been pointing to challenges arising from the implementation of the amended legislation, including the protected disclosure processes and procedures. The statutory review will be an opportunity to bring to light any issues arising by consulting a more complete range of stakeholders and hearing their respective perspectives. It is clearly preferable to put forward amendments that are well considered and based on the experience and evidence of all relevant stakeholders. The consultation will provide an opportunity to ensure that is done.  It is important to note that the legislation has only been in force for three years and many of the provisions in the Act have yet to be fully tested in practice and in the courts. The legislation was designed to encourage workers to report instances of potential wrongdoing. Given the amended Act only commenced on 1 January 2023, my Department has only two full years of statistics on the number of reports of wrongdoing received by Departments, public bodies and prescribed persons. The statistics suggest that the volume of reports received is increasing. In 2023, more than 1,100 reports were received, while in 2024, the number was just over 1,500. This increase suggests a greater awareness of the amendments that were introduced in 2022 among workers and that more workers felt motivated to make a protected disclosure under the framework.  In the meantime, effective ways to address the issues arising from the ongoing implementation of the protected disclosures legislation include increased training and guidance for employers, regulators and designated recipients, as well as providing more guidance to workers to ensure their concerns are directed to the appropriate channels. \n Deputy Mairéad Farrell  The legislation may only be in place three years but we knew, when it was going through the Houses, that it was far too weak. Everybody agreed on that. It was almost the weakest transposition of the directive that could be made. One of the key issues debated at the time was retrospectivity and how so many people were locked out of the Act's provisions. Has the Minister dealt with EU counterparts on the issue of retrospectivity and whether they, too, excluded people? If not, will he undertake to have that engagement?  I welcome the review because it is needed. When in 2026 will it open in terms of public consultation? What direct engagement has the Minister had with whistleblowers in this regard? The least we can do for whistleblowers is to ensure they have protections in law because, unfortunately, so many of them really suffer as a result of their whistleblowing. \n Deputy Jack Chambers  I have had limited engagement on this matter with counterparts at an EU level. The directive has been transposed. Our Presidency in 2026 will allow opportunities for engagement on it. In the context of the review that will be happening in parallel, there will be a greater opportunity to take wider European feedback on this issue. We transposed the directive and legislation was enacted in 2022. Ultimately, I want to make sure, as I am sure we all do, that we have a system that works. It is timely to have a review that takes into account people's full experiences and everyone's interaction with the existing system. Following that consultation, I am open to taking the feedback and seeing how we can have a system that best supports whistleblowers. That is ultimately the direction and context in which I want to see it operate. \n Deputy Mairéad Farrell  This is an issue I am particularly passionate about and I appeal directly to the Minister in this regard. Whistleblowers are telling us they are being failed by the legislation. The Minister has responsibility for it, albeit he has advisers and all of that, and I am appealing directly to him to really look, by way of the review, at the best way to ensure whistleblowers are specifically protected and to take that on board personally. Will he examine whether there are areas in the EU where this process works well and what can be done to strengthen our regime to protect our whistleblowers? I had concerns at the time, which I have raised again numerous time this year, about protected disclosures not going directly to Ministers and those Ministers then being able to say they cannot deal with them because they are with the protected disclosures office. There was an element of concern about that at the time and it is still a huge area of concern. I ask the Minister to look at this personally. It is such an important area and he has such power in relation to it. I urge him to listen to the whistleblowers. \n Deputy Jack Chambers  I will, of course, listen to and engage with whistleblowers. The review is really important, which is why we are bringing it forward from 2027 to 2026 to ensure we have broad feedback. They system I want to see operating is one that works for whistleblowers. As I said, we will be able to advance that next year. ",
        "questionType": "oral",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 3. Deputy Mairéad Farrell asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the status of protected disclosures legislation; and if he will make a statement on the matter.  [70884/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/dbsect_5",
          "debateSectionId": "dbsect_5",
          "showAs": "Protected Disclosures",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/mul@/dbsect_5.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_3",
        "questionNumber": 3
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Deputy Mairéad Farrell  I would love to say more about whistleblowers but we must move on. This question is about the status of the removal of pay ceilings for CEOs of State-owned commercial enterprises. \n Deputy Jack Chambers  The independent review panel on senior public service recruitment and pay determination processes was established in March 2022 and its report was published in June 2023. It found that pay determination of senior posts should consider best practice in terms of openness, transparency, accountability and the need for an objective evidence-based methodology.  To this end, it recommended that an independent body be established to give independent advice to the Minister on remuneration arrangements for senior posts in the public service and CEOs of commercial State bodies, CSBs. It further recommended that a review of CEOs of CSBs be prioritised.  On foot of this report, the senior posts remuneration committee, SPRC, was established by Government in March 2024 to provide independent and objective advice, supporting consistency and transparency in the pay arrangements attaching to senior roles across the public service. The SPRC was requested to perform a review of the remuneration arrangements for the CEOs of CSBs. Following Government approval, I published the SPRC report on 29 April 2025.  The SPRC made a number of findings and recommendations. The report found CEO remuneration packages have fallen out of alignment with the market and that a transparent and robust framework for the regular review of CEO remuneration was required to ensure remuneration levels are set and remain at a level that is appropriate and equitable. The report outlines fair and appropriate remuneration as a key element in the recruitment and retention of CEOs, who are critical to the State's future development and economic performance.  Having considered the report, the Government has agreed to implement a more structured approach to the remuneration of CEOs. A banded salary structure is being implemented for CEOs, which ranges from their current salary to the market median of the relevant band. In line with the SPRC findings in relation to increased flexibility for boards, it is a matter for boards to propose a point within the relevant band for the body. This is subject to governance and scrutiny. The approval of the relevant Minister is required and then my subsequent consent. There will be no backdating of any changes to pay. I have since written to my ministerial colleagues regarding the operational details. \n Deputy Mairéad Farrell  It is unbelievable to me that being out of line with the market and being competitive only ever in this Chamber relates to those people who are on the highest income. It is never about competitiveness for low-wage workers. It is never out of line for low-wage workers. The Minister's decision to remove these pay ceilings has resulted in pay increases for CEOs of Bus Éireann and Iarnród Éireann of €50,000 and €75,000. Those are insane amounts of money. That is making millionaires out of CEOs at a time when people cannot afford childcare or housing. It shows how out of touch the Government is.  Last year the CSO identified that in-work poverty was 5.9%. That equates to more than 145,500 people in employment who are living below the poverty line. What will the Minister do about their competitiveness and being out of line with the market? \n Deputy Jack Chambers  On a wider point, the budgets we implemented this year and in recent years are progressive. That is reflected in the SWITCH model the ESRI has around low-income deciles. The two lowest income deciles have been where the concentration of supports has been in terms of our response from a social protection perspective and the changes around income tax I made as Minister for Finance.  We received recommendations from the independent senior posts remuneration committee. It is important we have a structured way to set salaries within the State. That is why we have a banded structure based on the market median in respect of commercial State bodies. It is important we have that in the context of attracting people to run those companies, whether utilities or other State bodies, so that we drive performance. That is why there has to be a full assessment within the board and with the consent of the relevant Minister, in line with the wider focus on performance within State bodies. \n Deputy Mairéad Farrell  I do not think the Minister can seriously come into this Chamber and say his budgets have delivered for people in poverty. One in five children is living in poverty under the Minister's watch, while 15% of the State's population is living in poverty.  The Minister talks about an independent recommendation committee on the pay of CEOs in the top 1%. Where is his independent recommendation committee for people who are working, earning and living in poverty?  It does not wash with anybody for the Minister to come into this Chamber and tell us the budget delivered for low-paid workers. The Minister has chosen instead to line the pockets of the top 1% of earners, increasing their pay by astronomical amounts of €50,000 and €75,000. Most people do not earn those amounts, let alone get an increase of that scale. What will the Minister do to ensure competitiveness for low-wage workers? \n Deputy Jack Chambers  The Deputy saw the recent budget and the intervention we made around child poverty. It was a significant intervention on child poverty, the biggest in years. That was the child support payment and it was done with the engagement of the sector. We want to address the issues with child poverty in our country.  The facts are clear about the €300 million-plus expenditure on child poverty measures next year to try to narrow the gap. The Government, led by the Taoiseach and his Department, has put a real focus on child poverty because of some of the statistics the Deputy referenced.  This is separate and distinct from an informed decision made by a board assessing CEO pay. It is populist to pit one against the other. \n Deputy Mairéad Farrell  It is not. Children in poverty. \n Deputy Jack Chambers  Ultimately, we want utilities that have strong leadership and that are matched with the market median so we build an economy and State which can address child poverty and give people the support they require. \n Deputy Mairéad Farrell  The Minister must know that narrative is what is causing this. ",
        "questionType": "oral",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 4. Deputy Mairéad Farrell asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the status of the removal of pay ceilings for CEOs of Irish commercial State-owned enterprises; and if he will make a statement on the matter. [70885/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/dbsect_6",
          "debateSectionId": "dbsect_6",
          "showAs": "Public Sector Pay",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/mul@/dbsect_6.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_4",
        "questionNumber": 4
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Deputy Mairéad Farrell  It will come as no surprise to the Minister that I am raising the issue of critical infrastructure in the west. Thankfully, the storm this week did not hit Connemara in the way Storms Éowyn, Bert and Darragh did last year. However, we still have the aftermath and impact of those storms. The Minister knows Connemara well. If he travels around Connemara now, he will see there are still wires on the ground and poles hanging to one side. What is his plan for the west? \n Deputy Jack Chambers  As part of the budgetary process each year, my Department sets out overall expenditure ceilings for each ministerial Vote group. These are laid out at Vote level in the budget day expenditure report published in October, with further detail provided in the Revised Estimates for Public Services published in December. Following the allocation of each ministerial expenditure ceiling, it is a matter for each Minister to assign funding as appropriate at programme and subhead level for their Departments and the agencies under their remit, accounting for the demands for services in different areas and regions, having regard to demographics and other relevant factors. Within this process, both current and capital expenditure are allocated on a departmental rather than geographic basis.  More broadly, the achievement of balanced regional development is a key priority of this Government in Project Ireland 2040, which includes the national planning framework and the national development plan. Since Project Ireland 2040 was launched in 2018, the Government has overseen the delivery of many impactful NDP projects across the country, including in the west of Ireland, for example, the enterprise centres in Boyle and Tulsk in County Roscommon and Belmullet and Swinford in County Mayo, the N59 Moycullen bypass, the Salmon Weir bridge in County Galway, the Killaloe bypass in County Clare, the heritage and tourism projects in Portumna, Galway and Aghleam, Mayo and many other capital projects.  The NDP review 2025 was published on 22 July 2025. It committed €275.4 billion up to 2035, the largest and most significant capital injection in our economy in the history of the State. Arising from this, €19.1 billion in Exchequer capital investment will be provided in 2026. On budget day, Ministers set out the capital projects and programmes that they will prioritise within their allocation in 2026. In recent weeks, Ministers have developed sectoral plans for priority investment programmes. Many of these projects relate to the west, including the Uisce Éireann upgrade of water and wastewater treatment plants in Lough Mask and Claremorris in County Mayo, 35 social and 310 affordable housing units in Crowne Square in Galway, new transport infrastructure with Bus Connects Galway and the Galway city ring road. I can list many more. \n Deputy Mairéad Farrell  I understand what the Minister said about things not being done in an area-specific way but, rather, in terms of Departments. I also know that he is the Minister for infrastructure, and he has an understanding of the west of Ireland. He has links to the west and knows Connemara well from his time as Minister for the Gaeltacht. I know, and I am sure the Minister knows, the serious lack of basic critical infrastructure in Connemara in particular. Safe roads and safe bridges are lacking. We still have the repercussions from Storm Éowyn, and all of these things will worsen unless specific capital investment is made in the area now. I ask the Minister to look at what can be done through his Department to ensure the area has basic critical infrastructure so that people can live in and go about their daily lives in the area and jobs can be created in it. \n Deputy Jack Chambers  I am familiar with those elements of the west of Ireland, in Galway, Mayo and elsewhere. The west is being prioritised in many of the projects set out in the sectoral investment plans. There is the social and affordable housing delivery we want to ramp up in the context of the housing sectoral plan that the Minister, Deputy Browne, has published. The transport sectoral plan will significantly enhance public transport and there address road infrastructure projects across the west, which have been waiting for years. There is also the resilience the Deputy mentioned in the context of storms and other issues. The Minister of State, Deputy Moran, through the work the OPW is doing, is front-loading a lot of the capital investment in flooding and other areas to make sure we build greater resilience. Similarly, there is work happening on other infrastructure across many Departments. This is agreed at a sectoral level. The wider funding arrangements are clear in Project Ireland 2040, as is ensuring balanced regional development. \n Deputy Mairéad Farrell  When I look at infrastructure in the west I see it in two veins. There is obviously the serious capital investment needed for those bigger projects.  The Minister has outlined some of them. Any investment there is welcome but there are also thee basic things that need to be done immediately.  The Minister will remember the snow during Storm Bert, which had serious implications across Connemara. We then had Storm Darragh and when we had Storm Éowyn, Connemara did not have a chance. The impact of those storms on that basic infrastructure, which was already eroding, was devastating. We need to see some kind of plan from the Government - whichever Department sees fit but the Minister is obviously over infrastructure - to make sure we have those basics in order that this does not happen again. We still have wires on the ground as a result of Storm Darragh, not Storm Éowyn. That work needs to be done and a boost or push from the Government would really help in that regard. \n Deputy Louis O'Hara  Regarding wastewater infrastructure in Craughwell and Clarinbridge in County Galway, funding was announced three years ago for the provision of wastewater infrastructure in those villages. This was very important for the delivery of housing and I raised this before with the Minister at the infrastructure committee. Since then, that project has been at a standstill. In recent weeks, Government TDs welcomed an increase of several million euro in the allocation of funding for this project. However, the only reason this is needed is because the project has stood still and costs have increased in the meantime.  The greatest barrier to delivery of this project is the 15% co-funding allocation expected of local authorities for such projects. That means Galway County Council would be expected to make a contribution of approximately €5 million. The local authority does not have this money and has not budgeted for it. When we talked about accelerating delivery, this issue needs to be sorted. It is a major barrier and needs to be taken out of the way to ensure delivery. Can the Minister commit to removing this co-funding requirement to ensure these projects can be delivered in a timely manner? \n Deputy Jack Chambers  On the latter point, I am following up on that with Irish Water in the context of wastewater treatment plants. There has been a funding increase. I can get a specific answer to the question for the Deputy. I am aware of the importance of the issue to local towns and villages in County Galway.  To the other point on resilience of critical infrastructure, a recent Cabinet committee meeting focused on the learnings from Storm Éowyn, the greater prevalence of storms and the impact this is having on basic infrastructure. It is a critical point of co-ordination across government on building better resilience into our basic infrastructure systems and also ensuring response in respect of community resilience. There is a strong focus on co-ordination in the work the Minister of State, Deputy Moran, is doing as well. ",
        "questionType": "oral",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 13. Deputy Mairéad Farrell asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the position regarding investment in critical infrastructure in the west of Ireland; and if he will make a statement on the matter. [70765/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/dbsect_14",
          "debateSectionId": "dbsect_14",
          "showAs": "Regional Development",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/mul@/dbsect_14.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_13",
        "questionNumber": 13
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Sceirde Rocks was a 450 MW offshore wind project that was one of the successful bidders in the first offshore wind (ORESS 1) auction in 2023. The Department of Climate, Energy and the Environment advise that the project submitted a planning application in January 2025. On 25 April, the project developers, Corio, formally notified the Department of Climate, Energy and the Environment that the project would not proceed.  This notification terminated the support contract for the project, which meant that Corio’s €35.5m performance security paid under the terms of the contract was also forfeit. It was transferred to the Department of Climate, Energy and the Environment in June 2025 and subsequently to the Exchequer, as required under the Public Financial Procedures.  The Public Financial Procedures sets out the main principles of government accounting and their application in the day-to-day operation of government departments and offices, including the treatment of Departmental receipts.  The performance security is considered an Exchequer Extra Receipt (EER). Exchequer Extra Receipts are receipts which have no direct connection with voted expenditure and therefore cannot be retained by departments for their own use. These receipts must be credited to the Central Fund. The Central Fund, also referred to the Exchequer, is the main bank account held by the Government in the Central Bank.  As an Exchequer Extra Receipt the funds received will be used to finance all Government expenditures, including projects in the Connemara region. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 62. Deputy Mairéad Farrell asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if his attention has been drawn to the €35 million penalty paid by an organisation (details supplied); and if any of this penalty will be invested into local communities in Connemara; and if he will make a statement on the matter. [70766/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_102",
          "debateSectionId": "dbsect_102",
          "showAs": "Renewable Energy Generation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_102.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_62",
        "questionNumber": 62
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The matters that the Deputy is referring to are in the main a delay in addressing taxes due on retirement and anomalies in deductions of various pension contribution.  The NSSO has been working intensively to rectify all errors. The issues that have arisen are individually complex in nature and relate to three distinct cohorts:  Some retired civil servants who previously work-shared and whose pensions were calculated incorrectly.  Current and former Ministers and Office Holders; and  Some retired Senior Civil and Public Servants.  NSSO has put in place number actions to prioritise the resolution of these issues. This included organisational restructuring and reassignment of operational staff to create dedicated remediation teams to work through each issue while relevant processes have also been thoroughly reviewed.   Shorter Working Year / Pensionable Allowances   Significant progress has been made with the review of work-sharing civil service retirees. The review has found that some staff who availed of a Work Share Pattern and/or Shorter Working Year in the 10 years prior to their retirement should have had their pensionable allowances calculated differently.  Of the active civil service pensioners identified on the NSSO system in receipt of pension payments based on allowances earned pre-retirement established that less than 20% of these people may be impacted. The process of refunding underpayments owed to these retired civil servants commenced in September and is nearing completion.   Ministerial Allowances:   Incorrect Pension schemes and ASC rates were applied to a number of current Ministers, some former ministers and office holders leading to incorrect pensions deductions. The amounts range from hundreds of euros to the low €30,000's in terms of monies to be recouped. Some Ministers are unaffected. All Ministers of the existing Government are now on the correct deduction rates since June 2025.  I understand that this process is nearing completion with the majority of current Ministers having now entered recoupment plans. The NSSO is actively engaging with those not yet in recoupment.  In relation to the former Ministers the NSSO continues to engage with these individuals to finalise recoupment plans.   CET / WHT:   NSSO identified errors with Chargeable Excess Tax (CET) and Withholding Tax (WHT) liabilities.  • CET is a tax on pension funds at retirement which exceed the Standard Fund Threshold, which is currently €2 million.  • Withholding tax is deducted from retirement lump sums over €200,000.  The NSSO carried out a full review of all retirees across Secretary General, Principal Officers, and Assistant Principals grades to identify affected retirees. The majority of those impacted have now entered recoupment plans or are engaging with the NSSO to finalise their recoupment plans.  The liabilities owed for this cohort range from a few hundred euros to €211,000.   EXTERNAL AUDIT UNDER WAY   The NSSO identified these issues earlier this year and brought them to the attention of my department. My Department and the NSSO have subsequently put in place new measures and controls to ensure these matters do not reoccur.  An external audit of the NSSO is currently being overseen by Mr Derek Moran, the chair of the NSSO Advisory Board. The audit is examining the NSSO’s salaries and pensions processes. Independent auditors RSM Ireland commenced their review in September, and good progress has been made to date. It is expected to take up to six months and it is envisioned that once the audit is complete, and where data privacy allows, that the findings and recommendations of the audit will be published. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 73. Deputy Mairéad Farrell asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the position regarding the report on overpayments in the Civil Service and amongst office holders; and if he will make a statement on the matter. [70764/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_111",
          "debateSectionId": "dbsect_111",
          "showAs": "Civil Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_111.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_73",
        "questionNumber": 73
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  The National Student Accommodation Strategy 2025–2035 is now expected to be submitted to Government in the coming weeks, with publication anticipated shortly afterwards. The Strategy sets out a vision to make higher education more accessible and sustainable by addressing accommodation affordability and viability.  By providing targeted financial supports and accelerating the development of purpose-built student accommodation (PBSA), the Strategy aims to remove barriers that prevent students from pursuing their academic goals. It aims to deliver additional student beds by 2035, using a combination of On and Off Campus Purpose Built Student Accommodation and Rent-a-Room accommodation, without increasing reliance on the broader rental market.  The Strategy enables private sector investment by reforming rental legislation, reducing VAT, and introducing streamlined design standards under the Planning and Development (Amendment) Act 2025, creating a stable, attractive environment for investment. On campus development will be supported by the provision of a new envelope of National Development Plan funding for 2026-2030 to enable site servicing and private investment. Previous National Development Plans did not provide funding for student accommodation.  Affordability is supported through strengthened financial assistance, including through the Student Non-Adjacent Maintenance Grant, enabling equitable access for students from disadvantaged and remote backgrounds.  By providing targeted financial supports for students and supporting the acceleration of the development of purpose-built student accommodation, the Government removes barriers that prevent talented individuals from pursuing their academic goals. The measures in the Strategy support students to achieve their aspirations but also strengthen Ireland’s knowledge economy, which in turn supports our long-term economic growth. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 224. Deputy Mairéad Farrell asked the Minister for Further and Higher Education, Research, Innovation and Science the date for the publication of the updated National Student Accommodation Strategy (2025-2035), which he committed to publish in 2025; and if he will make a statement on the matter. [67789/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_236",
          "debateSectionId": "dbsect_236",
          "showAs": "Student Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_236.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_224",
        "questionNumber": 224
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science (Deputy James Lawless)  A craft apprenticeship requires a minimum of 208 weeks of continuous employment, including off-the-job training, to complete. The programme consists of:  • Four on-the-job training phases (Phases 1, 3, 5, and 7) with an employer. Of this, 64 weeks relate to a mandatory minimum duration of training required to ensure appropriate skills development to progress to the next phase of training.  • Three off-the-job training phases (Phases 2, 4, and 6) in a training or education facility. Of this, 44 weeks relate to a mandatory minimum duration of training required to ensure appropriate skills development to progress to the next phase of training.  The apprenticeship system operates on a national, and continuous intake basis. Maintaining a steady pipeline of apprentices is essential to ensure full classes and maximise value for money. Classes are scheduled on a rolling basis throughout the year. Scheduling for phases 4 and 6, when apprentices are typically in higher education, aligns with the academic calendar, which can also affect timing.  The Government has demonstrated a significant commitment to apprenticeships through sustained investment. In Budget 2026, I secured an additional €79 million for apprenticeship delivery, bringing total funding to over €410 million - a 120% increase since 2020. In addition, I recently announced a €20.5 million capital investment to expand provision in Higher Education Institutions for phases 4 and 6 off-the-job training. This will deliver 99 craft training blocks and 8 consortia-led equipment projects, supporting approximately 1,600 additional training places.  This investment has supported substantial growth in the apprenticeship system. Annual craft apprenticeship registrations have risen by 63%, from 4,377 in 2020 to 7,113 in 2024.  The table below details the number of apprentices, by craft programme, who have completed their mandatory 6 months on the job training phase 1, and are therefore eligible for scheduling for phase 2 off-the-job training, as of November 2025. SOLAS monitors scheduling across all trades to ensure efficient delivery and minimise delays.      Craft Programme      Completed phase 1 and eligible for phase 2       Brick and Stonelaying    5      Carpentry and Joinery    340      Painting and Decorating    2      Plastering    5      Plumbing    450      Stonecutting and Stonemasonry    1      Wood Manufacturing and Finishing    42      Aircraft Mechanics    0      Electrical    71      Electrical Instrumentation    31      Electronic Security Systems    23      Instrumentation    2      Refrigeration and Air Conditioning    93      Farriery    4      Industrial Insulation    0      M.A.M.F.    105      Metal Fabrication    20      Pipefitting    48      Sheet Metalworking    7      Toolmaking    0      Agricultural Mechanics    13      Construction Plant Fitting    70      Heavy Vehicle Mechanics    200      Motor Mechanics    213      Vehicle Body Repairs    24          ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 250. Deputy Mairéad Farrell asked the Minister for Further and Higher Education, Research, Innovation and Science if he will provide details the length of the waiting list for off-the-job training, for craft apprenticeships, by category; and if he will make a statement on the matter. [67788/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_263",
          "debateSectionId": "dbsect_263",
          "showAs": "Apprenticeship Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_263.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_250",
        "questionNumber": 250
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Earlier this year, officials in Revenue’s Statistics Branch conducted an extensive modelling and valuation exercise in respect of LPT liable properties. The purpose of this work was to inform policy decisions and to provide guidance to taxpayers on the valuation of their properties for the upcoming LPT valuation period 2026-2030. A paper outlining the process was published in September and is available on Revenue’s website: www.revenue.ie/en/corporate/documents/research/property-valuation-technical-paper-2026.pdf.  As part of this paper, Revenue has produced an estimation of the distribution of the LPT register of properties under the 2026-2030 valuation bands. This is based on the values of properties on the LPT register from 2021 and then rolled forward using the Residential Property Price Index (RPPI) compiled by the Central Statistics Office: https://www.cso.ie/en/statistics/prices/residentialpropertypriceindex/  RPPI data show that, while significant property price growth has been evident nationwide since 2021, greater levels of growth have been recorded in regions outside of Dublin. The estimated growth in prices in the West region for the purposes of the Revenue modelling exercise was approximately 33%, compared to approximately 21% for the Dublin region. Other areas, such as the Border, Midlands and Mid-West regions, experienced similar levels of price growth to the West region.  The LPT return records the valuation band, rather than an actual value (except for properties worth over €1.75 million). To roll forward 2021 values, a precise value (rather than valuation band) is required. The median price for 2021 by band was calculated from Revenue Stamp Duty data and applied to each property according to the property’s November 2021 valuation band.  The estimates of how many households will remain in the same band or move up a band are based on highly aggregated data, including RPPIs at a regional level and a single value for all properties within a band. As outlined in the paper, with the constraints of the available data, it is not possible to fully capture the complexity of property stock in Ireland and the extent of prices changes since 2021.  LPT is a self-assessed tax. Each property owner is responsible for valuing their property. The valuations of owners will determine which band each property falls into, including property owners in Galway city.  Once the LPT returns filed this month have been analysed, data will subsequently become available on properties’ LPT liability and band movement. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 49. Deputy Mairéad Farrell asked the Tánaiste and Minister for Finance if his attention has been drawn to the local property tax band changes; the reason Galway city is the area with the highest percentage of people going up a band, at 15%, compared to a 4% national average; and if he will make a statement on the matter. [64221/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_68",
          "debateSectionId": "dbsect_68",
          "showAs": "Tax Code",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_68.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_49",
        "questionNumber": 49
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  Tenancy sustainment, or tenant-in-situ, is a priority category under my Department's Second Hand Acquisitions Programme. It is not a scheme, but a policy tool available to local authorities to prevent social housing supported households in the private rented sector from falling into homelessness. It should only be used as a last resort by local authorities when all other options have been exhausted.  The Second Hand Acquisitions Programme currently provides funding to local authorities for acquisitions supporting inter alia:  • exits from homelessness,  • urgent responses for priority cohorts such as persons with disabilities, older persons, care leavers and  • tenancy sustainment (tenant in situ).  I expect the 2026 programme to maintain support for tenancy sustainment via tenant in situ acquisitions.  The funding ring-fenced for each priority category in 2026, and individual local authority allocations, will be agreed and notified to local authorities early next year.  In the meantime, local authorities can enter into commitments for 2026 to a value of up to 30% of their original 2025 acquisitions budget. This allows them commit, pending an agreed programme budget for next year, some €95 million extra in 2025 for acquisitions that will complete and draw down in 2026. This flexibility effectively provides for a multi-annual approach to programme delivery, facilitating local authorities to plan and progress acquisitions from one year to the next with a higher level of certainty vis-à-vis future funding availability. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 498. Deputy Mairéad Farrell asked the Minister for Housing, Local Government and Heritage if the TIS scheme will continue in 2026; the amount of funding each local authority will receive in 2026 for this scheme; and if he will make a statement on the matter. [69474/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_433",
          "debateSectionId": "dbsect_433",
          "showAs": "Rental Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_433.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_498",
        "questionNumber": 498
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  Under the Health (Pricing and Supply of Medical Goods) Act 2013, the HSE has statutory responsibility for decisions on the pricing and reimbursement of medicines and medical devices; therefore, the matter has been referred to the HSE for attention and direct reply to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 847. Deputy Mairéad Farrell asked the Minister for Health the work her Department is doing to progress the approval from HSE Medicines Management Programme for dupilumab for the treatment of paediatric eosinophilic oesophagitis; and if she will make a statement on the matter. [69050/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_695",
          "debateSectionId": "dbsect_695",
          "showAs": "Medicinal Products",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_695.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_847",
        "questionNumber": 847
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  Since becoming Minister for Rural and Community Development and the Gaeltacht, I have prioritised investment in community infrastructure. As part of Budget 2026, I was delighted to announce increased funding for the programmes that are delivering on this priority. This includes an increase in the annual budget for the Community Centre Investment Fund (CCIF) by €3 million to €20 million.  The CCIF was introduced to provide high quality, accessible, community spaces that are available to all groups in all communities in both rural and urban areas. Some €110 million has been allocated since 2022 for the enhancement and refurbishment of existing community centres and the construction of new centres where such a need has been identified. Over €10.7 million has been allocated to almost 190 projects in county Cork in the same period.  I am delighted to confirm that only last Saturday, I turned the sod for construction to commence on a new community centre in Rylane which was allocated over €1.8 million in funding from my department under the CCIF 2023 new build.  I am committed to delivering further iterations of the fund in the coming years in line with the commitment in the Programme for Government for this to become a permanent rolling fund. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 33. D'fhiafraigh Deputy Mairéad Farrell den Minister for Rural and Community Development and the Gaeltacht an míneoidh sé cén uair a bheidh na toghcháin do bhord Údarás na Gaeltachta ann; agus an bhfuil sé i gceist na toghcháin a reáchtáil in 2026. [68517/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_69",
          "debateSectionId": "dbsect_69",
          "showAs": "Community Development Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_69.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_33",
        "questionNumber": 33
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Rural and Community Development and the Gaeltacht  Tá an Clár um Chumasú Pobal (ECP) á mhaoiniú ag mo Roinn óna bhunú in 2022, agus ar dtús bhí maoiniú á thabhairt i gcomhair 14 thionscadal. Faoi láthair, tá 17 dtionscadal ag fáil tacaíochta faoin chlár.  Is é atá mar aidhm leis an gclár, le tacaíocht ón gCoiste ábhartha um Fhorbairt Pobail Áitiúil (LCDC) agus ón Chuideachta Forbartha Áitiúla (LDC) ábhartha, ná feabhas a chur ar rochtain pobal ar sheirbhísí tábhachtacha agus cumas a thabhairt do phobail áitiúla a bhfreagraí féin a fhorbairt ar bhochtanas ina gceantair, ar eisiamh sóisialta agus na hiarmhairtí a bhaineann leo sin.  Mar chuid den chlár seo, tugtar tacaíocht don chuideachta forbartha áitiúla chun Oibrí Rannpháirtíochta Pobail a fhostú in gach ceann de na ceantair a roghnaítear, chun caidreamh a fhorbairt agus a éascú idir gheallsealbhóirí pobail, grúpaí pobail, agus gníomhaireachtaí agus struchtúir reachtúla.  Téann na hOibrithe Rannpháirtíochta Pobail i mbun oibre leis an bpobal lena bhfuiltear ag tacú, agus neartaíonn siad luachanna agus prionsabail forbartha pobail. Tacaíonn siad leis an bpobal chun freagracht a ghlacadh as na ceisteanna is mó tábhachta dóibh, chun dul i ngleic leis na ceisteanna sin, agus chun athrú dearfach a éascú agus a chruthú.  Roghnaítear ceantair i gcomhair maoinithe faoin ECP a bhfuil míbhuntáiste suntasach á fhulaingt acu, agus sainaithnítear iad trí innéacs díothachta Pobal HP.  D’fhostaigh mo Roinn sainchomhairleoir seachtrach chun tabhairt faoi mheasúnú ar thionchar an ECP agus tá an tuairisc dheiridh le bheith istigh go luath in 2026. Déanfar cinneadh ar bith faoi leathnú an ECP bunaithe ar thoradh an mheasúnaithe, faoi réir na n-acmhainní a bheidh ar fáil.  Mholfainn d’éinne atá ag lorg maoinithe suíomh gréasáin mo Roinne www.gov.ie/drcdg a sheiceáil, agus teagmháil a dhéanamh lena gCoistí um Fhorbairt Pobail Áitiúil, a gCuideachtaí Forbartha Áitiúla, agus a Líonraí Rannpháirtíochta Pobail, le cinntiú go bhfuil siad ar an eolas faoi dheiseanna maoinithe ábhartha de réir mar a chuirtear ar fáil iad. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 47. D'fhiafraigh Deputy Mairéad Farrell den Minister for Rural and Community Development and the Gaeltacht an bhfuil sé i gceist aige daoine a fhostú i nGaeltacht Chonamara faoin gClár um Chumhachtú Pobal; agus an ndéanfaidh sé ráiteas ina thaobh. [68518/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_85",
          "debateSectionId": "dbsect_85",
          "showAs": "An Ghaeltacht",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_85.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_47",
        "questionNumber": 47
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  Section 69(8)(a) and (b) of the Inland Fisheries Act 2010 sets out the requirements for the making of a notice in respect of the Wild Salmon and Sea Trout Tagging Scheme Regulations and the Department and I are undertaking this public consultation in accordance with those requirements.  The Technical Expert Group on Salmon (TEGOS) present the salmon advice regarding the scientific assessment of salmon stocks in Irish rivers annually to Inland Fisheries Ireland (IFI) for a forthcoming season as soon as the advice becomes available. The earliest possible date this occurs is generally the first or second week of November as the advice is dependent on average catch data taken from the most recent five years of catch data and fish counters' data. As the season runs to 30 September for the majority of the rivers, the salmon advice is generated by TEGOS in October before being presented to IFI.  IFI then review and forward their recommendations on the catch options for the forthcoming season after receipt of the TEGOS advice. When the IFI recommendations are received in the Department, this initiates the start of the 30-day statutory public consultation process for the draft Regulations. The generation of the Appropriate Assessment Screening (AAS) is dependent on the TEGOS Advice and the IFI Salmon Catch Advice as this scientific data forms the basis of the AAS. The AAS is prepared independently of IFI and once generated is sent for review to an independent external consultant.  The AAS can take several weeks to generate after TEGOS advice and IFI recommendations are finalised, therefore it is not possible, given time constraints, to publish the AAS along with the draft Wild Salmon and Sea Trout Tagging Scheme (Amendment) Regulations . To do so would delay the statutory public consultation process which would jeopardise the completion of Regulations in advance of the opening of the season on 1 January each year. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 178. Deputy Mairéad Farrell asked the Minister for Climate, Energy and the Environment the reason no appropriate assessment screening and/or Natura impact statement was published for the current public consultation on the Wild Salmon and Sea Trout Tagging Scheme (Amendment) Regulations 2025 and Conservation Measures for the 2026 season, considering that this documentation is vital for inspection by affected stakeholders prior to making submissions; and if he will make a statement on the matter. [68971/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_190",
          "debateSectionId": "dbsect_190",
          "showAs": "Fishing Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_190.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_178",
        "questionNumber": 178
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment (Deputy Timmy Dooley)  There is no requirement under the proposed Wild Salmon and Sea Trout Tagging Scheme Regulations for anglers or commercial fishers to tag or report the capture of Pink salmon (Oncorhynchus gorbuscha). Accordingly, the removal of such fish without tagging would not give rise to an offence under those Regulations.  The policy of the Department, and the position of Inland Fisheries Ireland (IFI), is that pink salmon are an invasive alien species. Anglers, fishers and members of the public are therefore requested to retain any pink salmon encountered and present these fish to IFI for scientific analysis. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 179. Deputy Mairéad Farrell asked the Minister for Climate, Energy and the Environment the reason Lough Corrib SAC is moving from having a harvestable quota of wild salmon in 2025 to full 'catch and release' angling for the 2026 season, considering his comments on 9 October 2025 stating that the Corrib catchment has a sizeable stock of wild salmon to meet its natural reproductive capacity and does not require supplementation with Cong hatchery stock; and if he will make a statement on the matter. [68972/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_191",
          "debateSectionId": "dbsect_191",
          "showAs": "Fishing Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_191.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_179",
        "questionNumber": 179
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment  There is no requirement under the proposed Wild Salmon and Sea Trout Tagging Scheme Regulations for anglers or commercial fishers to tag or report the capture of Pink salmon (Oncorhynchus gorbuscha). Accordingly, the removal of such fish without tagging would not give rise to an offence under those Regulations.  The policy of the Department, and the position of Inland Fisheries Ireland (IFI), is that pink salmon are an invasive alien species. Anglers, fishers and members of the public are therefore requested to retain any pink salmon encountered and present these fish to IFI for scientific analysis. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 180. Deputy Mairéad Farrell asked the Minister for Climate, Energy and the Environment whether Lough Corrib anglers can be prosecuted for removing invasive pink salmon (oncorhynchus gorbuscha) without gill tagging from the lake in 2026, considering that no blue gill tags will be distributed with the 2026 Galway district salmon licence under current draft proposals; and if he will make a statement on the matter. [68973/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_192",
          "debateSectionId": "dbsect_192",
          "showAs": "Fishing Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_192.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_180",
        "questionNumber": 180
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment (Deputy Timmy Dooley)  As set out in the information note published with the draft W ild Salmon and Sea Trout Tagging Scheme (Amendment) Regulations 2025, it is proposed that the Corrib will be exempt from the new 2026 angling Bye-law. The reason for this proposed exemption is that parts of the Corrib catchment are considered significant coarse fisheries including Ballyquirke Lake, the Moycullen Lakes and Cloondroon Lake. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 181. Deputy Mairéad Farrell asked the Minister for Climate, Energy and the Environment the reason Lough Corrib and its tributaries will be exempt from the 'salmon angling bye-law' for the forthcoming season, as referenced in an information note published alongside the draft 2026 wild salmon and sea trout tagging scheme regulations; and if he will make a statement on the matter. [68974/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_193",
          "debateSectionId": "dbsect_193",
          "showAs": "Fishing Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_193.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_181",
        "questionNumber": 181
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Climate, Energy and the Environment (Deputy Timmy Dooley)  The purpose of Bye-law No. 1011 of 2024 is to prevent anglers catching pre-spawned salmon or returning kelts during their migration to and from spawning grounds through the River Barrow system during the months of January, October, November and December each year. This Bye-law was introduced as an additional protection measure to salmon by prohibiting angling, other than angling with dead bait. It was deemed that dead baiting is unlikely to target accidental catching of salmon. Dead bait is defined as a dead fish. Therefore, the use of dead minnow is deemed to be a permissible dead bait under this bye-law. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 182. Deputy Mairéad Farrell asked the Minister for Climate, Energy and the Environment if the use of minnow (phoxinus phoxinus) is deemed to be a permissible dead bait under the Waterford Fisheries District (River Barrow) Angling Limitations during Salmon Spawning Run Bye-law (No. 1011) 2024; and if he will make a statement on the matter. [68977/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_194",
          "debateSectionId": "dbsect_194",
          "showAs": "Fishing Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_194.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_182",
        "questionNumber": 182
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  The EU Directive on the Conservation of Habitats, Flora and Fauna (92/43/EEC), commonly known as “the Habitats Directive” requires Member States to select sites, for the protection of habitats and species that are considered threatened in the EU territory and listed on the Annexes to the Directive. Sites were selected to protect habitats and species listed in the Habitats Directive are known as Special Areas of Conservation (SACs) and form part of the Natura 2000 network of protected sites across Europe.  The Habitats Directive is transposed into Irish law by way of inter alia the European Communities (Birds and Natural Habitats) Regulations 2011. The designation of every SAC in Ireland involves a comprehensive procedure including notification, objections, appeals, and final formal designation by Statutory Instrument.  Lough Corrib was proposed to the European Commission as a Site of Community Importance in May 1998. Once the European Commission, in agreement with the Member States and based on scientific criteria, officially adopts the proposed list, the site's status is confirmed as a Site of Community Importance.  My Department issued notification of its intention to designate Lough Corrib as a candidate SAC on 13th August 1999. The site was formally designated by way of Statutory Instrument on 27th July 2022 and this designation was published in Iris Oifigiúil on 2nd August 2022.  A candidate SAC it is afforded the necessary legal protection under Irish law as a ‘European Site’ from the date initial notification, while the full designation process is being concluded in accordance with the requirements of the Habitats Directive. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 351. Deputy Mairéad Farrell asked the Minister for Housing, Local Government and Heritage when Lough Corrib became a candidate special area of conservation, considering that there are conflicting dates on the public record, both domestic and European; and if he will make a statement on the matter. [68968/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_326",
          "debateSectionId": "dbsect_326",
          "showAs": "Special Areas of Conservation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_326.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_351",
        "questionNumber": 351
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  Demon Shrimp (Dikerogammarus haemobaphes) was first detected on 30 September 2025 in the Shannon River below Lough Derg. Its pathway of arrival is unknown, but it is likely to have hitchhiked on watercraft or angling equipment.  A species alert, urging water users to employ strict biosecurity measures, through the Check Clean Dry protocol, was issued and widely circulated by the National Biodiversity Data Centre to Government departments and agencies, stakeholders, and the general public. This alert is available to view on www.invasives.ie. I have also attached a copy of the alert for convenience.  Furthermore, Waterways Ireland has commissioned assessment surveys of Lough Derg and Lough Ree to check for presence of demon shrimp. The Marine Institute has been commissioned to carry out eDNA analysis to test water samples taken from various sites in and outside of the Shannon catchment for the presence of demon shrimp via their DNA.  All water users following the Check Clean Dry protocol provides the best opportunity to reduce the risk of this and other invasive species spreading to new sites. NPWS and the NBDC continue to raise awareness around Check Clean Dry through species alerts, via social media channels, and with angling representative groups.  The discovery of this species in Ireland highlights how critical it is that all water users practice Check Clean Dry to help prevent the spread of invasive species and help protect our waterways.   Demon Shrimp Species Alert  ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 352. Deputy Mairéad Farrell asked the Minister for Housing, Local Government and Heritage to detail the relevant agencies and local angling stakeholders the National Parks and Wildlife Service engaged with to prevent the introduction of the invasive demon shrimp (dikerogammarus haemobaphes) into Lough Corrib SAC, considering that the species has now been found in Portumna, County Galway; and if he will make a statement on the matter. [68969/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_327",
          "debateSectionId": "dbsect_327",
          "showAs": "Special Areas of Conservation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_327.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_352",
        "questionNumber": 352
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  Article 6 (3) of the Habitats Directive requires an appropriate assessment for any plan or project likely to have a significant effect on a Natura 2000 site. The supporting document prepared by NPWS for the site-specific objectives for marine European sites (SACs) explains how it is to be used. The 15% threshold referenced is only applied in appropriate assessments undertaken in the marine environment, and specifically in relation to the assessment of effects of continuous disturbance on soft sediment biological communities - marine community types within the Annex I habitats, that experience substantial natural variation due to natural events. These communities are mostly comprised of infaunal invertebrates and are both resilient to, and recover quickly from, disturbance. It is intended to be used in the assessment of licensed activities that do not permanently alter the Structure and Function of these habitats. It is not suggested to be applied to the assessment of effects of activities on the area of permanent habitat within a Natura Site. It is also not to be applied to keystone habitats such as Zostera or mäerl which are more susceptible to long term impact. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 353. Deputy Mairéad Farrell asked the Minister for Housing, Local Government and Heritage if his Department and the National Parks and Wildlife Service still follow the flawed policy of accepting a 15% permissible disturbance threshold for protected habitats in special areas of conservation and special protection areas, as referenced in multiple historical appropriate assessments; and if he will make a statement on the matter. [68970/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_328",
          "debateSectionId": "dbsect_328",
          "showAs": "Special Areas of Conservation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_328.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_353",
        "questionNumber": 353
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  As the Deputy is aware, Galway County Council is responsible for the maintenance and development of the piers on the Aran Islands, including Inis Meáin.  In December 2024, my Department granted funding and approval to Galway County Council to proceed with the appointment of consulting engineers to develop the Preliminary Business Case, including a Strategic Assessment, for Options for Marine Infrastructure Improvement on Inis Meáin.  At the most recent meeting with officials from my Department in November, Galway County Council advised that the consultant engineers are continuing their work on the Strategic Assessment, and are currently analysing the long list of options in respect of both piers. Each of these models and options needs to be tested and assessed to find the best solution for improving the marine infrastructure on Inis Meáin, including that used by passenger and freight ferry services.  I am advised that there was a high level of engagement from the island community with the stakeholder consultation process conducted on Inis Meáin earlier this year, and the feedback gathered during this process has informed the long list of options being developed.  The current process to develop the Preliminary Business Case, including Strategic Assessment, is due to be completed in 2026. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 553. Deputy Mairéad Farrell asked the Minister for Rural and Community Development and the Gaeltacht the status of the development of Céibh an Chóra and an Caladh Mór on Inis Meáin; the timeline for the delivery of the projects; and if he will make a statement on the matter. [68658/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_497",
          "debateSectionId": "dbsect_497",
          "showAs": "Community Development Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_497.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_553",
        "questionNumber": 553
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The purpose of the Climate Action Summer Works Scheme (CASWS) is to enable individual school authorities to undertake small-scale building works on a devolved basis that, ideally, can be carried out during the summer months or at other times that avoid disrupting the operation of the school. The CASWS operates on a multi-annual basis across a number of categories of works.  It is envisaged that approvals in any given year will involve a spread of categories rather than the traditional single category at a time. This is aimed at managing market capacity and maximising value for money opportunities for school authorities.  The CASWS will operate on a multi-annual basis. In November 2025, my colleague the former Minister of Education and Youth, Helen McEntee TD, announced the first tranche of approvals under the new Climate Action Summer Works Scheme. 297 projects were approved to proceed and involve primary, post primary and special schools, along with projects in all counties and across all categories of works.  20 schools across the county of Galway have received funding in the first tranche of approvals announced and a total of 122 projects in Deis schools across the country were included in the announcement.  Given that funding is limited in any particular year it is necessary to prioritise applications. Under the new climate action summer works scheme which operates on a multi annual basis, like previous summer works schemes, applications from schools that are not reached for funding or market prioritisation reasons in 2026 will qualify to be assessed for purposes of the funding available for climate action summer works in subsequent years.  It is anticipated that the next tranche of approvals will be in the latter half of 2026.  Full details of the of the announcement and the list of schools approved in the first tranche, the Circular (0029/2025) for the scheme and guidance documents for schools can be found at the below link; www.gov.ie/en/department-of-education/services/summer-works-scheme/. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 149. Deputy Mairéad Farrell asked the Minister for Education and Youth the reason that no DEIS Band 1 school in Galway was included in CASWS funding for 2026; if there are any other funding opportunities this year for DEIS schools to make upgrades to improve energy efficiency; and if she will make a statement on the matter. [68422/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_142",
          "debateSectionId": "dbsect_142",
          "showAs": "Educational Disadvantage",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_142.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_149",
        "questionNumber": 149
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  All passport applications are subject to the terms of the Passports Act, 2008, as amended. Section 7(1)(a) of that Act provides that a person must be an Irish citizen in order for a passport to be issued. Accordingly, every applicant for a passport must submit evidence that they are an Irish citizen and, as such, are entitled to a passport.  Entitlement to Irish citizenship is determined by the Irish Nationality and Citizenship Act 1956 (\"the 1956 Act\"), as amended, under which Irish citizenship may be obtained by birth, by descent, or by naturalisation. The 1956 Act is under the remit of the Department of Justice, Home Affairs, and Migration.  First time passport applications are necessarily complex to process. The Passport Service must validate the true identity of the applicant and take measures to confirm the applicant’s entitlement to Irish citizenship. It is the responsibility of the Passport Service to protect the integrity of the Irish passport. Accordingly, a rigorous analysis process is in place to verify the identity and citizenship status of first time applicants.  All first time applicants are required to provide an original civil birth certificate with their application. However, if an applicant provides evidence that they have taken reasonable steps to obtain a civil birth certificate and that it is not possible, the Passport Service may accept alternative documentation on a case by case basis.  Applicants with any queries can contact the Customer Service Hub for assistance at +353 1 671 1633, or via the webchat service: www.ireland.ie/contactpassportservice/  Agents are available from Monday to Friday, 9 a.m. to 4.30 p.m. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 16. Deputy Mairéad Farrell asked the Minister for Foreign Affairs and Trade if individuals who are resident in the North of Ireland and have been granted leave to remain are entitled to apply for an Irish passport if they do not have access to a birth certificate, his views on the case of an individual (details supplied); and if she will make a statement on the matter. [67987/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_25",
          "debateSectionId": "dbsect_25",
          "showAs": "Passport Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_25.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_16",
        "questionNumber": 16
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  In 2021, the European Commission (DG Environment) adopted a licence agreement allowing Member States to use the Natura 2000 logo for goods and services, under certain conditions.  The licence agreement allows a Member State to sublicense the logo to producers of goods or providers of services — but only if those goods/services meet strict criteria (e.g. products/services must originate from or be provided in a Natura 2000 site, and be compatible with conservation objectives).  To date, Spain is the only Member State to have signed a licence agreement and it intended to use this for the purposes of sustainable ecotourism. My Department has not yet considered signing a master licence agreement to implement the commercial licensing scheme for the Natura 2000 logo in Ireland. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 355. Deputy Mairéad Farrell asked the Minister for Housing, Local Government and Heritage given the Government’s commitment to supporting sustainable rural enterprises and the economic value of the Natura 2000 network; if his Department has signed the master licence agreement with the European Commission (DG Environment) to implement the commercial licensing scheme for the Natura 2000 logo in Ireland, as established by the Commission Decision of 4 June 2021; and if not, the specific timeline for signing this agreement and establishing the necessary national sub-licensing mechanism to allow compliant Irish businesses to use the logo for commercial purposes; and if he will make a statement on the matter. [68089/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_317",
          "debateSectionId": "dbsect_317",
          "showAs": "Enterprise Support Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_317.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_355",
        "questionNumber": 355
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 576. Deputy Mairéad Farrell asked the Minister for Health to provide an update on the rollout of National Clinical Practice Guideline Screening and Management of Domestic Violence in Pregnancy and the Early Postnatal Period; the number of staff that has received training to date; if GPs are included in this programme; and if she will make a statement on the matter. [67688/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_513",
          "debateSectionId": "dbsect_513",
          "showAs": "Domestic Violence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_513.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_576",
        "questionNumber": 576
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  The Programme for Government 2025: Securing Ireland's Future contains a commitment to 'maintain and where possible enhance support for Mná Tí at Gaeltacht summer colleges'. In this regard, my Department provides a number of supports for households providing accommodation for learners. The Department offers targeted support to the sector to ensure that the costs associated with necessary works and items are reduced.  Newly-recognised families may avail of a once-off starter grant. This grant supports households with the cost of works required to comply with fire safety requirements, including the installation of alarms and fire suppression systems, and the purchase of bed frames and mattresses as required. The grant is worth up to €6,000 or 80% of costs, whichever is the lesser.  My Department recently launched a short-term capital scheme for households recognised as accommodation providers for a number of years but who were unable to avail of the once-off starter grant. This upgrade grant provided targeted support to long-established households of up to €2,000 or 80% of costs, whichever is the lesser, against the cost of purchasing new bedframes and mattresses. As established households are required to routinely maintain compliance with fire safety requirements, and obtain engineer's certificates for their properties, these routine running costs were not qualifiable under the conditions of the upgrade grant.  Over 200 established households applied for this upgrade grant and my officials hope to process the vast majority of payments to qualified applicants before year-end. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 724. Deputy Mairéad Farrell asked the Minister for Rural and Community Development and the Gaeltacht if changes can be made to the payment for Mná Tí to expand to other items as required by Mná Tí rather than only those outlined; and if he will make a statement on the matter. [67444/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_651",
          "debateSectionId": "dbsect_651",
          "showAs": "An Ghaeltacht",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_651.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_724",
        "questionNumber": 724
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Rural and Community Development  The Empowering Communities Programme (ECP) is funded by my Department and commenced in 2022 initially providing funding for 14 projects. At present, there are 17 projects supported under the programme.  The programme, with the support of the relevant Local Community Development Committee (LCDC) and Local Development Company (LDC), aims to enhance community access to key services and empower local communities to develop their own responses to area-based poverty, social exclusion and the resulting consequences.  As part of this programme, the local development company is supported to engage a Community Engagement Worker in each of the selected areas, to develop and facilitate relationships between community stakeholders, community groups and statutory agencies and structures.  Community Engagement Workers engage with the supported community and reinforce community development values and principles. They assist the community to take ownership of, and address the issues that are most important to them and facilitate and create positive change.  The areas selected for funding under the ECP are ones that are experiencing significant disadvantage, identified using the Pobal HP deprivation index.  My Department has engaged an external consultant to undertake an evaluation of the impact of the ECP and the final report is due in early 2026. Any decisions with regard to the expansion of the ECP will be made based on the outcome of the evaluation and subject to available resources.  I would encourage all persons or groups seeking funding to check my Department’s website www.gov.ie/drcdg, and to engage with their Local Community Development Committees (LCDCs), Local Development Companies and Public Participation Networks (PPN), to ensure they are aware of relevant funding opportunities as they become available. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 726. Deputy Mairéad Farrell asked the Minister for Rural and Community Development and the Gaeltacht if Ros Muc and Ceantar na nOileáin will be considered for funding through the empowering communities programme, given that they are both categorised as 'disadvantaged' or 'very disadvantaged' by the Pobal HP Deprivation Index; if the Minister will outline when decisions will be made on funding for the upcoming year; and the number of areas in the state which will be selected as part of the programme in 2026; and if he will make a statement on the matter. [67507/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "showAs": "Mairéad Farrell"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_653",
          "debateSectionId": "dbsect_653",
          "showAs": "An Ghaeltacht",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_653.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_726",
        "questionNumber": 726
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  The permission given by Ireland to foreign military or state aircraft to overfly or land in the State is fully compatible with our policy of military neutrality.  The handling of requests for diplomatic clearance for overflights and landings by foreign military and state aircraft is dealt with by the Department of Foreign Affairs and Trade. Diplomatic clearance is subject to strict conditions, with full respect for Ireland’s policy of military neutrality.  In particular, foreign military and state aircraft are only permitted to land in the State if they meet the strict conditions for diplomatic clearance, including that the aircraft is unarmed, and carries no arms, ammunition or explosives; that it is not engaged in intelligence gathering; and that it does not form part of a military operation or exercise.  Ireland's policy of military neutrality, as practised by successive Governments, means that Ireland does not participate in military alliances or common or mutual defence arrangements. As the Government has stated on numerous occasions, there are no plans to alter this policy.  The Department of Foreign Affairs and Trade does not lead on the issue of air traffic control fees, and questions on this issue should be directed to the Department of Transport, Tourism and Sport. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Mairéad Farrell",
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_64.xml"
            }
          },
          "debateSectionId": "dbsect_64",
          "showAs": "Military Aircraft",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_64"
        },
        "questionNumber": 30,
        "date": "2025-11-27",
        "showAs": " 30. Deputy Mairéad Farrell asked the Minister for Foreign Affairs and Trade if her attention has been drawn to the €10 million air traffic control bill that has been paid by the taxpayer to facilitate US military flights through Shannon Airport since 2018; if she could provide a justification for that spending, given our military neutrality; and if she will make a statement on the matter. [66527/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_30"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  Reports of the Farmers Journal investigation into the sale of hormones and antibiotics in Brazil raise important issues and merit careful examination.  We know that Brazilian beef already enters the EU market, and it is therefore important to ensure that none of the unregulated products referenced in the investigation are used in its production. While there is no evidence that this is the case, these reports reinforce the need for continued vigilance.  According to Central Statistics Office data for the last number of years, Ireland has not imported beef product in any significant quantities from Brazil. In 2024, imports from Brazil amounted to 97 tonnes of a total of 34,000 tonnes imported. Beef imports from other Mercosur countries was virtually nil.  The EU has very stringent standards, known as SPS (sanitary and phytosanitary) standards, to protect human, animal and plant health. These are amongst the highest in the world, and the European Commission has insisted that they are not negotiable. These SPS standards remain unaltered regardless of any trade agreements concluded by the EU.  The Government is very firmly of the view that these EU SPS standards must continue to be rigorously upheld for the benefit of European consumers. It is also important that the European Commission continues to engage with the Brazilian authorities to ensure that this is the case.  Production standards go beyond SPS standards, and take other issues into account, including environmental sustainability.  The Commission has committed to rolling out initiatives in this area as set out in the Vision for Agriculture and Food, including steps towards potential alignment of production standards between domestic and imported products - notably on pesticides and animal welfare - and an increase in SPS checks.  On pesticides, the Commission has established a principle that the most hazardous pesticides banned in the EU for health and environmental reasons are not allowed back to the EU through imported products. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Mairéad Farrell",
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_115.xml"
            }
          },
          "debateSectionId": "dbsect_115",
          "showAs": "Food Safety",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_115"
        },
        "questionNumber": 116,
        "date": "2025-11-27",
        "showAs": " 116. Deputy Mairéad Farrell asked the Minister for Agriculture, Food and the Marine if his attention has been drawn to the food standards of South American agricultural products that may be imported into Ireland; if he is concerned that they are being produced using hazardous pesticides that have been banned in the EU for decades; and if he will make a statement on the matter. [66484/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_116"
      },
      "contextDate": "2025-11-27"
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 262. Deputy Mairéad Farrell asked the Minister for Agriculture, Food and the Marine if accessibility for those with limited mobility was assessed when developing the planning application Passenger Embarkation Area, Rossaveel Fishery Harbour Centre, Rossaveel, County Galway; if he will provide detail on any research or guidelines that were taken into consideration in that regard; and if he will make a statement on the matter. [66540/25] ",
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  In March this year I announced details of €27.75 million allocated for capital projects in Ireland’s publicly owned harbours through the 2025 Fishery Harbour Centre and Coastal Infrastructure Development Programme. Of this, I allocated €23.4 million investment to modernise and enhance the six state-owned Fishery Harbour Centres (FHCs) located at Castletownbere, Dingle, Dunmore East, Howth, Killybegs and Ros An Mhíl which are owned, operated, developed and maintained by my Department under statute.  My Department submitted a planning application with Galway County Council on 31st October 2025 (Ref No 2561595) in connection with upgrading the current passenger shelter facility, at the ferry pontoon terminal at Ros an Mhíl Fishery Harbour Centre. The current bus-shelter type structure is particularly in need of upgrade given its structural condition and exposed location.  The upgrade will provide adequate shelter and safer movement of passengers within the embarkation area, ensuring a smooth and safe flow of passenger traffic, harbour users and the general public realm area and will be a welcome enhancement to the harbour. The project scope includes the removal of the existing shelters and construction of new shelters, along with associated works such as paving, lighting, signage, seating etc.  In preparing the planning application, the design team ensured that the proposed works were developed in accordance with the relevant standards and guidance and that the needs of all users were taken into consideration. In particular, safety features will be included to accommodate and improve accessibility for users with reduced mobility.  The architect-designed project will also be further developed, at a detailed design stage, to ensure that the facility is delivered following best practice and universal design principles. An accessibility audit will be carried out prior to tendering of the construction works. The planning application can be viewed online [ ePlan - Online Planning Details ] (www.eplanning.ie/GalwayCC/AppFileRefDetails/2561595/0). ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_262",
        "debateSection": {
          "showAs": "Harbours and Piers",
          "debateSectionId": "dbsect_238",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_238.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_238"
        },
        "date": "2025-11-26",
        "questionNumber": 262,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Mairéad Farrell",
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08"
        },
        "questionType": "written",
        "to": {
          "showAs": "Agriculture",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 352. Deputy Mairéad Farrell asked the Minister for Health the progress made on the development of a primary care centre for the region of An Cheathrú Rua and Leitir Móir in County Galway; and if she will make a statement on the matter. [66655/25] ",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_352",
        "debateSection": {
          "showAs": "Primary Care Centres",
          "debateSectionId": "dbsect_314",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_314.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_314"
        },
        "date": "2025-11-26",
        "questionNumber": 352,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Mairéad Farrell",
          "memberCode": "Mairéad-Farrell.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08"
        },
        "questionType": "written",
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "question": {
        "showAs": " 16. Deputy Mairéad Farrell asked the Minister for Housing, Local Government and Heritage to provide greater detail on how domestic violence is addressed within the Action Plan on Housing Supply and Targeting Homelessness, 2025-2030, including if refuge provision or transitional housing will be provided for domestic violence and abuse survivor-victims; and if he will make a statement on the matter. [65496/25] ",
        "debateSection": {
          "showAs": "Housing Provision",
          "debateSectionId": "dbsect_52",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_52",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_52.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Mairéad Farrell",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mairéad-Farrell.D.2020-02-08",
          "memberCode": "Mairéad-Farrell.D.2020-02-08"
        },
        "questionNumber": 16,
        "answerText": " Minister for Housing, Local Government and Heritage  Supporting individuals and families experiencing or at risk of experiencing homelessness is a priority for my Department and Government.  Increased supply is key to addressing homelessness. Government is focused on making sure that everyone has access to good quality, affordable and secure homes that suit their needs. Over €9 billion in capital funding will be made available for housing in 2026. The 2026 capital funding will be supplemented by over €2 billion in current funding to address housing need. Our new housing plan is an integrated housing and homelessness plan based on two key pillars: activating the supply of 300,000 more homes; and supporting people to have a home of their own. The plan aims to deliver an average of 12,000 social homes every year to 2030, providing more homes to reduce long-term family homelessness, prevent people from experiencing homelessness and support people on low incomes  Under the new plan, a protocol will be agreed with local authorities to provide that victims of domestic violence can transfer previous time spent on a social housing waiting list to another local authority, subject to meeting all social housing eligibility requirements.  My Department, working with Cuan, supports the development of Domestic Violence Refuges through the Capital Assistance Scheme (CAS). CAS provides up to 100% capital funding to Approved Housing Bodies to advance Refuge projects in partnership with Domestic Violence groups. My Department and the Housing Agency work closely with the relevant local authorities and Cuan to support, provide technical advice, and advance these projects from initial design through to construction and completion.  While some safe homes have been funded directly via CAS in the past, groups sourcing, providing and operating safe homes for victims of domestic violence are supported to do so by Cuan as part of the national refuge accommodation programme.  Budget 2026 provides an allocation of €513.5m to provide homeless emergency accommodation and essential related services including homelessness prevention supports. Capital funding of €50m has been allocated to support the provision and maintenance of quality emergency and transitional accommodation.[ ] ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_16",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    }
  ]
}