{
  "head": {
    "counts": {
      "questionCount": 7344,
      "resultCount": 7344
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  A student may be assessed as an independent student (i.e. assessed without reference to parental income and address) if they have attained the age of 23 on the 1st of January of the year of first entry or re-entry (following a break in study of at least 3 years) to an approved further or higher education course, and is not ordinarily resident with their parents from the previous 1st October. This status continues for the duration of their study.  Only in exceptional cases, where compelling evidence of estrangement from parents/guardians is provided, can candidates who are under 23 be assessed without reference to their parents/guardians income or address, Article 21(3) (b) of the Scheme refers. If an applicant is irreconcilably estranged from their parents or legal guardians, they can declare this on their SUSI application. Such applications are reviewed on a case-by-case basis by a specialist assessment team who are dedicated to giving them the care and thorough consideration required around such a sensitive issue. Applicants are requested to provide documentary evidence of estrangement to confirm their situation. The type of documentary evidence required is dependent on the applicant’s individual circumstances and may vary widely from case to case.  An official from my Department has advised that the student referred to by the Deputy applied to the awarding authority, SUSI for grant funding and was refused as they did not provide sufficient evidence of estrangement from their parent. The student then appealed this decision on 18 November 2025 and the SUSI appeals officer refused the appeal on 1 December 2025, because the documents submitted were insufficient to support their estrangement from their parent.If an applicant is not satisfied with the outcome of the SUSI appeal, they may submit a further appeal to the independent Student Grants Appeals Board (SGAB).  As of today, I’ve been informed that the Board has not yet received an appeal from the student. If they wish to proceed, please advise the student to ensure their appeal is submitted within 30 days of the SUSI appeal decision, and include any additional documentation that may support their case. An appeal can be lodged online at: www.studentgrantappeals.ie  I hope that this clarifies the situation and I wish the student the very best with their studies. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 775. Deputy John McGuinness asked the Minister for Further and Higher Education, Research, Innovation and Science the reason a person (details supplied) is being refused a SUSI grant in view of circumstances (details supplied); and if he will make a statement on the matter. [73417/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-McGuinness.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "showAs": "John McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_741",
          "debateSectionId": "dbsect_741",
          "showAs": "Grant Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_741.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_775",
        "questionNumber": 775
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The person concerned has been awarded a Bereaved Partner's Contributory Pension at the weekly rate of €277.00 with effect from the 07th November 2025. In addition they have also been granted an Increase for Living Alone at the weekly rate of €22.00, Fuel Allowance at the weekly rate of €33.00 and Telephone Support Allowance at the weekly rate of €2.50. Payment will commence into her nominated bank account from 12th December 2025. Any arrears due will also be paid into her nominated bank account on the same date.  The person concerned has been notified of this decision in writing.  I hope this clarifies the position for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 649. Deputy John McGuinness asked the Minister for Social Protection if the widows pension will be approved as a matter of urgency for a person (details supplied). [72016/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-McGuinness.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "showAs": "John McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_511",
          "debateSectionId": "dbsect_511",
          "showAs": "Widow's Pension",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_511.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_649",
        "questionNumber": 649
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  As the Deputy will be aware, the Government agreed to close the Immigrant Investor Programme (IIP) to any further project proposals.  The IIP is fundamentally a programme for investors, not for projects or funds. The investor is the primary applicant and makes an application for an immigration permission and nominates a proposed project as part of that application.  At present there are about 1,400 investor applications on hand being processed. Many previously approved project proposals have not completed their full quota of investment yet. My Department continues to receive and process associated investor applications until such a time as all project proposals are completed.  Whilst my Department is no longer receiving new project proposals for consideration, at the time of the closure there were a significant number of project proposals submitted. As of December 2025, approximately 90 project proposals are awaiting consideration and decision.  I anticipate all project proposals will receive a decision in 2026 which will then enable remaining investor applications to be processed to completion. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 716. Deputy John McGuinness asked the Minister for Justice, Home Affairs and Migration the current status of the immigrant investor programme; the number of qualified applications and investors; the indicative timeline for final approval; and if he will make a statement on the matter. [71939/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-McGuinness.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "showAs": "John McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_566",
          "debateSectionId": "dbsect_566",
          "showAs": "Immigration Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_566.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_716",
        "questionNumber": 716
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 816. Deputy John McGuinness asked the Minister for Children, Disability and Equality if a place will be provided for a person (details supplied) given they urgently require a structured plan for their future care; and if she will make a statement on the matter. [71440/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-McGuinness.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "showAs": "John McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_641",
          "debateSectionId": "dbsect_641",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_641.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_816",
        "questionNumber": 816
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  Under the Health Act 2004, the Health Service Executive (HSE) is required to manage and deliver, or arrange to be delivered on its behalf, health and personal social services. The Minister for Health is prohibited from directing the HSE to provide a treatment or a personal service to any individual or to confer eligibility on any individual.  In relation to the particular query raised, as this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 920. Deputy John McGuinness asked the Minister for Health if an urgent appointment will be arranged for a person (details supplied); and if she will make a statement on the matter. [71486/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-McGuinness.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "showAs": "John McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_733",
          "debateSectionId": "dbsect_733",
          "showAs": "Departmental Inquiries",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_733.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_920",
        "questionNumber": 920
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1013. Deputy John McGuinness asked the Minister for Health further to Parliamentary Question No. 634 of 23 September 2025, if an urgent response from the HSE will be provided (details supplied). [72019/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-McGuinness.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "showAs": "John McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_826",
          "debateSectionId": "dbsect_826",
          "showAs": "Health Service Executive",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_826.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1013",
        "questionNumber": 1013
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  At present, Tipperary FET College Carrick-on-Suir provides training for the Electrical programme at Phase 2. Apprenticeship provision began at the centre in September 2024. As such, it is only possible to provide data commencing from that date. As of 10 December, 70 electrical apprentices have already gone through training at Tipperary FET College Carrick-on-Suir, and an additional 28 apprentices are currently undertaking training there.  In compliance with GDPR legislation, it is not possible to provide detailed information regarding the specific qualifications held by individuals. Programme training is provided by three Electrical instructors, each with a minimum of a Level 6 National Craft Certificate and a minimum of five years' experience. The centre employs two clerical staff - one full-time and one part-time - who are responsible for the administration of all FET provision within the centre. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1157. Deputy John McGuinness asked the Minister for Further and Higher Education, Research, Innovation and Science the number of apprentices undertaking courses at a centre (details supplied); the type of apprenticeships offered; the number of applicants for each course in each of the past four years; the number of full time clerical staff involved in the administration of the courses and their qualifications; and if he will make a statement on the matter. [71422/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-McGuinness.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "showAs": "John McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_974",
          "debateSectionId": "dbsect_974",
          "showAs": "Apprenticeship Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_974.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1157",
        "questionNumber": 1157
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  As you may be aware, work is underway to develop a National Planning Statement for Wind Energy under the Planning and Development Act 2024, which will replace the current Wind Energy Development Guidelines 2006 and reflect the evolving planning policy and legislative framework as well as recognising the considerable technological advances that have occurred since the publication of the 2006 Guidelines.  Ireland currently has over 5 GW of onshore wind generation with a target of 9 GW provided for in the Climate Action Plan and the National Planning Framework, by 2030. Meeting our national targets for wind energy is imperative to securing our energy security, both for delivery of critical public services and underpinning our economy. This will require further integrating renewable technologies in an appropriate manner and in full consultation with local communities.  Delivery of this National Planning Statement has been assigned to a dedicated unit within the Planning Division of my Department, with a Principal Officer, Assistant Principal Officer and two Administrative Officers leading on various regulatory and legislative aspects of this policy area, including matters such as noise, setback distance, shadow flicker, community obligation, the Renewable Energy Directive (REDIII), repowering, community dividend and grid connections. This team is supported by technical expertise, both internal and where appropriate, external, in environmental law, environmental assessment; noise, planning policy, renewable energy and the ecological sciences.  The PO-led team is working on a range of measures to progress the Government's ambitious targets regarding climate action, energy security and renewable energy infrastructure, including wind energy development and has also has responsibility for where Ireland's commitments and international obligations regarding climate and the environment interact with the planning system more generally.  My Department, in conjunction with the Department of the Climate, Environment, and Energy (DCEE) which has primary responsibility for environmental noise matters, has been working to advance guidance on the noise aspect of the National Planning Statement, which is highly technical in nature.  In line with EU Directive requirements, a Strategic Environmental Assessment (SEA) is being carried out on the draft National Planning Statement as part of the review process. In this regard, my Department intends to undertake a public consultation on updated draft Guidelines as part of the SEA process whereby all interested parties will have an opportunity to submit observations on the draft National Planning Statement. A finalised National Planning Statement will be prepared following detailed analysis and consideration of the submissions received during the consultation phase and this in turn will be subject to approval of Government.  To date, €31,860 has been incurred by my Department on works relating to ongoing SEA process. Costs relating to the work on the noise aspects of the review are a matter for the DCEE, who are the policy lead on that aspect of the NPS. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 445. Deputy John McGuinness asked the Minister for Housing, Local Government and Heritage the number of civil servants and appropriate professionals involved in drafting the regulations governing wind farm developments; if the qualifications of each person involved in the work of drafting the regulations will be provided; if the input of affected communities already impacted by such developments will be sought; the time spent to date on this work; the indicative timeframe for its completion; the costs incurred to date by Government on the issue; and if he will make a statement on the matter. [71086/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-McGuinness.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "showAs": "John McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_436",
          "debateSectionId": "dbsect_436",
          "showAs": "Wind Energy Generation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_436.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_445",
        "questionNumber": 445
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice  The application from the person referred to by the Deputy was approved on 20 October 2025 by the Domestic Residence and Permissions Division of my Department.  The person concerned should now apply to renew their Irish Residence Permit (IRP) card using the online portal, which is available at: https://inisonline.jahs.ie/user/login  Information on the renewal process, including processing times, is available at the following link: www.irishimmigration.ie/registering-your-immigration-permission/how-to-renew-your-current-permission/renewing-your-registration-permission-if-you-live-in-the-republic-of-ireland/  Applicants can now directly check the status of their applications on the Immigration Service’s Customer Service Portal. They can register for, or log in to their existing account, at:  https://portal.irishimmigration.ie/en/  Information on arrangements for people awaiting a renewal who are travelling over the Christmas period can be found at the following link: www.irishimmigration.ie/isd-announces-initiative-to-facilitate-customers-travelling-at-christmas-2/  As an Oireachtas member, the Deputy can also request the status of individual immigration cases by email, using the Oireachtas Mail facility at: IMoireachtasmail@justice.ie, which has been specifically established for this purpose. This service enables up to date information on such cases to be obtained without the need to seek information by way of the Parliamentary Question process. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 476. Deputy John McGuinness asked the Minister for Justice, Home Affairs and Migration the status of a change of circumstances application (details supplied) submitted in September 2024. [71097/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-McGuinness.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "showAs": "John McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_466",
          "debateSectionId": "dbsect_466",
          "showAs": "Departmental Correspondence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_466.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_476",
        "questionNumber": 476
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 560. Deputy John McGuinness asked the Minister for Health if the transport costs incurred by residents of private nursing homes who are in receipt of financial support under the fair deal scheme and who must attend hospital and other medical appointments, will be reimbursed; If there is a process in place whereby such residents that require transport can book it through a central office of the HSE. [70919/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-McGuinness.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "showAs": "John McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_531",
          "debateSectionId": "dbsect_531",
          "showAs": "Departmental Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_531.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_560",
        "questionNumber": 560
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The introduction of a pensions auto-enrolment system is a Programme for Government commitment, and one of my key priorities. The aim of introducing an Automatic Enrolment (AE) system is to address the pension coverage gap that exists in Ireland, and to help provide for better retirement incomes for workers. The new system will be called 'My Future Fund' and it will launch from the 1st January 2026.  I am satisfied that the National Automatic Retirement Savings Authority (NAERSA) the body which oversees the administration of the My Future Fund and the Revenue Commissioners are working in tandem on the efficient roll out of the auto-enrolment pension for 1 January 2026 and that the system set up for this task is fit for purpose. On the 1st December the My Future Fund Employer Portal was launched. The portal enables employers to register for the scheme and to set up their payment method. To date some 30,000 employers in respect of over 375,000 employees have registered their businesses on the My Future Fund Employers Portal.  Where an employer or agent acting on their behalf encounters difficulties in registration, they may call 01 568 9555 which operates Monday-Friday, 9AM to 6PM (excluding public and bank holidays) or email autoenrolment@welfare.ie and assistance will be provided.  I hope this clarifies matters for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 236. Deputy John McGuinness asked the Minister for Social Protection if he is satisfied that the Pensions Authority and the Revenue Commissioners are working in tandem on the efficient roll out of the auto-enrolment pension for 1 January 2026; if he is satisfied that the system set up for this task is fit for purpose; if the system is proving unworkable, if he will extend the date for auto-enrolment given employers may be deemed non-compliant through no fault of their own (details supplied); and if he will make a statement on the matter. [70577/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-McGuinness.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "showAs": "John McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_187",
          "debateSectionId": "dbsect_187",
          "showAs": "Pensions Reform",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_187.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_236",
        "questionNumber": 236
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  I can advise the Deputy that the cited person was issued with an invite to the recent December citizenship ceremonies. This invitation was issued to the email address associated with their naturalisation application and my officials have confirmed the email address is correct.  An official in my Department will make direct contact with the person concerned to resolve the matter. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 666. Deputy John McGuinness asked the Minister for Justice, Home Affairs and Migration the status of an application for a person (details supplied). [69766/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-McGuinness.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "showAs": "John McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_539",
          "debateSectionId": "dbsect_539",
          "showAs": "Immigration Status",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_539.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_666",
        "questionNumber": 666
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  I recently announced a developer-led wastewater infrastructure initiative to support housing delivery in areas where public wastewater services provided by Uisce Éireann are insufficient or not planned in the near term. The initiative is directed primarily at new housing rather than commercial or other non-residential developments.  The new arrangements will allow the private sector to deliver wastewater infrastructure in collaboration with Uisce Éireann, particularly in smaller towns and villages where capacity constraints have limited development. Uisce Éireann will oversee the design and construction ensuring all infrastructure meets required standards and will assume ownership and operational responsibility once completed.  Developers can now fund and deliver the required infrastructure, with Uisce Éireann available to work with them, providing guidance and ensuring regulatory compliance. Uisce Éireann may contribute to costs where the infrastructure being built provides strategic capacity for future housing or wider service needs.  The policy framework has been agreed with key stakeholders, including Uisce Éireann and the Environmental Protection Agency, and preparatory work for implementation is under way. I hope to have all the necessary measures in place by the end of the first quarter of 2026.  This will provide a clear and practical pathway for advancing urgently needed housing projects in areas affected by wastewater constraints. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 351. Deputy John McGuinness asked the Minister for Housing, Local Government and Heritage his plans to allow the use of private waste water treatment systems for developments in locations where there is inadequate or no public infrastructure provided by Irish Water; if large scale housing projects and such developments as nursing homes will be included for consideration; his plans to provide financial support for domestic and commercial developments of this kind to assist in meeting the rigorous standards that may be required by Irish Water; if he will ensure that funding is made available for housing developments in particular to assist with such costs and to prevent an uneven divide between sites serviced by public infrastructure and those developed with the use of private treatment systems; and if he will give a timeline indicating the indicative date for implementation of the new measures; and if he will make a statement on the matter. [67975/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-McGuinness.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "showAs": "John McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_314",
          "debateSectionId": "dbsect_314",
          "showAs": "Wastewater Treatment",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_314.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_351",
        "questionNumber": 351
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 470. Deputy John McGuinness asked the Minister for Children, Disability and Equality for an update on an assessment for autism for a person (detail supplied); if the full range of services required arising from the assessment are in place; and if she will make a statement on the matter. [67319/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-McGuinness.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "showAs": "John McGuinness"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_414",
          "debateSectionId": "dbsect_414",
          "showAs": "Disabilities Assessments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_414.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_470",
        "questionNumber": 470
      },
      "contextDate": "2025-12-02"
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 353. Deputy John McGuinness asked the Minister for Health if she will review the prescribed allocation of glucose sensors (details supplied). [66660/25] ",
        "answerText": " Minister for Health  Under the Health (Pricing and Supply of Medical Goods) Act 2013, the HSE has statutory responsibility for decisions on the pricing and reimbursement of medicines and medical devices; therefore, the matter has been referred to the HSE for attention and direct reply to the Deputy. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_353",
        "debateSection": {
          "showAs": "Medicinal Products",
          "debateSectionId": "dbsect_315",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_315.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_315"
        },
        "date": "2025-11-26",
        "questionNumber": 353,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "John McGuinness",
          "memberCode": "John-McGuinness.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26"
        },
        "questionType": "written",
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "question": {
        "showAs": " 354. Deputy John McGuinness asked the Minister for Education and Youth if the Irish sign language interpreter who is paid the same rate as an SNA and is employed by a school (details supplied) will be retained. [65253/25] ",
        "debateSection": {
          "showAs": "School Staff",
          "debateSectionId": "dbsect_349",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_349",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_349.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "John McGuinness",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "memberCode": "John-McGuinness.D.1997-06-26"
        },
        "questionNumber": 354,
        "answerText": " Minister of State at the Department of Education  I am pleased to advise the Deputy that my Department published the Enhancement to Irish Sign Language (ISL) Scheme provision on the 18th November. The scheme enables the provision of Irish Sign Language in-school support for students in mainstream schools who are Deaf and whose primary mode of communication and language is ISL. The circular confirms details of how the scheme is being implemented, and outlines revisions to the criteria for the inclusion of students in the next phase of the scheme. The application process for the scheme is also detailed in the circular.  This scheme is in addition to the existing provision in place to support Deaf students whose primary mode of communication and language is ISL.  The role of the ISL-Specialist Classroom Support (SCS) is to support the work of the class teachers and special education teachers and to complement other teaching and care supports provided for the students who meet the criteria. The focus of the ISL-SCS will be targeted to meet the needs of students attending a recognised mainstream school whose primary mode of communication and language is ISL and who meet the criteria outlined in the circular.  The NCSE will be commencing a recruitment campaign shortly to fill the positions. It is a matter for schools to apply to the National Council for Special Education (NCSE) for this support.  In relation to the retention of an SNA in a school I wish to advise that SNA posts are allocated to schools as a school-based resource. Principals/board of managements deploy SNAs within schools to meet the care support requirements of the children enrolled whom SNA support has been allocated. This provides schools flexibility in how the SNA support is utilised. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_354",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 355. Deputy John McGuinness asked the Minister for Education and Youth if home tuition hours and any other necessary supports will be approved for a person (details supplied). [65260/25] ",
        "debateSection": {
          "showAs": "Home Schooling",
          "debateSectionId": "dbsect_350",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_350",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_350.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "John McGuinness",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "memberCode": "John-McGuinness.D.1997-06-26"
        },
        "questionNumber": 355,
        "answerText": " Minister of State at the Department of Education  My department's Home Tuition Grant Schemes provide funding towards the provision of a compensatory educational service for children who, for a number of specific reasons, are unable to attend school. By its nature, it is intended to be a short term intervention.  The Home Tuition Grant Schemes are governed by annual circulars which sets out the purpose, eligibility criteria and details of the scheme. Circular 0047/2025 provides information in relation to the 2025/2026 Home Tuition Grant Scheme and can be accessed by clicking on the following link: www.gov.ie/en/department-of-education/circulars/home-tuition-grant-scheme-2025-2026-special-education-component/.  The purpose of the Home Tuition Grant Scheme is to provide funding towards the provision of a compensatory educational service for:  (a) Pre-School Children with autism who meet the scheme’s eligibility criteria  (b) Children seeking a Special School or Special Class placement  (c) Students, enrolled in schools, with a significant medical condition, which has caused, and is likely to continue to cause, major disruption to their attendance at school  (d) Students, enrolled in schools, with school phobia and/or associated depression/anxiety, which has caused, and is likely to continue to cause, major disruption to their attendance at school  In relation to applications for students with a significant medical condition, the principle remains that home tuition cannot be provided as an alternative to school attendance.  With regard to the child referenced by the Deputy, the Department has no record of receiving an application for Home Tuition in respect of this child.  It remains open to the parents or legal guardians to contact the Special Education Section for guidance on the application process and to seek information on the eligibility criteria for the various strands of the scheme.  Alternatively, should the Deputy wish to provide the Department with the relevant contact details, an official will make direct contact with the parents or legal guardians to offer assistance.  Contact details for the Home Tuition Unit are as follows:  Address:  Special Education Section  Department of Education and Youth  Cornamaddy  Athlone  County Westmeath  N37 X659  Email: special_education@education.gov.ie  Telephone: (090) 648 4187 ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_355",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 441. Deputy John McGuinness asked the Minister for Education and Youth the steps her Department is taking to provide a school place for a child (details supplied), who has not attended school since 2024; and if she will make a statement on the matter. [66035/25] ",
        "debateSection": {
          "showAs": "School Enrolments",
          "debateSectionId": "dbsect_421",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_421",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_421.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "John McGuinness",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "memberCode": "John-McGuinness.D.1997-06-26"
        },
        "questionNumber": 441,
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for children with special educational needs.  As your query refers to an individual placement, my department will forward the parent’s details to the NCSE and the NCSE will contact the parents directly.  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_441",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 472. Deputy John McGuinness asked the Minister for Culture, Communications and Sport if formal approval has been given for the purchase of maintenance equipment (details supplied). [65254/25] ",
        "debateSection": {
          "showAs": "Sports Facilities",
          "debateSectionId": "dbsect_441",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_441",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_441.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "John McGuinness",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "memberCode": "John-McGuinness.D.1997-06-26"
        },
        "questionNumber": 472,
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  Over a quarter of a billion euro was allocated to 3,048 community sports clubs and facilities in 2024 from the 2023 round of the Community Sport Facilities Fund (CSFF) representing the largest-ever investment in sports facilities in communities across Ireland.  The club referred to by the Deputy was allocated €80,044 in the 2020 round and €186,869 in the 2023 round of the CSFF. The club has not sought formal approval for either of these grants. The Department will process any request for formal approval when the required information has been uploaded to the Online Sports Capital Register on www.sportscapitalprogramme.ie. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Culture",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_472",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 475. Deputy John McGuinness asked the Minister for Culture, Communications and Sport his plans to make the basic income for the arts (BIA) pilot scheme permanent (details supplied); and if he will make a statement on the matter. [65384/25] ",
        "debateSection": {
          "showAs": "Artists' Remuneration",
          "debateSectionId": "dbsect_444",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_444",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_444.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "John McGuinness",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "memberCode": "John-McGuinness.D.1997-06-26"
        },
        "questionNumber": 475,
        "answerText": " Minister for Culture, Communications and Sport  I was delighted to have secured an allocation for a successor scheme to the Basic Income for the Arts pilot as part of Budget 2026. While the detail of the future scheme will need to be agreed by Government, this is a major milestone for the arts in Ireland and I am particularly pleased that the research my Department conducted provided Government with a clear evidence base upon which to make that decision.  Eligibility criteria and parameters for a successor scheme have not been finalised. The cost of the Basic Income for the Arts (BIA) pilot scheme was €35m for a full calendar year for 2,000 artists to participate, with each recipient receiving €325 a week. There were over 8,200 eligible applicants to the pilot scheme in 2022. To have funded all those eligible would have cost approximately €139m per year.  With an allocation of €18.27m in my Department’s 2026 Estimate, I look forward to the design and delivery of the successor scheme next year.  I can confirm that the BIA pilot scheme will end in February 2026, which is when the final pilot payment will be made to the current cohort of recipients. While eligibility is not yet finalised, a new cohort of recipients will be selected based on eligible applications for the successor scheme.  The research has consistently demonstrated both the positive impact the BIA has had for those in receipt of it and how difficult it is to work as an artist in Ireland given the income precarity prevalent in the sector. The BIA successor scheme will help to sustain the careers of those artists who will receive it and retain their talent in the arts sector.  Stakeholder consultation and engagement with other relevant Government Departments on the design of the new scheme is ongoing to determine details such as the duration, eligibility and selection method, the details of which have not yet been decided. Once the parameters of the scheme have been agreed by Cabinet I intend to publish them. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Culture",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_475",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 592. Deputy John McGuinness asked the Minister for Social Protection the status of an application for illness benefit and separately supplementary welfare allowance in the name of a person (details supplied). [65258/25] ",
        "debateSection": {
          "showAs": "Social Welfare Benefits",
          "debateSectionId": "dbsect_532",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_532",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_532.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "John McGuinness",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "memberCode": "John-McGuinness.D.1997-06-26"
        },
        "questionNumber": 592,
        "answerText": " Minister for Social Protection  My Department received an application for Illness Benefit from Mr. Crowley on the 15th of March 2024. He was awarded Illness Benefit from the 6th of March 2024. His claim remains open for payments and credits. Prior to this claim, he had carried 69 days from a previous Illness Benefit claim. Illness Benefit is only payable for a maximum duration of two years (624 days). A letter was sent out to Mr. Crowley on the 17th of September 2025. This informed him that his payment of Illness Benefit is due to expire on the 16th of December 2025.  The above-mentioned letter also stated that while he remains incapable of work, Mr. Crowley should continue to submit medical certificates. This would ensure that his social insurance record is kept up to date and may help him to qualify for future social welfare benefits in future.  The letter of 17th of September 2025 also outlined that Mr. Crowley may re-qualify for payment of Illness Benefit in the future. It stated that in order to do so, Mr. Crowley would have to satisfy the qualifying conditions of Illness Benefit and have a further 13 contributions paid at an appropriate PRSI class after 16th of December 2025.  Mr. Crowley was also advised in the above mentioned letter that there are a number of possible social welfare schemes for which he might qualify depending on his circumstances. These included:  • Invalidity Pension  • Disability Allowance  • Jobseekers Allowance/Benefit  He was further advised in this letter that if he is unable to meet his needs or those of his dependants (if any), that he may be entitled to Supplementary Welfare Allowance (SWA). In order to apply for this payment, he would need to attend his local Intreo office and ask to speak to one of the Department's Community Welfare Officers.  I hope this clarifies the matter for the Deputy. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Social",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_592",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 603. Deputy John McGuinness asked the Minister for Social Protection his views on whether the way in which a person was treated (details supplied) was fair; if he will have this matter investigated; and if he will make a statement on the matter. [65899/25] ",
        "debateSection": {
          "showAs": "Social Welfare Benefits",
          "debateSectionId": "dbsect_544",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_544",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_544.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "John McGuinness",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "memberCode": "John-McGuinness.D.1997-06-26"
        },
        "questionNumber": 603,
        "answerText": "",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Social",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_603",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 816. Deputy John McGuinness asked the Minister for Health if the full-time care package for a person (details supplied) promised by the HSE will be put in place immediately; if the disposable sheets and pads required will be provided by the HSE; and if a positive response will be expedited. [65232/25] ",
        "debateSection": {
          "showAs": "Health Services",
          "debateSectionId": "dbsect_728",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_728",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_728.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "John McGuinness",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "memberCode": "John-McGuinness.D.1997-06-26"
        },
        "questionNumber": 816,
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_816",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 891. Deputy John McGuinness asked the Minister for Health to examine the case of a person (details supplied) in need of follow-up treatment; her views on whether this is acceptable; the steps the HSE should take to assist this person; and if she will make a statement on the matter. [65795/25] ",
        "debateSection": {
          "showAs": "Health Services",
          "debateSectionId": "dbsect_804",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_804",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_804.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "John McGuinness",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "memberCode": "John-McGuinness.D.1997-06-26"
        },
        "questionNumber": 891,
        "answerText": " Minister for Health  Under the Health Act 2004, the Health Service Executive (HSE) is required to manage and deliver, or arrange to be delivered on its behalf, health and personal social services. The Minister for Health is prohibited from directing the HSE to provide a treatment or a personal service to any individual or to confer eligibility on any individual.  In relation to the particular query raised, as this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_891",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Education",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_340",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_340",
          "showAs": "School Staff",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_340.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 469. Deputy John McGuinness asked the Minister for Education and Youth if all appointments regarding maternity leaves, fixed-term contracts of teachers have complied with DES regulations regarding advertising regulations, appointment and interview procedures and that SNA appointments have compiled with same in terms of association with amalgamated schools since June 2025; and if she will make a statement on the matter. [65041/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_469",
        "answerText": " Minister for Education and Youth  The recruitment and appointment of teachers to fill teaching posts is a matter for the individual school authority, subject to procedures agreed under Section 24(3) of the Education Act 1998 (as amended by the Education (Amendment) Act 2012).  The procedures for filling teacher posts are set out in Department Circulars 0044/2019 for primary and 0031/2011 and 0020/2012 for post primary. These circulars require schools to employ appropriately qualified and registered teachers.  Department recruitment circulars remind schools of the requirement to adhere to the regulations and procedures set out in the relevant circulars.  The sequence for employing teachers on a short-term basis (less than 24 calendar weeks) is set out in Section 4 of Chapter 2 of Circular 0044/2019 and in Section 4 of Circular 0031/2011. The procedures for filling long-term posts (24 calendar weeks or more) are set out in Section 5 of Chapter 2 of Circular 0044/2019 and Circular 0020/2012.  Chapter 2 of Circular 0044/2019 also advises in relation to the requirement to terminate all first fixed-term contracts and if the employment is continuing for the following year, it must be automatically re-advertised by the employer and a new recruitment process undertaken for the filling of the post for the second year. Once a teacher has been interviewed for two fixed term contracts, additional interviews are not required for subsequent fixed term contracts.  In relation to Special Needs Assistants the recruitment and appointment is a matter for the individual school authority. Department Circulars 0051/2019 and 0043/2025 sets out the current requirements for appointment as a Special Needs Assistant. ",
        "questionNumber": 469,
        "by": {
          "memberCode": "John-McGuinness.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "showAs": "John McGuinness"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 461,
        "showAs": " 461. Deputy John McGuinness asked the Minister for Education and Youth when a school (details supplied) will get a special needs assistant care review; and if she will make a statement on the matter. [63194/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Education"
        },
        "by": {
          "showAs": "John McGuinness",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "memberCode": "John-McGuinness.D.1997-06-26"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_461",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_385",
          "showAs": "Special Educational Needs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_385",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_385.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is, in the first instance, the primary body responsible for the matter the Deputy has raised. I will arrange for your query to be forwarded to the NCSE for their attention and direct reply.  Deputies are also welcome to raise such queries with the NCSE directly through their dedicated Oireachtas query line at oireachtasqueries@ncse.ie. ",
        "date": "2025-11-18"
      }
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  Carer's allowance (CA) is a means-tested social assistance payment made to a person who is habitually resident in the State and who is providing full-time care and attention to a child or an adult who has such a disability that as a result they require that level of care.  An application for CA was received from the person concerned on 29 September 2025.  As part of the decision process, the application was referred for the professional opinion of a Department Medical Assessor.  The claim was disallowed as the Deciding Officer, having regard to the opinion of the Medical Assessor, decided that the information supplied did not show that the care recipient required full time care.  The person concerned was notified of this decision on 04 November 2025.  They were also notified of their right to have the decision reviewed (where further information is available) or to appeal the decision to the Social Welfare Appeals Office.  Fuel Allowance has been awarded to the person concerned on their State Pension Contributory claim with effect from 26 September 2025.  I hope this clarifies the position for the Deputy. ",
        "to": {
          "showAs": "Social",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "John McGuinness",
          "memberCode": "John-McGuinness.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_564.xml"
            }
          },
          "debateSectionId": "dbsect_564",
          "showAs": "Social Welfare Benefits",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_564"
        },
        "questionNumber": 646,
        "date": "2025-11-12",
        "showAs": " 646. Deputy John McGuinness asked the Minister for Social Protection if carers allowance and fuel allowance will be approved for a person (details supplied) as a matter of urgency. [60931/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_646"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  Coroners are independent office holders, and the Department has no role in directing their work during the death investigation function.  Neither does the Department have any role in relation to the work of pathologists, who undertake postmortem examinations (PME) on the direction of a coroner.  Policy and operational responsibilities for the provision of postmortem examination services to support the work of the Coroner Service is supported by multiple departments and agencies. My Department is responsible for the legislation underpinning the work of coroners, while the provision of the postmortem examination service is largely provided through the health service and its personnel.  It is important to clarify that pathologists, other than forensic pathologists in the Office of the State Pathologist, are not contracted to either my Department, or to coroners.  Where a coroner deems a postmortem examination to be required, the coroner concerned will arrange the post-mortem examination to be conducted as expeditiously as possible to ensure timely release of remains to the next of kin of the deceased. Depending on the circumstances of the death, a post-mortem examination will be carried out by a pathologist or, in forensic cases, by the Office of the State Pathologist.  My Department is aware that securing the provision of the postmortem service for the coronial death investigation function is challenging for several reasons, including issues relating to the training and recruitment of pathologists, as well as competing demands on pathologists in areas of diagnostic and research work. With this in mind, my Department in April 2022 established a ‘Standing Committee on the Provision of Coroner Directed PMEs’, membership of which consists of representatives from the department of Justice, Home Affairs and Migration, the Department of Health, the Health Service Executive, the Office of the State Pathologist, An Garda Síochána, the Coroners Society of Ireland, the Department of Housing, Local Authorities and Heritage and the Faculty of Pathology, Royal College of Physicians Ireland.  While this committee is an important forum, with appropriate membership to discuss issues in relation to the autopsy service, I am conscious that the situation in University Hospital Waterford, and other hospitals, has reached a critical juncture and an urgent solution is required.  In this regard, a collaborative approach between my Department, the Department of Health, the HSE, UHW and its pathologists is clearly required.  There has been detailed engagement at a senior level between my Department and colleagues in the Department of Health, the HSE, and UHW, with a view to finding a solution to the situation in UHW in advance of the 1 January deadline.  This work is continuing on an urgent basis.  It is also worth noting that in October 2024, Government approval was given to draft a general scheme of a Bill to significantly reform the Coroner Service, to increase efficiencies and minimise the impact of the death investigation process on bereaved people. ",
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "John McGuinness",
          "memberCode": "John-McGuinness.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_660.xml"
            }
          },
          "debateSectionId": "dbsect_660",
          "showAs": "Coroners Service",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_660"
        },
        "questionNumber": 759,
        "date": "2025-11-12",
        "showAs": " 759. Deputy John McGuinness asked the Minister for Justice, Home Affairs and Migration his proposals to continue the south east coronial post-mortem service at WUH from January 2026; the number of times his Department has met with the HSE to resolve the issues that have arisen; if recruitment of the appropriate professionals is underway; if contingency plans have been drawn up to prevent any disruption of the service; if the coroners involved have been consulted; and if he will make a statement on the matter. [61537/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_759"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Health  Ireland has a voluntary private health insurance market, which operates under the principles of community rating (including lifetime community rating), open enrolment, lifetime cover and minimum benefits. The purpose of Community Rating is to ensure that everyone in Ireland can buy the same insurance policy for the same price, regardless of their age or status. Older or less healthy people pay the same price as younger and healthier people.  Lifetime Community Rating was introduced in 2015 to encourage people to join the health insurance market at a younger age. Younger people tend to claim less and a balance between younger and healthier people and older and sicker people contributes to the sustainability of the community rated private health insurance market overall.  Under Lifetime Community Rating, loadings of 2% per annum apply to those who are entering the health insurance market for the first time at age 35 or older, up to a maximum loading of 70% for ages 69 or older. In circumstances where loadings do apply, previous periods of inpatient insurance cover are taken into account and can reduce the level of loading applied to a premium. It is important to note that any loading will apply for a maximum period of 10 years.  The Minister for Health has no current plans to review the need for Lifetime Community Rating in private health insurance. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "John McGuinness",
          "memberCode": "John-McGuinness.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_777.xml"
            }
          },
          "debateSectionId": "dbsect_777",
          "showAs": "Insurance Coverage",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_777"
        },
        "questionNumber": 910,
        "date": "2025-11-12",
        "showAs": " 910. Deputy John McGuinness asked the Minister for Health the plans to review the need for lifetime community rating on private health insurance; and if she will make a statement on the matter. [60905/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_910"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Health  Under the Health Act 2004, the Health Service Executive (HSE) is required to manage and deliver, or arrange to be delivered on its behalf, health and personal social services. The Minister for Health is prohibited from directing the HSE to provide a treatment or a personal service to any individual or to confer eligibility on any individual.  In relation to the particular query raised, as this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "John McGuinness",
          "memberCode": "John-McGuinness.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_783.xml"
            }
          },
          "debateSectionId": "dbsect_783",
          "showAs": "Hospital Appointments Status",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_783"
        },
        "questionNumber": 916,
        "date": "2025-11-12",
        "showAs": " 916. Deputy John McGuinness asked the Minister for Health if an early date for surgery will be arranged for a person (details supplied). [60964/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_916"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  As this is an operational matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "John McGuinness",
          "memberCode": "John-McGuinness.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_873.xml"
            }
          },
          "debateSectionId": "dbsect_873",
          "showAs": "Home Help Service",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_873"
        },
        "questionNumber": 1016,
        "date": "2025-11-12",
        "showAs": " 1016. Deputy John McGuinness asked the Minister for Health the efforts being made by the HSE to recruit staff for the home support services being delivered in Carlow and Kilkenny; the estimated number of extra staff required to fulfil all of the demands on the service; the number of frontline staff directly employed by the HSE in the service; the number of agency staff employed for each of the past three years; if a certain ratio between HSE and agency staff is required to be maintained; if the home support services will be maintained as a stand alone service into the future; if the hours budgeted for by Government are fully allocated or sufficient to cover requirements to year end; and if she will make a statement on the matter. [61540/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_1016"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the HSE to reply to the Deputy directly as soon as possible.   ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "John McGuinness",
          "memberCode": "John-McGuinness.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_890.xml"
            }
          },
          "debateSectionId": "dbsect_890",
          "showAs": "Medical Aids and Appliances",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_890"
        },
        "questionNumber": 1033,
        "date": "2025-11-12",
        "showAs": " 1033. Deputy John McGuinness asked the Minister for Health if an application for continuous glucose monitoring technology submitted to the primary care reimbursement service by the patients diabetes nurse specialist (details supplied) St. Luke's Hospital, Kilkenny, will be reviewed and approved as a matter of urgency. [61678/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_1033"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Health  Under the Health Act 2004, the Health Service Executive (HSE) is required to manage and deliver, or arrange to be delivered on its behalf, health and personal social services. The Minister for Health is prohibited from directing the HSE to provide a treatment or a personal service to any individual or to confer eligibility on any individual.  In relation to the particular query raised, as this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible.   ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "John McGuinness",
          "memberCode": "John-McGuinness.D.1997-06-26",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_892.xml"
            }
          },
          "debateSectionId": "dbsect_892",
          "showAs": "Hospital Appointments Status",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_892"
        },
        "questionNumber": 1035,
        "date": "2025-11-12",
        "showAs": " 1035. Deputy John McGuinness asked the Minister for Health for an update in regard to a person awaiting an operation (detail supplied). [61696/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_1035"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_275",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "John McGuinness",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "memberCode": "John-McGuinness.D.1997-06-26"
        },
        "debateSection": {
          "debateSectionId": "dbsect_255",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_255",
          "showAs": "Social Welfare Benefits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_255.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Social",
          "roleCode": null
        },
        "showAs": " 275. Deputy John McGuinness asked the Minister for Social Protection if a full review of an application for carers allowance for a person (details supplied) will be undertaken. [60801/25] ",
        "questionNumber": 275,
        "answerText": " Minister for Social Protection  The person concerned applied for Carers Allowance on 7th March 2025. Their application was refused on 9th April 2025, on the grounds that the person concerned had not established that they are providing full time care and attention, within the meaning of social welfare legislation and as their assessed means exceed the limit to qualify for this payment.  The person concerned submitted an appeal on 13th May 2025. This appeal is currently under consideration with an Appeals Officer who will make a summary decision on the appeal based on the documentary evidence presented. The person concerned will be notified of the Appeals Officer’s decision in the coming days.  I trust this clarifies the matter for the Deputy. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_362",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "John McGuinness",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "memberCode": "John-McGuinness.D.1997-06-26"
        },
        "debateSection": {
          "debateSectionId": "dbsect_324",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_324",
          "showAs": "Patient Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_324.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Children",
          "roleCode": null
        },
        "showAs": " 362. Deputy John McGuinness asked the Minister for Children, Disability and Equality if permanent transport will be provided for a person attending treatment (details supplied). [60800/25] ",
        "questionNumber": 362,
        "answerText": " Minister of State at the Department of Children, Disability and Equality  While day service funding does not include transport, some transport supports are provided by the HSE or funded agencies on a discretionary basis, and a variety of transport solutions are pursued in different CHO areas. These include travel training to enable public transport to be used, where appropriate, local transport such as Local Link, private bus transport and taxis, and some service providers provide transport where capacity exists.  In general, day service users are in receipt of disability allowance and are automatically entitled to the Free Travel Pass.  Under Pillar 5 of the recently published Human Rights Strategy for Disabled People 2025-2030, the Department of Transport has lead responsibility for reducing and, where possible, eliminating transport barriers faced by disabled people. Under Pillar 5, there is a commitment to personal mobility, and supporting those who cannot use or easily access any public transport through the provision of enhanced personal mobility options.  As transport to day services is a service matter, I have asked the Health Service Executive (HSE) to respond to the Deputy directly on this aspect of the question, as soon as possible.  HSE-funded day programmes for people with intellectual disabilities, autism, or complex physical disabilities include a range of centre-based and community-based activities. Access to services is based on an individual’s needs rather than on their diagnosis. The focus is on supporting people to participate in the mainstream activities and in the life of their community, in line with their wishes and needs. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_363",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "John McGuinness",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "memberCode": "John-McGuinness.D.1997-06-26"
        },
        "debateSection": {
          "debateSectionId": "dbsect_325",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_325",
          "showAs": "Unaccompanied Minors and Separated Children",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_325.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Children",
          "roleCode": null
        },
        "showAs": " 363. Deputy John McGuinness asked the Minister for Children, Disability and Equality the number of unaccompanied minors who have entered the country in each of the past five years from Ukraine and elsewhere; the arrangements to accommodate them and to provide specific services that may be required; the cost to the State for accommodation and health care in each of the past five years; if the required number of social workers are assigned to the care of these minors; the number of social workers dedicated to the response; and if the funding for the response comes from one Department or a number of Departments..  [60804/25] ",
        "questionNumber": 363,
        "answerText": " Minister for Children, Disability and Equality  As this question relates to operational information held by Tusla, the Child and Family Agency, the question has been referred to the Agency to reply directly to the Deputy. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_364",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "John McGuinness",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "memberCode": "John-McGuinness.D.1997-06-26"
        },
        "debateSection": {
          "debateSectionId": "dbsect_326",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_326",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_326.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Children",
          "roleCode": null
        },
        "showAs": " 364. Deputy John McGuinness asked the Minister for Children, Disability and Equality the progress in arranging a report or overview arising from the Farrelly Commission report and the Dáil debate on the subject; the timeframe for the actions to be taken; and if she will make a statement on the matter.  [60805/25] ",
        "questionNumber": 364,
        "answerText": " Minister for Children, Disability and Equality  The Commission of Investigation (Certain matters relative to a disability service in the South East and related matters), \"the Farrelly Commission\" was established in 2017 to investigate the care and protection of “Grace” and others in a former foster home in the Southeast (Family X), which had been the subject of abuse allegations.  As the deputy may be aware, the Final Substantive Report on the first phase of the “Farrelly Commission” was published on the 15th of April 2025 following approval by government.  The Government committed to undertaking an expert-driven, non-statutory safeguarding exercise to identify learnings from the Commission’s findings to inform present day safeguarding policies and practices. The seven people referenced in the Commission’s statement on Part X and/or their representatives have been invited to participate in this exercise, to share their lived experience, if they wish to do so.  The deputy may wish to note the following developments:  - Considering the highly sensitive nature of the exercise and the specialised expertise required, extensive engagement has been undertaken between my officials and the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitisation and the Office of Government Procurement regarding appropriate sanction for the exercise. Following this, a procurement process was undertaken and further assessment and engagement with experts was required. I can confirm I expect to be in a position to appoint an appropriate individual in the coming days. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_462",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "John McGuinness",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "memberCode": "John-McGuinness.D.1997-06-26"
        },
        "debateSection": {
          "debateSectionId": "dbsect_422",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_422",
          "showAs": "Patient Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_422.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "showAs": " 462. Deputy John McGuinness asked the Minister for Health if permanent transport will be provided for a person attending treatment (details supplied). [60799/25] ",
        "questionNumber": 462,
        "answerText": " Minister for Health  This a matter for the Department of Children Equality and Disabilities and does not require a response from both Departments. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_463",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "John McGuinness",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "memberCode": "John-McGuinness.D.1997-06-26"
        },
        "debateSection": {
          "debateSectionId": "dbsect_423",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_423",
          "showAs": "Hospital Appointments Status",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_423.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "showAs": " 463. Deputy John McGuinness asked the Minister for Health further to Parliamentary Question No.482 of 24 September 2024, the progress made in arranging an operation for a patient (details supplied) that was scheduled in 2022, 2023 and 2024 in Beaumont Hospital and if she will expedite the matter. [60802/25] ",
        "questionNumber": 463,
        "answerText": " Minister for Health  Under the Health Act 2004, the Health Service Executive (HSE) is required to manage and deliver, or arrange to be delivered on its behalf, health and personal social services. The Minister for Health is prohibited from directing the HSE to provide a treatment or a personal service to any individual or to confer eligibility on any individual.  In relation to the particular query raised, as this is a service matter, I have again asked the Health Service Executive to respond to the Deputy directly, as soon as possible. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_464",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "John McGuinness",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "memberCode": "John-McGuinness.D.1997-06-26"
        },
        "debateSection": {
          "debateSectionId": "dbsect_424",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_424",
          "showAs": "Hospital Appointments Status",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_424.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "showAs": " 464. Deputy John McGuinness asked the Minister for Health the progress to date in arranging a date for a procedure for a person (details supplied) in University Hospital Waterford. [60803/25] ",
        "questionNumber": 464,
        "answerText": " Minister for Health  Under the Health Act 2004, the Health Service Executive (HSE) is required to manage and deliver, or arrange to be delivered on its behalf, health and personal social services. The Minister for Health is prohibited from directing the HSE to provide a treatment or a personal service to any individual or to confer eligibility on any individual.  In relation to the particular query raised, as this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_465",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "John McGuinness",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "memberCode": "John-McGuinness.D.1997-06-26"
        },
        "debateSection": {
          "debateSectionId": "dbsect_425",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_425",
          "showAs": "General Practitioner Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_425.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "showAs": " 465. Deputy John McGuinness asked the Minister for Health if she will ensure that an appropriate location will be provided for the newly appointed GP and associated medical services at Mullinavat, County Kilkenny, if the local health centre has been assessed to determine its future use; and if she will make a statement on the matter. [60806/25] ",
        "questionNumber": 465,
        "answerText": " Minister for Health  As this is a service matter, I have asked the HSE to reply to the Deputy directly as soon as possible. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_488",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "John McGuinness",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "memberCode": "John-McGuinness.D.1997-06-26"
        },
        "debateSection": {
          "debateSectionId": "dbsect_449",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_449",
          "showAs": "Dental Services ",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_449.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Health",
          "roleCode": null
        },
        "showAs": " 488. Deputy John McGuinness asked the Minister for Health if she will consider allowing dental hygienists to set up a practice in their own right and independent of a dental practice; and if she will make a statement on the matter. [60912/25] ",
        "questionNumber": 488,
        "answerText": " Minister for Health  Currently, in accordance with the Dentists Act 1985, a dental hygienist can work to the treatment plan outlined by a dentist, who first examines the patient. Dental hygienists provide preventive focused oral health care to children and adults, of all ages. Within their current scope of practice, hygienists can play a key role in alleviating waiting lists.  In the period since the existing dental legislation was enacted, the National Oral Health Policy has been published. The policy supports a triage system which would allow a dental hygienist to assess the patient initially and considers the value of a more extended scope of practice. Such a system would further improve access for the public to preventive care and service providers such as the HSE could then incorporate the extended scope of practice for dental hygienists into their services.  The Deputy should note that work has been undertaken by my Department to review direct access and the scope of practice of various oral healthcare professionals including dental hygienists. This work is being integrated into a wider framework of implementation of the national policy which in tandem must also progress strategic workforce planning to support the substantial reform objectives of the policy.  The outcomes of this work will allow the formulation of a policy position on whether certain designated oral healthcare professions, including dental hygienists, can provide oral healthcare services without being supervised by a dentist once they are working within their scope of practice. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "showAs": "John McGuinness",
          "memberCode": "John-McGuinness.D.1997-06-26"
        },
        "questionNumber": 132,
        "questionType": "written",
        "answerText": " Minister for Social Protection  The person concerned reached pension age on 07 December 2024.  To qualify for the standard state pension (contributory) a minimum of 520 paid contributions is required in the first instance. The records of my Department show that the person concerned has 434 paid contributions which falls short of the minimum requirement.  Flexible pension arrangements are available for people who turn 66 on or after 1 January 2024. State pension may now be claimed from any date between the age of 66 and 70. As the person concerned does not qualify for state pension, it is open to them to acquire additional contributions to qualify and claim the state pension at a later date between the age of 66 and 70. The person concerned requires an additional 86 contributions to qualify.  HomeMakers and HomeCaring Periods were awarded to the person concerned. These can be used to improve a persons rate of pension. They cannot however be used to satisfy the requirement to have 520 full rate contributions.  The enhanced State pension provision for people who have been caring for incapacitated dependents for 20 years or more was introduced from 1 January 2024. In order for Long-Term Carers contributions to be reckonable for state pension, at least 1040 weeks (20 years) are required. The person concerned was awarded four years.  I hope this clarifies the position for the Deputy. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Social",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_158",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_158",
          "showAs": "State Pensions",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_158.xml"
            }
          }
        },
        "showAs": " 132. Deputy John McGuinness asked the Minister for Social Protection the status of an application for the State pension (contributory) in the name of a person (details supplied); if their recent application under the homemaker's scheme makes a difference to their qualification for a State pension (contributory). [60314/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_132"
      }
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "showAs": "John McGuinness",
          "memberCode": "John-McGuinness.D.1997-06-26"
        },
        "questionNumber": 133,
        "questionType": "written",
        "answerText": " Minister for Social Protection  Carer's Allowance (CA) is a means-tested social assistance payment made to a person who is habitually resident in the State and who is providing full-time care and attention to a child or an adult who has such a disability that as a result they require that level of care.  A claim for CA was awarded to the person concerned from 18 September 2025. On foot of a review request to back-date the start date of the claim, the person's payment has now been backdated for a number of weeks where the carer was not engaged in employment for more than the 18.5 hours a week allowed by the legislation.  Arrears due will issue to the nominated bank account of the person concerned shortly.  The person concerned was notified of this decision in writing on 31 October 2025 and of their right of review and appeal.  CA recipients automatically qualify for the Carer's Support Grant (CSG) on the first Thursday in June each year where they have an entitlement to CA. As the person concerned was not entitled to the payment at that time due to being in employment for more than 18.5 hours per week, there is no entitlement to the 2025 CSG grant.  I hope this clarifies the position for the Deputy. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Social",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_159",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_159",
          "showAs": "Social Welfare Payments",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_159.xml"
            }
          }
        },
        "showAs": " 133. Deputy John McGuinness asked the Minister for Social Protection if the approval for carers allowance for a person (details supplied) will be back-dated further; the rationale behind the decision; and if the applicant is entitled to the respite grant. [60317/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_133"
      }
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26",
          "showAs": "John McGuinness",
          "memberCode": "John-McGuinness.D.1997-06-26"
        },
        "questionNumber": 187,
        "questionType": "written",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Health",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_212",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_212",
          "showAs": "Disability Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_212.xml"
            }
          }
        },
        "showAs": " 187. Deputy John McGuinness asked the Minister for Health if she will confirm the supports available such as a public health nurse or OT at primary care or community level in Kilkenny dedicated to people with mild intellectual disabilities; and the services available and if there is a waiting list. [60340/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_187"
      }
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Transport",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 429. Deputy John McGuinness asked the Minister for Transport if he will address the issue whereby people with a travel pass have to pay private bus operators €3.00 each time they book a seat on a bus; if he will respond to correspondence highlighting the issue (details supplied). [60028/25] ",
        "by": {
          "memberCode": "John-McGuinness.D.1997-06-26",
          "showAs": "John McGuinness",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_429",
        "questionNumber": 429,
        "answerText": " Minister for Transport  As Minister for Transport, I am responsible for policy and overall funding in relation to public transport; however, I am not involved in day-to-day operational matters of public transport operators, including those related to the operation of commercial bus services, their fare structures, or the acceptance of free travel passes. Further, the National Transport Authority (NTA) has no direct involvement with the free travel scheme on commercial services either.  I would like to reassure the Deputy that non-refundable deposits are not required across Public Service Obligation (PSO) funded bus services. While all PSO transport services, including Local Link services, are part of the Free Travel Scheme (FTS), some commercial bus operators are also part of the Scheme . Those private bus companies that have opted into the FTS are reimbursed directly by the Department of Social Protection for carrying Free Travel passengers.  In relation to rail services, there is no requirement for FTS passengers to book train journeys online in order to use their pass. An allocation of bookings on all Intercity services can be reserved online without a fee for free travel pass/existing valid ticket holders. When this allocation is fully booked, all remaining seats can be reserved by free travel pass/existing valid ticket holders for €2.50 per journey.  I am aware that a number of the commercial bus operators which participate in the FTS require such booking deposits in order for passengers to reserve seats on their services. However, these private companies operate on a commercial basis and as such decisions regarding fares and booking fees are an operational matter for the companies themselves. ",
        "debateSection": {
          "showAs": "Public Transport",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_399",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_399.xml"
            }
          },
          "debateSectionId": "dbsect_399"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1133. Deputy John McGuinness asked the Minister for Housing, Local Government and Heritage if he will provide an update on the inclusion of Carlow and Kilkenny in the defective block scheme; the known number of households affected in each county; if the lab results for each house tested by the UK company will be released on request to the individual households; if he is aware that the lack of decisions by his Department is causing huge difficulties for individuals who want to take legal action to hold suppliers of defective materials to account; and if he will make a statement on the matter. [60053/25] ",
        "by": {
          "memberCode": "John-McGuinness.D.1997-06-26",
          "showAs": "John McGuinness",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1133",
        "questionNumber": 1133,
        "answerText": " Minister for Housing, Local Government and Heritage  The Remediation of Dwellings Damaged by the Use of Defective Concrete Blocks Act 2022 (the Act) was commenced on 22 June 2023 which contains the enhanced grant scheme and adopted the related Regulations on 29 June 2023.  The scheme is now open to applications in five counties: Clare, Donegal, Limerick, Mayo and Sligo with comprehensive information of all aspects of the Scheme available on my Department’s website at the following link: www.gov.ie/en/service/8002e-enhanced-defective-concrete-blocks-grant-scheme/  When a local authority that is not designated under the Scheme determines through the established mechanisms that homes within their functional area have been damaged by defective concrete blocks, they can seek to have the scheme extended to include any such county or part of such county.  Section 5 of the Act contains details on this process. This statutory designation process can commence upon a request by a local authority or by myself, as Minister, to the Housing Agency. The Agency thereafter carries out technical testing of dwellings in a given local authority administrative area. As soon as practicable after the completion of any testing, the Housing Agency shall make a recommendation to me whether an order to designate the whole or part of a local authority's administrative area should or should not be made by the Government.  I understand that Carlow County Council, in accordance with Section 5(7) of the Act, submitted a request to the Housing Agency on 6 November 2023 for inclusion in the scheme. The Housing Agency appointed a Chartered Engineer from their existing framework panel to assist in their investigations and consultations. The investigations (including concrete block sampling and testing) and consultations, required under the Act, commenced in March 2024.  The Housing Agency confirmed to my Department that in late May 2025 they had received the concrete block test results from the properties sampled within the administrative area of Carlow County Council, and that they have commenced drafting a report on the results of their investigations and consultations, including their recommendation to myself as Minister.  It is the understanding of my Department that the Housing Agency envisage that they will be in a position to issue this report and recommendation very shortly.  In the case of Kilkenny, I understand that Kilkenny County Council, in accordance with Section 5(7) of the Act, submitted a request to the Housing Agency on 23 June 2025 for inclusion in the scheme. The Housing Agency appointed a Chartered Engineer from their existing framework panel to assist in their investigations and consultations. The investigations (including concrete block sampling and testing) and consultations, required under the Act, are scheduled to commence in mid-November 2025.  Once the Housing Agency has confirmed to my Department that its investigations and consultations have been completed, and I receive their report, I will consider the recommendations made.  It should be noted that the Housing Agency do not send my Department individual reports rather, as set out above, the Housing Agency prepare a report upon conclusion of its investigations for my consideration. ",
        "debateSection": {
          "showAs": "Defective Building Materials",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_981",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_981.xml"
            }
          },
          "debateSectionId": "dbsect_981"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Justice",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1318. Deputy John McGuinness asked the Minister for Justice, Home Affairs and Migration further to Parliamentary Question No. 865 of 13 May 2025, the status of an application made by a person (details supplied) serving a sentence in the UK for permission to complete the sentence in Ireland; and the timeframe for the process to be completed. [59214/25] ",
        "by": {
          "memberCode": "John-McGuinness.D.1997-06-26",
          "showAs": "John McGuinness",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1318",
        "questionNumber": 1318,
        "answerText": " Minister for Justice, Home Affairs and Migration  As the Deputy will be aware, the Transfer of Sentenced Persons Acts 1995-2023 establishes the conditions and procedures for the transfer of custodial sentences between Non-EU Member States. Every effort is made to progress each case promptly and within the statutory timeframe. International transfers require the exchange of detailed information between countries and legal scrutiny on a case-by-case basis. There are several steps to the process.  I hope the Deputy will appreciate that I cannot comment on the detail of an individual case, but I can assure the Deputy that the matter is being progressed. ",
        "debateSection": {
          "showAs": "Irish Prisoners Abroad",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1133",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1133.xml"
            }
          },
          "debateSectionId": "dbsect_1133"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Justice",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1319. Deputy John McGuinness asked the Minister for Justice, Home Affairs and Migration the reasons for the delay in completing the transfer arrangements of a prisoner (details supplied); for an indicative timeframe for the transfer of the prisoner; and if he will expedite the transfer considering the applicants deteriorating health. [59215/25] ",
        "by": {
          "memberCode": "John-McGuinness.D.1997-06-26",
          "showAs": "John McGuinness",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1319",
        "questionNumber": 1319,
        "answerText": " Minister for Justice, Home Affairs and Migration  Applications such as this, which relate to a prisoner wishing to transfer from another EU member State to Ireland, are dealt with in accordance with the Criminal Justice (Mutual Recognition of Custodial Sentences) Act 2023, as amended.  I understand that this application is nearing the latter stages of the relevant statutory process.  This process is legally and procedurally complex, however I would like to reassure the Deputy that every effort is being made to progress this matter as quickly as possible. ",
        "debateSection": {
          "showAs": "Irish Prisoners Abroad",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1134",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1134.xml"
            }
          },
          "debateSectionId": "dbsect_1134"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1646. Deputy John McGuinness asked the Minister for Health the number of children that have been offered an outsourced pathway to surgery for scoliosis through CHI; the breakdown of the number relative to the hospitals used for this purpose; the number still waiting for surgery through this process; and if she will make a statement on the matter. [57862/25] ",
        "by": {
          "memberCode": "John-McGuinness.D.1997-06-26",
          "showAs": "John McGuinness",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-McGuinness.D.1997-06-26"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1646",
        "questionNumber": 1646,
        "answerText": " Minister for Health  As this is an operational matter, I have asked the Health Service Executive to respond to the deputy directly, as soon as possible. ",
        "debateSection": {
          "showAs": "Hospital Waiting Lists",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1414",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1414.xml"
            }
          },
          "debateSectionId": "dbsect_1414"
        }
      },
      "contextDate": "2025-11-04"
    }
  ]
}