{
  "head": {
    "counts": {
      "questionCount": 5786,
      "resultCount": 5786
    }
  },
  "results": [
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_5.xml"
            }
          },
          "debateSectionId": "dbsect_5",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_5",
          "showAs": "Covid-19 Pandemic"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_2",
        "to": {
          "roleType": null,
          "showAs": "Taoiseach",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 2,
        "showAs": " 2. Deputy Micheál Martin asked the Taoiseach his views on whether there will be scope to narrow the time between phases 4 and 5 of the Roadmap for Reopening Society and Business if all the five health indicators are positive. [10640/20] ",
        "answerText": " The Taoiseach  Thanks to the progress made by the Irish people in suppressing the virus, on Friday 5 June, the Government agreed to accelerate the Roadmap for Reopening Society and Business.  This means certain sectors and public amenities will be able to reopen earlier than previously planned. The reconfigured Roadmap will consist of four phases, instead of five, with Phase 3 beginning on 29 June and Phase 4 on 20 July. Work is underway to determine what can open in each phase.  However, maintaining a three week interval between phases is important for epidemiological reasons to accurately monitor any impacts the easing of restrictions may have on the behaviour of the virus. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_6.xml"
            }
          },
          "debateSectionId": "dbsect_6",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_6",
          "showAs": "Northern Ireland"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_3",
        "to": {
          "roleType": null,
          "showAs": "Taoiseach",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 3,
        "showAs": " 3. Deputy Micheál Martin asked the Taoiseach if he has spoken with the First Minister in Northern Ireland recently regarding Covid-19 or other related issues and-or mutual issues which directly impact both jurisdictions. [10642/20] ",
        "answerText": " The Taoiseach  I spoke with First Minister Arlene Foster and deputy First Minister Michelle O'Neill on Friday, 5 June, when I briefed them on the Government plans for the second phase of easing the Covid related restrictions from 8 June as set out in the roadmap.  I advised them of our plans to condense the five-phase roadmap into a four-phase plan, allowing us to move out of lockdown at a faster pace than previously planned, and our intention for the domestic tourism sector and some hospitality operators to resume from 29 June. I also informed them that our retail stores were to open from Monday, 8 June and a series of other measures, originally envisaged for later phases of the plan, were being given the green light from 8 June. They were also informed that further work will be carried out in the coming days and weeks to determine which actions will take place in each phase.  We also discussed ongoing North South co-operation on dealing with Covid and the Memorandum of Understanding agreed to underpin and strengthen North South co-operation on the public health response to the pandemic.  There is ongoing North South and East West engagement on Covid responses across government at both political and official level. We will continue to seek opportunities for common or similar approaches to managing Covid, where that would be beneficial. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_22.xml"
            }
          },
          "debateSectionId": "dbsect_22",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_22",
          "showAs": "Brexit Issues"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_22",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 22,
        "showAs": " 22. Deputy Micheál Martin asked the Tánaiste and Minister for Foreign Affairs and Trade if he has spoken with his other EU counterparts recently regarding Brexit. [10641/20] ",
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  The Taoiseach, my cabinet colleagues and I take every opportunity to engage with our EU partners to advance Ireland’s priorities in matters arising from the UK's withdrawal from the EU, including the EU-UK Future Partnership negotiations, and implementation of the Withdrawal Agreement, with the Protocol on Ireland/Northern Ireland.  My engagement with key interlocutors on Brexit has continued in recent months, including recent contacts with EU Chief Negotiator Michel Barnier, and with a range of EU Foreign Ministers.  I have also spoken, as appropriate, with UK counterparts, including Chancellor of the Duchy of Lancaster Michael Gove, Foreign Secretary Dominic Raab, and Secretary of State for Northern Ireland Brandon Lewis. This is in addition to the regular contact maintained between the Taoiseach, the Minister for Finance, and the Minister of State for European Affairs, with their counterparts across the EU and in the UK.  The EU-UK future relationship is on the agenda of the informal meeting of Europe Ministers on 16 June and it is also expected to be discussed at the meeting of Heads of State and Government on 19 June.  A High Level Conference between the EU and the UK on 15 June assessed progress made to date in the Future Partnership negotiations.  Officials from across Government are continuing their work to make sure that Ireland’s voice is heard at these negotiations in line with the EU’s negotiating mandate, and that work to implement the Protocol on Ireland / Northern Ireland is taken forward. In this regard, Ireland again participated in the second meeting of the Joint Committee, on 12 June, as part of the EU delegation. The Government will continue to engage closely and work with the Taskforce and the Commission, our EU partners, and stakeholders across this island on this vital issue. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_360.xml"
            }
          },
          "debateSectionId": "dbsect_360",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_360",
          "showAs": "Covid-19 Pandemic Supports"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_404",
        "to": {
          "roleType": null,
          "showAs": "Business",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 404,
        "showAs": " 404. Deputy Micheál Martin asked the Minister for Business, Enterprise and Innovation if she has concerns regarding the uptake by businesses of recently announced schemes. [10639/20] ",
        "answerText": " Minister for Business, Enterprise and Innovation  My Department has introduced a wide range of supports for businesses as the current crisis has evolved.  It is important to note that many businesses are not yet open or may be availing of forbearance measures from their banks. I am satisfied that micro and SME businesses across the economy are increasingly availing of the supports available as our economy and society reopen and I continue to keep all schemes under review.  I publish the data on the take-up of schemes on a weekly basis and the data is available at the following link to my Department's website:    https://dbei.gov.ie/en/Publications/Publication-files/Take-up-of-DBEI-COVID-19-Business-Supports.pdf      Details of the main schemes are set out as follows.  The Covid-19 Loan, available from Microfinance Ireland (MFI), was introduced as a support to microenterprises to help them access funding arising from the Covid-19 crisis. MFI has seen unprecedented levels of interest in this loan facility with loan approvals of €13,698,405 in the 12 weeks since the scheme commenced. This is over double the total value of loans approved in 2019 which was €6 million.  The Covid-19 Loan has supported over 500 Irish micro businesses and thousands of jobs throughout every region of Ireland.  MFI provides vital support to microenterprises by lending to business that cannot obtain loans from other commercial lenders.  It lends to business that do not meet the conventional risk criteria applied by commercial lenders and applies interest rate charges for its lending which are not reflective of its credit risk.  This funding has provided a life-line to microenterprises struggling to cope with the economic circumstances arising from the Covid-19 crisis and will be of great assistance as these businesses re-enter the market place.  These loans are available for eligible microenterprises responding to Covid-19-related difficulties, the negative impact of which must be a minimum of 15% of actual or projected income or profit.  Loans up to €50,000 are available with interest rates of between 4.5% and 5.5% with terms that include a six months interest free and repayment free moratorium.  The SBCI Covid-19 Working Capital Scheme [Covid-19 WCS] is offered by my Department in cooperation with the Department of Agriculture, Food and the Marine, and is supported by the European Investment Fund through its InnovFin SME Guarantee facility. The scheme is operated by the SBCI and offered through participating finance providers.  The scheme is open to eligible SMEs and small mid-caps (businesses of up to 499 employees) that have been negatively impacted by issues arising from the outbreak of Covid-19. Loans under the scheme range from €25,000 to €1.5m and are for periods of up to three years. Loans are offered at favourable terms, for example, the maximum interest rate under the scheme is 4% and loans of up to €500,000 are available unsecured. Uptake of the scheme to date has been positive and engagement with the participating finance providers indicates that more businesses are engaging with the application process as they seek approval for lending under the scheme.  Work is also underway on a significant expansion to the scheme to ensure that there is adequate financing available to businesses, as they seek to make the necessary adjustments to their operations to facilitate a return to trading as we progress through the phased reopening of the economy.  The Business Continuity Voucher scheme was launched on 26 March. This Voucher provided up to €2,500 in consultancy costs, to develop short and long-term strategies to respond to the initial pandemic and to plan for the eventual recovery and reopening of the economy. The scheme was a resounding success in terms of uptake, the product of it being an appropriate support for that point in time. The Local Enterprise Offices (LEOs) will continue to work with existing applicants and recipients of vouchers and their subsequent business continuity plans. The awarding of vouchers will naturally taper off in the coming weeks as the LEOs process the outstanding applications.  The Trading Online Voucher Scheme is funded by the Department of Communications Climate Action and Environment and delivered nationwide in partnership with my Department, Enterprise Ireland and the 31 LEOs. The Scheme offers skills training, mentoring and financial support of up to €2,500 to help small and micro-businesses to develop their e-commerce capability. New flexibilities to the Scheme were introduced in April including reducing the requirement for co-funding from 50% to 10% and allowing businesses to apply for a second voucher of up to €2,500 where they have successfully utilised their first one.  On the 8th of June the Government announced additional funding of €14.2m for the Scheme bringing the total funding allocation in 2020 to €19.8m. This additional funding will allow LEOs to approve additional vouchers to successful applicants. There has been a positive response to these changes and significant uptake of the Scheme.  Enterprise Ireland, on behalf of my Department has also launched a new suite of Covid-19 supports; these are:  Sustaining Enterprise Fund : This €180 million fund will provide support to eligible manufacturing and internationally traded services companies employing 10 or more employees who have been impacted by a 15% or more reduction in actual or  projected turnover or profit, and/or have a significant increase in costs as a result of the Covid-19 outbreak. The fund provides financial assistance in the form of repayable advances of up to a maximum of €800,000 per company.  This fund also provides a €25,000 to €50,000 short-term working capital injection to eligible smaller companies to support business continuity and strengthen their ability to return to growth and be trading strongly in three years time.  Covid-19 – HPSU Fund (SEF– HPSU): This fund is aimed at EI High Potential Start-Up companies which, due to the Covid-19 pandemic are facing delays to projected sales growth and whose  fundraising plans are significantly impacted or stalled. Under this fund, HPSUs can apply for co-investment of €50,000 per undertaking  in the form of equity or convertible debt instruments.  In addition to this fund Enterprise Ireland has launched the following supports:  Covid-19 Business Financial Planning Grant: A €5,000 grant for eligible companies to work with third party consultants to prepare a detailed financial plan with forecasts and assumptions. 337 applications have been received for Covid-19 Business Financial Planning Grant.   Lean Business Continuity Voucher: A €2,500 voucher for eligible companies to access training or advisory services support related to the continued operation of their business during the current pandemic. 156 applications have been received for the LEAN Business Continuity Voucher.   Covid-19 Online Retail Scheme is a grant for retail companies with greater than 10 employees to develop a more competitive online offer.  This competitive call has a budget of €2 million. Successful applicants will receive funding support of up to 80% of project costs, with a maximum grant of €40,000.  Most recently, the Government launched the Restart Grant which provides direct grant aid to micro and small businesses. The grant of between €2,000 and €10,000 provides a contribution towards the cost of re-opening or keeping a business operational and re-connecting with employees and customers.  It is administered through the local authorities.  I will continue to keep the take up of supports under review and we will adjust and develop new measures as the economy continues to reopen. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_85.xml"
            }
          },
          "debateSectionId": "dbsect_85",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_85",
          "showAs": "Wage Subsidy Scheme"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_100",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 100,
        "showAs": " 100. Deputy Micheál Martin asked the Minister for Finance if he will address a matter raised in correspondence (details supplied) in relation to the temporary wage subsidy scheme; and if he will make a statement on the matter. [9330/20] ",
        "answerText": " Minister for Finance  The Temporary Wage Subsidy Scheme (TWSS) is provided for in section 28 of the recently enacted Emergency Measures in the Public Interest (Covid-19) Act 2020.  Of necessity, the underlying legislation and the scheme itself were developed quickly, having regard to the overarching, urgent Government objective of getting much needed financial assistance to employers and employees, where businesses have been seriously affected by the pandemic and the necessary restrictions introduced to fight the spread of the Covid-19 virus.  It must be accepted that the scheme cannot be adapted to meet the individual circumstances of employers or employees.  In the context of the need for immediate implementation of the TWSS, the scheme necessarily had to build on data returned to Revenue through its real-time PAYE system.  The key conditions of the scheme, as prescribed in the underlying law, are that –  - the business is suffering significant negative economic impact due to the pandemic,  - the employees were on the payroll at 29 February 2020, and  - the employer had fulfilled its PAYE reporting obligations for February 2020 before, in general, 15 March 2020, but extended recently to 1 April 2020.  The latter two conditions were particularly designed with a view to preventing abuse of the scheme.  The wage subsidies provided by the TWSS are designed to be passed on by employers to their employees through payroll. The rates of wage subsidy payable are based, largely, on the emoluments of employees for January and February 2020 as reported to Revenue in employers’ payrolls.  The rates are determined in accordance with the underlying law and the determinations of subsidy amounts for particular classes of employees made by me, as Minister for Finance, on 16 April 2020.  Those determinations provide as follows:  For employees with previous net emoluments of less than €586 per week, the wage subsidy shall not exceed €410 per week in accordance with the following principles:  - an 85% subsidy is payable in the case of employees whose average net weekly emoluments does not exceed €412;  - a flat-rate subsidy of up to €350 is payable in the case of employees whose average net weekly emoluments is more than €412 but not more than €500.  - a 70% subsidy is payable in the case of employees whose average net week emoluments is more than €500 but not more than €586, with a maximum cap of €410 applying.  In addition, where an employer wishes to pay a greater level of top-up of wages, in respect of employees with net emoluments of less than €412 per week, in order to bring the employee’s pay to €350 per week, then tapering will not be applied to the subsidy.  For employees with previous net emoluments in excess of €586 per week, including those whose previous net emoluments exceeded €960 per week, a tiered approach will apply. The maximum subsidy payable is €350 per week, with a tiered approach operating to take into account both the amount paid by the employer and the level of reduction in pay borne by the employee. In essence:  - a subsidy of €350 is payable to employees with average net weekly emoluments greater than €586, where the employer pays sufficient gross salary which equates to an amount up to 60% of the employee’s net weekly earnings.  - a subsidy of €205 is payable to employees with average net weekly emoluments greater than €586, where the employer pays sufficient gross salary which equates to an amount that is more than 60%, but not more than 80%, of the employee’s net weekly emoluments.  - no subsidy is payable to employees with average net weekly emoluments greater than €586, where the employer pays sufficient gross salary which equates to an amount that is more than 80% of the employee’s net weekly earnings.  Finally, for employees whose current net emoluments exceeds €960 per week, no subsidy applies regardless of the level of any reduction in pay.   To calculate the level of subsidy payable, current pay is compared with previous average net weekly pay for January/February.  This subsidy will be tapered to ensure that the total weekly income consisting of the employer contribution plus the wage subsidy amount does not exceed €960 per week in any individual case.  The Deputy has raised the specific issue of taking into account income from occupational pensions when calculating the amounts of wage subsidy.  I am advised by Revenue that the TWSS provides that wage subsidy amounts and limits in relation to individual employees are calculated by reference to the total emoluments of the employee concerned. For this purpose, there is no distinction made between the emoluments from an occupational pension and the emoluments from an employment.  Where an individual has two or more sources of emoluments, be they employments or an employment and an occupational pension, all sources are looked at when considering the amounts of wage subsidy available in relation to the employee.  It would be inequitable to exclude occupational pension amounts, which can be significant in many cases, when calculating wage subsidy amounts available in relation to individual employees.  I have also been advised by Revenue that during the transitional phase of the TWSS, up to 3 May 2020, if an employee had multiple employments, each employer individually operated the scheme based on 70% of each employee’s average net weekly pay with that employer.  During the operational phase of the TWSS from 4 May 2020, earnings from all active employments and occupational pension sources are combined.  Thus, the average net weekly pay from each such source is aggregated to calculate the employee’s overall average net weekly pay. This is then used to calculate an employee’s maximum wage subsidy and the wage subsidy entitlement is split across each of the emolument sources based on the percentage of the employee’s average net weekly pay from each such source, with each employer provided with an employer “maximum weekly wage subsidy” and the “maximum weekly employer pay before tapering” to apply to the employee’s payroll.  This personalised information will ensure that the employee’s overall position is taken into consideration when calculating the employee’s subsidy entitlements. This is to allow the concentration of resources to protect incomes, in a proportionate way having regard to available resources and employer contributions by way of wage top ups.  It follows that if one of the sources of the employee’s emoluments, such as, in this instance, the occupational pension provider, is not operating the TWSS, the employee will only get the benefit of the wage subsidy in relation to the employment that is operating the TWSS.  In the specific case that is the subject of this question, the employee’s total average net weekly pay across his employment and occupational pension is greater than €586. Consequently,  the maximum wage subsidy the employee is entitled to would be €350 or €205, depending on the amount of wage top up provided by the employer, and not as has been suggested by the employee concerned a subsidy amount based on 85% of his average net weekly pay from his employment on the grounds that that weekly pay from that employment is €586 or less.  In relation to the administrative process for availing of the TWSS, Revenue advises me that it has repeatedly advised employers that for a claim for the subsidy in relation to an employee to be identified and processed correctly, the employer must use the PRSI rate of J9 for that employee in its payroll submission to Revenue.  Where a payroll submission is made to Revenue with a J9 PRSI class, it is extremely important to ensure that the payroll submission is not subsequently deleted or amended.  As Revenue’s systems were developed quickly to cater for the TWSS, attempts to delete or amend previous refund-related payroll submissions are necessarily flagged for attention by Revenue and may cause further difficulties for the employer and disrupt the refund process.  Finally, where an employer wishes to engage with Revenue on general issues relating to the scheme, the employer should contact Revenue’s National Employer Helpdesk via the myEnquiries system, providing details of the query and relevant contact information.  I have been assured by Revenue that in the case that is the subject of this question the employer concerned received timely communication in relation to each query raised. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_455.xml"
            }
          },
          "debateSectionId": "dbsect_455",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_455",
          "showAs": "Hospital Facilities"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_535",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 535,
        "showAs": " 535. Deputy Micheál Martin asked the Minister for Health his views on whether it is appropriate for delivery drivers to enter or pass through isolation wards in order to deliver materials to hospitals during the Covid-19 pandemic. [8416/20] ",
        "answerText": " Minister for Health  As this is an operational matter I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2020-05-27",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/mul@/dbsect_713.xml"
            }
          },
          "debateSectionId": "dbsect_713",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/dbsect_713",
          "showAs": "Covid-19 Pandemic"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-27/pq_793",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 793,
        "showAs": " 793. Deputy Micheál Martin asked the Minister for Transport, Tourism and Sport if specific guidelines have been circulated to each sporting organisation on the communication of public health information to their members and players with regard to clubs reopening and continued restrictions on members from outside a 5km radius and cocooning members. [7589/20] ",
        "answerText": " Minister for Transport, Tourism and Sport (Shane Ross)  I propose to take Questions Nos. 793 and 794 together.  I have established an Expert Group on Return to Sport, which includes medical expertise, for the purposes of assisting the sporting community in Ireland, in particular the National Governing Bodies of sport (NGBs), to make a safe, phased return to sport in accordance with the Roadmap for Reopening Society and Business.  The sporting bodies have sought from my Department and Sport Ireland guidance to assist them in their preparation of protocols for returning to train and returning to play. The Expert Group will provide general guidance to the NGBs on issues common to many sports such as dressing room and equipment hygiene, hand hygiene and other matters, informed by public heath advice and international best practice. I can also confirm that, with the support of the Expert Group, my Department would, provided the Expert Group is satisfied, be able to indicate to the NGBs that their return to sport protocols appear compliant with the Roadmap and public health advice.  To date, in excess of 40 separate protocols have been presented for consideration. The Expert Group will assess these on a phase-by-phase basis, re-evaluating protocols as and when the public health guidance changes.  The Expert Group held its first meeting last week and is to hold its second this week. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-27",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2020-05-27",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/mul@/dbsect_713.xml"
            }
          },
          "debateSectionId": "dbsect_713",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/dbsect_713",
          "showAs": "Covid-19 Pandemic"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-27/pq_794",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 794,
        "showAs": " 794. Deputy Micheál Martin asked the Minister for Transport, Tourism and Sport if guidance has been issued to sporting clubs and organisations on the way in which to implement public health guidelines within such clubs and organisations. [7590/20] ",
        "answerText": " Minister for Transport, Tourism and Sport (Shane Ross)  I propose to take Questions Nos. 793 and 794 together.  I have established an Expert Group on Return to Sport, which includes medical expertise, for the purposes of assisting the sporting community in Ireland, in particular the National Governing Bodies of sport (NGBs), to make a safe, phased return to sport in accordance with the Roadmap for Reopening Society and Business.  The sporting bodies have sought from my Department and Sport Ireland guidance to assist them in their preparation of protocols for returning to train and returning to play. The Expert Group will provide general guidance to the NGBs on issues common to many sports such as dressing room and equipment hygiene, hand hygiene and other matters, informed by public heath advice and international best practice. I can also confirm that, with the support of the Expert Group, my Department would, provided the Expert Group is satisfied, be able to indicate to the NGBs that their return to sport protocols appear compliant with the Roadmap and public health advice.  To date, in excess of 40 separate protocols have been presented for consideration. The Expert Group will assess these on a phase-by-phase basis, re-evaluating protocols as and when the public health guidance changes.  The Expert Group held its first meeting last week and is to hold its second this week. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-27",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2020-05-27",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/mul@/dbsect_714.xml"
            }
          },
          "debateSectionId": "dbsect_714",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/dbsect_714",
          "showAs": "Covid-19 Pandemic"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-27/pq_795",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 795,
        "showAs": " 795. Deputy Micheál Martin asked the Minister for Transport, Tourism and Sport if issues raised in correspondence (details supplied) will be given consideration; and if he will make a statement on the matter. [7591/20] ",
        "answerText": " Minister for Transport, Tourism and Sport (Shane Ross)  The Government’s Roadmap for Reopening Society and Business is based on public health advice and compliance with the requirements of each of its five phases by all concerned is essential to ensure continued progress against the COVID-19 pandemic.  Phase one of the Roadmap clearly provides that while it is possible to participate in a range of sporting activities in groups of no more than four people, this must be within 5km of the households of those involved. The guidance also states explicitly that social distancing should be maintained at all times. It is also important to highlight that the public health advice for those who are cocooning is to continue to stay at home, except for brief outdoor exercise within 5km of their home.  It has been brought to my attention that, while the overwhelming majority of people are fully respecting the public health guidelines, there have been some difficulties in relation to adherence to the 5km travel restriction by people engaging in sporting activity during Phase One. This situation is both regrettable and concerning. Sport Ireland has been in communication with the sporting organisations concerned to voice this concern and to reinforce the importance of the memberships of all sporting organisations respecting the Roadmap and complying with public health regulations at all times. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-27",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2020-05-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/mul@/dbsect_11.xml"
            }
          },
          "debateSectionId": "dbsect_11",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/dbsect_11",
          "showAs": "European Council Meetings"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-20/pq_3",
        "to": {
          "roleType": null,
          "showAs": "Taoiseach",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 3,
        "showAs": " 3. Deputy Micheál Martin asked the Taoiseach if he will report on the latest EU Council meeting and the issues that were discussed. [5550/20] ",
        "answerText": " The Taoiseach  I propose to take Questions Nos. 3 and 4 together.  On 23 April, I joined fellow members of the European Council by video conference to discuss management of the coronavirus crisis and to chart a path towards economic and social recovery. This was the fourth such meeting, with previous videoconferences having taken place on 10, 17 and 26 March.  In our meetings, we focussed on five strategic areas of work in which it makes sense to cooperate together:  - Limiting the spread of the virus;  - ensuring the supply of medicines, equipment and goods;  - supporting research;  - tackling socio-economic consequences; and  - co-operating to bring citizens home from other countries.  At our most recent meeting on 23 April, we welcomed the Joint European Roadmap towards the lifting of COVID-19 containment measures published by the Commission on 15 April. It sets out a principles-based and science-led approach to re-opening our societies and our economies and aligns with the approach we have taken as a Government to date.  We also endorsed an economic package, agreed by the Eurogroup, worth up to €540 billion, and asked that it be operational in June. This comprises three safety nets, one for citizens, one for companies, and one for Member States.  Looking beyond the immediate crisis, we agreed on the need to put in place a Recovery Fund commensurate to the scale of the challenge we will face in rebuilding our economies and businesses, and getting our citizens back to work, as soon as circumstances permit.  On 8 May, I spoke with the Prime Minister of Sweden, Stefan Löfven. We discussed the current Covid-19 crisis and the importance of ongoing discussions at EU level on a recovery fund and on the MFF. We also discussed the current state of play in the EU-UK negotiations on the future partnership, we well as implementation of the Withdrawal Agreement, including the Irish Protocol.  PM Löfven took the opportunity to thank Ireland for assisting in the repatriation of Swedish citizens from India.  On 17 May, I spoke with President of the European Commission, Ursula von der Leyen. We discussed the detailed work that the Commission is undertaking in analysing the impact of the Covid19 crisis, sector-by-sector and region-by-region, and its work on a Recovery Fund. We also discussed how this Fund will interact with the Union’s budget for the next seven years, and the Commission’s plan to bring forward a new proposal in that regard in the near future. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-20",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2020-05-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/mul@/dbsect_11.xml"
            }
          },
          "debateSectionId": "dbsect_11",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/dbsect_11",
          "showAs": "European Council Meetings"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-20/pq_4",
        "to": {
          "roleType": null,
          "showAs": "Taoiseach",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 4,
        "showAs": " 4. Deputy Micheál Martin asked the Taoiseach if he has spoken directly to other EU leaders recently about the Covid-19 crisis and associated issues. [5551/20] ",
        "answerText": " The Taoiseach  I propose to take Questions Nos. 3 and 4 together.  On 23 April, I joined fellow members of the European Council by video conference to discuss management of the coronavirus crisis and to chart a path towards economic and social recovery. This was the fourth such meeting, with previous videoconferences having taken place on 10, 17 and 26 March.  In our meetings, we focussed on five strategic areas of work in which it makes sense to cooperate together:  - Limiting the spread of the virus;  - ensuring the supply of medicines, equipment and goods;  - supporting research;  - tackling socio-economic consequences; and  - co-operating to bring citizens home from other countries.  At our most recent meeting on 23 April, we welcomed the Joint European Roadmap towards the lifting of COVID-19 containment measures published by the Commission on 15 April. It sets out a principles-based and science-led approach to re-opening our societies and our economies and aligns with the approach we have taken as a Government to date.  We also endorsed an economic package, agreed by the Eurogroup, worth up to €540 billion, and asked that it be operational in June. This comprises three safety nets, one for citizens, one for companies, and one for Member States.  Looking beyond the immediate crisis, we agreed on the need to put in place a Recovery Fund commensurate to the scale of the challenge we will face in rebuilding our economies and businesses, and getting our citizens back to work, as soon as circumstances permit.  On 8 May, I spoke with the Prime Minister of Sweden, Stefan Löfven. We discussed the current Covid-19 crisis and the importance of ongoing discussions at EU level on a recovery fund and on the MFF. We also discussed the current state of play in the EU-UK negotiations on the future partnership, we well as implementation of the Withdrawal Agreement, including the Irish Protocol.  PM Löfven took the opportunity to thank Ireland for assisting in the repatriation of Swedish citizens from India.  On 17 May, I spoke with President of the European Commission, Ursula von der Leyen. We discussed the detailed work that the Commission is undertaking in analysing the impact of the Covid19 crisis, sector-by-sector and region-by-region, and its work on a Recovery Fund. We also discussed how this Fund will interact with the Union’s budget for the next seven years, and the Commission’s plan to bring forward a new proposal in that regard in the near future. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-20",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2020-05-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/mul@/dbsect_12.xml"
            }
          },
          "debateSectionId": "dbsect_12",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/dbsect_12",
          "showAs": "Taoiseach's Meetings and Engagements"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-20/pq_5",
        "to": {
          "roleType": null,
          "showAs": "Taoiseach",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 5,
        "showAs": " 5. Deputy Micheál Martin asked the Taoiseach if he has spoken with Prime Minister Johnson recently; and if so, the issues that were discussed. [5552/20] ",
        "answerText": " The Taoiseach  I spoke with the UK Prime Minister Boris Johnson on Friday 15 May. I offered my sympathies to him on his recent illness and hospitalisation, and I also congratulated him on the birth of his son.  We discussed the general Covid 19 situation and our respective experiences in seeking to contain the virus and manage its impacts. We shared information on our respective plans to start easing restrictions. We also talked about how Covid related travel restrictions might be adapted, and agreed that we both want the common travel area to be respected in our respective approaches.  We discussed Brexit and noted the state of play after last week’s round of negotiations. We also recalled our commitment to working together on strengthening North - South and East -West links after Brexit, and looked forward to being able to make progress in the period ahead.  I also spoke with First Minister Arlene Foster and deputy First Minister Michelle O'Neill on Friday, 15th May, when I informed them of the Government plans to start easing the Covid related restrictions from the 18th of May as set out in the Roadmap. We also discussed ongoing North South cooperation on dealing with Covid and the Memorandum of Understanding agreed to underpin and strengthen North South co-operation on the public health response to the pandemic .  I had previously spoken by phone with the UK Prime Minister Boris Johnson on 19 March. The main focus of our discussion on that occasion was the Covid 19 situation and the actions being taken by the two Governments, including in particular in relation to closing schools. We both expressed the wish that political parties in Northern Ireland work collaboratively in the recently restored Executive, and briefly discussed the British proposals on legacy issues. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-20",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2020-05-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/mul@/dbsect_13.xml"
            }
          },
          "debateSectionId": "dbsect_13",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/dbsect_13",
          "showAs": "Departmental Staff"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-20/pq_6",
        "to": {
          "roleType": null,
          "showAs": "Taoiseach",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 6,
        "showAs": " 6. Deputy Micheál Martin asked the Taoiseach the number of non-Civil Service staff recruited by his Department since 1 February 2020. [5553/20] ",
        "answerText": " The Taoiseach  In this period, one officer, at a grade equivalent to Administrative Officer, has been formally seconded to my Department from a Public Sector organisation. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-20",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2020-05-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/mul@/dbsect_464.xml"
            }
          },
          "debateSectionId": "dbsect_464",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/dbsect_464",
          "showAs": "Job Losses"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-20/pq_563",
        "to": {
          "roleType": null,
          "showAs": "Business",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 563,
        "showAs": " 563. Deputy Micheál Martin asked the Minister for Business, Enterprise and Innovation if a company (details supplied) has an obligation to attend the Labour Relations Commission and or Labour Court to discuss company redundancy for its staff; and if she will make a statement on the matter. [5798/20] ",
        "answerText": " Minister for Business, Enterprise and Innovation  My colleague the Minister for Employment Affairs and Social Protection has legislative and policy responsibility for the Redundancy Payments Act, 1967 and the Protection of Employees (Employers’ Insolvency) Act 1984.  These Acts confer certain rights and provide statutory payments to employees, subject to certain qualifying criteria in redundancy and insolvency situations.  In accordance with the Companies Act 2014, I have no statutory power to intervene in a court-supervised liquidation, that is subject to oversight of the High Court.  Under Part 11 of the Act a company is permitted to initiate a winding up where it has complied with the requirements of the Act.  The Workplace Relations Commission (WRC) and the Labour Court are independent statutory offices under the aegis of my Department. Negotiation of ex gratia payments in redundancy situations is an industrial relations matter. Ireland’s system of industrial relations is, essentially, voluntary in nature and responsibility for the resolution of industrial disputes between employers and workers, rests with the employer, the workers and their representatives.  Participation in hearings or discussions in the WRC dealing with industrial disputes is voluntary, whether collective or individual. Should both parties wish to avail of the service of the WRC, its services may be available on request.  Participation in hearings before the Labour Court under industrial relations legislation dealing with industrial disputes is also voluntary. In collective matters a Labour Court hearing would normally occur only following a joint request by the parties to the Court to investigate the matter following conciliation at the WRC.  In circumstances, where an individual makes a complaint to the WRC under certain legislation listed under Schedule 5 of the Workplace Relations Act 2015, such as the Redundancy Payments Acts 1967, the Adjudication Officer hearing the complaint may, by giving notice in that behalf in writing to any person, require such person to attend at such time and place as is specified in the notice to give evidence in relation to any matter referred to the Adjudication Officer under that section or to produce any documents in his possession, custody or control which relate to any such matter. The WRC Adjudication Officers decision may be appealed to the Labour Court in accordance with the Act. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-20",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2020-05-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/mul@/dbsect_1051.xml"
            }
          },
          "debateSectionId": "dbsect_1051",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/dbsect_1051",
          "showAs": "Company Closures"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-20/pq_1176",
        "to": {
          "roleType": null,
          "showAs": "Employment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1176,
        "showAs": " 1176. Deputy Micheál Martin asked the Minister for Employment Affairs and Social Protection if she met with the staff of a company (details supplied) to discuss the recent announcement regarding the closing of its outlets; if the staff have an entitlement to redundancy from their former employer; and if she will make a statement on the matter. [5797/20] ",
        "answerText": " Minister for Employment Affairs and Social Protection  I propose to take Questions Nos. 1176 and 1214 together.  Firstly, I would like to say that my thoughts are with all workers faced with the prospect of closure and job losses at this difficult time. With the exception of grocery outlets, the retail sector has been particularly affected by the measures we have had to take in response to the spread of Covid-19.  Having come through a number of turbulent years and an examinership process, it must be difficult for Debenhams workers to now face redundancy.  I applaud their efforts to ensure that they get the best outcome possible from the situation.  I wish to assure the affected workers that my Department is available through its Intreo service to assist them in whatever way we can in terms of income supports and job-seeking over the coming weeks and months.  I want to assure everybody that my Department is assisting the affected workers through its Intreo service to help them in whatever way we can in terms of income supports and job-seeking over the coming weeks and months.  Indeed over the past number of weeks officials from my Department have engaged with both officials from Mandate and with the Human Resource management team in Debenhams to ensure that all workers have received their due entitlements from my Department.  My officials are also available to assist these workers in the job search efforts over the period ahead and with advice on further education and training options that will help them to find work within their sector or in other sectors where work opportunities will become available as the economy improves over the period ahead.  Furthermore, the redundancy and insolvency section of my Department has already engaged with the liquidators appointed to Debenhams and is continuing to work with them to ensure that all claims in respect of employees are dealt with expeditiously.  Since the announcement of the liquidation of Debenhams there have been calls on the Government to intervene in or halt the liquidation of the company and to ensure that employees of Debenhams receive enhanced redundancy payments.  Employee representatives have also called for the 30 day mandatory consultation period to be extended.  The Minister for Business, Enterprise and Innovation has been clear that she, as the Minister responsible for company law legislation, has no statutory power to intervene in a court supervised liquidation.  A company is permitted to initiate a voluntary winding up where it has complied with requirements of the Companies Act 2014.  I have been asked by the Mandate Trade Union to utilise my powers in accordance with Section 15 of the Protection of Employment Act 1977.  In this regard, I sought urgent legal advice from the Attorney General in relation to those powers as they pertain to a court appointed liquidator.  I received those advices yesterday and they are unequivocal.  I am advised that I, as Minister, cannot exercise the powers in section 15 because those powers envisage engagement only with the employer.  As is clear from the statutory definition, a liquidator is not an employer for the purposes of this Act.  Therefore, there is no possibility of using the section 15 mechanism as suggested.  While we don’t have the power to ensure that Debenhams pay an enhanced redundancy package to its employees, an employer is obliged to pay the statutory redundancy entitlement as provided for in the Redundancy Payments Act 1967 and that is all that can be legally enforced against an employer.  As the company has been declared insolvent, the Department can provide a safety net for employees and the liquidator can submit claims for statutory redundancy and other wage related entitlements for payment from the Social Insurance Fund.  We will ensure that the statutory redundancy entitlement which is laid out in legislation will be paid. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-20",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2020-05-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/mul@/dbsect_1077.xml"
            }
          },
          "debateSectionId": "dbsect_1077",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/dbsect_1077",
          "showAs": "Company Closures"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-20/pq_1213",
        "to": {
          "roleType": null,
          "showAs": "Employment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1213,
        "showAs": " 1213. Deputy Micheál Martin asked the Minister for Employment Affairs and Social Protection if she has received notification from a company (details supplied) of a proposal of collective redundancy as is required under section 12 of the Protection of Employment Act 1977; and if she will make a statement on the matter. [5878/20] ",
        "answerText": " Minister for Employment Affairs and Social Protection  The Protection of Employment Act 1977 imposes a number of obligations on employers who are proposing collective redundancies, including an obligation under sections 9 and 10 to engage in an information and consultation process with employees’ representatives and to provide certain information relating to the proposed redundancies.  Section 11A of the Act provides that, where an employee believes the employer to be in breach of sections 9 or 10, they may pursue a complaint to the Workplace Relations Commission.  It is also an offence under section 11 of the Act where an employer fails to comply with sections 9 or 10.  There is an obligation under section 12 which makes it mandatory on employers proposing a collective redundancy to notify the Minister for Employment Affairs and Social Protection of the proposed collective redundancy.  An employer is prohibited from issuing the first notice of dismissal during the mandatory information and consultation period, the duration of which must be at least 30 days.  The Act also provides that at least 30 days must pass from the date on which the Minister has been notified of the collective redundancy before the first dismissal can take effect.  For the avoidance of doubt, the minimum 30 day information and consultation process and the minimum 30 day period from the date of notification may run concurrently, but do not have to.  My Department received official notification of the proposed liquidation of Debenhams on 14 April 2020.  Following a request from my officials to the liquidators for further information, I can confirm that the obligations to me as Minister under section 12 have now been fully complied with.  It is my understanding that the redundancies are envisaged to occur in or around 18 May 2020.  I trust this clarifies matters for the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-20",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2020-05-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/mul@/dbsect_1051.xml"
            }
          },
          "debateSectionId": "dbsect_1051",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-20/writtens/dbsect_1051",
          "showAs": "Company Closures"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-20/pq_1214",
        "to": {
          "roleType": null,
          "showAs": "Employment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1214,
        "showAs": " 1214. Deputy Micheál Martin asked the Minister for Employment Affairs and Social Protection if she has engaged with representatives of the employees of a company (details supplied) to ensure that the company is complying with all legal requirements in the treatment of its employees; and if she will make a statement on the matter. [5879/20] ",
        "answerText": " Minister for Employment Affairs and Social Protection  I propose to take Questions Nos. 1176 and 1214 together.  Firstly, I would like to say that my thoughts are with all workers faced with the prospect of closure and job losses at this difficult time. With the exception of grocery outlets, the retail sector has been particularly affected by the measures we have had to take in response to the spread of Covid-19.  Having come through a number of turbulent years and an examinership process, it must be difficult for Debenhams workers to now face redundancy.  I applaud their efforts to ensure that they get the best outcome possible from the situation.  I wish to assure the affected workers that my Department is available through its Intreo service to assist them in whatever way we can in terms of income supports and job-seeking over the coming weeks and months.  I want to assure everybody that my Department is assisting the affected workers through its Intreo service to help them in whatever way we can in terms of income supports and job-seeking over the coming weeks and months.  Indeed over the past number of weeks officials from my Department have engaged with both officials from Mandate and with the Human Resource management team in Debenhams to ensure that all workers have received their due entitlements from my Department.  My officials are also available to assist these workers in the job search efforts over the period ahead and with advice on further education and training options that will help them to find work within their sector or in other sectors where work opportunities will become available as the economy improves over the period ahead.  Furthermore, the redundancy and insolvency section of my Department has already engaged with the liquidators appointed to Debenhams and is continuing to work with them to ensure that all claims in respect of employees are dealt with expeditiously.  Since the announcement of the liquidation of Debenhams there have been calls on the Government to intervene in or halt the liquidation of the company and to ensure that employees of Debenhams receive enhanced redundancy payments.  Employee representatives have also called for the 30 day mandatory consultation period to be extended.  The Minister for Business, Enterprise and Innovation has been clear that she, as the Minister responsible for company law legislation, has no statutory power to intervene in a court supervised liquidation.  A company is permitted to initiate a voluntary winding up where it has complied with requirements of the Companies Act 2014.  I have been asked by the Mandate Trade Union to utilise my powers in accordance with Section 15 of the Protection of Employment Act 1977.  In this regard, I sought urgent legal advice from the Attorney General in relation to those powers as they pertain to a court appointed liquidator.  I received those advices yesterday and they are unequivocal.  I am advised that I, as Minister, cannot exercise the powers in section 15 because those powers envisage engagement only with the employer.  As is clear from the statutory definition, a liquidator is not an employer for the purposes of this Act.  Therefore, there is no possibility of using the section 15 mechanism as suggested.  While we don’t have the power to ensure that Debenhams pay an enhanced redundancy package to its employees, an employer is obliged to pay the statutory redundancy entitlement as provided for in the Redundancy Payments Act 1967 and that is all that can be legally enforced against an employer.  As the company has been declared insolvent, the Department can provide a safety net for employees and the liquidator can submit claims for statutory redundancy and other wage related entitlements for payment from the Social Insurance Fund.  We will ensure that the statutory redundancy entitlement which is laid out in legislation will be paid. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-20",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2020-05-13",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-13/writtens/mul@/dbsect_44.xml"
            }
          },
          "debateSectionId": "dbsect_44",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-13/writtens/dbsect_44",
          "showAs": "Cybersecurity Policy"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-13/pq_32",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 32,
        "showAs": " 32. Deputy Micheál Martin asked the Tánaiste and Minister for Foreign Affairs and Trade his views on a recent report in the media (details supplied) in relation to Russian interest in Ireland; if concerns have been raised in relation to same; and if he will make a statement on the matter. [4797/20] ",
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  I note the newspaper article referred to by the Deputy. It is an opinion piece, containing the personal views of the author. I do not propose to comment on the various elements that are raised.  The Government keeps all matters of national security under constant review and raises issues where necessary with the relevant State, including Russia. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-13",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2020-05-13",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-13/writtens/mul@/dbsect_730.xml"
            }
          },
          "debateSectionId": "dbsect_730",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-13/writtens/dbsect_730",
          "showAs": "Hospital Appointments Status"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-13/pq_742",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 742,
        "showAs": " 742. Deputy Micheál Martin asked the Minister for Health if his attention has been drawn to the case of a person (details supplied); the timeline for the scheduling of the surgery; and if he will make a statement on the matter. [5055/20] ",
        "answerText": " Minister for Health  Under the Health Act 2004, the Health Service Executive (HSE) is required to manage and deliver, or arrange to be delivered on its behalf, health and personal social services. Section 6 of the HSE Governance Act 2013 bars the Minister for Health from directing the HSE to provide a treatment or a personal service to any individual or to confer eligibility on any individual.  The National Waiting List Management Policy, a standardised approach to managing scheduled care treatment for in-patient, day case and planned procedures, since January 2014, has been developed to ensure that all administrative, managerial and clinical staff follow an agreed national minimum standard for the management and administration of waiting lists for scheduled care. This policy, which has been adopted by the HSE, sets out the processes that hospitals are to implement to manage waiting lists.  The HSE has advised my Department that, in line with the National Action Plan on COVID-19, there has been a significant reduction in all non-urgent elective scheduled care activity since March. This was to ensure that all appropriate resources, both physical and human, were made available for COVID-19 related activity. The HSE continues to adhere to the best clinical guidance and NPHET’s recommendations, which have now approved the careful re-commencement of scheduled care activity based on strict criteria to ensure the continued provision of safe, patient-centred care to non-Covid patients. Importantly, time-critical essential work continues throughout the system in line with the National Action Plan, the HSE Model of Care, and World Health Organisation recommendations.  In relation to the particular query raised, as this is a service matter, I have asked the HSE to respond to the Deputy directly. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-13",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2020-03-05",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-03-05/writtens/mul@/dbsect_297.xml"
            }
          },
          "debateSectionId": "dbsect_297",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-03-05/writtens/dbsect_297",
          "showAs": "Education Fees Waivers"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-03-05/pq_302",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 302,
        "showAs": " 302. Deputy Micheál Martin asked the Minister for Education and Skills the details under which a student may qualify for free fees having completed a level 8 course abroad for which the student did not receive support under the free fees initiative. [3557/20] ",
        "answerText": " Minister for Education and Skills  Under the terms of the Department's Free Fees Initiative, students who already hold a Level 8 qualification are not eligible for free fees.  Where students do not qualify for free fees, it is the institution who determines the level of fee payable by the student (either the EU level or the Non-EU) in line with its own criteria. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-03-05",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2020-03-05",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-03-05/writtens/mul@/dbsect_299.xml"
            }
          },
          "debateSectionId": "dbsect_299",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-03-05/writtens/dbsect_299",
          "showAs": "Third Level Fees"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-03-05/pq_303",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 303,
        "showAs": " 303. Deputy Micheál Martin asked the Minister for Education and Skills the supports available to students who do not qualify for the free fees initiative that experience financial hardship as a result of college fees; and if he will make a statement on the matter.  [3558/20] ",
        "answerText": " Minister for Education and Skills  Under the Free Fees Initiative, the Exchequer provides funding towards tuition fees in respect of eligible students who are pursuing full-time undergraduate courses of study. In order to qualify for funding under the Free Fees Initiative, students must be first-time undergraduates, hold inter alia EU/EEA/Swiss nationality in their own right, and have been ordinarily resident in an EU/EEA/Swiss state for at least three of the five years preceding their entry to an approved third level course. Funding under this Initiative is only available in respect of approved courses within the State.  Tax relief at the standard rate of tax may be claimed in respect of tuition fees paid for approved courses at approved colleges of higher education, including approved undergraduate and postgraduate courses in EU Member States and in non-EU countries. Further information on this tax relief is available from the student’s local Tax Office or from the Revenue Commissioners website, www.revenue.ie .  Students in third-level institutions experiencing exceptional financial need can apply for support under the Student Assistance Fund. While students who need help with tuition fees or registration fees cannot be considered under the Student Assistance Fund, the Fund can assists students to meet other specified needs, in a sensitive and compassionate manner, who might otherwise be unable to continue their third level studies due to their financial circumstances. Information on the fund is available through the Access Office in the third level institution attended. This fund is administered on a confidential, discretionary basis. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-03-05",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2019-12-18",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-18/writtens/mul@/dbsect_80.xml"
            }
          },
          "debateSectionId": "dbsect_80",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-18/writtens/dbsect_80",
          "showAs": "Departmental Websites"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-18/pq_66",
        "to": {
          "roleType": null,
          "showAs": "Taoiseach",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 66,
        "showAs": " 66. Deputy Micheál Martin asked the Taoiseach the way in which the website of his Department is managed and coordinated. [53349/19] ",
        "answerText": " The Taoiseach  My Department’s website www.gov.ie/taoiseach is managed by the staff of the Government Information Service. The Content published includes public information notices, consultation papers, information about my Department, and current speeches and press releases from the Government. The website also contains content informing citizens and different sectoral groups about Brexit. The MerrionStreet.ie website is populated with Press Releases and Speeches that issue from Government Departments. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-18",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2019-12-18",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-18/writtens/mul@/dbsect_81.xml"
            }
          },
          "debateSectionId": "dbsect_81",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-18/writtens/dbsect_81",
          "showAs": "Project Ireland 2040 Administration"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-18/pq_67",
        "to": {
          "roleType": null,
          "showAs": "Taoiseach",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 67,
        "showAs": " 67. Deputy Micheál Martin asked the Taoiseach the role of his officials in Project Ireland 2040. [53350/19] ",
        "answerText": " The Taoiseach  Project Ireland 2040 provides the overarching policy and planning framework for the social, economic and cultural development of our country. It includes a detailed capital investment plan for the period 2018 to 2027 - the €116bn National Development Plan 2018-2027, and the 20-year National Planning Framework 2040.  My Department is represented on the Project Ireland 2040 Delivery Board which oversees the implementation of Project Ireland 2040 and which is jointly chaired by the Secretaries General of the Department of Public Expenditure and Reform, and the Department of Housing, Planning and Local Government.  Officials from my Department also support and participate in the delivery of Project Ireland 2040 through the work of the Senior Officials Group on Infrastructure, the Project Ireland 2040 Co-Ordination Group and the Construction Sector Group.  In July this year, the Cabinet Committee on Infrastructure was established to cover issues relating to Infrastructure, Project Ireland 2040 and Rebuilding Ireland. This Cabinet Committee has met three times since its establishment, most recently on Monday 16 December. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-18",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2019-12-17",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-17/debate/mul@/dbsect_7.xml"
            }
          },
          "debateSectionId": "dbsect_7",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-17/debate/dbsect_7",
          "showAs": "Northern Ireland"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-17/pq_1",
        "to": {
          "roleType": null,
          "showAs": "Taoiseach",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1,
        "showAs": " 1. Deputy Micheál Martin asked the Taoiseach if he or his officials have met the Sinn Féin leaders in relation to the Northern Ireland Assembly and the upcoming deadline of 13 January 2020. [50122/19] ",
        "answerText": " The Taoiseach  I propose to take Questions Nos. 1 to 5, inclusive, together.  I spoke by telephone to Prime Minister Johnson on Friday, 13 December, the day following the election in the UK. I congratulated the Prime Minister on his election victory and we agreed that there is now a significant opportunity to restore the Good Friday Agreement institutions. We pledged to work with the parties in Northern Ireland to achieve this.  Talks aimed at restoring the Northern Ireland Executive started yesterday in Stormont. The Tánaiste and the Secretary of State for Northern Ireland will lead the talks with the five main political parties. We believe finding a final agreement on the issues outstanding in these talks can be done in a short period of time. A substantial talks process has already taken place during the period 2017 through 2019.  Notwithstanding this, a successful outcome in the weeks ahead will require political will and leadership by the parties.  The Government will continue to do everything in its power, in accordance with its responsibilities as a co-guarantor of the Good Friday Agreement, to secure the restoration and effective operation of all of its institutions.  I met Sinn Féin along with the Tánaiste on Tuesday, 26 November in Leinster House. Our discussions focused on the political situation in Northern Ireland and on a timeframe for post-election talks. I emphasised the Government's full commitment to all aspects of the Good Friday Agreement.  As I reported to the House on 27 November, I last met the DUP leader, Ms Arlene Foster, at the annual Remembrance Day ceremonies in Enniskillen on Sunday, 10 November, where we both participated in the laying of wreaths at the cenotaph and attended a remembrance service in St. Macartin's Cathedral.  I spoke to the SDLP leader, Mr. Colum Eastwood, by phone on 9 December 2019 and we discussed Brexit, the re-establishment of the Northern Ireland Executive and the influence Irish MPs could have in Westminster. I recently met Ms Claire Hanna, MP, of the SDLP in Government Buildings. In November, I wrote to the new UUP leader, Mr. Steve Aiken, to congratulate him on his appointment as party leader and to seek a meeting in the near future. I have not been in contact with the Alliance Party in recent weeks although I spoke by telephone to Ms Naomi Long, leader of that party, on 8 October. I congratulated Mr. Stephen Farry, MP, on his election a few days ago.  The Tánaiste is in regular contact with all the Northern party leaders and keeps me fully briefed on developments. There are also ongoing contacts at official and advisory levels. \n Deputy Micheál Martin  The results of the Westminster election last week have made it very likely that there is a movement towards the restoration of the democratic institutions established under the Good Friday Agreement. Immense damage was done in the past three years since the Assembly and Executive were collapsed due to a controversy over a heating scheme, in which it turns out both sides were implicated. A very good book, Burned , was written on this by Sam McBride. It is worth reading. Northern Ireland was essentially left without a voice at a very critical moment in its history and the history of the island given the threat of Brexit. It was unforgivable and unacceptable that the North was without a Government and Assembly.  In last week's election, the two largest parties lost over 12% of the vote and received a very clear message from the people that they want action on urgent issues such as health and schools and they want politicians to go back to work. From knocking on doors in Derry, that was a very clear message I received. When I was out canvassing with Mr. Colum Eastwood and my party colleagues were canvassing with Ms Claire Hanna, Michael Savage and others, there was a very clear message that the people wanted the politicians to go back to work. Because of this and many other reasons, such as the fact that the largest parties know another Assembly election would weaken their positions, there is every reason to believe there will actually be a deal before 13 January. The challenge is to make sure there is a sustainable deal. The fresh start agreement between the DUP and Sinn Féin in 2015 was at the time heralded as a breakthrough and an end to instability but it was nothing of the sort. There was a quick return to the sort of secret behaviour and party-first tactics exposed so damningly during the heating scheme inquiry. The most important way to end the cycle of inaction and breakdown is to end the system whereby everything is controlled in two private offices, with other parties and civil society excluded. Will the Taoiseach give an assurance that all parties will be meaningfully involved in the discussions and that any agreement will not be allowed to become yet another closed one between parties that do not represent nearly half of the electorate? Given the critical importance of significantly improving North–South co-operation in order to make the new special economic status of Northern Ireland work, does the Taoiseach agree it is essential that we table substantive proposals on that? \n Deputy Richard Boyd Barrett  Though it is not acknowledged often enough, there is another 32-county party in this country. It is called People Before Profit. We have an Assembly Member for West Belfast and a number of councillors in Belfast and Derry. Interestingly, in the recent elections our vote in West Belfast went up by 5%, rising from 10% to 16%. By any standard, this is a significant improvement for a party that organises not on green or orange lines but on the basis of socialist politics and on uniting Catholic and Protestant working-class people in their common interests. One of the key issues that came up when I was canvassing in West Belfast was the health service. Indeed, this issue dominated. It echoes the circumstances down here. Why are nurses in the North and other health workers on strike? It is because people are waiting up to two years for important operations and because they are put on trolleys in accident and emergency wards. Also, actions of the Tories, sanctioned or not challenged by the two major parties in the North, mean health workers in the National Health Service in the North earn less than their counterparts in the rest of the United Kingdom. Would it not be very reasonable to say the restoration of the Assembly should be conditional on increased investment to address the crisis in the National Health Service and on a clear commitment to pay parity between nurses and other health workers in the North and their counterparts in the rest of the United Kingdom? Pay parity is a major issue affecting people across sectarian lines in the North. \n Deputy Brendan Smith  My party leader, Deputy Micheál Martin, has covered very extensively and comprehensively the issues we want to see addressed in the current round of talks. I have just come from a meeting of the foreign affairs committee, which heard a presentation from the Glencree Centre for Peace and Reconciliation. As we all know, the centre has provided a safe space for people from different traditions to negotiate, have dialogue, talk about moving forward and get away from the era of the Troubles. It is very important that the legacy issues are given very detailed consideration. I hope progress can be achieved in dealing with them. I represent a constituency that unfortunately suffered death and destruction as a result of the Troubles north of the Border predominantly. There was the loss of life in a bombing in Belturbet. The Dublin–Monaghan bombings impacted my constituency also. The families who have been bereaved or lost loved ones and some of the victims who survived say they are all getting older. Some say they lost a sibling, parent, son or daughter but that they are no nearer to getting justice. Many say to me they want to see some justice before they go to their eternal reward. We have to achieve progress in dealing with the legacy issue. It is a very important ingredient in ensuring a peace process that deals with the issues of the past and removes the pain and anxiety to some extent. For those who have lost loved ones, there will never be closure just by getting the truth but it is an important issue to address. It needs to be dealt with comprehensively and not sidelined. \n Deputy Joan Burton  I congratulate everybody who has been elected to the new Westminster Parliament. In particular, I congratulate Mr. Colum Eastwood and Ms Claire Hanna of the SDLP and Mr. Stephen Farry of the Alliance Party. They will now represent three Irish voices in the new House of Commons. More than ever, it will be critical for all-island voices to be available in the very difficult negotiations that will be under way.  I have never agreed with Sinn Féin's abstentionist policy. Over and over, I have heard from many in the North that when it needed voices in the UK Parliament, the abstentionist policy meant a whole stream of Irish opinion was not available to be heard. This left the gate open for extreme groups such as the European Research Group to peddle the kind of vision of Brexit it has been offering. The electorate in Northern Ireland delivered a very loud message to all the parties there. I hope the talks will be successful. Pre-Christmas talks have a history of some success in the North. I hope this will be the case again this time. I believe the issues around language can be addressed in good faith among the parties, in addition to issues concerning the sectarian conflict that have yet to be resolved and the issue of legislation being blocked by any of the parties in Stormont. All of these issues are fixable to the credit and benefit of people in the North but also the whole island of Ireland. \n An Leas-Cheann Comhairle  I call Deputy Martin Kenny for a brief question. \n Deputy Martin Kenny  It is worthy to congratulate all those elected to parliament. People are pointing out that Sinn Féin did not get as many votes in this election as in previous elections. The reality, however, is that we stood back and did not run in three constituencies, South Belfast, East Belfast and North Down, because we had an agreement with other parties to have, insofar as possible, pro-Remain candidates elected. That had an impact but we are where we are. Sinn Féin still has seven MPs, as we had going into this election. It is still the prominent voice of Irish republicans and nationalists in the North and that should not be forgotten.  Support for the union has fallen and I do not say that out of a sense of triumph. This is the fifth election in a row where unionists have been a minority in the North. This points us to the kind of future Ireland we are going to have. We need to come back to that question once again and see how we can resolve these issues. The talks in the next week or two aimed at getting the Stormont Assembly back up and running are vital to that process. It is to be remembered that the red lines that people talk about have already been agreed. The St. Andrews Agreement, Stormont House Agreement and Good Friday Agreement will provide the answers to all of this if they are implemented. We are going into these talks primarily to try to hold the DUP, in particular, to task. It must implement the agreements to which it and both Governments have signed up. We understand that this is a difficult place for the DUP and we are prepared to work with it to try to find a solution. At the end of the day, both Governments also have a role to play and I know and expect that both Governments will play that role. However, as we move into the future, we need to look at what this election means. It means that support for the union is on the wane. Sinn Féin is an all-Ireland party and organisation. \n An Leas-Cheann Comhairle  I call the Taoiseach to respond. \n Deputy Martin Kenny  I point out to my Labour Party colleague, Deputy Burton, that the Dáil was set up as an abstentionist parliament. That is why we are here. \n The Taoiseach  I thank the Deputies again for their contributions. There is a real window of opportunity now to re-establish the Northern Ireland Assembly, the Executive and the North-South Ministerial Council between now and the deadline of 13 January. There have, however, been windows of opportunity in the past and unfortunately it was not possible to come to an agreement, so it is far from granted at this stage. The alternatives are not palatable. The Irish Government certainly could not support a return to direct rule, nor do I think that new elections for the Northern Ireland Assembly would provide a solution.  Deputy Micheál Martin asked that all five major parties be included meaningfully in the talks and I absolutely agree with that sentiment. Not only the two major parties, but all of the five major parties should be included. The strong performance of the SDLP and Alliance Party is noteworthy. I congratulate all 18 newly elected MPs in the House of Commons and I look forward to meeting and working with them throughout the course of 2020.  I am sure that any agreement that the parties come to, assisted by the two Governments, will want to deal with the burning issues that concern the people of Northern Ireland, whether it is the deepening health crisis, homelessness or the economy. Deputy Brendan Smith's points on legacy issues are also well made. Again, I am sure that the parties will want to do that and the Governments have a particular role to play when it comes to helping to bring a solution or resolution to some of those legacy issues.  As far as the Government is concerned, it will be our role to support the parties in Northern Ireland to come to an agreement, a programme for government, and also to work closely with the British Government to achieve our shared objective, that is, to restore power sharing in Northern Ireland, to restore structured North-South co-operation, as envisaged by the Good Friday Agreement, and also to strengthen, rebuild and renew the bilateral relationship between Britain and Ireland as the United Kingdom exits the European Union. ",
        "questionType": "oral",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-17",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2019-12-17",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-17/debate/mul@/dbsect_7.xml"
            }
          },
          "debateSectionId": "dbsect_7",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-17/debate/dbsect_7",
          "showAs": "Northern Ireland"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-17/pq_5",
        "to": {
          "roleType": null,
          "showAs": "Taoiseach",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 5,
        "showAs": " 5. Deputy Micheál Martin asked the Taoiseach if he has spoken to the leader of the DUP since 12 December 2019; and if so, the issues discussed. [53346/19] ",
        "answerText": " The Taoiseach  I propose to take Questions Nos. 1 to 5, inclusive, together.  I spoke by telephone to Prime Minister Johnson on Friday, 13 December, the day following the election in the UK. I congratulated the Prime Minister on his election victory and we agreed that there is now a significant opportunity to restore the Good Friday Agreement institutions. We pledged to work with the parties in Northern Ireland to achieve this.  Talks aimed at restoring the Northern Ireland Executive started yesterday in Stormont. The Tánaiste and the Secretary of State for Northern Ireland will lead the talks with the five main political parties. We believe finding a final agreement on the issues outstanding in these talks can be done in a short period of time. A substantial talks process has already taken place during the period 2017 through 2019.  Notwithstanding this, a successful outcome in the weeks ahead will require political will and leadership by the parties.  The Government will continue to do everything in its power, in accordance with its responsibilities as a co-guarantor of the Good Friday Agreement, to secure the restoration and effective operation of all of its institutions.  I met Sinn Féin along with the Tánaiste on Tuesday, 26 November in Leinster House. Our discussions focused on the political situation in Northern Ireland and on a timeframe for post-election talks. I emphasised the Government's full commitment to all aspects of the Good Friday Agreement.  As I reported to the House on 27 November, I last met the DUP leader, Ms Arlene Foster, at the annual Remembrance Day ceremonies in Enniskillen on Sunday, 10 November, where we both participated in the laying of wreaths at the cenotaph and attended a remembrance service in St. Macartin's Cathedral.  I spoke to the SDLP leader, Mr. Colum Eastwood, by phone on 9 December 2019 and we discussed Brexit, the re-establishment of the Northern Ireland Executive and the influence Irish MPs could have in Westminster. I recently met Ms Claire Hanna, MP, of the SDLP in Government Buildings. In November, I wrote to the new UUP leader, Mr. Steve Aiken, to congratulate him on his appointment as party leader and to seek a meeting in the near future. I have not been in contact with the Alliance Party in recent weeks although I spoke by telephone to Ms Naomi Long, leader of that party, on 8 October. I congratulated Mr. Stephen Farry, MP, on his election a few days ago.  The Tánaiste is in regular contact with all the Northern party leaders and keeps me fully briefed on developments. There are also ongoing contacts at official and advisory levels. \n Deputy Micheál Martin  The results of the Westminster election last week have made it very likely that there is a movement towards the restoration of the democratic institutions established under the Good Friday Agreement. Immense damage was done in the past three years since the Assembly and Executive were collapsed due to a controversy over a heating scheme, in which it turns out both sides were implicated. A very good book, Burned , was written on this by Sam McBride. It is worth reading. Northern Ireland was essentially left without a voice at a very critical moment in its history and the history of the island given the threat of Brexit. It was unforgivable and unacceptable that the North was without a Government and Assembly.  In last week's election, the two largest parties lost over 12% of the vote and received a very clear message from the people that they want action on urgent issues such as health and schools and they want politicians to go back to work. From knocking on doors in Derry, that was a very clear message I received. When I was out canvassing with Mr. Colum Eastwood and my party colleagues were canvassing with Ms Claire Hanna, Michael Savage and others, there was a very clear message that the people wanted the politicians to go back to work. Because of this and many other reasons, such as the fact that the largest parties know another Assembly election would weaken their positions, there is every reason to believe there will actually be a deal before 13 January. The challenge is to make sure there is a sustainable deal. The fresh start agreement between the DUP and Sinn Féin in 2015 was at the time heralded as a breakthrough and an end to instability but it was nothing of the sort. There was a quick return to the sort of secret behaviour and party-first tactics exposed so damningly during the heating scheme inquiry. The most important way to end the cycle of inaction and breakdown is to end the system whereby everything is controlled in two private offices, with other parties and civil society excluded. Will the Taoiseach give an assurance that all parties will be meaningfully involved in the discussions and that any agreement will not be allowed to become yet another closed one between parties that do not represent nearly half of the electorate? Given the critical importance of significantly improving North–South co-operation in order to make the new special economic status of Northern Ireland work, does the Taoiseach agree it is essential that we table substantive proposals on that? \n Deputy Richard Boyd Barrett  Though it is not acknowledged often enough, there is another 32-county party in this country. It is called People Before Profit. We have an Assembly Member for West Belfast and a number of councillors in Belfast and Derry. Interestingly, in the recent elections our vote in West Belfast went up by 5%, rising from 10% to 16%. By any standard, this is a significant improvement for a party that organises not on green or orange lines but on the basis of socialist politics and on uniting Catholic and Protestant working-class people in their common interests. One of the key issues that came up when I was canvassing in West Belfast was the health service. Indeed, this issue dominated. It echoes the circumstances down here. Why are nurses in the North and other health workers on strike? It is because people are waiting up to two years for important operations and because they are put on trolleys in accident and emergency wards. Also, actions of the Tories, sanctioned or not challenged by the two major parties in the North, mean health workers in the National Health Service in the North earn less than their counterparts in the rest of the United Kingdom. Would it not be very reasonable to say the restoration of the Assembly should be conditional on increased investment to address the crisis in the National Health Service and on a clear commitment to pay parity between nurses and other health workers in the North and their counterparts in the rest of the United Kingdom? Pay parity is a major issue affecting people across sectarian lines in the North. \n Deputy Brendan Smith  My party leader, Deputy Micheál Martin, has covered very extensively and comprehensively the issues we want to see addressed in the current round of talks. I have just come from a meeting of the foreign affairs committee, which heard a presentation from the Glencree Centre for Peace and Reconciliation. As we all know, the centre has provided a safe space for people from different traditions to negotiate, have dialogue, talk about moving forward and get away from the era of the Troubles. It is very important that the legacy issues are given very detailed consideration. I hope progress can be achieved in dealing with them. I represent a constituency that unfortunately suffered death and destruction as a result of the Troubles north of the Border predominantly. There was the loss of life in a bombing in Belturbet. The Dublin–Monaghan bombings impacted my constituency also. The families who have been bereaved or lost loved ones and some of the victims who survived say they are all getting older. Some say they lost a sibling, parent, son or daughter but that they are no nearer to getting justice. Many say to me they want to see some justice before they go to their eternal reward. We have to achieve progress in dealing with the legacy issue. It is a very important ingredient in ensuring a peace process that deals with the issues of the past and removes the pain and anxiety to some extent. For those who have lost loved ones, there will never be closure just by getting the truth but it is an important issue to address. It needs to be dealt with comprehensively and not sidelined. \n Deputy Joan Burton  I congratulate everybody who has been elected to the new Westminster Parliament. In particular, I congratulate Mr. Colum Eastwood and Ms Claire Hanna of the SDLP and Mr. Stephen Farry of the Alliance Party. They will now represent three Irish voices in the new House of Commons. More than ever, it will be critical for all-island voices to be available in the very difficult negotiations that will be under way.  I have never agreed with Sinn Féin's abstentionist policy. Over and over, I have heard from many in the North that when it needed voices in the UK Parliament, the abstentionist policy meant a whole stream of Irish opinion was not available to be heard. This left the gate open for extreme groups such as the European Research Group to peddle the kind of vision of Brexit it has been offering. The electorate in Northern Ireland delivered a very loud message to all the parties there. I hope the talks will be successful. Pre-Christmas talks have a history of some success in the North. I hope this will be the case again this time. I believe the issues around language can be addressed in good faith among the parties, in addition to issues concerning the sectarian conflict that have yet to be resolved and the issue of legislation being blocked by any of the parties in Stormont. All of these issues are fixable to the credit and benefit of people in the North but also the whole island of Ireland. \n An Leas-Cheann Comhairle  I call Deputy Martin Kenny for a brief question. \n Deputy Martin Kenny  It is worthy to congratulate all those elected to parliament. People are pointing out that Sinn Féin did not get as many votes in this election as in previous elections. The reality, however, is that we stood back and did not run in three constituencies, South Belfast, East Belfast and North Down, because we had an agreement with other parties to have, insofar as possible, pro-Remain candidates elected. That had an impact but we are where we are. Sinn Féin still has seven MPs, as we had going into this election. It is still the prominent voice of Irish republicans and nationalists in the North and that should not be forgotten.  Support for the union has fallen and I do not say that out of a sense of triumph. This is the fifth election in a row where unionists have been a minority in the North. This points us to the kind of future Ireland we are going to have. We need to come back to that question once again and see how we can resolve these issues. The talks in the next week or two aimed at getting the Stormont Assembly back up and running are vital to that process. It is to be remembered that the red lines that people talk about have already been agreed. The St. Andrews Agreement, Stormont House Agreement and Good Friday Agreement will provide the answers to all of this if they are implemented. We are going into these talks primarily to try to hold the DUP, in particular, to task. It must implement the agreements to which it and both Governments have signed up. We understand that this is a difficult place for the DUP and we are prepared to work with it to try to find a solution. At the end of the day, both Governments also have a role to play and I know and expect that both Governments will play that role. However, as we move into the future, we need to look at what this election means. It means that support for the union is on the wane. Sinn Féin is an all-Ireland party and organisation. \n An Leas-Cheann Comhairle  I call the Taoiseach to respond. \n Deputy Martin Kenny  I point out to my Labour Party colleague, Deputy Burton, that the Dáil was set up as an abstentionist parliament. That is why we are here. \n The Taoiseach  I thank the Deputies again for their contributions. There is a real window of opportunity now to re-establish the Northern Ireland Assembly, the Executive and the North-South Ministerial Council between now and the deadline of 13 January. There have, however, been windows of opportunity in the past and unfortunately it was not possible to come to an agreement, so it is far from granted at this stage. The alternatives are not palatable. The Irish Government certainly could not support a return to direct rule, nor do I think that new elections for the Northern Ireland Assembly would provide a solution.  Deputy Micheál Martin asked that all five major parties be included meaningfully in the talks and I absolutely agree with that sentiment. Not only the two major parties, but all of the five major parties should be included. The strong performance of the SDLP and Alliance Party is noteworthy. I congratulate all 18 newly elected MPs in the House of Commons and I look forward to meeting and working with them throughout the course of 2020.  I am sure that any agreement that the parties come to, assisted by the two Governments, will want to deal with the burning issues that concern the people of Northern Ireland, whether it is the deepening health crisis, homelessness or the economy. Deputy Brendan Smith's points on legacy issues are also well made. Again, I am sure that the parties will want to do that and the Governments have a particular role to play when it comes to helping to bring a solution or resolution to some of those legacy issues.  As far as the Government is concerned, it will be our role to support the parties in Northern Ireland to come to an agreement, a programme for government, and also to work closely with the British Government to achieve our shared objective, that is, to restore power sharing in Northern Ireland, to restore structured North-South co-operation, as envisaged by the Good Friday Agreement, and also to strengthen, rebuild and renew the bilateral relationship between Britain and Ireland as the United Kingdom exits the European Union. ",
        "questionType": "oral",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-17",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2019-12-17",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-17/debate/mul@/dbsect_9.xml"
            }
          },
          "debateSectionId": "dbsect_9",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-17/debate/dbsect_9",
          "showAs": "European Council Meetings"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-17/pq_12",
        "to": {
          "roleType": null,
          "showAs": "Taoiseach",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 12,
        "showAs": " 12. Deputy Micheál Martin asked the Taoiseach the officials who accompanied him during bilateral meetings with other Heads of Government in Zagreb. [50337/19] ",
        "answerText": " The Taoiseach  I propose to take Questions Nos. 9 to 22, inclusive, together.  I attended the European Council and euro summit in Brussels on Thursday, 12 December, and Friday, 13 December.  On Thursday, we discussed the idea of a conference on the future of Europe. We asked the incoming Croatian EU Presidency to work towards defining a Council position on the content, scope, composition and functioning of such a conference.  We had a substantial exchange on climate action and endorsed the objective of achieving a climate-neutral EU by 2050. One member state was unable to commit to implement this objective for itself at this stage and agreed to come back to the matter in June 2020.  Following a presentation of a negotiating box with figures by the Prime Minister of Finland, Sanna Marin, we discussed the main features of the multi-annual financial framework, MFF, the EU's budget for the period 2021-2027. We called on the President of the European Council, Charles Michel, to take the negotiations forward with a view to reaching agreement.  On external relations, we discussed EU-Africa relations, Russia and Turkey, as well as expressing solidarity with Albania following a recent earthquake there. We discussed the situation in the World Trade Organization.  At the euro summit, the new European Central Bank President, Christine Lagarde, gave an assessment of the current economic situation in Europe. We took stock of progress made by finance ministers on strengthening economic and monetary union.  Finally, we met in Article 50 format where we invited the Commission to draft a comprehensive mandate for the Council to consider for as close as possible a future relationship between the EU and the UK.  Since the European Council in October, I have met several of my colleagues. I met Charles Michel, the new President of the Council when he visited Dublin on 17 November in advance of formally taking up office.  I met the Prime Minister of Croatia, Mr. Plenkovi, in Zagreb on 21 November, ahead of the Croatian Presidency of the EU. We discussed the multi-annual financial framework, MFF, Brexit and bilateral relations. I was accompanied at that meeting by Ireland's ambassador to Croatia and by a small delegation of officials and advisers from my Department.  In the margins of last week's European Council, I launched a new climate action forum with the Prime Minister of Denmark, Mr. Frederiksen, and the Prime Minister of Sweden, Mr. Löfven, which will serve as a useful mechanism for our three countries to exchange best practice between us.  I also engaged informally with other counterparts, as I always do, to promote Irish interests, including with the Prime Minister of Finland, Sanna Marin, whom I congratulated on her recent election.  Tomorrow, I will have the opportunity to brief the House on the European Council in more detail.  On future travel engagements, I plan to attend the European Council meeting in Brussels on 26 and 27 March 2020. I expect to attend the World Economic Forum meeting in Davos in January, where the theme for the meeting is \"Stakeholders for a Cohesive and Sustainable World\". I also expect to travel to the United States in March for the annual St. Patrick's Day programme of events in Washington DC and Boston.  Other visits are being given consideration, but at present none is confirmed. \n An Leas-Cheann Comhairle  As the first question was in the name of Deputy Howlin, I call Deputy Burton. \n Deputy Joan Burton  Has the Taoiseach had an opportunity to consider the proposed new European green deal by the new President of the European Commission, Ursula von der Leyen? Is he in a position to enlighten Members as to the likely implications for Ireland of this deal?  The Taoiseach referred to the WTO. As we know, there is an ongoing dispute in the WTO with the United States of America relating to appointments within the WTO. Does he anticipate that this will create difficulties with the Brexit negotiations? If, unfortunately, there were to be any kind of hard Brexit, there could be a reversion to WTO rules. At the moment, given the state of the WTO rules, I do not see how that organisation would be in a position to manage that appropriately, particularly with the very serious interests affecting the island of Ireland that would be at stake. Have the Taoiseach and his fellow European Heads of State and Government had any opportunity to discuss the notion of a border down the Irish Sea or will that be a matter solely between the UK and the Republic of Ireland and Northern Ireland, assuming that the talks are successful and the Assembly recommences? \n Deputy Richard Boyd Barrett  As the Taoiseach mentioned, there was talk in Europe of radical action on climate. However, the signs are that it is just talk. The green new deal is good on aspiration but very short on detail. In any event it was not possible to get everybody to sign up to it because Poland has opted out. When I say it is good on aspiration, carbon neutrality by 2050 is not a bad aspiration, but if we were very serious about things, we would be aiming for carbon neutrality by 2030 and taking much more radical measures than are being proposed and we would be considerably more specific in those measures. Of course, the COP talks did not really achieve much at all.  Looking behind the rhetoric in Europe, the picture is not so good at all. The Mercosur deal exposes any commitment on the part of Europe to addressing the climate emergency, because at the same time as talking about an environmentally sustainable economic model, Europe is trying to negotiate a deal with the Bolsonaro regime to import large amounts of cheap beef from Latin America based on the cutting down of rainforests, the lungs of the earth. Similarly, in this country the Government talks about climate action but presses ahead with a liquefied natural gas terminal, fails in its targets on afforestation and refuses to ban the extraction of fossil fuels. Is it a case of lots of rhetoric but not so much action? \n Deputy Micheál Martin  In recent weeks I have been asking and raising with the Taoiseach the increasingly extreme stance of the Prime Minister of Israel, Mr. Netanyahu, and whether Ireland will advocate for any action against the threat of annexation of land on the West Bank. I think we can all agree that the Tánaiste's claim that his relationship with the US and with Mr. Netanyahu might lead to some form of breakthrough in the Middle East peace process has not turned out to be the case. More than a year ago the Tánaiste made forceful representations to me that we were on the cusp of a big breakthrough and that Ireland was playing a key role between the US and Israel. At the time I thought it was wildly optimistic and somewhat naïve, but nonetheless it was trying to get the Dáil to pull back from the motion on the trading issue with the settlements and Europe.  In response there have been general statements but no commitment to take any action or advocate any action. The Government has consistently refused to support the Dáil majority view of the need to act directly to stop illegal settlements from having access to selling their goods here and in other countries. The justification for this is the claim that it would infringe on European Union competence. This can be disputed, and we and others have received legal opinion using examples from the past. However, if what the Government says is true, then the obvious step to take is to seek European Union support for the policy.  So far there is zero evidence of the Taoiseach or Tánaiste advocating for a strengthened economic boycott of illegal settlements or taking any meaningful steps to oppose threatened annexations. The Government could show its good faith on this by writing to the Council and Commission Presidents, asking for a proposal to take stronger steps to block the illegal settlements from trading with the European Union. Will the Government take such action or is the Taoiseach saying he is happy that enough has been done on this issue to date? \n Deputy Martin Kenny  Regarding the Taoiseach's discussions in Europe on future funding, every individual and business, particularly businesses in the Border region is conscious of the impact of Brexit. Even if there is a deal or process that works out before the end of 2020, which everyone doubts very much, contingency plans will need to be put in place. It would be quite unfair to require the Irish Exchequer to fund that entirely. We are in this position as a result of Britain taking a unilateral decision to leave the European Union. It would be appropriate for the European Union to come to our assistance in respect of that. I am not just talking about moral assistance and support, but financial assistance to help the businesses that will undoubtedly be dramatically exposed.  In Spain, nine Catalan politicians have been imprisoned because of the holding of an independence referendum. What is likely to happen with that? It is clear that the political way forward is through dialogue and engagement, in which EU leaders should be playing a constructive role. Does the Taoiseach accept that withholding voting rights from citizens on self-determination and the subsequent imprisonment of political leaders in this manner is totally unacceptable and flies in the face of the democratic principles of the European Union? A similar situation could soon arise very close to us in Scotland with the Parliament in Westminster refusing to allow a referendum on Scottish independence in any circumstances. If the Scottish people decided to organise it themselves, a similar scenario could unfold in our close Celtic neighbour. It would be essential that we would be prepared to stand up to that. \n Deputy Paul Murphy  Will the Taoiseach and his Government make a clear statement of condemnation about the systematic human rights abuses in Bahrain? More than 5,000 people are currently imprisoned on political charges, with many of them subjected to torture, including sexual abuse. I will give a few examples. Nabeel Rajab was incarcerated for posting so-called false tweets criticising Saudi Arabia's war in Yemen and the torture in Bahrain's Jau Prison.  Hajer Mansoor Hassan was, incredibly, imprisoned based on the human rights activities of her son-in-law. She has been spat on, verbally abused and subject to psychological torture as part of her arrest. Part of the \"Bahrain Thirteen\", who are human rights activists, includes a doctor who suffers from paralysis and was forced to stand on one leg while he signed his supposed confession. There is a consistent pattern of mass trials, where the very idea of justice is a joke. More than 500 people have been convicted in a process of five mass trials in the past two years. There is no freedom of expression and one can be convicted of promoting terrorism simply for liking a tweet that is critical of the Government or the ruling family. Will the Irish Government speak out clearly against this in the context of the trade mission attended by the Minister in November? It was a major trade mission to the Middle East that included Bahrain. When asked by Deputy Crowe if concerns had been raised about human rights, the Minister for Foreign Affairs and Trade, Deputy Simon Coveney, said that it was not possible to raise our concerns about the human rights situation directly on that occasion. This begs a very serious question as to whether human rights are being put into second place behind trade and profits. \n The Taoiseach  I am very supportive of the European green deal. I am encouraged that President von der Leyen and the new Commission have decided to take a lead on this. When Ms von der Leyen was nominated by the European Council for Commission president she said she would do so and the President has already shown her sincerity in that regard. The objective is to transform Europe into the first climate neutral continent by 2050. The approach, and the way the President and the Commission have framed it, is a very good one. It is less in the vein of a climate apocalypse and more in terms of the opportunities that can be gained for the European Union in being leaders in climate action, be it creating new jobs and businesses, green growth, new technology, innovation and - in particular - new wealth. It is just an initial document and it now needs to be built upon and funded. I believe the European Investment Bank, EIB, has a role in this regard and it may be able to lend up to €1 trillion towards climate action projects in the decades ahead. The projects must be commercially viable so the money can be returned to the EIB.  The Mercosur political agreement has an environmental clause that requires Latin-American countries to honour their commitments on climate change. If they do not the deal is off. This is significant because previous trade deals have not included environmental clauses of that nature. It may become a model for the future.  On Israel and Palestine, I am strongly supportive of Palestinian statehood and we are strong advocates of the welfare of Palestinians. We do this in international forums, be they the UN, the EU or in bilateral meetings. We will continue to do so. This is well recognised by the Palestinian Authority and by other Arab countries. With products that are made in the settlements, Ireland intervened to support the labelling case, which now ensures that products made in the settlements are labelled as thus. This allows people and businesses to boycott them. In our view, an outright ban on imports would be contrary to European law because trade is a sole competency of the European Union.  We absolutely condemn any human rights abuses, in Bahrain or in any other country.  With regard to the WTO, international trade requires agreed rules for countries to trade with each other under a common set of principles. The WTO is at the core of that system. For it to function properly it must have a mechanism to resolve disputes. It is, therefore, very regrettable that the United States of America has decided to block the appointment of new judges to the appellate body. Without them it cannot function. At last week's European Council we expressed support for the European Commission's efforts to set up an alternative arbitration panel, interim arrangements, with third countries other than the US, while actively pursuing a permanent solution. Essentially, it is a work-around, except for disputes that involve the US. We are committed to finding an agreed solution to end the impasse. ",
        "questionType": "oral",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-17",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2019-12-17",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-17/debate/mul@/dbsect_9.xml"
            }
          },
          "debateSectionId": "dbsect_9",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-17/debate/dbsect_9",
          "showAs": "European Council Meetings"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-17/pq_18",
        "to": {
          "roleType": null,
          "showAs": "Taoiseach",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 18,
        "showAs": " 18. Deputy Micheál Martin asked the Taoiseach if he will report on the December 2019 European Council meeting. [52987/19] ",
        "answerText": " The Taoiseach  I propose to take Questions Nos. 9 to 22, inclusive, together.  I attended the European Council and euro summit in Brussels on Thursday, 12 December, and Friday, 13 December.  On Thursday, we discussed the idea of a conference on the future of Europe. We asked the incoming Croatian EU Presidency to work towards defining a Council position on the content, scope, composition and functioning of such a conference.  We had a substantial exchange on climate action and endorsed the objective of achieving a climate-neutral EU by 2050. One member state was unable to commit to implement this objective for itself at this stage and agreed to come back to the matter in June 2020.  Following a presentation of a negotiating box with figures by the Prime Minister of Finland, Sanna Marin, we discussed the main features of the multi-annual financial framework, MFF, the EU's budget for the period 2021-2027. We called on the President of the European Council, Charles Michel, to take the negotiations forward with a view to reaching agreement.  On external relations, we discussed EU-Africa relations, Russia and Turkey, as well as expressing solidarity with Albania following a recent earthquake there. We discussed the situation in the World Trade Organization.  At the euro summit, the new European Central Bank President, Christine Lagarde, gave an assessment of the current economic situation in Europe. We took stock of progress made by finance ministers on strengthening economic and monetary union.  Finally, we met in Article 50 format where we invited the Commission to draft a comprehensive mandate for the Council to consider for as close as possible a future relationship between the EU and the UK.  Since the European Council in October, I have met several of my colleagues. I met Charles Michel, the new President of the Council when he visited Dublin on 17 November in advance of formally taking up office.  I met the Prime Minister of Croatia, Mr. Plenkovi, in Zagreb on 21 November, ahead of the Croatian Presidency of the EU. We discussed the multi-annual financial framework, MFF, Brexit and bilateral relations. I was accompanied at that meeting by Ireland's ambassador to Croatia and by a small delegation of officials and advisers from my Department.  In the margins of last week's European Council, I launched a new climate action forum with the Prime Minister of Denmark, Mr. Frederiksen, and the Prime Minister of Sweden, Mr. Löfven, which will serve as a useful mechanism for our three countries to exchange best practice between us.  I also engaged informally with other counterparts, as I always do, to promote Irish interests, including with the Prime Minister of Finland, Sanna Marin, whom I congratulated on her recent election.  Tomorrow, I will have the opportunity to brief the House on the European Council in more detail.  On future travel engagements, I plan to attend the European Council meeting in Brussels on 26 and 27 March 2020. I expect to attend the World Economic Forum meeting in Davos in January, where the theme for the meeting is \"Stakeholders for a Cohesive and Sustainable World\". I also expect to travel to the United States in March for the annual St. Patrick's Day programme of events in Washington DC and Boston.  Other visits are being given consideration, but at present none is confirmed. \n An Leas-Cheann Comhairle  As the first question was in the name of Deputy Howlin, I call Deputy Burton. \n Deputy Joan Burton  Has the Taoiseach had an opportunity to consider the proposed new European green deal by the new President of the European Commission, Ursula von der Leyen? Is he in a position to enlighten Members as to the likely implications for Ireland of this deal?  The Taoiseach referred to the WTO. As we know, there is an ongoing dispute in the WTO with the United States of America relating to appointments within the WTO. Does he anticipate that this will create difficulties with the Brexit negotiations? If, unfortunately, there were to be any kind of hard Brexit, there could be a reversion to WTO rules. At the moment, given the state of the WTO rules, I do not see how that organisation would be in a position to manage that appropriately, particularly with the very serious interests affecting the island of Ireland that would be at stake. Have the Taoiseach and his fellow European Heads of State and Government had any opportunity to discuss the notion of a border down the Irish Sea or will that be a matter solely between the UK and the Republic of Ireland and Northern Ireland, assuming that the talks are successful and the Assembly recommences? \n Deputy Richard Boyd Barrett  As the Taoiseach mentioned, there was talk in Europe of radical action on climate. However, the signs are that it is just talk. The green new deal is good on aspiration but very short on detail. In any event it was not possible to get everybody to sign up to it because Poland has opted out. When I say it is good on aspiration, carbon neutrality by 2050 is not a bad aspiration, but if we were very serious about things, we would be aiming for carbon neutrality by 2030 and taking much more radical measures than are being proposed and we would be considerably more specific in those measures. Of course, the COP talks did not really achieve much at all.  Looking behind the rhetoric in Europe, the picture is not so good at all. The Mercosur deal exposes any commitment on the part of Europe to addressing the climate emergency, because at the same time as talking about an environmentally sustainable economic model, Europe is trying to negotiate a deal with the Bolsonaro regime to import large amounts of cheap beef from Latin America based on the cutting down of rainforests, the lungs of the earth. Similarly, in this country the Government talks about climate action but presses ahead with a liquefied natural gas terminal, fails in its targets on afforestation and refuses to ban the extraction of fossil fuels. Is it a case of lots of rhetoric but not so much action? \n Deputy Micheál Martin  In recent weeks I have been asking and raising with the Taoiseach the increasingly extreme stance of the Prime Minister of Israel, Mr. Netanyahu, and whether Ireland will advocate for any action against the threat of annexation of land on the West Bank. I think we can all agree that the Tánaiste's claim that his relationship with the US and with Mr. Netanyahu might lead to some form of breakthrough in the Middle East peace process has not turned out to be the case. More than a year ago the Tánaiste made forceful representations to me that we were on the cusp of a big breakthrough and that Ireland was playing a key role between the US and Israel. At the time I thought it was wildly optimistic and somewhat naïve, but nonetheless it was trying to get the Dáil to pull back from the motion on the trading issue with the settlements and Europe.  In response there have been general statements but no commitment to take any action or advocate any action. The Government has consistently refused to support the Dáil majority view of the need to act directly to stop illegal settlements from having access to selling their goods here and in other countries. The justification for this is the claim that it would infringe on European Union competence. This can be disputed, and we and others have received legal opinion using examples from the past. However, if what the Government says is true, then the obvious step to take is to seek European Union support for the policy.  So far there is zero evidence of the Taoiseach or Tánaiste advocating for a strengthened economic boycott of illegal settlements or taking any meaningful steps to oppose threatened annexations. The Government could show its good faith on this by writing to the Council and Commission Presidents, asking for a proposal to take stronger steps to block the illegal settlements from trading with the European Union. Will the Government take such action or is the Taoiseach saying he is happy that enough has been done on this issue to date? \n Deputy Martin Kenny  Regarding the Taoiseach's discussions in Europe on future funding, every individual and business, particularly businesses in the Border region is conscious of the impact of Brexit. Even if there is a deal or process that works out before the end of 2020, which everyone doubts very much, contingency plans will need to be put in place. It would be quite unfair to require the Irish Exchequer to fund that entirely. We are in this position as a result of Britain taking a unilateral decision to leave the European Union. It would be appropriate for the European Union to come to our assistance in respect of that. I am not just talking about moral assistance and support, but financial assistance to help the businesses that will undoubtedly be dramatically exposed.  In Spain, nine Catalan politicians have been imprisoned because of the holding of an independence referendum. What is likely to happen with that? It is clear that the political way forward is through dialogue and engagement, in which EU leaders should be playing a constructive role. Does the Taoiseach accept that withholding voting rights from citizens on self-determination and the subsequent imprisonment of political leaders in this manner is totally unacceptable and flies in the face of the democratic principles of the European Union? A similar situation could soon arise very close to us in Scotland with the Parliament in Westminster refusing to allow a referendum on Scottish independence in any circumstances. If the Scottish people decided to organise it themselves, a similar scenario could unfold in our close Celtic neighbour. It would be essential that we would be prepared to stand up to that. \n Deputy Paul Murphy  Will the Taoiseach and his Government make a clear statement of condemnation about the systematic human rights abuses in Bahrain? More than 5,000 people are currently imprisoned on political charges, with many of them subjected to torture, including sexual abuse. I will give a few examples. Nabeel Rajab was incarcerated for posting so-called false tweets criticising Saudi Arabia's war in Yemen and the torture in Bahrain's Jau Prison.  Hajer Mansoor Hassan was, incredibly, imprisoned based on the human rights activities of her son-in-law. She has been spat on, verbally abused and subject to psychological torture as part of her arrest. Part of the \"Bahrain Thirteen\", who are human rights activists, includes a doctor who suffers from paralysis and was forced to stand on one leg while he signed his supposed confession. There is a consistent pattern of mass trials, where the very idea of justice is a joke. More than 500 people have been convicted in a process of five mass trials in the past two years. There is no freedom of expression and one can be convicted of promoting terrorism simply for liking a tweet that is critical of the Government or the ruling family. Will the Irish Government speak out clearly against this in the context of the trade mission attended by the Minister in November? It was a major trade mission to the Middle East that included Bahrain. When asked by Deputy Crowe if concerns had been raised about human rights, the Minister for Foreign Affairs and Trade, Deputy Simon Coveney, said that it was not possible to raise our concerns about the human rights situation directly on that occasion. This begs a very serious question as to whether human rights are being put into second place behind trade and profits. \n The Taoiseach  I am very supportive of the European green deal. I am encouraged that President von der Leyen and the new Commission have decided to take a lead on this. When Ms von der Leyen was nominated by the European Council for Commission president she said she would do so and the President has already shown her sincerity in that regard. The objective is to transform Europe into the first climate neutral continent by 2050. The approach, and the way the President and the Commission have framed it, is a very good one. It is less in the vein of a climate apocalypse and more in terms of the opportunities that can be gained for the European Union in being leaders in climate action, be it creating new jobs and businesses, green growth, new technology, innovation and - in particular - new wealth. It is just an initial document and it now needs to be built upon and funded. I believe the European Investment Bank, EIB, has a role in this regard and it may be able to lend up to €1 trillion towards climate action projects in the decades ahead. The projects must be commercially viable so the money can be returned to the EIB.  The Mercosur political agreement has an environmental clause that requires Latin-American countries to honour their commitments on climate change. If they do not the deal is off. This is significant because previous trade deals have not included environmental clauses of that nature. It may become a model for the future.  On Israel and Palestine, I am strongly supportive of Palestinian statehood and we are strong advocates of the welfare of Palestinians. We do this in international forums, be they the UN, the EU or in bilateral meetings. We will continue to do so. This is well recognised by the Palestinian Authority and by other Arab countries. With products that are made in the settlements, Ireland intervened to support the labelling case, which now ensures that products made in the settlements are labelled as thus. This allows people and businesses to boycott them. In our view, an outright ban on imports would be contrary to European law because trade is a sole competency of the European Union.  We absolutely condemn any human rights abuses, in Bahrain or in any other country.  With regard to the WTO, international trade requires agreed rules for countries to trade with each other under a common set of principles. The WTO is at the core of that system. For it to function properly it must have a mechanism to resolve disputes. It is, therefore, very regrettable that the United States of America has decided to block the appointment of new judges to the appellate body. Without them it cannot function. At last week's European Council we expressed support for the European Commission's efforts to set up an alternative arbitration panel, interim arrangements, with third countries other than the US, while actively pursuing a permanent solution. Essentially, it is a work-around, except for disputes that involve the US. We are committed to finding an agreed solution to end the impasse. ",
        "questionType": "oral",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-17",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2019-12-17",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-17/debate/mul@/dbsect_9.xml"
            }
          },
          "debateSectionId": "dbsect_9",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-17/debate/dbsect_9",
          "showAs": "European Council Meetings"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-17/pq_19",
        "to": {
          "roleType": null,
          "showAs": "Taoiseach",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 19,
        "showAs": " 19. Deputy Micheál Martin asked the Taoiseach if he held bilateral meetings while attending the December 2019 European Council meeting; and if so, the issues discussed. [52988/19] ",
        "answerText": " The Taoiseach  I propose to take Questions Nos. 9 to 22, inclusive, together.  I attended the European Council and euro summit in Brussels on Thursday, 12 December, and Friday, 13 December.  On Thursday, we discussed the idea of a conference on the future of Europe. We asked the incoming Croatian EU Presidency to work towards defining a Council position on the content, scope, composition and functioning of such a conference.  We had a substantial exchange on climate action and endorsed the objective of achieving a climate-neutral EU by 2050. One member state was unable to commit to implement this objective for itself at this stage and agreed to come back to the matter in June 2020.  Following a presentation of a negotiating box with figures by the Prime Minister of Finland, Sanna Marin, we discussed the main features of the multi-annual financial framework, MFF, the EU's budget for the period 2021-2027. We called on the President of the European Council, Charles Michel, to take the negotiations forward with a view to reaching agreement.  On external relations, we discussed EU-Africa relations, Russia and Turkey, as well as expressing solidarity with Albania following a recent earthquake there. We discussed the situation in the World Trade Organization.  At the euro summit, the new European Central Bank President, Christine Lagarde, gave an assessment of the current economic situation in Europe. We took stock of progress made by finance ministers on strengthening economic and monetary union.  Finally, we met in Article 50 format where we invited the Commission to draft a comprehensive mandate for the Council to consider for as close as possible a future relationship between the EU and the UK.  Since the European Council in October, I have met several of my colleagues. I met Charles Michel, the new President of the Council when he visited Dublin on 17 November in advance of formally taking up office.  I met the Prime Minister of Croatia, Mr. Plenkovi, in Zagreb on 21 November, ahead of the Croatian Presidency of the EU. We discussed the multi-annual financial framework, MFF, Brexit and bilateral relations. I was accompanied at that meeting by Ireland's ambassador to Croatia and by a small delegation of officials and advisers from my Department.  In the margins of last week's European Council, I launched a new climate action forum with the Prime Minister of Denmark, Mr. Frederiksen, and the Prime Minister of Sweden, Mr. Löfven, which will serve as a useful mechanism for our three countries to exchange best practice between us.  I also engaged informally with other counterparts, as I always do, to promote Irish interests, including with the Prime Minister of Finland, Sanna Marin, whom I congratulated on her recent election.  Tomorrow, I will have the opportunity to brief the House on the European Council in more detail.  On future travel engagements, I plan to attend the European Council meeting in Brussels on 26 and 27 March 2020. I expect to attend the World Economic Forum meeting in Davos in January, where the theme for the meeting is \"Stakeholders for a Cohesive and Sustainable World\". I also expect to travel to the United States in March for the annual St. Patrick's Day programme of events in Washington DC and Boston.  Other visits are being given consideration, but at present none is confirmed. \n An Leas-Cheann Comhairle  As the first question was in the name of Deputy Howlin, I call Deputy Burton. \n Deputy Joan Burton  Has the Taoiseach had an opportunity to consider the proposed new European green deal by the new President of the European Commission, Ursula von der Leyen? Is he in a position to enlighten Members as to the likely implications for Ireland of this deal?  The Taoiseach referred to the WTO. As we know, there is an ongoing dispute in the WTO with the United States of America relating to appointments within the WTO. Does he anticipate that this will create difficulties with the Brexit negotiations? If, unfortunately, there were to be any kind of hard Brexit, there could be a reversion to WTO rules. At the moment, given the state of the WTO rules, I do not see how that organisation would be in a position to manage that appropriately, particularly with the very serious interests affecting the island of Ireland that would be at stake. Have the Taoiseach and his fellow European Heads of State and Government had any opportunity to discuss the notion of a border down the Irish Sea or will that be a matter solely between the UK and the Republic of Ireland and Northern Ireland, assuming that the talks are successful and the Assembly recommences? \n Deputy Richard Boyd Barrett  As the Taoiseach mentioned, there was talk in Europe of radical action on climate. However, the signs are that it is just talk. The green new deal is good on aspiration but very short on detail. In any event it was not possible to get everybody to sign up to it because Poland has opted out. When I say it is good on aspiration, carbon neutrality by 2050 is not a bad aspiration, but if we were very serious about things, we would be aiming for carbon neutrality by 2030 and taking much more radical measures than are being proposed and we would be considerably more specific in those measures. Of course, the COP talks did not really achieve much at all.  Looking behind the rhetoric in Europe, the picture is not so good at all. The Mercosur deal exposes any commitment on the part of Europe to addressing the climate emergency, because at the same time as talking about an environmentally sustainable economic model, Europe is trying to negotiate a deal with the Bolsonaro regime to import large amounts of cheap beef from Latin America based on the cutting down of rainforests, the lungs of the earth. Similarly, in this country the Government talks about climate action but presses ahead with a liquefied natural gas terminal, fails in its targets on afforestation and refuses to ban the extraction of fossil fuels. Is it a case of lots of rhetoric but not so much action? \n Deputy Micheál Martin  In recent weeks I have been asking and raising with the Taoiseach the increasingly extreme stance of the Prime Minister of Israel, Mr. Netanyahu, and whether Ireland will advocate for any action against the threat of annexation of land on the West Bank. I think we can all agree that the Tánaiste's claim that his relationship with the US and with Mr. Netanyahu might lead to some form of breakthrough in the Middle East peace process has not turned out to be the case. More than a year ago the Tánaiste made forceful representations to me that we were on the cusp of a big breakthrough and that Ireland was playing a key role between the US and Israel. At the time I thought it was wildly optimistic and somewhat naïve, but nonetheless it was trying to get the Dáil to pull back from the motion on the trading issue with the settlements and Europe.  In response there have been general statements but no commitment to take any action or advocate any action. The Government has consistently refused to support the Dáil majority view of the need to act directly to stop illegal settlements from having access to selling their goods here and in other countries. The justification for this is the claim that it would infringe on European Union competence. This can be disputed, and we and others have received legal opinion using examples from the past. However, if what the Government says is true, then the obvious step to take is to seek European Union support for the policy.  So far there is zero evidence of the Taoiseach or Tánaiste advocating for a strengthened economic boycott of illegal settlements or taking any meaningful steps to oppose threatened annexations. The Government could show its good faith on this by writing to the Council and Commission Presidents, asking for a proposal to take stronger steps to block the illegal settlements from trading with the European Union. Will the Government take such action or is the Taoiseach saying he is happy that enough has been done on this issue to date? \n Deputy Martin Kenny  Regarding the Taoiseach's discussions in Europe on future funding, every individual and business, particularly businesses in the Border region is conscious of the impact of Brexit. Even if there is a deal or process that works out before the end of 2020, which everyone doubts very much, contingency plans will need to be put in place. It would be quite unfair to require the Irish Exchequer to fund that entirely. We are in this position as a result of Britain taking a unilateral decision to leave the European Union. It would be appropriate for the European Union to come to our assistance in respect of that. I am not just talking about moral assistance and support, but financial assistance to help the businesses that will undoubtedly be dramatically exposed.  In Spain, nine Catalan politicians have been imprisoned because of the holding of an independence referendum. What is likely to happen with that? It is clear that the political way forward is through dialogue and engagement, in which EU leaders should be playing a constructive role. Does the Taoiseach accept that withholding voting rights from citizens on self-determination and the subsequent imprisonment of political leaders in this manner is totally unacceptable and flies in the face of the democratic principles of the European Union? A similar situation could soon arise very close to us in Scotland with the Parliament in Westminster refusing to allow a referendum on Scottish independence in any circumstances. If the Scottish people decided to organise it themselves, a similar scenario could unfold in our close Celtic neighbour. It would be essential that we would be prepared to stand up to that. \n Deputy Paul Murphy  Will the Taoiseach and his Government make a clear statement of condemnation about the systematic human rights abuses in Bahrain? More than 5,000 people are currently imprisoned on political charges, with many of them subjected to torture, including sexual abuse. I will give a few examples. Nabeel Rajab was incarcerated for posting so-called false tweets criticising Saudi Arabia's war in Yemen and the torture in Bahrain's Jau Prison.  Hajer Mansoor Hassan was, incredibly, imprisoned based on the human rights activities of her son-in-law. She has been spat on, verbally abused and subject to psychological torture as part of her arrest. Part of the \"Bahrain Thirteen\", who are human rights activists, includes a doctor who suffers from paralysis and was forced to stand on one leg while he signed his supposed confession. There is a consistent pattern of mass trials, where the very idea of justice is a joke. More than 500 people have been convicted in a process of five mass trials in the past two years. There is no freedom of expression and one can be convicted of promoting terrorism simply for liking a tweet that is critical of the Government or the ruling family. Will the Irish Government speak out clearly against this in the context of the trade mission attended by the Minister in November? It was a major trade mission to the Middle East that included Bahrain. When asked by Deputy Crowe if concerns had been raised about human rights, the Minister for Foreign Affairs and Trade, Deputy Simon Coveney, said that it was not possible to raise our concerns about the human rights situation directly on that occasion. This begs a very serious question as to whether human rights are being put into second place behind trade and profits. \n The Taoiseach  I am very supportive of the European green deal. I am encouraged that President von der Leyen and the new Commission have decided to take a lead on this. When Ms von der Leyen was nominated by the European Council for Commission president she said she would do so and the President has already shown her sincerity in that regard. The objective is to transform Europe into the first climate neutral continent by 2050. The approach, and the way the President and the Commission have framed it, is a very good one. It is less in the vein of a climate apocalypse and more in terms of the opportunities that can be gained for the European Union in being leaders in climate action, be it creating new jobs and businesses, green growth, new technology, innovation and - in particular - new wealth. It is just an initial document and it now needs to be built upon and funded. I believe the European Investment Bank, EIB, has a role in this regard and it may be able to lend up to €1 trillion towards climate action projects in the decades ahead. The projects must be commercially viable so the money can be returned to the EIB.  The Mercosur political agreement has an environmental clause that requires Latin-American countries to honour their commitments on climate change. If they do not the deal is off. This is significant because previous trade deals have not included environmental clauses of that nature. It may become a model for the future.  On Israel and Palestine, I am strongly supportive of Palestinian statehood and we are strong advocates of the welfare of Palestinians. We do this in international forums, be they the UN, the EU or in bilateral meetings. We will continue to do so. This is well recognised by the Palestinian Authority and by other Arab countries. With products that are made in the settlements, Ireland intervened to support the labelling case, which now ensures that products made in the settlements are labelled as thus. This allows people and businesses to boycott them. In our view, an outright ban on imports would be contrary to European law because trade is a sole competency of the European Union.  We absolutely condemn any human rights abuses, in Bahrain or in any other country.  With regard to the WTO, international trade requires agreed rules for countries to trade with each other under a common set of principles. The WTO is at the core of that system. For it to function properly it must have a mechanism to resolve disputes. It is, therefore, very regrettable that the United States of America has decided to block the appointment of new judges to the appellate body. Without them it cannot function. At last week's European Council we expressed support for the European Commission's efforts to set up an alternative arbitration panel, interim arrangements, with third countries other than the US, while actively pursuing a permanent solution. Essentially, it is a work-around, except for disputes that involve the US. We are committed to finding an agreed solution to end the impasse. ",
        "questionType": "oral",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-17",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2019-12-17",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-17/debate/mul@/dbsect_9.xml"
            }
          },
          "debateSectionId": "dbsect_9",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-17/debate/dbsect_9",
          "showAs": "European Council Meetings"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-17/pq_22",
        "to": {
          "roleType": null,
          "showAs": "Taoiseach",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 22,
        "showAs": " 22. Deputy Micheál Martin asked the Taoiseach if he met the new European Council President while in Brussels; and if so, the issues discussed. [53348/19] ",
        "answerText": " The Taoiseach  I propose to take Questions Nos. 9 to 22, inclusive, together.  I attended the European Council and euro summit in Brussels on Thursday, 12 December, and Friday, 13 December.  On Thursday, we discussed the idea of a conference on the future of Europe. We asked the incoming Croatian EU Presidency to work towards defining a Council position on the content, scope, composition and functioning of such a conference.  We had a substantial exchange on climate action and endorsed the objective of achieving a climate-neutral EU by 2050. One member state was unable to commit to implement this objective for itself at this stage and agreed to come back to the matter in June 2020.  Following a presentation of a negotiating box with figures by the Prime Minister of Finland, Sanna Marin, we discussed the main features of the multi-annual financial framework, MFF, the EU's budget for the period 2021-2027. We called on the President of the European Council, Charles Michel, to take the negotiations forward with a view to reaching agreement.  On external relations, we discussed EU-Africa relations, Russia and Turkey, as well as expressing solidarity with Albania following a recent earthquake there. We discussed the situation in the World Trade Organization.  At the euro summit, the new European Central Bank President, Christine Lagarde, gave an assessment of the current economic situation in Europe. We took stock of progress made by finance ministers on strengthening economic and monetary union.  Finally, we met in Article 50 format where we invited the Commission to draft a comprehensive mandate for the Council to consider for as close as possible a future relationship between the EU and the UK.  Since the European Council in October, I have met several of my colleagues. I met Charles Michel, the new President of the Council when he visited Dublin on 17 November in advance of formally taking up office.  I met the Prime Minister of Croatia, Mr. Plenkovi, in Zagreb on 21 November, ahead of the Croatian Presidency of the EU. We discussed the multi-annual financial framework, MFF, Brexit and bilateral relations. I was accompanied at that meeting by Ireland's ambassador to Croatia and by a small delegation of officials and advisers from my Department.  In the margins of last week's European Council, I launched a new climate action forum with the Prime Minister of Denmark, Mr. Frederiksen, and the Prime Minister of Sweden, Mr. Löfven, which will serve as a useful mechanism for our three countries to exchange best practice between us.  I also engaged informally with other counterparts, as I always do, to promote Irish interests, including with the Prime Minister of Finland, Sanna Marin, whom I congratulated on her recent election.  Tomorrow, I will have the opportunity to brief the House on the European Council in more detail.  On future travel engagements, I plan to attend the European Council meeting in Brussels on 26 and 27 March 2020. I expect to attend the World Economic Forum meeting in Davos in January, where the theme for the meeting is \"Stakeholders for a Cohesive and Sustainable World\". I also expect to travel to the United States in March for the annual St. Patrick's Day programme of events in Washington DC and Boston.  Other visits are being given consideration, but at present none is confirmed. \n An Leas-Cheann Comhairle  As the first question was in the name of Deputy Howlin, I call Deputy Burton. \n Deputy Joan Burton  Has the Taoiseach had an opportunity to consider the proposed new European green deal by the new President of the European Commission, Ursula von der Leyen? Is he in a position to enlighten Members as to the likely implications for Ireland of this deal?  The Taoiseach referred to the WTO. As we know, there is an ongoing dispute in the WTO with the United States of America relating to appointments within the WTO. Does he anticipate that this will create difficulties with the Brexit negotiations? If, unfortunately, there were to be any kind of hard Brexit, there could be a reversion to WTO rules. At the moment, given the state of the WTO rules, I do not see how that organisation would be in a position to manage that appropriately, particularly with the very serious interests affecting the island of Ireland that would be at stake. Have the Taoiseach and his fellow European Heads of State and Government had any opportunity to discuss the notion of a border down the Irish Sea or will that be a matter solely between the UK and the Republic of Ireland and Northern Ireland, assuming that the talks are successful and the Assembly recommences? \n Deputy Richard Boyd Barrett  As the Taoiseach mentioned, there was talk in Europe of radical action on climate. However, the signs are that it is just talk. The green new deal is good on aspiration but very short on detail. In any event it was not possible to get everybody to sign up to it because Poland has opted out. When I say it is good on aspiration, carbon neutrality by 2050 is not a bad aspiration, but if we were very serious about things, we would be aiming for carbon neutrality by 2030 and taking much more radical measures than are being proposed and we would be considerably more specific in those measures. Of course, the COP talks did not really achieve much at all.  Looking behind the rhetoric in Europe, the picture is not so good at all. The Mercosur deal exposes any commitment on the part of Europe to addressing the climate emergency, because at the same time as talking about an environmentally sustainable economic model, Europe is trying to negotiate a deal with the Bolsonaro regime to import large amounts of cheap beef from Latin America based on the cutting down of rainforests, the lungs of the earth. Similarly, in this country the Government talks about climate action but presses ahead with a liquefied natural gas terminal, fails in its targets on afforestation and refuses to ban the extraction of fossil fuels. Is it a case of lots of rhetoric but not so much action? \n Deputy Micheál Martin  In recent weeks I have been asking and raising with the Taoiseach the increasingly extreme stance of the Prime Minister of Israel, Mr. Netanyahu, and whether Ireland will advocate for any action against the threat of annexation of land on the West Bank. I think we can all agree that the Tánaiste's claim that his relationship with the US and with Mr. Netanyahu might lead to some form of breakthrough in the Middle East peace process has not turned out to be the case. More than a year ago the Tánaiste made forceful representations to me that we were on the cusp of a big breakthrough and that Ireland was playing a key role between the US and Israel. At the time I thought it was wildly optimistic and somewhat naïve, but nonetheless it was trying to get the Dáil to pull back from the motion on the trading issue with the settlements and Europe.  In response there have been general statements but no commitment to take any action or advocate any action. The Government has consistently refused to support the Dáil majority view of the need to act directly to stop illegal settlements from having access to selling their goods here and in other countries. The justification for this is the claim that it would infringe on European Union competence. This can be disputed, and we and others have received legal opinion using examples from the past. However, if what the Government says is true, then the obvious step to take is to seek European Union support for the policy.  So far there is zero evidence of the Taoiseach or Tánaiste advocating for a strengthened economic boycott of illegal settlements or taking any meaningful steps to oppose threatened annexations. The Government could show its good faith on this by writing to the Council and Commission Presidents, asking for a proposal to take stronger steps to block the illegal settlements from trading with the European Union. Will the Government take such action or is the Taoiseach saying he is happy that enough has been done on this issue to date? \n Deputy Martin Kenny  Regarding the Taoiseach's discussions in Europe on future funding, every individual and business, particularly businesses in the Border region is conscious of the impact of Brexit. Even if there is a deal or process that works out before the end of 2020, which everyone doubts very much, contingency plans will need to be put in place. It would be quite unfair to require the Irish Exchequer to fund that entirely. We are in this position as a result of Britain taking a unilateral decision to leave the European Union. It would be appropriate for the European Union to come to our assistance in respect of that. I am not just talking about moral assistance and support, but financial assistance to help the businesses that will undoubtedly be dramatically exposed.  In Spain, nine Catalan politicians have been imprisoned because of the holding of an independence referendum. What is likely to happen with that? It is clear that the political way forward is through dialogue and engagement, in which EU leaders should be playing a constructive role. Does the Taoiseach accept that withholding voting rights from citizens on self-determination and the subsequent imprisonment of political leaders in this manner is totally unacceptable and flies in the face of the democratic principles of the European Union? A similar situation could soon arise very close to us in Scotland with the Parliament in Westminster refusing to allow a referendum on Scottish independence in any circumstances. If the Scottish people decided to organise it themselves, a similar scenario could unfold in our close Celtic neighbour. It would be essential that we would be prepared to stand up to that. \n Deputy Paul Murphy  Will the Taoiseach and his Government make a clear statement of condemnation about the systematic human rights abuses in Bahrain? More than 5,000 people are currently imprisoned on political charges, with many of them subjected to torture, including sexual abuse. I will give a few examples. Nabeel Rajab was incarcerated for posting so-called false tweets criticising Saudi Arabia's war in Yemen and the torture in Bahrain's Jau Prison.  Hajer Mansoor Hassan was, incredibly, imprisoned based on the human rights activities of her son-in-law. She has been spat on, verbally abused and subject to psychological torture as part of her arrest. Part of the \"Bahrain Thirteen\", who are human rights activists, includes a doctor who suffers from paralysis and was forced to stand on one leg while he signed his supposed confession. There is a consistent pattern of mass trials, where the very idea of justice is a joke. More than 500 people have been convicted in a process of five mass trials in the past two years. There is no freedom of expression and one can be convicted of promoting terrorism simply for liking a tweet that is critical of the Government or the ruling family. Will the Irish Government speak out clearly against this in the context of the trade mission attended by the Minister in November? It was a major trade mission to the Middle East that included Bahrain. When asked by Deputy Crowe if concerns had been raised about human rights, the Minister for Foreign Affairs and Trade, Deputy Simon Coveney, said that it was not possible to raise our concerns about the human rights situation directly on that occasion. This begs a very serious question as to whether human rights are being put into second place behind trade and profits. \n The Taoiseach  I am very supportive of the European green deal. I am encouraged that President von der Leyen and the new Commission have decided to take a lead on this. When Ms von der Leyen was nominated by the European Council for Commission president she said she would do so and the President has already shown her sincerity in that regard. The objective is to transform Europe into the first climate neutral continent by 2050. The approach, and the way the President and the Commission have framed it, is a very good one. It is less in the vein of a climate apocalypse and more in terms of the opportunities that can be gained for the European Union in being leaders in climate action, be it creating new jobs and businesses, green growth, new technology, innovation and - in particular - new wealth. It is just an initial document and it now needs to be built upon and funded. I believe the European Investment Bank, EIB, has a role in this regard and it may be able to lend up to €1 trillion towards climate action projects in the decades ahead. The projects must be commercially viable so the money can be returned to the EIB.  The Mercosur political agreement has an environmental clause that requires Latin-American countries to honour their commitments on climate change. If they do not the deal is off. This is significant because previous trade deals have not included environmental clauses of that nature. It may become a model for the future.  On Israel and Palestine, I am strongly supportive of Palestinian statehood and we are strong advocates of the welfare of Palestinians. We do this in international forums, be they the UN, the EU or in bilateral meetings. We will continue to do so. This is well recognised by the Palestinian Authority and by other Arab countries. With products that are made in the settlements, Ireland intervened to support the labelling case, which now ensures that products made in the settlements are labelled as thus. This allows people and businesses to boycott them. In our view, an outright ban on imports would be contrary to European law because trade is a sole competency of the European Union.  We absolutely condemn any human rights abuses, in Bahrain or in any other country.  With regard to the WTO, international trade requires agreed rules for countries to trade with each other under a common set of principles. The WTO is at the core of that system. For it to function properly it must have a mechanism to resolve disputes. It is, therefore, very regrettable that the United States of America has decided to block the appointment of new judges to the appellate body. Without them it cannot function. At last week's European Council we expressed support for the European Commission's efforts to set up an alternative arbitration panel, interim arrangements, with third countries other than the US, while actively pursuing a permanent solution. Essentially, it is a work-around, except for disputes that involve the US. We are committed to finding an agreed solution to end the impasse. ",
        "questionType": "oral",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-17",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2019-12-17",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-17/writtens/mul@/dbsect_73.xml"
            }
          },
          "debateSectionId": "dbsect_73",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-17/writtens/dbsect_73",
          "showAs": "Brexit Negotiations"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-17/pq_100",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 100,
        "showAs": " 100. Deputy Micheál Martin asked the Tánaiste and Minister for Foreign Affairs and Trade if he will report on Brexit discussions at the most recent Foreign Affairs Council meeting. [52989/19] ",
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  Brexit was discussed at the European Council, which met in Article 50 formation on 13 December, but it was not an item for discussion at the Foreign Affairs Council. In its conclusions on Brexit, the European Council reiterated its commitment to an orderly UK withdrawal on the basis of the Withdrawal Agreement and called for its timely ratification and effective implementation.  At its meeting of 13 December, the European Council reconfirmed its desire to establish the closest possible future relationship with the UK in line with the Political Declaration and based on a balance of rights and obligations and to ensure a level playing field.  To this end, the European Council has invited the European Commission to come forward with a comprehensive mandate for the EU-UK future relationship immediately after Brexit takes place. The General Affairs Council will adopt the relevant decisions and negotiating mandate.  Ireland has consistently supported the closest possible relationship between the EU and the UK, in the interests of Ireland, North and South, and British-Irish relations, as well as in terms of our economic and trading priorities.  We also have signigicant interests in ensuring adequate level playing field provisions to facilitate fair competition.  Alongside our EU partners, we welcome the Commission's decision to reappoint Michel Barnier for the negotiations on the future relationship. These negotiations will continue to take pace in a manner of unity and transparency with all Member States and the European Council.  The European Council will follow negotiations closely and will agree further political decisions as necessary.  Between European Council meetings, the General Affairs Council and COREPER, assisted by a dedicated working party, it will ensure that the negotiations are conducted in line with the overall positions and principles agreed by the European Council as well as the Council's negotiating mandate, with the aim of reaching a result that is fair for all Member States and in the interest of our citizens. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-17",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2019-12-17",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-17/writtens/mul@/dbsect_74.xml"
            }
          },
          "debateSectionId": "dbsect_74",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-17/writtens/dbsect_74",
          "showAs": "Brexit Issues"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-17/pq_101",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 101,
        "showAs": " 101. Deputy Micheál Martin asked the Tánaiste and Minister for Foreign Affairs and Trade if he has discussed the next steps following the general election in the UK on the withdrawal treaty Bill with his UK counterpart. [53345/19] ",
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  The Taoiseach and I, and our colleagues in Government, look forward to meeting with the new UK Government in the coming weeks.  The Taoiseach spoke with Prime Minister Johnson on Friday last and they will meet in person as soon as is possible.  For my part, I look forward to meeting with the UK Foreign Secretary, early in 2020, to discuss mutual interests and shared global challenges.  In addition, the two Governments are also continuing to work together closely to secure the return to operation of all of the institutions of the Good Friday Agreement again. I am working intensively with the Secretary of State for Northern Ireland, Julian Smith MP, to support the political parties in Northern Ireland in reaching an agreement that will achieve this.  We welcome the new British Government’s intention to ratify the Withdrawal Agreement as soon as possible, starting with the return of a Withdrawal Agreement Bill to the House of Commons later this week.  Ireland wants to see the closest possible relationship between the EU and the UK, while also ensuring level playing field provisions to facilitate fair competition. Ireland will be engaged in all stages of the negotiations in order to ensure that our priorities and interests are appropriately reflected in the EU’s position. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-17",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2019-12-17",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-17/writtens/mul@/dbsect_122.xml"
            }
          },
          "debateSectionId": "dbsect_122",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-17/writtens/dbsect_122",
          "showAs": "European Banking Union"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-17/pq_152",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 152,
        "showAs": " 152. Deputy Micheál Martin asked the Minister for Finance if he will report on the outcome of the discussions at the December 2019 ECOFIN meeting on strengthening the banking union. [52991/19] ",
        "answerText": " Minister for Finance  At ECOFIN in December 2019 the Council took stock of progress in strengthening the Banking Union under the Finnish Presidency. This is a regular agenda item at the end of each Presidency. The report is available at \" https://data.consilium.europa.eu/doc/document/ST-14354-2019-INIT/en/pdf \".  The report outlined the work which has been undertaken in relation to the proposal for a common European Deposit Insurance Scheme (EDIS), the action plan to tackle Non-Performing Loans in Europe and the implementation of the \"Banking Package\" (a series of reforms to the Capital Requirements Regulation, the Capital Requirements Directive, the Bank Recovery and Resolution Directive and the Single Resolution Mechanism Regulation).  It is anticipated that the work on this topic will continue at Eurogroup and under the Croatian Presidency in the first half of 2020. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-17",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2019-12-17",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-17/writtens/mul@/dbsect_512.xml"
            }
          },
          "debateSectionId": "dbsect_512",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-17/writtens/dbsect_512",
          "showAs": "European Council Meetings"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-17/pq_553",
        "to": {
          "roleType": null,
          "showAs": "Communications",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 553,
        "showAs": " 553. Deputy Micheál Martin asked the Minister for Communications, Climate Action and Environment if he will report on the discussions at the December 2019 Environment Council meeting on climate change; and the way in which the EU plans to achieve carbon neutrality by 2050.  [52992/19] ",
        "answerText": " Minister for Communications, Climate Action and Environment  The Environment Council will take place on Thursday 19 December. The Council is expected to discuss EU environment and climate policy in the new legislative term and the European Commission will present its communication on the 'European Green Deal'. This Communication, published last week, provides the roadmap to embed climate action into all policies and reaffirms the EU's commitment to tackling climate and environmental related challenges through an economy-wide approach.  At its meeting on 12 and 13 December, the European Council also endorsed the EU’s 2050 climate neutrality target.  Ireland supports these two significant steps forward, which reaffirm the EU's commitment and leadership role in tackling climate and delivering on the objectives of the Paris Agreement.  The twenty-fifth Conference of the Parties to the UNFCCC (COP 25) took place from 2 to 13 December in Madrid, Spain, where the main focus was to finalise the ‘Katowice rulebook’ which will support operationalising the Paris Agreement and clear the path for raising ambition at COP26 in Glasgow.  Ireland aligned with a group of ambitious countries which agreed the ‘San Jose Principles for High Ambition and Integrity in International Carbon Markets’, underlining our position that the only acceptable outcome is one which does not undermine the environmental integrity of the Paris Agreement.  Despite extensive negotiations, Parties were unable to reach agreement on the modalities for Article 6 and negotiations on these provisions will continue in 2020. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-17",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2019-12-11",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-11/debate/mul@/dbsect_23.xml"
            }
          },
          "debateSectionId": "dbsect_23",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-11/debate/dbsect_23",
          "showAs": "National Economic and Social Council"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-11/pq_6",
        "to": {
          "roleType": null,
          "showAs": "Taoiseach",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 6,
        "showAs": " 6. Deputy Micheál Martin asked the Taoiseach if he will report on the work of his Department with the National Economic and Social Council. [49132/19] ",
        "answerText": " The Taoiseach  I propose to take Questions Nos. 6 to 9, inclusive, together.  The National Economic and Social Council, NESC, is an independent statutory agency operating under the aegis of my Department. The council analyses and reports on strategic policy matters relevant to Ireland's economic, social, environmental and sustainable development. The NESC is a valuable forum where economic, social and environmental issues can be discussed between a variety of actors and Departments. The council's work focuses on the strategic and long-term view and its current work programme comprises four themes: Ireland's transition to a low-carbon and digital future; reforms to the social welfare system; land use, land value and urban development; and climate change.  Future Jobs Ireland 2019 also includes a request for NESC to develop policy recommendations for the operation of transition teams to manage the impact of economic transition on vulnerable workers and sectors. The project will provide a forward look at the economy in the context of a transition to a low carbon and more digital future.  I present council reports to Government prior to their publication, or prior to laying them before the Houses, as in the case of the annual reports. Council reports published in 2019 include Transport-Orientated Development: Assessing the Opportunity for Ireland and Climate Change Policy: Getting the Process Right.  I appoint members to the council under the National Economic and Social Development Office Act 2006 and the NESC (Alteration of Composition) Order 2010 - SI 603 of 2010. Each of the following sectors nominates three representatives to the council: business and employer interests, ICTU, farming and agricultural interests, community and voluntary sector, and the environmental sector.  A further six members are public servants, mainly Secretaries General, and must include a representative of my Department and the Department of Finance. The Secretary General of my Department, Mr. Martin Fraser, is the chair of the council and an assistant secretary of my Department, Ms Liz Canavan, is the deputy chair. There are also seven independent members on the council. This composition means that it plays an important and unique role in bringing different perspectives from civil society together with Government. This helps NESC to analyse the challenges facing society and to develop a shared understanding among its members of how to tackle these challenges. Since becoming Taoiseach, I have made 12 appointments to the council in line with the legislation and the guidelines on appointments to State boards. The council is funded through my Department's Vote and my Department also has governance responsibilities regarding the council. \n Deputy Micheál Martin  In the past couple of years, NESC has focused much of its work on climate change and sustainability. This has been welcome and constructive work. This was acknowledged earlier this year when the Government launched its much delayed climate plan. For the past two months, I have been trying and failing to get the Taoiseach to summon up his reputation for straight talking, which used to be promoted by his supporters, to answer some basic questions about the targets in the climate plan. At its launch, and during the extended period of partial briefing and marketing that surrounded its appearance, it was claimed by the Government that the plan was specific, ambitious and credible in setting out exactly how Ireland can reach its emissions targets. One of these targets is that, within ten years, Ireland will have 1 million electric vehicles on the road. It has been estimated that to hit the Government's target every car sold from January onwards for the next ten years will have to be electric. This is obviously nonsense. The cars are not available, the charging network is not available and there is no policy in place capable of delivering even a fraction of the target of a one hundredfold increase in sales starting in three weeks. Can the Taoiseach tell us how exactly he believes the target for electric vehicles will be met? We need precision, not the general stuff that he has been going on with for the past few months. What measures in the recent budget will deliver the proposed dramatic turnaround in the immediate future? When will we see an update on progress towards achieving the targets in the plan? \n Deputy Brendan Howlin  According to the latest census figures, there 79 black spots across electoral divisions in Ireland. These are areas where the average unemployment rate is above 30%, with those between the ages of 25 and 34 the largest segment of those without a job. Those who are jobless most frequently cite the construction sector as their previous occupation. In short, a large pool of potential construction workers are being left behind. This is a time we need a massive housebuilding programme, and a massive investment in retrofitting the existing housing stock to deal with climate change. The Central Bank stated that we need 34,000 homes per year and the Society of St. Vincent De Paul report on energy poverty launched yesterday highlighted the fact that a massive retrofitting project is urgently needed.  The national training fund, which is meant to fund apprentices, has been allowed to run a cumulative surplus of €460 million in spite of the fact that the NESC recommended its greater use to fund apprentices and get people in unemployment black spots, the areas of the country with unemployment rates of 30% or more, back to work. Will the Taoiseach act on this issue, use that available funding to create apprenticeship places for unemployed former construction workers and address the needs of our economy by building houses, retrofitting homes and ensuring the fund is deployed? \n Deputy Martin Kenny  Last year, the NESC published its important report No. 145, entitled Urban Development Land, Housing and Infrastructure: Fixing Ireland’s Broken System, which described the housing system as speculative, volatile and expensive. Launching the report, Dr. Rory O'Connor stated, \"We know from experience that in countries with more effective, affordable and stable housing systems - such as Austria, Germany and the Netherlands - public bodies actively manage land supply, housing provision and affordability.\" NESC research indicates that public institutions need a strong development mandate, political authority and executive capacity to drive housing supply. It appears the Government has abandoned the report's recommendations. Everything that has been done since its publication has gone in the other direction. For instance, the Land Development Agency, LDA, which does not have compulsory purchase order, CPO, powers, is off-balance sheet and, effectively, is a fully independent commercial entity that only has regard to Government policy rather than delivering on it. It is under no statutory obligation to deliver social or affordable housing. When a conflict of interest between commercial concerns and social goods arises for the LDA, the commercial interests always win out over affordable housing, as was previously the case with NAMA. My question is simple. Can the Government provide examples of the policy outlined in the NESC report being implemented or applied through legislation or anything else it is doing? It seems to be one of the reports that went straight to the top shelf to gather dust. \n Deputy Joan Burton  When the issue of the NESC last arose, it was noted that the legislation governing it appeared to have stalled. It could be a very useful forum for dealing with some of the difficult problems besetting our society. At the time, I raised with the Taoiseach the issue of drugs gangs in Blanchardstown and the report that had recently been issued regarding young children in the area being used as runners by the gangs. Today, a devastating report was published regarding the south city area of Dublin. It delivers a similar message, namely, that drugs gangs are seeking to take on many young children who may become the serious criminals of the next 20 years. They are paid with money, mobile phones, the latest runners and other shoes and so on. Has the Government used or considered using the NESC to bring in a variety of people to talk to it about how drugs are destroying many communities in this city and other areas? The greater Blanchardstown area, which the Taoiseach and I represent, as well as the adjacent areas of Finglas and Cabra, are suffering dreadfully from the scourge of drugs. Has he considered using the NESC as a forum to bring in representatives of the Garda and other organisations to try to make sense of the matter to deal with the drugs problem before it destroys many young lives? \n The Taoiseach  I thank the Deputies for their comprehensive questions.  On climate action, I welcome that Ireland has gone up seven places in the climate action index produced by environmental NGOs. We came from a very low base and, as such, the improvement is not something to celebrate or crow about. However, it indicates measurable progress by Ireland on climate action in the view of NGOs. It is based on data and interviews from 2017 and 2018 and, as such, does not take into account the significant progress in the past year, including the publication and implementation of the climate action plan. When I became Taoiseach, I set the ambition for Ireland to go from being a laggard on climate action to a leader. I am glad we are no longer considered a laggard, although we are certainly not a leader yet. It is good that we are going in the right direction and I am confident that we can become a leader in the years to come. \n Deputy Micheál Martin  What was going on before the Taoiseach was appointed to his current office? What universe was he in? \n The Taoiseach  I acknowledge our electric vehicle targets are ambitious. My understanding is that the starting point for all targets in the climate action plan was the extent to which we needed to reduce our greenhouse gas emissions. The targets must combine to reduce our emissions by approximately 30%. \n Deputy Micheál Martin  What is the evidence base for how we can achieve that? Surely, there must be documentation. \n The Taoiseach  I will provide it if it exists. I am not sure it does. I will check that out.  It is correct that there is a significant surplus in the national training fund. We are liberating some of the surplus. Some €300 million of it was assigned to human capital initiative announced and launched a few weeks ago by me and certain Ministers at an event in Trinity College Dublin. Most of it will go to third level institutions, including institutes of technology, but some will go to apprenticeships. I will have to double check that. We have liberated €300 million from the large surplus in the fund for higher and further education.  On the LDA, as Deputies will be aware, it has been established by statutory instrument but we need to put primary legislation in place to give it full powers and teeth. It has not been decided whether it will be on or off-balance sheet. It may have CPO powers, but the legislation governing such powers is very out of date. We may need to bring in primary legislation to address CPO powers generally rather than another Bill to give an agency some form of CPO power. That area of law needs to be tidied up. The Law Reform Commission has done very good work in that regard.  On land use, the scheme at O'Devaney Gardens is a good example of where we are following the advice contained in the land use report referred to by Deputy Martin Kenny. \n Deputy Martin Kenny  It is the opposite. \n The Taoiseach  It is a high-density housing development on a city centre site involving housing for all and incorporating a mix of social and private housing as well as homes to rent. The Enniskerry Road site, which is our first cost-rental development, is under construction in Dún Laoghaire.  I replied to several questions on the Connolly report earlier today. I will give consideration to whether the NESC could have a role in examining drugs policy and drug-related crime, but the best place for people to come together on that issue is through the existing joint agency response to crime initiative. ",
        "questionType": "oral",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-11",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2019-12-11",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-11/writtens/mul@/dbsect_91.xml"
            }
          },
          "debateSectionId": "dbsect_91",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-11/writtens/dbsect_91",
          "showAs": "EU Budgets"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-11/pq_108",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 108,
        "showAs": " 108. Deputy Micheál Martin asked the Tánaiste and Minister for Foreign Affairs and Trade his views on the severe cuts to defence and climate policy areas in view of the latest draft EU budget plans for 2021 to 2027 for the EU long-term budget; and if he has discussed same with his EU counterparts. [51849/19] ",
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  This week’s European Council will discuss the MFF (Multiannual Financial Framework) on the basis of a revised proposal put forward by the Finnish Presidency. This is the most recent iteration of the draft proposal by successive Presidencies in these complex negotiations, which are likely to continue well into 2020. The Presidency has proposed an overall level of 1.07% of EU27 GNI for the next MFF period 2021-2027 and has maintained or slightly increased the allocations for Cohesion and CAP, which are priority areas for Ireland. To maintain CAP and Cohesion spending at the level proposed by the Commission, the Presidency has proposed adjustments to a range of other programmes, including in the defence area. I am pleased that the revised proposal confirms that at least 25% of the EU budget should be devoted to climate action. The MFF negotiations feature regularly on the agenda of my bilateral meetings with EU counterparts so that we can explain and understand our respective priorities. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-11",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2019-12-11",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-11/writtens/mul@/dbsect_92.xml"
            }
          },
          "debateSectionId": "dbsect_92",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-11/writtens/dbsect_92",
          "showAs": "Northern Ireland"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-11/pq_109",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 109,
        "showAs": " 109. Deputy Micheál Martin asked the Tánaiste and Minister for Foreign Affairs and Trade the status of the implementation of the St. Andrews and Fresh Start agreements. [51853/19] ",
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  Full and effective implementation of the Good Friday Agreement and subsequent Agreements, including the 2006 St Andrews Agreement, the 2014 Stormont House Agreement and the 2015 Fresh Start Agreement, is a key priority for the Government, as reflected in the Programme for a Partnership Government.  Progress in implementing the provisions of the Fresh Start and Stormont House Agreements and outstanding commitments from earlier Agreements are to be considered at Review Meetings, co-convened by the two Governments with the participation of the Executive. Unfortunately, due to the absence of the Executive since early 2017, it has not been possible to convene a Review Meeting since December 2016. Nevertheless, work on implementation has continued as appropriate in each jurisdiction, and to the extent possible in the absence of the Executive.  A key element of the Fresh Start Agreement relates to the ending of the legacy of paramilitarism. On 13 September 2016, the Irish and UK Governments signed an international agreement to establish the Independent Reporting Commission (IRC) and it was subsequently given effect to by legislation in both jurisdictions. The IRC reports annually on progress towards ending continuing paramilitary activity connected with Northern Ireland, and it published its second report on 4 November. This second IRC report is a sobering reminder of the continuing adverse impact that paramilitarism continues to have on society in Northern Ireland and brings an important and timely focus on what remains to be done to tackle it. The IRC has been active in pursuing its remit and has had a wide engagement with a range of relevant stakeholders, both North and South, and I commend the Commission for its valuable work so far and the efforts it has put into fulfilling its mandate.  The Fresh Start Agreement also provided for the establishment of the Joint Agency Task Force on cross-border crime. That Task Force was launched in Dublin in December 2015, and is bringing forward operational actions in the six priority areas that have been agreed as the focus of operations: Rural Crime; Immigration-related Crime; Excise Fraud; Drugs; Financial Crime; and Human Trafficking. These priorities are, of course, kept under review. There has been very considerable operational activity, with a variety of different operations undertaken across all of the priority areas since the establishment of the Task Force. The Joint Agency Task Force is an important example of the extensive and vital North-South co-operation that is undertaken between An Garda Síochána, the PSNI and other law enforcement agencies in both jurisdictions aimed at tackling crime and enhancing the safety of all communities on this island.  The Fresh Start Agreement affirmed the parties’ commitment to implementation of the Stormont House Agreement provisions for dealing with the past. Victims and survivors have had to wait for far too long for a suitable and effective system in Northern Ireland to deal with the legacy of the Troubles. I have engaged extensively with the Secretary of State for Northern Ireland and with all of the political parties to support a way forward to implement the Stormont House Agreement legacy framework. The Government remains firmly committed to the implementation of the Stormont House Agreement legacy framework, and will continue to engage with the next British Government to see this finally achieved.  Under the Fresh Start Agreement, the Government made a number of financial commitments in support of the agreement, including €75m in respect of the construction of the A5 through Northern Ireland, exploring the development of the Ulster Canal and the Narrow Water Bridge, and funding of €2.5m to support the North West Development Fund. The latter commitment has been provided and the others are being progressed, overseen by a group of senior officials from the Government and the Executive as provided for under the Agreement.  A number of elements of the Good Friday Agreement and the St Andrews Agreements have not yet been fully implemented, and the Government also continues to work to see this achieved. This includes the provision in the St Andrews Agreement in 2006 for an Irish Language Act in Northern Ireland to be enacted by the British Government. Regrettably to date, there has been no agreement within the Executive to take forward what is now a devolved matter. In the successive discussions at Stormont that have been held since March 2017 to support the formation of a new Executive, the Government made consistently our support for an Irish Language Act for Northern Ireland, as envisaged under the St Andrews Agreement.  I have engaged extensively with the Secretary of State for Northern Ireland throughout these talks processes to encourage the parties to reach an accommodation. The multi-party inclusive talks process convened by the two Governments in May has included a specific working group to seek to reach agreement on rights, language and identity issues, which have proved intractable to date.  All five political parties have engaged constructively in the talks process over the last number of months and progress has been made across a range of important issues. However, some key outstanding issues remain and finding final agreement on these issues will require genuine and courageous dialogue and leadership by the party leaders in Northern Ireland.  I remain in regular and ongoing contact with Secretary of State Smith on how the two Governments can support the parties in reaching an agreement that will get all of the institutions of the Agreement up and running again. The Secretary of State for Northern Ireland and I have confirmed that the two Governments are ready to take talks in Northern Ireland forward again immediately following the UK general election. It is envisaged that talks will commence as soon as possible after the UK election, potentially on 16 December. This of course depends to some extent on the outcome of the UK election.  People want the devolved power-sharing institutions up and running again to represent their interests and address issues of concern in Northern Ireland at present, including the implementation on an agreed basis of commitments from previous Agreements. The Government will continue to do everything in its power, in accordance with its responsibilities as a co-guarantor of the Good Friday Agreement, to secure the effective operation of all of its institutions and the full and effective implementation of the Good Friday Agreement and subsequent Agreements. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-11",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2019-12-11",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-11/writtens/mul@/dbsect_95.xml"
            }
          },
          "debateSectionId": "dbsect_95",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-11/writtens/dbsect_95",
          "showAs": "Brexit Negotiations"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-11/pq_111",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 111,
        "showAs": " 111. Deputy Micheál Martin asked the Tánaiste and Minister for Foreign Affairs and Trade if he will report on the post-Brexit relationship talks planned as part of the December 2019 Foreign Affairs Council meeting; his policy objectives for same; and if he has met his officials to discuss same. [51850/19] ",
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  The future relationship between the UK and the EU will be discussed at the European Council on 13 December, but was not an item for discussion at the Foreign Affairs Council. It is expected that the European Council will adopt Conclusions on preparations for the negotiations on the future relationship with the UK post 31 January 2020.  While awaiting the outcome of the UK General Election, the EU is preparing for the upcoming negotiations on the future relationship. The EU has indicated it is ready to open negotiations immediately after ratification of the Withdrawal Agreement. These will aim at a broad, deep and flexible EU-UK partnership – with a comprehensive and balanced Free Trade Agreement at its core. To this end, the Commission has established the Task Force for Relations with the United Kingdom, led by Michel Barnier, which will coordinate the Commission’s work on Brexit and establishing the future relationship with the UK. The Task Force will also look at necessary work on the implementation of the Withdrawal Agreement during the transition period.  Ireland wants to see the closest possible relationship between the EU and the UK, while also ensuring adequate level playing field provisions to facilitate fair competition. Work is underway on and elaborating on our priorities for the future relationship negotiations. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-11",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2019-12-11",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-11/writtens/mul@/dbsect_240.xml"
            }
          },
          "debateSectionId": "dbsect_240",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-11/writtens/dbsect_240",
          "showAs": "Cybersecurity Policy"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-11/pq_259",
        "to": {
          "roleType": null,
          "showAs": "Communications",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 259,
        "showAs": " 259. Deputy Micheál Martin asked the Minister for Communications, Climate Action and Environment if he has spoken with EU leaders, particularly of the UK and Italy, regarding the use of technology (details supplied) in view of the reports following the NATO conference held in London recently. [51852/19] ",
        "answerText": " Minister for Communications, Climate Action and Environment  5G (5th Generation) deployment of network technologies is a major enabler for future digital services and a priority for the Digital Single Market strategy. 5G networks represent a technological shift and will provide new opportunities for the economy and society of Europe, enabling innovation and advancement in many key sectors. 5G networks will form part of Europe’s critical infrastructure and underpin key services in sectors such as energy, healthcare, agriculture and transport, and ensuring the cybersecurity of 5G networks is an issue of strategic importance for the EU in the wider context of the ongoing threats posed by cybersecurity incidents.  The European Commission published its Recommendation on the Cybersecurity of 5G Networks on 26th March 2019. The first step of the Recommendation was for Member States to carry out national risk assessments on the cyber security risks affecting 5G networks and to forward these to the European Commission for collation. The National Cyber Security Centre (NCSC) completed this review in respect of Ireland in close collaboration with other EU Members States, including the UK and Italy, EU Institutions, ComReg, and Mobile Telephone Operators in order to ensure that a comprehensive and evidence based review was carried out.  The European Commission will publish an EU toolbox of recommended measures in the coming weeks that will be informed by the outcome of the EU risk assessment. Ireland will continue to contribute towards the development of these measures to address these risks and looks forward its publication. In addition, as part of the 2019 National Cyber Security Strategy, Ireland will be bringing forward a series of measures in relation to 5G security and Critical National Infrastructure. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-11",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2019-12-10",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-10/debate/mul@/dbsect_10.xml"
            }
          },
          "debateSectionId": "dbsect_10",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-10/debate/dbsect_10",
          "showAs": "Cabinet Committees"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-10/pq_7",
        "to": {
          "roleType": null,
          "showAs": "Taoiseach",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 7,
        "showAs": " 7. Deputy Micheál Martin asked the Taoiseach the Cabinet committee at which Israel and Palestine is discussed. [48835/19] ",
        "answerText": " The Taoiseach  I propose to take Questions Nos. 7 to 11, inclusive, together.  Cabinet committees are established to provide focused political oversight of relevant initiatives and developments in policy areas, including in particular where there is a need for co-ordinated action across Departments and agencies. Following a Government decision on 25 July 2019 on the establishment of Cabinet committees, Cabinet committee structures were reorganised. The six Cabinet committees cover the areas of economy; social policy and public services; infrastructure; Brexit, foreign and European affairs; environment; and security.  The Cabinet committee on Brexit, foreign and European affairs was established to ensure a co-ordinated approach in the areas of Brexit, foreign and European affairs, including Global Ireland 2025. The committee met for the first time on 10 September 2019 and met again yesterday, 9 December.  The Tánaiste and Minister for Foreign Affairs and Trade has lead responsibility for matters of foreign policy generally, including relations with Israel and Palestine. The Tánaiste briefs the Cabinet on developments in the Middle East and, when appropriate, it is discussed at Cabinet and was so discussed this morning. \n Deputy Micheál Martin  Is this question about Israel? \n Deputy Brendan Howlin  It is about Israel and Palestine. \n Deputy Micheál Martin  That was not marked on my paper; I thought it was coming later.  The situation in Palestine has got dramatically worse throughout the year. Before the last Israeli general election, Prime Minister Netanyahu followed a strategy of becoming more extreme and anti-Arab by the day. Much of this was, frankly, racist. He was calling on Israeli Jews to be scared of their Arab fellow citizens.  However, he went much further and announced his intention to annex large parts of the West Bank, in particular current settlements and areas around them, should he win the election. This is essentially a plan to prevent any independent Palestinian state from emerging and to consign millions of people to permanent statelessness.  This country and Fianna Fáil have been consistent in supporting a two-state solution with parity of esteem and equality. As I say, the situation has become progressively worse and, quite frankly, it confirms the view of myself and my party, and the rest of the Opposition in this House, that we are correct to say that the time has come to take assertive action against creeping annexation.  The Government has said it opposes the legislation about the settlements that is before the Oireachtas because it is against EU regulations. However, there is no regulation stopping the Government from pushing for changes of policy and demanding action at European level.  I have had discussions with the Tánaiste and Minister for Foreign Affairs and Trade on this matter. The Tánaiste has been unsuccessful in persuading Mr. Netanyahu to moderate his approach and was wildly over-optimistic more than a year and a half ago about the prospects of a peace initiative emanating from the Israeli Government. It is time for this Government to start proposing concrete actions in line with the seriousness of the threat of annexation.  On a separate matter, I have asked, at various times, for details of the likely economic impact of the withdrawal agreement on Northern Ireland. Last week, the UK Labour Party released a leaked document from the UK Treasury which predicted that the impact of new east-west checks on Northern Ireland would be severe. There has been more than enough time to review the issue. Can the Taoiseach tell us if he accepts that the agreement will have a negative impact on Northern Ireland?  I apologise that there are two separate questions covered in that one contribution. \n Deputy Louise O'Reilly  As the Taoiseach will be aware, today, we mark Human Rights Day, the anniversary of the day on which the UN adopted the Universal Declaration of Human Rights 71 years ago. Last week, my colleague, Deputy McDonald, raised with the Taoiseach the routine detention and prosecution of Palestinian children as young as 12 in the Israeli military court system. We know that child detainees have been blindfolded and deprived of sleep, had their hands and feet restrained and have been intimidated and assaulted at the hands of the Israeli military. In his reply, the Taoiseach stated he has not had any engagement with the Israeli Government or Israeli politicians. Was this continued violation of human rights raised by the Tánaiste and Minister for Foreign Affairs and Trade on behalf of the Government when he met the Israeli Prime Minister last week?  It also appears that the Tánaiste did not raise Ireland's opposition to Israel's illegal settlements in occupied Palestine, which are inconsistent with international law. It appears, from media reports, that the Tánaiste instead reassured the Israeli Prime Minister that the Government will not support the Control of Economic Activity (Occupied Territories) Bill that would make trade with illegal settlements a criminal offence in Ireland.  Deputy Boyd Barrett asked the Taoiseach last week if the Government would call on the EU to take action against settlements by imposing meaningful sanctions. The rationale offered up for not doing so was that such a call could not secure the required unanimity to be enforced, yet the Taoiseach has a mechanism for Ireland to impose its own sanctions against Israel's continued flouting of international law through the Control of Economic Activity (Occupied Territories) Bill and he has set his face against it.  Water pollution is not the leading cause of child mortality in Gaza, as the Tánaiste stated last week. The continued barbarism of occupation and the ghettoisation of Gaza is what is killing Palestinian children and their families.  The State increase in investment for Palestine, announced last week, is welcome but the Taoiseach knows as well as I do that it falls far short of what is needed both in monetary and political terms. Will the Taoiseach reconsider his opposition to the Control of Economic Activity (Occupied Territories) Bill and, by so doing, join with others in this Dáil to uphold the rule of binding international law? \n Deputy Richard Boyd Barrett  One of the proudest things that this country ever did on the foreign policy stage was to implement a boycott against apartheid South Africa, prompted by the heroic actions of Dunnes Stores workers. That was done unilaterally. Nelson Mandela and many other leading fighters against apartheid made the point at the time that Ireland had made a unique contribution to bringing down the apartheid regime. Why does the Taoiseach hide behind the coat-tails of the EU and say that we can do nothing because we do not have qualified majority voting, when we took unilateral action against apartheid South Africa?  Israel flouts international law through its treatment of and detention of children. Its criminal siege of Gaza has reduced Gaza to being a place that officially is uninhabitable by human beings. There has been flagrant and brazen annexation of Palestinian territory in contravention of international law. The right to self-determination for Palestinians has been officially cancelled by the Israeli Government. Only people who are Jewish in the land that is Israel or Palestine, whatever one wants to call it, have the right to self-determination. Human and international rights are just gone.  This just goes on and on. Ethnic cleansing is a day-to-day reality for Palestinians. Why will the Taoiseach not take a leaf from the book of the Dunnes Stores strikers and what this country did in response to apartheid South Africa and support sanctions, including Senator Black's Control of Economic Activity (Occupied Territories) Bill? The Taoiseach should support, not block, that Bill and take a lead in calling for and imposing sanctions on the apartheid, racist, repressive and illegal activities of the Israeli state in respect of the Palestinian people. \n Deputy Brendan Howlin  Last week, the Tánaiste and Minister for Foreign Affairs and Trade, Deputy Coveney, stated that we, presumably the Irish Government, would be open to new thinking on the Israel-Palestine peace process. To be specific, in an interview he gave to the Israeli public broadcaster, KAN, he stated:  We will continue to advocate, yes, for new thinking because I think the solution now is probably not the same as what a solution looked like 20 years ago. A lot has happened in that time.  Every Member in this House knows a lot has happened in the past 20 years, most especially the illegal annexation of more Palestinian land by a succession of Israeli governments, led by Benjamin Netanyahu. For clarity, can the Taoiseach tell us the Government's new thinking in respect of the settlement of the Israeli-Palestinian dispute? As a House, we need to be crystal clear that it is no lessening of our total opposition to the illegal annexation of Palestinian land that has gone on unchecked. \n The Taoiseach  The Tánaiste met with the Israeli Prime Minister, Benjamin Netanyahu, and the Foreign Minister, Israel Katz, on Monday, 2 December, during a working visit to Israel and Palestine. During the visit, the Tánaiste also met with a number of Palestinian political leaders including President Abbas and Prime Minister Mohammad Shtayyeh, and a number of UN officials also. The Tánaiste used these meetings to discuss how Ireland can support efforts towards a durable two-state solution to the conflict and to convey Ireland's concerns about the impact of the occupation, including in respect of settlement activity and the blockade of Gaza.  Yesterday, 9 December, the Tánaiste briefed Ministers at the Foreign Affairs Council in Brussels on his visit to Israel and Palestine. He highlighted two specific issues which merit further discussion at EU level - annexation and the need for free elections in Palestine. The Tánaiste is concerned by appalling evidence of creeping annexation in the West Bank. Ireland and the EU's position on Israeli settlements could not be clearer. They are illegal under international law and fundamentally undermine the prospects for a two-state solution.  Israel's violation of human rights and mistreatment of Palestinians was also raised in these meetings.  The Tánaiste also raised the potential for elections in Palestine, which may take place in 2020, and which have not happened for more than a decade. EU members states must encourage Israel to facilitate voting for Palestinians in east Jerusalem also.  Ministers will return to the Middle East peace process in more detail at the January Foreign Affairs Council.  Regarding new thinking, this does not mean any departure from the two-state solution.  Regarding the labelling of products coming from the occupied territories, a French court challenging the rules on the labelling of settlement products was referred to the Court of Justice of the European Union. Ireland, as an interested member state, lodged observations on the case to endorse EU guidelines on the labelling of settlement goods issued in 2015 and appeared at the oral hearing in early April. The court's judgment was issued on 12 November and found that foodstuffs originating in the occupied territories must bear the indication of the territory of origin and when these products originate from a settlement, that must also be made clear on the label. Therefore, a boycott by citizens is possible and indeed by business.  Regarding the Control of Economic Activities (Occupied Territories) Bill, the Tánaiste has set out the Government's position in the Seanad and the Dáil. The Government's opposition to settlements is unequivocal. However, the proposals contained in this Bill go beyond what is in the Government's power to do. Trade is a matter of sole EU competence and that is clear in the treaties. Passage of the Bill would expose the State to legal action and to substantial and recurring damages and no Government could endorse that.  On settlements, we must choose policies which will be effective, are consistent with our position in the EU Single Market and customs union and will not be struck down as illegal, giving comfort to settlers rather than Palestinians. Informal soundings in Brussels indicate that the European Commission agrees that the Bill contravenes EU law as trade is a sole EU competence in the treaties and would take a legal challenge if the Bill was enacted.  On the issue of settlements more widely, all settlement activity is illegal under international law and contrary to Israel's obligations under the fourth Geneva convention on the treatment of civilian population under military occupation. It is also damaging the viability of a future Palestinian state. The Tánaiste spoke with the US ambassador about this matter when he met him on 20 November, shortly after Secretary of State Pompeo's comments. The views of the international community on settlements are extremely clear on this point and are comprehensively expressed in UN Security Council Resolution 2334 but also in many other UN Security Council resolutions. \n Acting Chairman (Deputy Frank O'Rourke)  As there are just over five minutes remaining, I propose to the House that we roll over Questions Nos. 12 to 18, inclusive, to tomorrow as we will not have time to take them. Is that agreed? Agreed. \n Deputy Micheál Martin  I thank the Acting Chairman. Very wise. ",
        "questionType": "oral",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-10",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2019-12-10",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-10/writtens/mul@/dbsect_76.xml"
            }
          },
          "debateSectionId": "dbsect_76",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-10/writtens/dbsect_76",
          "showAs": "Departmental Strategy Statements"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-10/pq_93",
        "to": {
          "roleType": null,
          "showAs": "Taoiseach",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 93,
        "showAs": " 93. Deputy Micheál Martin asked the Taoiseach the progress on reform measures outlined in appendix 1 of the Strategy Statement 2017-2020 of his Department. [51602/19] ",
        "answerText": " The Taoiseach  The details requested by the Deputy on the progress of reform measures outlined in Appendix 1 of my Department’s Strategy Statement are set out in the 2019 Annual Report on the Programme for a Partnership Government. This report is available on the Gov.ie website. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-10",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2019-12-10",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-10/writtens/mul@/dbsect_86.xml"
            }
          },
          "debateSectionId": "dbsect_86",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-10/writtens/dbsect_86",
          "showAs": "Human Rights"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-10/pq_103",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 103,
        "showAs": " 103. Deputy Micheál Martin asked the Tánaiste and Minister for Foreign Affairs and Trade if he will contribute or speak at the next Foreign Affairs Council, FAC, meeting regarding the reports of one million persons being detained in centres in China. [51603/19] ",
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  The situation in the Xinjiang region in China was not on the agenda at the most recent meeting of the Foreign Affairs Council, which took place yesterday, on 9 December.  However, as I have stated on a number of occasions in this House in recent weeks, most recently on 5 December, Ireland and our EU partners remain deeply concerned about the credible reports of the treatment of ethnic Uighurs and other minorities in the Xinjiang region, including arbitrary detentions, widespread surveillance and restrictions on freedom of religious belief.  We have raised our concerns with our Chinese counterparts in both bilateral and multilateral contexts, and, along with other EU partners, will continue to do so in the appropriate fora. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-10",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2019-12-10",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-10/writtens/mul@/dbsect_102.xml"
            }
          },
          "debateSectionId": "dbsect_102",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-10/writtens/dbsect_102",
          "showAs": "Ministerial Meetings"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-10/pq_119",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 119,
        "showAs": " 119. Deputy Micheál Martin asked the Tánaiste and Minister for Foreign Affairs and Trade if he will report on his recent visit to the Middle East; the meetings held; the issues discussed, specifically relating to the funding allocated for solar power plants; and if he will make a statement on the matter. [51604/19] ",
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 119 and 121 together.  Last week, I undertook a three-day working visit to Israel and Palestine, which encompassed a wide range of engagements in Jerusalem, Ramallah, Gaza and Bethlehem. This was my fourth visit to Israel and Palestine as Minister for Foreign Affairs and Trade. I met with key representatives of the Government of Israel and the Palestinian Authority, as well as UN officials from UNRWA, UNTSO and OHCHR, as well as visiting an Israeli community close to Gaza.  The political leaders I met with on the Israeli side included Prime Minister Netanyahu and Foreign Minister Katz. On the Palestinian side, my meetings included President Mahmoud Abbas, Prime Minister Mohammad Shtayyeh and Dr. Saeb Erekat, Secretary General of the Palestine Liberation Organisation. I also met with the Palestinian Minister for Education, Dr. Marwan Awartani, and signed a memorandum of understanding which outlined Irish support for the Palestinian education sector, and with Minister Mazen Ghuneim, head of the Palestinian Water Authority. In all of these meetings I conveyed the importance the Irish people attach to the resolution of the Middle East Peace Process, something that has been a priority for me personally since I took office.  In my meetings with the Israeli authorities, I expressed Ireland’s concerns about the impact of the continuing occupation, including the situation in Gaza, settlement construction and the demolition of properties in the West Bank and actions taken against Palestinians in East Jerusalem.  I had a frank discussion with Prime Minister Netanyahu about actions taken by Israel over recent years which are jeopardising the viability of a two-state solution and thus the prospect of a just and lasting solution to the conflict. I reiterated the EU’s and Ireland’s well known views that settlements are illegal under international law and the urgent need to address the unsustainable situation in Gaza. I discussed how Ireland and the EU can play a constructive role in the MEPP, and outlined Ireland’s commitment to support efforts towards a just and sustainable peace. I also raised Ireland’s concerns about the protection of civil society space.  During my visit to Gaza, I met with secondary school students from an UNRWA school in Jabalia, where I saw first-hand the impact of Ireland’s commitment to supporting quality education for children, including the 282,000 UNRWA students in Gaza. I also met with senior UNRWA officials and discussed the humanitarian situation in the Gaza strip and the operational challenges facing the agency. Ireland is a longstanding supporter of UNRWA in its provision of services to Palestinian refugees. I was pleased to announce that Ireland will provide an additional €2.5 million in funding this year to support the delivery of these core services, bringing Ireland’s total support to UNRWA in 2019 to €7.5 million.  I also visited the Northern Gaza Emergency Sewage Treatment (NGEST) where I met with Minister Mazen Ghunaim to formally launch Ireland’s investment in support of the water sector. Ireland will contribute €8.8 million to a joint project with France to build a 7.5mW solar power plant providing clean, reliable energy to the NGEST wastewater treatment plant. Water pollution is the leading cause of child mortality in Gaza, where critical energy shortages mean that it is particularly difficult to power water treatment facilities.  Ultimately, however, we know that only a political solution can lead to sustainable development in Gaza. I witnessed the effects of the blockade, and the effects that this is having on young people's prospects and hopes, leading to a dangerous sense of despair. We need to see an end to the blockade of Gaza, an end to the cycle of conflict, and an end to the political division between Gaza and the West Bank. I will continue to work to ensure that the Middle East Peace Process remains high on the international agenda. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-10",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2019-12-10",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-10/writtens/mul@/dbsect_106.xml"
            }
          },
          "debateSectionId": "dbsect_106",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-10/writtens/dbsect_106",
          "showAs": "EU Meetings"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-10/pq_125",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 125,
        "showAs": " 125. Deputy Micheál Martin asked the Tánaiste and Minister for Foreign Affairs and Trade if he will report on the December 2019 EU Foreign Affairs Council meeting; the issues that will be discussed; and if he will meet with the new High Representative of the Union for Foreign Affairs and Security Policy and Vice President of the Commission. [51537/19] ",
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  I attended a meeting of the Foreign Affairs Council in Brussels yesterday, Monday 9 December. The meeting was chaired by the newly-appointed High Representative for Foreign Affairs and Security Policy/Vice-President of the Commission, Mr. Josep Borrell.  Under current affairs, Ministers discussed the agenda for the forthcoming European Council, Libya and Hong Kong. Ministers also touched on the Arctic, DRC, Bolivia, Moldova and Transdniestria. Under AOB, I briefed my counterparts on my recent visit to Israel and Palestine which took place from 2 to 4 December.  EU Foreign Ministers discussed the following topics: EU-Africa relations, prior to the forthcoming EU-African Union Ministerial; and Promoting and protecting human rights in the world, particularly in view of Human Rights Day on 10 December. On the former, I intervened highlighting Ireland’s newly launched Africa Strategy and encouraged a more integrated and coordinated approach to the continent. Ministers agreed that we must engage early, often and in a coherent manner with our African partners and focus on the root causes of problems.  On human rights, I noted Ireland’s intention to lead on the civil society space resolution in the Human Rights Council and reiterated Ireland’s support for a proposed EU Global Human Rights Sanctions Regime. The HR/VP tasked the EEAS to take forward work this proposed sanctions regime. There was strong consensus to adopt a visible and joined up action plan on human rights and democracy for 2020-2024.  We also exchanged views with the High Representative/Vice President over lunch on his priorities and vision for his term in office. As well as meeting HR/VP Borrell at the FAC, I have also met with him many times in his previous role as Spanish Foreign Minister and also had the opportunity to talk with him in his new capacity as HR/VP on the margins of the OSCE Ministerial meeting in Bratislava on 5 December. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-10",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2019-12-10",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-10/writtens/mul@/dbsect_107.xml"
            }
          },
          "debateSectionId": "dbsect_107",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-10/writtens/dbsect_107",
          "showAs": "Dublin-Monaghan Bombings"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-10/pq_126",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 126,
        "showAs": " 126. Deputy Micheál Martin asked the Tánaiste and Minister for Foreign Affairs and Trade the status of the work being carried out to implement the all-party motions of 2008 and 2011 relating to the 1974 Dublin and Monaghan atrocities as per the statement of strategy of his Department. [51541/19] ",
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  17 May last marked the 45th anniversary of the appalling attacks of the Dublin and Monaghan bombings in which 33 people were murdered. The Minister for Justice and Equality, Charles Flanagan TD, represented the Government at the remembrance ceremony in Dublin.  The Government stands in solidarity with all those who lost loved ones or were injured on that day, and who suffer still as a result of these bombings.  The implementation of the All-Party Dáil motions relating to the Dublin and Monaghan bombings is a priority for the Government, as highlighted in the Programme for a Partnership Government.  The All-Party motion on the 1974 Dublin and Monaghan bombings adopted by the Dáil on 25 May 2016 has, like those adopted in 2008 and 2011, been conveyed to the British Government. These motions call on the British Government to allow access by an independent, international judicial figure to all original documents relating to the Dublin and Monaghan bombings, as well as the Dublin bombings of 1972 and 1973, the bombing of Kay’s Tavern in Dundalk and the murder of Seamus Ludlow.  The Government is committed to pursuing the implementation of these all-Party Dáil motions. We have consistently raised the issue with the British Government on a bilateral basis, including at the British-Irish Inter-Governmental Conference, most recently on 8 May, and will raise it again at the next Conference.  I and Minister Flanagan have made clear to our counterparts at the Conference that the absence of a response from the British Government is of deep concern to the Government, and that there remains an urgent need for a response. We will continue to engage with the British Government, at senior political level and at official level on this matter, until a resolution is found.  The Government has noted, and welcomes the announcement by the PSNI on 30 November, that former Bedfordshire Chief Constable Jon Boutcher will head an Independent Police Team to conduct an analytical report on collusion into the 'Glenanne Gang' series of cases. This follows a campaign and successful legal action in Northern Ireland and supported by victims' families, North and South, to seek the completion of such a report. The Police Ombudsman for Northern Ireland is also conducting an investigation into collusion around the activities of the 'Glenanne Gang'.  It is to be hoped that these investigations will contribute to the long process of justice, truth and acknowledgement of what happened in these awful cases, where collusion is a feature, including the Dublin and Monaghan bombings, and other attacks in this jurisdiction.  The Government will remain strongly supportive of facilitating these investigations, in accordance with the law, and as we have other investigative processes in Northern Ireland dealing with Troubles cases. The Government will also continue to closely monitor the outcome of all such relevant investigations, as we pursue all possible avenues to achieve progress on the Dáil Motions, and the request made by this House to the British Government.  The Government will also continue to engage on a cross-party basis on this matter and maintain a close and cooperative relationship with Justice for the Forgotten, as we continue work to seek the full facts of the appalling events of 25 May 1974 and of other attacks in this jurisdiction during the Troubles. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-10",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2019-12-10",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-10/writtens/mul@/dbsect_127.xml"
            }
          },
          "debateSectionId": "dbsect_127",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-10/writtens/dbsect_127",
          "showAs": "Tax Agreements"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-10/pq_146",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 146,
        "showAs": " 146. Deputy Micheál Martin asked the Minister for Finance if he has spoken with his EU counterparts recently, particularly since the NATO summit held in London at which the proposed digital sales tax of 2% to be placed on high-tech companies was discussed. [51538/19] ",
        "answerText": " Minister for Finance  The Deputy will be aware that the Commission proposal for an interim Digital Service Tax, which would impose a 3% levy on the turnover of certain companies’ digital activities, failed to find agreement among Member States when it was discussed at ECOFIN in March this year. The focus of the debate on international tax reform has since moved to the OECD, although it continues to be discussed among Member States – both at a technical and political level.  Most recently, an update on the OECD work on tax and digitalisation was on the agenda at ECOFIN on 6 November. All Finance Ministers within the EU remain in agreement that an OECD solution would be preferable to unilateral action by the EU or by Member States.  Ireland remains committed to global tax reform and believes that global solutions are needed to ensure tax is paid by companies where value is created. That is why Ireland has been a committed participant in, and strong supporter of, tax reform efforts led by the OECD through the BEPS process.  My officials are engaged in the latest round discussions taking place at OECD this month on the many outstanding technical issues on the proposals. Ireland will continue to actively contribute to work in the area of the tax challenges of digitalisation at both OECD and EU level. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-10",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2019-12-10",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-10/writtens/mul@/dbsect_215.xml"
            }
          },
          "debateSectionId": "dbsect_215",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-10/writtens/dbsect_215",
          "showAs": "Legislative Reviews"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-10/pq_232",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 232,
        "showAs": " 232. Deputy Micheál Martin asked the Minister for Justice and Equality his views on the recent UN special rapporteur official commentary on the way in which Ireland has been dealing with hate crime and anti-immigrant rhetoric through legislation. [51609/19] ",
        "answerText": " Minister for Justice and Equality  Ireland is a party to the Convention on the Elimination of All Forms of Racial Discrimination and review of the State’s performance before the UN Committee on the Elimination of Racial Discrimination took place last week in Geneva. The State was represented at the Committee by a cross-Departmental group led by Minister of State Stanton. Ireland’s national statement to the Committee was delivered by Minister Stanton at the outset of the review and, in the course of the Committee hearing, further detail on Ireland’s actions in this important area were set out in exchanges with the Committee. I take it the Deputy is referring to the exchanges as part of that review.  I can confirm that my Department is working to update Ireland’s criminal law on both hate speech and hate crime as a priority.  It is important to note that our law already includes provision for prosecution of relevant crimes. Under current law, hate crimes are prosecuted under general criminal law, rather than through a specific 'hate crime' offence. Where a perpetrator has been found guilty of a crime, such as for example assault or criminal damage, a sentencing judge may consider a hate motive to be an aggravating factor that would increase the sentence.  With a view to ensuring that any new legislation in this field is as robust and effective as possible, my Department is currently finalising research on the effectiveness of different legislative approaches to tackling hate crime in other countries. This research will allow us to learn from experience elsewhere and to identify the approach that will work best in Ireland.  When this work has concluded, which I expect to happen within the coming weeks, I plan to incorporate the learning from the research and then bring forward proposals for new hate crime legislation in the new year. These proposals will be published for discussion and an opportunity will be given to experts, communities and the public to share their views.  As the Deputy may be aware, my Department has also been running a public consultation on the separate but related issue of incitement to hatred since October, to gather the views of all stakeholders on how our laws should deal with those who actively seek to promote and encourage hatred and prejudice against vulnerable groups. The consultation remains open until 13 December and I encourage all those who wish to contribute to go to the Department’s website at http://www.justice.ie for further information.  The Deputy will appreciate that it is important that complex legislative measures are well researched and evidence-based. Development of new criminal law in this area is a priority for me as Minister but it is important to ensure that the right to freedom of expression is protected; that any new law is necessary and proportionate; and importantly that any law adopted is effective in practice in dealing with the very real harms caused by hate speech and hate crime.  The Deputy may also wish to be aware that my Department is leading on a number of cross-Government initiatives to tackle racism in Ireland.  The Migrant Integration Strategy published in 2017 sets out the Government's commitment to the promotion of migrant integration and provides a framework for a wide range of actions to support migrants to participate fully in Irish life. It includes actions to promote intercultural awareness and to combat racism and xenophobia - including review of legislation concerning racially motivated crime and hate speech. The Progress Report for the mid-term review of the Migrant Integration Strategy was published earlier this year by my Department and work continues across Government as a whole to achieve its goals.  In relation to the justice sector and in addition to the steps outlined above, my colleague Minister of State David Stanton is in the process of establishing a new Anti-Racism Committee which will include representatives of the public, private and voluntary sectors. This Committee will have a mandate to examine what needs to be done by public sector bodies as well as the wider community to challenge racism.  An Garda Síochána have also taken a number of important steps recently, consistent with the Migrant Integration Strategy. A Diversity and Integrity Strategy has been adopted, including a working definition of hate crime to assist Gardaí in delivering a victim-centred service and ensure that Gardaí respond consistently and robustly to reports of hate crime.  I am confident that the approach being taken - including research and providing the opportunity for experts and members of the public to provide their views through consultation - will help to ensure that the legislation we develop will deliver a safer, fairer and more inclusive Ireland for everyone. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-10",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2019-12-10",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-10/writtens/mul@/dbsect_245.xml"
            }
          },
          "debateSectionId": "dbsect_245",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-10/writtens/dbsect_245",
          "showAs": "Garda Investigations"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-10/pq_269",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 269,
        "showAs": " 269. Deputy Micheál Martin asked the Minister for Justice and Equality the status of the examination by the Garda Commissioner to review the files on a case (details supplied); and if he will make a statement on the matter. [51608/19] ",
        "answerText": " Minister for Justice and Equality  As the Deputy may be aware, the Garda Commissioner met with the family of the late Seamus Ludlow on 2 December last. This murder was a callous and senseless act of random violence perpetrated against an innocent man. I have the utmost sympathy for the Ludlow family who feel the pain of Seamus' loss every day. It is a matter of profound regret that, in common with so many troubles related deaths, nobody has yet been brought to justice for his murder.  The Deputy will be aware that the Barron Commission of Inquiry carried out an extensive investigation into the circumstances of the Seamus Ludlow case and Judge Barron submitted his report to the then Taoiseach in 2004. The report was referred to the Joint Oireachtas Committee on Justice, Equality, Defence and Women's Rights, a sub-committee of which held a series of public hearings and issued a report in March 2006.  It is beyond question that there were serious failures in the original Garda investigation. In the course of the sub-committee hearings, the former Garda Commissioner Pat Byrne, the then Commissioner, Noel Conroy, and the then Minister for Justice, Equality and Law Reform, Michael McDowell, apologised to the Ludlow family for the way in which they had been treated by the Gardaí at the time.  There have been four separate Garda investigations: the initial (and flawed) investigation; in1979/1980; in 1996/1999; and following the Barron Report. The Garda investigation is not closed and if further evidence comes to light that might permit a prosecution, then An Garda Síochána would be in a position to seek that the matter is re-considered by the DPP.  A second Coroner’s inquest into Mr Ludlow’s death was directed by the Attorney General in September 2005, which returned a verdict of unlawful killing.  At the meeting on 2 December, the Garda Commissioner undertook to examine a number of issues of concern to the Ludlow family. I will await the Commissioner's considered view on these matters.  I again extend my deepest sympathies to the Ludlow family. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-10",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2019-12-10",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-10/writtens/mul@/dbsect_378.xml"
            }
          },
          "debateSectionId": "dbsect_378",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-10/writtens/dbsect_378",
          "showAs": "Cancer Screening Programmes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-10/pq_409",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 409,
        "showAs": " 409. Deputy Micheál Martin asked the Minister for Health if he will report on the recent report of a hospital (details supplied); and if he will make a statement on the matter. [51605/19] ",
        "answerText": " Minister for Health  On Tuesday 3 December, the Aggregate Report of the Independent Clinical Expert Panel Review of CervicalCheck, led by the Royal College of Obstetricians and Gynaecologists in the UK, was published on the website of my Department.  The Expert Panel has concluded, based on its overall findings, that for many women who participated in this Review, screening undoubtedly saved their lives, that there is no doubt that the Programme has been successful and that it is working effectively, and that women can have confidence in the CervicalCheck Programme. This is very welcome reassurance in regard to our national cervical screening programme.  A key finding in the report is that, in the case of 308 or 29.8% of the participants, the Review disagreed with at least one of the individual’s original CervicalCheck slide results. Of these, there were 159 cases in which the Expert Panel felt an opportunity to prevent cancer or to detect cancer at an earlier stage may have been missed. The findings in this regard are reflective of the position, as stated by the Panel, that cervical cancer screening will fail to prevent 30-35% of cancers, even in well run programmes.  Colposcopy management was also reviewed in 106 cases, of which 27 were considered suboptimal. The Expert Panel noted that it was inevitable in a review such as this that a small number of cases would be found where practice was suboptimal but were clear that this should not be taken to conclude that colposcopic practice in the CervicalCheck programme is substandard.  I note the findings of the RCOG report in which the Expert Panel noted that colposcopy is an integral component of any cervical screening programme, that colposcopy management was in line with standard practice in the vast majority of cases reviewed and that the Review Team has said that women can have confidence in colposcopy services and in the Programme overall.  Clearly, screening failures have a serious and sometimes devastating impact on the lives of women and their families. The Expert Panel has stated that these are unfortunately inevitable given the limitations of cytology-based screening.  We must do all we can, therefore, to make cervical cancer a rare disease in Ireland. This can be done through a combination of screening and vaccination, together with strong uptake, and this is my priority. HPV vaccination has now been extended to boys as well as girls, and the HSE has committed to introducing HPV primary screening in Q1 next year.  The Report of the Expert Panel contains ten recommendations, and I have written to the HSE in regard to these. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-10",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2019-12-10",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-10/writtens/mul@/dbsect_379.xml"
            }
          },
          "debateSectionId": "dbsect_379",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-10/writtens/dbsect_379",
          "showAs": "Cancer Screening Programmes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-10/pq_410",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 410,
        "showAs": " 410. Deputy Micheál Martin asked the Minister for Health if he will report on the recent resignation of the patient representative from the CervicalCheck steering group; and if he will make a statement on the matter. [51606/19] ",
        "answerText": " Minister for Health  Patient representatives make a significant contribution on an ongoing basis to the work of the Department, the HSE and health agencies. In relation to CervicalCheck, the patient voice has been at the centre of the work underway to address the range of issues arising, and to implement the recommendations of Dr Scally's Scoping Inquiry. I received the resignation of one of the patient representatives on the CervicalCheck Steering Committee at the end of October. I have written to her to thank her for her work, perseverance and dedication and for ensuring the patient voice is at the centre of decision-making. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-10",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    },
    {
      "contextDate": "2019-12-10",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-10/writtens/mul@/dbsect_399.xml"
            }
          },
          "debateSectionId": "dbsect_399",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2019-12-10/writtens/dbsect_399",
          "showAs": "Services for People with Disabilities"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2019-12-10/pq_430",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 430,
        "showAs": " 430. Deputy Micheál Martin asked the Minister for Health when funding will be made available to open a residential care centre (details supplied) in County Monaghan; if he met officials regarding same; and if he will make a statement on the matter. [51675/19] ",
        "answerText": " Minister of State at the Department of Health  The Government is committed to providing services and supports for people with disabilities which will empower them to live independent lives, provide greater independence in accessing the services they choose, and enhance their ability to tailor the supports required to meet their needs and plan their lives. This commitment is outlined in the Programme for Partnership Government, which is guided by two principles: equality of opportunity and improving the quality of life for people with disabilities.  Significant resources continue to be invested in disability services. I am pleased that I have been able to both build upon significant existing resources and to obtain additional funding for disability services in the 2020 Budget. With these additional monies secured, the overall Budget for disability services is in excess of €2billion.  In relation to the building built by Respond in Carrickmacross Co Monaghan, and completed in late 2018, I have been assured by the Health Service Executive (HSE) that it is continuing to work with all relevant parties with regard to the development of the facility. The development of the facility is a service matter for the HSE, and so I have arranged for the question to be referred to the HSE for direct reply to the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/32",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "32nd Dáil",
          "houseNo": "32",
          "houseCode": "dail"
        },
        "date": "2019-12-10",
        "by": {
          "showAs": "Micheál Martin",
          "memberCode": "Micheál-Martin.D.1989-06-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Martin.D.1989-06-29"
        }
      }
    }
  ]
}