{
  "head": {
    "counts": {
      "questionCount": 249,
      "resultCount": 249
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Deputy Simon Harris  I propose to take Questions Nos. 174 and 184 together.  I thank Deputy Clendennen and I know Deputy Byrne has a similar question. Both Future Forty reports, Ireland's Demographic Outlook and A Fiscal and Economic Outlook to 2065, explore the key drivers of Ireland’s economy and public finances over the next 40 years, on a no-policy change basis. We are often accused of short termism in this place. In fairness to the officials in the Department of Finance who worked on this, this is the antidote to short termism, talking about what Ireland might look like, and not predicting it but actually putting a whole variety of different scenarios - about 2,000 of them - out there. It is really the antidote to short termism, saying, here is what Ireland could look like in 2016 on a no-policy change basis.  Developing realistic projections of Ireland’s future population size and demographic profile is a fundamental step in the broader assessment of the long- term drivers of economic growth. The analysis demonstrates how alternative scenarios for future net migration and fertility rates can affect population and demographic projections.  In Future Forty’s central scenario, the old-age dependency ratio is expected to increase - as the Deputy rightly said - from 23% in 2022 to 55% in 2065. These headwinds are unavoidable. However, even in a high migration, high fertility situation, Future Forty finds that the old age dependency rate may increase to 50% by 2065.  While people are thankfully living longer - this is a good thing, by the way - and living more active lives, the ageing population will have significant fiscal impacts for Ireland as age-related spending, including on healthcare and long-term care, increases in line with this change. It will also put downward pressure on our labour force and therefore could suppress economic growth.  The exact path of our future is uncertain; the risks are tilted to the downside.  However, steps can be taken to mitigate these risks and prepare for the challenges ahead. In fact, in the reading of Future Forty, it looks out for 40 years but its basic, simple message is that we have a decade to take the policy decisions that we need to take collectively to future-proof our country.  The Government has already introduced several policies to respond to these challenges. First, the programme of capital investment under the updated national development plan will support productivity growth, including by crowding in private investment. In addition, continued capitalisation of the Future Ireland Fund and the Infrastructure, Climate and Nature Fund will help to offset some of these future pressures. Finally, the rollout of the pension auto-enrolment scheme, which is a very important, transformational measure, will ensure that all eligible workers, for the first time, have supplementary private pension provision, thereby alleviating pressure on the public finances and helping to improve quality of life in retirement.  The key finding from the analysis is that policy development in the coming decade will have a critical bearing on Ireland's long-term living standards. We will all have different views on what those policies could be but Future Forty provides us with an important evidence base and data that will be useful to all of us in our work. This window of opportunity must be used to improve efficiencies, boost our resilience and implement key structural reforms in order to raise productivity. It is only by implementing policy action on all of these fronts that we can ensure long-term economic, fiscal and environmental sustainability.  My Department, alongside the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation and the Department of the Taoiseach, is committed to developing potential enhancements to better integrate long-term strategic planning more systematically into policymaking. Future Forty will be central to this process.  The report is on a “no policy change” basis. Of course, there will always be policy changes. The question for all of us is whether it is informed, intelligent and evidence-based policy. Crucially, the report looks at the advancement of technology, whether it be AI or other developments, and what that will do to productivity. What will it do in terms of being able to improve our access to healthcare as we age, hopefully with dignity, in our country? Future Forty is a very important piece of work that provides, in a way that I have not seen before in these Houses, a treasure trove of information, data and various scenarios that can help all of us - Government and Opposition - in planning for the future of our economy and society. \n Deputy John Clendennen  I agree with the Tánaiste that long-term forecasting models are very welcome. When we look at some of the measures we have introduced already, like the Future Ireland Fund and saving for days of pressing future financial demands, the question is whether we are doing it at a fast enough pace. Regularly, in this Chamber, we hear negative connotations and associations concerning migration. This report is very clear regarding our dependence on growing our labour force and economy, and who is going to play a vital role in ensuring that materialises. When we see a forecasted increase of 2.5 times in the old-age dependency rate in the next 40 years, it is startling to think of what we will have to do in this space in the coming years. I ask the Tánaiste to commit to publishing a clear, multi-annual demographic and fiscal strategy so we can continue to monitor this on an ongoing annual basis. \n Deputy Malcolm Byrne  This is an incredibly important report, as the Tánaiste said. I welcome the fact that he acknowledges the role of AI and technology, and how it may change our lives. It is worthy of a full debate in the House. Given the statistics we are looking at, by 2041, on current projections, there will be 1.4 million people aged 65 and older, and by 2065, there will be 2 million people aged 65 and older, triple the number at present.  This is of particular interest to the Tánaiste, given he is probably the youngest in the Chamber, so he will have to keep working to fund all of our pensions. The pension issue is certainly something we will need to address. We need to look at how we are designing our communities and societies. It is critical that we engage with older people’s representatives around that. I have asked the Tánaiste before about keeping people healthier as they get older, and the commitments within the programme for Government for tax relief for gym membership, which is critical. \n Deputy Pearse Doherty  I agree with the Minister on the need to look long-term in the projections. When looking so far ahead, there are huge variances but we need to look beyond one year.  I recall that in his first speech as leader of Fine Gael, the Minister promised that a five-year tax strategy would be published by the end of last year. I cannot find that anywhere. Is it on the Fine Gael website, the Department of Finance website or the Department of the Taoiseach website? Will the Minister outline where that five-year tax strategy is? For the life of me, I cannot find it anywhere. \n Deputy Simon Harris  I thank Deputy Doherty for reminding me. Once we publish the medium-term fiscal framework, which will set out the expenditure trajectory to the end of the decade, it will enable me, in my new role, to look at that. \n Deputy Pearse Doherty  That is not a tax strategy. \n Deputy Simon Harris  What I can tell the Deputy is that the trajectory of the tax bands for the coming years is what is outlined in the programme for Government. I look forward to debating that with the Deputy in the months and, God willing, years ahead.  I thank Deputy Doherty for acknowledging this. The Future Forty document is not my document or the Deputy’s document. It is genuinely something that we should all embrace. It is produced by very able and informed officials and economic experts in the Department of Finance. It is as much for the Opposition as the Government; it is as much for the Oireachtas as the Executive. It will, no doubt, provide us with a useful debating tool, and hopefully inject, from everybody's perspective, a degree of evidence into all of the things that all of us say in these Houses, which the public rightly expect.  Are we doing it at a fast enough pace? That is a very fair question from Deputy Clendennen. An objective answer is probably “No”. More broadly, there are very significant megatrends, as they call them in the document, coming at us. There are huge opportunities within that, and there are also huge challenges. We have taken a number of important steps, such as the establishment of what could effectively be sovereign wealth funds. The Future Ireland Fund and the Infrastructure, Climate and Nature Fund are important steps, and running budgetary surpluses is helpful. The NDP provides clarity and €275.4 billion of funding out to 2035, and that it runs for longer than the lifetime of this Government is good.  I will come back to the issue of gyms. Deputy Byrne is right regarding what we can do to positively age. We are not powerless when we look at this document. We are all going to get older but we can get older and stay healthy. What can we do from a policy, health service and technology point of view to help make that more of a reality? On the issue of taxes for gyms, we look at all matters in the context of the budget. I would also point out that there are lots of ways you can keep fit out in the fresh air too. \n Deputy John Clendennen  One point in relation to funds is that the strength of deposits in Ireland on a domestic and international basis must be noted. The registration of auto-enrolment on 1 January is a big step forward. It is certainly welcome. Given the objective that it is set to achieve, it is going in the right direction. I have one ask. There is an element of apprehension, particularly among small businesses, about affordability and viability in this space. It is something we will have to monitor very closely in order to protect small businesses. I made the point at committee yesterday that there is now a situation where small businesses on high streets and in small villages are competing with multinational corporations. We need to get the balance right with regard to the demands. Nonetheless, it is definitely a worthwhile initiative. We also need to ensure that people who want to work later in life can do that and be rewarded for it, from a financial need or social well-being perspective. Those are initiatives that we need to look at as well. \n Deputy Malcolm Byrne  I agree with Deputy Clendennen on auto-enrolment. It is essential, but it is important that we take on board the concerns of SMEs.  It is very welcome that we now have life expectancy of 83 in this country. It is a huge success that we are at that point. One of the challenges is that we age healthily. In Singapore, as part of the old age package, admission to community gyms and swimming pools is free for those over 65. There is a commitment in the programme for Government to tax relief for gym membership in order to promote strength training. What is critical is that we ensure that those who are in their 40s and 50s, and then in their 60s, 70s, 80s and 90s, can remain healthy.  It is critical to engage with organisations like the National Older People's Council, and I know Kevin Molloy in my own area is regularly raising issues around this. We need to involve older people in the discussions on these issues as well. \n Deputy Simon Harris  I was certainly not being flippant about the programme for Government commitments. I do not want anyone holding off on staying healthy until future budgets. These are issues that we will, of course, consider in the round, as we always do in advance of the budget.  I was in Millstreet in west Cork recently to visit a community gym that is part-funded through Government grants. It was great to see. I was on the same rowing machine that now-President Connolly had been on when she was campaigning. It is the most famous rowing machine in Ireland because the President was on it, and they are very proud of that fact. It is a great community gym. It is an example of communities working together to create healthy communities and help themselves age in a good way.  Deputies Clendennen and Byrne referred to auto-enrolment. I was talking to the Swedish minister in Brussels the other day.  I think this is something they did in Sweden many decades ago. It is a transformational decision. I accept that it is going to be a little difficult for people. We are asking people and employers to put a little aside at a challenging time, knowing it will create provision for them as they age above and beyond the State pension. The communications campaign is important, making sure everybody knows how it works and the obligations on everybody. I have heard good media engagement on that recently. It is important we keep that up. I am conscious of the pressures on small and medium businesses as I know the Deputy is. There will be different views in this House on this. We have taken a number of measures to try to assist with that, including the 9% VAT rate, the new timeline for the living wage and the decision not to expand the statutory sick scheme further beyond five days. I accept there are different views on those decisions in the House, but they were taken in recognition of the reality that when we have a bright idea in here, we do not always have to pay for it; it is the business that does. Auto-enrolment really needs to happen. As it rolls out, we will continue to engage and listen. We will look back long after we are all gone and say this was a really important moment to protect low-income workers in particular as they age. Future Forty suggests there will be many more low-income workers ageing and living longer, healthier lives in the future. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 174. Deputy John Clendennen asked the Tánaiste and Minister for Finance his long-term strategy for ensuring the sustainability of public finances given the demographic pressures outlined in the Department of Finance's Future Forty: Ireland's Demographic Outlook, which projects an increase in the old-age dependency ratio from 23.1% in 2022 to 55.2% by 2065; and if he will make a statement on the matter. [69735/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "showAs": "John Clendennen"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_40",
          "debateSectionId": "dbsect_40",
          "showAs": "Departmental Reports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_40.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_174",
        "questionNumber": 174
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Ireland’s first National Financial Literacy Strategy was published by the Minister of Finance in February this year.  The focus of the five-year Strategy is to improve levels financial literacy by working with Ireland’s financial literacy ecosystem – increasing cooperation, coordination and cohesion among stakeholders – and thereby supporting greater overall financial wellbeing and resilience.  My Department worked closely with a range of public and private sector organisations throughout the Strategy’s development. This included educators, the financial services industry, civil society and Government Departments and agencies. This engagement continues as we now implement the Strategy.  At the same time as the Strategy as published, my Department also launched:  • an Action Plan to support the implementation of the Strategy in 2025;  • a website to provide information about the National Financial Literacy Strategy and relevant research at www.financialliteracy.ie; and  • guidelines for the financial services industry delivering financial education in schools.  The 2025 Action Plan sets out actions stakeholders have agreed to take to fulfil the Strategy's aims and objectives. Work is underway to review the 2025 Action Plan and to develop a new action plan for 2026/2027, which I expect to be published early next year. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 199. Deputy John Clendennen asked the Tánaiste and Minister for Finance the position regarding the National Financial Literacy Strategy; and if he will make a statement on the matter. [69736/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "showAs": "John Clendennen"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_213",
          "debateSectionId": "dbsect_213",
          "showAs": "Departmental Strategies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_213.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_199",
        "questionNumber": 199
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  In line with the programme for government commitment, the Education Therapy Service (ETS) has been established as a critical and important support for children and young people in their school environment. The ETS is an additional support for children with special education needs. It is to supplement and not replace existing children’s health and disability services. It is intended to commence initially in specials schools and rollout over time to special classes and mainstream schools.  As mentioned, it is anticipated that the service will commence in 45 special schools at a later stage in the 2025/26 school year.  The selection process to identify schools for inclusion in the initial phase is ongoing and being informed by engagement with our colleagues in the HSE and the National Council of Special Education (NCSE). Factors may include the designation of each special school and current therapy supports available within the special school. It is anticipated that school selection for the initial phase will be complete early in 2026 to ensure that selected schools have the opportunity to engage with the ETS prior to therapist assignment.  Further roll out of the service will occur on a phased basis with a wider roll-out in special schools commencing in the 2026/27 school year. I am conscious where there are 129 special schools that there will be disappointment for those schools not in the initial phase, but it is important to remember this is the start of a new initiative which will see all schools benefit in the coming years.  In the interim schools have access to the NCSE regional therapy support, which provides Teacher Professional Learning (TPL) with follow on/implementation support. These seminars are available nationally for the 2025/2026 school year.  My Department and the National Council for Special Education (NCSE) are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 104. Deputy John Clendennen asked the Minister for Education and Youth the process by which the 45 special schools will be selected to take part in the education therapy service which is due to commence in special schools in the 2025-2026 school year; and if she will make a statement on the matter. [69838/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "showAs": "John Clendennen"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_126",
          "debateSectionId": "dbsect_126",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_126.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_104",
        "questionNumber": 104
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The Ancillary Services Grant is payable to recognised primary schools and special schools in the Free Education Scheme. The grant is intended to cater for the cost of employing Secretarial and Caretaking staff. It is up to the BOM to allocate this funding as per their priorities. As per Circular 0040/2009 the capitation grant provided for general running costs and the ancillary services grant provided for Secretarial and Caretaking services may be regarded as a common grant from which the Board of Management can allocate according to its own priorities.  After Forsa accepted the Workplace Relations Commission (WRC) agreement about salaries and leave for grant-funded school secretaries, the secretaries who accepted the agreement were added to the Department of Education and Youth’s payroll from September 2023. Because of this, the ancillary-related grant funding has been updated, since schools are no longer paying these salaries directly.  Since the 2023/24 school year, schools have been paid the usual ancillary grant amount, minus the amount that schools previously paid to grant-funded secretaries prior to their acceptance of the new terms and conditions. Schools provided the Department with these details and this information is now being used to reduce the ancillary-related grant funding. Schools should be in no way disadvantaged by this, as the grant is reduced only by the amount they previously paid to their secretaries.  To date we have issued correspondence to schools with details of the arrangements for each interim period since September 2023.  In some situations, the salaries of ancillary staff in a particular school may have been higher than the ancillary grant due to the school, and the school may have funded this difference via other revenue streams. In situations where the salary that a school was paying their secretary was higher than the ancillary grant due to the school, prior to them being added to the Department of Education and Youth’s payroll, then the ancillary grant is reduced to NIL. This should not impact the school’s financial position.  For the specific school mentioned the ancillary grant has been reduced to NIL as the salary the school was previously paying their secretary, prior to moving to the Department’s payroll, was higher than the ancillary grant available to the school prior to reductions being applied. The level of funding available to the school for ancillary staff, including their caretaker, has not changed as the school is no longer funding the salary of the secretary.  The rate of ancillary services grant has not decreased and continues to be paid based on the relevant enrolments in the school multiplied by the rates set out in [ Circular 0017/2021. ]As the grant is based on the enrolments, the amount paid to a school may fluctuate as enrolments increase or decrease from year to year.  Work is ongoing to identify a method of standardising the reduction to the ancillary-related grants for the longer term where school secretaries are being paid on the Department’s payroll. Note the reductions may change when a permanent model for ancillary-related grant reductions has been finalised. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 196. Deputy John Clendennen asked the Minister for Education and Youth the options available to a school (details supplied) to meet the costs of caretaking services when in receipt of NIL ancillary services grant; and if she will make a statement on the matter. [69837/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "showAs": "John Clendennen"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_219",
          "debateSectionId": "dbsect_219",
          "showAs": "School Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_219.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_196",
        "questionNumber": 196
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  The National Parks and Wildlife Service (NPWS) of my Department currently maintains Memoranda of Understanding (MoUs) with a range of partner organisations across the public, voluntary and community sectors. These MoUs support cooperation, information-sharing, and the effective delivery of services. A full list of organisations with which the NPWS has an MoU in place is set out below:  NatureScot  Dublin Zoo  Kerry Biosphere Reserve  Dublin Bay Biosphere Partnership  Community Wetlands Forum  Dublin Zoo  Marine Institute  Coillte  Peatland Foundation Ireland  Fota Wildlife Park  National Botanic Gardens of Ireland (Office of Public Works).  BirdWatch Ireland  Department of Climate, Energy and the Environment  EPA  The Minister for Agriculture, Food and the Marine  ISPCA  Dublin Mountains Partnership 2021 to 2025  The Altabrocky Syndicate  Clare County Council  The PURE Project and the Dublin Mountains Partnership  University of Galway – Carran Field Study Centre  Old Irish Goat Society  Irish Natural Stone & National Built Heritage Service  Yeats Thoor Ballylee Society  Galway University  Galway University & Galway University Foundation - National Park Ecology Bursaries  An Garda Síochána  NARGC  All existing MoUs are regularly reviewed to ensure that agreements remain current, proportionate, and aligned with statutory requirements and organisational priorities.  The review process involves the following stages:  Internal Assessment: Examination of each MoU’s purpose, scope, and operational relevance.  Stakeholder Engagement: Consultation with the partner organisations to obtain their views on the relevance, effectiveness, and future direction of the MoU.  Drafting and Revision: Updating the terms of the MoUs where necessary to reflect current practice, governance standards, and legislative obligations.  Approval and Publication: Finalisation of the revised MoUs, followed by approval through the NPWS’s governance structures.  Partner organisations are engaged with directly as part of the relevant review, with opportunities provided for comment, clarification, and contribution to any proposed revisions. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 233. Deputy John Clendennen asked the Minister for Housing, Local Government and Heritage to provide a list of all organisations which the National Parks and Wildlife Service (NPWS) has a Memorandum of Understanding (MoU) in place with; if all of the MoUs with these organisations are subject to the current review of MoUs being undertaken by NPWS; the process and timeline for the reviews; the way in which the organisations are to be involved in the reviews; and if he will make a statement on the matter. [70587/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "showAs": "John Clendennen"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_184",
          "debateSectionId": "dbsect_184",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_184.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_233",
        "questionNumber": 233
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Investment and expenditure on sports facilities in both primary and post-primary schools is an element of the overall expenditure and investment in the School Building Programme. The provision of GP rooms and PE Halls, at primary and post primary level respectively, and outdoor hard play areas, form part of the accommodation brief for all new school buildings. This is also the case where a major building or refurbishment project is being delivered for an existing school as part of the department’s large-scale building programme. Almost 95% of the post primary schools that made 2020 Annual Schools Returns have indicated to my department that they either have a PE Hall, access to a nearby PE Hall, or a project in train that will deliver a new PE Hall. Practically all schools have outdoor play areas, and many schools use adjacent local facilities, including community halls, public parks, playing fields and swimming pools.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. 111 of these were large scale school projects all of which would have included extensive accommodation including outdoor play areas. In July, the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan.  All Government departments are expected to publish their sectoral NDP Implementation Plans shortly. My department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. Funding will also be invested to support curricular delivery and well-being across schools by prioritising the development of Physical Education halls and sporting facilities for schools in conjunction with the Sports Capital Fund to deliver for both schools and communities. This will also further support the increasing roll-out of PE as a leaving-certificate subject for post-primary schools. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 463. Deputy John Clendennen asked the Minister for Education and Youth to provide an update on the investment in PE halls and GE rooms in schools; the way in which this aligns with embedding physical activity in daily teaching practices; and if she will make a statement on the matter. [70354/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "showAs": "John Clendennen"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_412",
          "debateSectionId": "dbsect_412",
          "showAs": "School Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_412.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_463",
        "questionNumber": 463
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 179 and 180 together.  Under the terms of the EU VAT Directive, which Irish VAT law is obliged to comply, it is generally held that all goods and services are liable for VAT at the standard rate as determined by Member States, where Ireland applies a standard rate of 23%. In addition Member States may set up to two reduced rates. Ireland currently has two reduced VAT rates of 9% and 13.5%.  Goods and services of a kind specified under Annex III of the Directive may see a reduced rate of VAT applied. The supply of gas and electricity has historically been charged at the reduced rate of 13.5% by availing of a provision within the Directive that allowed Member States to maintain historic VAT treatment of specified goods and services. Ireland previously availed of this historical derogation for the supply of gas and electricity and the use of home heating products including home heating oil. A key condition of availing of this derogation is that a VAT rate must be parked at a rate of no lower than 12%.  Following four years of negotiation, in 2022 Annex III was expanded to include the supply of gas and electricity whereby Ireland can now apply the second reduced rate of 9%. This measure has continued to be extended with the latest extension announced in Budget 2026 to be applied until the end of 2030. Home heating oil is not included in this list and there is no scope to extend a VAT rate of 9% to its supply.  It is also not possible to provide for a VAT refund or rebate for users of home heating oil. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 179. Deputy John Clendennen asked the Tánaiste and Minister for Finance the reasoning for the decision in Budget 2026 to retain the 9 per cent VAT rate for domestic gas and electricity but not to apply a corresponding reduced VAT rate to home heating oil, especially for households that do not have access to the gas network; and if he will make a statement on the matter. [68128/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "showAs": "John Clendennen"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_163",
          "debateSectionId": "dbsect_163",
          "showAs": "Budget 2026",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_163.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_179",
        "questionNumber": 179
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 179 and 180 together.  Under the terms of the EU VAT Directive, which Irish VAT law is obliged to comply, it is generally held that all goods and services are liable for VAT at the standard rate as determined by Member States, where Ireland applies a standard rate of 23%. In addition Member States may set up to two reduced rates. Ireland currently has two reduced VAT rates of 9% and 13.5%.  Goods and services of a kind specified under Annex III of the Directive may see a reduced rate of VAT applied. The supply of gas and electricity has historically been charged at the reduced rate of 13.5% by availing of a provision within the Directive that allowed Member States to maintain historic VAT treatment of specified goods and services. Ireland previously availed of this historical derogation for the supply of gas and electricity and the use of home heating products including home heating oil. A key condition of availing of this derogation is that a VAT rate must be parked at a rate of no lower than 12%.  Following four years of negotiation, in 2022 Annex III was expanded to include the supply of gas and electricity whereby Ireland can now apply the second reduced rate of 9%. This measure has continued to be extended with the latest extension announced in Budget 2026 to be applied until the end of 2030. Home heating oil is not included in this list and there is no scope to extend a VAT rate of 9% to its supply.  It is also not possible to provide for a VAT refund or rebate for users of home heating oil. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 180. Deputy John Clendennen asked the Tánaiste and Minister for Finance his plans to offset the higher VAT rate on home heating oil for households that do not have access to the gas network; and if he will make a statement on the matter. [68129/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "showAs": "John Clendennen"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_163",
          "debateSectionId": "dbsect_163",
          "showAs": "Budget 2026",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_163.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_180",
        "questionNumber": 180
      },
      "contextDate": "2025-12-02"
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 181. Deputy John Clendennen asked the Minister for Education and Youth if her attention has been drawn to the case of a school (details supplied); her views on whether on the appropriateness of same; if action can be taken in the short-to-medium term to mitigate this; and if she will make a statement on the matter. [66551/25] ",
        "answerText": " Minister for Education and Youth  The school to which the Deputy refers to occupies temporary accommodation at present and was approved for a major building project to address its permanent needs. The brief for the project is the development of a new 12 classroom special school for pupils with special education needs, on Department owned lands. In addition to the 12 general classrooms, the new school design includes a library area, a Home Economics Room, an Art room, Daily Living Skills and Practical Activity rooms, a GP room and therapy spaces.  This major project is being delivered under the Department's ADAPT Programme. The ADAPT Programme uses a professional external Programme Manager to co-ordinate and drive the Design Team to achieve the best possible timeframe for the project through the stages of Architectural Planning and on to Tender and Construction. The project has been approved to progress to Stage 2(b) of Architectural Planning – Detailed Design, where all statutory approvals are secured, and the suite of tender documents are prepared. The Design Team have recently secured planning permission and will now progress with detailed design and complete Stage 2B.  Pending provision on their new school building, my Department will continue to support the school with their interim accommodation needs and it is open to the school authority to contact the department in this regard. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_181",
        "debateSection": {
          "showAs": "Departmental Data",
          "debateSectionId": "dbsect_170",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_170.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_170"
        },
        "date": "2025-11-26",
        "questionNumber": 181,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "John Clendennen",
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29"
        },
        "questionType": "written",
        "to": {
          "showAs": "Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 239. Deputy John Clendennen asked the Minister for Justice, Home Affairs and Migration if his attention has been drawn to the case of a school (details supplied); her views on whether on the appropriateness of same; if action can be taken in the short-to-medium term to mitigate this; and if he will make a statement on the matter. [66552/25] ",
        "answerText": " Minister for Justice, Home Affairs and Migration  The Probation Service Office is situated at Kilcruttin Business Park, Cormac Street, Tullamore, Co. Offaly, R35V9P3 in a premises leased by the OPW. I am advised that a case has been made to the OPW to relocate the office. The OPW have identified suitable accommodation and the plan is for Probation Services to relocate once the premises has been fitted out. In the meantime, the Probation Service has regard to child protection and safeguarding issues in organising its engagement with offenders at its current location.  Nationwide, the Probation Service shares office accommodation with other Government Agencies such as Revenue, Agriculture, Food and Marine, and the Department of Social Protection. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_239",
        "debateSection": {
          "showAs": "Departmental Data",
          "debateSectionId": "dbsect_219",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_219.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_219"
        },
        "date": "2025-11-26",
        "questionNumber": 239,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "John Clendennen",
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29"
        },
        "questionType": "written",
        "to": {
          "showAs": "Justice",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "question": {
        "showAs": " 26. Deputy John Clendennen asked the Minister for Housing, Local Government and Heritage if the Office of Emergency Planning has reviewed plans for responding to heavy snow; and if he will make a statement on the matter. [60219/25] ",
        "debateSection": {
          "showAs": "Emergency Planning",
          "debateSectionId": "dbsect_61",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_61",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_61.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "John Clendennen",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "memberCode": "John-Clendennen.D.2024-11-29"
        },
        "questionNumber": 26,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 26 and 44 together.  My Department is designated as the 'Lead Government Department', set out in the Government approved Strategic Emergency Management (SEM) Framework (2017), in relation to the coordination of a response to severe weather, including flooding and snow, and certain other emergencies at national level where warranted. Other Departments have lead roles in respect of other specific types of emergencies, as set out in the SEM Framework.  My Department's National Directorate for Fire & Emergency Management (NDFEM) undertakes this function for exceptionally severe weather events, working closely with Local Authority Severe Weather Assessment Teams and Met Éireann. At a national level, my Department is responsible for the co-ordination of the ‘whole-of-Government’ response, facilitating collective decision making and ensuring aligned public safety messaging among a broad range of departments, organisations and groups who have a role to play in the emergency scenarios under its remit.  Local authorities are designated as a principal response agency as well as being 'lead agency' for coordinating the response to severe weather, as per the Government decision relating to the “Framework for Major Emergency Management” (2006).  The arrangements for emergency management have evolved and, when called upon, are seen as having worked well, in particular the responses to flooding, heavy snow and other severe weather events, as well as to fire and other emergencies led by local authorities. All local authorities have Severe Weather/ Flood Plans in place to support the response to weather emergencies. Local authorities also have a Severe Weather Assessment Team in place, monitoring Met Éireann weather warnings and OPW and EFAS flood advisory/ warnings and High Tide Advisories.  In preparation for Winter 2025/26, I called a special meeting of the membership of the National Emergency Co-ordination Group on 2 October, attended by all members including the local authorities, where each sector outlined their preparations for the winter season.  My Department has also reviewed all local authority Severe Weather and Flood Plan, and organised a workshop earlier this month to support the continued development of these plans and to confirm winter preparedness. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_26",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 44. Deputy John Clendennen asked the Minister for Housing, Local Government and Heritage if the Office of Emergency Planning has reviewed plans for responding to flooding; and if he will make a statement on the matter. [60218/25] ",
        "debateSection": {
          "showAs": "Emergency Planning",
          "debateSectionId": "dbsect_61",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_61",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_61.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "John Clendennen",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "memberCode": "John-Clendennen.D.2024-11-29"
        },
        "questionNumber": 44,
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 26 and 44 together.  My Department is designated as the 'Lead Government Department', set out in the Government approved Strategic Emergency Management (SEM) Framework (2017), in relation to the coordination of a response to severe weather, including flooding and snow, and certain other emergencies at national level where warranted. Other Departments have lead roles in respect of other specific types of emergencies, as set out in the SEM Framework.  My Department's National Directorate for Fire & Emergency Management (NDFEM) undertakes this function for exceptionally severe weather events, working closely with Local Authority Severe Weather Assessment Teams and Met Éireann. At a national level, my Department is responsible for the co-ordination of the ‘whole-of-Government’ response, facilitating collective decision making and ensuring aligned public safety messaging among a broad range of departments, organisations and groups who have a role to play in the emergency scenarios under its remit.  Local authorities are designated as a principal response agency as well as being 'lead agency' for coordinating the response to severe weather, as per the Government decision relating to the “Framework for Major Emergency Management” (2006).  The arrangements for emergency management have evolved and, when called upon, are seen as having worked well, in particular the responses to flooding, heavy snow and other severe weather events, as well as to fire and other emergencies led by local authorities. All local authorities have Severe Weather/ Flood Plans in place to support the response to weather emergencies. Local authorities also have a Severe Weather Assessment Team in place, monitoring Met Éireann weather warnings and OPW and EFAS flood advisory/ warnings and High Tide Advisories.  In preparation for Winter 2025/26, I called a special meeting of the membership of the National Emergency Co-ordination Group on 2 October, attended by all members including the local authorities, where each sector outlined their preparations for the winter season.  My Department has also reviewed all local authority Severe Weather and Flood Plan, and organised a workshop earlier this month to support the continued development of these plans and to confirm winter preparedness. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_44",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 310. Deputy John Clendennen asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the details of any planned schedule of works for Garda stations in County Offaly, in 2026; the stations in the county for which works are planned; the nature and scope of those works; the anticipated timelines for commencement and completion in each case; and the estimated cost of each project; and if he will make a statement on the matter. [66259/25] ",
        "debateSection": {
          "showAs": "An Garda Síochána",
          "debateSectionId": "dbsect_304",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_304",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_304.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "John Clendennen",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "memberCode": "John-Clendennen.D.2024-11-29"
        },
        "questionNumber": 310,
        "answerText": "",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Public Expenditure",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_310",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 612. Deputy John Clendennen asked the Minister for Social Protection the number of persons who have claimed the benefit payment for 65-years-olds, in each of the past five years, in tabular form; and if he will make a statement on the matter. [66257/25] ",
        "debateSection": {
          "showAs": "Departmental Data",
          "debateSectionId": "dbsect_553",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_553",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_553.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "John Clendennen",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "memberCode": "John-Clendennen.D.2024-11-29"
        },
        "questionNumber": 612,
        "answerText": " Minister for Social Protection  The Jobseekers Benefit Payment for 65-Year-Olds was introduced in February 2021. The number of recipients of the payment as of the end of each year from 2021 to 2024, along with the number of recipients as of the end of October 2025 are set out in the table below.     -    2021    2022    2023    2024    Oct-2025       Recipients     3,696    4,198    3,952    4,378    4,324      ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Social",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_612",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 691. Deputy John Clendennen asked the Minister for Justice, Home Affairs and Migration the process and timeline for giving effect to amendments to the Personal Injuries Guidelines; if he will commit to formal stakeholder consultation in advance of publication of the Bill; if the general scheme will be referred for pre-legislative scrutiny by the Oireachtas Joint Committee on Justice; and if he will make a statement on the matter. [66256/25] ",
        "debateSection": {
          "showAs": "Legislative Measures",
          "debateSectionId": "dbsect_615",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_615",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_615.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "John Clendennen",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "memberCode": "John-Clendennen.D.2024-11-29"
        },
        "questionNumber": 691,
        "answerText": " Minister for Justice, Home Affairs and Migration  On the 17 September, as required by section 7 of the Judicial Council Act 2019, I laid the revised personal injury guidelines before the Houses of the Oireachtas.  Prior to the laying of the documents, I consulted Ministerial colleagues and the Attorney General in relation to the proposed increase in award amounts contained in the Judicial Council’s proposals. While there were concerns that any delay in the adoption of new guidelines could lead to the courts being invited to depart from the guidelines and to seek higher awards reflecting the effect of inflation, to be applied at the discretion of the Court, I was also conscious of concerns raised in relation to potential inflationary pressures.  Therefore, it is my intention not to bring a Resolution before the Houses seeking the approval of the guidelines at this time. In effect, this means that the amended Guidelines cannot come into effect and the existing Guidelines will remain in place. In addition, I have received Government approval to draft a general scheme of a Bill to amend the Judicial Council Act 2019 to make reviews of the Personal Injuries Guidelines more comprehensive and transparent. The General Scheme of the Bill will be referred for Pre-Legislative Scrutiny. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Justice",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_691",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 118,
        "showAs": " 118. Deputy John Clendennen asked the Minister for Transport the total investment in bus services in each county in each of the years since 2016; and if he will make a statement on the matter. [63405/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "John Clendennen",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "memberCode": "John-Clendennen.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_118",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_76",
          "showAs": "Bus Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_76",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_76.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators.  In light of the NTA’s responsibility in this area, I have forwarded the Deputy's question to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 137,
        "showAs": " 137. Deputy John Clendennen asked the Minister for Transport the amount spent by central Government on greenways since 2016; and if he will make a statement on the matter. [63406/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "John Clendennen",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "memberCode": "John-Clendennen.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_137",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_95",
          "showAs": "Greenways Provision",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_95",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_95.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to national and regional greenways. The planning, design and construction of the Greenways programme, is a matter for Transport Infrastructure Ireland (TII), in conjunction with the relevant local authority concerned.  The below table outlines spending only from the Department of Transport on national and regional greenways from 2016 to 2024 (figures are rounded to the nearest million). Funding may also be provided by other Government Departments/initiatives to help develop greenway infrastructure; however, the Department of Transport provides the majority of investment in this area.      Capital Expenditure on Greenways      Total (rounded to the nearest million)       2016    €2M      2017    €5M      2018    €3M      2019    €10M      2020    €8M      2021    €28M      2022    €42M      2023    €50M      2024    €70M      2025    Not available at this time      ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "oral",
        "answerText": " Deputy James Geoghegan  What progress has been made by the Department on the creation of an operational AI regulatory sandbox by 2 August 2026, in line with the EU AI Act? \n Deputy Alan Dillon  As Deputy Geoghegan is aware, the EU Artificial Intelligence Act entered into force in August 2024 and provides a harmonised regulatory framework for AI systems developed or deployed in the EU. It is designed to provide a high level of protection to people's health, safety and fundamental rights, while simultaneously promoting the adoption of human-centric, trustworthy AI. Its provisions will start to apply in a phased manner over the period to August 2027.  Earlier this year, the Government agreed to adopt a distributed model of competent authorities, leveraging the State's established sectoral regulatory authorities, to carry out supervisory and enforcement roles for the purposes of the AI Act. The Department is leading across government on the national implementation of the AI Act, and officials are working closely with colleagues in other Departments to devise the optimal configuration of a national competitive authority for the Act to ensure comprehensive, robust and effective implementation in Ireland.  To date, 13 public bodies have been designated as market surveillance authorities and four as notifying authorities, with some of these public bodies having a dual role. The Department of Enterprise, Tourism and Employment has also been designated to act as Ireland's single point of contact, as required by the AI Act, to facilitate co-ordination and to provide a number of centralised functions for the distributed model until a new independent entity, the AI office of Ireland, is established on a statutory basis to carry out this role.  As Deputy Geoghegan noted, the AI Act stipulates that member states should ensure their competent authorities establish at least one AI regulatory sandbox at national level to be operational by 2 August 2026. The AI Act introduces AI regulatory sandboxes as a key mechanism to foster innovation. They should aim to enhance legal certainty for innovators and the competent authorities' oversight and understanding of the opportunities, emerging risks and impacts of AI use.   Additional information not given on the floor of the House.   They should facilitate regulatory learning for both authorities and businesses. The participation in the AI regulatory sandbox should focus on issues that raise legal uncertainty for providers and prospective providers to innovate, experiment with AI in the European Union and contribute to evidence-based regulatory learning.  The AI office of Ireland will act as the central co-ordinating body for the EU AI Act and provide a focal point for the promotion and adoption of transparent and safe AI in Ireland to ensure that we fully capture the strategic opportunity that AI presents. The office will also be responsible for ensuring the timely establishment of the national AI regulatory sandbox.  It is important to note that in addition to preparing practical guidance to support member states setting up national sandboxes, the European Commission is also required to adopt implementing acts for sandboxes, setting out principles regarding participation, co-operation and procedures. Officials are actively involved in EU working groups related to these matters and we await the first drafts of these proposals from the Commission, which are expected in the first quarter of 2026.  The Department will continue to engage with the European Commission, other member states, industry, the SME sector and our regulators to look for opportunities to help inform and shape preparations and to identify opportunities to collaborate in establishing an operational AI regulatory sandbox. \n Deputy James Geoghegan  I thank the Minister of State for the reply. He indicated the establishment of the AI office will be crucial in respect of the regulatory sandbox. I look forward to primary legislation being introduced on this and to it coming before the Committee on Artificial Intelligence, of which I am Vice Chair. One of the things that struck me when we were in Estonia recently at a digital summit was just how far ahead some other EU countries are in the adaptation of AI. What the Department is doing in respect of ensuring small businesses in the enterprise sector can stay competitive by harnessing the benefits of AI is a model that other countries could emulate. Beyond the Department of enterprise, we could go a lot further. I am heartened to hear there is a lot of cross collaboration taking place in respect of the establishment of the AI office. Does the Minister of State agree that the forthcoming EU Presidency could create a great opportunity for Ireland, given that we have lot of the large language model, LLM, companies based here, to have an AI summit to promote the benefits of AI and what it could bring to this country? \n Deputy Alan Dillon  I thank Deputy Geoghegan for his interest in the AI Act. There are questions here today and certainly his welcome for the AI office is crucial. The Minister, Deputy Burke, allocated more than €1.4 million for its establishment, with the staffing plan now in place, and to ensure the sandbox is operational by August next year, which is not far away. We are also working with the EU digital innovation hubs and CeADAR to provide technical expertise and support for businesses. We need to continue to ensure the AI office can be functional in this time. For us, the sandbox is not another bureaucratic hurdle; it is certainly a tool that can support SMEs on their innovation journey. They can test AI systems safely, reduce compliance uncertainty and speed up market access. We have a good story to tell in regard to new start-ups in the AI sector. We want to become a leader among many competitive members in the EU to ensure we are at the fore of AI regulation. This initiative is very important on that journey. \n Deputy James Geoghegan  In the enterprise sector, work is under way and has been done historically in Ireland when it comes to attracting investment and technology companies here. Now we see in Ireland the work Enterprise Ireland has done in supporting the hyper scaling of technology companies and start-ups. We saw some measures in the budget and, hopefully, there are more to come in future to support the emergence of an indigenous technology industry here. Some of the steps we have taken could be adapted in other Departments. Perhaps we could see the leading role this Department is taking in other spheres, such as health and education. We can look at what other EU countries are doing. The hosting of the EU Presidency by Ireland presents a unique opportunity. A number of years ago when Estonia held the Presidency it created a digital summit. We could demonstrate that we are the lead in class when it comes to the regulation of AI and we could harness some of the benefits that are coming. \n Deputy Alan Dillon  I agree with Deputy Geoghegan. It will be an important opportunity when Ireland takes over the Presidency to showcase our SMEs, the work we are doing in the AI sector and the steps we are taking in the Government. The AI office will have statutory independence, reporting annually to the Oireachtas and the AI committee. It will also co-ordinate regulators under a clear governance structure. Ireland has a long track record with regard to regulation and the integrity of the system we implement in many sectors, not only in technology but also in life science and medtech. We are a very attractive place to do business due to our regulations and our principles on integrity, justice and transparency. This is very important from an EU perspective as it gives us a competitive advantage. We want to ensure that participation in the AI Act allows us to have this openness and equal access to treatment among member states. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_4",
        "debateSection": {
          "debateSectionId": "dbsect_6",
          "showAs": "Artificial Intelligence",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/debate/dbsect_6",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/debate/mul@/dbsect_6.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Enterprise"
        },
        "questionNumber": 4,
        "by": {
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "showAs": "John Clendennen"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 4. Deputy John Clendennen asked the Minister for Enterprise, Tourism and Employment the progress being made by his Department on creating an operational AI regulatory sandbox by 2 August 2026, in line with the EU AI Act 2024; and if he will make a statement on the matter. [62583/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  As the Deputy will be aware, the EU Artificial Intelligence Act (Regulation (EU) 2024/1689) entered into force in August 2024 and provides a harmonised regulatory framework for AI systems developed or deployed in the EU. It is designed to provide a high level of protection to people’s health, safety, and fundamental rights and to simultaneously promote the adoption of human-centric, trustworthy AI. Its provisions will start to apply, in a phased manner, over the period to August 2027.  The AI Act introduces AI regulatory sandboxes as a key mechanism to foster innovation. An AI regulatory sandbox is a controlled framework set up by a competent authority which offers providers, or prospective providers, of AI systems the possibility to develop, train, validate and test, where appropriate in real-world conditions, an innovative AI system, in accordance with a sandbox plan for a limited time under regulatory supervision.  The AI Act stipulates that member states competent authorities must establish, and have an AI regulatory sandbox operational, by August 2026.  Throughout the process of developing the AI Act, consideration has been given to the circumstances and needs of SMEs. Member States must provide priority access to the AI regulatory sandboxes for SMEs as well as establish dedicated channels for communication to support SMEs throughout their development journey by providing guidance and responding to queries about the implementation of this Regulation.  My department is leading across Government on the national implementation of the AI Act and my officials are working closely with colleagues in other departments to devise the optimal configuration of national competent authorities for the Act to ensure comprehensive, robust and efficient implementation in Ireland.  Earlier this year, Government agreed to adopt a distributed model of competent authorities for the AI Act, leveraging the State's established sectoral regulatory authorities to carry out supervisory and enforcement roles. This approach recognises the capacity and expertise currently within the Irish regulatory system and enables us to position Ireland as a centre of regulatory excellence.  To date, thirteen public bodies have been designated as market surveillance authorities and four as notifying authorities under the Act, with some bodies having dual roles. Government also agreed to establish a new statutorily independent entity, the AI Office of Ireland, to facilitate coordination and provide centralised functions for the distributed model, including serving as the Single Point of Contact with the European Commission.  The AI office will act as the central co-ordinating body for EU AI Act and provide a focal point for the promotion and adoption of transparent and safe AI in Ireland, to ensure that we fully capture the strategic opportunity that AI presents. The office will also be responsible for ensuring the timely establishment of the national AI Regulatory Sandbox.  It is important to note that the European Commission is required to adopt implementing acts for sandboxes, setting out principles regarding participants selection criteria, application process, participation procedures and the general terms and conditions applicable to participants; first drafts are expected in Q1 2026.  In addition, the European AI Board has established a dedicated subgroup to support and expediate the role out of AI regulatory sandboxes across the EU. My officials are actively participating on the subgroup and contributing to the drafting process of the implementing acts.  A national AI regulatory sandbox will play a pivotal role in fostering responsible AI by balancing innovation with ethical and regulatory compliance. It will offer Irish businesses a controlled environment to innovate and test new AI technologies, products, and services under regulatory supervision, and will facilitate compliance with regulations before they are placed on the market. This will be particularly beneficial for SMEs and startups, which often lack regulatory compliance resources and expertise.  Building further on the current National AI Strategy, the forthcoming National Digital and AI strategy is expected to identify measures that enable Ireland position itself as the best location for development of responsible AI. One of its strategic actions is expected to be the role of the AI Office to ensure the establishment an AI regulatory sandbox to foster innovation in AI; to provide legal certainty for investors; and to facilitate regulatory learning. This also aligns with the Programme for Government 2025 commitment which aims to ensure that Ireland is a leader in digital economy and AI.  I would like to assure the Deputy that the Government is fully committed to the comprehensive and timely implementation of all aspects of the AI Act, including the establishment of the national AI regulatory sandbox. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_241",
        "debateSection": {
          "debateSectionId": "dbsect_251",
          "showAs": "Enterprise Support Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_251",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_251.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Enterprise"
        },
        "questionNumber": 241,
        "by": {
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "showAs": "John Clendennen"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 241. Deputy John Clendennen asked the Minister for Enterprise, Tourism and Employment the anticipated engagement and support mechanisms his Department intends to provide for Irish enterprises and innovators participating in the forthcoming AI regulatory sandbox; and if he will make a statement on the matter. [62584/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": "",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_330",
        "debateSection": {
          "debateSectionId": "dbsect_321",
          "showAs": "Departmental Data",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_321",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_321.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Housing"
        },
        "questionNumber": 330,
        "by": {
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "showAs": "John Clendennen"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 330. Deputy John Clendennen asked the Minister for Housing, Local Government and Heritage to provide a breakdown of homelessness figures by nationality, including Irish, EU, and non-EU citizens; and if he will make a statement on the matter. [62653/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 382 and 383 together.  My Department has been unable to provide a response to this question within the prescribed timeframe. A response will issue directly to the Deputy in the coming days. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_382",
        "debateSection": {
          "debateSectionId": "dbsect_365",
          "showAs": "International Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_365",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_365.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Justice"
        },
        "questionNumber": 382,
        "by": {
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "showAs": "John Clendennen"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 382. Deputy John Clendennen asked the Minister for Justice, Home Affairs and Migration the number of individuals currently availing of the higher daily expense allowance; the number of those who have been offered accommodation and declined it; and if he will make a statement on the matter. [62650/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 382 and 383 together.  My Department has been unable to provide a response to this question within the prescribed timeframe. A response will issue directly to the Deputy in the coming days. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_383",
        "debateSection": {
          "debateSectionId": "dbsect_365",
          "showAs": "International Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_365",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_365.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Justice"
        },
        "questionNumber": 383,
        "by": {
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "showAs": "John Clendennen"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 383. Deputy John Clendennen asked the Minister for Justice, Home Affairs and Migration whether individuals who decline offers of accommodation continue to retain eligibility for the higher daily expense allowance; and if he will make a statement on the matter. [62651/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Justice, Home Affairs and Migration  I am fully committed to ensuring that Ireland’s International Protection system is robust, and rules based, and that our borders are protected.  The number of International Protection applications have been rising over the past number of years, reaching 18,500 in 2024. This year, we are beginning to see application numbers noticeably reduce with 35% fewer compared with the same period in 2024.  It is a priority for my Department to have recommendations made on all international protection applications as soon as possible. This gives status to those who are entitled to international protection to rebuild their lives here, while also ensuring faster decision making in respect of those who do not meet the criteria.  There has been a significant increase in investment into the international protection system which, combined with digitisation and process reengineering, has facilitated a major increase in processing capacity.  This investment has already demonstrated results. In 2024 the International Protection Office (IPO) delivered over 14,000 first decisions compared to over 8,500 in 2023, while the International Protection Appeals Tribunal (IPAT) closed around 3,100 appeals in 2024 compared to over 1,700 in 2023. To date in 2025 the IPO has delivered over 17,000 first instance decisions, a 48% increase on the same period in 2024.  The overall median processing time for first instance decisions was 16 months in 2024 and is currently 14 months in 2025. The current processing time for applications under the accelerated process is four months.  In 2025, as of 31 October, the International Protection Appeals Tribunal (IPAT) has received 12,133 appeal cases. The current median processing time at IPAT is 12.7 months.  My Department also continues to focus on preparing for the EU Migration and Asylum Pact in advance of June 2026. The Pact will provide a fair, sustainable and efficient asylum procedure. This will be achieved through convergence in asylum practices across the EU including standardised processing times for decisions: six months for a standard procedure, three months for accelerated and border procedures and two months for processing applicants who have applied for protection elsewhere in Europe.  The General Scheme of a new International Protection Bill to give effect to the measures of the EU Migration and Asylum Pact was approved by Government on 29 April 2025. The General Scheme has been published and referred to the Oireachtas Committee on Justice, Home Affairs and Migration for pre-legislative scrutiny. The drafting of the Bill is underway.  Enactment of the Bill and commencement of the Act is required by 11 June 2026. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_384",
        "debateSection": {
          "debateSectionId": "dbsect_366",
          "showAs": "International Protection",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_366",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_366.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Justice"
        },
        "questionNumber": 384,
        "by": {
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "showAs": "John Clendennen"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 384. Deputy John Clendennen asked the Minister for Justice, Home Affairs and Migration the average processing time for applications for international protection at each stage of the process; and if he will make a statement on the matter. [62652/25] "
      }
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_124",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "John Clendennen",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "memberCode": "John-Clendennen.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_127",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_127",
          "showAs": "State Bodies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_127.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Climate",
          "roleCode": null
        },
        "showAs": " 124. Deputy John Clendennen asked the Minister for Climate, Energy and the Environment the current status of his Department’s plan to increase the staff headcount of the CRU; and if he will make a statement on the matter. [60216/25] ",
        "questionNumber": 124,
        "answerText": " Minister for Climate, Energy and the Environment  The Commission for Regulation of Utilities (CRU) is an independent regulator, accountable to a committee of the Oireachtas.  While CRU is financed by means of a levy on regulated entities, it must receive approval from myself, as Minister, and the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation, in consultation with the Department of Housing, Local Government and Heritage, for any increase in its overall staff sanction.  CRU’s Strategic Workforce Plan 2025-2027 was submitted to my Department for consideration seeking consent for various proposed increases in staffing levels across the organisation. The consent request is currently under consideration, in line with the relevant required governance processes. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_131",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "John Clendennen",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "memberCode": "John-Clendennen.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_135",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_135",
          "showAs": "Solar Energy Guidelines",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_135.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Climate",
          "roleCode": null
        },
        "showAs": " 131. Deputy John Clendennen asked the Minister for Climate, Energy and the Environment the number of Government-owned buildings which have been retrofitted with solar panels; and if he will make a statement on the matter. [60217/25] ",
        "questionNumber": 131,
        "answerText": " Minister for Climate, Energy and the Environment  I propose to take Questions Nos. 131 and 134 together.  There is currently a range of measures in place to support the rollout of solar panels on public buildings. The Non-Domestic Micro-generation Scheme provides capital grants for non-domestic applicants, including public buildings, for solar PV installations up to 1000kW, primarily for self-consumption, with grant levels up to a maximum of €162,600 available. This scheme is administered by the Sustainable Energy Authority of Ireland (SEAI).  Solar PV is also supported as one of a range of measures under the SEAI's Community Energy Grant Scheme as part of the Government's National Retrofit Programme. This scheme supports cross-sectoral and community-oriented partnership approaches that deliver energy savings to a range of building types, including public, commercial and community buildings. In addition, over 2,000 schools have installed free solar PV systems under the Schools Photovoltaic Programme. The overall number of Government-owned buildings which have been retrofitted with solar panels is not collected by my Department. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "School Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_358.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_358",
          "debateSectionId": "dbsect_358"
        },
        "to": {
          "showAs": "Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Education and Youth  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In addition, over 200 SEN Repurposing projects have been delivered maximising the use of existing accommodation while creating opportunities for inclusion and integration. Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  Over 1,300 Large Scale, Additional Accommodation and Modular school building projects completed between 2020 and to date in 2025. In addition, over 200 SEN Repurposing projects delivered maximising the use of existing accommodation while creating opportunities for inclusion and integration. The current status of all projects is listed on a county by county basis at www.gov.ie and this is updated on a regular basis to reflect project progress through the various stages of capital appraisal, site acquisition, design, tender and construction. A comprehensive list of all live ASA projects for Offaly schools is attached along with a record of all ASA project completions for Offaly schools from 2015 onwards. It is currently not possible at the design or tender stage to give the Deputy a timeframe as to when school projects will go to construction as progress depends upon many contingent factors.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  My department is now preparing an NDP implementation plan which is due for publication later in the autumn. This plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.   ASA Ongoing Listing Sept25    ASA Completions Listing Offaly 2015 to Sept 2025  ",
        "questionType": "written",
        "showAs": " 442. Deputy John Clendennen asked the Minister for Education and Youth for a list of additional school accommodation projects approved for County Offaly in each of the past ten years, 2015-2025; the date of their completion; if not yet completed, their current status and expected completion date; and if she will make a statement on the matter. [57429/25] ",
        "questionNumber": 442,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "John Clendennen",
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_442"
      }
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  I recognise that third level education can be a significant cost for families and students.  Introduced in the 2023/24 academic year, the €500 Student Contribution Grant has had a significant impact, with over 18,000 students receiving the grant in the 2024/2025 academic year. These are students who previously would never have qualified for any form of grant support.  In Budget 2026 I was delighted to be in a position to bring in the first permanent reduction to the Student Contribution Charge reducing the charge from €3,000 - €2,500 this academic year.  In addition, I secured funding to increase the threshold to avail of the €500 Student Contribution Grant from €115,000 - €120,000. This will come into effect in September 2026. Combined with the permanent fee reduction, this means that eligible undergraduate students whose households earning are under €120,000 will pay no more than €2,000 towards the student contribution charge in the 26/27 academic year.  As this is a demand led scheme it is not possible to determine how many people will apply as a result of this measure. It is estimated that there may be over 2000 families eligible between the income brackets of €115,000 - €120,000. However, beyond this, there may be many thousands of other students who are eligible to apply for the €500 grant who have not yet applied. Students are encouraged to check out www.susi.ie to consider whether they may be eligible for support. ",
        "by": {
          "showAs": "John Clendennen",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "memberCode": "John-Clendennen.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "date": "2025-10-16",
        "questionNumber": 42,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/dbsect_77",
          "debateSectionId": "dbsect_77",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/mul@/dbsect_77.xml"
            }
          },
          "showAs": "Grant Payments"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-16/pq_42",
        "showAs": " 42. Deputy John Clendennen asked the Minister for Further and Higher Education, Research, Innovation and Science the number of third level students who will benefit from increasing the SUSI income threshold from €115,000 to €120,000; and if he will make a statement on the matter. [55739/25] "
      },
      "contextDate": "2025-10-16"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  In recent years, supported by strong government investment, the apprenticeship system has grown significantly. Annual craft apprenticeship registrations have risen 63% from 4,377 in 2020, the year in which my department was formed, to 7,113 in 2024. In the same period Consortia-led registrations have grown from 949 to 2,239.  This investment has also supported a 34% growth in the number of apprenticeship programmes available from 58 to 78. There are now 25 craft apprenticeship programmes and 53 consortia-led programmes designed to serve industry needs across multiple sectors such as construction, ICT, hospitality, health, and social care - supporting Ireland both economically and socially. Work is ongoing to expand apprenticeship options further, with new programmes in development.  Next year we will launch the Action Plan for Apprenticeship 2026–2030, setting a target to increase annual apprentice registrations from 9,352 in 2024 to 12,500 by 2030. Stakeholder consultations on the new Plan are scheduled to commence shortly. With the significant investment I secured in Budget 2026 bringing the total funding for apprenticeship to over €400 million, a strong foundation has been laid from which to further expand the apprenticeship system, including through additional recruitment to support the delivery of training and achieve the 12,500 target by 2030.  The information requested is not readily available and will be supplied to the Deputy as soon as possible. ",
        "by": {
          "showAs": "John Clendennen",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "memberCode": "John-Clendennen.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "date": "2025-10-16",
        "questionNumber": 74,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/dbsect_110",
          "debateSectionId": "dbsect_110",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/mul@/dbsect_110.xml"
            }
          },
          "showAs": "Apprenticeship Programmes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-16/pq_74",
        "showAs": " 74. Deputy John Clendennen asked the Minister for Further and Higher Education, Research, Innovation and Science the number of people currently employed to provide training to apprentices, by apprenticeship programme; and if he will make a statement on the matter. [55738/25] "
      },
      "contextDate": "2025-10-16"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  The Community Centre Investment Fund (CCIF) has provided some €110 million since 2022 for the enhancement and refurbishment of existing community centres and the construction of new centres.  I am committed to delivering further iterations of the scheme in the coming years in line with the commitment in the Programme for Government for this to become a permanent rolling fund. A decision in relation to the timing of further iterations and the measures to be included will be made in the context of the management of ongoing commitments under the fund. This will also include a decision as to the extent to which the scheme focuses on refurbishment of existing centres or the development of new ones.  My Department also supports community facilities with enhancement works through a range of other funding streams including through the CLÁR programme, LEADER and the Town and Village Renewal Scheme. I would encourage organisations to check my Department’s website for information on funding opportunities and announcements. ",
        "by": {
          "showAs": "John Clendennen",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "memberCode": "John-Clendennen.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "date": "2025-10-16",
        "questionNumber": 101,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/dbsect_124",
          "debateSectionId": "dbsect_124",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/mul@/dbsect_124.xml"
            }
          },
          "showAs": "Community Development Projects"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-16/pq_101",
        "showAs": " 101. Deputy John Clendennen asked the Minister for Rural and Community Development and the Gaeltacht when the Community Centre Investment Fund will be open to applications; and if funding for new builds is being considered such as in the Community Centres Investment Fund 2023-New Builds Measure; and if he will make a statement on the matter. [55737/25] "
      },
      "contextDate": "2025-10-16"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  I propose to take Questions Nos. 106, 109 and 132 together.  Administered by my Department, The Rural Regeneration and Development Fund (RRDF) is a major capital programme that supports the revitalisation of rural Ireland. It supports large-scale, ambitious projects that can achieve sustainable economic and social development in towns, villages and outlying areas with a population of under 10,000 people.  The RRDF forms just one part of a wider suite of funding streams within my Department's Rural Development Investment Programme which are aimed at supporting rural communities. Last week I announced a further €20.5 million in RRDF funding for 30 Category 2 projects across rural Ireland. Details of these projects can be found on the Department’s website.  Calls for RRDF applications are sought under two categories;  • Category 1 relates to larger scale ambitious capital projects with all necessary planning and other consents in place and which are ready to proceed.  • Category 2 provides smaller grant funding to enable the development of project proposals suitable for future calls for Category 1 applications.  RRDF applications are assessed on a competitive basis and against transparent criteria. Each call for proposals details the objective of the call and the eligibility criteria applying to project applications. This information, together with the scoring system upon which the assessment process will be undertaken, is made widely available at the outset of each call. Examples of previous criteria under which applications have been assessed include the proposed project’s social and economic impact, regenerative potential, financial sustainability, policy coherence and climate action measures.  Whilst RRDF applications are assessed on a competitive basis, the geographic spread of current RRDF projects demonstrates countrywide coverage across all RRDF projects approved to date. Details and locations of these projects can be found on the Department’s website.  Subject to the prevailing scheme parameters and eligibility criteria, a project which may not have been deemed successful following an application and assessment process, may be submitted in a subsequent call for proposals.  I can confirm my intention to launch a further call for proposals for larger scale Category 1 RRDF projects before the end of the year. The scheme parameters and eligibility criteria that will apply under this call will be made available as they are finalised and an application window will be open for a number of months to facilitate the development of high quality applications.  The Programme for Government has committed to increase the RRDF fund I will ensure that the RRDF can continue to support high quality and transformational projects across rural Ireland in line with the objectives of Our Rural Future and the Town Centre First policy . ",
        "by": {
          "showAs": "John Clendennen",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "memberCode": "John-Clendennen.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "date": "2025-10-16",
        "questionNumber": 132,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/dbsect_129",
          "debateSectionId": "dbsect_129",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/mul@/dbsect_129.xml"
            }
          },
          "showAs": "Rural Schemes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-16/pq_132",
        "showAs": " 132. Deputy John Clendennen asked the Minister for Rural and Community Development and the Gaeltacht if any revision of the eligibility criteria for the Rural Regeneration and Development Fund is being considered to ensure more towns can apply; and if he will make a statement on the matter. [55736/25] "
      },
      "contextDate": "2025-10-16"
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Departmental Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_140.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_140",
          "debateSectionId": "dbsect_140"
        },
        "to": {
          "showAs": "Enterprise",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  The Finance for Scaling Implementation Strategy is currently being finalised and Minister Burke expects to bring this to Government shortly, after which it is expected to be published.  The Strategy is a key milestone of the Department's ongoing work to implement the recommendations of the Report: \"The use of finance as a catalyst to develop a scaling ecosystem\", which was published in July 2024.  That Report identified a suboptimal market for capital to finance enterprises at scale-up stages and recommended that both the size of available capital be increased and the quality of the scale-up financing ecosystem in Ireland be enhanced with new policy measures. Specifically, the Report made high-level recommendations to (i) provide more State capital (ii) incentivise private capital to invest more at the scaling stage and (iii) review taxation to incentivise founders and investors to grow businesses. Those recommendations required further work to be developed into concrete proposals for action.  To realise these recommendations into concrete actions, the Finance for Scaling Implementation Working Group was established under the direction of a High-Level Oversight Group and informed by both an Expert Advisory Panel and an independent quantitative market study.  This market study commissioned by the Department and published in July 2025: “Market Demand for and Supply of Scaling Finance in Ireland” was undertaken by SQW Economic Research Consultants who conducted a market analysis to define and quantify the scaling finance gap. The findings of this study along with the wider policy context are expected to be included in the Strategy.  For the market to deliver effective outcomes for Ireland’s Scale-up firms, the Finance for Scaling Implementation Strategy is expected to describe a two-phased approach, with immediate market interventions to provide capital to the market initially. It is also expected to outline the continuance of the work to investigate and develop policy actions to incentivise private capital to invest more at the scaling stage. ",
        "questionType": "written",
        "showAs": " 137. Deputy John Clendennen asked the Minister for Enterprise, Tourism and Employment to provide an update on the expected timeline for finalisation and publication of the planned Scaling for Finance Implementation Plan; the issues to be addressed in the plan; and if he will make a statement on the matter. [55924/25] ",
        "questionNumber": 137,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "John Clendennen",
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_137"
      }
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Small and Medium Enterprises",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_142.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_142",
          "debateSectionId": "dbsect_142"
        },
        "to": {
          "showAs": "Enterprise",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister of State at the Department of Enterprise, Trade and Employment  Ireland has a strong start-up ecosystem, but scaling remains a challenge due to limited access to finance.  In July 2025, Minister Burke published the Report ‘Market Demand for and Supply of Scaling Finance in Ireland’, which identified a €1.1 billion funding gap for deals from €3 million and Series A+ rounds over the next 3–5 years.  To address these and broader challenges the Department of Enterprise, Tourism and Employment is finalising a Finance for Scaling Implementation Strategy. This Strategy will align with the commitments outlined in the Programme for Government and supports the specific actions set out in the Action Plan on Competitiveness and Productivity.  The purpose of the Strategy is to move towards an ecosystem in which firms will have a reliable range of funding options throughout their enterprise journey. The Strategy will present a two-phased approach, with immediate market interventions to provide capital to the market in Phase One, including through an Enterprise Scaling Fund, administered by Enterprise Ireland.  The exact design features of the fund are currently being developed by my Department and Enterprise Ireland to have the fund in place as soon as possible. This work will be progressed over the coming months to have the fund in place in 2026.  It is important to note that the Enterprise Scaling fund is only part of a suite of instruments, to be delivered across two phases that will work to enhance the ecosystem and consequently reduce the gap in the market. The second Phase will develop policy actions to further incentivise private capital to invest more at the scaling stage. ",
        "questionType": "written",
        "showAs": " 138. Deputy John Clendennen asked the Minister for Enterprise, Tourism and Employment the measures being proposed by Government to enhance access to finance for scaling Irish SMEs, including in the context of additional funding provided in Budget 2026; and if he will make a statement on the matter. [55925/25] ",
        "questionNumber": 138,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "John Clendennen",
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_138"
      }
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_166.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_166",
          "debateSectionId": "dbsect_166"
        },
        "to": {
          "showAs": "Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Education and Youth  The school referred to by the Deputy was approved to enter the departments pipeline of school buildings for a project to provide a 3 classroom SEN Base.The project was devolved to the school for delivery.  Approval to proceed to Stage 2b (developed design) was granted in April 2024. In June 2025, the Design Team advised they were finalising design elements and preparing tender documentation. The Department is currently awaiting the Stage 2b pre-tender report.  Once received, the report will undergo a detailed technical and cost review in line with the Public Spending Code. All projects, including this one, are subject to the due diligence requirements of the Public Infrastructure Guidelines. Managing timing, scope, and cost is crucial to staying within budgetary limits for the overall program.  Since 2020, the Department of Education and Youth has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,400 school building projects. Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation the department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  The department is now preparing an NDP implementation plan which is due for publication later in the Autumn. This plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  Department officials have actively engaged with the Design Team throughout and will continue to engage with the school authority to provide practical advice and assistance on this very important project. ",
        "questionType": "written",
        "showAs": " 165. Deputy John Clendennen asked the Minister for Education and Youth for an update on a project (details supplied); the likely timeline for completion; and if she will make a statement on the matter. [55919/25] ",
        "questionNumber": 165,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "John Clendennen",
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_165"
      }
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_167.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_167",
          "debateSectionId": "dbsect_167"
        },
        "to": {
          "showAs": "Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Education and Youth  The school referred to by the Deputy was approved to enter the departments pipeline of school buildings to provide a 2 classroom SEN base and to replace displaced accommodation. The project was devolved to the school for delivery.  A Stage 3 Tender Report has been received and is under review in line with the Public Spending Code. Department officials are currently assessing options to ensure value for money and to keep the project within anticipated costs. Once this review is complete, my department will communicate the outcome to the school authority.  Since 2020, the Department of Education and Youth has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,400 school building projects. Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July, the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation the department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. This will be the context for assessing all project rollout for the 2026 to 2030 period including in relation to this school. ",
        "questionType": "written",
        "showAs": " 166. Deputy John Clendennen asked the Minister for Education and Youth for an update on a project (details supplied); the likely timeline for completion; and if she will make a statement on the matter. [55920/25] ",
        "questionNumber": 166,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "John Clendennen",
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_166"
      }
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_168.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_168",
          "debateSectionId": "dbsect_168"
        },
        "to": {
          "showAs": "Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Education and Youth  The Teaching Council registers teachers under the Teaching Council Act 2001-2015 and in line with the Teaching Council Registration Regulations, 2016. As set out in the Schedule of the Regulations, the Council registers teachers under five routes of registration: Route 1 - Primary, Route 2 - Post-primary, Route 3 - Further Education, Route 4 - Other and Route 5 - Student Teacher. The qualification requirements for each route are set down in the Schedule.  The qualifications of teachers who qualified outside of the Republic of Ireland are assessed on an individual and holistic basis for the purposes of registering as a teacher. Qualifications are assessed for comparability with graduates of initial teacher education programmes accredited by the Teaching Council. All applications from teachers who qualified abroad are processed in line with the EU Directive 2005/36/EC and are assessed in the same manner, regardless of whether they qualified within or outside the EU. The EU Directive provides for the assessment of qualifications for the purposes of recognition, and this recognition may be subject to conditions.  To assist further with teacher supply challenges, I announced last April that I would work with the Teaching Council to introduce a proposal to enable eligible teachers who have qualified outside of Ireland to apply for registration and complete their induction requirement here.  I see this as an important step in encouraging more teachers to work and start their careers here in Ireland and I am pleased to note that significant progress has been made towards realising this measure.  Under the Teaching Council Act, the Council makes regulations for the purposes of registration through statutory instrument, including to amend or replace existing regulations. A further Statutory Instrument (SI) was required to establish the proposed creation of this timebound provision. A new set of registration regulations were drafted which included the provision for induction in the state for teachers qualified outside of the state, and on that basis engagement with the Data Protection Commissioner (DPC) was required. A proportionality impact assessment was carried out. There was also consultation with various stakeholders. Legal advice was sought to ensure that the new regulations are appropriate and proportionate, with no legal impediments, which requires more time than applies to an amending an SI.  It is expected that primary and post-primary teachers, who qualified outside of the Republic of Ireland and apply to complete their induction here under the new provision, will be subject to meeting eligibility and qualifications requirements to enable registration.  I am pleased to inform you that the final draft of the new Registration Regulations has been received from the Teaching Council and is progressing through the required procedures so that it can be laid before the Houses of the Oireachtas to be implemented in the coming days.  Please refer to the Teaching Council website, www.teachingcouncil.ie, for updates regarding the making of the new Registration Regulations, and for information on accessing the timebound provision for overseas qualified applicants to register and complete their induction in the State. ",
        "questionType": "written",
        "showAs": " 167. Deputy John Clendennen asked the Minister for Education and Youth for an update on the proposed timebound provision to allow teachers that qualify outside the State to apply for registration and complete their induction requirement in this State; when this path to registration will become available; and if she will make a statement on the matter. [55921/25] ",
        "questionNumber": 167,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "John Clendennen",
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_167"
      }
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_169.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_169",
          "debateSectionId": "dbsect_169"
        },
        "to": {
          "showAs": "Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for children with special educational needs. The NCSE is currently collating the data and information received through the parents notify process and are engaging with schools regarding where specialist provision is best placed for the 2026/27 school year. It is envisioned that the majority of these special classes will be sanctioned by 31 December.  407 new special classes were sanctioned for the 2025/26 school year. This means there are now over 3,740 special classes nationwide, 2,629 at primary level and 1,112 at post-primary level. A list of all mainstream schools with special classes; broken by location and class designation is available on the NCSE [ website ].  In addition, each county has a number of special schools educating students with the most complex of needs. These schools now offer a greater range of national curriculum subjects to include junior and senior cycle programmes for students of post-primary age.  In 2026, over €3 billion will be spent supporting children with special educational needs. It will ensure that specialist capacity continues to grow by providing 3,000 specialist places. The majority of these places will be available in special classes within mainstream schools and a substantial number will be allocated to schools at post-primary level.  I urge any parent still seeking placement for either this school year or the 2026/27 school year to make contact with the NCSE who will provide guidance and support with securing a placement. ",
        "questionType": "written",
        "showAs": " 168. Deputy John Clendennen asked the Minister for Education and Youth the number of special education places available at second level in each of the counties of Offaly, Laois, Kildare, Tipperary, Galway, Roscommon, Meath and Westmeath for the upcoming school year of 2026/2027, in tabular form; and if she will make a statement on the matter. [55922/25] ",
        "questionNumber": 168,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "John Clendennen",
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_168"
      }
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_206.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_206",
          "debateSectionId": "dbsect_206"
        },
        "to": {
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  The Irish Wetland Bird Survey (I-WeBS) is Ireland’s national programme for monitoring population trends of wintering waterbirds and the habitats they use. The survey has been running for over 30 years. The I-WeBS count surveys are completed by the National Parks and Wildlife Service (NPWS), by professional staff of the survey service provider (under contract) and by a network of skilled volunteers.  During the period from winter 2011/2012 to winter 2015/2016, a total of 631 sites received at least one I-WeBS core count. During the period from winter 2016/2017 to winter 2022/2023, a total of 486 sites received at least one I-WeBS core count. The number of I-WeBS sites counted under I-WeBS each winter season may vary due to a range of factors, including weather, flooding, access, and the availability of volunteers and NPWS staff. ",
        "questionType": "written",
        "showAs": " 207. Deputy John Clendennen asked the Minister for Housing, Local Government and Heritage the total number of individual sites that were subject to core I-WeBS counts in each of the years 2011 to 2020, in tabular form; and if he will make a statement on the matter. [55923/25] ",
        "questionNumber": 207,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "John Clendennen",
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_207"
      }
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Rural Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_357.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_357",
          "debateSectionId": "dbsect_357"
        },
        "to": {
          "showAs": "Rural",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  I propose to take Questions Nos. 375 and 376 together.  The Local Improvement Scheme or LIS is a key support to rural communities in improving non-public rural roads and laneways that are not typically maintained by local authorities. Since 2017,almost €184 million has been provided to local authorities under the Scheme.  On 7th August last, I was delighted to announce €14 million in additional funding for the 2025 scheme. This brings the total amount invested in LIS in 2025 alone to €30 million. Funding is paid to local authorities once it has been confirmed that works have been completed within the calendar year. Final figures on the 2025 scheme will be available in December once all payments have been made.  While my department provides funding for the scheme, it is administered by local authorities. They are responsible for the management of waiting lists, scheme applications and determining the eligibility of roads. My officials have engaged closely with local authorities to ensure LIS funding is fully utilised.  The Programme for Government commits to the provision of additional funding for the LIS. As the Deputy will be aware, €17 million in LIS funding was recently announced as part of Budget 2026. This represents an increase in base funding announced in previous years.  LIS is reviewed annually to ensure it is managed as fairly and efficiently as possible, with the aim of upgrading as many private roads as possible.  My department will aim to launch the 2026 Scheme as early as possible next year. This will allow local authorities to plan and manage their resources in an effective manner. Details of the 2026 scheme, including county allocations will be circulated to local authorities once finalised. ",
        "questionType": "written",
        "showAs": " 375. Deputy John Clendennen asked the Minister for Rural and Community Development and the Gaeltacht for an update on the local improvement scheme; when funding allocations will be announced; and if he will make a statement on the matter. [55926/25] ",
        "questionNumber": 375,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "John Clendennen",
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_375"
      }
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Rural Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_357.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_357",
          "debateSectionId": "dbsect_357"
        },
        "to": {
          "showAs": "Rural",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  I propose to take Questions Nos. 375 and 376 together.  The Local Improvement Scheme or LIS is a key support to rural communities in improving non-public rural roads and laneways that are not typically maintained by local authorities. Since 2017,almost €184 million has been provided to local authorities under the Scheme.  On 7th August last, I was delighted to announce €14 million in additional funding for the 2025 scheme. This brings the total amount invested in LIS in 2025 alone to €30 million. Funding is paid to local authorities once it has been confirmed that works have been completed within the calendar year. Final figures on the 2025 scheme will be available in December once all payments have been made.  While my department provides funding for the scheme, it is administered by local authorities. They are responsible for the management of waiting lists, scheme applications and determining the eligibility of roads. My officials have engaged closely with local authorities to ensure LIS funding is fully utilised.  The Programme for Government commits to the provision of additional funding for the LIS. As the Deputy will be aware, €17 million in LIS funding was recently announced as part of Budget 2026. This represents an increase in base funding announced in previous years.  LIS is reviewed annually to ensure it is managed as fairly and efficiently as possible, with the aim of upgrading as many private roads as possible.  My department will aim to launch the 2026 Scheme as early as possible next year. This will allow local authorities to plan and manage their resources in an effective manner. Details of the 2026 scheme, including county allocations will be circulated to local authorities once finalised. ",
        "questionType": "written",
        "showAs": " 376. Deputy John Clendennen asked the Minister for Rural and Community Development and the Gaeltacht for an update on the local improvement scheme, and details of any conditions that are being considered to ensure counties reduce application wait times; and if he will make a statement on the matter. [55927/25] ",
        "questionNumber": 376,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "John Clendennen",
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_376"
      }
    },
    {
      "question": {
        "by": {
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "showAs": "John Clendennen"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-09/pq_67",
        "answerText": " Minister for Justice, Home Affairs and Migration  The Garda Commissioner is responsible for the management and administration of An Garda Síochána under Section 33 of the Policing, Security and Community Safety Act 2024, which includes the recruitment and training of Garda personnel. As Minister, I have no role in these independent functions.  No applicant is deemed to be 'successful' until a formal offer to attend an intake at Templemore has been issued. As such, the information requested by the Deputy is unavailable. The next intake is scheduled for November.  The below table shows the number of applications by competition for the years 2022 - 2025. The current Garda recruitment campaign closes on 9 October.     Garda Recruitment Campaign    Number of Applications      2025    6,784      2024    6,360      2023    4,973      2022    10,565      ",
        "date": "2025-10-09",
        "questionNumber": 67,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/writtens/dbsect_83",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-09/writtens/mul@/dbsect_83.xml"
            }
          },
          "debateSectionId": "dbsect_83",
          "showAs": "An Garda Síochána"
        },
        "showAs": " 67. Deputy John Clendennen asked the Minister for Justice, Home Affairs and Migration the number of successful applicants currently waiting to be called to begin training in Templemore Garda College; and if he will make a statement on the matter. [54036/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Justice",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-10-09"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  The Revised National Planning Framework (NPF) was finalised and approved by Government and the Oireachtas in April 2025. The Revised NPF identifies the need to plan for approximately 50,000 additional households per annum to 2040.  The Revised NPF provides the basis for the review and updating of Regional Spatial and Economic Strategies (RSESs) and local authority development plans to reflect such critical matters such as updated housing figures or projected jobs growth, including through the zoning of land for residential, employment and a range of other purposes.  To ensure that local authority development plans reflect the requirements of the NPF in respect of housing as soon as possible, I issued the NPF Implementation: Housing Growth Requirements Guidelines under section 28 of the Planning and Development Act 2000 in July 2025. These Guidelines set out the housing demand scenario to 2040 for each local authority, by translating the NPF housing requirements into average annual figures and set out the requirement for planning authorities to commence the process of varying their development plan to meet the new housing growth requirements.  In addition to the baseline housing growth requirement, planning authorities have also been requested to address the scope for additional provision of up to 50% in excess of the baseline housing growth requirement, in light of the urgent need to increase housing delivery and to optimise the ability to deliver on the housing requirements of the Revised NPF. This approach recognises the fact that, for a variety of reasons, a relatively significant proportion of zoned lands are not activated over the period of a development plan.  Planning authorities are currently assessing their current development plan and undertaking a review of the adequacy of existing zoned lands to cater for the new Housing Growth Requirement figures and the potential for ‘additional provision’.  The zoning of land for particular purposes, including housing, is an exercise undertaken by planning authorities as part of their overall statutory plan function generally as part of a development plan under sections 9 to 13 of the Planning and Development Act, 2000 (as amended), but can at present also be carried out as part of a local area plan (LAP) process. The making of a development plan or an LAP is a reserved function of the elected members of each authority.  The Residential Zoned Land Tax (RZLT) was introduced in the Finance Act in 2021 and applies to land zoned for residential development, or for mixed use purposes including residential development and which is ‘vacant or idle’, which also has the necessary services in place to support the development of housing. The aim of this tax is to increase the supply of land for building by activating land which has been zoned in a statutory land use plan adopted by a local authority and which is serviced.  Provision was made in the Finance Act in 2024 for landowners to request the relevant local authority to change the zoning of their land, where the land appears on the RZLT annual final map published on 31st January 2025. Under Section 653I(1)(c) of Part 22A of the Taxes Consolidation Act 1997 the request must have been made between 1 February and 1 April 2025 to the relevant local authority. Subject to certain conditions, upon making the request, the landowner could seek an exemption from the tax for 2025 from the Revenue Commissioners.  Ministerial Planning Guidelines were issued in December 2024 to assist local authorities in considering rezoning requests where the landowner wishes to continue an existing economic activity. The Guidelines set out that where the landowner is carrying on an ongoing economic activity, and has not applied for planning permission for residential development or other uses which are not aligned with the ongoing economic activity, then their request should be facilitated.  Approximately 200 rezoning requests relating to c.280ha of land were received by 29 Local Authorities. 49 rezoning requests are being facilitated by local authorities through variation to their development plans.  Planning authorities are now also required to have regard to the further Ministerial Guidelines issued in July 2025 setting out the Housing Growth Requirements, referred to above, that are required to be incorporated into development plans. ",
        "by": {
          "showAs": "John Clendennen",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "memberCode": "John-Clendennen.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "date": "2025-10-08",
        "questionNumber": 53,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/dbsect_59",
          "debateSectionId": "dbsect_59",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/mul@/dbsect_59.xml"
            }
          },
          "showAs": "Housing Policy"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-08/pq_53",
        "showAs": " 53. Deputy John Clendennen asked the Minister for Housing, Local Government and Heritage the work his Department is doing to ensure that there is no net decrease in land supply from rezoning by local authorities; and if he will make a statement on the matter. [53284/25] "
      },
      "contextDate": "2025-10-08"
    },
    {
      "question": {
        "answerText": " Deputy Maeve O'Connell  Will the Minister of State outline the measures his Department is evaluating to promote the conversion of older buildings for housing delivery? \n Deputy John Cummins  I propose to take Questions Nos. 14, 15, 21, 83, 105 and 112 together.  As I said in my previous reply, this Government is committed to tackling the issue of vacancy and dereliction. The vacant homes action plan published in January 2023 sets out a range of measures and actions being pursued to return vacant and derelict properties to use as homes. In March, the Minister, Deputy Browne, and I published the 2025 progress report, which shows the significant progress that is being made. It is available on my Department's website.  One of the key measures in the action plan is supporting the refurbishment of older, vacant and derelict properties using the vacant property refurbishment grant. This is a grant that can provide up to €50,000 towards the refurbishment of vacant properties for use as homes and up to €70,000 where that property is derelict. To the end of June, more than 13,700 grant applications have been received across the country. Almost 10,000 have been approved and more than 2,800 grants have been paid, amounting to over €155 million. My Department publishes data on the grant on its website on a quarterly basis, providing a breakdown by local authority area. I will arrange to have the link to this published data circulated.  A comprehensive review of the vacant property refurbishment grant was undertaken in 2024. That review considered all aspects of the scheme. The findings of this review have been considered in the context of the development of the new housing plan, which will be published shortly. The grant has been and continues to be successful in bringing vacant and derelict properties back into use and in making the refurbishment of these properties an affordable option for buyers across the country. It acts as a significant support for younger persons who are starting out on the property ladder.  A wide range of other schemes are in place that also support the refurbishment and conversion of older buildings for housing. The repair and lease scheme provides an interest-free loan of up to €80,000 per home delivered to support the refurbishment and conversion of vacant buildings for use as social housing. This is a scheme that is increasingly used to renovate vacant commercial premises, including above the shop. There has been a huge positive impact from this scheme in my constituency of Waterford. About 55% of the national total of repair and lease units in the country have been delivered in Waterford, with one- and two-bedroom properties in town and city areas providing much-needed homes for families. I want to see more local authorities availing of that scheme.  Planning exemptions are available for the conversion of certain vacant commercial properties into residential use, which are proving successful. In 2024 alone, more than 290 exemption notifications for more than 700 homes were provided, the highest yearly total since their introduction. This was extended to include former vacant pubs a couple of years ago. It is the intention to extend those exemptions further through the exempted development.  As Deputy O'Connell, in budget 2026, the living city initiative, which is a tax relief, can be claimed and extended to other counties, as well as improving the level of support that is being provided through the scheme. We also made provision for a derelict property tax in the budget. As stated earlier, we have such a broad range of schemes providing the carrot to bring those vacant and derelict properties back into productive use for housing purposes, and if people are not going to use those carrots, the stick of the derelict property tax is coming. I encourage people to work with local authorities to use those schemes and bring those properties back into productive use, because what frustrates people most is seeing vacant and derelict properties across this country during a time of such need. \n Deputy Maeve O'Connell  I welcome all those supports. In my constituency, we have some of these issues in the context of neighbourhood centres, which are neither shops nor accommodation. That is frustrating. I would like to follow up on the derelict sites levy, which is to become a tax. When do we anticipate that it will be activated to try to encourage more of these properties to be brought back into use? \n Deputy John Cummins  It is the intention that local authorities will still have a significant role to play in the context of the new derelict sites tax by creating the register that Revenue will implement.  There has been an issue in collecting the existing levy. That is why we are moving to introduce it as a tax that will be collected by Revenue. We encourage people to use the supports there and if they do not use them, the stick of the derelict property tax is coming. \n An Ceann Comhairle  I thank the Minister of State. We are out of time. ",
        "by": {
          "showAs": "John Clendennen",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "memberCode": "John-Clendennen.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "date": "2025-10-08",
        "questionNumber": 112,
        "questionType": "oral",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/debate/dbsect_17",
          "debateSectionId": "dbsect_17",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/debate/mul@/dbsect_17.xml"
            }
          },
          "showAs": "Vacant Properties"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-08/pq_112",
        "showAs": " 112. Deputy John Clendennen asked the Minister for Housing, Local Government and Heritage the measures his Department is evaluating to promote the conversion of older buildings for housing delivery; and if he will make a statement on the matter. [53283/25] "
      },
      "contextDate": "2025-10-08"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Durrow Abbey, Co. Offaly, is located approximately eight kilometres north of Tullamore on the N52 road to Kilbeggan.  Durrow Cross, Church, graveslabs and Motte, located within the Durrow Demesne, are National Monuments (Nos. 313 and 678) in the care of the Office of Public Works (OPW). St Columba’s Church, which houses the Durrow High Cross, is also a National Monument in State care.  The church was closed to the public in 2020 due to concerns regarding the condition of the building fabric and the safety of visitors. Detailed investigations and surveys were commissioned to inform the scope of necessary conservation and repair works. It is envisaged that the conservation repairs to the floor and pews will be undertaken by OPW carpenters and joiners. While the planning for this work continues, visitors can view the Durrow High Cross through a screen at the church entrance. The OPW acknowledges that this is not an ideal arrangement but it is a necessary temporary measure while interior works are being advanced.  While it is not possible at this time to provide a definitive completion date, the Deputy can be assured that this is a priority project for the OPW District Works Team in 2026. ",
        "by": {
          "showAs": "John Clendennen",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "memberCode": "John-Clendennen.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "date": "2025-10-08",
        "questionNumber": 186,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/dbsect_156",
          "debateSectionId": "dbsect_156",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/mul@/dbsect_156.xml"
            }
          },
          "showAs": "Office of Public Works"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-08/pq_186",
        "showAs": " 186. Deputy John Clendennen asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the plans for a location (details supplied), given the growing concern around the rapidly deteriorating state of the building; and if he will make a statement on the matter. [54084/25] "
      },
      "contextDate": "2025-10-08"
    },
    {
      "contextDate": "2025-10-02",
      "question": {
        "debateSection": {
          "debateSectionId": "dbsect_57",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/dbsect_57",
          "showAs": "Sports Funding",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/mul@/dbsect_57.xml"
            }
          }
        },
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "houseNo": "34",
          "chamberType": "house"
        },
        "showAs": " 31. Deputy John Clendennen asked the Minister for Culture, Communications and Sport the amount of funding that Sport Ireland provided to organisations in Offaly over the past three years, in tabular form; and if he will make a statement on the matter. [52243/25] ",
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  Sport Ireland, which is funded by my Department, is the statutory body with responsibility for the development of sport, increasing participation at all levels and raising standards. It also has responsibility for the allocation of funding across its various programmes.  I have referred the Deputy's question to Sport Ireland for direct reply in relation to the matter mentioned by the Deputy. I would ask the Deputy to inform my office if a reply is not received within 10 days. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-02/pq_31",
        "questionNumber": 31,
        "questionType": "written",
        "date": "2025-10-02",
        "to": {
          "roleType": null,
          "uri": null,
          "roleCode": null,
          "showAs": "Culture"
        },
        "by": {
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "showAs": "John Clendennen"
        }
      }
    },
    {
      "contextDate": "2025-10-02",
      "question": {
        "debateSection": {
          "debateSectionId": "dbsect_91",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/dbsect_91",
          "showAs": "Artists' Remuneration",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/mul@/dbsect_91.xml"
            }
          }
        },
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "houseNo": "34",
          "chamberType": "house"
        },
        "showAs": " 67. Deputy John Clendennen asked the Minister for Culture, Communications and Sport the cost to date of running the basic income for artists scheme; and if he will make a statement on the matter. [52244/25] ",
        "answerText": " Minister for Culture, Communications and Sport  The Programme for Government commits to assessing the Basic Income for the Arts pilot research scheme to maximise its impact. I announced an extension of six months to February 2026 to allow for further assessment of the pilot data and to engage in stakeholder consultation to provide an evidence base for Government to make decisions on next steps.  Consultation is ongoing including a Consultative Committee which draws from across Government. I launched an online public consultation which closed on 5 September, over 17,000 submissions received, of which 97% were in favour of BIA being continued. A sectoral stakeholder forum also took place on 10 September with around 200 attendees from both resource organisations and artists represented.  The cost of Basic Income for the Arts (BIA) pilot scheme is €35m for a full calendar year for 2,000 artists to participate, with each recipient receiving €325 a week for the duration of the scheme. The cost of the 6-month extension is €16.7m to February 2026.  The outturn each year has been as follows (to nearest €,000):     Year    € Amount      2022    €11,373,000      2023    €34,508,000      2024    €34,344,000      2025 to-date    €25,962,000         The total expenditure varies due to natural attrition of participants and as administration and other costs fluctuate e.g. external research costs. There are currently 1962 participants on the scheme.  I recently published the findings of an independent cost-benefit analysis (CBA) paper. It shows that the BIA produced over €100m in social and economic benefits. For every €1 invested in the pilot society received a return of €1.39. It also finds that recipients’ arts-related income increased by over €500 per month on average. Audience engagement with the arts generated an estimated €16.9 million in social value over the three pilot years.  The CBA finds the real net fiscal cost of the BIA pilot to be just under €72m over the three years compared with the gross cost of €105m, due to returns in the form of tax revenues of €36m and €6.5m savings in social protection payments.  No decisions on a successor scheme have yet been made. A Government decision will be required on a successor scheme to the pilot, and I intend to bring forward proposals for a permanent intervention in after Budget 2026 discussions, subject to funding being made available. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-02/pq_67",
        "questionNumber": 67,
        "questionType": "written",
        "date": "2025-10-02",
        "to": {
          "roleType": null,
          "uri": null,
          "roleCode": null,
          "showAs": "Culture"
        },
        "by": {
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "showAs": "John Clendennen"
        }
      }
    },
    {
      "contextDate": "2025-10-02",
      "question": {
        "debateSection": {
          "debateSectionId": "dbsect_139",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/dbsect_139",
          "showAs": "Primary Care Centres",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/mul@/dbsect_139.xml"
            }
          }
        },
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "houseNo": "34",
          "chamberType": "house"
        },
        "showAs": " 127. Deputy John Clendennen asked the Minister for Health the number of primary care centres planned to be delivered in Offaly; the means by which the centres are helping to achieve the aims of Sláintecare; and if she will make a statement on the matter. [52245/25] ",
        "answerText": " Minister for Health  As the Health Service Executive (HSE) holds responsibility for the provision, along with the maintenance and operation of Primary Care Centres, I have asked the HSE to respond to the Deputy directly, as soon as possible. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-02/pq_127",
        "questionNumber": 127,
        "questionType": "written",
        "date": "2025-10-02",
        "to": {
          "roleType": null,
          "uri": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "showAs": "John Clendennen"
        }
      }
    },
    {
      "contextDate": "2025-10-02",
      "question": {
        "debateSection": {
          "debateSectionId": "dbsect_165",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/dbsect_165",
          "showAs": "Medical Records",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/mul@/dbsect_165.xml"
            }
          }
        },
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "houseNo": "34",
          "chamberType": "house"
        },
        "showAs": " 153. Deputy John Clendennen asked the Minister for Health the progress on the digitalisation of the health service overall; and if she will make a statement on the matter. [52246/25] ",
        "answerText": " Minister for Health  Digital for Care: A Digital Health Framework for Ireland 2024-2030 reflects the changing landscape of health and social care in Ireland and sets out a roadmap to digitally transform health services and improve access for patients. This framework, combined with the corresponding HSE implementation roadmap, sets out a very clear path for the full digitisation of healthcare records and information systems in Ireland, as stated in the Programme for Government. Implementation of Ireland’s Digital for Care strategy is progressing at pace following its publication in May 2024. It sets out vision to enable better health outcomes through seamless, safe, secure, and connected digital health services that support both patients and providers. This vision is grounded in the principles of Sláintecare. Government has also reflected the need to support increased capital investment levels especially in health digitalisation through the review of the National Development Plan that is ongoing.  Ireland needs one digital health record for every citizen that can be accessed by health professionals across the service. The path to a one digital health record that covers the full health journey of every person living in Ireland consists of three key initiatives under Digital for Care (and the Programme for Government) proceeding concurrently and in parallel to achieve this for patients and the healthcare workforce:  The HSE Health App was successfully launched in February 2025, giving patients real choice and empowering their control over their health journey with further releases in May and September of this year. The app, that has already won a number of technology awards, represents an important step towards making personal health information available, putting each patient at the centre of their healthcare journey. It empowers people by providing a single app to manage their digital health identity, personal health information, health and social care coordination, and access to services. It continues to evolve with more services, data and features planned in regular future releases.  The Health Service Executive (HSE) completed the procurement for the National Shared Care Record (NSCR) earlier this year. The NSCR programme has now been mobilized, with the contract for building the NSCR technology platform awarded to EY, Better and Kainos. The NSCR brings together healthcare information from various sources such as hospitals, GP practices, and Community care into a single place, making them available at the point of care and self-care in read only format. By having access to key healthcare information in one place means healthcare professionals will be able to make more informed, safer decisions and to focus more time on direct patient care while patients will be better informed and empowered to manage their own healthcare.  A phased rollout of the national shared care record is due to commence in Q4 2025 in the South-East region with University Hospital Waterford. The system will then extend to other regions from 2026 with additional information being added over time. Together with the HSE Health App, investing in a NSCR means unlocking fragmented data into a powerful tool for safer, coordinated patient-centred care while laying the foundation for a modern, connected and more efficient health service as we plan for a National Electronic Health Record.  The National Electronic Health Record (EHR) is intended to support integrated care across all settings. A preliminary business case for the National EHR has been developed by the HSE, setting out the case for the most ambitious transformation programme in the history of the health service. It has completed the External Assurance Process (EAP) as required under the Infrastructure Guidelines for major investment programmes and the EAP report has been shared with the Major Projects Advisory Group (MPAG) for advice to DPENDR and Government. A national enterprise EHR will allow healthcare staff to access a patient’s full medical history to support timely and appropriate care, with the ability to update information in real time. EHRs not only provide a complete digital health record of a patient’s health journey, recorded by healthcare professionals across all health and social care settings, they also incorporate workflow capabilities to automate the patient pathway and facilitate the implementation of standardised models of care. This means the EHR can map out the next steps in a patient’s treatment plan in the various care setting and support automatic referrals, ordering of diagnostics, lab tests, etc.  To realise the benefits of an investment in EHRs, they must be underpinned by a clear roadmap, agreed up-front interoperability and data standards, appropriate governance and a robust business case. Deploying an EHR is not just about the technology. These are significant change programmes to transform and move from a paper based to a digitised care model. A PIN (Prior Information Notice) was published in June 2025 informing EHR suppliers about the health service's interest in a national enterprise-level EHR systems. This process is open to all potential vendors willing to engage through this process. The consultation seeks supplier input to inform the upcoming procurement, with a contract award expected by the end of 2026 and phased implementation through to 2032.  In another important step on our way to digitised patient records, in May the HSE published the tender for the delivery of a National Electronic Prescribing (NEP) service. The new fully integrated e-prescription service will enable the secure and efficient transmission and storage of electronic prescriptions and dispensations for patients. This provides a critical piece of information for digital health records and the data from this service (prescription and dispensing data) will be available through the HSE Health App and the NSCR in the future. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-02/pq_153",
        "questionNumber": 153,
        "questionType": "written",
        "date": "2025-10-02",
        "to": {
          "roleType": null,
          "uri": null,
          "roleCode": null,
          "showAs": "Health"
        },
        "by": {
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "showAs": "John Clendennen"
        }
      }
    },
    {
      "question": {
        "answerText": " Minister for Health  The immunisation programme in Ireland is based on the advice of the National Immunisation Advisory Committee (NIAC). NIAC considers the prevalence of the relevant disease in Ireland as well as international best practice in relation to immunisation when developing its advice.  The current NIAC guidelines state that the shingles vaccine may be considered in those aged 65 years and older, due to the greater burden and severity of disease in this age group and in those aged 18 years and older at increased risk of shingles.  Shingles vaccination is not currently provided as part of the national immunisation programme.  The Health Information and Quality Authority (HIQA) has carried out a Health Technology Assessment (HTA) on the herpes zoster vaccine which protects against shingles. A HTA is a multidisciplinary research process that collects and summarises information about a health technology. The information can cover a range of fields, including clinical effectiveness and safety, cost-effectiveness and budget impact, organisational and social aspects, and ethical and legal issues. The information is collected and presented in a systematic, unbiased and transparent manner.  HIQA’s HTA examined the evidence on the clinical effectiveness and safety of shingles vaccines. The cost effectiveness and budget impact were also reviewed, along with the ethical, social and organisational implications of including the vaccine in the adult immunisation schedule.  HIQA published this HTA on 19 July 2024. The HTA found that adding the shingles vaccine to the routine immunisation schedule, at the vaccine price at the time, for all adults aged 65 years and over would not be cost effective and would be associated with a substantial budget impact.  Whilst the HTA found that the introduction of the shingles vaccine was not cost effective based on the cost of the vaccine, it found that it could be cost effective for vaccination of those at 75 years and 80 years if the cost of the vaccine was reduced by 80%.  Given that the healthcare budget is finite and decisions regarding increased spending relating to a change in one area could impact the provision of other health technologies and treatments within the healthcare system, the cost-effectiveness must be considered in any decision-making process.  My Department considered the findings of this HTA and determined that the introduction of the vaccine could be reconsidered when the cost effectiveness of the vaccine is confirmed as being more favourable. ",
        "by": {
          "showAs": "John Clendennen",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "memberCode": "John-Clendennen.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "date": "2025-10-01",
        "questionNumber": 183,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-01/writtens/dbsect_194",
          "debateSectionId": "dbsect_194",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-01/writtens/mul@/dbsect_194.xml"
            }
          },
          "showAs": "Vaccination Programme"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-01/pq_183",
        "showAs": " 183. Deputy John Clendennen asked the Minister for Health if consideration is being given to the provision of the shingles vaccine (details supplied) free of charge for those that are immunocompromised; and if she will make a statement on the matter. [52275/25] "
      },
      "contextDate": "2025-10-01"
    },
    {
      "question": {
        "by": {
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "showAs": "John Clendennen"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-30/pq_188",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  The issue raised by the Deputy is a matter for Irish Rail. Therefore, I have referred the Deputy's question to Irish Rail for direct response to the Deputy. Please advise my private office if you do not receive a reply within ten working days. ",
        "date": "2025-09-30",
        "questionNumber": 188,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/dbsect_128",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/mul@/dbsect_128.xml"
            }
          },
          "debateSectionId": "dbsect_128",
          "showAs": "Rail Network"
        },
        "showAs": " 188. Deputy John Clendennen asked the Minister for Transport the number of passenger journeys per year, per route, on the Intercity city route to Galway from 2016 to date in 2025; and if he will make a statement on the matter. [51462/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Transport",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-30"
    },
    {
      "question": {
        "by": {
          "memberCode": "John-Clendennen.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/John-Clendennen.D.2024-11-29",
          "showAs": "John Clendennen"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-30/pq_193",
        "answerText": " Minister of State at the Department of Transport (Deputy Jerry Buttimer)  As Minister of State at the Department of Transport with special responsibility for Rural Transport I recognise the importance of increasing public transport connectivity in rural Ireland. In the new Programme for Government, Securing Ireland's Future, this Government has committed to increasing Local Link services in rural areas to better connect villages, towns and cities.  Under Budget 2025, the Department has secured a funding package of €658.442 million for Public Service Obligation (PSO) and TFI Local Link services (an increase from €613.813 million in 2024). This package includes funding for the continuation of the various fare initiatives, such as the Young Adult Card, and the 90-minute fare until the end of 2025. Funding has also been provided to extend free child fares on PSO Services to include those aged 5 to 8-years old, and to support the roll-out new and enhanced bus services under programmes such as BusConnects, Connecting Ireland and new town services.  The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally. The NTA also has national responsibility for integrated local and rural transport, including TFI Local Link services and the rollout of services under the Connecting Ireland Rural Mobility Plan.  In light of the NTA's responsibilities for public transport service in rural areas I have referred your question to the NTA for direct reply to you. Please advise my private office if you do not receive a reply within ten working days.       ",
        "date": "2025-09-30",
        "questionNumber": 193,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/dbsect_133",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/mul@/dbsect_133.xml"
            }
          },
          "debateSectionId": "dbsect_133",
          "showAs": "Transport Policy"
        },
        "showAs": " 193. Deputy John Clendennen asked the Minister for Transport the increase in the number of routes on the rural transport/local link network each year from 2016 to date in 2025; and if he will make a statement on the matter. [51463/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Transport",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-30"
    }
  ]
}