{
  "head": {
    "counts": {
      "questionCount": 413,
      "resultCount": 413
    }
  },
  "results": [
    {
      "contextDate": "2013-07-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-07-16/writtens/mul@/dbsect_665.xml"
            }
          },
          "debateSectionId": "dbsect_665",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-07-16/writtens/dbsect_665",
          "showAs": "Garda Recruitment"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-07-16/pq_856",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 856,
        "showAs": " 856. Deputy Paschal Donohoe asked the Minister for Justice and Equality if the current existing panel of Garda applicants will be used for recruitment; if recruitment to the Garda will commence; and if he will make a statement on the matter.  [34220/13] ",
        "answerText": " Minister for Justice and Equality  Following a  review of the training for recruit gardaí, a revised training programme has been introduced in the Garda College. In light of this and in view of the fact that the existing Garda recruitment panel is now approximately five years old, it is unlikely that the existing panel will be used in any future recruitment. I believe it is important for an organisation such as An Garda Síochána to have some regular intakes of new recruits, even if on a modest scale. In this context, I am pleased to have received sanction from my colleague, the Minister for Public Expenditure and Reform, to hold a recruitment competition for An Garda Síochána . I will make arrangements with the Public Appointments Service so that they can do the necessary preparatory work to deal with what is expected to be a very large number of applications later this year. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-07-16",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "question": {
        "date": "2013-07-11",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-07-11/writtens/dbsect_133",
          "showAs": "Crime Prevention",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-07-11/writtens/mul@/dbsect_133.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_133"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "showAs": "Paschal Donohoe"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Justice",
          "roleType": null
        },
        "showAs": " 181. Deputy Paschal Donohoe asked the Minister for Justice and Equality the actions that are open to An Garda Síochána in respect of begging; and if he will make a statement on the matter. [34081/13] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-07-11/pq_181",
        "questionNumber": 181,
        "answerText": " Minister for Justice and Equality  The law on begging is set out in the Public Order Act 2011. The Act defines begging as requesting or soliciting money or goods other than in accordance with a licence, permit or authorisation. Section 2 of the Act makes it an offence while begging to harass, intimidate, assault or threaten any other person or persons, or obstruct the passage of persons or vehicles. Section 5 makes it an offence to organise or direct begging, and it is an offence under Section 6 to live off the proceeds of begging.  There is also provision contained in Section 3 (2) in relation to begging at certain locations, including at or near automated teller machines or vending machines, and members of An Garda Síochána may direct a person begging at such a location to leave the vicinity. Section 4 of the Act also gives Gardaí powers of arrest without warrant where there are reasonable grounds to believe that offences under this legislation have been committed. In addition to these provisions, Section 247 of the Children Act, 2001 provides for an offence of causing, procuring or allowing children to beg, and Gardaí have powers of arrest under section 254 of the 2001 Act where there are reasonable grounds to suspect that such an offence has been committed or attempted.  Gardaí also have powers under public order legislation in relation to anti-social behaviour generally and in this regard may identify \"hotspots\" for the commission of relevant offences which are then proactively monitored. In addition, local Garda management oversees all operational strategies in place, in conjunction with crime trends and the policing needs of local communities, to ensure optimum use is made of Garda resources, and the best possible Garda service is provided to the public. "
      },
      "contextDate": "2013-07-11"
    },
    {
      "question": {
        "date": "2013-07-11",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-07-11/writtens/dbsect_181",
          "showAs": "Home Care Packages",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-07-11/writtens/mul@/dbsect_181.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_181"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "showAs": "Paschal Donohoe"
        },
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "showAs": "31st Dáil",
          "chamberType": "house",
          "houseNo": "31"
        },
        "questionType": "written",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Health",
          "roleType": null
        },
        "showAs": " 233. Deputy Paschal Donohoe asked the Minister for Health when funding will be made available to allow for a home care package to be put in place following a recent discharge from hospital in respect of persons (details supplied) in Dublin 7; and if he will make a statement on the matter. [34011/13] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-07-11/pq_233",
        "questionNumber": 233,
        "answerText": " Minister of State at the Department of Health  As this is a service matter it has been referred to the Health Service Executive for direct reply. "
      },
      "contextDate": "2013-07-11"
    },
    {
      "contextDate": "2013-07-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-07-09/writtens/mul@/dbsect_80.xml"
            }
          },
          "debateSectionId": "dbsect_80",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-07-09/writtens/dbsect_80",
          "showAs": "Census of Population Publication"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-07-09/pq_116",
        "to": {
          "roleType": null,
          "showAs": "Taoiseach",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 116,
        "showAs": " 116. Deputy Paschal Donohoe asked the Taoiseach the reason data from the 1926 census will not be made publicly available until 2027; and if he will make a statement on the matter. [33146/13] ",
        "answerText": " The Taoiseach  The Censuses of Population carried out between 1926 and 1991 were undertaken under the 1926 Statistics Act which did not permit access to Census records at any time. The Statistics Act, 1993 repealed the 1926 and 1946 Statistics Acts, and provided for the release of census forms from these censuses 100 years after the date of the relevant Census. As such, data from the 1926 Census will be made available in 2026. A further reduction of the guarantee could be incorrectly interpreted by some as a relaxation by the CSO in its approach to confidentiality and the protection of data supplied to it under the Statistics Act, 1993.  Independence, objectivity and the guarantee of confidentiality are the core values of official statistics which have helped create a positive image of, and ensure public trust in, official statistics in Ireland. Statistical confidentiality is the cornerstone of all CSO work. This is the reason for the legal guarantees contained in the Statistics Act 1993. Any action that could lead to a weakening of that public trust would be detrimental not just to the Census of Population but also to the broader activities of the CSO covering areas such as economic, business and social statistics.  In conclusion I am satisfied that the 100 year period provided for in the Statistics Act strikes the right balance between facilitating legitimate historical and genealogical research on the one hand, while protecting the confidentiality of census data and maintaining the integrity of CSO guarantees procedures. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-07-09",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-07-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-07-09/writtens/mul@/dbsect_136.xml"
            }
          },
          "debateSectionId": "dbsect_136",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-07-09/writtens/dbsect_136",
          "showAs": "Pension Provisions"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-07-09/pq_179",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 179,
        "showAs": " 179. Deputy Paschal Donohoe asked the Minister for Finance his views on allowing, in Budget 2014, persons access up to 30% of their pension scheme akin to the AVC measure adopted in Budget 2013; and if he will make a statement on the matter.  [33453/13] ",
        "answerText": " Minister for Finance  Finance Act 2013 was passed into law on 27th March and section 17 of the Act, which makes provision for pre-retirement access to AVCs, has effect from that date. Section 17 introduces a new section 782A into the Taxes Consolidation Act 1997 which provides members of occupational pension schemes with a three-year window of opportunity to draw down, on a once-off basis, up to 30% of the accumulated value of certain AVCs made by them, including additional voluntary PRSA contributions made to AVC PRSAs. This is a restricted measure which enables rather than incentivises individuals to access part of their pension savings beyond their regular or compulsory pension contributions. I do not wish to damage future pension provision and it is important that individuals continue to provide for their retirement. For these reasons, I have no plans to extend the measure beyond AVCs. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-07-09",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-07-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-07-09/writtens/mul@/dbsect_474.xml"
            }
          },
          "debateSectionId": "dbsect_474",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-07-09/writtens/dbsect_474",
          "showAs": "Hospital Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-07-09/pq_553",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 553,
        "showAs": " 553. Deputy Paschal Donohoe asked the Minister for Health the reason the Mater Hospital, Dublin, is no longer able to provide lung function tests if required by general practitioners; if there is another hospital where GPs can refer directly; and if he will make a statement on the matter. [33465/13] ",
        "answerText": " Minister for Health  I propose to take Questions Nos. 545 and 553 together.  In relation to the particular queries raised by the Deputy, as these are service issues, I have asked the Health Service Executive to respond directly to the Deputy in these matters. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-07-09",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-07-04",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-07-04/writtens/mul@/dbsect_189.xml"
            }
          },
          "debateSectionId": "dbsect_189",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-07-04/writtens/dbsect_189",
          "showAs": "Household Charge Exemptions"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-07-04/pq_181",
        "to": {
          "roleType": null,
          "showAs": "Environment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 181,
        "showAs": " 181. Deputy Paschal Donohoe asked the Minister for the Environment, Community and Local Government if a person who was informed by a local authority staff member that they were not liable to the household charge when in fact they were before 31 March 2012, if such person will have the late-payment penalties waived; and if he will make a statement on the matter. [32789/13] ",
        "answerText": " Minister for the Environment, Community and Local Government  The Local Government (Household Charge) Act 2011 provides the legislative basis for the Household Charge. Under the Act, an owner of a residential property on the liability date is liable to pay the Household Charge, unless otherwise exempted or entitled to claim a waiver. The Charges operate on a self-assessment basis; it is a matter for an owner of a residential property to determine liability and pay the Charge.  Local authorities, assisted by the Local Government Management Agency on a shared services/agency basis, are administering the Household Charge system. Household Charge operational matters are a matter for the relevant local authority or for the Agency. If it is the case that incorrect advice was provided to a liable owner by an employee of a local authority, then that owner should engage with the local authority to resolve the matter. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-07-04",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-07-02",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-07-02/writtens/mul@/dbsect_248.xml"
            }
          },
          "debateSectionId": "dbsect_248",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-07-02/writtens/dbsect_248",
          "showAs": "Teaching Contracts"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-07-02/pq_327",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 327,
        "showAs": " 327. Deputy Paschal Donohoe asked the Minister for Education and Skills the reason a person (details supplied) has not gained access to the supplementary teachers panel in view of the fact that the person has worked 191 days since becoming qualified on 1 October 2010; and if he will make a statement on the matter.  [31829/13] ",
        "answerText": " Minister for Education and Skills  The core function of the redeployment arrangements is to facilitate the redeployment of all surplus permanent teachers to other schools that have vacancies. The redeployment of all surplus permanent teachers is key to the Department's ability to manage within its payroll budget and ceiling on teacher numbers. Thereafter, schools are required under the panel arrangements to fill permanent vacancies from supplementary panels comprised of eligible fixed-term (temporary/substitute) and part-time teachers. The application process for the supplementary panels was introduced for the 2012/13 school year. The arrangements for panel access for fixed term (temporary/substitute) and part-time teachers for the 2013/14 school year are set out in Department Circular 0038/2012 which is available on the Department website. The Supplementary Panel is created for eligible primary teachers in fixed term/temporary positions (this includes substitute positions) and part-time positions who meet the relevant eligibility criteria outlined in Part 2 of this circular. The teacher referred to by the Deputy failed to meet the criteria and is therefore ineligible to be included on the supplementary panel. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-07-02",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-07-02",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-07-02/writtens/mul@/dbsect_252.xml"
            }
          },
          "debateSectionId": "dbsect_252",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-07-02/writtens/dbsect_252",
          "showAs": "Student Grant Scheme Eligibility"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-07-02/pq_331",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 331,
        "showAs": " 331. Deputy Paschal Donohoe asked the Minister for Education and Skills the number of applicants to Student Universal Support Ireland seeking grant support who failed to complete the previous academic year; if SUSI monitors the attendance of students in receipt of support grants regarding lectures throughout the academic year; and if he will make a statement on the matter. [31935/13] ",
        "answerText": " Minister for Education and Skills  The information in relation to students who dropped out of college is not available. The Deputy would be aware that affordability is just one of the factors that impact on students, continued participation in higher education. There are a range of wider factors that also impact on participation, including social and cultural issues, prior academic attainment and teacher and parental expectations. Students awarded a grant are paid the maintenance element subject to confirmation and verification of attendance from the institution being attended. Student Universal Support Ireland receives confirmation of satisfactory attendance from the further education sector on a monthly basis and from the higher education sector on a semester basis. Students who have previously attended, but not completed an approved course of study are required to complete an equivalent period of study on an approved course before being eligible to be considered for a grant. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-07-02",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-07-02",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-07-02/writtens/mul@/dbsect_266.xml"
            }
          },
          "debateSectionId": "dbsect_266",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-07-02/writtens/dbsect_266",
          "showAs": "July Education Programme"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-07-02/pq_344",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 344,
        "showAs": " 344. Deputy Paschal Donohoe asked the Minister for Education and Skills the reason the July provision hours have been halved this year in respect of persons (details supplied) in Dublin 7; and if he will make a statement on the matter. [32056/13] ",
        "answerText": " Minister for Education and Skills  The Deputy will be aware that the July Education Programme is available to all special schools and mainstream primary schools with special classes catering for children with autism that choose to extend their education services through the month of July. My Department also provides for a July Programme for pupils with a severe/profound general learning disability. Where school based provision is not feasible, home based provision may be grant aided. The allocation of home based provision to siblings for July Provision is reflective of the school grouping principle. This is where one teacher is allocated to a class of six pupils at the appropriate educational level, primary or post primary. Accordingly it is considered appropriate, as in a school situation, that a tutor can provide tuition at the appropriate educational level to more than one sibling at that level simultaneously in the home. The school grouping principle does not purport to replicate or mirror all aspects of school based provision. The age or ability of siblings is reflected in their education level as determined by education and health professionals. In general where a child is receiving their education in a class setting with other children of mixed age and ability, this should carry through to their July Provision. However, in recognition of the differing needs of some siblings, including the brothers referred to by the Deputy, separate allocations will be considered on a case by case basis. Applications in this regard will require supporting documentation including professional reports from a psychologist or a letter from the principal of the school detailing the existing arrangements currently in place for the respective children and providing reasons why they cannot be tutored together in the home. Separate allocations have been made to the children referred to by the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-07-02",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-07-02",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-07-02/writtens/mul@/dbsect_522.xml"
            }
          },
          "debateSectionId": "dbsect_522",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-07-02/writtens/dbsect_522",
          "showAs": "Public Sector Staff Career Breaks"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-07-02/pq_630",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 630,
        "showAs": " 630. Deputy Paschal Donohoe asked the Minister for Health the numbers of persons who have been accepted for the Health Service Executive's incentivised career break; and if he will make a statement on the matter.  [31486/13] ",
        "answerText": " Minister for Health  I propose to take Questions Nos. 630, 634 and 637 together.  On 1 May last my Department issued a Circular letter to the HSE, authorising the introduction of an incentivised career break scheme in the HSE and in organisations funded by the HSE under Section 38 of the Health Act 2004. The scheme was intended as a tool to assist managers to achieve the numbers reduction required under the 2013 Employment Control Framework, as well as the corresponding reduction in expenditure, while delivering the agreed level of service.  Under the terms of the scheme, staff who had completed their probationary period, were offered a 3 year career break with an incentive payment of one third of gross basic pay to a maximum of €12,000; this amount is subject to tax and other statutory deductions. Any vacancy which arises under the scheme will not as a general rule be filled; a vacancy may only be filled by redeployment.  A total of 2,732 applications were received by the closing date 31 May, of which 2,521 were deemed to be valid applications. These applications have been considered and to date 366 have been approved while 82 applications have yet to be determined. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-07-02",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-07-02",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-07-02/writtens/mul@/dbsect_522.xml"
            }
          },
          "debateSectionId": "dbsect_522",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-07-02/writtens/dbsect_522",
          "showAs": "Public Sector Staff Career Breaks"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-07-02/pq_634",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 634,
        "showAs": " 634. Deputy Paschal Donohoe asked the Minister for Health the number of persons within the Health Service Executive who have applied for the incentivised career break; and if he will make a statement on the matter.  [31485/13] ",
        "answerText": " Minister for Health  I propose to take Questions Nos. 630, 634 and 637 together.  On 1 May last my Department issued a Circular letter to the HSE, authorising the introduction of an incentivised career break scheme in the HSE and in organisations funded by the HSE under Section 38 of the Health Act 2004. The scheme was intended as a tool to assist managers to achieve the numbers reduction required under the 2013 Employment Control Framework, as well as the corresponding reduction in expenditure, while delivering the agreed level of service.  Under the terms of the scheme, staff who had completed their probationary period, were offered a 3 year career break with an incentive payment of one third of gross basic pay to a maximum of €12,000; this amount is subject to tax and other statutory deductions. Any vacancy which arises under the scheme will not as a general rule be filled; a vacancy may only be filled by redeployment.  A total of 2,732 applications were received by the closing date 31 May, of which 2,521 were deemed to be valid applications. These applications have been considered and to date 366 have been approved while 82 applications have yet to be determined. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-07-02",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-06-27",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-27/writtens/mul@/dbsect_32.xml"
            }
          },
          "debateSectionId": "dbsect_32",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-27/writtens/dbsect_32",
          "showAs": "Light Rail Projects Status"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-06-27/pq_71",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 71,
        "showAs": " 71. Deputy Paschal Donohoe asked the Minister for Transport, Tourism and Sport if he will provide a report on the progress being made to date in the development of the Luas Cross City project.  [31078/13] ",
        "answerText": " Minister for Transport, Tourism and Sport  I propose to take Questions Nos. 13, 23, 30 and 71 together.  These relate to the Luas Cross City project.  The National Transport Authority (NTA) has statutory responsibility for the development of public transport infrastructure in the Greater Dublin Area (GDA), including the proposed Luas Cross City project.  Luas Cross City Line is a priority project under the Government's 5-year capital plan - Infrastructure & Capital Investment Programme 2012-2016 - Medium Term Exchequer Framework. In November 2012, following consideration by Government, I asked the NTA and the Railway Procurement Agency (RPA) to proceed with the procurement and contractual arrangements so that the enabling works for the project would commence mid-2013.  I understand that a building survey contract is now underway. Following the recent award of the two Cellars Infill and Investigation Contracts, works commenced this week which will locate, and where necessary infill, cellars which may be under footpaths and road ways along the route. The contract for the Heritage Works Contract is scheduled for award shortly and initial works are planned for September 2013. Works on the Utility Diversions Contract are also planned to commence in September 2013. Procurement for the main contract will commence in mid-2014 with main construction works due to start in early 2015. The target date for commencement of services is end-2017.  The NTA are consulting with business representatives in the Dawson Street area with regard to the re-instatement of a northbound stop on Dawson Street. A report on possible locations for a proposed stop is expected to be available in late-July 2013.  The new project will create up to 800 jobs during the construction phase with a further 60 permanent jobs on completion. A breakdown by year is not available.  There are no plans in the current Capital Programme to further extend the Luas lines. However, the NTA is currently preparing an Integrated Implementation Plan for investment to 2018 in the GDA as required under the DTA Act 2008. This plan will address the investment needs of the Area to 2018 based on available funding and will be subject to public consultation later this year. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-06-27",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-06-27",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-27/writtens/mul@/dbsect_192.xml"
            }
          },
          "debateSectionId": "dbsect_192",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-27/writtens/dbsect_192",
          "showAs": "Proposed Legislation"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-06-27/pq_204",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 204,
        "showAs": " 204. Deputy Paschal Donohoe asked the Minister for Justice and Equality when he expects the Gambling Control Bill to be published; the work that is being undertaken by his Department in respect of progressing the Bill; and if he will make a statement on the matter.  [31295/13] ",
        "answerText": " Minister for Justice and Equality  My Department has prepared a General Scheme for the Gambling Control Bill. I hope to secure Government approval for the Scheme in the near future. Once it has been approved, it will then be sent to the Office of the Parliamentary Counsel, in the Office of the Attorney General, for drafting of the Bill. I am not in a position at this time to say when the Bill will be published. However, the Deputy may wish to know that it is my intention to publish the General Scheme on my Department's website once it has been approved by Government and while drafting of the Bill continues. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-06-27",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-06-26",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-26/writtens/mul@/dbsect_181.xml"
            }
          },
          "debateSectionId": "dbsect_181",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-26/writtens/dbsect_181",
          "showAs": "Employment Support Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-06-26/pq_153",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 153,
        "showAs": " 153. Deputy Paschal Donohoe asked the Minister for Social Protection further to Parliamentary Questions Nos. 421 of 28 May and 442 of 11 June 2013, the progress made to date on the specific targets that were published in the Government's Pathways to Work strategy (details supplied); if she will report on performance against these targets for quarter 1 and for quarter 2 of 2013; and if she cannot outline the progress made to date on these specific targets, the reason for same. [31146/13] ",
        "answerText": " Minister for Social Protection  As the Deputy has previously been advised with respect to plans for 2013 I have published a comprehensive set of performance targets, set out on a quarter by quarter basis, on the Department’s website www.welfare.ie .  I intend to publish my Department’s performance against these targets starting in July of this year with the results of the first quarter available before close of business on 28 June 2013. Performance against quarter two targets will be measured at the end of quarter two.  It is not proposed to publish selectively on performance against the Pathways to Work targets prior to the formal publication of the relevant data. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-06-26",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-06-25",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-25/writtens/mul@/dbsect_145.xml"
            }
          },
          "debateSectionId": "dbsect_145",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-25/writtens/dbsect_145",
          "showAs": "Tobacco Smuggling"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-06-25/pq_184",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 184,
        "showAs": " 184. Deputy Paschal Donohoe asked the Minister for Finance the number of successful prosecutions that have been made for the supply of illegally obtained cigarettes and tobacco; the average length of sentence or fine for any successful prosecution; and if he will make a statement on the matter. [30842/13] ",
        "answerText": " Minister for Finance  I am advised by the Revenue Commissioners that they view the illicit trade in tobacco products as a very serious matter and that combating this illegal activity is a high priority for them. Their “Strategy on Combating the Illicit Tobacco Trade 2011-2013” includes a wide range of measures that are designed to identify and target those involved in the supply or sale of illicit tobacco products, with a view to seizing the illicit products and prosecuting those involved. The penalties that may be imposed where a person is convicted for the smuggling or selling of illicit products are set down in, respectively, section 119 of the Finance Act 2001 and section 78 of the Finance Act 2005. The specific penalty to be imposed in a particular case is a matter for the Courts.  Details of the penalties imposed in respect of tobacco-related convictions during 2012, and this year to 31 May, are set out in the following tables:  Convictions for Tobacco Smuggling     -    2012    2013 (to 31 May)      Conviction on indictment    7    1      Custodial prison sentences    7 (in 5 instances the sentence was suspended)    1 (the sentence was suspended)      Range of custodial sentences    2 months to 3 years    1 sentence of 3 years      No. of cases in which fine imposed    2    -      Average fine    €2,500    -      Summary Convictions    50    17      Custodial prison sentences    19 (in 2 instances the sentence was suspended)    11 (in 3 instances the sentence was suspended)      Range of custodial sentences    6 days to 10 months    28 days to 6 months      No of cases in which fine imposed    35    10      Average fine    €2,530    €2,600     Convictions for Keeping or Sale of Tobacco     -    2012    2013 (to 31 May)      Conviction on indictment    15    1      Custodial prison sentences    15 (In 8 instances the sentence was suspended, and in instance part of sentence was suspended)    -*      Range of custodial sentences    18 months to 3 years    -      No. of cases in which fine imposed    -    -      Summary Convictions    60    22      Custodial prison sentences    6 (In 5 instances the sentence was suspended)    6 (In 4 instances the sentence was suspended)      Range of custodial sentences    1 day to 6 months    4 months to 10 months      No of cases in which fine imposed    54    19      Average fine    €2,834    €2.736     Notes  *Sentence of 240 hours of community service imposed. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-06-25",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-06-25",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-25/writtens/mul@/dbsect_146.xml"
            }
          },
          "debateSectionId": "dbsect_146",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-25/writtens/dbsect_146",
          "showAs": "Tobacco Smuggling"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-06-25/pq_185",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 185,
        "showAs": " 185. Deputy Paschal Donohoe asked the Minister for Finance the number of cigarettes a person may legally bring into this jurisdiction; if any consideration has been given to amend the limit on the amount that may be brought in; and if he will make a statement on the matter. [30843/13] ",
        "answerText": " Minister for Finance  I am advised by the Revenue Commissioners, who have responsibility for the collection of tobacco products tax, that, in accordance with section 104(2) of the Finance Act 2001, tobacco products tax is not chargeable on cigarettes that are bought tax-paid by a private individual in another member state of the European Union, provided that the cigarettes are for the individual’s own personal use and not for commercial purposes. The cigarettes must be personally transported and accompanied into the State by that individual. This provision is in accordance with article 32 of Council Directive 2008/118/EC of 16 December 2008 concerning the general arrangements for excise duty and repealing Directive 92/12/EEC. Applying a limit to the amount of cigarettes that can be brought in from another member state depends on whether the cigarettes are for an individual’s own private use or for commercial purposes and this falls to be determined in accordance with criteria set out in Part 4 of the Control of Excisable Products Regulations 2010. These include the reasons given by the person for having control or possession of the cigarettes and the quantity involved. In accordance with EU law, the indicative guide level as to what constitutes a quantity consistent with personal use is set at 800 cigarettes.  A maximum of 200 cigarettes may be brought into the State from outside the EU or from territories where EU rules on VAT and excise duties do not apply, such as the Canary Islands. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-06-25",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-06-25",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-25/writtens/mul@/dbsect_150.xml"
            }
          },
          "debateSectionId": "dbsect_150",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-25/writtens/dbsect_150",
          "showAs": "Tax Reliefs Availability"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-06-25/pq_192",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 192,
        "showAs": " 192. Deputy Paschal Donohoe asked the Minister for Finance if he has had the opportunity to examine the possibility of amending Section 469 of the Taxes Consolidation Act 1997 in respect of persons claiming reimbursement of their physiotherapy expenses through self-referral; and if he will make a statement on the matter. [30232/13] ",
        "answerText": " Minister for Finance  I propose to take Questions Nos. 188 and 192 together.  The position is, as I have stated on many occasions in the House, that this issue was raised during the debates in the Seanad on Finance Bill 2013, during which I agreed to re-examine the matter during the course of this year.  My Department is currently in the process of examining the issue and when the analysis is completed and the findings are presented to me, I will make any necessary decisions in the context of Finance (No. 2) Bill 2013. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-06-25",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-06-25",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-25/writtens/mul@/dbsect_249.xml"
            }
          },
          "debateSectionId": "dbsect_249",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-25/writtens/dbsect_249",
          "showAs": "Education Grants"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-06-25/pq_294",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 294,
        "showAs": " 294. Deputy Paschal Donohoe asked the Minister for Education and Skills if he will extend the remote area grant for island children to all boarding schools including those currently not eligible for the grant which would assist when parents wish to send their children to boarding schools rather than boarding houses; and if he will make a statement on the matter. [30682/13] ",
        "answerText": " Minister for Education and Skills  The purpose of the Remote Area Boarding Grant is to give pupils who are educationally disadvantaged because of their remoteness from schools an opportunity to attend school on the same basis as other pupils not so disadvantaged. Pupils resident on off-shore islands that do not have a school providing suitable free second-level education may also qualify for assistance under the scheme. The grant is paid to the parents of the qualifying child. It is the responsibility of parents to ensure that the accommodation which they secure for their child is of an acceptable standard. My Department has no plans to extend the scheme to include schools outside of the free education system. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-06-25",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-06-25",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-25/writtens/mul@/dbsect_393.xml"
            }
          },
          "debateSectionId": "dbsect_393",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-25/writtens/dbsect_393",
          "showAs": "Residency Permits"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-06-25/pq_451",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 451,
        "showAs": " 451. Deputy Paschal Donohoe asked the Minister for Justice and Equality the position regarding an application for residency in the State in respect of a person (details supplied) in Dublin 1; and if he will make a statement on the matter. [30185/13] ",
        "answerText": " Minister for Justice and Equality  I am informed by officials in the Irish Naturalisation and Immigration Service, INIS, that the person referred to by the Deputy made an application for a permanent residence card to the EU treaty rights unit on 5 April, 2013. This application is currently under consideration and a decision will issue in the matter shortly.  Queries in relation to the status of individual immigration cases may be made directly to the INIS by e-mail using the Oireachtas Mail facility which has been specifically established for this purpose. This service enables up to date information on such cases to be obtained without the need to seek information by way of the parliamentary questions process. The Deputy may consider using the e-mail service except in cases where the response from the INIS is, in the Deputy’s view, inadequate or too long awaited. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-06-25",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-06-25",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-25/writtens/mul@/dbsect_417.xml"
            }
          },
          "debateSectionId": "dbsect_417",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-25/writtens/dbsect_417",
          "showAs": "Legislative Programme"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-06-25/pq_487",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 487,
        "showAs": " 487. Deputy Paschal Donohoe asked the Minister for Justice and Equality when he expects to have the Immigration, Residence and Protection Bill published; and if he will make a statement on the matter. [30732/13] ",
        "answerText": " Minister for Justice and Equality  I propose to take Questions Nos. 474 and 487 together.  I refer the Deputy to my reply to today's Parliamentary Questions 567 and 568 and Parliamentary Question No. 393 of 18 June 2013. The position remains the same:   Work  on the details of the Immigration, Residence and Protection Bill 2010 is ongoing at my Department pursuant to current Government policy which is committed, under the Programme for National Recovery, to \"introduce comprehensive reforms of the immigration, residency and asylum systems, which will include a statutory appeals system and set out rights and obligations in a transparent way\". As I have outlined previously to the Joint Committee on Justice, Equality and Defence, several hundred amendments to the Bill are anticipated, the majority of a technical nature. I also expressed the considered view that instead of engaging in an extremely cumbersome process of tabling hundreds of amendments to the 2010 Bill, it would be much more efficient to publish a new and enhanced text. Such an approach can incorporate the many anticipated amendments while addressing key outstanding issues, several of which have been of concern to Members including those being raised by the Deputy on this occasion. This proposition was broadly welcomed by the Joint Committee and work on the Bill continues, therefore, on that basis while also taking account of any intervening matters of relevance such as decisions by the Courts. It remains my objective under this new approach, and subject to having to deal with the competing legislative demands of our EU/IMF/ECB Programme commitments, to be in a position to bring a revised Bill to Government for approval and publication before the end of the year.\"   Pending the enactment and commencement of the new legislation and with a view to improving processing in the area of international protection, I am proposing to introduce new arrangements for the processing of subsidiary protection applications in light of recent judgments in the Superior Courts. My Department, in consultation with the Attorney General's Office, is developing a new legislative and administrative framework for the processing of current and future subsidiary protection applications. This work is being given high priority and applicants will be advised of the new arrangements as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-06-25",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-06-25",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-25/writtens/mul@/dbsect_509.xml"
            }
          },
          "debateSectionId": "dbsect_509",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-25/writtens/dbsect_509",
          "showAs": "HSE Properties"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-06-25/pq_568",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 568,
        "showAs": " 568. Deputy Paschal Donohoe asked the Minister for Health if the Health Service Executive has indicated its plans in respect of using a building (details supplied) in Dublin 7; and if he will make a statement on the matter. [30225/13] ",
        "answerText": " Minister for Health  Management of the healthcare property portfolio is a service matter. Therefore your question has been referred to the Health Service Executive for direct reply. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-06-25",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-06-25",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-25/writtens/mul@/dbsect_598.xml"
            }
          },
          "debateSectionId": "dbsect_598",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-25/writtens/dbsect_598",
          "showAs": "State Properties"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-06-25/pq_663",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 663,
        "showAs": " 663. Deputy Paschal Donohoe asked the Minister for Transport, Tourism and Sport if he will direct the board of Córas Iompar Éireann to undertake enhancement works to a site (details supplied) in Dublin 1 pending its redevelopment in order to make a contribution to the enhancement of the city.  [30533/13] ",
        "answerText": " Minister for Transport, Tourism and Sport  The issue raised is a matter for Córas Iompair Éireann and I have referred the Deputy's question to CIÉ for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-06-25",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-06-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-20/writtens/mul@/dbsect_157.xml"
            }
          },
          "debateSectionId": "dbsect_157",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-20/writtens/dbsect_157",
          "showAs": "National Monuments"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-06-20/pq_142",
        "to": {
          "roleType": null,
          "showAs": "Arts",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 142,
        "showAs": " 142. Deputy Paschal Donohoe asked the Minister for Arts, Heritage and the Gaeltacht when he expects a decision to be made on whether works will be permitted to take place on a monument (details supplied) in Dublin 1; and if he will make a statement on the matter. [29720/13] ",
        "answerText": " Minister for Arts, Heritage and the Gaeltacht  I propose to take Questions Nos. 142 and 144 together.  I refer to the reply to Question No. 4 on 30 May 2013. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-06-20",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-06-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-20/writtens/mul@/dbsect_268.xml"
            }
          },
          "debateSectionId": "dbsect_268",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-20/writtens/dbsect_268",
          "showAs": "Road Network"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-06-20/pq_256",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 256,
        "showAs": " 256. Deputy Paschal Donohoe asked the Minister for Transport, Tourism and Sport if his attention has been drawn to the National Roads Authority's planned closure of the Dublin Port tunnel on seven separate occasions between now and 21 June 2013; if he will indicate the actions the NRA has proposed to undertake to ensure that HGVs do not use roads along the River Tolka in the North Strand and East Wall areas of Dublin; and if he will make a statement on the matter.  [29706/13] ",
        "answerText": " Minister for Transport, Tourism and Sport  As Minister for Transport, Tourism & Sport, I have responsibility for overall policy and funding in relation to the national roads programme.  The planning, design and implementation of individual road projects is a matter for the National Roads Authority (NRA) under the Roads Acts 1993 to 2007 in conjunction with the local authorities concerned. Any planned closures of the Dublin Port Tunnel is a matter for the NRA.  Noting the above position, I have referred the Deputy’s question to the NRA for direct reply.  Please advise my private office if you don’t receive a reply within 10 working days. Traffic Management in relation to HGVs is a matter for the relevant local authority, in this case, Dublin City Council. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-06-20",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-06-19",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-19/writtens/mul@/dbsect_215.xml"
            }
          },
          "debateSectionId": "dbsect_215",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-19/writtens/dbsect_215",
          "showAs": "Immigration Status"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-06-19/pq_170",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 170,
        "showAs": " 170. Deputy Paschal Donohoe asked the Minister for Justice and Equality if he will provide an update on an application submitted by a person (details supplied) in Dublin 7 to extend their leave to remain here; and if he will make a statement on the matter. [29612/13] ",
        "answerText": " Minister for Justice and Equality  The person concerned has had her permission to remain in the State renewed for a further three year period, valid to 25th June, 2016. This decision was conveyed in writing to the person concerned by letter dated 17th June, 2013.  Queries in relation to the status of individual immigration cases may be made directly to the INIS by e-mail using the Oireachtas Mail facility which has been specifically established for this purpose. This service enables up to date information on such cases to be obtained without the need to seek information by way of the Parliamentary Questions process. The Deputy may consider using the e-mail service except in cases where the response from the INIS is, in the Deputy’s view, inadequate or too long awaited. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-06-19",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-06-18",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-18/writtens/mul@/dbsect_211.xml"
            }
          },
          "debateSectionId": "dbsect_211",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-18/writtens/dbsect_211",
          "showAs": "International Agreements"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-06-18/pq_210",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 210,
        "showAs": " 210. Deputy Paschal Donohoe asked the Minister for Social Protection if Ireland has a social security agreement in place with Serbia; should one be in place, if an Irish citizen in receipt of disability allowance here would be able to receive a similar assistance payment in Serbia; and if she will make a statement on the matter. [28746/13] ",
        "answerText": " Minister for Social Protection  Ireland does not have a bilateral agreement with Serbia and none is planned. There is an EU Stabilisation and Association agreement with Serbia in place which covers, amongst other things, cooperation in matters of social security. However, the social security provisions are not yet in force and a decision of the EU Stabilisation and Association Council would be needed to put this aspect of the agreement into operation. International agreements on social security, including the agreement mentioned above, generally deal with issues relating to long-term contributory payments such as invalidity and old age pensions. Non-contributory payments are not usually dealt with in such agreements and are provided in accordance with domestic legislation only and are not exportable. Accordingly, an Irish citizen living in Serbia would need to satisfy the legislation of that country in order to receive any payment similar to disability allowance there. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-06-18",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-06-18",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-18/writtens/mul@/dbsect_458.xml"
            }
          },
          "debateSectionId": "dbsect_458",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-18/writtens/dbsect_458",
          "showAs": "Child Poverty"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-06-18/pq_475",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 475,
        "showAs": " 475. Deputy Paschal Donohoe asked the Minister for Children and Youth Affairs when she will make a decision on the application to be included in the Government's area based response to child poverty initiative submitted by the Docklands and East Inner City Consortium; and if she will make a statement on the matter.  [28777/13] ",
        "answerText": " Minister for Children and Youth Affairs  My Department is implementing the new Area-Based Response to Child Poverty programme which was announced as part of Budget 2013. The programme is being introduced on foot of the Programme for Government commitment to adopt an area-based approach to child poverty, drawing on best international practice and existing services to break the cycle of child poverty where it is most deeply entrenched and improve the outcomes for children and young people. The programme will build on and continue much of the work of the Prevention and Early Intervention Programme (PEIP) which was also implemented by my Department.  The three existing PEIP sites and at least three additional sites are expected to participate in the new programme. In addition, it is my intention to broaden the impact of the programme by beginning the process of mainstreaming some of the evidence-based programmes which have been positively evaluated and are cost-effective. The establishment of my Department's new Child and Family Agency later this year will be important to this process.  Applications to participate in the programme were invited from interested not for profit consortia earlier this year. The closing date for receipt of applications was 31st May and fifty applications were received, including the one referred to by the Deputy. These are currently being reviewed by officials in my Department assisted by members of the cross-Departmental Project Team which is overseeing the process. When completed, I hope to be in a position to announce successful applicants later this year. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-06-18",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-06-11",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-11/writtens/mul@/dbsect_338.xml"
            }
          },
          "debateSectionId": "dbsect_338",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-11/writtens/dbsect_338",
          "showAs": "Work Permit Applications"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-06-11/pq_370",
        "to": {
          "roleType": null,
          "showAs": "Jobs",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 370,
        "showAs": " 370. Deputy Paschal Donohoe asked the Minister for Jobs, Enterprise and Innovation if he will provide an update on the status of a work permit application submitted by a person (details supplied); the timeframe within which he expects the application to be fully processed; and if he will make a statement on the matter. [27800/13] ",
        "answerText": " Minister for Jobs, Enterprise and Innovation  A work permit application has been received in respect of this person on 13th May 2013. I understand that a decision will made in the coming days in relation to this case. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-06-11",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-06-11",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-11/writtens/mul@/dbsect_402.xml"
            }
          },
          "debateSectionId": "dbsect_402",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-11/writtens/dbsect_402",
          "showAs": "Employment Support Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-06-11/pq_442",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 442,
        "showAs": " 442. Deputy Paschal Donohoe asked the Minister for Social Protection further to Parliamentary Question No. 421 of 28 May 2013, the progress to date on the specific targets that were published in the Government's Pathways to Work strategy (details supplied); and if she will make a statement on the matter. [27491/13] ",
        "answerText": " Minister for Social Protection  Pathways to Work represents the single biggest ever change to how the State engages with, and provides services to, people who are unemployed. It is delivering on the Programme for Government commitment to set up a National Employment and Entitlements Service and involves a multiannual programme of complex legislative, organisation, process, people, and work change running to the end of 2014.  There are five strands to the Pathways approach relating to  1. Engagement with people who are unemployed.  2. The provision of activation places and opportunities  3. Incentivising the take-up of opportunities  4. Working with employers  5. Reforming institutions  We have made good progress on all strands. The Deputy will be aware of the institutional changes arising from the merger of the Community Welfare Service and FÁS employment services with my Department – both of which were transferred on time and within budget at the start of last year. Progress has been made on working with employers through the establishment of an Employer Engagement Unit within my Department. With regard to activation places and opportunities 2012 saw the very successful roll-out of JobBridge and TÚS while Budget 2013 provided for an additional 13,000 places on various employment schemes representing a 30% increase on existing provision. Jobseekers have a stronger incentive to take up these and other employment opportunities by virtue of changes to referral processes, payment arrangements in respect of casual work and the introduction of penalty rates of payment for non-engagement with activation initiatives.  The impact of the Pathways approach is most evident in the more frequent and more intensive manner of our engagement with jobseekers. For example 68,600 clients participated in a group engagement process last year, while over 40,000 clients have benefitted from such engagements already this year. Similarly the Department conducted 158,000 initial one-to-one guidance interviews with jobseekers last year. The target is to complete 185,000 initial interviews in 2013. Significantly under the Intreo model being rolled out across the country, the process of engagement starts immediately when a client registers for a Jobseekers payment and is informed by a personal profile captured in respect of each individual. In the past no such profiles were captured and clients had to wait at least three months before being invited to a Group Engagement. In addition decision times in respect of jobseeker claims are significantly reduced from an average of four weeks under the old method of operation to under a week, and in most cases to no more than 2/3 days, in Intreo offices.  The first twelve Intreo offices are now live and it is intended to convert circa 30 additional offices to full Intreo working by the end of this year and to complete the full roll-out to all 63 offices of the Department in 2014. It is to be noted that key elements of the Intreo model are being rolled-out in advance of the physical modification of offices. Personal profiling is already in place in all offices while individual progression planning and the accelerated integrated decision process will be operational in all offices by the end of this year.  With respect to plans for 2013 I have published a comprehensive set of performance targets, set out on a on a quarter by quarter basis, on the Department’s website www.welfare.ie and will publish performance against these targets starting in July of this year. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-06-11",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-06-11",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-11/writtens/mul@/dbsect_578.xml"
            }
          },
          "debateSectionId": "dbsect_578",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-11/writtens/dbsect_578",
          "showAs": "EU Conventions"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-06-11/pq_662",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 662,
        "showAs": " 662. Deputy Paschal Donohoe asked the Minister for Justice and Equality if he will outline the constitutional difficulties identified by his Department in respect of Ireland's ability to sign up to and ratify the European Convention on preventing and combating violence against women and domestic violence; and if he will make a statement on the matter. [27134/13] ",
        "answerText": " Minister for Justice and Equality  I propose to take Questions Nos. 647, 648, 661, 662, 666, 667, 672, 678, 681, 683, 713, 718, 719, 723, 729, 730, 734, 737 and 739 together.  Ireland supports, in principle, the aims and terms of the Council of Europe Convention on preventing and combating violence against women and domestic violence.  It is a detailed Convention with a very broad scope across a number of policy areas with potential policy and legislative implications. The provisions of the Convention and the legislative and administrative arrangements that would be necessary to allow signature and ratification of the Convention by Ireland are being examined in conjunction with the government commitment to introduce consolidated and reformed domestic violence legislation to address all aspects of domestic violence, threatened violence and intimidation, in a way that provides protection to victims.  However, a particular difficulty to be addressed in Ireland’s consideration of the Convention relates to reconciling property rights under the Irish constitution with the requirement under Article 52 of the Convention - the availability of emergency barring orders. The development of the consolidated and reformed legislation, including consideration of the Convention provisions, will be progressed as soon as possible having regard to the need for consultations and other legislative priorities in my Department.  I should also inform you that, to date, 30 Council of Europe member states have signed the Convention of which four have ratified it. Of these just one EU member state, Portugal, has as yet ratified the convention. The convention has not yet entered into force as this requires at least ten ratifications, including 8 Council of Europe member states. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-06-11",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-06-11",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-11/writtens/mul@/dbsect_812.xml"
            }
          },
          "debateSectionId": "dbsect_812",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-11/writtens/dbsect_812",
          "showAs": "Orthodontic Services Waiting Lists"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-06-11/pq_921",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 921,
        "showAs": " 921. Deputy Paschal Donohoe asked the Minister for Health when a person (details supplied) in Dublin 7 will receive orthodontic treatment; and if he will make a statement on the matter. [26695/13] ",
        "answerText": " Minister of State at the Department of Health  The HSE provides orthodontic treatment to patients based on their level of clinical need. An individual's access to orthodontic treatment is determined against a set of clinical guidelines and priority is given to patients with greatest needs. The HSE has been asked to examine the specific query raised by the Deputy and to reply to him as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-06-11",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-06-11",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-11/writtens/mul@/dbsect_976.xml"
            }
          },
          "debateSectionId": "dbsect_976",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-06-11/writtens/dbsect_976",
          "showAs": "Driving Licence Renewals"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-06-11/pq_1098",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1098,
        "showAs": " 1098. Deputy Paschal Donohoe asked the Minister for Transport, Tourism and Sport when issues surrounding category two driving licences will be resolved in view of the fact that renewal applicants with medical conditions will not be eligible to reapply for such a licence; and if he will make a statement on the matter. [27513/13] ",
        "answerText": " Minister for Transport, Tourism and Sport  I assume that the Deputy is referring to the two Groups into which driving licences are divided for the purpose of legislation on medical fitness to drive.  Irish legislation with regard to medical fitness to drive is governed by EU law, which we are required to follow.  The legislation in this regard is set out in the Road Traffic (Licensing of Drivers) Regulations 2006 (S.I. No. 537 of 2006), as amended, in particular, by the Road Traffic (Licensing of Drivers) (Amendment) (No. 2) Regulations 2010 (S.I. No. 544 of 2010).  The most recent change to regulations regarding medical fitness to drive was made in S.I. No. 544 of 2010, which transposed into Irish law two EU Directives, Commission Directive No. 2009/112/EC of 25 August 2009 and Commission Directive No. 2009/113/EC of 25 August 2009.  These Directives revised EU standards on medical fitness to drive in a number of areas, including eyesight, epilepsy, and diabetes mellitus.  The Deputy may wish to note my replies to Question 634 of 12 June 2012 and Question 541 of 10 July 2012 on this matter.  We are compliant with EU law, and there are no planned revisions. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-06-11",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-05-28",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-28/writtens/mul@/dbsect_253.xml"
            }
          },
          "debateSectionId": "dbsect_253",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-28/writtens/dbsect_253",
          "showAs": "Pupil-Teacher Ratio"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-05-28/pq_299",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 299,
        "showAs": " 299. Deputy Paschal Donohoe asked the Minister for Education and Skills if he will consider phasing in the larger pupil-teacher ratio in vocational education committee schools over a longer time period; and if he will make a statement on the matter. [25919/13] ",
        "answerText": " Minister of State at the Department of Education and Skills  The pupil teacher ratio (PTR) for the Post Leaving Certificate (PLC) programme is due to change from 17:1 to 19:1 with effect from 1 September 2013 for the 2013/2014 academic year in accordance with the decision taken by the Government last year as part of the budgetary process. I have no plans to phase in this PTR increase. However, Chief Executive Officers of Vocational Educational Committees (VECs) were invited to forward impact statements to my Department on the effect of this regression on their PLC provision. A review of these impact statements was conducted having regard to the need to operate within overall budgetary constraints and the Employment Control Framework. Following this review some alleviation of the reduction in teaching posts is being allowed to those VECs who were losing six or more posts as a transitional measure. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-05-28",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-05-28",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-28/writtens/mul@/dbsect_254.xml"
            }
          },
          "debateSectionId": "dbsect_254",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-28/writtens/dbsect_254",
          "showAs": "Post-Leaving Certificate Courses"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-05-28/pq_300",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 300,
        "showAs": " 300. Deputy Paschal Donohoe asked the Minister for Education and Skills if he will consider removing the cap on the number of students in vocational education committee controlled schools; and if he will make a statement on the matter. [25920/13] ",
        "answerText": " Minister of State at the Department of Education and Skills  While there is a finite number of places for which funding can be made available there is no actual cap on the number of students that can be enrolled in Vocational Educational Committee (VEC) schools. In 2012/2013 PLC providers enrolled 35,609 learners which is a commendable achievement We welcome the fact that VECs/schools are endeavouring to cater for as many learners as possible within their allocations. My Department funds the Post Leaving Certificate (PLC) programme by allocating places to VECs and other schools. The total number of places available nationwide is 32,688. My Department is not in a position to increase this number as there is a continuing requirement to plan and control numbers and to manage expenditure within the context of overall educational policy and provision. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-05-28",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-05-28",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-28/writtens/mul@/dbsect_302.xml"
            }
          },
          "debateSectionId": "dbsect_302",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-28/writtens/dbsect_302",
          "showAs": "Jobseeker's Allowance Payments"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-05-28/pq_360",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 360,
        "showAs": " 360. Deputy Paschal Donohoe asked the Minister for Social Protection the reason behind a decision to deduct €6.40 from the jobseeker's allowance of a person (details supplied) in Dublin 1; and if she will make a statement on the matter. [25172/13] ",
        "answerText": " Minister for Social Protection  The person concerned was engaged in casual employment between June 2012 and October 2012 while claiming jobseeker’s assistance. His weekly payments were adjusted to take account of the number of days worked that he had declared. However, in light of information subsequently received from his employer, his entitlement for this period was reviewed and an overpayment of €202.80 was assessed in respect of this period. The person concerned was advised of this on 17 May 2013 and requested to consider agreeing to weekly deductions of €6.40 per week from his jobseeker’s assistance in order to recover the amount of the overpayment. This matter will now be reviewed as the family rate of payment for the periods that the person concerned engaged in casual employment may need to be adjusted. The person concerned will be advised of the outcome of this review. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-05-28",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-05-28",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-28/writtens/mul@/dbsect_319.xml"
            }
          },
          "debateSectionId": "dbsect_319",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-28/writtens/dbsect_319",
          "showAs": "Jobseeker's Allowance Claim Durations"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-05-28/pq_377",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 377,
        "showAs": " 377. Deputy Paschal Donohoe asked the Minister for Social Protection further to Parliamentary Question No. 326 of 14 May 2013, if she will outline the average duration of time spent on jobseeker's allowance for each age category laid out in that reply; and if she will make a statement on the matter. [25356/13] ",
        "answerText": " Minister for Social Protection  The average duration of time for which persons reported in Parliamentary Question No. 326 of 14 May 2013 are in receipt of jobseeker's allowance is 1,185 days (3.24 years). The attached tabular statement details the average duration of claims in each of the age categories identified previously.  Average claim durations of jobseeker’s assistance at 27 April 2013 for the group reported in Parliamentary Question No. 326 of 14 May 2013.     -    Under 20    20-24    25-34    35-44    45-54    55-59    60-64    Overall Average      Days    228    743    1,527    1,810    1,987    2,348    2,641    1,185      Years    0.62    2.03    4.18    4.85    5.44    6.43    7.23    3.24    ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-05-28",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-05-28",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-28/writtens/mul@/dbsect_355.xml"
            }
          },
          "debateSectionId": "dbsect_355",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-28/writtens/dbsect_355",
          "showAs": "Pathways to Work Strategy"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-05-28/pq_421",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 421,
        "showAs": " 421. Deputy Paschal Donohoe asked the Minister for Social Protection the progress to date on delivering on the targets outlined in the Pathways to Work strategy, namely, to ensure that 75,000 of those long-term unemployed in 2012 will move into employment by 2015, to reduce the average time spent on the live register from 21 months to less than 12 months; if he will ensure that employers have access to and are offered suitable candidates to fill full-time vacancies and that the proportion of vacancies filled by her Department's employment services from the live register is at least to 40% by 2015; and if she will report on the current position on each of these targets. [25921/13] ",
        "answerText": " Minister for Social Protection  Pathways to Work represents the single biggest ever change to how the State engages with, and provides services to, people who are unemployed. It is delivering on the Programme for Government commitment to set up a National Employment and Entitlements Service and involves a multi-annual programme of complex legislative, organisation, process, people, and work change running to the end of 2014. There are five strands to the Pathways approach relating to:  - Engagement with people who are unemployed;  - The provision of activation places and opportunities;  - Incentivising the take-up of opportunities;  - Working with employers; and  - Reforming institutions  We have made good progress on all strands. The Deputy will be aware of the institutional changes arising from the merger of the Community Welfare Service and FÁS employment services with my Department – both of which were transferred on time and within budget at the start of last year. Progress has been made on working with employers with the establishment of an Employer Engagement Unit within my Department. With regard to activation places and opportunities 2012 saw the very successful roll-out of JobBridge and TÚS while Budget 2013 provided for an additional 13,000 places on various employment schemes representing a 30% increase on existing provision. Jobseekers have a stronger incentive to take up these and other employment opportunities by virtue of changes to referral processes, payment arrangements in respect of casual work and the introduction of penalty rates of payment for non-engagement with activation initiatives.  The impact of the Pathways approach is most evident in the more frequent and more intensive manner of our engagement with jobseekers. For example 68,600 clients participated in a group engagement process last year, while over 40,000 clients have benefitted from such engagements already this year. Similarly the Department conducted 158,000 initial one-to-one guidance interviews with jobseekers last year. The target is to complete 185,000 initial interviews in 2013. Significantly under the Intreo model being rolled out across the country, the process of engagement starts immediately when a client registers for a Jobseekers payment and is informed by a personal profile captured in respect of each individual. In the past no such profiles were captured and clients had to wait at least three months before being invited to a Group Engagement. In addition decision times in respect of jobseeker claims are significantly reduced from an average of four weeks under the old method of operation to under a week, and in most cases to no more than 2/3 days, in Intreo offices.  The 12 twelve Intreo offices are now live and it is intended to convert 40 offices to full Intreo working by the end of this year and to complete the full roll-out to all 63 offices of the Department in 2014. It is to be noted that key elements of the Intreo model are being rolled-out in advance of the physical modification of offices. Personal profiling is already in place in all offices while individual progression planning and the accelerated integrated decision process will be operational in all offices by the end of this year.  With respect to plans for 2013 I have published a comprehensive set of performance targets, set out on a on a quarter by quarter basis, on the Department's website www.welfare.ie and will publish performance against these targets starting in July of this year. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-05-28",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-05-28",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-28/writtens/mul@/dbsect_365.xml"
            }
          },
          "debateSectionId": "dbsect_365",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-28/writtens/dbsect_365",
          "showAs": "National Museum"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-05-28/pq_432",
        "to": {
          "roleType": null,
          "showAs": "Arts",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 432,
        "showAs": " 432. Deputy Paschal Donohoe asked the Minister for Arts, Heritage and the Gaeltacht the action being taken for the upkeep of State owned artefacts, as these artefacts need to be protected in specialised wrapping that were gathered during the course of excavation works by archaeological companies that have since ceased trading; and if he will make a statement on the matter. [25353/13] ",
        "answerText": " Minister for Arts, Heritage and the Gaeltacht  The Deputy will appreciate that National Museum of Ireland is an independent autonomous body and that I as Minister, have no statutory responsibility in relation to the day-to-day operational issues.  I am advised that the National Museum of Ireland is making every possible effort to ensure the safety and proper storage of artefacts excavated by private archaeological companies. All archaeological excavation in the State is carried out under the terms of a Licence issued by myself as Minister, and those terms confer on the licensed archaeologist a responsibility to care for any artefacts discovered during the excavation until these are deposited with the National Museum of Ireland, or by agreement, with a Designated Local Museum. That responsibility of care includes the requirement to provide for the proper conservation, documentation and packing of the artefacts and because of the complexity of modern archaeological excavation, there can often be a considerable lapse of time between the completion of the on-site phase of excavation works and the final deposition of artefacts.  The Museum operates a dedicated store for artefacts from archaeological excavations in its new Collections Resource Centre. I am further advised by the National Museum that a relatively small number of archaeological companies have ceased trading and in most of these cases the archaeologists involved have continued to work with the National Museum in preparing material for deposition, even after the company had technically ceased trading. As a result, a considerable amount of the artefacts held by these companies has already been deposited in the Museum and most of the remainder is being actively prepared for deposition.  The National Museum continues to maintain active communication with all archaeological companies (including the personnel of companies that have ceased trading) to ensure that everything possible is being done to prepare artefacts for deposition in the Museum, and to ensure that the artefacts are being properly cared for in the meantime. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-05-28",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-05-28",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-28/writtens/mul@/dbsect_424.xml"
            }
          },
          "debateSectionId": "dbsect_424",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-28/writtens/dbsect_424",
          "showAs": "Unfinished Housing Developments Data"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-05-28/pq_498",
        "to": {
          "roleType": null,
          "showAs": "Environment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 498,
        "showAs": " 498. Deputy Paschal Donohoe asked the Minister for the Environment, Community and Local Government if any review of the derelict sites legislation has been conducted by his Department since 2011; and if he will make a statement on the matter. [25922/13] ",
        "answerText": " Minister of State at the Department of the Environment, Community and Local Government  I am chairing the National Co-ordination Committee on Unfinished Housing Developments to oversee implementation of the Report of the Advisory Group on Unfinished Housing Developments, together with the Government’s response to the recommendations. The Committee includes representatives from the Irish Banking Federation, local authorities, the Housing and Sustainable Communities Agency, NAMA and the construction sector. Real progress is being made with regard to the public safety works required to improve the living conditions of existing residents on some unfinished estates and the Committee is meeting on a regular basis to oversee this effort.  As part of this process a Legislative Review Group has been established. Its remit is to review legislation, including the Derelict Sites Act 1990, with a view to assessing the various legislative provisions governing this area, and to make recommendations for strengthening or amending provisions to take account of the issues associated with unfinished developments, where necessary. In regard to the Derelict Sites Act 1990 the Group concluded that the legislation continues to serve its intended purpose. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-05-28",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-05-28",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-28/writtens/mul@/dbsect_464.xml"
            }
          },
          "debateSectionId": "dbsect_464",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-28/writtens/dbsect_464",
          "showAs": "Pension Provisions"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-05-28/pq_543",
        "to": {
          "roleType": null,
          "showAs": "Defence",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 543,
        "showAs": " 543. Deputy Paschal Donohoe asked the Minister for Defence the current pension entitlements in respect of a person (details supplied) in Dublin 7 who worked in his Department general headquarters between 1977 and 1993; and if he will make a statement on the matter. [25089/13] ",
        "answerText": " Minister for Defence  I am satisfied that the retirement benefits of the person in question were correctly calculated in accordance with the relevant Department of Finance circular. Full details of the method of calculation have been provided to the person in question. If she wishes to have any further information my Department would be happy to provide it. I can confirm that the person concerned is in receipt of her full pension entitlements under the terms of the non-contributory pension scheme for non-established State employees. Over the years, the rate of pension paid to the person concerned by the office of the paymaster general has been revised in line with centrally set pay and pension rates. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-05-28",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-05-28",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-28/writtens/mul@/dbsect_535.xml"
            }
          },
          "debateSectionId": "dbsect_535",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-28/writtens/dbsect_535",
          "showAs": "Mobility Allowance Decision"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-05-28/pq_614",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 614,
        "showAs": " 614. Deputy Paschal Donohoe asked the Minister for Health the plans that have been put in place to replace the mobility allowance and the motorised transport grant; when it will be put in place in view of the fact that the dissolution is due to take place in July 2013; and if he will make a statement on the matter. [25357/13] ",
        "answerText": " Minister of State at the Department of Health (Deputy Kathleen Lynch)  I propose to take Questions Nos. 614, 627, 670, 686 and 694 together.  The Government is very conscious of the needs of people with a disability. The payment of Mobility Allowance will continue until June. A Project Review Group has been working to seek solutions which do not run counter to the Equal Status Acts. An interim report regarding the immediate issue of the closure of the mobility allowance and motorised transport grant schemes has now been submitted to both Minister Reilly and myself and is under consideration with a view to bringing it to Government in the near future. A final report, looking at the wider issue of general transport for people with disabilities will be submitted in June. At this stage, it is not possible to pre-empt the outcome of the review or the decision of the Government. Announcements will be made following a Government decision on the matter. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-05-28",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-05-28",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-28/writtens/mul@/dbsect_564.xml"
            }
          },
          "debateSectionId": "dbsect_564",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-28/writtens/dbsect_564",
          "showAs": "Home Care Packages"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-05-28/pq_648",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 648,
        "showAs": " 648. Deputy Paschal Donohoe asked the Minister for Health when funding will be made available to allow for a home care package to be put in place allowing persons currently taking up a hospital bed to return home (details supplied); and if he will make a statement on the matter. [25350/13] ",
        "answerText": " Minister of State at the Department of Health  As this is a service matter it has been referred to the Health Service Executive for direct reply. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-05-28",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-05-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-23/writtens/mul@/dbsect_173.xml"
            }
          },
          "debateSectionId": "dbsect_173",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-23/writtens/dbsect_173",
          "showAs": "Residency Permits"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-05-23/pq_164",
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 164,
        "showAs": " 164. Deputy Paschal Donohoe asked the Minister for Justice and Equality the position regarding an application in respect of a person (details supplied) in Dublin 7; when this application will be considered; and if he will make a statement on the matter. [24903/13] ",
        "answerText": " Minister for Justice and Equality  I am informed by the Irish Naturalisation and Immigration Service that the person mentioned by the Deputy was registered in the State on 19/9/2006 as a student until 30 November 2012. I am advised that this case is being assessed on its merits and will be decided upon in the coming weeks.  All non-EEA students resident in the State are subject to the student immigration rules set out under the \"new immigration regime for full time non-EEA students which was published in September 2010 and has been in effect since 1 January 2011. These rules stipulate that non-EEA nationals may reside in Ireland as students, subject to the provisions of the new regime, for a maximum period of seven years. As this person arrived in the State in 2006 he is now classified as a timed out Student.  Queries in relation to the status of individual immigration cases may be made directly to the INIS by e-mail using the Oireachtas Mail facility which has been specifically established for this purpose. This service enables up-to-date information on such cases to be obtained without the need to seek information by way of the Parliamentary Questions process.  The Deputy may consider using the e-mail service except in cases where the response from the INIS is, in the Deputy's view, inadequate or too long awaited. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-05-23",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-05-22",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-22/writtens/mul@/dbsect_274.xml"
            }
          },
          "debateSectionId": "dbsect_274",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-22/writtens/dbsect_274",
          "showAs": "Foreign Adoptions"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-05-22/pq_241",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 241,
        "showAs": " 241. Deputy Paschal Donohoe asked the Minister for Children and Youth Affairs if he will provide an update from the Adoption Authority of Ireland on the status of an application for a child (details supplied) in Dublin 3 who was adopted from Cambodia three years ago; and if she will make a statement on the matter. [24508/13] ",
        "answerText": " Minister for Children and Youth Affairs  As this is a service matter relating to an individual case I have asked the Adoption Authority of Ireland to respond directly to the Deputy on this matter. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-05-22",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-05-21",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-21/writtens/mul@/dbsect_116.xml"
            }
          },
          "debateSectionId": "dbsect_116",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-21/writtens/dbsect_116",
          "showAs": "Charities Regulation"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-05-21/pq_148",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 148,
        "showAs": " 148. Deputy Paschal Donohoe asked the Minister for Finance if it is permitted for a registered charity to make a political donation and still be able to receive tax relief on their income; and if he will make a statement on the matter. [23676/13] ",
        "answerText": " Minister for Finance (Deputy Michael Noonan)  The charitable tax exemption scheme is administered by the Revenue Commissioners. In order to avail of the exemption, a body or trust must be established for charitable purposes only and must apply all of its income to charitable purposes. The Deputy is most likely aware that while bodies that hold a charitable tax exemption are not permitted to make donations that directly support political parties or candidates, they are however, permitted to apply their funds to activities that advance or promote their charitable purposes. Depending on the circumstances, these can include certain political lobbying and advocacy activities in support of their charitable purpose.  Procedures are in place to ensure that bodies that are granted charitable tax exemption are subject to periodic reviews to ensure that the terms of the exemption continue to be fulfilled. All relevant matters, including matters which have been brought to the Revenue Commissioners attention, are taken into account in the context of such reviews.  In regard to the specific issues raised by the Deputy, the Revenue Commissioners have indicated that in order to determine if any such item of expenditure satisfies the terms of a charitable tax exemption it is necessary to examine that expenditure, the context in which it was incurred and the charitable objects of the body incurring the expenditure in detail.  If the Deputy wishes to provide specific details then the Revenue Commissioners will investigate the issue to ensure the terms of the exemption in question are being adhered to. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-05-21",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-05-07",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-07/writtens/mul@/dbsect_171.xml"
            }
          },
          "debateSectionId": "dbsect_171",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-07/writtens/dbsect_171",
          "showAs": "Disability Allowance Appeals"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-05-07/pq_230",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 230,
        "showAs": " 230. Deputy Paschal Donohoe asked the Minister for Social Protection if she will provide an update on the status of an application for disability allowance in respect of a person (details supplied) in Dublin 7; and if she will make a statement on the matter. [21429/13] ",
        "answerText": " Minister for Social Protection  I am advised by the Social Welfare Appeals Office that an Appeals Officer, having fully considered all the evidence, disallowed the appeal of the person concerned by way of summary decision. The person concerned has been notified of the Appeals Officer’s decision.  Under Social Welfare legislation, the decision of the Appeals Officer is final and conclusive and may only be reviewed by the Appeals Officer in the light of new evidence or new facts.  The Social Welfare Appeals Office functions independently of the Minister for Social Protection and of the Department and is responsible for determining appeals against decisions on social welfare entitlements. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-05-07",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-05-07",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-07/writtens/mul@/dbsect_308.xml"
            }
          },
          "debateSectionId": "dbsect_308",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-07/writtens/dbsect_308",
          "showAs": "Medicinal Products Availability"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-05-07/pq_401",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 401,
        "showAs": " 401. Deputy Paschal Donohoe asked the Minister for Health if he will provide an update as to when the drug pirfenidone will be available in the Irish market for sufferers of idiopathic pulmonary fibrosis; and if he will make a statement on the matter. [21451/13] ",
        "answerText": " Minister of State at the Department of Health (Deputy Alex White)  I propose to take Questions Nos. 367, 369 to 371, inclusive, 401 and 402 together.  The HSE has received an application for the inclusion of pirfenidone in the GMS and community drugs schemes. The application is being considered in line with the procedures and timescales agreed last year by the Department of Health and the HSE with the Irish Pharmaceutical Healthcare Association (IPHA) for the assessment of new medicines.  In accordance with these procedures, the National Centre for Pharmacoeconomics (NCPE) conducted a pharmacoeconomic evaluation of pirfenidone and concluded that, at the submitted price, pirfenidone is not cost-effective for the treatment of patients with mild to moderate idiopathic pulmonary fibrosis.  The NCPE report is an important input to assist decision making and informs further discussions between the HSE and the manufacturer of the drug. The HSE is currently in negotiations with the manufacturers of pirfenidone and therefore it would not be appropriate to comment further while these negotiations are ongoing.  The HSE assessment process is intended to arrive at a decision on the funding of pirfenidone that is clinically appropriate, fair, consistent and sustainable. The HSE understands that patients and clinicians are very anxious that a decision be made as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-05-07",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-05-02",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-02/writtens/mul@/dbsect_129.xml"
            }
          },
          "debateSectionId": "dbsect_129",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-05-02/writtens/dbsect_129",
          "showAs": "Jobseeker's Allowance Appeals"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-05-02/pq_118",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 118,
        "showAs": " 118. Deputy Paschal Donohoe asked the Minister for Social Protection the position regarding an application for jobseeker's benefit in respect of a person (details supplied) in Dublin 1; and if she will make a statement on the matter. [20883/13] ",
        "answerText": " Minister for Social Protection  The person concerned applied for jobseeker's allowance on 4 October 2012 which was disallowed on the basis that he did not satisfy the condition of being habitually resident in the State; in addition he failed to satisfy a Social Welfare Inspector as to his means and circumstances. The person concerned was advised of both decisions on 26 November 2012. He lodged an appeal against them on 10 December 2012 and provided additional information relating to his employment record in the State. In light of this information his case was referred to a Social Welfare Inspector to review the means assessment; the outcome of this was that the decision of the original means assessment was upheld. The appeal was subsequently referred to the independent Social Welfare Appeals Office who will notify the person concerned of the outcome when it is determined. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-05-02",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    },
    {
      "contextDate": "2013-04-30",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-04-30/debate/mul@/dbsect_18.xml"
            }
          },
          "debateSectionId": "dbsect_18",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2013-04-30/debate/dbsect_18",
          "showAs": "Official Engagements"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2013-04-30/pq_13",
        "to": {
          "roleType": null,
          "showAs": "Taoiseach",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 13,
        "showAs": " 13. Deputy Paschal Donohoe asked the Taoiseach if he will detail his engagements at the recent World Economic Forum in Davos; and if he will outline the way these meetings will contribute towards our economic recovery. [20170/13] ",
        "answerText": " The Taoiseach  I propose to take Questions Nos. 4 to 13, inclusive, together.  I travelled to Davos, Switzerland, to attend the annual meeting of the World Economic Forum, WEF, from 23 to 25 January. The Minister for Finance, Deputy Noonan, was also invited by the WEF to attend the forum on this occasion, noting that it was taking place during Ireland's Presidency of the European Union. The World Economic Forum annual meeting is attended by political and business leaders and heads of international organisations from across the globe. The theme of this year's meeting was resilient dynamism.  On the Wednesday evening, I attended a function hosted by Professor Klaus Schwab, executive chairman of the forum, and also attended by other Heads of Government and the business council of the WEF. I participated in a number of formal events on the programme on prevailing global economic matters. These included a plenary panel session, entitled \"Eurozone Crisis - the Way Forward\", where I was a panellist alongside the then Prime Minister of Italy, Mr. Mario Monti, the Prime Minister of the Netherlands, Mr. Mark Rutte, and the Prime Minister of Denmark, Ms Helle Thorning-Schmidt. I also participated in a formal session on the theme of restoring Europe's dynamism beyond the current crisis, as well as a high-level discussion session on the prevailing global themes for 2013, such as the consequences of the US elections and China's 18th party congress, ongoing turbulence in the Middle East and the global financial issues.  During my time at the WEF, I also held bilateral meetings. I met Ms Christine Lagarde, managing director of the International Monetary Fund, IMF, along with the Minister for Finance, Deputy Noonan. We discussed progress in implementing Ireland's EU-IMF programme and noted that, in each of the quarterly reviews completed to date, Ireland was deemed to have achieved all of its commitments in terms of both policy reforms and quantitative targets set under the programme of assistance. I assured Ms Lagarde that the Government remained committed to achieving the fiscal targets set under the EU-IMF programme. We emphasised that our focus was on our exit strategy from the programme, our re-entry into the financial markets and our overall debt sustainability. We discussed progress in restructuring our banking system, including our ongoing negotiations with the ECB regarding the possible restructuring of the promissory note repayment schedule. We also discussed the Government's ambitious programme of structural reforms to support job creation and to generate economic growth.  I also met Ms Lagarde on 8 March during her visit to Dublin. We engaged in a productive and wide-ranging discussion, which included priorities being progressed as part of the Irish Presidency.  As regards other meetings while I was at the WEF, on Thursday evening, 24 January, the Minister, Deputy Noonan, and I participated in an event in Davos organised by IDA Ireland and attended by over 40 senior executives of major international companies. I outlined why Ireland remained one of the best locations in the world in which to invest and to do business. I also outlined the emphasis we would place on stability, growth and jobs during our Presidency of the European Union, which we have been doing. I acknowledged the vital contribution that many of the companies represented had made to Ireland and to our economy and urged those who were looking at potential locations for investment or expansion to consider Ireland very seriously.  The following day, I addressed the transatlantic business dialogue, which brings together leading figures from US and European business. The main focus of the meeting was to set out the priorities for Ireland's Presidency of the Union, including strengthening the EU-US trade and investment relationship. I also met individually with leaders of several major multinational firms from a variety of fields, principally in the high-tech and financial services areas.  The WEF provides an exceptional opportunity to interact with key players in the business world and I availed of the opportunity whenever possible to promote Ireland as a location for international business and investment. \n Deputy Micheál Martin  The Taoiseach let it slip in the Dáil the last time this issue arose that he had been taking an active interest in the Burmese mobile telecommunications situation during the Davos forum. He did not have time to follow up on that matter in the House, but will he explain why he was having discussions on this issue? Were they entirely coincidental or was he particularly interested in the Burmese situation?  On the Taoiseach's meetings with Ms Lagarde, she and the IMF have been calling for an easing of current policies within the EU, including further debt relief for Ireland, Portugal and others. Did the Taoiseach discuss these issues with her in Davos and Dublin? Does he support those calls? There is a sense from within the IMF, added to by President Barroso more recently, that the current policies emanating from Europe are too one-dimensional and that the focus on balancing the books alone and no other strand is damaging European economies. Our retail sales fell by 2% in the past month. The IMF has asked the UK to pull back on its deficit targets because the latter is going too quickly.  In the context of holding the EU Presidency, is the Taoiseach pushing for policy initiatives similar to those advocated by Christine Lagarde, the head of the IMF? Does he agree with her? Does he support her call and will he be doing anything in the remaining period of the Irish Presidency to advance the issue? \n The Taoiseach  In respect of telecommunications and Myanmar, I had a visit from a company interested in Irish potential in the area. I had an engagement with it about the possibilities it sees for Irish involvement in trading with a country that has enormous resources and has distinct possibilities for a trading nation such as this country. I have never been there. I discussed the matter briefly with a member of one of the international telecommunications companies in Davos, who attended the IDA-sponsored function where there were 40 chief executives of international companies. In Myanmar, less than 2 million people have had access to mobile communications out of a population of 60 million. A quantum leap will be involved in going from no communications to all the modern methods of communication. In many ways it will be a social experiment for a people who have had centuries of limited capacity to connect around the world.  I and the Minister for Finance, Deputy Noonan, met Christine Lagarde, the director of the IMF, and we discussed the issues of the day, namely, the promissory notes, debt reduction and the ongoing programme with this country of troika visits, including the IMF. We also referred to the decision of the European Council of 29 June 2012 to break the link between the sovereign and bank debt, the importance of the single supervisory mechanism being set up by the Ministers and approved by the European Council, with the architecture to be available by June of this year and to take effect on 1 March 2014. We discussed the question of banking union and the impact that could have on fractured systems throughout Europe which are very important for all the economies. It is clear that will be a test of credibility for the European Council meeting in June of this year, which is now being pursued by us as Presidency in respect of resolution and the issues that will have to be decided in that regard.  On whether I share the director’s view, the meeting was in advance of the promissory notes and we made the point about the difficulties it was causing for this country’s economy and people. We have already availed of a one-year extension. We have clearly set out our plan to have our deficit below 3% by 2015 and we intend to stick to that target. The IMF has in general been most supportive of this country’s claims for dealing with debt levels and the challenges we have and will face in the future. In that sense, it was a general discussion about European issues - our incoming Presidency; the priorities for us of growth, stability and jobs; the co-operation of the IMF in seeking to get the agreement and consent of our European colleagues for debt reduction in the extension of maturities, which has now happened; the question of the promissory notes; the structure of banking union; and how it might be possible to construct a situation where we could get money back for taxpayers arising from the recapitalisation this country was required to make a number of years ago. \n Deputy Mary Lou McDonald  In recent times President Barroso of the European Commission thought out loud and said in his view that austerity had reached its limits. Prior to that a former employee of the IMF, Ashoka Mody, said that reliance on austerity is counterproductive. Did the Taoiseach discuss any of those matters with Ms Lagarde or did he draw her attention to the huge dilemma we face within the domestic economy? Did he discuss with her growth-focused initiatives and policies that would be most suited to this country? Did the Taoiseach tease out with Ms Lagarde that people are now saying that the view within officialdom is that austerity has either run its course or is in some cases deepening problems? He knows as well as I do that as long as domestic demand and confidence are on the floor, we have a big problem in the domestic economy and, by extension, in respect of employment and unemployment rates. Did the Taoiseach explore any of those issues with Ms Lagarde?  The previous time the Taoiseach referred to discussions in Davos with people about the opening up of telecommunications was in the context of the G8 summit. I remind him that he said:  When speaking to people in Davos, the issue of the opening up of Myanmar, the former Burma, arose. It is a country of which we do not have great knowledge, although there were real connections between Ireland and Burma as it was called. That country of 60 million has a huge range of natural resources, yet some 58 million of its people have never had access to communications. That country will move from what might be termed ground zero to cloud computing and cloud access straight away. The scale of the investment there will be enormous.  That is what the Taoiseach said on 12 February. He clearly recognised a big investment opportunity in that regard. Will he elaborate a little more on whom he discussed those matters with in Davos? He said it was a member of an international company. Does he recall who it was or who they were? I ask that because I understand that Digicel, the company controlled by Denis O’Brien, is pursuing one of the two telephone licences currently on offer in Myanmar. Did that form part of the discussion? \n The Taoiseach  No, I did not discuss the questions Deputy McDonald raised arising from Mr. Barroso’s comments or the comments of Mr. Ashoka Mody, the former IMF employee, because they had not been made at that time. As I indicated to Deputy Martin, we discussed the range of priorities for our Presidency, the challenge for this country and the difficulties people were experiencing because we did not have a resolution on the promissory note, nor indeed a resolution in respect of an extension of lower maturities to flatten the debt profile. Neither did we have any real fix on the single supervisory mechanism. At that time, not much progress had been made on banking union, which will have an important part to play.  I made the point previously that when the gentleman from the IMF was in this country as one of the lead persons, he spoke in a very different way about the issue and the challenge arising from the much abused term, austerity. It is clear that one can neither tax one’s way back to prosperity nor achieve it through austerity. The challenge for us is to stimulate the indigenous economy and to restore a sense of confidence. In that sense, decisions made by Government have impacted on competitiveness, which has increased by 20%. We are creating 1,000 jobs per month in the private sector, which is important when compared with a loss of 7,000 a month for a number of previous years. An example of the progress made is the major announcement today by Glanbia of a significant investment which will create 500 jobs on the construction of the new plant in the south Kilkenny-Waterford area, which will provide up to 1,500 jobs on family farms from north-east Cork up to Louth, with the abolition of milk quotas. They are important signs of confidence. One should also note that a contract was signed this morning for the N11 and the Newlands Cross junction, which is a significant road development that will provide both transport links and contract jobs. It will allow the Government to move on to the next public private partnership priority, which is the road from Gort to Tuam.  I could not have discussed the question referred to by the Deputy with Mr. Barroso or Mr. Ashoka Mody. However, I did discuss the issue with Ms Lagarde.  In response to another of the Deputy's questions, I had no meeting or connection with Digicel in Davos. The chief executive that I spoke to was from a different company, from a northern European country with very significant international and Irish interests in telecommunications. Our discussion arose at the IDA-sponsored investment and continued investment in Ireland event. The company in question is Ericsson. \n Deputy Mary Lou McDonald  What was the name of the company? \n The Taoiseach  Ericsson. \n Deputy Joe Higgins  The foundation that organises the World Economic Forum is funded by about 1,000 of the biggest multinational corporations, typically grossing more than $5 billion in turnover annually. The gathering in Davos that the Taoiseach attended is by invitation only, bringing together the world's biggest capitalists, quite an array of leading right-wing politicians, including the Taoiseach, and the media. When the Taoiseach went strolling around the streets, if he had any spare time, he would be unlikely to run into a few plumbers from Castlebar or shop stewards from the local factory. It is fat cats all the way, representing big business interests and the philosophy emerging is overwhelmingly to propagate neo-liberal, right-wing economic policies. The philosophy is pro-privatisation and pro-race-to-the-bottom in terms of workers' rights. What is the purpose, therefore, of the Taoiseach visiting Davos and spending taxpayers' money rubbing shoulders with these people? The taxpayers funding his trip are the victims of this whole system. I have no doubt that many of the biggest financiers and bondholders who crashed the world economy and financial system, and who were doubtless investing here and gambling on the Irish property bubble, were rubbing shoulders with the Taoiseach as well. I ask him to desist from attending this particular forum in the future. Perhaps he could redeem himself by saying that he got some big, new idea coming home from Davos to transform our situation here but I cannot see any evidence of that, given that he is continuing the disastrous austerity policies right up to this moment. I ask the Taoiseach to explain himself and we can see if there is any justification for this visit. \n The Taoiseach  The World Economic Forum in Davos was in operation long before I occupied these benches. It is an opportunity to meet chief executives and senior business personnel from around the world, many of whom have investments in this country and who create jobs as a consequence, which is very important for our economy. It is not a case of rubbing shoulders with superior capitalists, as Deputy Higgins would call them. I did actually walk down the street to get something to eat in a non-exclusive restaurant. The Swiss manager there told me that he only serves Irish beef to his customers----- \n Deputy Joe Higgins  Without added horsemeat, one hopes. \n The Taoiseach  -----which is an indication of his connection with Ireland. He had been here on holidays on a number of occasions. It was far from the Deputy's vision of me rubbing shoulders with the elite, eating caviar and drinking wine because I know where I come from. \n Deputy Micheál Martin  So does the Minister of State, Deputy Ring. \n The Taoiseach  Deputy Higgins asked if I learned any new ideas at Davos and the answer is \"Yes\", quite a number. I did not meet any plumbers from Castlebar but the chief executive of the World Bank said in his contribution to the meetings that in the next 30 to 40 years, water will be one of the most critical issues, globally. In fact he argued that its shortage, use or misuse will be a cause of international concern within the next decade or so. It is also evident that Europe needs to get its act together in terms of developing an energy grid for the continent. The extent of drilling for shale gas in the United States is causing energy prices to drop there while in Europe, prices are 300% higher. This is of enormous significance, in terms of huge investments by international companies. That is why it is important that the inter-connector between Ireland and Britain is now up and running. Furthermore, the memorandum of understanding signed by the Minister for Communications, Energy and Natural Resources, Deputy Rabbitte, and his British counterpart recently for the sale of Irish renewable energy directly into the British market is also significant. I spoke to the Prime Ministers of Portugal and Spain yesterday about the importance of interconnection between both countries and connection on into France. This is an issue that cannot be allowed to drift on for years because it is very important for jobs in all of those economies.  The real value of Davos is the importance that others attach to discussions with them about their industries here, the productivity of the Irish work force and the extent of their public proclamations about doing business in a country like Ireland and the fact that they consider it important that one takes the time to talk to them about any concerns or anxieties they might have about corporate tax rates or other issues. It is important that one can provide reassurance to companies so that they will continue to want to invest here. The forum also allows one to meet particular chief executives or business people who are considering investing in Ireland. In conjunction with the IDA, it is important to be able to make a strong sales pitch for investment in Ireland.  When I had the privilege of opening the e-Bay-Paypal facility in Dundalk recently, the chief executive spoke to me of the company's happiness with the workforce, their productivity and the general business environment in Ireland. Positive comments about the workforce coming from individuals like that are much more important than similar comments coming from politicians. They are, after all, the front-line investors who actually make the decision to invest in this country, as distinct from others. It is all part of the programme to make us the best small country in the world in which to do business by 2015. \n Deputy Richard Boyd Barrett  Last weekend I was involved in organising a protest in Wicklow that saw 4,000 people come out and demonstrate at the Avondale Forest Park, the former home of Charles Stewart Parnell, against the Government's plan to sell off the harvesting rights to Ireland's forestry. In that context, while the Taoiseach was in Switzerland, did he speak to any foresters or anyone in the Swiss Government involved in the area of forestry? Had he done so, he might have discovered that the Swiss have a flourishing forestry sector and that a country half the size of Ireland has over 100,000 people working in forestry and would not dream of selling that resource to anyone. While the Taoiseach was rubbing shoulders with the great and the good at Davos, did he meet any representatives of Helvetia Wealth, the Swiss bank, a subsidiary of which is chaired by the former Taoiseach, Mr. Bertie Ahern, which has expressed an interest in taking over our forests? The Swiss certainly seem to understand the value of forestry. The Taoiseach, while in Davos, should have examined the question of how to manage public forestry properly and how to harness the value of public forestry for the economy.  In the Taoiseach's discussions about Ireland's economic plight and debt position, did he point out to Ms Lagarde, the people from the European Central Bank and those who are overseeing the austerity programme in this country that this year and for the following three years, 20% of all tax revenues in the State will be used to pay off debts? As of next year, this country will bring in more in tax than we are spending, meaning that 20% of all revenues will purely be used to pay off debts. It will not be used to pay nurses and doctors or front-line public sector workers, as the Taoiseach has claimed so often, but for next year and for many years after, we will borrow billions of euro purely to pay off debts, which were largely incurred as a result of the activities of private financial institutions.  Did the Taoiseach make that point to people like Ms Lagarde? We are paying our way and by next year we will be more than paying our way. It is grossly unjust, in that context, for a fifth of our tax revenues, according the Department of Finance figures, to be paid out in meeting the debts of private institutions. Did the Taoiseach point out the gross injustice and economic stupidity of this? Did he tell these people that the process is not sustainable? \n The Taoiseach  I am glad the Deputy was down in Avondale, which is a beautiful place, with a wonderful arboretum. It is a great place to go to reflect on the uncrowned high king of Ireland. In times to come, when the Deputy is sitting at the Cabinet table, he will be able to see the portrait of Mr. Parnell on the wall. The Deputy should think about that. \n Deputy Richard Boyd Barrett  He would turn in his grave if he thought the forests were being sold. \n Deputy Michael Ring  He would turn in his grave if he thought the Deputy was there. \n The Taoiseach  The Deputy can take up his discussions with our former Taoiseach, Mr. Bertie Ahern, who has some involvement in the matter, if he wishes to do so. \n Deputy Richard Boyd Barrett  I was just wondering if he was at Davos. \n The Taoiseach  I had no meeting with foresters in Switzerland but I did notice snow on the pine trees high in the mountains. The Government has not yet made a decision on the sale of State assets, including Coillte. I know that every weekend thousands of people avail of the beautiful opportunity to use the State forests for recreation purposes, including the trails, waterfalls, pathways, stiles and gates. I have been through many of them. When the Government makes its decision, is there a serious suggestion that all these amenities will be cast aside? We are talking about the potential that would arise from a cash crop of timber, and that clearly does not include the recreational areas of which people avail every weekend.  We discussed the question of debt sustainability and repayment with Ms Lagarde, as I noted in answer to Deputies Martin and McDonald, and we also discussed the question of having a requirement of borrowing €3.1 billion every year for ten years to deal with the promissory notes, which matter is now dealt with. The IMF was very favourable towards this country because of the steps being taken by the Government and the people to deal with these challenges. On every occasion that she could, Ms Lagarde was very forthright in her support for Ireland and in getting economic concessions from European colleagues.  It is true that we have made some improvement in the debt position and flattening the debt profile. Given our overall debt, there are serious challenges ahead, and we will not be able to deal with that until we get our public finances right and further increase our competitiveness and restore a sense of confidence to the national economy. The Government will continue to focus on access to credit for small and medium enterprises, SMEs, and opportunities to open those doors for those SMEs to feed off larger enterprises. We support the setting up of new businesses very strongly. I will meet the chief executive of the European Investment Bank later this afternoon to discuss further investment in potential infrastructure and, as a consequence, job opportunities in Ireland. \n Deputy Paschal Donohoe  I have three questions on the Taoiseach's engagement in Davos. The first relates to changes taking place in other countries with regard to corporation tax rates and the taxes levied on businesses. Were the investors to whom the Taoiseach spoke asking questions about our plans for the future, recognising that the environment in which we operate is getting more competitive by the month?  My second question relates to the meeting with the managing director of the IMF and what discussion is being given to allow countries successfully exit and stay outside bailout programmes. This Government will ensure that Ireland exits the bailout programme but we will do so in a very uncertain and volatile international environment. What planning is being done by the IMF to ensure that countries meeting programme requirements can stay outside bailout programmes when they are completed?  My third point relates to deficit reduction. The Taoiseach made a very fair point that the report from President Barroso that set off some debate on austerity came after the meeting in Davos. The same report and the table within showed that Ireland is one of the few countries that have been successful in reducing the amount it needs to borrow every year. This Government inherited an unsustainable borrowing requirement from Deputy Martin's party and, year on year, we are reducing that cost. It is down €3 billion from last year. What recognition is being given by the IMF and other bodies for the progress being made? \n The Taoiseach  With regard to speaking to investors about their views on Ireland as an environment for investment, they like clarity, decisiveness and a horizon against which they can plan. For that reason, the Irish corporation tax rate of 12.5% is a cornerstone that can be taken as fixed. It is not the only issue on which investors place importance as they take into account technology and our capacity to measure up to certain expectations, our track record on productivity and output and, most importantly, the real emphasis on the talent pool. The world is changing at bewildering speed with nanotechnology, robotics, genetics, biotechnology and other areas, so the bar being set higher in an international context is always measured up to by young Irish. I have seen this personally when I visit places like Microsoft, Intel, Dell or EMC. People have extraordinary vision as to where the next wave of investment and employment will happen. The areas of tax, track record, technology and talent are the considerations sold to potential investors by the IDA. When speaking to investors, whom I meet pretty regularly, I know they are extraordinarily committed to what they find here when they set up companies in the country. It is an important issue.  Ms Lagarde and I discussed the question of Ireland's exit from the programme.  Clearly that is not going to be just a black and white cut where we exit the programme and fly on our own. The discussions the Minister for Finance is having now are concerned with the contingency operations that will be made available in the event some international shock happens with a direct impact on Ireland. It is not just a clean cut where we are in a programme one day and out of it the next day. This is part of the discussion that is taking place at the ECOFIN meeting and with the IMF. The Minister for Finance was in Washington in the past fortnight speaking to the second in command at some length about this and other issues.  The point is well made on deficit reduction. We are still borrowing more than €1 billion per month to pay public salaries and hopefully the discussions now taking place between the Labour Relations Commission and the trade unions might result in some progress being made in view of the fact that the Government has a requirement for an extra €300 million in savings this year. The Deputy rightly points out the continuing trend of reduced borrowing by the country, which is critical to get us back on the path to recovery. It is difficult for people but the prize is great at the end. ",
        "questionType": "oral",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/31",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "31st Dáil",
          "houseNo": "31",
          "houseCode": "dail"
        },
        "date": "2013-04-30",
        "by": {
          "showAs": "Paschal Donohoe",
          "memberCode": "Paschal-Donohoe.S.2007-07-23",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paschal-Donohoe.S.2007-07-23"
        }
      }
    }
  ]
}