{
  "head": {
    "counts": {
      "questionCount": 1751,
      "resultCount": 1751
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Capital funding for early learning and childcare investment has been made available through the National Development Plan (NDP).  The most recent NDP announced earlier this year allocated €796 million to the Department for 2026-2030, this includes €197 million capital investment for early learning and childcare.  Early learning and childcare capital from 2026 will primarily be directed towards the implementation of the Programme for Government commitment to build or purchase State-owned early learning and childcare facilities. A proportion of the allocation will be invested in supporting existing early learning and childcare providers to expand their current premises to increase the number of early learning and childcare places they can offer.  Planned investment in existing providers to extend and improve their level of provision follows on from a number of schemes to support the sector in recent years, and in particular to community not-for-profit providers.  The Building Blocks grant programme has operated three schemes to date: the Building Blocks Improvement Grant scheme, which ran in 2023, the Building Blocks Expansion Grant scheme, which ran in 2024 and the Building Blocks Extension Grant scheme, which is currently operating.  Under the Building Blocks Improvement Grant, €9 million was allocated in 2023 in grants ranging from €35,000 to €75,000 for green energy upgrades and retrofit projects for services in need of upgrading. This scheme was open to community and private providers. 151 services were offered funding under the scheme, approximately one third of these were community not-for-profit services.  Under the Building Blocks Expansion Grant Scheme, which operated in 2024, the Department provided grants for the renovation or reconfiguration of existing early learning and childcare facilities to deliver additional capacity. Community based not for profit early learning and childcare services were eligible to apply for funding under this scheme. These services were permitted to apply for full funding of renovation projects, whereas private for profit services were required to demonstrate a 50% contribution to the project. In total, 22 services were awarded funding under the scheme, half of which were community not-for-profit services.  The Building Blocks Extension Grant Scheme is operating over 2025 and 2026. The Scheme has four strands: community extension; private extension; community purchase; and community construction. Three of the four strands were only open to community not-for-profit groups, with substantially greater funding values available and no requirement for co-funding. A total of 78 applications were received with 50 applicants approved to progress to the next stage of the grant process. 43 of these 50 projects are led by community not-for-profit services.  The Department is currently examining options and detailed specifications for future Building Blocks schemes, and I expect to announce details in early 2026. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 20. Deputy Paul Donnelly asked the Minister for Children, Disability and Equality if consideration has been given for capital funding for community based not-for-profit childcare facilities. [72882/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_63",
          "debateSectionId": "dbsect_63",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_63.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_20",
        "questionNumber": 20
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Children, Disability and Equality  There is no delay in implementation of the European Disability Card Directive.  The Directive was published in November 2024. Member States have until 5 June 2027 to transpose the Directive into national law and until 5 June 2028 to introduce the Cards. It is my intention that Ireland transpose and implement the Directive within these deadlines.  The European Disability Card is an important EU initiative which will make travel much easier for disabled Irish citizens by removing barriers to travel across all Member States.  This standardised card will ensure that when a disabled Irish person travels to another EU Member State for a short stay, and uses transport or avails of culture, arts, leisure or sport services, they will be able to easily access any special conditions or preferential treatment available to a disabled citizen of that country. This could include, for example, reduced entry fees when visiting a museum or priority entry or access to dedicated seating areas when attending a sporting event or concert.  The Card will be available in both physical and digital format.  There are often barriers to travel for disabled people, and I absolutely recognise the importance of the European Disability Card for many disabled people as a step towards removing some of those barriers. As a standardised card, with a recognisable format across the EU, it will simplify the recognition of disability status, enable free movement across the EU, encourage participation in cultural, leisure and sports activities, and ultimately achieve a more inclusive society.  The European Disability Card will be complemented by an enhanced European Parking Card, which has also been established by the same Directive. In a similar way to the European Disability Card, this enhanced parking card will have a standard format across all Member States, making it easier for disabled Irish citizens to travel, secure in the knowledge that their card will be recognised in their destination Member State. This Card is within the remit of the Minister for Transport.  The Department of Children, Disability and Equality is leading on the transposition of the Directive. As the Directive is broad in its scope, covering transport, arts, culture, officials will be engaging with all relevant departments throughout the transposition process, as well as with Disabled Persons Organisations. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 31. Deputy Paul Donnelly asked the Minister for Children, Disability and Equality the reason for the delay in a European disability card being available to Irish citizens. [72879/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_74",
          "debateSectionId": "dbsect_74",
          "showAs": "Disability Issues",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_74.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_31",
        "questionNumber": 31
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  As the Deputy will be aware, neither I as Tánaiste and Minister for Finance nor the Central Bank of Ireland can intervene directly in the commercial decision of a Credit Institution to open or refuse to open an account for a community, volunteer, or sports organisation.  The Financial Services and Pension Ombudsman (FSPO) Ombudsman provides independent, fair, impartial, confidential and free services to resolve complaints from consumers, including small businesses and other organisations which you have raised. The FSPO was established in January 2018 by the Financial Services and Pension Ombudsman Act 2017, and the Ombudsman is independent in the performance of his or her functions.  For the purpose of FSPO, charities and clubs are considered to be consumers if they are a subject to a turnover limit of €3 million in the preceding financial year. Hence if a qualifying charity or club is unhappy with the decision of a Credit Institution not to open an account for them, they can submit a complaint to the FSPO.  The FSPO will look at the merits of an individual case, examine the conduct of the Credit Institution in question and consider whether they followed procedures in terms of established account opening protocols.  As outlined in the 2025 programme for Government, the Government is committed to positioning Credit Unions as community centric financial institutions integral to their local communities, small businesses, and farmers.  From 1 April 2025, credit unions have been able to provide current account services to members in their capacity as a charity, club or society for purposes relating to the activities of the charity, club, or society only, if they choose to do so and subject to certain conditions being met.  Furthermore, other actions are being taken by Government to support sports and community initiatives. In August of this year, it was announced by Minister for Culture, Communications and Sport Patrick O’Donovan that More than €4 million in Dormant Accounts Funding is to be invested in community sports and physical activity initiatives.  ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 196. Deputy Paul Donnelly asked the Tánaiste and Minister for Finance his views on the difficulty of community, volunteer and sports organisations accessing bank accounts. [72889/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_210",
          "debateSectionId": "dbsect_210",
          "showAs": "Banking Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_210.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_196",
        "questionNumber": 196
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I launched the National Policy Framework for Unmanned Aircraft Systems on 20 August 2025. The Policy Framework aims to guide high-level strategic planning and development of the UAS sector in Ireland, through supporting growth and innovation, while ensuring safe and secure operations and managing environmental and other concerns. The Policy Framework seeks to identify and address any policy, regulatory or legislative gaps that may have arisen due to increased expansion of drone operations.  Many of the issues addressed by the Policy Framework fall directly within the remit of my department, while other issues will cross-over into areas of responsibility of other Government Departments and agencies. The Policy Framework aims to facilitate consideration of how matters such as planning and environmental issues will be addressed by the appropriate authorities. It provides for a number of structures and actions that aim to address concerns in relation to increasing drone usage and operations in balance with the realisation of the economic and societal benefits from the emerging drone sector. This will include ensuring that appropriate authorities have the required regulatory powers and that they have mechanisms in place to ensure that the views of all stakeholders are taken into account.  Implementation of the Policy Framework relies on cross-government structures and the continuation of engagement and support from various government departments, agencies, the UAS sector and the public. The Policy Framework recognises the important role local authorities have in the development and roll out of drone operations in their communities. The policy framework also recognises the importance of ongoing collaboration and engagement with a wide range of stakeholders.  My department has recently invited nominations from relevant Departments and agencies to an overall Policy Framework Implementation Monitoring Group and is developing the first of the annual implementation plans provided for in the Policy Framework. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 311. Deputy Paul Donnelly asked the Minister for Transport for an update on the policy around the operation of drones. [73279/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_315",
          "debateSectionId": "dbsect_315",
          "showAs": "Transport Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_315.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_311",
        "questionNumber": 311
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality (Deputy Norma Foley)  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 599. Deputy Paul Donnelly asked the Minister for Children, Disability and Equality her views on the lack of access to children for therapeutic interventions in Blakestown CDNT.  [72878/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_573",
          "debateSectionId": "dbsect_573",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_573.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_599",
        "questionNumber": 599
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Defence  My Department signed a contract for the French made Dassault Falcon 6X in December 2024 with delivery expected in December 2025. The aircraft is expected to arrive in Casement Aerodrome today.  The Dassault Falcon 6X is a next generation aircraft which will enhance the State’s transport, airlift and medical evacuation capabilities, with a range of over 5000 nautical miles meaning it can reach the west coast of the United States without the need to refuel.  It provides the State with an independent and flexible air transport service, which is an increasingly essential requirement to assist the Government in meeting Ireland’s national and international obligations.  In addition, the aircraft will be used for a broad range of other taskings, including the evacuation of Irish citizens from critical situations, air-ambulance patient transfers, medical evacuation or repatriation of Irish Defence Forces personnel deployed on overseas missions, and logistics support for the transport of supplies to Irish Defence Forces overseas missions.  The delivery of the Dassault Falcon 6X strategic reach aircraft represents a significant enhancement of the State’s transport, airlift and medical capabilities, and is further evidence of the Government’s ongoing commitment to enhance the capabilities of the Defence Forces.   ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 239. Deputy Paul Donnelly asked the Minister for Defence if the Air Corps have received the new Government jet; if not when does the Air Corps expect to receive this jet. [71772/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_158",
          "debateSectionId": "dbsect_158",
          "showAs": "Air Corps",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_158.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_239",
        "questionNumber": 239
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has responsibility for the planning and development of public transport infrastructure including bus stops/shelters nationally.  There is a commitment under the Programme for Government to ensure that public transport operators provide safe and accessible access for all passengers and a commitment to work with local authorities and national bodies to improve public transport options and infrastructure.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a direct reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 274. Deputy Paul Donnelly asked the Minister for Transport the nature of refurbishment works that were carried out at Busáras Station in 2024 and 2025, in tabular form; and the nature of refurbishment works that are scheduled to be carried out at this station during the first half of 2026. [71768/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_189",
          "debateSectionId": "dbsect_189",
          "showAs": "Bus Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_189.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_274",
        "questionNumber": 274
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  The query raised by the Deputy is an operational matter for Dublin Bus. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 275. Deputy Paul Donnelly asked the Minister for Transport the number and percentage of the Dublin Bus fleet that is aged over 13 years, as of 9 December 2025, in tabular form. [71769/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_190",
          "debateSectionId": "dbsect_190",
          "showAs": "Dublin Bus",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_190.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_275",
        "questionNumber": 275
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Culture, Communications and Sport  In 2025, the revised National Development Plan reiterated the Government’s commitment to the continued development of the Sport Ireland Campus, including the National Velodrome and Badminton Centre (NVBC).  The delivery of the NVBC is in keeping with key Government priorities as set out in the National Sports Policy 2018-2027 and in my Department’s Statement of Strategy, which includes a high-level goal to continue to invest in new sports facilities, high performance athletes and the hosting of major events.  Government approved, on 3 September 2025, both the funding and the appointment of Walls Construction as the principal contractor for the project. Sport Ireland subsequently entered into a formal engagement with Walls Construction on 22 October 2025, following the required standstill period in accordance with procurement procedures and initial contract discussions. The final contractual arrangements were concluded on 26 November 2025.  A three-month design development period is currently underway with the contractor and construction is expected to commence in early 2026. It is expected that the NVBC will be completed and in use by Q2, 2028.  The project will deliver a 250-metre cycling track, the standard required length for hosting major international events. The NVBC will also deliver up tb 12 badminton courts in the in-track area, seating for 1,000 spectators and ancillary facilities.  The NVBC will address the need to provide world-class track cycling facilities for our athletes as well as providing the sport of badminton with integrated training, gym and medical facilities. This state of the art facility will afford our track cycling athletes the opportunity to train in Ireland and should have a positive effect on future international performance levels in both sports. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 532. Deputy Paul Donnelly asked the Minister for Culture, Communications and Sport if the contract for the construction of the new National Velodrome and Badminton Centre has been signed; and if so, when his Department expects this work to commence. [71767/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_416",
          "debateSectionId": "dbsect_416",
          "showAs": "Sports Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_416.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_532",
        "questionNumber": 532
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The provision of a fire service in its functional area, including the establishment and maintenance of a fire brigade, the assessment of fire cover needs and the provision of fire station premises, is a statutory function of individual fire authorities under the Fire Services Act 1981. My Department supports the fire authorities through setting general policy, providing a central training programme, issuing guidance on operational and other related matters and providing capital funding for priority infrastructural projects.  All local authorities have responded to a request for infrastructural priorities for inclusion in the 2026 – 2030. My Department will work closely with the local authorities to progress their identified priority infrastructural projects, within the context of the totality of requests from fire authorities countrywide for capital funding. My Department will move then to formalise the Fire Services Capital Programme. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 570. Deputy Paul Donnelly asked the Minister for Housing, Local Government and Heritage when local authorities will be notified of successful applications for funding for capital projects under the 2026-2030 Fire Services Capital Programme. [71770/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_448",
          "debateSectionId": "dbsect_448",
          "showAs": "Local Authorities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_448.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_570",
        "questionNumber": 570
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I have again requested the information sought by the Deputy from the Garda authorities. Regrettably, this was not available in time and I will write to the Deputy once the information is to hand. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 711. Deputy Paul Donnelly asked the Minister for Justice, Home Affairs and Migration further to Parliamentary Question No. 699 of 12 November 2025, if he has received the necessary information from Garda Authorities in order for this PQ to be answered. [71761/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_561",
          "debateSectionId": "dbsect_561",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_561.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_711",
        "questionNumber": 711
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  An Garda Síochána have provided the following breakdown of operational advanced Garda motorcycle riders and have advised that this number reflects the advanced Garda Motorcyclists who are currently active in Roads Policing units within the Dublin Metropolitan Region (DMR).     DMR Division    Number Advance Motorcycle Riders      DMR Roads Policing Dublin Castle    35      DMR North Central    4      DMR South Central    2      DMR North    1      DMR South    0      DMR West    0      DMR East    1      Total    43     It should be noted that policing for an area is delivered using all resources within each Community Engagement area and are supported by Divisional resources and units. Employing this model of policing allows An Garda Síochána to distribute and allocate resources as required across Divisions. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 712. Deputy Paul Donnelly asked the Minister for Justice, Home Affairs and Migration the number of advanced Garda motorcycle riders that are based in each Garda Division, within DMR Region. [71763/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_562",
          "debateSectionId": "dbsect_562",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_562.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_712",
        "questionNumber": 712
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I am advised by the Garda authorities that the Garda Air Support Unit is a national unit based at Casement Aerodrome, Baldonnel, Co. Dublin.  There are currently two helicopters attached to the Garda aircraft fleet, a Eurocopter EC135 T2 and a EC135 T2+ which were delivered in 2001 and 2007 respectively.  The Government is investing over €50m in new state of the art aircraft to the Garda Air Support Unit. As part of this investment, An Garda Síochána has, this week, taken delivery of a new fixed wing aircraft. The aircraft will be operational in the first half of 2026.  The Garda Air Support Unit continue to liaise with the manufacturer in respect of the rotary aircraft with the first new helicopter due to be delivered in Q1 2026 and a further new helicopter in late 2026.  The Garda Air Support Unit is under the direction and control of Assistant Commissioner, Organised and Serious Crime, and the operational control of Detective Chief Superintendent, Operational Support Services. It provides a 24-hour proactive and reactive service in support of operational Gardaí on the ground and specialist units. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 713. Deputy Paul Donnelly asked the Minister for Justice, Home Affairs and Migration if the Garda authorities expect to receive the new helicopters and aircraft for Garda Air Support Unit before the end of 2025; and if not, when the new aircrafts will be received. [71764/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_563",
          "debateSectionId": "dbsect_563",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_563.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_713",
        "questionNumber": 713
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  The naturalisation application processing times of individual nationalities are not recorded by my Department. That said, I understand that extended wait times can be frustrating for applicants. I want to assure anyone who has an application for naturalisation submitted that my Department is doing everything possible to progress applications as quickly as possible.  It is important to note, however, that no two naturalisation applications are the same and some take longer than others to process. Given the importance of citizenship, robust and comprehensive checks must take place on each application. Unfortunately, some checks, such as international checks, can take a considerable amount of time and these are largely outside the control of the Immigration Service.  For that reason, while I expect that going forward, most applicants will receive a decision within one year, this cannot be guaranteed in the case of applications made in any specific year.  Citizenship Division have taken a significant number of steps to improve the process for applicants. These include introducing an online digital application, online payments, and eVetting. I am pleased to inform the Deputy that these changes are reducing processing times.  Applicants can now directly check the status of their immigration application on the Immigration Service’s Customer Service Portal. They can register for, or log in to their existing account, at: https://portal.irishimmigration.ie/en/  As an Oireachtas member, you can also request the status of individual immigration cases by e-mail, using the Oireachtas Mail facility at: IMoireachtasmail@justice.ie, which has been specifically established for this purpose. This service enables up to date information on such cases to be obtained without the need to seek information by way of the Parliamentary Question process. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 760. Deputy Paul Donnelly asked the Minister for Justice, Home Affairs and Migration his views on the length of time it is taking to process, in particular, Pakistani naturalisation applications; and if he will make a statement on the matter. [72525/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_605",
          "debateSectionId": "dbsect_605",
          "showAs": "International Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_605.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_760",
        "questionNumber": 760
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 961. Deputy Paul Donnelly asked the Minister for Health the number of persons on the waiting list to see a consultant cardiothoracic surgeon at the Mater Hospital; and the average waiting time to see the consultants for first appointments. [71765/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_772",
          "debateSectionId": "dbsect_772",
          "showAs": "Hospital Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_772.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_961",
        "questionNumber": 961
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 962. Deputy Paul Donnelly asked the Minister for Health the number of WTE consultant maxillofacial surgeons at St James's Hospital in 2024 and to-date in 2025, in tabular form. [71766/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_773",
          "debateSectionId": "dbsect_773",
          "showAs": "Departmental Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_773.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_962",
        "questionNumber": 962
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  My department’s main responsibility is to ensure that schools in an area can, between them, cater for all pupils seeking school places in the area.  Parents have the right to choose which school to apply to and where the school has places available for the relevant year, the student should be admitted. However, in schools where there are more applicants than places available, a selection process will be necessary. This selection process and the enrolment policy on which it is based must be non-discriminatory and must be applied fairly in respect of all applicants. However, this may result in some students not obtaining a place in the school of their first choice.  In accordance with the provisions of the Education (Admission to Schools) Act 2018, schools are required to clearly set out their selection criteria in their admission policies. The criteria to be applied by schools and the order of priority are a matter for the schools themselves. It is an important feature of the act that schools can only make a decision on an application for admission that is based on the school’s admission policy.  In cases where new schools were established to serve a school planning area and the schools uses the school planning area as a criteria on their admissions policy, officials in my department can discuss amendments to this policy with the school, in the context of new residential areas and sustainable transport to schools with the aim for schools to better serve local sustainable communities.  The rollout of the pilot Single Online Application for Schools marks a significant step towards fulfilling the Programme for Government commitment to introduce a nationwide common application system.  The Apply to School pilot was introduced to simplify and improve the admissions process for post-primary schools in five pilot areas. This new system provides families, for the first time, with a single online application and introduces synchronised, streamlined timelines for schools to manage admissions, issue offers, and update a central database to record accepted places.  The Department will closely monitor the outcomes of the admissions process to ensure that all local children are accommodated and to identify any required solutions if necessary. The Apply to School pilot will provide early clarity and robust data to support this commitment.  Under Section 29 of the Education Act 1998, the parent of the student, or in the case of a student who has reached the age of 18 years, the student, may appeal a decision of this school to refuse admission. An appeal may be made under Section 29 (1)(c)(i) of the Education Act 1998 where the refusal to admit was due to the school being oversubscribed.  TUSLA’s Education Support Service (TESS) is the statutory agency that can assist parents who are experiencing difficulty in securing a school place for their child.  Contact details for TESS are available at the following link www.tusla.ie/tess/get-in-touch/ or by email at tessinfo@tusla.ie. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 182. Deputy Paul Donnelly asked the Minister for Education and Youth if she will ask schools to prioritise students living locally to the school when allocating places (details supplied). [70395/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_146",
          "debateSectionId": "dbsect_146",
          "showAs": "School Admissions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_146.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_182",
        "questionNumber": 182
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister for Defence  The military authorities have provided the requested details, in the table below, in relation to the number of vacancies currently in the Defence Forces School of Music. Figures are as at 27 November 2025:      Rank      Lt Col      CQMS      Sgt      Cpl      Pte        Vacancies     1    1    9    4    4     Vacancies will be filled in line with DF workforce planning arrangements. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 52. Deputy Paul Donnelly asked the Minister for Defence the number of vacancies by rank within Defence Forces School of Music; when each of those vacancies will be filled, in tabular form. [67635/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_50",
          "debateSectionId": "dbsect_50",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_50.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_52",
        "questionNumber": 52
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Defence  The 2025 Army Cadetship competition was launched in March and closed for applications on the 8th of April. The Defence Forces have advised of their intention to launch the 2026 Cadetship recruitment campaign for the Army in quarter one of 2026. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 53. Deputy Paul Donnelly asked the Minister for Defence if a new cadetship recruitment campaign for the army will be launched early in the new year. [67636/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_51",
          "debateSectionId": "dbsect_51",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_51.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_53",
        "questionNumber": 53
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  The query raised by the Deputy is an operational matter for Iarnród Éireann. I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 112. Deputy Paul Donnelly asked the Minister for Transport when the car park at Heuston station was last remarked and or resurfaced; and when is this car park next scheduled for remarking and or resurfacing. [67640/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_99",
          "debateSectionId": "dbsect_99",
          "showAs": "Rail Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_99.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_112",
        "questionNumber": 112
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Revenue’s operational requirements are kept under continuous review, having regard to ongoing risk evaluation and evolving operational needs. I am advised that Revenue do not see a need for additional mobile x-ray scanners at this time.  I am advised that in 2025 to-date, Revenue have procured in total five baggage X-ray systems to be deployed at Dublin Airport, Shannon Airport, Kerry Airport and Cork Airport. These scanners were funded under the EU Customs Control Equipment Instrument (CCEI) and represent a combination of additional capacity and upgrade of older systems. Revenue also procured another hand-held X-ray system bringing its current capacity of hand-held scanners to eight.  In addition to this, as part of the redevelopment of Rosslare Europort, a new high energy X-ray gantry system was deployed in October 2025. This is the first high energy X-ray gantry system to be deployed in the State and will be used to scan containerised freight and vehicles as required.  Revenue have also sought and received funding to procure a specialised backscatter van in 2026. This is in addition to the current backscatter van based in Dublin Port. A backscatter van is a low power X-ray scanner mounted in a standard van that is used to scan vehicles, trailers and other light vehicles.  This Government has been consistent in its strong support for ensuring that Revenue has the necessary resources to fulfil its mandate in respect of functions that are critical for its effective functioning as a tax and customs administration and I remain open to considering any proposals from Revenue for additional resources that will support its work. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 169. Deputy Paul Donnelly asked the Tánaiste and Minister for Finance if he will seek EU funding to cover the costs of purchasing two additional mobile x-ray scanner trucks for the Revenue Commissioners. [67638/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_154",
          "debateSectionId": "dbsect_154",
          "showAs": "Revenue Commissioners",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_154.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_169",
        "questionNumber": 169
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  The Office of Public Works are collating the information and will respond directly to the Deputy ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 184. Deputy Paul Donnelly asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the amount the OPW collected in rent fees from external cafes/restaurants within OPW heritage sites in 2025; when the contract with each of these services expire; and how are rent fees for these services arranged, by location in tabular form. [67630/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_168",
          "debateSectionId": "dbsect_168",
          "showAs": "Office of Public Works",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_168.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_184",
        "questionNumber": 184
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  Current Vacancies - CEA Civil Servants     Job Title    Grade    Status      Members of the Authority x 2    PO1 + Allowance    Competition currently advertised.      Senior Digital Investigation Manager    AP    Competition to be advertised in due course.      Senior Legal Advisor    AP    Competition to be advertised over the Christmas Period.      Senior Enforcement Manager (Civil)    AP    Competition to be advertised over the Christmas Period.      Senior HR Manager    AP    Awaiting assignee from PAS.      Senior Governance & Support Operations Manager    AP    Successful candidate due to commence in December 2025.      Human Resources HEO    HEO    Competition to be advertised over the Christmas Period.      EO x 2    EO    Awaiting assignees from PAS.         Current Vacancies - An Garda Síochána Officers     Job Title/Grade    Status      Inspector x1    The CEA is working in collaboration with An Garda Síochána on the filling of the vacancy.      Detective Sergeants x2    The CEA is working in collaboration with An Garda Síochána on the filling of vacancies.      Detective Gardaí x5    The CEA is working in collaboration with An Garda Síochána on the filling of vacancies.      ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 188. Deputy Paul Donnelly asked the Minister for Enterprise, Tourism and Employment the vacancies by job title currently at the corporate enforcement authority; the estimated timeframe for filling each of those vacancies, in tabular form. [67631/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_172",
          "debateSectionId": "dbsect_172",
          "showAs": "State Bodies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_172.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_188",
        "questionNumber": 188
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  The Competition and Consumer Protection Commission (CCPC) is the statutory body responsible for promoting compliance with and enforcement of competition and consumer protection laws in Ireland.  The 2025 budget allocation for the CCPC is set out in tabular form below:     Competition and Consumer Protection Commission    2025 (€000)      Non-Pay (Admin & General Expenses)    8,374      Pay (Admin & General Expenses)    17,998      Pension (Admin & General Expenses)    736      Total – Admin & General Expenses    27,108      Levy – Grant for Financial Information & Education (Pay)    1,339      CCPC Overall Budget Allocation    28,447      ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 189. Deputy Paul Donnelly asked the Minister for Enterprise, Tourism and Employment the 2025 budget allocation for the Competition and Consumer Protection Commission, in tabular form. [67632/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_173",
          "debateSectionId": "dbsect_173",
          "showAs": "Consumer Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_173.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_189",
        "questionNumber": 189
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  Calls from customers with Community Welfare Service queries are handled by a two tier contact centre. Tier 1 calls are answered by the National Intreo Contact Centre (NICC) which provides a single point of phone contact for customers who are making enquiries about the range of Intreo services and payments. Tier 2 calls are escalated, where necessary, from the NICC to the Community Welfare Officer line.  While the NICC advisors take calls about Community Welfare Service (CWS) specific queries as well as the wider range of Intreo services and payments, CWS calls are answered immediately on a priority basis.  The tables below detail the number of full-time equivalent staff, by grade and gender, that were based in the NICC (Table 1), and on the Community Welfare Officer line (Table 2) as of 3rd November 2025.      Table 1    FTE staff by Grade and Gender - National Intreo Contact Centre                        Grade      Female      Male      Other      Total        Principal Officer     1.00             1.00        Assistant Principal     1.00             1.00        Higher Executive Officer     9.20    5.00         14.20        Executive Officer     12.60    6.00    1.00     19.60        Clerical Officer     45.75    17.30    6.00     69.05        Service Officer         1.00         1.00        Temporary Clerical Officer     4.00    6.00    7.00     17.00        Total      73.55      35.30      14.00      122.85            Table 2    FTE staff by Grade and Gender - Community Welfare Officer Line                        Grade      Female      Male      Other      Total        Higher Executive Officer     2.60    6.00         8.60        Executive Officer     2.00    3.00         5.00        Total      4.60      9.00      -      13.60       ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 372. Deputy Paul Donnelly asked the Minister for Social Protection the number of WTE staff by grade and gender working in the National Community Welfare Contact Centre as of 25 November 2025, in tabular form. [67634/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_334",
          "debateSectionId": "dbsect_334",
          "showAs": "Social Welfare Offices",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_334.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_372",
        "questionNumber": 372
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Garda Commissioner is responsible for managing the administration and business of An Garda Síochána, including the training of Gardaí.  I have consulted with the Garda Authorities and have been advised that there were no driving or motorcycle courses for Garda personnel held in Garda headquarters in 2024 or year to date in 2025. The frequency of all courses is governed by the operational requirements of An Garda Síochána.  An Garda Síochána has two Driver Training Schools, both of which are under the remit of the Garda College. One is based in the Garda College in Templemore and the other is attached to Garda HQ.  I am also informed by the Garda authorities that there is a five-level suite of competency based driving (CBD) courses, with each level specifically catering for the required knowledge base, skill set and operational requirements of Gardaí.  CBD Level 1 consists of a one-day assessment programme. Gardaí who successfully complete CBD Level 1 are deemed competent to carry out non-response driving functions and routine driving functions commensurate to the role.  CBD Level 2 is a two-week Competency Based Driving Course aimed at front-line Garda Drivers. This course contains Road Craft techniques and emergency response driving.  CBD Level 3 is an addition to the CBD2 course and is of three weeks duration. This course has a requirement for a higher skill set of driving to facilitate the driving of higher powered vehicles. I am advised that Competency Based Driving Level 3 is the highest level of training given to operational Gardaí.  I understand that following the publication of the Garda Spontaneous Pursuit Policy, a pursuit training course is now in development. Level 2 and Level 3 courses include instructions on response driving. The current Garda policy on Spontaneous Pursuits provides that CBD2 and CBD3 drivers may be authorised by the Serious Incident Dispatcher to initiate a pursuit dependant on the threat and risk assessed at the time.  The more specialised levels CBD4 and CBD5 are only delivered to Gardaí undergoing the selection process to become Garda Driving Instructors. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 410. Deputy Paul Donnelly asked the Minister for Justice, Home Affairs and Migration the number of each category of Garda driving and motorcycle courses for Garda personnel held in Garda headquarters; the number of Gardaí per class; the length of time each course runs for, in the years of 2024 and to date in 2025, in tabular form. [67639/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_368",
          "debateSectionId": "dbsect_368",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_368.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_410",
        "questionNumber": 410
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  One of the key objectives of Food Vision 2030, the shared stakeholder strategy for the agrifood sector, is to explore, develop and maintain overseas market opportunities for Ireland's high quality, sustainably produced food and beverages.  To assist this objective, my Department has a network of Counsellors and Attachés who are seconded to the Department of Foreign Affairs and Trade, and based in a variety of Irish Embassies across the world. In their postings, our network of Counsellors and Attachés work closely with the Bord Bia overseas team and other State Agencies to promote high quality Irish food and drinks and assist companies in maximising opportunities to export their products.  At present there are no plans to appoint an Agriculture Attaché at the Irish Embassy in Singapore. However, Bord Bia does have a presence in Singapore.  The table below shows the current locations of Agriculture Counsellors and Attachés posted abroad.     Attaché Embassy Locations      London, United Kingdom      Brussels, Belgium      Berlin, Germany      Rome, Italy      Paris, France      Geneva, Switzerland      Washington, United States      Mexico City, Mexico      Beijing, China      Tokyo, Japan      Seoul, Korea      ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 458. Deputy Paul Donnelly asked the Minister for Agriculture, Food and the Marine if he plans to have an agriculture attaché to the Irish embassy in Singapore; the locations currently where agriculture attaché are located at Irish embassies worldwide, in tabular form. [67637/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_402",
          "debateSectionId": "dbsect_402",
          "showAs": "Diplomatic Representation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_402.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_458",
        "questionNumber": 458
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 491. Deputy Paul Donnelly asked the Minister for Children, Disability and Equality the number of WTE behavioural therapist posts that was filled at Blakestown children's disability network team in the years of 2024 and to date in 2025, in tabular form. [67633/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_433",
          "debateSectionId": "dbsect_433",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_433.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_491",
        "questionNumber": 491
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  “As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible.” ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 572. Deputy Paul Donnelly asked the Minister for Health `the number of WTE radiographers, by grade that were filled at National Orthopaedic Hospital in the years of 2024, and to-date in 2025, in tabular form. [67627/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_509",
          "debateSectionId": "dbsect_509",
          "showAs": "Hospital Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_509.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_572",
        "questionNumber": 572
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 573. Deputy Paul Donnelly asked the Minister for Health the average ambulance turnaround time within the accident and emergency department of the Mater Hospital; the steps being taken to reduce the turnaround time for ambulances; in each of the first 11 months of 2025, in tabular form [67628/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_510",
          "debateSectionId": "dbsect_510",
          "showAs": "Ambulance Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_510.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_573",
        "questionNumber": 573
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 574. Deputy Paul Donnelly asked the Minister for Health the number of operating theatres currently at Connolly Hospital Blanchardstown; if each of those operating theatre are in full use at present. [67629/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_511",
          "debateSectionId": "dbsect_511",
          "showAs": "Hospital Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_511.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_574",
        "questionNumber": 574
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Justice",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_381",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_381",
          "showAs": "An Garda Síochána",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_381.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 510. Deputy Paul Donnelly asked the Minister for Justice, Home Affairs and Migration the up-to-date crime statistics for all crimes for both the Dublin west and Dún Laoghaire areas. [64735/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_510",
        "answerText": " Minister for Justice, Home Affairs and Migration  The Central Statistics Office (CSO), as the national statistical agency, is responsible for the compilation and publication of all crime statistics.  The CSO produces these statistics using data recorded on An Garda Síochána’s PULSE system and makes regular releases in relation to various crime statistics. The most recent statistics were released on 07 November 2025, providing statistics for Recorded Crime for Quarter 2 2025.  Figures in respect of criminal offences reported to Gardaí, by Garda Region, Division, Station, type of offence and year or quarter can be found on the CSO website at the following link: www.cso.ie/en/releasesandpublications/ep/p-rc/recordedcrimeq22025/data/ . ",
        "questionNumber": 510,
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Justice",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_382",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_382",
          "showAs": "An Garda Síochána",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_382.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 511. Deputy Paul Donnelly asked the Minister for Justice, Home Affairs and Migration the amount of full-time and part-time Garda stations for both the Dublin west and Dún Laoghaire areas. [64736/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_511",
        "answerText": " Minister for Justice, Home Affairs and Migration  The Garda Commissioner is responsible for the management and administration of An Garda Síochána under Section 33 of the Policing, Security and Community Safety Act 2024, which includes all operational policing matters and the distribution and stationing of Garda personnel, including opening hours of Garda Stations, throughout the State. The Commissioner is independent in the performance of his functions under Section 34 of the Act and, as Minister, I have no role in these independent functions.  In the interest of transparency, information in relation to the opening hours of individual Garda Stations is publicly available and can be found at the following link. www.garda.ie/en/contact-us/station-directory/.  The Deputy may wish to note that within the Dublin Metropolitan Region (DMR) there are a total of eight Garda Stations in DMR West, six of which operate 24/7 and a total of six Garda Stations in DMR East, five of which operate 24/7.  In relation to Garda stations which are not open to the public on a 24/7 basis, telephone calls to a station during periods of closure are automatically routed to the nearest 24-hour station in the Community Engagement Area.  In cases of emergency, any person should call the 999 or 112 emergency service for an urgent Garda response. ",
        "questionNumber": 511,
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Justice",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_383",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_383",
          "showAs": "An Garda Síochána",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_383.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 512. Deputy Paul Donnelly asked the Minister for Justice, Home Affairs and Migration the up-to-date Garda members and rank for both the Dublin west and Dún Laoghaire areas. [64737/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_512",
        "answerText": " Minister for Justice, Home Affairs and Migration  In the interest of transparency, information in relation to the allocation of Gardaí by Division, Station and rank, including for the Dublin West and Dún Laoghaire areas, is publicly available and can be found at the following link: www.garda.ie/en/about-us/our-departments/human-resources-and-people-development/garda-hr-directorate/garda-strength-breakdown-2025/.  The Deputy should select the current month and access the file titled “ Garda Members by Division District Station 2009 to the most recent date ” for a breakdown of total Garda numbers by Garda station going back to 2009. ",
        "questionNumber": 512,
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_439",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_439",
          "showAs": "Health Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_439.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 568. Deputy Paul Donnelly asked the Minister for Health given cochlear implants are provided free of charge to deaf people, if there is potential for a change in policy in order that hearing aids can be made available free of charge, or at least with significantly greater financial support, to deaf people who need them. [64656/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_568",
        "answerText": " Minister for Health  The Health Service Executive (HSE) provides hearing aids and associated maintenance free of charge to children under the age of 18 and to adults with a medical card. Further information regarding the HSE's audiology service can be found at: [ www2.hse.ie/services/audiology/ ].  In accordance with the provisions of the Health Act 1970 (as amended), eligibility for a medical card is determined by the HSE. In certain circumstances, the HSE may exercise discretion and grant a medical card, even though an applicant exceeds the income guidelines, where he or she faces difficult financial circumstances, such as extra costs arising from illness. Further information can be found at: [ www2.hse.ie/services/schemes-allowances/medical-cards/ ].  The Treatment Benefit Scheme, operated by the Department of Social Protection, provides for healthcare services to qualified people who have the required number of PRSI contributions. This includes up to €1,000 for a pair of hearing aids, and up to €100 toward repairs, within a 4-year calendar period. Further information can be found at: [ www.gov.ie/en/service/1fb655-treatment-benefit-scheme/ ]. Any changes to these grants would need to be considered in an overall policy and budgetary context.  Individuals who do not possess a medical card or who are not eligible for the Treatment Benefit Scheme would have to purchase hearing aids privately from a commercial provider. If the individual has private health insurance, it may cover hearing aid costs. Hearing aids are exempt from VAT. People may also be entitled to claim tax relief at the standard rate of tax (20%) on the purchase of hearing aids where prescribed. ",
        "questionNumber": 568,
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 95,
        "showAs": " 95. Deputy Paul Donnelly asked the Minister for Transport if the issue of elevator services being regularly out-of-order at all stations will be examined (details supplied). [63558/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Paul Donnelly",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "memberCode": "Paul-Donnelly.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_95",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_52",
          "showAs": "Rail Network",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_52",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_52.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Transport  When an elevator fault arises, Iarnród Éireann acknowledge that even for a brief period of time while a lift is out of order this can be extremely inconvenient for passengers. The company endeavour to return all out of service lifts to operational service as quickly as possible.  Iarnród Éireann update their app, website, and station information screens as soon as lift information is reported to ensure passengers can plan when issues arise.  The company work with a lift maintenance contractor to ensure that lifts re-enter service as quickly as possible in the event of a fault. In most instances this will happen same day or within 24 hours.  However, where specific part replacement or major works / repairs are required, it can take longer.  The ' Big Lift programme ' saw investment in existing lifts at 52 stations across the network between 2020 and 2025, significantly improving lift reliability. A Lift Call system is also in place at most station lifts, ensuring live monitored access and preventing vandalism and anti-social behaviour.  Funded by the National Transport Authority, Iarnród Éireann are working on a prioritised basis to install new lifts where a second platform may not be accessible. The NTA has funded footbridges over the railway lines with lifts at; Carlow, Edgeworthstown, Ennis, Dalkey, Little Island, Gormanstown, Banteer, Rathmore and Maynooth.  Under current construction are Athy, Rathdrum, and Boyle stations. In 2026 further upgrades are scheduled, subject to planning permission, in Glounthaune, Rushbrooke, Waterford, Claremorris, and Wicklow .  The provision of accessible, affordable, and available public transport services for everyone, including disabled people, is a priority for my Department. I want to ensure that all public transport operators provide accessible and inclusive services for every passenger. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 119,
        "showAs": " 119. Deputy Paul Donnelly asked the Minister for Transport if provision will be made to extend early morning bus services   at weekends (details supplied). [63557/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Paul Donnelly",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "memberCode": "Paul-Donnelly.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_119",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_77",
          "showAs": "Bus Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_77",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_77.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators, in this case Dublin Bus.  I can assure you that my Department is committed to providing investment in our public transport network and that I am supportive of the Governments goals in delivering an accessible, affordable and reliable public transport network throughout the country.  In light of the above, I have forwarded the Deputy's question to Dublin Bus for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 294,
        "showAs": " 294. Deputy Paul Donnelly asked the Minister for Transport if there are provisions to address the requirement for individuals with additional accessibility needs, such as wheelchair users, to have to ring a minimum of one hour in advance and up to a maximum of 12 hours in advance to use Irish Rail and Luas services (details supplied). [63559/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Paul Donnelly",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "memberCode": "Paul-Donnelly.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_294",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_240",
          "showAs": "Public Transport",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_240",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_240.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport.  From a policy perspective, I met with members of the disability sector on 29 September 2025 for a constructive dialogue around our shared ambition to ensure 100% transport accessibility in Ireland. The Government launched the National Human Rights Strategy for Disabled People on 3rd September 2025. In line with the United Nation Convention on the Rights of Persons with Disabilities, the strategy puts great importance on engagement with disabled people. Pillar 5 of the strategy, 'Transport and Mobility' contains a number of transport priority actions. I really welcomed the opportunity to hear views on transport accessibility and the new strategy’s actions. It was a valuable and rewarding exchange with Disabled Person Organisations, service providers, Disability User Groups, and board representatives from transport operators.  Under the Dublin Transport Authority Act 2008, the National Transport Authority (NTA) has statutory responsibility for promoting the development of integrated, accessible public transport networks and infrastructure. The NTA works with the relevant public transport operators, for example Irish Rail, who have responsibility for day to day operational issues, to progressively make public transport more accessible.  In light of Irish Rail and Transport Infrastructure Ireland (TII) having responsibilities for rail and light rail (Luas) services respectively, I have referred your question to the both companies for direct reply to you. Please advise my private office if you do not receive a reply within ten working days. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 295,
        "showAs": " 295. Deputy Paul Donnelly asked the Minister for Transport if issues in relation to the 40E bus route will be addressed (details supplied). [63560/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Paul Donnelly",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "memberCode": "Paul-Donnelly.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_295",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_241",
          "showAs": "Bus Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_241",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_241.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators, in this case Dublin Bus.  I can assure you that my Department is committed to providing investment in our public transport network and that I am supportive of the Governments goals in delivering an accessible, affordable and reliable public transport network throughout the country.  In light of the above, I have forwarded the Deputy's question toDublin Bus for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 296,
        "showAs": " 296. Deputy Paul Donnelly asked the Minister for Transport if he plans to add an extra bus for students in the Dublin 15 area travelling to Dunboyne College on the 270 bus route (details supplied). [63561/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Paul Donnelly",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "memberCode": "Paul-Donnelly.D.2020-02-08"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_296",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_242",
          "showAs": "Bus Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_242",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_242.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators, in this case Dublin Bus.  I can assure you that my Department is committed to providing investment in our public transport network and that I am supportive of the Governments goals in delivering an accessible, affordable and reliable public transport network throughout the country.  In light of the above, I have forwarded the Deputy's question to Dublin Bus for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Enterprise, Tourism and Employment  Under the Disability Act 2005, disability policy in Ireland is delivered on a mainstream basis, with responsibility falling to each Minister and his or her department to ensure that their functions are executed with due regard for the needs of disabled people.  Regulation of tourism accommodation is an operational matter for Fáilte Ireland and the authority aims to position Ireland as a world leader in accessible and inclusive tourism by 2030 and is actively working toward achieving that goal.  The Tourist Traffic Acts 1939-2011 Registration and Renewal of Registration Regulations for Hotels 2016 require that registered hotel premises provide access for persons with mobility difficulties, including wheelchair users, to the entrance hall, reception, bedrooms and public areas, including bathroom and toilet facilities in accordance with the 'Building Regulations Technical Guidance, Access and Use'. As it happens, I introduced those latter Regulations in my previous role as Minister of State for Local Government and Planning in 2022.  At present, Fáilte Ireland reports that while accessible accommodations exist, they are often not well-publicised.  To drive meaningful early change in this area, Fáilte Ireland has developed the ‘Access for Success’ initiative to empower hotels with pre-travel information tools, to improve the clarity and availability of accessibility information, boosting visitor confidence and booking conversion. This initiative also aims to elevate accessibility standards within hotels through tailored guidance and training supports.  In addition to the Access for Success initiative, Fáilte Ireland is delivering a new 'accessible and inclusive tourism' capability programme, to enhance skills and competencies for frontline staff and leadership teams in client businesses. This 'capability' is defined as the strategic creation and development of tourism experiences, environments, and services that are welcoming, safe, and usable by all individuals - regardless of ability, background, or personal circumstance.  To ensure all tourists can enjoy Ireland’s tourism offering, the tourism agencies are also engaged in on-going work with the wider tourism sector and advocacy groups to identify and address barriers and issues that can restrict access to tourist sites and services.  This continuous drive for improvement to: tourism infrastructure including accommodation; the use of innovative technology; and staff training will better serve and harness the growing, high value inclusive Irish tourism market. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_32",
        "debateSection": {
          "debateSectionId": "dbsect_63",
          "showAs": "Tourism Industry",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_63",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_63.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Enterprise"
        },
        "questionNumber": 32,
        "by": {
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08",
          "showAs": "Paul Donnelly"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 32. Deputy Paul Donnelly asked the Minister for Enterprise, Tourism and Employment his views on the lack of access to hotels for those with mobility issues; and specifically the availability of hoists. [58315/25] "
      }
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Children, Disability and Equality (Deputy Hildegarde Naughton)  The Department is currently collating the information requested and a reply will issue directly to the Deputy on this matter as soon as possible. ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Paul Donnelly",
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_104.xml"
            }
          },
          "debateSectionId": "dbsect_104",
          "showAs": "Disability Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_104"
        },
        "questionNumber": 144,
        "date": "2025-11-12",
        "showAs": " 144. Deputy Paul Donnelly asked the Minister for Children, Disability and Equality her views on the lack of funding for Blanchardstown Centre for Independent Living, including the provision of funding for fuel costs for their accessibility vehicles. [58316/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_144"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Defence  The primary function of training in the Defence Forces is to develop and maintain the capabilities necessary to fulfil the roles laid down by Government. Where relevant training is not available on-island, it is often necessary for Defence Forces personnel to attend training institutions overseas. I am advised by the military authorities that the following specialist training courses not available within the State were undertaken by Naval Service personnel in the UK during 2024 and to date in 2025:     Course    Duration      Breathing Apparatus Instructor Course    4–5 days      Royal Navy CBRNDC (Chemical, Biological, Radiological, Nuclear and Damage Control) 4a    3 days      Royal Navy CBRNDC 35    32 days      Royal Navy SEMC WE (Systems Engineering & Management Course - Weapon Engineering)    6 months approx.      Royal Navy Advanced Stability    16 days      Kongsberg 600 - Engine Room Management Course    3–4 days      Principle Warfare Officers Course    5 months approx.      International Electronic Warfare Managers Course    3 months approx.      Long Navigation Officers Course    4 months approx.      ",
        "to": {
          "showAs": "Defence",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Paul Donnelly",
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_208.xml"
            }
          },
          "debateSectionId": "dbsect_208",
          "showAs": "Naval Service",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_208"
        },
        "questionNumber": 262,
        "date": "2025-11-12",
        "showAs": " 262. Deputy Paul Donnelly asked the Tánaiste and Minister for Defence if any personnel from the Naval Service went to the UK for a specialist training course which is not available within the State in 2024 and to date in 2025; if so, the name and duration of this course, in tabular form. [60976/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_262"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Defence  The primary function of training in the Defence Forces is to develop and maintain the capabilities necessary to fulfil the roles laid down by Government. Where relevant training is not available on-island, it is often necessary for Defence Forces personnel to attend training institutions overseas. I am advised by the military authorities that the following specialist training courses were undertaken by Air Corps personnel in the UK during 2024 and to date in 2025:      Name of Course      Duration       Direction Finder Training    3 days      NDT (Non Destructive Testing) Course    5–9 Days      Ab Initio RW Pilot Training    16 months approx.      H145 Type Conversion Course    27 days      Breathing Apparatus Instructor    2 weeks      Compartment Fire Behaviour Training Instructor    2 weeks      Road Traffic Collision Instructor (Fire Service)    2 Weeks      Incident Commander (Fire Service)    2 Weeks      Falcon 6X (Type rating training)    5 Weeks      Learjet 45 (Recurrent training)    5 days      Flight attendant Cse    2 days      ",
        "to": {
          "showAs": "Defence",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Paul Donnelly",
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_209.xml"
            }
          },
          "debateSectionId": "dbsect_209",
          "showAs": "Air Corps",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_209"
        },
        "questionNumber": 263,
        "date": "2025-11-12",
        "showAs": " 263. Deputy Paul Donnelly asked the Tánaiste and Minister for Defence if any personnel from Air Corps went to the UK for a specialist training course which is not available within the State in 2024 and to date in 2025; if so, the name and duration of this course, in tabular form. [60977/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_263"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport.  The question raised by the deputy in relation to route and passenger info in 2025 is an operational matter for Dublin Bus.  I have, therefore, referred the Deputy's question to the company for direct reply. Please advise my private office if you do not receive a reply within ten working days. ",
        "to": {
          "showAs": "Transport",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Paul Donnelly",
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_218.xml"
            }
          },
          "debateSectionId": "dbsect_218",
          "showAs": "Dublin Bus",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_218"
        },
        "questionNumber": 272,
        "date": "2025-11-12",
        "showAs": " 272. Deputy Paul Donnelly asked the Minister for Transport the top five most popular Dublin Bus routes, by passenger number and direction in the first nine months of 2025. [60970/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_272"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I wish to reassure the Deputy that improving the accessibility, reliability, and affordability of public transport, while ensuring the system remains well-funded and responsive to passenger needs, is a core priority under the Programme for Government. The National Transport Authority (NTA) plays a central role in achieving this, as they have statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators. NTA and the Operators are in continuous dialogue regarding operational needs, subject to funding and/or resource availability.  As Minister for Transport, my Department sets the overall policy direction and funding framework for the delivery of public transport services nationwide, including Bus Éireann. The 2026 PSO funding allocation of €940 million represents a significant 43% uplift in the allocation from 2025. This reflects the Government’s commitment to ensuring that public transport services can continue to operate reliably and sustainably in the face of growing passenger demand and increased operational costs.  This allocation will also allow for the continued delivery of targeted fare initiatives, including the recently introduced free travel for all children up to the age of 9 and the Young Adult Card for those aged 19–25, as part of the NTA’s National Fares Strategy. These measures help ensure that public transport remains accessible and affordable for families, students, and young workers across the country.  In parallel, investment continues to support the rollout of planned improvements within the existing network. Work is progressing on major strategic infrastructure projects such as DART+, Metrolink, and Cork Commuter Rail, which remain critical to increasing the capacity and resilience of the public transport system over the longer term.  In addition, a further €31 million has been secured for rural transport in 2026 – a 38% increase on last year’s funding. This ensures the continued delivery of vital services across rural Ireland, to meet demand in communities that depend on these services most. ",
        "to": {
          "showAs": "Transport",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Paul Donnelly",
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_219.xml"
            }
          },
          "debateSectionId": "dbsect_219",
          "showAs": "Bus Éireann",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_219"
        },
        "questionNumber": 273,
        "date": "2025-11-12",
        "showAs": " 273. Deputy Paul Donnelly asked the Minister for Transport the additional improvements to services that will occur in 2026 for Bus Éireann PSO routes arising from Budget 2026. [60971/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_273"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Transport  I wish to reassure the Deputy that improving the accessibility, reliability, and affordability of public transport, while ensuring the system remains well-funded and responsive to passenger needs, is a core priority under the Programme for Government. The National Transport Authority (NTA) plays a central role in achieving this, as they have statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators. NTA and the Operators are in continuous dialogue regarding operational needs, subject to funding and/or resource availability.  As Minister for Transport, my Department sets the overall policy direction and funding framework for the delivery of public transport services nationwide. The 2026 PSO funding allocation of €940 million represents a significant 43% uplift in the allocation from 2025. This reflects the Government’s commitment to ensuring that public transport services can continue to operate reliably and sustainably in the face of growing passenger demand and increased operational costs.  This allocation will also allow for the continued delivery of targeted fare initiatives, including the recently introduced free travel for all children up to the age of 9 and the Young Adult Card for those aged 19–25, as part of the NTA’s National Fares Strategy. These measures help ensure that public transport remains accessible and affordable for families, students, and young workers across the country.  In parallel, investment continues to support the rollout of planned improvements within the existing network, such as the recently launched F Spine under Phase 7 of BusConnects. This phase introduces high-frequency, 24-hour bus services on key corridors, including routes F1, F2, and F3, enhancing connectivity between areas such as Tallaght, Finglas, Charlestown, and the city centre. The redesign also includes new radial and local routes to streamline and make the network more efficient. Regarding infrastructure, the NTA Board recently approved the Liffey Valley to City Centre Core Bus Corridor scheme, which is expected to commence construction this year with a view to full completion by 2028. In addition, I expect to bring the Ballymun/Finglas to City Centre Core Bus Corridor scheme to Cabinet in the coming weeks for consent at Approval Gate 3 of the Infrastructure Guidelines. Should the Government provide consent, construction is expected to commence on this scheme next year.  Work is also progressing on major strategic infrastructure projects such as DART+, Metrolink, and Cork Commuter Rail, which remain critical to increasing the capacity and resilience of the public transport system over the longer term.  In addition, a further €31 million has been secured for rural transport in 2026 – a 38% increase on last year’s funding. This ensures the continued delivery of vital services across rural Ireland, to meet demand in communities that depend on these services most. ",
        "to": {
          "showAs": "Transport",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Paul Donnelly",
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_220.xml"
            }
          },
          "debateSectionId": "dbsect_220",
          "showAs": "Dublin Bus",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_220"
        },
        "questionNumber": 274,
        "date": "2025-11-12",
        "showAs": " 274. Deputy Paul Donnelly asked the Minister for Transport the additional improvements to services that will occur in 2026 for Dublin Bus arising from Budget 2026. [60972/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_274"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  My  Department plays a significant role through its annual Fireworks Awareness Raising Campaign in informing the public about the serious dangers associated with fireworks and the penalties that people can face for selling or using illegal fireworks. I launched this years campaign on the 24 September last.  Each year in the run up to Halloween, additional efforts are made by An Garda Síochána to combat the illegal importation, sale and use of fireworks, under what is known as Operation Tombola. This year Operation Tombola commenced on 1 October.  Over the past decade, under Operation Tombola, Gardaí have carried out 1,218 fireworks seizures to an estimated value of €225,000.  These seizures have undoubtedly contributed to reducing the harm associated with the illegal use of fireworks. The penalties for importing, selling or using unlicensed fireworks are significant. Part 6 of the Criminal Justice Act 2006 gives Gardaí power to arrest people found with unlicensed fireworks and sets out significant penalties on conviction, including fines up to €10,000 or up to five years' imprisonment for possession with intent to sell or supply.  The below table records number of fireworks offences reported for 2023, 2024 and 2025 (as of 9 November 2025) as well as the number of those incidents which have been sanctioned.  Also included is the count of seized objects linked with those Fireworks Offences incidents each year as well as the estimated value recorded in PULSE.  The following table provides details of the number of incidents classified and detailed on our PULSE system as Firework Offences.      Year Reported      Fireworks Offences      Sanctioned*      Seized Objects**      Object Value       2023    209    68    209    €51,151      2024    197    57    187    €25,174      2025 (as of 9 November 2025)    244    22    181    €18,523     *The Sanctioned column refers to the number of Fireworks Offence incidents which resulted in a charge, summons or caution.  **The Seized Object column reflects objects or items recorded on the PULSE system which were either described as an ‘explosive’ or ‘firework’ and was thereby seized in conjunction with a Fireworks Offences incident. ",
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Paul Donnelly",
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_612.xml"
            }
          },
          "debateSectionId": "dbsect_612",
          "showAs": "An Garda Síochána",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_612"
        },
        "questionNumber": 698,
        "date": "2025-11-12",
        "showAs": " 698. Deputy Paul Donnelly asked the Minister for Justice, Home Affairs and Migration the quantity of fireworks seized by Gardaí within the Dublin region in the 2025 Halloween period; if he will provide the same figures for the corresponding period in 2023 and 2024, in tabular form. [60973/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_698"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I have requested the information sought by the Deputy from the Garda authorities. Regrettably, this was not available in time and I will write to the Deputy once the information is to hand. ",
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Paul Donnelly",
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_613.xml"
            }
          },
          "debateSectionId": "dbsect_613",
          "showAs": "An Garda Síochána",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_613"
        },
        "questionNumber": 699,
        "date": "2025-11-12",
        "showAs": " 699. Deputy Paul Donnelly asked the Minister for Justice, Home Affairs and Migration the number of Gardaí who went to the UK for a specialist training course that is not available within the State in 2024 and to date in 2025; and the name and duration of this course, in tabular form. [60974/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_699"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Garda Commissioner is responsible for the management and administration of An Garda Síochána under Section 33 of the Policing, Security and Community Safety Act 2024. This includes all operational policing matters.  Furthermore, under Section 72(1) of the Policing Security and Community Safety Act 2024, the Garda Commissioner is the Accounting Officer of An Garda Síochána and is responsible for the Garda budget. As Minister I have no role in these matters.  I have been advised by the Garda authorities that in 2024, €1,180 was spent on the purchase of anti-spit hoods. There has been no expenditure, to date, in 2025. ",
        "to": {
          "showAs": "Justice",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Paul Donnelly",
          "memberCode": "Paul-Donnelly.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Paul-Donnelly.D.2020-02-08"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_614.xml"
            }
          },
          "debateSectionId": "dbsect_614",
          "showAs": "An Garda Síochána",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_614"
        },
        "questionNumber": 700,
        "date": "2025-11-12",
        "showAs": " 700. Deputy Paul Donnelly asked the Minister for Justice, Home Affairs and Migration further to Parliamentary Question number 277 of 16 October 2025, if he has received the necessary information from the Garda authorities in order to answer this PQ. [60975/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_700"
      },
      "contextDate": "2025-11-12"
    }
  ]
}