{
  "head": {
    "counts": {
      "questionCount": 1233,
      "resultCount": 1233
    }
  },
  "results": [
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "School Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_356.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_356",
          "debateSectionId": "dbsect_356"
        },
        "to": {
          "showAs": "Education",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Education and Youth  I can confirm to the Deputy that the school in question has submitted an application for additional accommodation, to meet the school’s accommodation needs under the Additional School Accommodation (ASA) scheme.  The purpose of my department’s Additional School Accommodation (ASA) scheme is to ensure that essential mainstream classroom accommodation and accommodation for pupils with special education needs is available to cater for pupils enrolled each year, where the need cannot be met by the school’s existing accommodation or at other schools in the area.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,400 school building projects. Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. A recent Government decision has approved €210m supplementary capital funding for my department which brings the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation the department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  My department is now preparing an NDP implementation plan which is due for publication later in the Autumn. This plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  I can assure the Deputy that my department is very cognisant of the requirement around the delivery of accommodation for the school in question and is working to advance matters. The provision of required school places, including for children with special educational needs, is a priority for my department. My officials are working to ensure that there is sufficient provision to meet the school place needs in the wider school planning area for future years. ",
        "questionType": "written",
        "showAs": " 440. Deputy Mary Butler asked the Minister for Education and Youth the position regarding the additional accommodation project application lodged by a school (details supplied); the timeline for a decision in respect of this badly needed development; and if she will make a statement on the matter. [57401/25] ",
        "questionNumber": 440,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_440"
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 349,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_349",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_336",
          "showAs": "Special Educational Needs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_336",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_336.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister of State at the Department of Education  Enabling children with special educational needs to receive an education is a priority for this government. It is also a key priority for me as Minister for Special Education & Inclusion, for my department and for the National Council for Special Education (NCSE).  The vast majority of children with special educational needs are supported to attend mainstream classes with their peers. Where children with more complex needs require additional supports, special classes and special school places are provided.  The NCSE has responsibility for coordinating and advising on the education provision for children with special educational needs nationwide.  Almost 1,700 classes have been sanctioned by the NCSE in the last 5 years and 11 new special schools have also been established and many more expanded. For this school year alone over 400 new special classes have been sanctioned bringing the total number of special classes nationwide to 3,337.  70 of these classes are in County Waterford, 12 are new for the 2024/25 school year, 7 at primary level and 5 at post-primary level. The vast majority of these are autism classes and have a teacher/student ratio of 1:6.  Budget 2025 provides funding for another 400 special classes and 300 special school places nationwide and it is estimated that a similar level of provision will be needed each year for the next 3 years.  The NCSE have recruited additional special education needs organisers (SENOs), advisors and team managers. A total of 120 SENOs now operate nationwide, three of these are operating solely in County Waterford. SENOs play an important role in ensuring there is adequate special educational provision within local areas and are currently visiting schools nationwide to conduct planning meetings. These visits will be key in terms of forward planning for the 2025/26 school year.  Parents seeking special class placements for their children are advised to contact the NCSE locally so that their needs can be taken into account for planning purposes. Local SENOs are available to assist and advise parents on their options and the supports available. ",
        "showAs": " 349. Deputy Mary Butler asked the Minister for Education to outline the efforts made to provide additional schools places for children with ADHD and ASD in Waterford; and if she will make a statement on the matter. [44437/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Mary Butler",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03",
          "memberCode": "Mary-Butler.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 918,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_918",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_871",
          "showAs": "Disability Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_871",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_871.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister of State at the Department of Children, Equality, Disability, Integration and Youth  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "showAs": " 918. Deputy Mary Butler asked the Minister for Children, Equality, Disability, Integration and Youth if assistance can be provided to a person (details supplied) seeking urgent access to services on behalf of her son; and if he will make a statement on the matter. [44429/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Mary Butler",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03",
          "memberCode": "Mary-Butler.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 919,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_919",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_872",
          "showAs": "Disability Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_872",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_872.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister of State at the Department of Children, Equality, Disability, Integration and Youth  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "showAs": " 919. Deputy Mary Butler asked the Minister for Children, Equality, Disability, Integration and Youth to outline the efforts made to provide additional services for children with ADHD and ASD, and their parents, in Waterford; and if he will make a statement on the matter. [44436/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Mary Butler",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03",
          "memberCode": "Mary-Butler.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-09-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-09/writtens/mul@/dbsect_510.xml"
            }
          },
          "debateSectionId": "dbsect_510",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-09-09/writtens/dbsect_510",
          "showAs": "School Accommodation"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-09-09/pq_558",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 558,
        "showAs": " 558. Deputy Mary Butler asked the Minister for Education the status of an additional accommodation scheme application lodged by a school (details supplied); and if she will make a statement on the matter. [34467/24] ",
        "answerText": " Minister for Education  I can confirm to the Deputy, that my Department is in receipt of an application for the Additional School Accommodation (ASA) scheme, from the school in question.  The purpose of the ASA scheme is to ensure that essential mainstream classroom and accommodation for students with special educational needs is available to cater for pupils enrolled each year, where the need cannot be met by the school’s existing accommodation or at other schools in the area.  The main focus of resources over the last decade and for the coming period is on provision of additional capacity to cater for increasing demographics. As a result, the current priority under the Additional Accommodation scheme is the provision of essential classroom accommodation to meet demographic demand or where an additional post is being appointed.  At primary level, this situation generally arises to cater for a school’s accommodation requirements where an additional teaching post has been sanctioned by Teacher Allocation Section, or the requirement for a new class for pupils with special education needs has been identified by the National Council for Special Education (NCSE), and all available alternative accommodation within the school is already being used for classroom purposes.  The Department has a significant modular accommodation programme in place to assist schools in the provision of additional capacity, including in respect of facilitating the establishment of special classes.  This programme involves the use of Project Management supports which is designed to enable the accommodation to be provided as quickly as possible and help ease the administrative workload for school authorities in relation to the management and delivery of projects.  The use of the Department’s Modular Accommodation Framework also assists in ensuring lead in periods for procurement of modular accommodation are minimised to the greatest extent possible. To date, this has worked very well in the education sector and has seen delivery of large scale, high quality modular accommodation to meet the needs of children, particularly those with special educational needs.  A Project Manager has been appointed to progress a proposed brief of accommodation for this school. Following completion of the viability report, and considering the complexities involved with the school site, the Department requested Project Managers to explore a number of options to meet the needs of the school.  The report is now being considered.  I can only seek to assure you that we will advance this matter as quickly as possible and officials in my Department will be in touch with the school in the coming weeks. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-09-09",
        "by": {
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_267.xml"
            }
          },
          "debateSectionId": "dbsect_267",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_267",
          "showAs": "Public Transport"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_277",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 277,
        "showAs": " 277. Deputy Mary Butler asked the Minister for Transport if he can request the CEO of an organisation (details supplied) to respond to correspondence of 6 March and 12 March 2024, to which no reply has been received; and if he will make a statement on the matter. [33477/24] ",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has statutory responsibility for the planning and development of public transport infrastructure, including the provision of bus stops and shelters.  My Department has been in contact with the NTA on this matter and I understand that a response to the Deputy’s outstanding correspondence is being prepared and will issue shortly  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a direct reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_268.xml"
            }
          },
          "debateSectionId": "dbsect_268",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_268",
          "showAs": "Public Sector Pensions"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_278",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 278,
        "showAs": " 278. Deputy Mary Butler asked the Minister for Transport the status of the CIÉ pensions 1951 scheme; if he has considered a recent High Court ruling (details supplied) in respect of this issue; and if he will make a statement on the matter. [33480/24] ",
        "answerText": " Minister for Transport  From the outset I would like to clarify that I, as Minister for Transport, have responsibility for policy and overall funding in relation to public transport. Issues in relation to CIÉ pension schemes are primarily a matter for the trustees of the pension schemes, the CIÉ ,Group and their employees.  Under the Transport Act 1950, CIÉ have initiated the statutory process by submitting an amending scheme to the Minister for Transport for review. The amending scheme is subject to Ministerial approval, and requires a statutory public consultation process, where any representations from interested parties will be considered. I may therefore confirm, modify, or reject an amending scheme in accordance with the process set out under the Transport Act.  CIÉ, in conjunction with their legal advisors, has prepared and submitted draft S.I.s to the Department of Transport to give effect to the labour court recommendations for the 1951 Scheme, as passed by a ballot of trade union members in May 2021.  These drafts are currently being considered by the Department of Transport and advisors in NewERA. Once the draft S.I.s are finalised, they will be submitted to the Minister for consideration and pending receipt of the Minister’s approval, CIÉ will commence the statutory public consultation process on the draft S.I.s.  Further, the rules governing the 1951 scheme are currently subject to ongoing legal proceedings before the Commercial Court in which the Minister for Transport has been joined as a Notice Party.  The Hearing commenced on 24 May 2022 for 4 days. While original indications were that a judgement would be expected in the Autumn of 2022, the matter was deferred on multiple occasions, with the judgment being delivered on 19 April 2024. In his judgement, Mr Justice Mark Sanfey found that both CIÉ and the 1951 Scheme members were obliged to provide funding to the pension scheme to resolve any solvency issues. Justice Sanfey instructed both sides to consider what orders should be made on foot of the judgment ahead of a hearing date, which is currently being agreed between the parties. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_784.xml"
            }
          },
          "debateSectionId": "dbsect_784",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_784",
          "showAs": "School Facilities"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_857",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 857,
        "showAs": " 857. Deputy Mary Butler asked the Minister for Education if she will confirm the most appropriate funding source within her Department applicable to a school (details supplied) with an urgent need to replace a fence around the school grounds, which is unsafe, and no longer fit for purpose; and if she will make a statement on the matter. [33476/24] ",
        "answerText": " Minister for Education  The Emergency Works application to which the Deputy refers sought funding for the replacement of fencing around the school grounds. The purpose of the Emergency Works Scheme (EWS) is to provide funding for unforeseen emergencies. Issues such as fencing would generally fall under the area of general maintenance. The application was rejected as the EWS team deemed the application as not sudden and unforeseen. The school appealed the EWS decision and maintained the decision.  However, as this application is now closed I would propose for the school in question to submit a new application to the Emergency Works Scheme (EWS) to address the issue outlined in this query in line with Circular 0068/2020, Appendix C.  As the Deputy may be aware, the purpose of the Summer Works Scheme (SWS) is to enable individual school authorities to undertake small-scale building works on a devolved basis and, ideally, can be carried out during the summer months or at other times that avoid disrupting the operation of the school. The SWS operates on a multi-annual basis for categories of works such as roof works, window replacement, mechanical, electrical works and external works which could include the provision or upgrade of fencing. The SWS was last opened for applications in 2019.  My Department is leading an ambitious sustainability agenda and has progressed a wide array of measures to improve the overall sustainability of our school buildings.  It is a priority for Government to deliver on Ireland’s ambitious climate agenda and reduce greenhouse gas emissions. This includes targets around the decarbonisation of Ireland’s public buildings. As part of it’s planning for 2024 and beyond, Department officials are considering and planning for the next phases of the summer works programme and the opportunities this may create to support the sustainability agenda.  In this regard, it is envisaged at this stage that, a Multi-Annual SWS with a focus on climate action and energy conservation will be the focus for the next summer works scheme to be opened for applications. The arrangements and timing of that SWS is still under consideration and schools will be updated in due course. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-07-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/mul@/dbsect_785.xml"
            }
          },
          "debateSectionId": "dbsect_785",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-07-23/writtens/dbsect_785",
          "showAs": "Legislative Process"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-07-23/pq_858",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 858,
        "showAs": " 858. Deputy Mary Butler asked the Minister for Education if she considered the recommendations furnished in a report by the Joint Oireachtas Committee as part of the legislative process for a Bill (details supplied); and if she will make a statement on the matter. [33478/24] ",
        "answerText": " Minister for Education  The Supports for Survivors of Residential Institutional Abuse Bill 2024 was approved by Government on 16 April 2024 and published on 22 April 2024. The drafting of the Bill was informed by consideration of the final report of a survivor-led Consultative Forum, which was supported by professionally qualified facilitators engaged by my Department, alongside other submissions received from survivor groups, in consultation with relevant stakeholders. In addition, following the completion of the Pre-Legislative Scrutiny process in December 2023, the recommendations contained in the Joint Committee’s report were also considered prior to the finalisation of the Bill.  The Bill will enable the provision of certain ongoing supports to survivors of abuse in residential institutions and it is intended to progress the passage of the Bill as quickly as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-07-23",
        "by": {
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2023-07-25",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-07-25/writtens/mul@/dbsect_274.xml"
            }
          },
          "debateSectionId": "dbsect_274",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-07-25/writtens/dbsect_274",
          "showAs": "Tourist Accommodation"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-07-25/pq_301",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 301,
        "showAs": " 301. Deputy Mary Butler asked the Minister for Finance if he will consider the matters raised by an organisation (details supplied) on behalf of 27 local hotels and guesthouses. [36118/23] ",
        "answerText": " Minister for Finance  As the Deputy will recall, I extended the 9% VAT rate for the tourism and hospitality sectors to 31 August 2023 from the previous end date of 28 February 2023. It will revert to the 13.5% VAT rate on 1 September 2023. The estimated cost of this measure is €300m. This extension strikes a balance between the cost to public finances and the provision of support for these sectors.  It is not intended to extend this 9% reduced rate for a further period. As you may know, officials from my Department compiled a ministerial briefing on a number of measures, including the temporary 9% VAT rate. This briefing included an economic assessment of the measure. This considered the macroeconomic backdrop to any extension of the 9% rate, noting that the economy has rebounded strongly from the pandemic and that economic activity is now above pre-pandemic levels. The briefing also noted that the reduced rate is both regressive and very costly, and that this cost represents a transfer from taxpayers to the sectors which it covers.  The Government accepted the Department’s economic assessment, which found that there was no longer an economic case for the temporary 9% rate, and, therefore, decided upon a reversion to the 13.5% VAT rate. Specifically, the Government decided that the 9% VAT rate for the tourism and hospitality sectors will only apply until 31 August 2023. This decision was made in recognition of the employment provided in the sectors to which the 9% rate applies, as well as to give businesses a transition period to adapt to the changing economic and policy environment. Finally, the Government was cognisant of avoiding adding to upward pressure on prices while inflation remains so elevated. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-07-25",
        "by": {
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2023-07-11",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-07-11/writtens/mul@/dbsect_283.xml"
            }
          },
          "debateSectionId": "dbsect_283",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2023-07-11/writtens/dbsect_283",
          "showAs": "Education Policy"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2023-07-11/pq_305",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 305,
        "showAs": " 305. Deputy Mary Butler asked the Minister for Education if she will consider the matters raised in correspondence (details supplied); if she will direct relevant officials within her Department, who was previously engaging with the sender, to re-establish contact in an effort to resolve the matters put forth; and if she will make a statement on the matter. [34265/23] ",
        "answerText": " Minister for Education  The person in question has applied for payment of a doctorate degree allowance in respect of his PhD award in 2013.  This person's application has been assessed and reviewed by my Department officials and the person has been notified on a number of occasions that his application does not meet the criteria for eligibility to a doctorate degree allowance under the terms of Circulars 0008/2013 and 0063/2021. His application has been refused on the basis that the award date of his PhD qualification was after his date of retirement.  Following an appeal request by the person concerned, the application was subject to review by a more senior member of staff of my Department than the staff member who made the initial decision on the application. Following that review, the original decision in relation to the application was upheld.  Unfortunately, no further consideration can be given to this application. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2023-07-11",
        "by": {
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        }
      }
    },
    {
      "question": {
        "showAs": " 161. Deputy Mary Butler asked the Minister for Finance if he will consider issues facing Irish charities, community and voluntary groups and social enterprises raised in correspondence in budgetary context (details supplied); and if he will make a statement on the matter. [44395/22] ",
        "to": {
          "showAs": "Finance",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Finance  As the Deputy will be aware, it is a longstanding practice that the Minister for Finance does not comment, in advance of the Budget, on any tax matters that might be the subject of Budget decision. The correspondence provided by the Deputy will considered as a pre-budget submission. ",
        "date": "2022-09-14",
        "debateSection": {
          "showAs": "Budget 2023",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-09-14/writtens/dbsect_136",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-09-14/writtens/mul@/dbsect_136.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_136"
        },
        "by": {
          "showAs": "Mary Butler",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03",
          "memberCode": "Mary-Butler.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-09-14/pq_161",
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written",
        "questionNumber": 161
      },
      "contextDate": "2022-09-14"
    },
    {
      "question": {
        "showAs": " 367. Deputy Mary Butler asked the Minister for Social Protection if she will address the concerns raised in correspondence by stakeholders within the insurance industry regarding Institutions for Occupational Retirement Provision regulations and legislation; and if she will make a statement on the matter. [44415/22] ",
        "to": {
          "showAs": "Social",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Social Protection  IORP II, which became effective from 13 January 2019, sets out minimum standards for the management and supervision of pension schemes, with the objective of ensuring the soundness of occupational pensions and better protections for scheme members and beneficiaries across the European Union. IORP II requirements were transposed into Irish law by way of the European Union (Occupational Pension Schemes) Regulations 2021 (S.I. No. 128 of 2021) which came into force on 22nd April 2021.  The general principle followed in respect of the transposition of IORP II, in keeping with the Government’s Roadmap for Pensions Reform, is that the requirements of IORP II apply to all schemes and trust Retirement Annuity Contracts (RACs), including one-member arrangements (OMAs). This is in order to ensure that all members and beneficiaries are afforded equal protection irrespective of the size of the pension arrangement. It should be noted that the decision to apply the requirements of IORP II to all schemes and trust RACs was announced by the Government in 2019 and it was expected that trustees and insurance providers would have been preparing for compliance with these requirements in advance of transposition.  In the case of OMAs established on or after S.I. No. 128 of 2021, such arrangements are required to meet all new IORP II related requirements set out under the 1990 Act, where applicable, from the date on which they were established. From a supervision perspective, the Pensions Authority, however, outlined that it was applying a deadline of 1st July 2022 in respect of OMA’s compliance with those new requirements.  The supervision of compliance with the requirements of both IORP II and the Pensions Act 1990 (‘1990 Act’) is the responsibility of the Pensions Authority, which is the regulator for pensions in Ireland (and the competent authority within the meaning of the IORP II Directive).  The Pensions Authority is an independent statutory body, and it would not be possible or appropriate for me to interfere with the Pensions Authority’s compliance supervision function or to direct the Pensions Authority to extend any compliance deadlines relating to the provision of one-member arrangements (‘OMAs’). Furthermore, IORP II requires Member States to ensure that competent authorities, such as the Pensions Authority, conduct their tasks in a transparent, independent and accountable manner.  I hope this clarifies the position. ",
        "date": "2022-09-14",
        "debateSection": {
          "showAs": "Insurance Industry",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-09-14/writtens/dbsect_337",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-09-14/writtens/mul@/dbsect_337.xml"
            },
            "pdf": null
          },
          "debateSectionId": "dbsect_337"
        },
        "by": {
          "showAs": "Mary Butler",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03",
          "memberCode": "Mary-Butler.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-09-14/pq_367",
        "house": {
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "questionType": "written",
        "questionNumber": 367
      },
      "contextDate": "2022-09-14"
    },
    {
      "question": {
        "questionNumber": 387,
        "questionType": "written",
        "date": "2022-07-26",
        "house": {
          "chamberType": "house",
          "houseNo": "33",
          "houseCode": "dail",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "to": {
          "uri": null,
          "showAs": "Finance",
          "roleCode": null,
          "roleType": null
        },
        "debateSection": {
          "debateSectionId": "dbsect_343",
          "showAs": "Budget 2023",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-07-26/writtens/dbsect_343",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-07-26/writtens/mul@/dbsect_343.xml"
            }
          }
        },
        "showAs": " 387. Deputy Mary Butler asked the Minister for Finance if he will consider the issues facing independent retailers raised in correspondence in a budgetary context (details supplied); and if he will make a statement on the matter. [40958/22] ",
        "by": {
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-07-26/pq_387",
        "answerText": " Minister for Finance  The Government is acutely aware of the cost pressures facing households and firms, especially the increase in fuel and other energy prices. Government has acted swiftly, and frequently, to address the cost of living issue. Since Budget 2022 , measures of approximately €2.4 billion have been introduced to ease the burden.  While most of these measures have been targeted at households, several of these measures will also help firms. In particular, the Government reduced the rate of VAT on electricity and gas to 9 per cent and reduced the excise levied on fuels. Government cut tax on a litre of petrol by 20 cent, on a litre of diesel by 15 cent and on a litre Marked Gas Oil by 2 cent.  However, it is important to recognise the reality that the current inflationary environment is, primarily, driven by global pressures. As such Government cannot fully ease the burden of the rising cost of living.  It is also essential that fiscal policy itself does not become part of the problem: inappropriate policy could lead to second-round effects, counterproductively adding to inflation and increasing the vulnerability of the public finances. Therefore, Government policy will focus on temporary and targeted measures, aimed at those most in need.  The Government must also strike the balance between intervening today and keeping our public finances on a positive trajectory in the future. The need for a credible fiscal strategy for rebuilding fiscal buffers takes on an increased urgency in the context of multiple challenges facing the public finances including elevated levels of public debt, rising borrowing costs and significant medium-term expenditure pressures.  In the Summer Economic Statement , the Government adapted its budgetary strategy for next year on a once-off basis to take into account the much less benign inflationary environment. Reflecting this, Budget 2023 will be a ‘cost of living’ Budget, predominately focussed on helping to ease the burden of inflation. Budget 2023 will provide for an overall package of €6.7 billion; this has been calibrated to balance the need to provide further support with the need to avoid adding to inflationary pressures.  I have taken note of the suggested measures raised in correspondence but as the Deputy will appreciate, it would not be appropriate for me to speculate on policy decisions in advance of Budget Day. "
      },
      "contextDate": "2022-07-26"
    },
    {
      "question": {
        "questionNumber": 633,
        "questionType": "written",
        "date": "2022-07-26",
        "house": {
          "chamberType": "house",
          "houseNo": "33",
          "houseCode": "dail",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "to": {
          "uri": null,
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null
        },
        "debateSection": {
          "debateSectionId": "dbsect_554",
          "showAs": "Septic Tanks",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-07-26/writtens/dbsect_554",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-07-26/writtens/mul@/dbsect_554.xml"
            }
          }
        },
        "showAs": " 633. Deputy Mary Butler asked the Minister for Housing, Local Government and Heritage if he will address legislative matters raised in correspondence (details supplied) in respect of septic tanks; and if he will make a statement on the matter. [39896/22] ",
        "by": {
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-07-26/pq_633",
        "answerText": " Minister for Housing, Local Government and Heritage  I propose to take Questions Nos. 618 and 633 together.  My Department provides financial assistance towards the remediation, repair or upgrading works to, or the replacement of a domestic waste water treatment system under new and revised grant schemes, which launched in June 2020. The schemes are focused on areas of greatest environmental priority rather than general in application. This is in line with Government Policy which is framed in the context of meeting relevant obligations under legislation.  The Water Services Act 2007, as amended, required all owners of premises served by an individual domestic waste water treatment system to have the system entered into a register maintained by local authorities. The prescribed date of 1 February 2013 was appointed by the Water Services Act 2007 and 2012 Domestic Waste Water Treatment Systems (Registration) Regulations 2012, as amended. New houses with domestic treatment systems continue to be required to register.  My Department has undertaken to conduct a review of the grant schemes, examining all issues to ensure their continued alignment with policy objectives. The review is currently ongoing and is expected to be completed by year end. "
      },
      "contextDate": "2022-07-26"
    },
    {
      "question": {
        "questionNumber": 1113,
        "questionType": "written",
        "date": "2022-07-26",
        "house": {
          "chamberType": "house",
          "houseNo": "33",
          "houseCode": "dail",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "to": {
          "uri": null,
          "showAs": "Education",
          "roleCode": null,
          "roleType": null
        },
        "debateSection": {
          "debateSectionId": "dbsect_916",
          "showAs": "Special Educational Needs",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-07-26/writtens/dbsect_916",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-07-26/writtens/mul@/dbsect_916.xml"
            }
          }
        },
        "showAs": " 1113. Deputy Mary Butler asked the Minister for Education if she will address matters raised in correspondence (details supplied); and if she will make a statement on the matter. [40966/22] ",
        "by": {
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-07-26/pq_1113",
        "answerText": " Minister of State at the Department of Education  I would like to thank the Deputy for the question raised and advise the following.  The SET Allocation circular for the 2022/2023 outlined a process through which an individual school could appeal their allocation. The appeal process was as follows: In circumstances where a school considered the school profile was calculated incorrectly, using the data set out in the Special Education Teaching Allocation 2022/23 Circular, 0020/2022 (primary) and 0021/2022 (post primary), an appeal could be submitted to the NCSE for a review of the calculation of the allocation.  The purpose of the appeal process is to confirm that:  - the data used in the creation of the profile was correctly applied to the SET model  - the final model output was applied correctly to the allocation communicated to the relevant school.  This appeal process reviews the data used only and does not review the individual needs of children within the school.  The appeals are examined by an Independent Appeals Officer.  Unfortunately there was a delay with the review of appeals of the SET data used in this year’s SET re-profiling due to the unavailability of the Independent Appeals Officer.  A replacement Appeals Officer was identified and agreed to undertake the role but unfortunately due to illness they were unavailable to complete the review until this week.  I can confirm that the review has now been completed by the Independent Appeals Officer and the NCSE will be advising the school of the outcome of their appeal during the week of the 25th July.  It is acknowledged that there are circumstances, which may arise in schools, which fall outside the above appeals process. These relate to exceptional or emergency circumstances where the school profile significantly changes following the allocation process e.g. a developing school where the enrolment numbers significantly increase year on year. Where a school considers that a review of their allocation is warranted on the grounds of exceptional or emergency circumstances arising in the school, they will be able to request such a review. The exceptional review application form can be accessed through the NCSE website and the school portal. "
      },
      "contextDate": "2022-07-26"
    },
    {
      "question": {
        "questionNumber": 885,
        "questionType": "written",
        "date": "2022-07-05",
        "house": {
          "chamberType": "house",
          "houseNo": "33",
          "houseCode": "dail",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "to": {
          "uri": null,
          "showAs": "Agriculture",
          "roleCode": null,
          "roleType": null
        },
        "debateSection": {
          "debateSectionId": "dbsect_810",
          "showAs": "Common Agricultural Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-07-05/writtens/dbsect_810",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-07-05/writtens/mul@/dbsect_810.xml"
            }
          }
        },
        "showAs": " 885. Deputy Mary Butler asked the Minister for Agriculture, Food and the Marine if he will address the concerns raised in correspondence (details supplied); and if he will make a statement on the matter. [35567/22] ",
        "by": {
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-07-05/pq_885",
        "answerText": " Minister for Agriculture, Food and the Marine  I can confirm that, in the version of Ireland's draft CAP Strategic Plan 2023-2027 as submitted to the European Commission, there is a clerical error in section 4.1.2.4.6 (Decision regarding the inclusion of other species, such as shrubs and/or trees, which could be grazed and/or which produce animal feed, where grasses and other herbaceous forage are traditionally not predominant or are absent in grazing areas). The entry in this optional dialogue box should read \"yes, heather species\". The Department has notified the European Commission of this honest error, and it will be corrected in the final draft of Ireland's CAP Strategic Plan. "
      },
      "contextDate": "2022-07-05"
    },
    {
      "question": {
        "questionNumber": 919,
        "questionType": "written",
        "date": "2022-07-05",
        "house": {
          "chamberType": "house",
          "houseNo": "33",
          "houseCode": "dail",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "to": {
          "uri": null,
          "showAs": "Rural",
          "roleCode": null,
          "roleType": null
        },
        "debateSection": {
          "debateSectionId": "dbsect_844",
          "showAs": "Budget Process",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-07-05/writtens/dbsect_844",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-07-05/writtens/mul@/dbsect_844.xml"
            }
          }
        },
        "showAs": " 919. Deputy Mary Butler asked the Minister for Rural and Community Development if she has considered the pre-Budget submission of an organisation (details supplied) and its request for an increase in core grant funding; and if she will make a statement on the matter. [35687/22] ",
        "by": {
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-07-05/pq_919",
        "answerText": " Minister of State at the Department of Rural and Community Development  My Department's Community Services Programme (CSP) supports over 420 community-based organisations to provide local services through a social enterprise model, by providing an annual contribution of €19,033 for each full-time equivalent (FTE) position being supported, and, where warranted, €32,000 towards the cost of employing a manager.  The CSP contribution is not aligned to the minimum wage and does not meet the full salary cost of supported posts. The contribution must be co-funded by the organisation concerned from other sources, for example, from income received from the public use of their facilities and services.  There are currently over 1,700 FTE positions supported under the CSP. It should be noted that there are a number of CSP supported organisations currently in a position to pay their staff the living wage rate of €12.90 per hour.  An independent review of the CSP was undertaken by Indecon International Economic Consultants, on behalf of my Department, with the final report published in September 2020. Since the publication of the review report, my Department and Pobal, who administer the programme on behalf of my Department, have been working on a restructuring of the programme, in conjunction with a Consultative Group that is representative of stakeholders, of which the named organisation is a member. As part of this ongoing work, the rates of funding under the scheme are being reviewed.  My Department have in recent days met with the Consultative Group and have provided them with a detailed proposal on a revised funding rate allocation model and proposed new funding rates. Representative members of the Consultative Group are currently considering these proposals and will meet again with Department officials in the coming days. The submission received from the organisation, along with all of the feedback received from the Consultative Group will be considered in preparing my Department's budget requirements for the CSP Programme in 2023. "
      },
      "contextDate": "2022-07-05"
    },
    {
      "question": {
        "questionNumber": 186,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-06-28/pq_186",
        "by": {
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03",
          "showAs": "Mary Butler"
        },
        "showAs": " 186. Deputy Mary Butler asked the Minister for Transport the position regarding the possibility of allowing drivers of vehicles having passenger accommodation for less than eight persons to apply for an exemption in order to avail of the concessionary rate of motor tax for school buses due to extenuating circumstances (details supplied);; and if he will make a statement on the matter. [33986/22] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Transport",
          "roleCode": null
        },
        "questionType": "written",
        "date": "2022-06-28",
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "33rd Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseNo": "33",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-06-28/writtens/mul@/dbsect_137.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-06-28/writtens/dbsect_137",
          "showAs": "Tax Code",
          "debateSectionId": "dbsect_137"
        },
        "answerText": " Minister of State at the Department of Transport  In order to qualify for the school bus rate of motor tax, which is €95 annually, a vehicle must be a large public service vehicle within the meaning of the Road Traffic Acts (i.e., having passenger accommodation for more than eight persons, excluding the driver’s seat) and used only for the carriage of children, or children and teachers, to and from school or to and from school-related physical education activities. The vehicle must either be licensed under Article 60 of the Road Traffic (Public Service Vehicles) Regulations 1963 or be owned by a statutory transport undertaking.  The change proposed by the Deputy would require amendment to relevant legislation outlined. It would also have a potential cost to the Exchequer.  Any proposed changes to the current structure of the motor tax system are a matter for consideration in a Budgetary context. Changes to motor tax, either to the structure or to rates, are announced on Budget Day and subsequently legislated for in the Finance Act, which gives permanent effect to Budget measures. "
      },
      "contextDate": "2022-06-28"
    },
    {
      "contextDate": "2022-06-22",
      "question": {
        "answerText": " Minister for Rural and Community Development  The Rural Regeneration and Development Fund provides funding for the development and construction of capital projects in towns and villages and rural areas across Ireland. The Fund has, to date, allocated funding of €278 million for 191 projects across the country worth a total of €377 million.  Calls for applications to the Fund are sought under two categories – Category 1 and Category 2. Category 1 relates to large scale ambitious capital projects with all necessary planning and other consents in place and which are ready to proceed. Category 2 provides funding to enable the development of project proposals suitable for future calls for Category 1 applications.  The fourth call for Category 1 applications to the Rural Regeneration and Development Fund closed on the 29th  April 2022.  My Department received 42 applications to this call, together seeking funding of over €149 million.  The application process for the Fund is competitive in nature. Applications are currently being assessed by my Department under the oversight of the Project Advisory Board, comprised of representatives from key Government Departments and independent experts.  Once the assessment process is complete, my Department will prepare a report setting out recommended projects. My role as Minister will be to consider that report and make final decisions in relation to the allocation of funding.  I expect to be in a position to announce the successful projects in the coming months. ",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Rural",
          "roleType": null
        },
        "date": "2022-06-22",
        "showAs": " 248. Deputy Mary Butler asked the Minister for Rural and Community Development the timeline for the announcements of funding allocations under Rural Regeneration Development Funding to successful applicants; and if she will make a statement on the matter. [33066/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-06-22/pq_248",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03",
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03"
        },
        "house": {
          "chamberType": "house",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": "",
          "houseCode": "dail"
        },
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-06-22/writtens/mul@/dbsect_209.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-06-22/writtens/dbsect_209",
          "debateSectionId": "dbsect_209",
          "showAs": "Departmental Funding"
        },
        "questionNumber": 248,
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-06-22",
      "question": {
        "answerText": " Minister for Rural and Community Development  Our Rural Future, Ireland’s Rural Development Policy was launched in early 2021. The policy recognises the opportunity for rural rejuvenation that remote working presents and commits to establishing a comprehensive and integrated national network of 400 remote working hubs by 2025.  In furtherance of this commitment, my Department’s focus to date has been on strategically developing a national hubs network, and adding capacity to Ireland's existing remote working infrastructure.  Over €100m has been invested in the development of remote working facilities through programmes such as the Town and Village Renewal Scheme and the Rural Regeneration and Development Fund. Successful projects are developed in collaboration with Local Authorities and Communities with many projects seeing vacant and derelict buildings in rural towns and villages converted into remote working hubs.  In May 2021, I launched our National Hubs Network - Connected Hubs.  Connected Hubs is a shared online booking and payments platform for member hubs and their users.  There are currently 249 remote and co-working facilities across the State on Connected Hubs. This number is growing all the time meaning we are well on track to meet our target of 400 remote working hubs nationwide by 2025. The network includes a diverse range of hubs, services and facilities, thus facilitating companies of different sizes.  The Deputy will appreciate that following the launch of Our Rural Future in 2021, the immediate priority over the past year has been on establishing the national hubs network, putting the necessary infrastructure in place and achieving an initial critical mass.  Following strong progress on the establishment phase of the project with hubs now in place across every county, our focus has now shifted to the next stage of development. This will include working with our enterprise agencies as well as the private and public sector to raise awareness of the Connected Hubs network and its benefits for both workers and employers. To this end, I recently launched a new Voucher Scheme which will allow users who register on ConnectedHubs.ie to avail of three free days working from a Hub between now and the end of August. ",
        "to": {
          "uri": null,
          "roleCode": null,
          "showAs": "Rural",
          "roleType": null
        },
        "date": "2022-06-22",
        "showAs": " 249. Deputy Mary Butler asked the Minister for Rural and Community Development her plans to incorporate national regional development policy into the roll-out of the rurally based remote working hubs in an effort to regenerate towns and villages; if such rural regeneration initiatives will facilitate the distribution of public service roles and associated job opportunities to rural towns and villages; and if she will make a statement on the matter. [33067/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-06-22/pq_249",
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03",
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03"
        },
        "house": {
          "chamberType": "house",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": "",
          "houseCode": "dail"
        },
        "debateSection": {
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-06-22/writtens/mul@/dbsect_210.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-06-22/writtens/dbsect_210",
          "debateSectionId": "dbsect_210",
          "showAs": "Flexible Work Practices"
        },
        "questionNumber": 249,
        "questionType": "written"
      }
    },
    {
      "contextDate": "2022-05-18",
      "question": {
        "questionNumber": 122,
        "to": {
          "roleCode": null,
          "uri": null,
          "roleType": null,
          "showAs": "Education"
        },
        "answerText": " Minister of State at the Department of Education and Skills  This year’s Summer Programme will allow all primary and post-primary schools to offer a summer programme for students with complex special educational needs and those at greatest risk of educational disadvantage. In line with last year, the total funding available to provide summer programmes this year is up to €40 million. Building on the 2021 programme, all schools, both primary and post-primary, are encouraged to provide this valuable programme to their students. In 2021 nearly 38,000 children availed of the summer programme, an increase of 60% from the previous year.  A key objective of this year’s scheme is to increase the number of schools offering the summer programme to their students. Steps have been taken to afford schools as much flexibility as possible, and to encourage them to participate. These Include: the provision of paid overseeing and preparation time for schools, a reduction in the administrative burden for schools, arrangements to pay staff sooner, greater guidance, an online payments portal for schools, and greater flexibility in the timing of the programme.  However, my Department also recognises that not all schools will be in a position to provide a school-based programme, so a home-based programme continues to be available for students with complex needs where the school-based programme is unavailable. It is important that the home-based programme provides support for the education and/or care needs of students with complex needs during the summer break period.  Under the home-based programme grant funding is made available so that parents/legal guardians can engage the services of a teacher or an SNA to provide tuition or care support as appropriate in the child’s home. Schools are requested to provide parents with the contact details of a teacher/SNA where possible.  The NCSE have compiled a non-exhaustive list of private home tutor services and online platforms who may advertise for tutors for the 2022 Summer Programme and published it on their website.  The Irish Primary Principals Network has created a Summer Programme Noticeboard for teachers and SNAs to advertise their availability for the programme. Additionally this year, parents can also post notices on the noticeboard to source suitable candidates.  The Department will continue to work with all stakeholders to support parents in accessing summer provision and with schools to ensure that they have the resources and supports necessary to successfully run these programmes. ",
        "showAs": " 122. Deputy Mary Butler asked the Minister for Education if she will address matters raised in correspondence by a person (details supplied) in respect of the summer schools' programme; and if she will make a statement on the matter. [25050/22] ",
        "house": {
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "houseNo": "33"
        },
        "by": {
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03",
          "showAs": "Mary Butler"
        },
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_101",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-05-18/writtens/dbsect_101",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-05-18/writtens/mul@/dbsect_101.xml"
            }
          },
          "showAs": "Special Educational Needs"
        },
        "date": "2022-05-18",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-05-18/pq_122"
      }
    },
    {
      "contextDate": "2022-03-30",
      "question": {
        "house": {
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseNo": "33",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-03-30/writtens/mul@/dbsect_18.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-03-30/writtens/dbsect_18",
          "showAs": "Work Permits",
          "debateSectionId": "dbsect_18"
        },
        "questionType": "written",
        "questionNumber": 3,
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise",
          "roleType": null
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03",
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03"
        },
        "showAs": " 3. Deputy Mary Butler asked the Tánaiste and Minister for Enterprise, Trade and Employment if he will consider the work permit application issues raised in correspondence by a person (details supplied); and if he will make a statement on the matter. [16743/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-03-30/pq_3",
        "answerText": " Minister of State at the Department of Enterprise, Trade and Employment  In order to work in Ireland a non-EEA National, unless they are exempted, must hold a valid Employment Permit. All applications for employment permits are processed in line with the Employment Permits Acts and associated Regulations which lay down in legislation the criteria in relation to the application, grant and refusal of an employment permit.  The Employment Permits Section of my Department inform me that, on 26 June 2021, a General Employment Permit application for the employer concerned (in the details supplied) was received. On 6 October 2021 the application was refused for a number of reasons. The applicant was informed of this decision on 6 October 2021 and of their right to request a review of the decision within 28 days from the date of the refusal letter that issued. No request for a review was received.  All employment permits granted are employer and employee specific and therefore cannot be transferred from one employer to another. This means that if a permit holder ceases employment with a company, they must first obtain a new employment permit before entering new employment.  It is understood that the employment permit previously held by the employee concerned was in respect of a different employer, and has since expired. If that employment permit was still valid, it cannot be used to enable the employee to be employed by a different employer as they are not the employer specified on the permit. It therefore would have been necessary for a new employment permit to be applied for in the new employer’s name, which in this case was not done. It is not possible to change the name of an employer on an employment permit that has issued. Therefore, it appears that the employee was working for the new employer for a number of months without a valid employment permit.  Information in relation to changing employers is available on the Department’s website and can be accessed through the following link:- enterprise.gov.ie/en/What-We-Do/Workplace-and-Skills/Employment-Permits/Changing-Employer/.  Details in relation to changing employers is also contained in a FAQ document on my Department’s website which answers the majority of questions in relation to employment permits and it can be accessed through the following link:- enterprise.gov.ie/en/Publications/Publication-files/Employment-Permits-FAQs-2020.pdf.  It is noted that the employee concerned had issues with the employer named on the employment permit and that he had made a complaint to the WRC in relation to these issues in March 2021 during the Covid 19 pandemic. However due to the restrictions it was not possible for the WRC to carry out an inspection on this employer.  Therefore, it is recommended that a new application be submitted for a general employment permit. Such an application should comply with all of the legislative requirements for the particular employment permit type by addressing the reasons for the refusal of the application submitted in June 2021. ",
        "date": "2022-03-30"
      }
    },
    {
      "contextDate": "2022-03-29",
      "question": {
        "house": {
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseNo": "33",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-03-29/writtens/mul@/dbsect_469.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-03-29/writtens/dbsect_469",
          "showAs": "Residency Permits",
          "debateSectionId": "dbsect_469"
        },
        "questionType": "written",
        "questionNumber": 585,
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Justice",
          "roleType": null
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03",
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03"
        },
        "showAs": " 585. Deputy Mary Butler asked the Minister for Justice if she will consider the issues raised in correspondence by person (details supplied); and if she will make a statement on the matter. [16636/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-03-29/pq_585",
        "answerText": " Minister for Justice  I recognise and acknowledge the crucial role healthcare workers are continuing to play in responding to the threat of COVID-19. They work in a challenging environment and deal with vulnerable people on a daily basis. Their exceptional commitment has been particularly clear throughout the pandemic, during which they have played a key role in preventing the spread of COVID-19.  An immigration Stamp 3 indicates permission to stay in Ireland for a specified period, subject to conditions and is reckonable as residence when applying for citizenship by way of naturalisation. It is a condition of the Stamp 3 that the person cannot work or engage in any business, trade or profession.  It is open to anyone on any immigration permission to apply for a change of their immigration status if they meet the criteria for doing so. The person concerned may wish to consider applying for a stamp 2 immigration permission, which would allow the right to employment in limited circumstances and under student conditions. However, it should be borne in mind that a Stamp 2 is not reckonable for residence if the applicant intends to apply for naturalisation in the future.  More information is available on my Department's website at: www.irishimmigration.ie/my-situation-has-changed-since-i-arrived-in-ireland/ and at: www.irishimmigration.ie/registering-your-immigration-permission/information-on-registering/immigration-permission-stamps/. ",
        "date": "2022-03-29"
      }
    },
    {
      "contextDate": "2022-03-22",
      "question": {
        "by": {
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03",
          "showAs": "Mary Butler"
        },
        "date": "2022-03-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-03-22/pq_119",
        "answerText": " Minister of State at the Department of Enterprise, Trade and Employment (Deputy Damien English)  As a result of a settlement agreement reached in December 2021, the Security ERO as approved was quashed and the draft proposals remitted back to the Labour Court.  A Division of the Labour Court decided on the 7 February 2022 to direct the holding of a fresh hearing involving all interested parties desiring to be heard. This hearing took place in March.  If the Court decides to adopt the proposals, having heard from the interested parties, it will submit the proposals to me for consideration. ",
        "to": {
          "uri": null,
          "showAs": "Enterprise",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 119. Deputy Mary Butler asked the Tánaiste and Minister for Enterprise, Trade and Employment the position regarding issues in relation to a minimum wage agreement for the security industry raised in correspondence (details supplied); and if he will make a statement on the matter. [15033/22] ",
        "debateSection": {
          "debateSectionId": "dbsect_133",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-03-22/writtens/mul@/dbsect_133.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-03-22/writtens/dbsect_133",
          "showAs": "Enterprise Policy"
        },
        "questionNumber": 119,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2022-02-16",
      "question": {
        "house": {
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseNo": "33",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-02-16/writtens/mul@/dbsect_29.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-02-16/writtens/dbsect_29",
          "showAs": "Work Permits",
          "debateSectionId": "dbsect_29"
        },
        "questionType": "written",
        "questionNumber": 44,
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise",
          "roleType": null
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03",
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03"
        },
        "showAs": " 44. Deputy Mary Butler asked the Tánaiste and Minister for Enterprise, Trade and Employment the position regarding a work permit application by a person (details supplied); and if he will make a statement on the matter. [8486/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-02-16/pq_44",
        "answerText": " Minister of State at the Department of Enterprise, Trade and Employment  The Employment Permits Section of my Department inform me that a General Employment Permit application for the employer concerned (in the details supplied) was received on 7 October 2022.  Applications for employment permits are dealt with in date order. Applicants can keep track of Employment Permit applications current processing dates at enterprise.gov.ie/en/What-We-Do/Workplace-and-Skills/Employment-Permits/Current-Application-Processing-Dates/Current-Processing-Dates-for-Employment-Permits.html.  If a permit is urgently required, an applicant may request to have an application expedited. A request to have an application expedited will only be considered in exceptional cases. The Department can only consider a request to expedite an employment permit application where a detailed business case is provided.  Once the business case is completed it should be submitted to Employmentpermits@enterprise.gov.ie for consideration. It is important to point out that the completion of a business case does not guarantee that an expedite will be facilitated. A business case is required to be completed for each individual request.   Employment Permit expedite request form  ",
        "date": "2022-02-16"
      }
    },
    {
      "contextDate": "2022-02-16",
      "question": {
        "house": {
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseNo": "33",
          "chamberType": "house"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-02-16/writtens/mul@/dbsect_69.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2022-02-16/writtens/dbsect_69",
          "showAs": "Credit Unions",
          "debateSectionId": "dbsect_69"
        },
        "questionType": "written",
        "questionNumber": 87,
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Finance",
          "roleType": null
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03",
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03"
        },
        "showAs": " 87. Deputy Mary Butler asked the Minister for Finance the position regarding the progress of commitments to credit unions in the programme for Government as highlighted in correspondence from an organisation (details supplied); and if he will make a statement on the matter. [8593/22] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2022-02-16/pq_87",
        "answerText": " Minister for Finance  The Programme for Government includes a number of commitments in relation to the credit union sector.  Work on the Review of the Policy Framework is well advanced and we intend to issue proposals emanating from the Review for consultation shortly.  As part of the Review of the Policy Framework, Minister of State Fleming has conducted extensive stakeholder engagement, meeting with the representative bodies, collaborative ventures, service providers, the Credit Union Advisory Committee, the Registrar of Credit Unions and individual credit unions. The information gained from these meetings will help inform the next steps taken by Government.  In terms of supporting the sector to provide essential financial services to local communities, the following are some recent developments which highlight the potential of the sector to grow and fulfil a role in relation to community banking.   Lending and Investment   The Central Bank has in recent years reviewed both the lending and investment frameworks. Since 1 January 2020, credit unions now have a combined capacity to provide up to €1.1 billion in additional SME and mortgage loans, with further capacity available to credit unions who can comply with certain conditions or on approval by the Central Bank. As of September 2021, credit unions had a combined mortgage and SME loan book of circa €387 million, an increase of 19% year-on-year.  Credit unions are permitted to place their surplus funds that have not been lent to members in a range of investments including Tier 3 Approved Housing Bodies (AHBs). I am pleased to share with the Deputy that three credit union backed funds have received approval from the Central Bank. Credit unions will be able to invest up to €900 million in these regulated funds, which will subsequently lend to AHBs.   SME Lending   Nineteen credit unions were approved in early 2021 for participation in the Covid-19 Credit Guarantee Scheme. Further, in November five credit unions were announced as participants in the Brexit Impact Loan Scheme (BILS). The BILS provides low-cost loans of €25,000 to €1.5m to eligible Brexit-impacted businesses.  In total, SME lending has grown 6.9% year on year to end September 2021.  Further development of SME lending in a controlled manner could also assist credit unions in growing and diversifying their loan book.   Access to Finance for Retrofit   The Government significantly increased the funding available to support retrofit. My officials have been engaging with stakeholders to support increased credit union participation in retrofit loan schemes.   Other Services   Other than member savings and lending, in order to provide “additional services”, a credit union must receive approval from the Central Bank.  66 credit unions are approved to provide current accounts.  The Central Bank has prescribed a list of exempt services which may be provided without requiring approval. The Central Bank is undertaking a review of the Exempt Services Schedule to ensure that the services listed reflect the current financial services landscape. The Central Bank has commenced a public consultation seeking views from stakeholders on the proposed changes arising from this review. ",
        "date": "2022-02-16"
      }
    },
    {
      "contextDate": "2021-12-15",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-12-15/writtens/mul@/dbsect_210.xml"
            }
          },
          "debateSectionId": "dbsect_210",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-12-15/writtens/dbsect_210",
          "showAs": "Agriculture Schemes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2021-12-15/pq_220",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 220,
        "showAs": " 220. Deputy Mary Butler asked the Minister for Agriculture, Food and the Marine if he will address matters raised in correspondence by a person (details supplied) in relation to small organic farmers; and if he will make a statement on the matter. [62090/21] ",
        "answerText": " Minister for Agriculture, Food and the Marine  I am cognisant of the fact that there is substantial diversity in the types and scale of enterprises in the Irish beef sector, and it is in consideration of this that a range of supports are being put in place in the context of the incoming CAP in addition to the Suckler Carbon Efficiency Scheme which will also pay participants €150 on the first 10 cows in the herd. These include Eco Schemes, Dairy Calf Welfare scheme for farmers rearing beef calves from the dairy herd and substantial increases to supports for organic systems as well as all of the other supports available to farmers generally.  The purpose of the proposed Suckler Carbon Efficiency Scheme is to support improvements in economic and environmental efficiency through the use of genetics, genomics and performance metrics. Given that the use of genomics is a fundamental element underpinning the scheme, it is not possible for any participants in this scheme to be exempt from that measure, nor is it possible to provide target deadlines based on enterprise type or scale. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2021-12-15",
        "by": {
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2021-12-14",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-12-14/writtens/mul@/dbsect_101.xml"
            }
          },
          "debateSectionId": "dbsect_101",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-12-14/writtens/dbsect_101",
          "showAs": "Work Permits"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2021-12-14/pq_106",
        "to": {
          "roleType": null,
          "showAs": "Enterprise",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 106,
        "showAs": " 106. Deputy Mary Butler asked the Tánaiste and Minister for Enterprise, Trade and Employment the status of a work permit for a person (details supplied) given the urgency outlined in correspondence from the nursing home that is experiencing staff shortages; and if he will make a statement on the matter. [61431/21] ",
        "answerText": " Minister of State at the Department of Enterprise, Trade and Employment  On 14 June 2021, following a review of the employment permit occupation lists, changes to the employment permit system were announced, to address skills and labour shortages in the healthcare and nursing home sector. Following this review the occupation of Nursing Auxiliary or Assistant (Health Care Assistant) in hospital/nursing home settings became eligible for an employment permit from that date.  The grade of Nursing Auxiliary or Assistant (Health Care Assistant) in Hospital/Nursing Home Settings was removed from the ineligible occupation list within the following framework:  Attainment of a relevant QQI Level 5 qualification after 2 years employment in the State  A minimum remuneration threshold of salary of at least €27,000 for a 39 hour working week.  The framework will be reviewed after twelve months to ensure that the changes announced in June 2021 meet the needs of the sector.  The Employment Permits Section of the Department inform me that all five applications for Health Care Assistants referred to in the details supplied were received on dates between 15-20 October 2021. However on 10th December 2021 all of the applications were refused for a number of reasons.  The applicant has been notified by email of the refusal reasons and of the right to request a review of the decision within 28 days of issue of the refusal decision.  A comprehensive suite of information is available on my Department's website regarding employment permits and a FAQ document which answers the majority of the most common questions is available via the following link - dbei.gov.ie/en/What-We-Do/Workplace-and-Skills/Employment-Permits/  Regarding the recruitment of three nurses also referred to in the details supplied. If a positive decision is received from the Nursing and Midwifery Board of Ireland regarding their work status their Employment Permit applications should be submitted as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2021-12-14",
        "by": {
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2021-11-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-11-23/writtens/mul@/dbsect_670.xml"
            }
          },
          "debateSectionId": "dbsect_670",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-11-23/writtens/dbsect_670",
          "showAs": "Harness Racing Industry"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2021-11-23/pq_734",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 734,
        "showAs": " 734. Deputy Mary Butler asked the Minister for Agriculture, Food and the Marine the position regarding consideration of the funding request put forward to his Department by an association (details supplied); the position regarding the consideration of legislation to place harness racing on an equal footing with the greyhound and sports horse industry as a beneficiary on a pro rata basis of the horse and greyhound fund; and if he will make a statement on the matter. [57103/21] ",
        "answerText": " Minister for Agriculture, Food and the Marine  Under Section 12 of the Horse and Greyhound Racing Act, 2001 (No.20 of 2001), the horse and greyhound racing industries receive financial support from the State through the Fund. Monies are paid out in the ratio of 80% to Horse Racing Ireland and 20% to Rásaíocht Con Éireann as specified in Section 12 (6) of the Act.  The funding underpins the development of the relevant sectors and these funds are provided exclusively for these State Bodies. I currently have no plans to amended the legislation.  The Department funded the Indecon Review of the Irish Harness Racing Sector and a Five-Year Strategic Plan for Irish Harness Racing Association (IHRA). In addition, from 2016 to date, grants totalling some €162,000 have been paid to the IHRA under my Department's Equine Infrastructure Scheme. The Equine Infrastructure Scheme is funding three projects in 2021 totaling €30, 000.  The Department also awarded a tender to carry out an education programme aimed at road racing sulky participants and owners of trotting horses with a view to raising awareness of the importance of good horse welfare.  This pilot programme ran successfully in 2017, at a cost of €27,000 and the programme continued with courses held in 2018 and 2019. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2021-11-23",
        "by": {
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2021-11-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-11-09/writtens/mul@/dbsect_187.xml"
            }
          },
          "debateSectionId": "dbsect_187",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-11-09/writtens/dbsect_187",
          "showAs": "Tax Credits"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2021-11-09/pq_257",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 257,
        "showAs": " 257. Deputy Mary Butler asked the Minister for Finance the position regarding an application for incapacitated child credit in respect of a person (details supplied); if he will request the Revenue Commissioners to review incapacitated child credit application in respect of a person with a view to awarding same, at pre-diagnosis stage, in line with the current medical advice and significant medical evidence which has been provided; and if he will make a statement on the matter. [54461/21] ",
        "answerText": " Minister for Finance  Section 465 of the Taxes Consolidation Act 1997 provides for the payment of the incapacitated child tax credit to the parent or guardian of a child who is permanently incapacitated, either physically or mentally. The qualifying criteria requires that medical evidence is provided setting out the extent of the incapacity and whether it is expected to permanently prevent the child from being able to maintain himself or herself independently when over the age of 18 years.  Revenue has advised me that it has reviewed the application for the incapacitated child tax credit from the person in question but is unable to grant the relief at this point because the child’s diagnosis has not been confirmed by his medical practitioner. However, Revenue has assured me that the claim can be resubmitted should the person receives a confirmed diagnosis in respect of the child from a certified medical practitioner. The relief would then be available from the date the diagnosis is confirmed, subject to the general 4-year time limit for claiming tax credits.  Revenue has also advised me that the person can claim tax relief for additional health expenses in respect of the child. This would include the cost of any relevant assessment carried out by an approved practitioner. Further information on claiming health expenses in respect of a qualifying child can be found at link www.revenue.ie/en/personal-tax-credits-reliefs-and-exemptions/health-and-age/health-expenses/additional-health-care-expenses-for-a-child.aspx, which may be of assistance to the person. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2021-11-09",
        "by": {
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2021-11-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-11-09/writtens/mul@/dbsect_207.xml"
            }
          },
          "debateSectionId": "dbsect_207",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-11-09/writtens/dbsect_207",
          "showAs": "Tax Code"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2021-11-09/pq_284",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 284,
        "showAs": " 284. Deputy Mary Butler asked the Minister for Finance if he will address the concerns raised by an organisation (details supplied) in respect of green and glasshouse growers as per correspondence in the context of the carbon tax and Budget 2022; if he is satisfied that the future of this industry has been adequately safeguarded in conjunction with recent budgetary carbon taxation measures, considering the points raised in correspondence; and if he will make a statement on the matter. [54783/21] ",
        "answerText": " Minister for Finance  Mineral Oil Tax (MOT) applies to minerals oils used for motor or heating purposes in the State. The rate of MOT is comprised of a carbon and non-carbon component.  I am advised by Revenue that Section 98 of Finance Act 1999 provides for a partial relief for MOT for heavy oil and liquefied petroleum gas (LPG) used in horticultural production and the cultivation of mushrooms. Heavy oil refers to diesel, kerosene, and fuel oil, and LPG is defined in MOT legislation as “petroleum gases and other gaseous hydrocarbons falling within CN Codes 2711 12 11 to 2711 19 00”. The relief is operated by way of repayment only. The repayment amount is the difference between the MOT paid and the predetermined rate set out in section 98 for heavy oil/LPG. More information on the operation of the relief is also available on Revenue’s website.  With regard to the 2022 carbon tax rate increase, the Deputy will be aware that this applied to auto fuels with effect from 13th October 2021. However, I delayed the application of the rate increase on all other fuels until May 2022.  The Deputy will be aware that there are support schemes and investment aid available to horticultural producers from the Department of Agriculture, Food and the Marine and Bord Bia. Full details are available at the website addresses below.  www.gov.ie/en/service/d6dde0-commercial-horticulture-investment-aid-scheme-2020/  www.bordbia.ie/farmers-growers/get-involved/how-we-help/  In regard to the conditional planning exemption for biomass installation, I would suggest that this query is raised with my colleague, the Minister For Housing, Planning and Local Government. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2021-11-09",
        "by": {
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2021-11-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-11-09/writtens/mul@/dbsect_309.xml"
            }
          },
          "debateSectionId": "dbsect_309",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-11-09/writtens/dbsect_309",
          "showAs": "Special Educational Needs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2021-11-09/pq_418",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 418,
        "showAs": " 418. Deputy Mary Butler asked the Minister for Education if she will address the matters raised in correspondence by person (details supplied) regarding the July provision programme; and if she will make a statement on the matter. [54263/21] ",
        "answerText": " Minister of State at the Department of Education  Earlier this year, the Department announced the provision of a significantly expanded summer education programmes for pupils with complex special educational needs and those at greatest risk of educational disadvantage, as a COVID-19 pandemic response measure for summer 2021.  Teachers and SNAs who were employed in the school based programme were paid on or before 7th October.  As in previous years, a home-based programme was provided for eligible pupils where there was no place on a school programme for them. The eligibility criteria was widened significantly this year.  A total of 12,129 claims were received of which 9,229 claims will have been paid out by the 11 November. The remainder will be paid in the next payroll run on 25 November.  Claims are processed and paid when all outstanding queries are fully resolved. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2021-11-09",
        "by": {
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2021-11-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-11-09/writtens/mul@/dbsect_584.xml"
            }
          },
          "debateSectionId": "dbsect_584",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-11-09/writtens/dbsect_584",
          "showAs": "Harbours and Piers"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2021-11-09/pq_707",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 707,
        "showAs": " 707. Deputy Mary Butler asked the Minister for Agriculture, Food and the Marine the position regarding the possible provision of funding to complete works to the wall at the pier entrance in Helvick, County Waterford; the position regarding required dredging works to ensure that vessels can travel freely as opposed to current situation by which they must await certain tide levels; and if he will make a statement on the matter. [54255/21] ",
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 707 and 717 together.  The pier at Helvick Harbour is owned by Waterford City & County Council and responsibility for its maintenance and development rests with that local authority in the first instance and its parent Department, the Department of Housing, Local Government and Heritage thereafter.  My Department provides funding to assist coastal local authorities in carrying out small scale projects for the development and repair of local authority owned piers, harbours and slipways under the annual Fishery Harbour and Coastal Infrastructure Development Programme. Funding under the Programme is confined to capital works only. Between the years 2010-2020, Waterford City & County Council has received funding of €3.1m under this programme, with €530,000 of this allocated for works at Helvick Pier. Most recently in May the Council secured funding of €510,0000 to support five projects including an allocation of €150,000 for upgrade works at Helvick Pier.  Any decisions concerning future developments at Helvick Pier are a matter for the local authority concerned.  Recently, I received the Report of the Seafood Sector Task Force which makes recommendations to address the impacts on the fishing sector and coastal communities of the Trade and Cooperation Agreement between the European Union and the United Kingdom. The Taskforce has recommended an initiative of significant investment in publicly owned marine infrastructure to assist in diversification of economic opportunities and I have asked my Department officials to urgently examine this recommendation (as well as the others). ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2021-11-09",
        "by": {
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2021-11-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-11-09/writtens/mul@/dbsect_585.xml"
            }
          },
          "debateSectionId": "dbsect_585",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-11-09/writtens/dbsect_585",
          "showAs": "Animal Diseases"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2021-11-09/pq_708",
        "to": {
          "roleType": null,
          "showAs": "Agriculture",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 708,
        "showAs": " 708. Deputy Mary Butler asked the Minister for Agriculture, Food and the Marine if he will address the matters raised in correspondence by a person (details supplied) in relation to the increase in outbreaks of TB in an area; and if he will make a statement on the matter. [54257/21] ",
        "answerText": " Minister for Agriculture, Food and the Marine  Following many successful years of reducing bovine TB levels to the benefit of Irish farmers, there is a concerning incremental increase in the disease since 2016. In 2020, herd incidence (on a year-to-date basis) breached 4% for the first time since 2012 and reactor numbers exceeded 20,000 – the highest number since 2009. There are positive indications of progress though; the TB situation for 2021 is likely to represent an improvement compared to 2020, and working together we can build on that momentum. On a 12-month rolling basis as of 31st October 2021, nationally herd incidence stands at 4.25%. Waterford herd incidence stands at 4.34%.  The bovine TB eradication programme for Waterford is implemented through Waterford Regional Veterinary Office (RVO). The RVO main function is to ensure delivery of the programme and verification of effective controls.  Waterford RVO is staffed by teams of Veterinary, Technical and Administrative personnel. The teams do not solely work on the bTB Eradication programme, they are also involved in working on various other animal health welfare programmes.  Unfortunately, vacancies can arise within RVO from time to time. I have been made aware of the vacant positions and I recognise the urgency in filling these posts. As of the 31st October 2021, within Waterford RVO there were no veterinary vacancies, 3  technical vacancies and no administrative vacancies.  My Department and I are continuously working to fill vacancies as soon as possible after they arise and I would like to give you my assurance that these vacancies will be filled at the earliest possible juncture. In addition, as part of my on-going commitment to eradicating this disease I have sanctioned an additional €1m in funding for the wildlife programme which is an integral element of the overall programme. I am acutely aware of the financial and emotional burden associated with a TB breakdown and my Department is working with all stakeholders to tackle this problem. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2021-11-09",
        "by": {
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2021-11-02",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-11-02/writtens/mul@/dbsect_109.xml"
            }
          },
          "debateSectionId": "dbsect_109",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-11-02/writtens/dbsect_109",
          "showAs": "Work Permits"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2021-11-02/pq_82",
        "to": {
          "roleType": null,
          "showAs": "Enterprise",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 82,
        "showAs": " 82. Deputy Mary Butler asked the Tánaiste and Minister for Enterprise, Trade and Employment the position regarding the status of a work permit (details supplied);; and if he will make a statement on the matter. [52081/21] ",
        "answerText": " Minister of State at the Department of Enterprise, Trade and Employment  The Employment Permits Section of my Department inform me that a standard application for a General Employment Permit for the person concerned (details supplied) was received on 30th September 2021.  Applications for employment permits are dealt with in date order, as Employment Permits Section are currently processing standard applications received on 15th July 2021.  Applicants can keep track of Employment Permit applications current processing dates at: enterprise.gov.ie/en/What-We-Do/Workplace-and-Skills/Employment-Permits/Current-Application-Processing-Dates/Current-Processing-Dates-for-Employment-Permits.html ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2021-11-02",
        "by": {
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2021-11-02",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-11-02/writtens/mul@/dbsect_435.xml"
            }
          },
          "debateSectionId": "dbsect_435",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-11-02/writtens/dbsect_435",
          "showAs": "Departmental Correspondence"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2021-11-02/pq_473",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 473,
        "showAs": " 473. Deputy Mary Butler asked the Minister for Education if she will address matters raised in correspondence by a person (details supplied); and if she will make a statement on the matter. [52079/21] ",
        "answerText": " Minister for Education  I would like to inform the Deputy that the Emergency Works team have been in contact with the Additional Schools Accommodation section to discuss the issue and as a result the school in question have been asked to submit a revised Emergency Works Scheme application for assessment. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2021-11-02",
        "by": {
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2021-11-02",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-11-02/writtens/mul@/dbsect_437.xml"
            }
          },
          "debateSectionId": "dbsect_437",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-11-02/writtens/dbsect_437",
          "showAs": "Departmental Correspondence"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2021-11-02/pq_475",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 475,
        "showAs": " 475. Deputy Mary Butler asked the Minister for Education if she will address a matters raised in correspondence (details supplied) in relation to student safety; and if she will make a statement on the matter. [52085/21] ",
        "answerText": " Minister for Education  I would like to inform the Deputy that the Emergency Works team have been in contact with the Additional Schools Accommodation section to discuss the issue and as a result the school in question have been asked to submit a revised Emergency Works Scheme application for assessment. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2021-11-02",
        "by": {
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2021-11-02",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-11-02/writtens/mul@/dbsect_589.xml"
            }
          },
          "debateSectionId": "dbsect_589",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-11-02/writtens/dbsect_589",
          "showAs": "Departmental Schemes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2021-11-02/pq_631",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 631,
        "showAs": " 631. Deputy Mary Butler asked the Minister for Children, Equality, Disability, Integration and Youth if he will address a matters raised in correspondence (details supplied) in relation to the childcare scheme age for crèches; and if he will make a statement on the matter. [52088/21] ",
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  My Department does not directly provide after school childcare, but my Department does provide a range of supports for any body who wishes to set up an early learning and childcare or after school childcare service.  Any school which wants to set up an after-school service, and which registers with Tulsa, will be able to access the National Childcare Scheme funding which may reduce the cost of after-school care to parents. Schools may establish such as service themselves, or may provide premises to a Tusla registered provider to deliver after-school care on the school premises. Schools can get support from their local County Childcare Committee (CCC) for information and support on establishing or hosting an after-school service. Details of the CCCs can be found on www.myccc.ie .  In previous years my Department has provided an annual capital grant programme for early learning and childcare providers, which provided funding for areas such as improving outdoor facilities or expanding the number of places available. This annual funding will be replaced with significantly increased investment under the National Development Plan (NDP) during the period 2022-2030.  NDP capital funding allocated to early learning and school age childcare will be used to increase the stock of early learning and school age childcare infrastructure, in order to address capacity challenges including the undersupply for certain types of provision and in specific areas of the country.  My Department is currently developing proposals for the allocation of NDP funding to the early learning and school age childcare sector, and these will be announced in the coming months. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2021-11-02",
        "by": {
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2021-10-20",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-10-20/writtens/mul@/dbsect_281.xml"
            }
          },
          "debateSectionId": "dbsect_281",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-10-20/writtens/dbsect_281",
          "showAs": "Departmental Funding"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2021-10-20/pq_324",
        "to": {
          "roleType": null,
          "showAs": "Rural",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 324,
        "showAs": " 324. Deputy Mary Butler asked the Minister for Rural and Community Development the funding programmes within her Department which are due to reopen for applications following announcements made through Budget 2022; if she will provide details of an appropriate funding stream for organisations (details supplied); and if she will make a statement on the matter. [51338/21] ",
        "answerText": " Minister of State at the Department of Rural and Community Development (Deputy Joe O'Brien)  The increased funding allocated to the Department under Budget 2022 will allow it to continue to support communities across Ireland as we emerge from the COVID-19 pandemic.  The Community Enhancement Programme is the funding programme within my Department that is most relevant to the bridge club referenced by the Deputy. It provides small grants to community groups to enhance facilities in disadvantaged areas.  Funding is provided to each Local Authority area, and administered by Local Community Development Committees (LCDCs).  In May this year I launched the 2021 CEP with an allocation of €4.5m.  The key theme was to support groups as they reopen facilities which were closed due to COVID-19.  The 2021 CEP is now closed, but it will re-open in due course and further information will be available from the LCDC in each area.  The following two schemes were also specifically referenced by the Deputy.  The Social Inclusion and Community Activation Programme provides funding to Local Development Companies across Ireland so that they can work with marginalised individuals and the groups that represent them. This programme has secured a 10% or €4m budget increase in 2022, and the current iteration covers the period from 2018 to the end of 2023.  The Scheme to Support National Organisations (SSNO) provides multi-annual funding towards core costs of national community and voluntary organisations that demonstrate good governance and deliver services and supports that have a focus on one or more of the following: addressing poverty, social exclusion and promoting equality.  The current three year scheme commenced on 1st July 2019 and will cease on 30th June 2022. A total of €18.8 million has been allocated under the current scheme to a total of 74 organisations. It is expected that a new iteration of the scheme will commence in July 2022, further to an application process commencing in December 2021. Funding for the Scheme to Support National Organisations (SSNO Scheme) will increase from €5.9 million to €6.7 million in 2022.  My Department also has many other schemes, the details of which are available on my Department’s website. I would also encourage interested parties, such as the bridge club referenced by the Deputy, to stay in touch with the Local Development Company and Local Authority in their area, so that they are aware of grant schemes from across Government Departments and state agencies, as they become available. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2021-10-20",
        "by": {
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2021-10-19",
      "question": {
        "date": "2021-10-19",
        "questionType": "written",
        "showAs": " 615. Deputy Mary Butler asked the Minister for Social Protection if she will address matters raised in correspondence (details supplied); and if she will make a statement on the matter. [50648/21] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2021-10-19/pq_615",
        "questionNumber": 615,
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "answerText": " Minister for Social Protection  I assume the Deputy’s Question is referring to the Pensions Commission’s recommendations in relation to increasing Social Insurance Fund (SIF) income.  The Pensions Commission was established in November 2020 to examine the sustainability of the State Pension system and the Social Insurance Fund, in fulfilment of a Programme for Government commitment.  The Commission was an independent body comprised of knowledgeable and experienced academics, pension experts, members of civil society and representatives of workers and employers.  The Commission has completed it work and its report was published on the 7th October 2021.  The Commission’s Report has unambiguously established that the current State Pension system is not sustainable into the future and that change is needed.  It is a very comprehensive and detailed report that takes account of responses to a very extensive consultation process.  The report sets out a wide range of recommendations, including measures to increase Social Insurance Fund (SIF) income.  In the interests both of older people and of future generations of older people, the Government intends to consider the comprehensive and far reaching recommendations in the Commission’s Report very carefully.    The report has been referred to the Joint Oireachtas Committee on Social Protection and the Commission for Taxation and Welfare for their views.   I will also work with my officials over the coming months to examine each of the recommendations carefully and will consult with colleagues in Government through the Cabinet Committee system.  I intend to bring a recommended response and implementation plan to Government by the end of March 2022.  I think it is really important that we complete that work before reaching conclusions.  The State Pension is the bedrock of the pension system in Ireland.  It is extremely effective at ensuring that our pensioners do not experience poverty.   This Government is committed to ensuring that this remains the case for current pensioners, those nearing State Pension age and today’s young workers including those who are only starting their careers.  I trust this clarifies matters for the Deputy. ",
        "house": {
          "houseNo": "33",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": "",
          "showAs": "33rd Dáil"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03",
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-10-19/writtens/dbsect_502",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-10-19/writtens/mul@/dbsect_502.xml"
            }
          },
          "debateSectionId": "dbsect_502",
          "showAs": "Social Insurance"
        }
      }
    },
    {
      "contextDate": "2021-10-19",
      "question": {
        "date": "2021-10-19",
        "questionType": "written",
        "showAs": " 638. Deputy Mary Butler asked the Minister for Social Protection if she will address matters raised in correspondence (details supplied); and if she will make a statement on the matter. [51329/21] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2021-10-19/pq_638",
        "questionNumber": 638,
        "to": {
          "uri": null,
          "showAs": "Social",
          "roleCode": null,
          "roleType": null
        },
        "answerText": " Minister for Social Protection  Parents Leave and Benefit is currently available to all eligible parents of children born or adopted from 1st November 2019 and must be used within the first two years of the child’s life or adoption. This leave can be taken in either consecutive weeks or in one-week blocks in order to provide the family with full flexibility.  Provision was made in Budget 2022 to increase the number of weeks of Parents Leave and Benefit available to eligible parents from five weeks to seven weeks with effect from July 2021. The additional two weeks leave and benefit will apply to parents of children who are under age 2 years in July 2022 (or adoptive children who have been with their parents for less than two years at that point).  The extension of Parent’s Leave and Benefit requires legislation and changes to the Department's IT systems. The additional two weeks of Parents Leave and Benefit will not be available until legislation has been enacted, with plans to have this in place by the July commencement date.  However, parents with an entitlement to the existing five weeks of Parents Leave and Benefit can avail of their current entitlement and can then apply for the additional weeks when they become available if their child is still under two at that time.  Calculation of any bonus entitlement is a contractual matter between the employer and employee and therefore the Department is not in a position to advise how periods on parents leave/benefit would affect an employee’s annual bonus.  I hope this clarifies the position for the Deputy. ",
        "house": {
          "houseNo": "33",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": "",
          "showAs": "33rd Dáil"
        },
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03",
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-10-19/writtens/dbsect_526",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-10-19/writtens/mul@/dbsect_526.xml"
            }
          },
          "debateSectionId": "dbsect_526",
          "showAs": "Social Welfare Benefits"
        }
      }
    },
    {
      "contextDate": "2021-10-12",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-10-12/writtens/mul@/dbsect_128.xml"
            }
          },
          "debateSectionId": "dbsect_128",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-10-12/writtens/dbsect_128",
          "showAs": "Departmental Correspondence"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2021-10-12/pq_127",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 127,
        "showAs": " 127. Deputy Mary Butler asked the Minister for Finance if he has received correspondence (details supplied); the status of a response being issued; and if he will make a statement on the matter. [49623/21] ",
        "answerText": " Minister for Finance  Budget 2021 saw motor tax reform introduced in the context of the transition to the new vehicle emissions test procedure, the Worldwide Harmonized Light Vehicles Test Procedure (WLTP), and in light of Government commitments to reduce road transport emissions. Cars in the existing CO2 fleet continue to be taxed on the same banding structure that has been in effect since 1 January 2013, while there were some modest increases to rates in the higher emitting Bands C to G, the first increases in motor tax since that date. Pre-2008 cars are still taxed according to engine size, and those rates were not changed in Budget 2021. The old, discredited New European Driving Cycle (NEDC) motor tax table was adjusted to reflect climate action priorities and to ensure a level playing field with the introduction of a third table that covers WLTP cars registered from 1/1/2021.  The Programme for Government 2020 contains a commitment to an average of a 7% reduction in greenhouse gas emissions year-on-year from 2021 to 2030 and to achieving net zero emissions by 2050. The transport sector currently accounts for 20% of Ireland’s greenhouse gas emissions levels and a reduction in emissions levels in the sector, through a combination of taxation and incentivisation, will form a key part of achieving that target. Private car usage represents 50% of those emissions. In this regard, the CO2 based motor tax system for private cars, which comprise the bulk of the vehicle fleet, is structured in such a way as to incentivise the uptake of electric and lower CO2-emitting vehicles, with these attracting lower motor tax rates than higher emitting vehicles. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2021-10-12",
        "by": {
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2021-10-12",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-10-12/writtens/mul@/dbsect_353.xml"
            }
          },
          "debateSectionId": "dbsect_353",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-10-12/writtens/dbsect_353",
          "showAs": "Direct Provision System"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2021-10-12/pq_366",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 366,
        "showAs": " 366. Deputy Mary Butler asked the Minister for Children, Equality, Disability, Integration and Youth if he will address matters raised in correspondence in relation to the direct provision system (details supplied); and if he will make a statement on the matter. [49618/21] ",
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  I note the correspondence the Deputy refers to is from a member of the public who references my plans to end direct provision and expresses concern about the welfare of applicants in the current system.  As the Deputy will be aware, I published a “White Paper to End Direct Provision and to establish a new International Protection Support Service”. The White Paper sets out a new Government policy to establish a new International Protection Support Service that I envision will be fully operational by December 2024. This new system will have human rights at its core and will help to ensure that all applicants are treated with dignity and respect. The International Protection Support Service Transition Team of this Department is progressing a detailed implementation plan for the new system and is working closely with the Department of Housing, Local Government and Heritage, the Housing Agency and the Local Authorities on developing the new Accommodation Model and wrap-around services for residents.  As we transition to the new system, in order to meet our legal obligations to provide accommodation and other support services for protection applicants, existing accommodation centres will continue to operate in the short to medium term; as such my Department currently utilises a mixture of state owned, commercial and temporary emergency accommodation centres.  As for the concerns expressed in the correspondence regarding the welfare of applicants in the current system, there is a clear graduated complaints procedure set out in the House Rules & Procedures Booklet for International Protection applicants. Complaints are made initially to the centre manager with a view to informal resolution. If the resident concerned is not satisfied with the outcome of their complaint, they may make a complaint to IPAS who will investigate the matter and take action as appropriate. In the event that a resident remains dissatisfied with how their complaint is dealt with, they have full access to the services of the Ombudsman and Ombudsman for Children.?  To provide further support to all residents, a confidential Freephone telephone support service exists. The Freephone helpline is operated by the Jesuit Refugee Service (JRS). A complaint made to the JRS may be resolved without any IPAS intervention through mediation between the JRS team, the resident and whatever service their complaint relates to. Should a resident desire, a complaint made through this service may also be passed, in confidence, back to IPAS for investigation and resolution.  In addition to the existing complaints mechanisms available to residents, two new specialist teams were established in IPAS earlier this year to provide a greater focus on the individual needs of residents.  A new dedicated IPAS Customer Services Team is working to strengthen the existing resident complaints system and take a more proactive approach to dealing with residents' issues, actively engaging with residents through regular resident feedback clinics. As well as this increased in-person engagement with residents, the Customer Services Team will also be exploring the use of other feedback mechanisms such as customer focus groups in the months ahead.  The IPAS Resident Welfare Team is a new multi-disciplinary team that focuses on residents with more complex issues, including those with physical and mental health issues and persons identified through the IPAS Vulnerability Assessment Process as having special reception needs. Officials from Tusla, the HSE’s Social Inclusion Team and the Department of Education support this team. Additional Social Workers are currently being recruited to provide further support to the team.  My officials and I take the nutritional needs of residents very seriously. All of my Department’s international protection accommodation centres are contractually bound to provide menus that reasonably meet the dietary needs of the different ethnic groups accommodated at the centre and the reasonable prescribed dietary needs of any person accommodated at the centre. Menus must include a vegetarian option and all food products provided must have a traceability system that complies with food safety requirements. All accommodation centres that offer catered options must provide three meals per day and must have a range of snacks and non-alcoholic beverages readily available.  In addition, contractors must consult with residents and resident committees in the accommodation centres in relation to preferences for inclusion of specific foods on menus or any dietary requirement that they have and where possible this is facilitated. Arrangements are also be made to cater for any particular religious requirements of residents, such as observing Ramadan.  Concerning the conditions in the referenced accommodation centre, every centre is subject to regular unannounced inspections by both my officials in the IPAS and an independent inspectorate company (QTS Limited). These inspections are undertaken, twice yearly by QTS Limited and once yearly by my officials in IPAS. Inspections cover a wide range of issues including the quality of the food, fire safety and other health and safety issues. The particular centre has been inspected on three occasions since 2019. The reports are available on the gov.ie portal’s publications section atwww.gov.ie/en/publication/534c2-ipas-inspection-reports/#monaghan. HIQA will shortly take on the role of monitoring all centres against national standards.  Other matters such as the right to work, leave to remain, amnesty for frontline workers and deportation fall under the remit of my colleague, the Minister for Justice. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2021-10-12",
        "by": {
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2021-10-05",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-10-05/writtens/mul@/dbsect_170.xml"
            }
          },
          "debateSectionId": "dbsect_170",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-10-05/writtens/dbsect_170",
          "showAs": "Tax Code"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2021-10-05/pq_171",
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 171,
        "showAs": " 171. Deputy Mary Butler asked the Minister for Finance if he will address the concerns raised by green growers in correspondence (details supplied) in the context of the carbon tax and Budget 2022; if he is satisfied that the future of this industry has been adequately safeguarded given the points raised in correspondence; and if he will make a statement on the matter. [47723/21] ",
        "answerText": " Minister for Finance  Mineral Oil Tax (MOT) applies to minerals oils used for motor or heating purposes in the State. The rate of MOT is comprised of a carbon and non-carbon component.  I am advised by Revenue that Section 98 of Finance Act 1999 provides for a partial relief for MOT for heavy oil and liquefied petroleum gas (LPG) used in horticultural production and the cultivation of mushrooms. Heavy oil refers to diesel, kerosene, and fuel oil, and LPG is defined in MOT legislation as “petroleum gases and other gaseous hydrocarbons falling within CN Codes 2711 12 11 to 2711 19 00”. The relief is operated by way of repayment only. The repayment amount is the difference between the MOT paid and the predetermined rate set out in section 98 for heavy oil/LPG. More information on the operation of the relief is also available on Revenue’s website.  With regard to carbon tax and Budget 2022, as the Deputy will be aware, it is a longstanding practice of the Minister for Finance not to comment, in advance of the Budget, on any tax matters that might be the subject of Budget decisions.  The Deputy will also be aware that there are support schemes and investment aid available to horticultural producers from the Department of Agriculture, Food and the Marine and Bord Bia. Full details are available at the website addresses below.  www.gov.ie/en/service/d6dde0-commercial-horticulture-investment-aid-scheme-2020/  www.bordbia.ie/farmers-growers/get-involved/how-we-help/ ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2021-10-05",
        "by": {
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2021-10-05",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-10-05/writtens/mul@/dbsect_213.xml"
            }
          },
          "debateSectionId": "dbsect_213",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-10-05/writtens/dbsect_213",
          "showAs": "Budget 2022"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2021-10-05/pq_235",
        "to": {
          "roleType": null,
          "showAs": "Tourism",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 235,
        "showAs": " 235. Deputy Mary Butler asked the Minister for Tourism, Culture, Arts, Gaeltacht, Sport and Media the steps she is taking to address and ensure the ten main concerns raised by a group (details supplied) are prioritised in advance of the impending negotiations for Budget 2022 between her Department and the Department of Finance; and if she will make a statement on the matter. [47735/21] ",
        "answerText": " Minister for Tourism, Culture, Arts, Gaeltacht, Sport and Media  I wish to advise the Deputy that the group to which she refers has sent copies of its pre-Budget Submission for 2022 to me and to my officials. I am familiar with the ten main concerns raised. Budget 2022 will be announced on 12 October 2021.  A number of the recommendations listed in the pre-Budget submission, that come within the remit of my Department are also contained in the Arts and Culture Recovery Taskforce report Life Worth Living , published in November 2020. The recommendations included a proposal to pilot a basic income scheme for a three-year period in the arts, culture, audiovisual and live performance and events sectors. Other recommendations relate to increased funding to existing programmes and agencies.  As part of the Economic Recovery Plan launched on 1 June 2021, Government committed to bringing forward a proposal in response to the Taskforce recommendation for a basic Income pilot scheme for artists. I established an Oversight Group with the remit of addressing the outstanding recommendations of the Life Worth Living report. The Oversight Group was asked to prioritise the manner in which a Basic Income pilot scheme for artists could be delivered.  As the Deputy will be aware the Programme for Government committed to continue to reform and improve the Budgetary process in order to enhance Ireland’s budgetary framework. The budgetary reforms introduced in recent years, including Performance Budgeting and Equality Budgeting, are focussed on providing the evidence base to support the efficient and effective delivery of services that have a positive impact on people's lives. This work is being further enhanced with the development of the Wellbeing Framework for Ireland that can inform efforts to improve the impact of public policy.  As we emerge from the pandemic, I am committed to supporting the long-term sustainability of the arts and culture sectors. We have a unique opportunity to achieve these in the wake of the COVID-19 pandemic. The arts have and continue to be among the most negatively impacted sectors and in this context, I am future focussed on the recovery of the culture sector.  Finally, I can inform the Deputy that both I and my Department's officials meet regularly with the group to whom the Deputy refers and I am meeting with them on these matters tomorrow. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2021-10-05",
        "by": {
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2021-10-05",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-10-05/writtens/mul@/dbsect_331.xml"
            }
          },
          "debateSectionId": "dbsect_331",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-10-05/writtens/dbsect_331",
          "showAs": "Disadvantaged Status"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2021-10-05/pq_392",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 392,
        "showAs": " 392. Deputy Mary Butler asked the Minister for Education the status of the current DEIS review; the way a school (details supplied) can be considered for the status under plans to extend the DEIS programme to new entrant schools; and if she will make a statement on the matter. [47753/21] ",
        "answerText": " Minister for Education  A key part of the DEIS Plan was the introduction of a new DEIS identification process based on an objective, statistics based model to determine which schools merit inclusion in the DEIS programme. An extensive body of work has been undertaken in terms of the refinement of this model, based on the latest school enrolment data and data available from Census 2016 under the HP Deprivation Index.  A detailed quality analysis of the data has been carried out by members of the DEIS Technical Group which contains representatives of the Department’s Statistics and Social Inclusion Units, the Inspectorate and the Educational Research Centre. My Department has commenced a consultation process with education partners on the technical aspects of this model, and work is now ongoing on final elements of the model.  It is envisaged that this will provide the basis for the development and application of a refined DEIS resource allocation model to ultimately match resources to identified need. All schools will be considered for inclusion under the refined DEIS model. Until this work is complete, it is not intended to extend the DEIS programme to any further schools. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2021-10-05",
        "by": {
          "showAs": "Mary Butler",
          "memberCode": "Mary-Butler.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        }
      }
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Further and Higher Education, Research, Innovation and Science  Ireland has an advanced system of skills provision, across Further and Higher Education, lifelong learning and human capital development, which is agile and responsive to changes in the world of work, in order to address evolving skills needs.  The National Skills Council (NSC) and nine Regional Skills Fora (RSF), created under the National Skills Strategy, foster engagement and collaboration between relevant Government Departments and agencies, the education and training system, and enterprise. The broader skills ecosystem also encompasses entities including the Skills and Labour Market Research Unit (SLMRU, hosted in SOLAS), the Expert Group on Future Skills Needs (EGFSN, Department of Enterprise, Trade and Employment) and the National Training Fund Advisory Group (NTFAG, DFHERIS). While DFHERIS has responsibility for skills policy, this broader skills ecosystem informs and drives responsive, flexible forecasting, planning, and provision.  In terms of supporting learners to develop skills and achieve relevant qualifications to support the industries set out below, there are a wide range of programmes available across the further education and training and the higher education sectors to support the agri-machinery field.  Examples include work based learning through traineeship (HGV Professional Driver Traineeship, Welding Fabrication Traineeship) or apprenticeship (see below) and the general further and higher education programmes from welding and motor technology to electronic engineering.  Eight of the ten occupations listed are craft apprentice occupations. Apprenticeship is a demand driven, employer-led offering based on a contract of employment between the apprentice and their respective employer. Therefore the number of apprentices in any specific sector is determined directly by employer provision.  Recognising the importance of these occupations to the economy and the opportunity offered by apprenticeship to support economic recovery, the Apprenticeship Incentivisation Scheme (AIS) was launched in March 2020 to support employers to continue to recruit apprentices during the COVID-19 period.  The establishment, funding and success of the scheme is a strong demonstration of  the Government's commitment to the development and growth of apprenticeship in Ireland, which will be sustained and intensified through the implementation of the Action Plan for Apprenticeship.  In addition to the existing apprenticeships, a Commercial Driver Apprenticeship is in development and due to be launched shortly.  The closure of face to face training in education and training institutions resulted in a backlog of off-the-job training delivery for craft apprentices in phases 2,4 and 6 of their seven phase apprenticeship. SOLAS and the HEA have been working with education and training providers to agree a significant response which commenced in September and will clear the waiting lists by April 2022 for phase 4 and 6 and by year end 2022 for phase 2 apprentices.  An update issued on www.apprenticeship.ie on 23rd September.  Published minimum entry requirements for apprenticeship include an age restriction and academic entry requirements – apprentices must be aged 16 years or over and must hold a junior cycle certificate or equivalent or have relevant experience.  The actual entry requirements to access to employment may be higher than the minimum entry requirements and are set by employers in accordance with the level of education or experience required to deliver the role effectively in the workplace.  Apprenticeship qualifications range from QQI level 5-10, with a number of programmes requiring post-school level qualifications and experience as entry requirements.  General expansion of apprenticeship as a route to career development is a key priority for Government.  As such, an Action Plan for Apprenticeship 2021-2025 was published in April of this year which sets out a strategic approach to broadening the visibility of apprenticeship as an opportunity for school leavers and career changers. ",
        "house": {
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": "",
          "houseNo": "33",
          "chamberType": "house"
        },
        "by": {
          "memberCode": "Mary-Butler.D.2016-10-03",
          "showAs": "Mary Butler",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        },
        "questionType": "written",
        "date": "2021-09-29",
        "to": {
          "showAs": "Further and Higher Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "questionNumber": 170,
        "showAs": " 170. Deputy Mary Butler asked the Minister for Further and Higher Education, Research, Innovation and Science if he will address the concerns raised in correspondence by an organisation (details supplied); and if he will make a statement on the matter. [46975/21] ",
        "debateSection": {
          "debateSectionId": "dbsect_153",
          "showAs": "Apprenticeship Programmes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-09-29/writtens/dbsect_153",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-09-29/writtens/mul@/dbsect_153.xml"
            }
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2021-09-29/pq_170"
      },
      "contextDate": "2021-09-29"
    },
    {
      "question": {
        "questionNumber": 481,
        "debateSection": {
          "debateSectionId": "dbsect_385",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-09-28/writtens/mul@/dbsect_385.xml"
            }
          },
          "showAs": "School Facilities",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-09-28/writtens/dbsect_385"
        },
        "showAs": " 481. Deputy Mary Butler asked the Minister for Education her plans to open an Educate Together primary school in Dungarvan, County Waterford; if the location is part of an envisaged reconfiguration process; the potential timescale for same; and if she will make a statement on the matter. [46648/21] ",
        "answerText": " Minister for Education  The patronage divesting process arises from the recommendations of the 2012 report of the Advisory Group to the Forum on Patronage and Pluralism in the Primary Sector, following which my Department undertook surveys of parental preferences in 43 areas of stable population in 2012 and 2013 to establish the level of parental demand for a wider choice in the patronage of primary schools within these areas. Analysis of the parental preferences expressed in each area surveyed indicated that there was sufficient parental demand to support changes in school patronage in 28 areas, including in Dungarvan.  Under the patronage divesting process, a school can be opened where a school building became, or was due to become available as a result of an amalgamation/closure of an existing school. In some areas, including in the case of Dungarvan, in responding to demand for diversity where existing patrons were unable make school properties available, my Department also included an examination of properties held in public ownership.  To date, it has not been possible to secure a school property to facilitate a new school under the divesting process being established in Dungarvan. However, my Department is continuing its efforts in relation to identifying a suitable solution under the patronage divesting process.  In parallel with the Divesting process, my Department is continuing to work with stakeholders to progress delivery of the Schools Reconfiguration for Diversity process which  has been developed in order to accelerate the delivery of multi-denominational schools across the country. This Reconfiguration process involves the transfer of existing live schools as opposed to the amalgamation and/or closure model of the patronage divesting process.  The initial identification phase of the process involved each of the 16 Education and Training Boards identifying an initial pilot area within their functional area where they considered there may be unmet oncoming demand for a multi-/non-denominational school and arranging for surveys of parents of pre-school children in these areas. The Department has been engaging with representatives of the Irish Episcopal Conference (Catholic Bishops) with a view to developing an agreed approach to the next Phase of the process. The identification phase work provides useful learning and is informing the development of the process.  The “Early Movers” provision of the Schools Reconfiguration process enables school communities which have already decided to seek a transfer of patronage (independent of the survey process envisaged as part of the Reconfiguration process) to engage with their school patron on the matter. A patron may transfer patronage under section 8 of the Education Act 1998. A number of patronage changes have taken place in recent years in this context, resulting in the provision of an additional 11 multi-denominational Community National Schools. In addition, an Irish-medium gaelscoil has recently changed patronage from its Catholic patron to An Foras Pátrúnachta. From September 2021, this school offers parents of junior infants the choice of undertaking an Ethics and Morality Program and, for parents who so chose, a Catholic programme is provided. ",
        "date": "2021-09-28",
        "to": {
          "roleCode": null,
          "roleType": null,
          "showAs": "Education",
          "uri": null
        },
        "by": {
          "memberCode": "Mary-Butler.D.2016-10-03",
          "showAs": "Mary Butler",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        },
        "house": {
          "houseCode": "dail",
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseNo": "33",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": ""
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2021-09-28/pq_481"
      },
      "contextDate": "2021-09-28"
    },
    {
      "question": {
        "questionNumber": 274,
        "debateSection": {
          "debateSectionId": "dbsect_278",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-09-22/writtens/mul@/dbsect_278.xml"
            }
          },
          "showAs": "Community Development Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2021-09-22/writtens/dbsect_278"
        },
        "showAs": " 274. Deputy Mary Butler asked the Minister for Rural and Community Development if she has plans to introduce a further tranche of community enhancement programme funding given that community centres are incurring additional expense as they move towards reopening within the public health restrictions of the day; the amounts paid to each local authority under the previous tranche of community enhancement programme funding announced in May 2021; and if she will make a statement on the matter. [45357/21] ",
        "answerText": " Minister of State at the Department of Rural and Community Development  The Community Enhancement Programme (CEP) was first launched by my Department in 2018. The Programme provides funding to community groups and organisations across Ireland, with a focus on areas of disadvantage. Funding is provided to each Local Authority area, and the programme is administered by the Local Community Development Committees (LCDC) on the basis of local need.  Between 2018 and the end of 2020 the CEP funded over 8,000 projects across the country.  I launched the 2021 CEP on the 10th May with an allocation of €4.5m. The key theme was to support groups as they reopen facilities which were closed due to COVID-19. The 2021 CEP is now closed to applicants and depending on the Local Authority area, LCDCs have either assessed applications for funding or are assessing applications at present.  While there are currently no plans for another tranche of the CEP in 2021, I will consider allocating additional funding from other funding lines within my Department to support community centres and community groups as they move towards reopening.  The Funds allocated to each LCDC area for the 2021 CEP launched on 10th May is set out in the table below.     LCDC    2021 CEP      Carlow    €134,206      Cavan    €134,757      Clare    €139,257      Cork City    €153,703      Cork    €156,299      Donegal    €159,461      Dublin City    €212,306      Dun Laoghaire/Rathdown    €142,108      Fingal    €150,521      Galway City    €132,455      Galway County    €143,401      Kerry    €142,409      Kildare    €148,013      Kilkenny    €136,319      Laois    €136,524      Leitrim    €129,223      Limerick    €152,942      Longford    €132,385      Louth    €145,542      Mayo    €145,203      Meath    €142,893      Monaghan    €132,571      Offaly    €138,550      Roscommon    €133,301      Sligo    €134,084      South Dublin    €169,399      Tipperary    €149,690      Waterford    €144,499      Westmeath    €136,571      Wexford    €150,065      Wicklow    €141,343      Total    €4,500,000    ",
        "date": "2021-09-22",
        "to": {
          "roleCode": null,
          "roleType": null,
          "showAs": "Rural",
          "uri": null
        },
        "by": {
          "memberCode": "Mary-Butler.D.2016-10-03",
          "showAs": "Mary Butler",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Mary-Butler.D.2016-10-03"
        },
        "house": {
          "houseCode": "dail",
          "showAs": "33rd Dáil",
          "chamberType": "house",
          "houseNo": "33",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "committeeCode": ""
        },
        "questionType": "written",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2021-09-22/pq_274"
      },
      "contextDate": "2021-09-22"
    }
  ]
}