{
  "head": {
    "counts": {
      "questionCount": 175,
      "resultCount": 175
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 57. Deputy Micheál Carrigy asked the Minister for Children, Disability and Equality when the regional assessment hub will be put in place for County Longford, as these hubs are needed to alleviate pressure on health service and begin tackling the backlog that is affecting families across the country; and if she will make a statement on the matter. [72832/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_100",
          "debateSectionId": "dbsect_100",
          "showAs": "Disabilities Assessments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_100.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_57",
        "questionNumber": 57
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 99. Deputy Micheál Carrigy asked the Minister for Children, Disability and Equality the number of additional staff for Longford for the assessment of need system as part of the Progressing Disability Services Roadmap and Disability Workforce Strategy; and if she will make a statement on the matter. [72831/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_142",
          "debateSectionId": "dbsect_142",
          "showAs": "Disabilities Assessments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_142.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_99",
        "questionNumber": 99
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  The Solar PV for the Medically Vulnerable Scheme is a targeted scheme for the installation of solar photovoltaic (PV) panels for customers/households who are registered on the life support category of the Priority Services Register. These homes have a dependence on electrically powered equipment, including medical equipment, life protecting devices and assistive technologies such as dialysis machines and respirators.  The scheme comprises of a fully funded 2 kWp solar PV system for eligible households. This includes survey/design, supply, installation, and the post works BER. The scheme is wholly managed by the registered energy suppliers, with each of the energy suppliers contacting their own eligible customers directly, in line with the work plans for their solar PV installers. It is important to note that suppliers, who manage the administrative aspects of the scheme under the Sustainable Energy Authority of Ireland (SEAI), issue offers to eligible homeowners in batches.  Most energy suppliers have agreed to provide the scheme for their customers, with some suppliers more advanced in their programme than others. The SEAI report that 137 systems were installed in 2024. However, with the programme now ramping up, 239 systems have been installed so far in 2025, with a further 250 applications currently in progress across various stages, ranging from committed applications to booked installations and ongoing works, among the 4 suppliers currently participating in the scheme.  The Solar PV for the Medically Vulnerable Scheme was designed in 2022 using the Households/MPRNs on the Life Support Category of the Priority Services Register as maintained by ESB Networks at that time. The scheme became operational in February 2023 when suppliers were invited to participate.  Due to the strong uptake and the positive impact already observed in over 470 homes, the scheme is now in the process of being extended to include as eligible all homeowners who are registered under the life support category of the Priority Services Register with their energy supplier, regardless of when they were registered.  Energy suppliers will communicate this update to eligible customers in the coming weeks, as the eligibility criteria are revised, and qualifying homeowners are identified to benefit from the scheme.   ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 36. Deputy Micheál Carrigy asked the Minister for Climate, Energy and the Environment the date on which the Government-approved scheme to provide free 2kWp solar PV systems to Priority Services Register (PSR) households was formally approved; the date on which ESB Networks and energy suppliers were instructed to begin notifications to eligible households; the number of households notified to date; and the number of installations completed under the scheme. [67824/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_38",
          "debateSectionId": "dbsect_38",
          "showAs": "Environmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_38.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_36",
        "questionNumber": 36
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  The Solar PV for the Medically Vulnerable Scheme is a targeted scheme for the installation of solar photovoltaic (PV) panels for customers/households who are registered on the life support category of the Priority Services Register. These homes have a dependence on electrically powered equipment, including medical equipment, life protecting devices and assistive technologies such as dialysis machines or respirators. As a result, these households may have a higher energy demand than the average user and this scheme is designed to go some way towards helping to reduce those energy costs.  The Solar PV for the Medically Vulnerable Scheme was designed in 2022 using the Households/MPRNs on the Life Support Category of the Priority Services Register as maintained by ESB Networks at that time. The scheme became operational in February 2023 when suppliers were invited to participate. The scheme is operated by the Sustainable Energy Authority of Ireland (SEAI) in conjunction with energy suppliers, with each energy supplier contacting their own eligible customers directly in line with the work plans for their solar PV installers. Eligible households can avail of a fully funded 2 kWp solar PV system including survey/design, supply, installation, and the post works BER.  The scheme is not designed to be retrospective and is to supply a new installation to a property that did not previously have solar PV, directly installed. There is no mechanism to provide payments to homeowners under this scheme. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 37. Deputy Micheál Carrigy asked the Minister for Climate, Energy and the Environment to establish a retrospective or exceptional circumstances mechanism to provide reimbursement or partial compensation to Priority Services Register households who installed solar PV systems at their own expense before receiving notification of their eligibility for the free Government-funded scheme; and if he will make a statement on the matter. [67825/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_39",
          "debateSectionId": "dbsect_39",
          "showAs": "Environmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_39.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_37",
        "questionNumber": 37
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  Since becoming Minister for Rural and Community Development and the Gaeltacht, I have prioritised investment in community infrastructure to support our communities. The Community Centre Investment Fund (CCIF) was introduced to provide high quality, accessible, community spaces that are available to all groups in all communities in both rural and urban areas. Some €110 million has been allocated since 2022 for the enhancement and refurbishment of existing community centres and the construction of new centres.  Successful applicants under the fund are not permitted to utilise any other EU or Government funding for the same specified works being supported under the CCIF. While duplicate funding for such works is not permitted, successful applicants are free at any time to apply to other schemes for funding for separate work not funded under CCIF. In addition, successful applicants under CCIF are also free to apply for funding under future rounds of CCIF once any outstanding CCIF projects have been completed. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 729. Deputy Micheál Carrigy asked the Minister for Rural and Community Development and the Gaeltacht if he will clarify whether any conditions under the community centres investment fund restrict a successful applicant group from applying for other funding streams, including LEADER, within a two-year period; if he will confirm whether any such restriction applies only to reapplying to the community centres investment fund itself or whether it precludes a group from seeking funding for separate and unrelated projects under different programmes; and if he will make a statement on the matter. [67729/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_656",
          "debateSectionId": "dbsect_656",
          "showAs": "Rural Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_656.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_729",
        "questionNumber": 729
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1722. Deputy Micheál Carrigy asked the Minister for Health the specific measures which are being taken to address the ongoing difficulties in the provision of home help services in County Longford; if she is aware of increasing reports of elderly people being left without care support at weekends due to staff shortages, carers not being replaced when on leave, and scheduled visits being cut short, leaving families anxious and unable to work for fear of carers not turning up; and if she will make a statement on the matter. [58130/25] ",
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1722",
        "questionNumber": 1722,
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "debateSection": {
          "showAs": "Home Help Service",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1477",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1477.xml"
            }
          },
          "debateSectionId": "dbsect_1477"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1848. Deputy Micheál Carrigy asked the Minister for Health if she will address the ongoing shortage of salbutamol nebuliser solution in community pharmacies; the actions being taken by the HSE, the Medicines Management Programme and the HPRA to stabilise supply; the expected timeframe for restoration of normal availability; the clinical guidance being issued to prescribers and pharmacists regarding safe alternatives or substitution protocols; and if she will ensure that vulnerable patients such as (details supplied) who rely on nebulised salbutamol for COPD or asthma relief are prioritised for access where clinically indicated; and if she will make a statement on the matter. [58812/25] ",
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1848",
        "questionNumber": 1848,
        "answerText": " Minister for Health  My Department is aware of the stress that shortages of medicines can cause for patients and healthcare professionals alike, therefore mitigating medicine shortages and strengthening security of supply is the subject of several workstreams in my Department, the wider health service and across Europe.  Unfortunately, medicine shortages are a feature of modern health systems worldwide. There are a multitude of reasons why a medicine may not be available including: shortages of raw materials; manufacturing difficulties; or product recalls due to potential quality issues.  Ireland has a multi-stakeholder Medicines Shortages Framework in place operated by the Health Products Regulatory Authority (HPRA) on behalf of the Department of Health. This framework aims to help prevent potential shortages from occurring and to reduce the impact of shortages. Stakeholders include the HPRA, the Department, the HSE, healthcare professionals, manufacturers, wholesalers, patient representative groups and marketing authorisation holders.  In European law, pharmaceutical companies and wholesalers should ensure an appropriate and continuous supply of the medicines they market. Companies are required to notify the HPRA of medicines shortages or potential shortages impacting the Irish market. The HPRA maintains a list of current and resolved shortages on its website.  Teva B.V, the company responsible for supplying Ipramol, has notified the HPRA of the shortages of Ipramol Steri-Neb 0.5 mg / 2.5 mg per 2.5 ml nebuliser solution, Salamol Steri-Neb 2.5 mg / 2.5 ml nebuliser solution and Salamol Steri-Neb 5 mg / 2.5 ml Nebuliser Solution. These shortages were notified on the 22nd July 2024, 3rd April 2025 and 11th July 2025, respectively, and is due to an unexpected increase in demand, globally and manufacturing delays.  Teva B.V are presently unable to advise of an exact date for resolution of the shortages.  In case of shortages with a significant public health impact, the HSE can issue clinical guidance to healthcare professionals, where appropriate, to mitigate the impact of a shortage. There have been several such shortages where the HSE has issued clinical guidance as a mitigation measure, including in this therapeutic area.  In the event that patients are unable to source a medicinal product due to supply constraints, they are advised to discuss possible alternatives with their healthcare professional pending the resumption of normal supply. ",
        "debateSection": {
          "showAs": "Pharmacy Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1601",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1601.xml"
            }
          },
          "debateSectionId": "dbsect_1601"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Military Neutrality",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_92.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_92",
          "debateSectionId": "dbsect_92"
        },
        "to": {
          "showAs": "Foreign",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 130 and 151 together.  Ireland's policy of military neutrality, as practised by successive Governments, means that Ireland does not participate in military alliances or common or mutual defence arrangements.  As the Government has stated on numerous occasions, there are no plans to alter this policy. ",
        "questionType": "written",
        "showAs": " 151. Deputy Micheál Carrigy asked the Tánaiste and Minister for Foreign Affairs and Trade to confirm the Government's position with regard to our long-standing policy of military neutrality; and if he will make a statement on the matter. [48825/25] ",
        "questionNumber": 151,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Micheál Carrigy",
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_151"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_639.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_639",
          "debateSectionId": "dbsect_639"
        },
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "showAs": " 749. Deputy Micheál Carrigy asked the Minister for Health the number of patients on the physiotherapy waiting list at St. Joseph's Care Centre, Longford, as of 30 September 2025, disaggregated into assessment and treatment lists; the average/median wait for each; and if she will make a statement on the matter. [56598/25] ",
        "questionNumber": 749,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Micheál Carrigy",
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_749"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_641.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_641",
          "debateSectionId": "dbsect_641"
        },
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "showAs": " 750. Deputy Micheál Carrigy asked the Minister for Health the number of people waiting for physiotherapy at St. Joseph's Care Centre, Longford, by waiting-time bands, less than four weeks; four to 12; 12-26; 26-52, greater than 52 weeks, and by clinical priority (urgent/soon/routine); and if she will make a statement on the matter. [56599/25] ",
        "questionNumber": 750,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Micheál Carrigy",
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_750"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_642.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_642",
          "debateSectionId": "dbsect_642"
        },
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "showAs": " 751. Deputy Micheál Carrigy asked the Minister for Health the specific measures being implemented in CHO 8 to reduce physiotherapy waiting times at St. Joseph's Care Centre, Longford; the target reduction by quarter for the next 12 months; the expected timeframe to eliminate waits beyond 26 weeks; and if she will make a statement on the matter. [56600/25] ",
        "questionNumber": 751,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Micheál Carrigy",
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_751"
      }
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  My Department is driving forward the development of apprenticeships, with a particular focus on the construction sector. Through the Action Plan for Apprenticeship 2021–2025 and its successor, the Apprenticeship Action Plan 2026–2030, currently in development, we are shaping a strategic vision for the future of apprenticeship in Ireland. This is complemented by the Careers in Construction Action Plan, which sets out 20 targeted actions to promote inclusive, attractive, and sustainable careers, especially for women, young people, and under-represented groups.  To foster early engagement, the Initial Vocational Education and Training (iVET) module is now available to all Transition Year students. Developed by the NCCA, ETBI, and SOLAS, iVET offers hands-on exposure to vocational pathways through FET taster courses, career talks, and workshops. An example is Adamstown Community College, which gave Transition Year students a taster course in plumbing, complete with a dedicated training room. Students earned a manual handling certification and progressed to plumbing theory and practice, installing working toilets, radiators, and basins. The programme was supported by Chadwicks (materials) and CJK (CV workshops, interviews, and work experience), and has since expanded to two additional Dublin schools.  My Department provides funding for WorldSkills Ireland, an event where over 30,000 students from more than 300 secondary schools across the country celebrated the talent and ambition of Ireland’s apprentices. The event highlighted the critical role of skills in building a future-ready workforce.  My Department remains committed to positioning apprenticeships, including in construction, as a valued and viable option for secondary school students. ",
        "by": {
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30",
          "memberCode": "Micheál-Carrigy.S.2020-03-30"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "date": "2025-10-16",
        "questionNumber": 44,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/dbsect_79",
          "debateSectionId": "dbsect_79",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/mul@/dbsect_79.xml"
            }
          },
          "showAs": "Apprenticeship Programmes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-16/pq_44",
        "showAs": " 44. Deputy Micheál Carrigy asked the Minister for Further and Higher Education, Research, Innovation and Science the plans his Department currently has in place to promote apprenticeships, particularly in the construction sector, to school leavers; and if he will make a statement on the matter. [55566/25] "
      },
      "contextDate": "2025-10-16"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  I am very pleased that €79 million was invested in apprenticeship delivery in Budget 2026, bringing the total current budget for apprenticeship to over €410 million. This is an increase of over 120% in apprenticeship funding since 2020. More than doubling investment in apprenticeship since 2020 is a clear, concrete demonstration of the Government’s commitment to achieving our apprenticeship registration targets.  Annual apprenticeship registrations have grown strongly in recent years from 6,177 in 2019 to 9,352 in 2024. This 51% increase provides a strong foundation for achieving the target of 12,500 annual apprentice registrations by the end of 2030. ",
        "by": {
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30",
          "memberCode": "Micheál-Carrigy.S.2020-03-30"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "date": "2025-10-16",
        "questionNumber": 54,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/dbsect_90",
          "debateSectionId": "dbsect_90",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/mul@/dbsect_90.xml"
            }
          },
          "showAs": "Apprenticeship Programmes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-16/pq_54",
        "showAs": " 54. Deputy Micheál Carrigy asked the Minister for Further and Higher Education, Research, Innovation and Science if he will provide an update on the progress towards the PfG target of 12,500 annual apprenticeship registrations; and if he will make a statement on the matter. [55565/25] "
      },
      "contextDate": "2025-10-16"
    },
    {
      "question": {
        "answerText": " Deputy Micheál Carrigy  My question is about the allocation of funding for the new LEADER programme from 2027 onwards. I have seen the success of the programme since it started in my county of Longford. We were successful in getting significant funding, all of which was drawn down for projects in the county. It has had a huge benefit and has improved communities throughout the county.  I have been involved in a number of the projects in my own local area, including community centre funding and playgrounds that have been developed with funding through the LEADER programme. Great work has been done by the staff in Longford Community Resources. Could we get commitments on what Government funding has been put forward to make sure we get a strong allocation in the next LEADER programme? \n Deputy Dara Calleary  As the Deputy knows, the LEADER programme is a multi-annual funding programme. It is cofinanced by the European Commission under the Common Agricultural Policy, CAP. The current LEADER programme is operational across the country as we speak, with total funding of €180 million allocated across local action groups to cover the period 2023 to 2027.  When considering LEADER allocations for the post-2027 period, as the Deputy has discussed, the development of the post-2027 CAP and the new regional and national partnership plans is a matter of significant importance to my Department. Ireland has advocated and will continue to advocate for a well-funded and ringfenced EU funding programme that supports farm resilience, environmental ambition and rural development measures such as the LEADER programme.  Since its inception in 1991, the programme has empowered bottom-up, community-led rural development in rural communities across Ireland. It has supported thousands of local projects, revitalised rural communities and supported thousands of jobs and important services across Ireland. It is hugely important and as Minister, I am committed to ensuring that the LEADER programme remains a core element of any new CAP framework.  To facilitate the current negotiation process for the post-2027 period, the Department of Agriculture, Food and the Marine has established a CAP consultative committee, which includes representation from my Department. As part of this committee, my Department continues to advocate for the LEADER programme to remain a core intervention of the new CAP post 2027. I continue to work with Government colleagues, the Minister, Deputy Heydon, and the Minister of State, Deputy Thomas Byrne, to ensure the LEADER programme is well funded into the future and remains a key part of the next MFF. I acknowledge the support of the Minister, Deputy Heydon, and the Minister of State, Deputy Byrne, to date with regard to our work. I will be travelling to the European Parliament in November to continue to lobby and work with our colleagues in the European Parliament on the importance of LEADER in the next MFF. \n Deputy Micheál Carrigy  I thank the Minister for that strong commitment. As he said, it has a massive impact in communities throughout the country, from playgrounds to tourism products - you name it. It has left its impact and it is important that we, the local action groups, LAGs, and the local LEADER companies working on the ground know that the Government is going to put in the matched funding to make sure they are able to staff themselves and are ready to roll out to the new programme when it comes. \n Deputy Dara Calleary  Absolutely. Since 1991, LEADER companies around the country have made a huge difference. LEADER projects have made a massive difference. It was the former Tánaiste and former Commissioner, Ray McSharry, and the former Minister of State and MEP Mark Killilea. Ireland's fingerprints are very much associated with LEADER and the success of LEADER to date. I will be working to ensure our LEADER funding going forward. There is going to be a very different EU funding environment post 2027 but we will have to work to protect LEADER.  Since LEADER came on board, we have made the Department of Rural and Community Development and the Gaeltacht. Outside of LEADER, we are continuing to invest substantial funding in rural projects and initiatives, funding that was not in place in the early days of LEADER. The Deputy can be absolutely assured that I am making a commitment that we will fight for a very comprehensive LEADER allocation going forward. ",
        "by": {
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30",
          "memberCode": "Micheál-Carrigy.S.2020-03-30"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "date": "2025-10-16",
        "questionNumber": 91,
        "questionType": "oral",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/debate/dbsect_30",
          "debateSectionId": "dbsect_30",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/debate/mul@/dbsect_30.xml"
            }
          },
          "showAs": "Departmental Programmes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-16/pq_91",
        "showAs": " 91. Deputy Micheál Carrigy asked the Minister for Rural and Community Development and the Gaeltacht when the announcement of allocation of funding under the LEADER programme will be; and if he will make a statement on the matter. [55609/25] "
      },
      "contextDate": "2025-10-16"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  My Department is committed to supporting thriving communities across the country through a range of funding initiatives. Over the past three years, my Department has allocated in the region of €13 million in funding to County Longford.  My Department’s funding programmes have delivered significant capital investment in County Longford, example:  • Under the Town and Village Renewal Scheme, €379,170 was allocated for the special needs playground and parkland connection to Royal Canal Greenway Spur, Longford Town.  • €200,000 was allocated under the Outdoor Recreation Infrastructure Scheme for the enhancement of the existing Granard Greenway through the extension of the walkway and the provision of lighting along the full length of the walkway.  • €100,000 was allocated under the Community Centres Investment Fund for refurbishment works at Longford Rugby Club.  • Under CLÁR, €50,000 was allocated to Granard Community Centre for heating upgrade and roof repairs.  Details of the thousands of funding allocations my Department has provided each year, across the country, including County Longford, are available on my Department’s website, in tabular form at the following link: [ Funding allocated by the department ] ",
        "by": {
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30",
          "memberCode": "Micheál-Carrigy.S.2020-03-30"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "date": "2025-10-16",
        "questionNumber": 124,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/dbsect_146",
          "debateSectionId": "dbsect_146",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-16/writtens/mul@/dbsect_146.xml"
            }
          },
          "showAs": "Departmental Funding"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-16/pq_124",
        "showAs": " 124. Deputy Micheál Carrigy asked the Minister for Rural and Community Development and the Gaeltacht for a list of projects in Longford allocated funding by his Department in each of the past three years, in tabular form; and if he will make a statement on the matter. [55608/25] "
      },
      "contextDate": "2025-10-16"
    },
    {
      "contextDate": "2025-10-15",
      "question": {
        "debateSection": {
          "showAs": "Dental Services ",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/mul@/dbsect_313.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-15/writtens/dbsect_313",
          "debateSectionId": "dbsect_313"
        },
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly. ",
        "questionType": "written",
        "showAs": " 324. Deputy Micheál Carrigy asked the Minister for Health if she will urgently review the case of a child (details supplied) in County Longford who requires orthodontic treatment; if she will outline the current waiting times for orthodontic assessment and treatment in the Longford area; and if she will ensure that this case is prioritised given the circumstances and the financial hardship faced by their parent. [55804/25] ",
        "questionNumber": 324,
        "date": "2025-10-15",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Micheál Carrigy",
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-15/pq_324"
      }
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "showAs": " 644. Deputy Micheál Carrigy asked the Minister for Health the current specialist services available to patients with sarcoidosis in Ireland; the hospitals/clinics designated to provide such care; the referral pathway from primary care and general respiratory clinics to these services; and if she will make a statement on the matter. [53408/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_599.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_599",
          "showAs": "Disease Management",
          "debateSectionId": "dbsect_599"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_644",
        "answerText": " Minister for Health  I propose to take Questions Nos. 644, 645, 647, 648 and 651 together.  As the matter(s) raised is a service delivery matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "questionNumber": 644
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "showAs": " 645. Deputy Micheál Carrigy asked the Minister for Health if a national clinical pathway for sarcoidosis is in place or in development under the HSE National Clinical Programme for Respiratory; the expected timelines; the means by which primary care, respiratory medicine, cardiology, ophthalmology and dermatology are integrated within that pathway; and if she will make a statement on the matter. [53409/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_599.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_599",
          "showAs": "Disease Management",
          "debateSectionId": "dbsect_599"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_645",
        "answerText": " Minister for Health  I propose to take Questions Nos. 644, 645, 647, 648 and 651 together.  As the matter(s) raised is a service delivery matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "questionNumber": 645
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "showAs": " 646. Deputy Micheál Carrigy asked the Minister for Health the current resourcing and staffing levels (consultant sessions, CNS posts, multidisciplinary supports) for interstitial lung disease/sarcoidosis services at Tallaght University Hospital and other centres; whether additional funding or posts are planned in 2025/2026 to meet demand; and if she will make a statement on the matter. [53410/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_600.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_600",
          "showAs": "Hospital Services",
          "debateSectionId": "dbsect_600"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_646",
        "answerText": " Minister for Health  As this is a service matter, it has been referred to the Health Service Executive for attention and direct reply to the Deputy. ",
        "questionNumber": 646
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "showAs": " 647. Deputy Micheál Carrigy asked the Minister for Health the current waiting times for first appointments and follow-ups at interstitial lung disease and sarcoidosis clinics by hospital; the actions being taken to reduce these waits; and if she will make a statement on the matter. [53411/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_599.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_599",
          "showAs": "Disease Management",
          "debateSectionId": "dbsect_599"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_647",
        "answerText": " Minister for Health  I propose to take Questions Nos. 644, 645, 647, 648 and 651 together.  As the matter(s) raised is a service delivery matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "questionNumber": 647
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "showAs": " 648. Deputy Micheál Carrigy asked the Minister for Health whether the HSE maintains a national dataset or registry for sarcoidosis; if not, whether the Department intends to establish one to support service planning, outcomes tracking and research and the proposed timeline and funding; and if she will make a statement on the matter. [53412/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_599.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_599",
          "showAs": "Disease Management",
          "debateSectionId": "dbsect_599"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_648",
        "answerText": " Minister for Health  I propose to take Questions Nos. 644, 645, 647, 648 and 651 together.  As the matter(s) raised is a service delivery matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "questionNumber": 648
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "showAs": " 649. Deputy Micheál Carrigy asked the Minister for Health the diagnostic supports available for suspected sarcoidosis (including access to high-resolution CT, PET-CT where indicated, tissue biopsy, cardiac MRI, and ophthalmology assessment); whether national guidance on investigation and follow-up is being updated; and if she will make a statement on the matter. [53413/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_601.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_601",
          "showAs": "Disease Management",
          "debateSectionId": "dbsect_601"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_649",
        "answerText": " Minister for Health  As this is a service matter, it has been referred to the Health Service Executive for attention and direct reply to the Deputy. ",
        "questionNumber": 649
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "showAs": " 650. Deputy Micheál Carrigy asked the Minister for Health the treatment options available to sarcoidosis patients under the public system (e.g. corticosteroids, steroid-sparing agents, biologics); the criteria for access and reimbursement; whether any forthcoming changes are planned; and if she will make a statement on the matter. [53414/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_602.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_602",
          "showAs": "Disease Management",
          "debateSectionId": "dbsect_602"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_650",
        "answerText": " Minister for Health  The Health Service Executive (HSE) has statutory responsibility for decisions on pricing and reimbursement of medicines and medical items, in accordance with the Health (Pricing and Supply of Medical Goods) Act 2013. Reimbursement is for licensed indications which have been granted market authorisation by the European Medicines Agency (EMA) or the Health Products Regulatory Authority (HPRA). In line with the 2013 Act and the national framework agreed with industry, a company must apply to the HSE to have a new medicine added to the reimbursement list.  In making a relevant reimbursement decision, the HSE is required under the Act to have regard to several criteria including efficacy, the health needs of the public, cost effectiveness and potential or actual budget impact. HSE decisions on which medicines are reimbursed are made on objective, scientific and economic grounds, on the advice of the National Centre for Pharmacoeconomics (NCPE).  The Irish Public Health System provides for two categories of eligibility for persons ordinarily resident in the country, i.e., full eligibility (medical cards) and limited eligibility. Reimbursable claims for medicines on the HSE reimbursement list are based on prescriptions which are transmitted to the pharmacist.  The reimbursement list can be found online at: www.sspcrs.ie/druglist/pub  People who cannot, without undue hardship, arrange for the provision of medical services for themselves and their dependants may be eligible for a medical card under the General Medical Services (GMS) Scheme. In accordance with the provisions of the Health Act 1970 (as amended), eligibility for a medical card is determined by the Health Service Executive (HSE).  In certain circumstances the HSE may exercise discretion and grant a medical card, even though an applicant exceeds the income guidelines, where he or she faces difficult financial circumstances, such as extra costs arising from illness. Medical cards may be subject to review and medical reports may be needed to support the renewal or continuation of the eligibility.  Under the Drug Payment Scheme (DPS), no individual or family pays more than €80 a month towards the cost of approved prescribed medicines. The DPS is not means tested and is available to anyone ordinarily resident in Ireland. The DPS significantly reduces the cost burden for those who are not eligible for a medical card but incur ongoing expenditure on medicines.  There has been a significant focus on improving access to and the affordability of healthcare services over the last few years. This includes reductions in the DPS threshold, expansion of access to free GP care, and the abolition of all public in-patient hospital charges for children and adults. These measures continue to create a health and social care service that offers affordable access to quality healthcare.  Individuals may also be entitled to claim tax relief on the cost of their medical expenses, including medicines prescribed by a doctor, dentist, or consultant. Relief is at the standard tax rate of 20%. ",
        "questionNumber": 650
      },
      "contextDate": "2025-10-07"
    },
    {
      "question": {
        "date": "2025-10-07",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "showAs": " 651. Deputy Micheál Carrigy asked the Minister for Health the supports in place for patient education, pulmonary rehabilitation, and psychosocial care for people living with sarcoidosis; any plans to expand access to these services nationally; and if she will make a statement on the matter. [53415/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/mul@/dbsect_599.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-07/writtens/dbsect_599",
          "showAs": "Disease Management",
          "debateSectionId": "dbsect_599"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-07/pq_651",
        "answerText": " Minister for Health  I propose to take Questions Nos. 644, 645, 647, 648 and 651 together.  As the matter(s) raised is a service delivery matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "questionNumber": 651
      },
      "contextDate": "2025-10-07"
    },
    {
      "contextDate": "2025-10-02",
      "question": {
        "debateSection": {
          "debateSectionId": "dbsect_63",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/dbsect_63",
          "showAs": "Sports Funding",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/mul@/dbsect_63.xml"
            }
          }
        },
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "houseNo": "34",
          "chamberType": "house"
        },
        "showAs": " 49. Deputy Micheál Carrigy asked the Minister for Culture, Communications and Sport if core funding for national governing bodies (NGB) of sport in Ireland and local sports partnerships (LSP) will be increased by ten percent for 2026, as per the pre-budget submission by an organisation (details supplied), if the Minister understands the urgency of this funding requirement to continue the work of NGBs and LSPs in facilitating widespread participation in sport and the production of high-performance athletes and sporting activity; if he will agree that the ask is relatively small in the context of the overall budget, at just over €3 million; and if he will make a statement on the matter. [51293/25] ",
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  I propose to take Questions Nos. 38, 49, 55 and 71 together.  Sport Ireland, which is funded by my Department, is the statutory body with responsibility for the development of sport, increasing participation at all levels and raising standards, including the allocation of funding across its various programmes. Sport Ireland does not provide direct funding for clubs or individuals but channels the funding through its network of Local Sports Partnerships (LSPs), recognised National Governing Bodies for Sport (NGBs), and other relevant sporting organisations.  Core funding allocations for individual NGBs and LSPs for 2026 will be decided by Sport Ireland. For 2025, Sport Ireland allocated €31.3 million to National Governing Bodies and Local Sports Partnerships, a 76% increase in funding compared to 2018.  The National Sports Policy committed the Government to doubling funding to sport to more than €220 million by 2027 and I am pleased to note that this target has been achieved two years ahead of schedule with €230 million for sport allocated in the last budget.  As Minister for Sport, I am committed to supporting the wider sports sector and building on what has been achieved to date.  I have received the Federation of Sport's pre-budget submission and funding for sport in 2026 will be considered in the context of the annual Budgetary and Estimates process. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-02/pq_49",
        "questionNumber": 49,
        "questionType": "written",
        "date": "2025-10-02",
        "to": {
          "roleType": null,
          "uri": null,
          "roleCode": null,
          "showAs": "Culture"
        },
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy"
        }
      }
    },
    {
      "contextDate": "2025-10-02",
      "question": {
        "debateSection": {
          "debateSectionId": "dbsect_63",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/dbsect_63",
          "showAs": "Sports Funding",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-02/writtens/mul@/dbsect_63.xml"
            }
          }
        },
        "house": {
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "houseNo": "34",
          "chamberType": "house"
        },
        "showAs": " 55. Deputy Micheál Carrigy asked the Minister for Culture, Communications and Sport if core funding for national governing bodies of sport in Ireland (NGBs) and local sports partnerships (LSPs) will be increased by ten percent for each of the next three years, as per the pre-budget submission by an organisation (details supplied), if the Minister understands the urgency of this funding requirement to continue the work of NGBs and LSPs in facilitating widespread participation in sport and the production of high-performance athletes and sporting activity, if he will agree that the ask is relatively small in the context of the overall budget, at just over €3 million compound per annum; and if he will make a statement on the matter. [51294/25] ",
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  I propose to take Questions Nos. 38, 49, 55 and 71 together.  Sport Ireland, which is funded by my Department, is the statutory body with responsibility for the development of sport, increasing participation at all levels and raising standards, including the allocation of funding across its various programmes. Sport Ireland does not provide direct funding for clubs or individuals but channels the funding through its network of Local Sports Partnerships (LSPs), recognised National Governing Bodies for Sport (NGBs), and other relevant sporting organisations.  Core funding allocations for individual NGBs and LSPs for 2026 will be decided by Sport Ireland. For 2025, Sport Ireland allocated €31.3 million to National Governing Bodies and Local Sports Partnerships, a 76% increase in funding compared to 2018.  The National Sports Policy committed the Government to doubling funding to sport to more than €220 million by 2027 and I am pleased to note that this target has been achieved two years ahead of schedule with €230 million for sport allocated in the last budget.  As Minister for Sport, I am committed to supporting the wider sports sector and building on what has been achieved to date.  I have received the Federation of Sport's pre-budget submission and funding for sport in 2026 will be considered in the context of the annual Budgetary and Estimates process. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-02/pq_55",
        "questionNumber": 55,
        "questionType": "written",
        "date": "2025-10-02",
        "to": {
          "roleType": null,
          "uri": null,
          "roleCode": null,
          "showAs": "Culture"
        },
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy"
        }
      }
    },
    {
      "question": {
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-30/pq_148",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to Active Travel. Funding is administered through the National Transport Authority (NTA), who, in partnership with local authorities, have responsibility for the selection and delivery of specific projects in each local authority area.  Noting the role of the NTA in the matter, I have referred your question to that agency for a more detailed answer. If you do not receive a reply within 10 working days, please contact my private office. ",
        "date": "2025-09-30",
        "questionNumber": 148,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/dbsect_87",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/mul@/dbsect_87.xml"
            }
          },
          "debateSectionId": "dbsect_87",
          "showAs": "Cycling Facilities"
        },
        "showAs": " 148. Deputy Micheál Carrigy asked the Minister for Transport the spending from central Government on cycle lanes, per year, from 2016 to date in 2025; and if he will make a statement on the matter. [51584/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Transport",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-30"
    },
    {
      "question": {
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-30/pq_186",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding of public transport, including rail. The operation, maintenance and renewal of the rail network is a matter for Iarnród Éireann (IÉ) in the first instance.  Iarnród Éireann's are better placed to provide a breakdown on the funding allocated to individual projects or routes. As such I have referred the Deputy's question to IÉ for a direct reply on the specific matter raised. Please contact my private office if you do not receive a reply within 10 days. ",
        "date": "2025-09-30",
        "questionNumber": 186,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/dbsect_126",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/mul@/dbsect_126.xml"
            }
          },
          "debateSectionId": "dbsect_126",
          "showAs": "Rail Network"
        },
        "showAs": " 186. Deputy Micheál Carrigy asked the Minister for Transport if there is a breakdown of investment per railway route, the current investment, and the investment per year from 2016 to date in 2025; and if he will make a statement on the matter. [51583/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Transport",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-30"
    },
    {
      "question": {
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-30/pq_824",
        "answerText": " Minister for Children, Disability and Equality  Government is committed to ensuring that information and communication issued across all government departments and public bodies is in formats that are accessible to disabled people, including in easy-to-read and plain English formats.  The National Human Rights Strategy for Disabled People 2025-2030 launched on 3rd September sets out a whole-of-Government approach to disability and to progressively realising the rights of disabled people under the United Nations Convention on the Rights of Persons with Disabilities (UNCRPD).  Article 9 of the UNCRPD emphasises the importance of accessibility by requiring measures to ensure that people with disabilities have equal access to the physical environment, transportation, information and communications, and to other facilities and services open or provided to the public. Such measures include identifying and eliminating barriers to accessibility to all public facilities, services and communications.  Following on from its publication, Government is committed to the full implementation of the Strategy including priority actions related to increasing the accessibility of information and communication issued by government departments and public bodies.  The integration of Universal Design principles and good practice is identified within the Strategy as a key cross-cutting capacity strengthening initiative particularly in relation to achieving increased awareness of the imperative to provide more accessible information and services to the public and enhanced delivery of more coordinated action on accessibility across all Government Departments and public bodies.  More specifically, and following on from the publication of the Final Substantive Report and Statement concerning Part X of the Terms of Reference of the Commission of Investigation (Certain matters relative to a disability service in the South East and related matters) (“the Farrelly Commission”), Inclusion Ireland recently published a report titled 'The Right to Justice and Participation: Lessons from the Farrelly Commission’. Recognising the wider implications of the report, I have brought this report to the attention of relevant Government colleagues including the Minister for Justice, Home Affairs and Migration who has responsibility for the Commissions of investigations Act 2004. ",
        "date": "2025-09-30",
        "questionNumber": 824,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/dbsect_689",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/mul@/dbsect_689.xml"
            }
          },
          "debateSectionId": "dbsect_689",
          "showAs": "Departmental Inquiries"
        },
        "showAs": " 824. Deputy Micheál Carrigy asked the Minister for Children, Disability and Equality in view of the findings of the Farrelly Commission, if she will ensure that all future inquiry reports concerning disabled people are published simultaneously in accessible formats, including easy read, audio, Irish sign language and plain English, with advance survivor briefings, as required under the Public Sector Equality and Human Rights Duty; and if she will make a statement on the matter. [52106/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Children",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-30"
    },
    {
      "question": {
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-30/pq_936",
        "answerText": " Minister for Health  Safeguarding adults who may be at risk of abuse is a key objective for me and my Department, every statutory body under its aegis, and for all health and social care services.  A framework of standards, policies and procedures for safeguarding adults in the health and social care sector is already in place. This includes a National Safeguarding Office in the HSE, specialist Safeguarding and Protection Teams in each health region, designated Safeguarding Officers within services and specific regulatory requirements for residential care services which are inspected against by HIQA and the Mental Health Commission. Further measures are now being developed to strengthen this framework.  The Programme for Government 2025 \"Securing Ireland’s Future\" includes a commitment to publish a national policy on adult safeguarding for the health and social care sector. My Department, in liaison with the Department of Children, Disability and Equality, is at an advanced stage of finalising this national policy, the first of its kind in this area. This is a very significant development and will provide a framework for strengthening safeguards across all care settings. Considerable work has already been undertaken to inform this policy, including an international evidence review, stakeholder engagement and a public consultation last year, which received over 250 responses. I hope to bring this policy to Government shortly.  The new policy will build on the structures and processes that are already in place to protect against abuse. Importantly, it will commit to the introduction of safeguarding legislation in the sector and will set out, at a high level, proposed new legislative provisions.  The Government has included a Health (Adult Safeguarding) Bill in its current Legislation Programme to facilitate underpinning legislation for this sectoral policy. Preparation of this legislation will commence once the national policy has been approved by Government.  I also assure the Deputy that the forthcoming policy and the related underpinning legislation will comply with the State’s obligations under relevant international Conventions, including the United Nations Convention on the Rights of Persons with Disabilities (UNCRPD), which Ireland ratified on 20 March 2018. ",
        "date": "2025-09-30",
        "questionNumber": 936,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/dbsect_795",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-30/writtens/mul@/dbsect_795.xml"
            }
          },
          "debateSectionId": "dbsect_795",
          "showAs": "Legislative Programme"
        },
        "showAs": " 936. Deputy Micheál Carrigy asked the Minister for Health her plans to bring forward comprehensive adult safeguarding legislation; if she will confirm that the legislation will enshrine disabled persons right to live independently in the community, in line with Article 19 of the UNCRPD; and if she will make a statement on the matter. [52107/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail"
        },
        "to": {
          "showAs": "Health",
          "uri": null,
          "roleCode": null,
          "roleType": null
        }
      },
      "contextDate": "2025-09-30"
    },
    {
      "question": {
        "date": "2025-09-23",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "showAs": " 270. Deputy Micheál Carrigy asked the Minister for Education and Youth the status of a building project (details supplied); if she will provide an update on the project’s progress within her Department’s building programme; and if she will make a statement on the matter. [49643/25] ",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/mul@/dbsect_271.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/dbsect_271",
          "showAs": "Schools Building Projects",
          "debateSectionId": "dbsect_271"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-23/pq_270",
        "answerText": " Minister for Education and Youth  The school to which the Deputy refers to was approved to enter the departments pipeline of school building projects under the Additional Schools Accommodation (ASA) Scheme to provide a 5 General Classrooms, 1 Music room, 1 Multimedia room, 1 Textiles room, 1 Science lab, 1 Prep area and Ancillary and to include the demolition/removal of 1 prefab. The project has been devolved for delivery to the Longford and Westmeath Education and Training Board (LWETB).  The Stage 1 report for the project was received by my department and is currently being reviewed from both a technical and cost perspective in accordance with the requirements of the Public Spending Code. All projects, including this one, will undergo the necessary due diligence outlined in the public Infrastructure Guidelines.  Furthermore, as part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  My department is now preparing an NDP implementation plan which is due for publication later in the Autumn. This plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  The NDP implementation plan will be considered as part of the ongoing review of this school building project. Once the NDP implementation plan is finalised my Department will be in a position to inform LWETB with the outcome for the progression of this much needed project. ",
        "questionNumber": 270
      },
      "contextDate": "2025-09-23"
    },
    {
      "question": {
        "date": "2025-09-23",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "showAs": " 661. Deputy Micheál Carrigy asked the Minister for Health if she will consider the provision of dialysis services at St. Joseph’s Hospital, Longford, to reduce the need for elderly patients to travel up to three times per week to Tullamore Hospital for treatment; if her Department has carried out any assessment of the potential patient demand for such a service in County Longford; and if she will make a statement on the matter. [50257/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/mul@/dbsect_613.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/dbsect_613",
          "showAs": "Hospital Services",
          "debateSectionId": "dbsect_613"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-23/pq_661",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 661
      },
      "contextDate": "2025-09-23"
    },
    {
      "question": {
        "date": "2025-09-23",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "showAs": " 662. Deputy Micheál Carrigy asked the Minister for Health the breakdown of the number of patients from County Longford and surrounding counties who are currently receiving dialysis treatment in Tullamore Hospital; and if she will make a statement on the matter. [50258/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/mul@/dbsect_614.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/dbsect_614",
          "showAs": "Hospital Services",
          "debateSectionId": "dbsect_614"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-23/pq_662",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the deputy directly. ",
        "questionNumber": 662
      },
      "contextDate": "2025-09-23"
    },
    {
      "question": {
        "date": "2025-09-23",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "showAs": " 663. Deputy Micheál Carrigy asked the Minister for Health if any feasibility studies, capital plans, or service reviews have been carried out in relation to expanding dialysis provision beyond Tullamore Hospital, specifically in the midlands region including County Longford; and if she will make a statement on the matter. [50259/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/mul@/dbsect_615.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-23/writtens/dbsect_615",
          "showAs": "Hospital Services",
          "debateSectionId": "dbsect_615"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-23/pq_663",
        "answerText": " Minister for Health  I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 663
      },
      "contextDate": "2025-09-23"
    },
    {
      "question": {
        "date": "2025-09-18",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "showAs": " 62. Deputy Micheál Carrigy asked the Tánaiste and Minister for Defence if consideration is being given to holding specific recruitment campaigns for people in other sectors and in mid- and later-career stages; and if he will make a statement on the matter. [48826/25] ",
        "to": {
          "roleType": null,
          "showAs": "Defence",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-18/writtens/mul@/dbsect_69.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-18/writtens/dbsect_69",
          "showAs": "Defence Forces",
          "debateSectionId": "dbsect_69"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-18/pq_62",
        "answerText": " Tánaiste and Minister for Defence  I propose to take Questions Nos. 44, 62 and 78 together.  The military authorities have advised me that the strength of the Permanent Defence Force (PDF) as at 31 July, the latest date for which this figure is available, stood at 7,540 personnel.  Significant progress is being achieved on a number of fronts in addressing the recruitment and retention challenges in the Defence Forces, and last year saw a stabilisation of the downward trend in numbers. There were 708 personnel inducted in 2024, the highest in over five years while discharges were at their lowest in four years. Interest in a career in the Defence Forces continues to grow significantly with figures provided by the Defence Forces showing a year on year increase of 33% in application numbers to the end of August of this year.  Government has introduced a number of key enabling measures to drive Defence Forces recruitment. These include increases in the maximum ages of recruitment and retirement respectively, the extension of private secondary healthcare to all personnel and the application of the provisions of the Working Time Directive across the Defence Forces subject to certain exemptions. The Patrol Duty allowance payable to Naval Service personnel at sea has been doubled after ten days at sea in a calendar year and the Naval Service tax credit has been extended for a further five years.There has been significant progress on pay with all personnel benefiting from a further pay award made on August 1 of this year.  Recruitment to the Defence Forces remains ongoing through a diverse range of competitions for General Service and for specialised Direct Entry positions. Additional bespoke and once off competitions such as those currently advertising on the Defence Forces website for Grooms in the Equitation School and for a Dental Nurse provide further opportunities for perspective candidates who meet the entry criteria.  The entry criteria, including age limits, for personnel wishing to enter the Defence Forces are as set out in Regulations made pursuant to the Defence Act 1954, as amended. These criteria are subject to review and change. In 2024, the maximum recruitment age was increased in to 39 years of age for General Service Recruits, Cadets, and certain specialists. In addition, the maximum recruitment age for Direct Entry Officer specialists was increased to 50.  While challenges undoubtedly remain, the allocation of record levels of expenditure to the Defence sector, and the policy initiatives and changes to eligibility criteria already implemented, is indicative of Government’s commitment in this regard. ",
        "questionNumber": 62
      },
      "contextDate": "2025-09-18"
    },
    {
      "question": {
        "date": "2025-09-18",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "showAs": " 366. Deputy Micheál Carrigy asked the Minister for Health if she will consider the introduction of a free shingles vaccine for older people, in particular those over 66 years-of-age, in line with best practice in other European countries; if her Department has carried out an assessment of the health and cost benefits of a national shingles vaccination programme; and if she will make a statement on the matter. [49489/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-18/writtens/mul@/dbsect_327.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-18/writtens/dbsect_327",
          "showAs": "Healthcare Policy",
          "debateSectionId": "dbsect_327"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-18/pq_366",
        "answerText": " Minister for Health  Shingles vaccination is not currently provided as part of the national immunisation programme.  The Health Information and Quality Authority (HIQA) recently carried out a Health Technology Assessment (HTA) on the herpes zoster vaccine which protects against shingles. A HTA is a multidisciplinary research process that collects and summarises information about a health technology. The information can cover a range of fields, including clinical effectiveness and safety, cost-effectiveness and budget impact, organisational and social aspects, and ethical and legal issues. The information is collected and presented in a systematic, unbiased and transparent manner.  HIQA’s HTA examined the evidence on the clinical effectiveness and safety of shingles vaccines. The cost effectiveness and budget impact were also reviewed, along with the ethical, social and organisational implications of including the vaccine in the adult immunisation schedule.  HIQA published this HTA on 19 July 2024. The HTA found that adding the shingles vaccine to the routine immunisation schedule would not be cost effective and would be associated with a substantial budget impact.  Given that the healthcare budget is finite and decisions regarding increased spending relating to a change in one area could impact the provision of other health technologies and treatments within the healthcare system, the cost-effectiveness must be considered in any decision-making process.  My Department has considered the findings of this HTA and determined that the introduction of the vaccine could be reconsidered when the cost effectiveness of the vaccine is confirmed as being more favourable. ",
        "questionNumber": 366
      },
      "contextDate": "2025-09-18"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "showAs": " 210. Deputy Micheál Carrigy asked the Minister for Transport if he will engage with the National Transport Authority and Íarnród Éireann to extend the Leap card system to Mullingar, Edgeworthstown and Longford stations given the significant fare discrepancies that currently exist for commuters; if he will acknowledge that this situation places an unfair financial burden on these residents of Mullingar, Longford and surrounding areas who rely on rail for work, education and essential travel; and if he will make a statement on the matter. [47958/25] ",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_154.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_154",
          "showAs": "Public Transport",
          "debateSectionId": "dbsect_154"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_210",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators. The NTA also has responsibility for the regulation of fares charged to passengers in respect of public transport services provided under public service obligation (PSO) contracts.  In light of the NTA’s responsibility in this area, I have forwarded the Deputy's question to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "questionNumber": 210
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "showAs": " 232. Deputy Micheál Carrigy asked the Minister for Transport if he will consider introducing a reduced toll rate or commuter discount scheme for regular users of the M4 motorway (details supplied) similar to the arrangements in place on the M50, given the significant financial burden on daily commuters travelling to Dublin; and if he will make a statement on the matter. [48452/25] ",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_177.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_177",
          "showAs": "Road Tolls",
          "debateSectionId": "dbsect_177"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_232",
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and funding in relation to the national roads programme. Under the Roads Acts 1993-2015, the operation and management of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned.  Therefore, matters relating to the day to day operations regarding national roads, including toll roads are within the remit of TII. More specifically, the statutory power to levy tolls, to make toll bye-laws and to enter into agreements with private investors are vested in TII under Part V of the Roads Act 1993 (as amended). Moreover, the contracts for the privately-operated toll schemes are commercial agreements between TII and the Public Private Partnership (PPP) concessionaires concerned.  Noting the above position, I have referred the question regarding unpaid tolls to TII for a direct reply. Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionNumber": 232
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "showAs": " 603. Deputy Micheál Carrigy asked the Minister for Culture, Communications and Sport to examine the case for reviewing the current level of State funding to intercounty GAA players (details supplied); and if he will make a statement on the matter. [48028/25] ",
        "to": {
          "roleType": null,
          "showAs": "Culture",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_492.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_492",
          "showAs": "Departmental Funding",
          "debateSectionId": "dbsect_492"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_603",
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  I propose to take Questions Nos. 600, 601 and 603 together.  Sport Ireland distributed €5.6 million in 2024 in respect of the Government Support for Inter County Gaelic Games in addition to the annual investment in Games Development. This funding is payable to the GAA which, in collaboration with the LGFA, Camogie Association and the Gaelic Players Association (GPA), is responsible for its distribution to teams and players along with its reporting and oversight.  I wish to advise the Deputy that the GPA has sent copies of its pre-Budget Submission for 2026 to me and to my officials. In line with other pre-budget submissions, it will be given due consideration in the coming weeks. ",
        "questionNumber": 603
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "showAs": " 988. Deputy Micheál Carrigy asked the Minister for Children, Disability and Equality the number of children awaiting an assessment of need in primary care in County Longford for 2023, 2024 and to date in 2025; and if she will make a statement on the matter. [48453/25] ",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_814.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_814",
          "showAs": "Psychological Assessments",
          "debateSectionId": "dbsect_814"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_988",
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 988
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "showAs": " 1261. Deputy Micheál Carrigy asked the Minister for Health the number of cases in County Longford which have been moved from disability services to primary care in 2023 and 2024; and if she will make a statement on the matter. [48454/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_1070.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_1070",
          "showAs": "Departmental Data",
          "debateSectionId": "dbsect_1070"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_1261",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 1261
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "showAs": " 1262. Deputy Micheál Carrigy asked the Minister for Health the reason for transferring cases from disability services to primary care in County Longford in 2023 and 2024; the impact on waiting lists and service delivery for both disability services and primary care in the county; and if she will make a statement on the matter. [48455/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_1071.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_1071",
          "showAs": "Departmental Data",
          "debateSectionId": "dbsect_1071"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_1262",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 1262
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "showAs": " 1263. Deputy Micheál Carrigy asked the Minister for Health the measures being taken to reduce current waiting times for children requiring orthodontic treatment, given reports that waiting times are now estimated at up to four years; her plans to introduce a specific initiative to address these delays; if she will confirm whether vacant dental and orthodontic posts are being actively recruited to; if agency staff are being engaged in the interim to fill vacancies; and if she will make a statement on the matter. [48456/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_1022.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_1022",
          "showAs": "Hospital Waiting Lists",
          "debateSectionId": "dbsect_1022"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_1263",
        "answerText": " Minister for Health  I propose to take Questions Nos. 1214 and 1263 together.  The HSE provides orthodontic treatment to those who have the greatest level of need and have been assessed and referred for treatment before their 16th birthday. Referrals for HSE orthodontic assessment are made at the sixth-class oral health assessment appointment, if the dentist determines that the child may meet the HSE's criteria. All referrals to the HSE Orthodontic Unit are assessed by an orthodontist using standardised clinical criteria. Children whose treatment need is assessed by a HSE orthodontist as being Grade 4 or Grade 5 according to the HSE’s criteria are offered treatment through the HSE. No medical card is required for this treatment.  However, there are currently delays in accessing this service and the HSE has put in place a number of measures to address waiting times. These include treatment waiting list initiatives, services improvement initiatives and access to orthodontic services outside the jurisdiction for patients who meet the HSE's criteria.  In particular, there has been significant investment of €17m between 2022 and 2024 to support access to children’s orthodontic treatment. This funding has seen the creation of a new initiative supporting access to jaw surgery for orthodontic patients and the transfer of over 4000 patients into private, community-based orthodontic treatment. These successful initiatives are being continued this year through the provision of €2.85 million in funding nationally. Through this initiative, in 2025, 144 patients have been transferred to private orthodontic care and 43 patients have received jaw surgery as part of their orthodontic treatment.  In the long term, the Government is committed to fundamentally reforming oral healthcare services, including children's orthodontic services, through implementation of the National Oral Health Policy, Smile agus Sláinte. Budget 2025 allocated €2m for 2025, increasing to €4m in 2026, to continue the implementation of the National Oral Health Policy. This investment is going to provide an additional 15 dental staff across dentists and dental nurses to deliver oral healthcare services. The HSE is also progressing recruitment of 34.7 vacant oral healthcare whole-time-equivalents. This includes 3 vacant Specialist Orthodontist and 2.2 supporting dental nurse whole-time-equivalents, supporting access to our HSE Orthodontic Units.  An implementation plan for the first phase of policy implementation to end-2027 is currently being finalised by my Department and the HSE. ",
        "questionNumber": 1263
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "date": "2025-09-17",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "showAs": " 1408. Deputy Micheál Carrigy asked the Minister for Further and Higher Education, Research, Innovation and Science if he will urgently review the case of a Leaving Certificate student (details supplied); if flexibility or discretionary measures can be applied in such exceptional cases; and if he will make a statement on the matter. [47957/25] ",
        "to": {
          "roleType": null,
          "showAs": "Further and Higher Education",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/mul@/dbsect_1214.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-17/writtens/dbsect_1214",
          "showAs": "Departmental Inquiries",
          "debateSectionId": "dbsect_1214"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-17/pq_1408",
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  I would like to thank the Deputy for highlighting this case. I wish to fully acknowledge the student's exceptional academic performance and the significant challenges they have overcome. However, Higher Education Institutions are autonomous institutions within the meaning of the Universities Act 1997, the Institutions of Technology Acts 1992 to 2006 and the Technological Universities Act 2018. Under this legislation, the institutions are academically independent and are entitled to regulate their own academic affairs and administrative processes including in relation to admissions. My Department has no role therefore in setting the entry requirements for third-level courses, or in intervening in individual admissions cases.  I would, however, encourage the student and their family to engage directly with the Access and Admissions Offices of the universities of interest, who are best placed to advise on possible admissions options. I would also urge any student who in unhappy with their results or uncertain about their next steps not to be discouraged, as many options remain open to them outside of the CAO, including new flexible, tertiary degree pathways offered by the National Tertiary Office. Supports are available from websites such as nto.hea.ie or www.careersportal.ie.  Finally, I would like to extend my best wishes to the student in question in pursuing their studies and assure the Deputy that the higher education system is committed to supporting students with disabilities to achieve their full potential. ",
        "questionNumber": 1408
      },
      "contextDate": "2025-09-17"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Health",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-09-08",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 2057. Deputy Micheál Carrigy asked the Minister for Health if she will provide an update on the status of an appointment for a person (details supplied); if consideration will be given to expediting the appointment in light of their individual circumstances; and if she will make a statement on the matter. [44497/25] ",
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-09-08/pq_2057",
        "questionNumber": 2057,
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "debateSection": {
          "showAs": "Hospital Appointments Status",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/dbsect_1757",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-09-08/writtens/mul@/dbsect_1757.xml"
            }
          },
          "debateSectionId": "dbsect_1757"
        }
      },
      "contextDate": "2025-09-08"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "showAs": " 5. Deputy Micheál Carrigy asked the Taoiseach if his Department, or any agency under its aegis, has procured services from a company (details supplied), including but not limited to internet connectivity, satellite communications, or associated technologies. [40740/25] ",
        "to": {
          "roleType": null,
          "showAs": "Taoiseach",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_7.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_7",
          "showAs": "Departmental Contracts",
          "debateSectionId": "dbsect_7"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_5",
        "answerText": " The Taoiseach  Neither the Department of the Taoiseach nor the National Economic and Social Development Office - the only body under the aegis of the Department of the Taoiseach - have procured services from the company specified by the Deputy. ",
        "questionNumber": 5
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "showAs": " 2420. Deputy Micheál Carrigy asked the Minister for Children, Disability and Equality if she will urgently review the case of a person (details supplied) who has been waiting over 15 months for an appointment with a psychologist under the CDNT team following a referral to CAMHS; if she will ensure that the person is prioritised for assessment before the new school year begins; and if she will make a statement on the matter. [42640/25] ",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_2062.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_2062",
          "showAs": "Disability Services",
          "debateSectionId": "dbsect_2062"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_2420",
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 2420
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "showAs": " 2685. Deputy Micheál Carrigy asked the Minister for Health if a person (details supplied) is currently on the primary care waiting list for ASD-related supports in County Longford; if so, the position on the list; and if she will make a statement on the matter. [41429/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_2302.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_2302",
          "showAs": "Primary Care Services",
          "debateSectionId": "dbsect_2302"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_2685",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 2685
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "showAs": " 2842. Deputy Micheál Carrigy asked the Minister for Health if he will provide an update on the application for a primary medical certificate for a person (details supplied); and if she will make a statement on the matter. [42282/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_2459.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_2459",
          "showAs": "Primary Medical Certificates",
          "debateSectionId": "dbsect_2459"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_2842",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 2842
      },
      "contextDate": "2025-07-29"
    },
    {
      "question": {
        "date": "2025-07-29",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Micheál-Carrigy.S.2020-03-30",
          "showAs": "Micheál Carrigy",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Micheál-Carrigy.S.2020-03-30"
        },
        "showAs": " 2872. Deputy Micheál Carrigy asked the Minister for Health the status and projected timelines for the development of the four primary care centres in County Longford, specifically in Edgeworthstown, Granard, Ballymahon, and Longford Town; and if she will make a statement on the matter. [42483/25] ",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/mul@/dbsect_2487.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-07-29/writtens/dbsect_2487",
          "showAs": "Primary Care Centres",
          "debateSectionId": "dbsect_2487"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-07-29/pq_2872",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 2872
      },
      "contextDate": "2025-07-29"
    }
  ]
}