{
  "head": {
    "counts": {
      "questionCount": 3684,
      "resultCount": 3684
    }
  },
  "results": [
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "Jim-O'Callaghan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "showAs": "Jim O'Callaghan"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_236",
        "answerText": " Minister of State at the Department of Transport  In line with Actions 67 and 122 of Phase 1 of the Government's Road Safety Strategy 2021-2030, the National Transport Authority (NTA) chaired a cross-agency working group to examine various approaches to expediting the timely and efficient introduction of camera enforcement. The Working Group presented its final report to the Road Safety Partnership Board on 5 November 2023.  Building on the recommendations of this Group, Transport Infrastructure Ireland (TII) was nominated to lead the development of a comprehensive national strategy for the future roll-out and expanded use of safety cameras. A draft of this strategy is expected to be completed in the coming months.  The Strategy will cover the use of safety cameras across all aspects of the road network, with the objective of saving lives by reducing unsafe driver behaviours that can be detected using existing and proven camera-based technologies. The Strategy will focus on speed, red light and bus lane cameras in the initial phase. However, it is being designed to allow for the enforcement of other violations in the future, such as mobile phone use and not wearing seat belts. It is expected that legislative amendment will be required to allow for camera enforcement in these areas.  Pending the finalisation of the strategy and overarching camera framework, as announced in 2024, An Garda Síochána is in the process of deploying three new average speed zones and nine static cameras across the country, with two additional average speed zones already coming into operation in Mayo and Cavan in late 2024. Building on this, as part of Budget 2025, the Minister for Justice announced funding for a further 100 camera installations.  Alongside this and pending the development of a more scalable and automated camera enforcement system, using powers under Section 81(7) of the Road Traffic Act 2010, the National Transport Authority intend to collaborate with An Garda Síochána and Dublin City Council on the deployment of traffic management cameras within Dublin. Procurement exercises will be required for both cameras and a system operator, with the intention that one or two locations will be operational this year as part of an interim arrangement. ",
        "to": {
          "uri": null,
          "showAs": "Transport",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 236. Deputy Jim O'Callaghan asked the Minister for Transport if he has received a report in relation to progress on camera enforcement of road traffic laws; if not, if such a report has been commissioned by the National Transport Authority; and if he will make a statement on the matter. [1280/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_230",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_230.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_230",
          "showAs": "Road Traffic Offences"
        },
        "questionNumber": 236,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "Jim-O'Callaghan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "showAs": "Jim O'Callaghan"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_364",
        "answerText": " Minister for Public Expenditure, National Development Plan Delivery and Reform  The Minister for Public Expenditure, NDP Delivery and Reform has overall policy responsibility in relation to public service occupational pension schemes, including those relating to the Spouses' and Children's Pension Scheme (where the terms ‘spouse’ also relates to those in a civil partnership) and for the Single Public Service Pension Scheme, which makes provision for survivor benefits within the main scheme itself. Specific sectoral pension schemes in the wider public service are generally a matter for the Minister of the parent Department for the body concerned.  While various schemes and provisions apply across the public service, these provisions generally disallow ongoing payment of a spousal pension in situations where the spouse of the member subsequently remarries or cohabits with a new partner.  As set out in S.I. No. 132/1977 - Civil Service Widows' and Children's Contributory Pension Scheme 1977 and the Public Service Pensions (Single Scheme and Other Provisions) Act 2012, in the event that a payment has ceased on the grounds of remarriage or cohabitation it is possible to grant or regrant, as may be appropriate, the pension on compassionate grounds from a date not earlier than the date on which the relevant application is received by the Minister.  At this time no decision has been taken to change the existing terms of the public service Spouses' and Children's Pension Scheme or provisions for survivor benefits. ",
        "to": {
          "uri": null,
          "showAs": "Public Expenditure",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 364. Deputy Jim O'Callaghan asked the Minister for Public Expenditure, National Development Plan Delivery and Reform whether he proposes to make any changes to the public sector’s pensions scheme that prevents the payment of a spousal pension where the surviving person marries again or cohabits with a new partner; and if he will make a statement on the matter. [46267/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_358",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_358.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_358",
          "showAs": "Public Sector Pensions"
        },
        "questionNumber": 364,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "Jim-O'Callaghan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "showAs": "Jim O'Callaghan"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_451",
        "answerText": " Minister for Enterprise, Trade and Employment (Deputy Peter Burke)  IDA Ireland achieved excellent results in 2024 with continued strong levels of investment and employment across the FDI sector, reporting a total of 234 investments with the potential to create 13,500 jobs over the next few years. 69 investments were from new name or first-time investors, strongly indicating Ireland’s ongoing attractiveness as an FDI location. Ireland cannot afford to be complacent about FDI and fundamental to delivering continued growth and success is a continued focus on competitiveness, agile policies and delivery of national infrastructure.  The number of IDA supported jobs by county, for 2024, is set out in the table below.     County    Total IDA Supported Jobs 2024       Cavan     950       Donegal     5,196       Leitrim     1,083       Monaghan     258       Sligo     2,902       Dublin     137,082       Kildare     10,617       Louth     4,111       Meath     3,047       Wicklow     2,695       Clare     6,041       Limerick     16,068       Tipperary     5,589       Laois     145       Longford     1,787       Offaly     1,420       Westmeath     4,693       Carlow     1,474       Kilkenny     1,460       Waterford     9,040       Wexford     3,606       Cork     49,898       Kerry     2,070       Galway     24,118       Mayo     5,541       Roscommon     1,675       Total      302,566     ",
        "to": {
          "uri": null,
          "showAs": "Enterprise",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 451. Deputy Jim O'Callaghan asked the Minister for Enterprise, Trade and Employment the number of IDA-supported jobs in each county at the end of 2024, in tabular form; and if he will make a statement on the matter. [1732/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_436",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_436.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_436",
          "showAs": "Industrial Development"
        },
        "questionNumber": 451,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "Jim-O'Callaghan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "showAs": "Jim O'Callaghan"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_452",
        "answerText": " Minister of State at the Department of Enterprise, Trade and Employment  It is hugely positive to see Enterprise Ireland (EI) supported companies recording jobs growth for the fourth year in a row despite what was a challenging year for some sectors of exporting Irish businesses. EI recently published its 2024 employment results which showed an increase to a record 234,454 jobs in supported companies, with 15,741 new jobs created, up 3% on the 2023 outturn. Employment increased across EI’s three core economic sectors - Technology & Services (+2%), Industrial and Life Sciences (+3%) and Food and Sustainability (+3%).  This growth translates into a net increase of 6,212 jobs created in 2024. Balanced regional development is being achieved in terms of both new jobs created by EI clients and total employment with 64% of new jobs regionally based and all nine regions recording jobs growth.  Enterprise Ireland surveys its portfolio of clients annually to collect employment data and the 2024 figures, per county, are outlined in the table below.       County    2024 Total jobs      Carlow    3,714      Cavan    6,681      Clare    5,566      Cork    26,026      Donegal    3,684      Dublin    79,111      Galway    9,687      Kerry    5,206      Kildare    9,206      Kilkenny    7,255      Laois    2,060      Leitrim    978      Limerick    8,915      Longford    2,511      Louth    6,748      Mayo    6,431      Meath    9,034      Monaghan    7,644      Offaly    4,147      Roscommon    1,515      Sligo    2,377      Tipperary    6,732      Waterford    6,139      Westmeath    3,269      Wexford    5,943      Wicklow    3,875       Grand Total      234,454     ",
        "to": {
          "uri": null,
          "showAs": "Enterprise",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 452. Deputy Jim O'Callaghan asked the Minister for Enterprise, Trade and Employment the number of Enterprise Ireland-supported jobs in each county at the end of 2024, in tabular form; and if he will make a statement on the matter. [1733/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_437",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_437.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_437",
          "showAs": "Employment Schemes"
        },
        "questionNumber": 452,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "Jim-O'Callaghan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "showAs": "Jim O'Callaghan"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_453",
        "answerText": " Minister of State at the Department of Enterprise, Trade and Employment  The Government is committed to backing businesses and will continue to work closely with small businesses to support their growth, help them to find new markets, create jobs and take on the twin challenges of decarbonisation and digitalisation. The Local Enterprise Offices (LEO) have a key role to play here.  The 2024 Annual Employment Survey of LEO clients once again show positive job creation across most of the Local Enterprise Offices.  LEO supported companies that received direct financial grant assistance created 7,104 new jobs in 2024 which saw a 7% increase in employment from 2023.  There was a net employment gain of 2,459 for the year. Total employment in LEO supported businesses in 2024 was 39,541.  81% of the new jobs created by LEO companies in 2024 were located outside of Dublin. This shows again how vital the LEOs are to the development of our indigenous enterprises and is a testament to the hard work and dedication of the staff of the 31 Local Enterprise Offices.  The net jobs gain in employment by LEO Client companies of 2,459 accounts for any loses from company amalgamation, transfers from LEOs to Enterprise Ireland and those that ceased trading.  The figures accounted for in these results are only LEO clients that have received direct financial grant assistance from their LEO and does not include the number of small businesses and associated jobs that have received training, mentoring or other supports such as the Grow Digital Voucher, Green for Business, Lean for Business, Digital for Business and Energy Efficiency Grants (EEG).  The Local Enterprise Office Annual Employment Survey results for 2024 are set out in the table below:     County    No. of Clients    Total Jobs (FT + OT)    Total Gains    Net Jobs      Carlow    219    1,106    314    102      Cavan    179    1,417    145    26      Clare    228    1,364    227    82      Cork    618    3,076    619    119      Donegal    272    1,713    243    129      Dublin    1,266    5,909    1,260    470      Galway    258    1,356    218    111      Kerry    238    1,104    156    -81      Kildare    277    1,438    323    163      Kilkenny    190    1,081    174    70      Laois    145    800    141    29      Leitrim    141    485    114    34      Limerick    313    2,183    403    178      Longford    258    1,379    201    38      Louth    217    963    136    25      Mayo    201    1,315    185    120      Meath    259    1,455    253    74      Monaghan    170    1,006    162    9      Offaly    198    1,188    250    55      Roscommon    164    1,038    153    91      Sligo    189    1,021    145    73      Tipperary    262    1,526    355    149      Waterford    259    1,269    203    54      Westmeath    272    1,737    288    178      Wexford    225    1,945    329    163      Wicklow    158    667    107    -2       Grand Total      7,176      39,541      7,104      2,459       ",
        "to": {
          "uri": null,
          "showAs": "Enterprise",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 453. Deputy Jim O'Callaghan asked the Minister for Enterprise, Trade and Employment the number of Local Enterprise Office-supported jobs in each county at the end of 2024, in tabular form; and if he will make a statement on the matter. [1734/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_438",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_438.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_438",
          "showAs": "Employment Schemes"
        },
        "questionNumber": 453,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "Jim-O'Callaghan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "showAs": "Jim O'Callaghan"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_778",
        "answerText": " Minister for Housing, Local Government and Heritage  My Department is working closely with Dublin City Council (DCC) to realise the progression of the regeneration of Pearse House. Stage 1 funding approval was provided by my Department in April 2021.  DCC have advanced this project to an outline design with costing and my Department is currently working with DCC on that submission. ",
        "to": {
          "uri": null,
          "showAs": "Housing",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 778. Deputy Jim O'Callaghan asked the Minister for Housing, Local Government and Heritage when the regeneration of Pearse House, Pearse Street, Dublin 2, will commence; and if he will make a statement on the matter. [1310/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_744",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_744.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_744",
          "showAs": "Urban Development"
        },
        "questionNumber": 778,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "Jim-O'Callaghan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "showAs": "Jim O'Callaghan"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_924",
        "answerText": " Minister for Justice  Parliamentary Question No.790 of 5 November 2024 refers to the number of Gardaí, by rank, attached to each Divisional Crime Scenes Unit as of 29 October 2024, in tabular form.  As the Deputy will appreciate, in accordance with the Garda Síochána Act 2005 as amended, the Garda Commissioner is responsible for the management and administration of Garda business. Further, the allocation of Garda resources is made in light of identified operational demands. This includes deployment of personnel among the various Garda Divisions. As Minister for Justice, I have no role in these matters.  I am assured, however, that Garda management keeps this distribution of resources under continual review in the context of policing priorities and crime trends, to ensure their optimum use. I understand that it is a matter for the Divisional Chief Superintendent to determine the optimum distribution of duties among the personnel available to him or her, having regard to the profile of each area within the Division and its specific needs.  I am advised that there were 155 Garda members assigned to the Divisional Crime Scenes Unit on the 31 December 2024, the latest date for when figures are available. The table below, which has been provided to me by the Garda authorities, sets out these Garda members by rank in each Garda Region.  I am advised that the Garda authorities will not report on numbers that are less than 10 for operational reasons.       Divisional Crime Scenes Unit by Region                 Region      Sergeant      Garda      Total       DMR Total    &lt;10    42    46      Eastern    &lt;10    36    39      North Western    &lt;10    29    36      South    &lt;10    30    34       Total      18      137      155      Please be advised that this information is operational and may be subject to change. ",
        "to": {
          "uri": null,
          "showAs": "Justice",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 924. Deputy Jim O'Callaghan asked the Minister for Justice further to Parliamentary Question No. 790 of 5 November 2024, if she has received the necessary information from the Garda authorities in order to have this PQ answered; and if she will make a statement on the matter. [46347/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_866",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_866.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_866",
          "showAs": "An Garda Síochána"
        },
        "questionNumber": 924,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "Jim-O'Callaghan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "showAs": "Jim O'Callaghan"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_925",
        "answerText": " Minister for Justice  Community policing is at the heart of An Garda Síochána, and I very much support the approach that every Garda has a role to play in community policing.  I can inform the Deputy that on 31 October 2024, the latest date for when published figures are available, there were 684 Community Gardaí nationwide.  I am advised that at the end of October there were 66 Community Gardaí assigned to the DMR North Division, an increase of 1.5%  since the end of December 2023.  The table below, which was provided to me by the Garda authorities, sets out the number of Community Gardaí by rank assigned to Coolock Garda station at the end of December 2023, and on 31 October 2024, the latest date for which figures are available.       Community Garda  - Coolock Garda Station    Garda    Sergeant    Total      31 December 2023    8    1    9      31 October 2024    7    1    8       Please be advised that these figures are operational and may be subject to change.  The Garda Commissioner is responsible for the distribution of resources, including personnel, among the various Garda Units and I, as Minister, have no direct role in the matter.  In the interest of transparency, information in relation to the allocation of Community Gardaí by Division is publicly available and can be found at the following link. I can also advise the Deputy that I have received the most recent figures for October from An Garda Síochána which have been published on the website.  www.gov.ie/en/publication/bd777-an-garda-siochana-your-police-service-some-facts-and-figures/  As the Deputy may be aware, a member of An Garda Síochána is deemed to be a ‘Community Garda’ where that person is allocated to a Community Policing Team (CPT), and is responsible and accountable for applying a problem–solving approach to appropriate crime and policing quality-of-life issues in a specified geographic area through community partnership and engagement. Examples of this engagement are working with Neighbourhood Watch, Community Alert, or local business fora.  Like most Garda members, those assigned to CPTs have dual functions. In addition to their strategic roles in these teams, part of which requires them to regularly update their Community Engagement Superintendent on the policing needs of their community, they are also frontline members. It is also important to note that CPTs draw on all frontline Gardaí to carry out community policing.  Of course, Gardaí are not solely responsible for safety in our communities and this is what the new whole-of-Government Community Safety structure aims to address by bringing the relevant service providers and the Gardaí together to work with each community in a collaborative manner to focus on tackling the concerns identified and prioritised by the local community itself. The roll-out of Local Community Safety Partnerships across the country will be a core part of that. ",
        "to": {
          "uri": null,
          "showAs": "Justice",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 925. Deputy Jim O'Callaghan asked the Minister for Justice the number of Gardaí, by rank attached to a unit (details supplied) as of 4 December 2024; if she will provide same figures as of 31 December 2023, in tabular form; and if she will make a statement on the matter. [46348/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_867",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_867.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_867",
          "showAs": "An Garda Síochána"
        },
        "questionNumber": 925,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "Jim-O'Callaghan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "showAs": "Jim O'Callaghan"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_926",
        "answerText": " Minister for Justice  I understand that Parliamentary Question No. 797 of 5 November 2024 refers to \"the number of Public Order Instructor courses held for Gardaí within the DMR region in the years of 2023 and to date in 2024; and the number of these courses that are scheduled to be held between now and year-end.\"  As the Deputy will appreciate, in accordance with the Garda Síochána Act 2005 (as amended), the Garda Commissioner is responsible for the management and administration of Garda business. This includes the deployment of Garda resources and training of Garda personnel. As Minister, I have no role in these independent functions.  The table below, which was provided to me by the Garda authorities, sets out the number of Public Order Instructor courses held for Garda members within the DMR in 2023 and 2024, and the number of Garda members who trained as Public Order Instructors in those years.  I am advised that data is not released by An Garda Síochána for counts of fewer than 10 for data protection and security reasons.     Year    Number of Public Order Instructor Courses held    Number of trained Public Order Instructors      2023    &lt;10    &lt;10      2024*    &lt;10    17       *I am advised that the figure provided for 2024 reflects Garda National Public Order Unit Instructor training for Stadium Tactics.  All information is operational and may be subject to change. ",
        "to": {
          "uri": null,
          "showAs": "Justice",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 926. Deputy Jim O'Callaghan asked the Minister for Justice further to Parliamentary Question No. 797 of 5 November 2024, if she has received the necessary information from the Garda authorities in order to have this PQ answered; and if she will make a statement on the matter. [46349/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_868",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_868.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_868",
          "showAs": "An Garda Síochána"
        },
        "questionNumber": 926,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "Jim-O'Callaghan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "showAs": "Jim O'Callaghan"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_927",
        "answerText": " Minister for Justice  I refer to parliamentary question 792 of 5 November 2024 where the Deputy asked for the number of new Garda cars and vans attached to each Garda district within DMR to date in 2024 in tabular form.  As the Deputy will appreciate, the Garda Commissioner is responsible for the management and administration of An Garda Síochána, including the Garda fleet. This includes the allocation of Garda vehicles to a given Division or Station. As Minister, I have no role in these matters.  The below table, provided to me by the Garda authorities provides the number of Cars and vans allocated to the DMR by District in 2024 as at 31 October, the latest date for which figures are available.  I am further advised that the purchase and allocation of vehicles by An Garda Síochána is made on the basis of identified operational demands, the availability of resources and is reviewed on a continual basis.             Cars    Vans      DMR REGION    Total    32    16      DMR EAST    Total    1    1          DUNLAOGHAIRE    1    1      DMR NORTH    Total    1    3          BALBRIGGAN    1    1          BALLYMUN    0    1          RAHENY    0    1      DMR NORTH CENTRAL    Total    2    1          FITZGIBBON STREET    2    1          STORE STREET    0    0      DMR REGIONAL OFFICE    Total    9    2          A/COMM-OFFICE    9    2      DMR SOUTH    Total    2    4          CRUMLIN    1    0          TALLAGHT    1    2          TERENURE    0    2      DMR SOUTH CENTRAL    Total    13    1          DONNYBROOK    6    0          KEVIN STREET    7    1      DMR TRAFFIC    Total    1    1          DMR TRAFFIC-DUBLIN CASTLE    1    1      DMR WEST    Total    3    3          BLANCHARDSTOWN    2    3          CLONDALKIN    1    0      ",
        "to": {
          "uri": null,
          "showAs": "Justice",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 927. Deputy Jim O'Callaghan asked the Minister for Justice further to Parliamentary Question No. 792 of 5 November 202, if she has received the necessary information from the Garda authorities in order to have this PQ answered; and if she will make a statement on the matter. [46352/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_869",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_869.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_869",
          "showAs": "An Garda Síochána"
        },
        "questionNumber": 927,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "Jim-O'Callaghan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "showAs": "Jim O'Callaghan"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_928",
        "answerText": " Minister for Justice  As the Deputy will be aware, under the Garda Síochána Act 2005 (as amended), the Garda Commissioner is responsible for the management and administration of An Garda Síochána. This includes the distribution of resources, including the Garda fleet, across the various Garda Units and Divisions. As Minister, I have no direct role in this matter.  The Government is committed to providing An Garda Síochána with the resources it needs to fight crime, and a strengthened, well-resourced Garda organisation is central to this policy. This is reflected in the unprecedented allocation of over €2.48 billion in Budget 2025, a 27% increase since 2020. This funding is allowing for sustained investment in recruitment, equipment, technology and vehicles.  I am advised that, at the end of December 2024, there were 3,589 vehicles attached to the Garda fleet, an increase of 15% since the end of 2020. The fleet includes 2,653 cars, 625 vans, 160 motorcycles, 97 4x4 and 54 others (refers to MPV, SUV, Minibus or Prisoner Conveyance Vehicles).  To be of assistance, I sought the information requested by the Deputy from An Garda Síochána and have been advised that there were 30 Garda Public Order Unit vans as of 31 December 2024.  The responsibility for the efficient deployment of all official Garda vehicles in each Division is assigned to the Divisional Officer, who may allocate vehicles between Stations as required by operational circumstances.  I am advised that the purchase and allocation of vehicles by An Garda Síochána is made on the basis of identified operational demands, the availability of resources and is reviewed on a continual basis. ",
        "to": {
          "uri": null,
          "showAs": "Justice",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 928. Deputy Jim O'Callaghan asked the Minister for Justice the number of Garda public order unit vans currently in the fleet as of 6 December 2024; and if she will make a statement on the matter. [46353/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_870",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_870.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_870",
          "showAs": "An Garda Síochána"
        },
        "questionNumber": 928,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "Jim-O'Callaghan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "showAs": "Jim O'Callaghan"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_1373",
        "answerText": " Minister for Health  Clinical trials are a fundamental component of high-quality care and improving patient outcomes. Over the last 15 years, my Department has invested more than €150 million in clinical trials and research support services in all healthcare areas including oncology through the Health Research Board (HRB). My Department established a National Clinical Trials Oversight Group in July of last year. This group is tasked with developing recommendations on increasing the number of trials taking place in Ireland and improving access for patients to participate in more clinical trials across a range of priority healthcare areas, including oncology clinical trials.  In recent years, my Department has made significant progress in improving clinical trial infrastructure. In an effort to improve transparency, streamline approval mechanisms, and provide a robust framework for ethical approval process for clinical trials, my Department established the National Office for National Research Ethics Committees (NREC). This office, which plays a critical role in providing expertise and guidance on research ethics, hosts three NRECs in key clinical trial areas of medical products, medical devices, and in vitro diagnostics. The Department has also invested in the expansion of an HSE research infrastructure across the Health Regions to promote an equitable national research service within the public health sector.  The HRB, as the leading funder of health research in Ireland, has been driving the growth of clinical trials in Ireland and putting in place the supporting research infrastructure with the overall aim of facilitating clinical trials that can benefit patients, the healthcare system, and the economy. In 2021, the HRB Board approved a multi-year €21.6m investment in cancer trials in Ireland, comprising support for a National Cancer Clinical Trials Network and funding for six cancer trials groups. Additionally, the HRB manages the only dedicated funding stream (i.e., Definitive Interventions and Feasibility Awards, DIFA) for clinical trials and interventions in Ireland, which supports studies evaluating a full scale, definitive trial of an intervention to provide high quality evidence on the efficacy, effectiveness, cost, and broad impact of the intervention. To date the HRB has made a total investment of €32m across 45 studies. In 2022, the HRB opened a specific cancer stream with €3m available for cancer clinical trials and interventions in the DIFA scheme.  Under the Ireland-Northern Ireland-US Cancer Consortium, €1.2m was allocated in funding for North-South cancer research in 2024, which includes access to clinical trials on an all-island basis as a priority objective.  In line with the National Cancer Strategy 2017-2026, a National Cancer Research Group has been established. The Group aims to improve co-ordination and oversight of cancer research nationally and provide a forum for the agreement of research priorities. The Group also seeks to achieve continuity of funding and to ensure that funding allocations are linked to the agreed research priorities. ",
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 1373. Deputy Jim O'Callaghan asked the Minister for Health what can be done to increase Ireland’s participation rate in cancer related clinical trials; and if he will make a statement on the matter. [46559/24] ",
        "debateSection": {
          "debateSectionId": "dbsect_1295",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_1295.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_1295",
          "showAs": "Clinical Trials"
        },
        "questionNumber": 1373,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2025-01-22",
      "question": {
        "by": {
          "memberCode": "Jim-O'Callaghan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "showAs": "Jim O'Callaghan"
        },
        "date": "2025-01-22",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-01-22/pq_1603",
        "answerText": " Minister of State at the Department of Health  As this is an operational matter I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "to": {
          "uri": null,
          "showAs": "Health",
          "roleCode": null,
          "roleType": null
        },
        "questionType": "written",
        "showAs": " 1603. Deputy Jim O'Callaghan asked the Minister for Health the number of home care support hours for older people provided in each LHO area in 2024, in tabular form; and if he will make a statement on the matter. [1735/25] ",
        "debateSection": {
          "debateSectionId": "dbsect_1510",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/mul@/dbsect_1510.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-01-22/writtens/dbsect_1510",
          "showAs": "Home Care Packages"
        },
        "questionNumber": 1603,
        "house": {
          "committeeCode": "",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "chamberType": "house"
        }
      }
    },
    {
      "contextDate": "2024-11-07",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-07/writtens/mul@/dbsect_146.xml"
            }
          },
          "debateSectionId": "dbsect_146",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-07/writtens/dbsect_146",
          "showAs": "State Examinations"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-07/pq_136",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 136,
        "showAs": " 136. Deputy Jim O'Callaghan asked the Minister for Education the outcome of the Stakeholder consultation on the review of the Leaving Certificate curriculum carried out by the National Council for Curriculum Assessment; when the findings of the consultation will be published; and if she will make a statement on the matter. [45662/24] ",
        "answerText": " Minister for Education  I understand the Deputy is referring to the public consultation on the draft revised specifications for three science subjects at Senior Cycle - Biology, Chemistry and Physics - which took place from December 8th, 2023, to February 23rd, 2024.  The aim of this consultation, led by the National Council for Curriculum and Assessment (NCCA), was to seek views of the public in relation to the curriculum and assessment arrangements in the new draft specifications, as part of Senior Cycle Redevelopment, and to gain insights into participants’ overall impressions of the specifications.  The consultation took place using online surveys, online and written submissions, a  range of school-based focus groups and a consultation event.  The consultation report, as well as the feedback gathered through the mediums outlined above, are all published on the NCCA's website: Report on the consultation on the draft senior cycle.  The feedback from the consultation process informed the finalisation of the specifications, which I approved in early September, and can be found on curriculumonline.ie  Senior Cycle Subjects | Curriculum Online Students starting fifth year from 2025 will follow these revised specifications. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-11-07",
        "by": {
          "showAs": "Jim O'Callaghan",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-07",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-07/writtens/mul@/dbsect_352.xml"
            }
          },
          "debateSectionId": "dbsect_352",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-07/writtens/dbsect_352",
          "showAs": "Health Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-07/pq_354",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 354,
        "showAs": " 354. Deputy Jim O'Callaghan asked the Minister for Children, Equality, Disability, Integration and Youth the long-term care plan for a person (details supplied). [45659/24] ",
        "answerText": " Minister of State at the Department of Children, Equality, Disability, Integration and Youth  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-11-07",
        "by": {
          "showAs": "Jim O'Callaghan",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-07",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-07/writtens/mul@/dbsect_568.xml"
            }
          },
          "debateSectionId": "dbsect_568",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-07/writtens/dbsect_568",
          "showAs": "Further and Higher Education"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-07/pq_571",
        "to": {
          "roleType": null,
          "showAs": "Further and Higher Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 571,
        "showAs": " 571. Deputy Jim O'Callaghan asked the Minister for Further and Higher Education, Research, Innovation and Science to confirm the €10 million capital funding from Government to the National College of Ireland to support the NCI's second campus at Spencer Dock; if he will confirm the equalisation of funding for NCI students in order that funding is at the same level as those in other Universities and Technological Universities; the process of designating NCI as a higher education institute pursuant to the Higher Education Act 2022; and if he will make a statement on the matter. [45660/24] ",
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science (Deputy Patrick O'Donovan)  My Department met recently with NCI at senior official level and continues to engage with the college on a range of matters.  The NCI is a private not-for-profit institution with charitable status. As a private college the day to day operation of the organisation, including issues surrounding the administration and finances are the responsibility of the college administrators to deal with in line with the college’s own criteria. My Department provides an annual recurrent grant to NCI (via the Higher Education Authority) towards its non-pay operating costs along with funding on behalf of eligible students towards their tuition fees through the Free Fees Initiative.  When the Higher Education Authority Act 2022 was commenced, sixteen higher education institutions were  automatically designated as “designated institutions of higher education”. The automatically designated institutions of higher education are the seven traditional universities, the technological universities, the institutes of technology, the National College of Art and Design and the Royal College of Surgeons in Ireland. All of these institutions were established or recognised under legislation and were previously designated under the Higher Education Authority Act 1971.  The Higher Education Authority Act 2022 also provides for a designation by order process which allows other higher education institutions, including private and not-for-profit higher education institutions, to apply for designation. However, these provisions have not yet been commenced. Work has commenced on developing the designation by order process, including consideration of the conditions for designation for inclusion in regulations to be prescribed by the Minister under the Act.  This is a complex process, involving liaison with the Higher Education Authority, Quality and Qualifications Ireland and other stakeholders to ensure the new designation process fits seamlessly within the higher education system.  Once the designation by order process is fully developed, the relevant provisions of the HEA Act will be commenced and the designation by order regulations will be prescribed. It will then be open to NCI to apply for designation by order under the legislation. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2024-11-07",
        "by": {
          "showAs": "Jim O'Callaghan",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03",
          "showAs": "Jim O'Callaghan"
        },
        "questionNumber": 29,
        "questionType": "written",
        "showAs": " 29. Deputy Jim O'Callaghan asked the Minister for the Environment, Climate and Communications his views on a matter (details supplied); and if he will make a statement on the matter. [45445/24] ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Environment",
          "roleCode": null
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-06/writtens/dbsect_53",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-06/writtens/mul@/dbsect_53.xml"
            },
            "pdf": null
          },
          "showAs": "Electricity Grid",
          "debateSectionId": "dbsect_53"
        },
        "date": "2024-11-06",
        "house": {
          "showAs": "33rd Dáil",
          "committeeCode": "",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-06/pq_29",
        "answerText": " Minister for the Environment, Climate and Communications  The Commission for Regulation of Utilities (CRU) has responsibility for the National Smart Metering Programme (NSMP), with ESB Networks (ESBN) delivering the roll-out across the country, on a phased basis. However, I understand that the proposed 3-phase smart meter solution encountered some technical issues which has delayed the planned roll-out date. ESBN have since identified a solution for this, and the roll-out of 3-phase whole current smart meters is now expected to begin in Q3, 2025.  In the interim, renewables self-consumers with 3-phase connections remain eligible for deemed export payments under the Clean Export Guarantee (CEG) scheme. In December 2021, CRU published a Decision on an interim enabling framework for the Clean Export Guarantee (CEG), enabling payments to micro-generators for excess electricity exported to the grid, which outlines the arrangements for its implementation, including eligibility criteria and remuneration methodology. This process was reviewed in the CRU’s consultation on an enduring CEG, which resulted in a decision paper, published in June 2024.  Under certain conditions outlined in these CRU decisions, customers with microgeneration but who are not yet eligible for a smart meter (such as those with 3-phase meters) may still avail of the CEG. Under these conditions a deemed quantity will be calculated by ESBN, using the CRU agreed calculation method available here: cruie-live-96ca64acab2247eca8a850a7e54b-5b34f62.divio-media.com/documents/CRU21131-Interim-Clean-Export-Guarantee-Decision-Paper.pdf. Both CEG decision papers are available on the CRU website, cru.ie. "
      },
      "contextDate": "2024-11-06"
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 252,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_252",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_245",
          "showAs": "Tax Code",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_245",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_245.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Finance",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Finance  I propose to take Questions Nos. 252 and 267 together.  I note the issues raised by the Deputies, relating to tax treatment of Exchange Traded Funds, or \"ETFs\", and the security of investments in trading funds.  The Deputies may wish to note that on 22 October 2024, I published the Report of the Funds Sector 2030. The Review made a number of recommendations regarding ETFs.  The Report of the Review is available at: www.gov.ie/en/publication/da341-funds-sector-2030-a-framework-for-open-resilient-and-developing-markets/  My Department is developing a work programme to progress the recommendations of the report. ",
        "showAs": " 252. Deputy Jim O'Callaghan asked the Minister for Finance whether he intends to review the tax regime associated with exchange traded funds; and if he will make a statement on the matter. [44117/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 351,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_351",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_338",
          "showAs": "Departmental Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_338",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_338.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Education  The purpose of the small schools’ project is to inform the development of a policy of supports for small schools through working with education partners to trial innovative approaches to support and sustain small schools in a number of clusters.  There are 24 schools in the project in six clusters, two in Galway, and one each in Donegal, Kerry, Wicklow and Waterford, consisting of between three and five schools per cluster. The clusters are supported by part-time local coordinators sponsored by the education partners, working with a national project coordinator under the guidance of a steering group.  New ideas are being trialed to determine whether they might help to make small schools more sustainable. The schools participating across the six clusters in this project have developed good working relationships and have already provided valuable insights and ideas into supports that can be developed and replicated across small schools.  Some of the initiatives in the project don’t create additional costs. Funding in the form of an Innovation Fund (€150,000) is in place for the project’s lifetime and schools will not be asked to make a financial contribution to take part. For the duration of the project all existing mainstream staffing levels will be maintained.  On 30 April 2024, I was delighted to announce a further two-year extension (phase two) of the small schools’ action research project to support small schools in rural Ireland. ",
        "showAs": " 351. Deputy Jim O'Callaghan asked the Minister for Education the annual funding allocations in 2024 and 2025 for the small school's initiative; and the number of schools invested in each year. [43901/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 709,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_709",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_668",
          "showAs": "An Garda Síochána",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_668",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_668.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Justice  As the Deputy will appreciate, management of the courts, along with related operational matters and logistical functions, are the responsibility of the judiciary and Courts Service, which are independent in exercising their functions under the Courts Service Act 1998 and through the separation of powers in the Constitution.  It should be noted that the Department does not record data relating to convictions, as this is a function of the courts.  The Courts Service has a dedicated email address for the provision of information to members of the Houses of the Oireachtas: oireachtasenquiries@courts.ie  To be of assistance, I have referred the Deputy's question to the Courts Service for direct reply. ",
        "showAs": " 709. Deputy Jim O'Callaghan asked the Minister for Justice the number of criminal prosecutions that were struck out, or discontinued in the past one or two years, due to the prosecuting Garda or Garda witnesses no longer being members of An Garda Síochána. [43959/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 721,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_721",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_680",
          "showAs": "An Garda Síochána",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_680",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_680.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Justice  The Government is committed to building stronger, safer communities, and strengthening An Garda Síochána is at the core of that. We will continue to provide An Garda Síochána with the resources it needs to ensure communities around Ireland are safe and feel safe, including to invest in recruitment, in equipment and technology and in buildings. This is reflected in the unprecedented allocation of over €2.48 billion to An Garda Síochána, in Budget 2025, a 27% increase since 2020. This funding allows for the continued recruitment of Garda members and staff.  While the Garda Commissioner is operationally responsible for the allocation of Garda resources, I engage regularly with him to ensure our Gardaí have the resources they need. I am informed that when allocating and transferring Garda members to and from any Division, consideration is given to commitments and undertakings outlined in the Annual Policing Plan and priorities as determined in delivering ‘A Policing Service for The Future’.  I understand that the requirements of all Garda Divisions nationwide are also taken into account, which include:  • Local and national crime trends and workloads;  • Policing arrangements and operational strategies;  • Minimum establishment statistics;  • Local population and trends, geographical area and size;  • Transfer applications, including welfare, personnel issues and concerns.  As the Deputy will be aware, the Garda Commissioner is by law responsible for the administration of An Garda Síochána, including all matters relating to HR and the Garda workforce. As Minister, I have no role in these matters. My Department draws on the figures provided by An Garda Síochána to answer Parliamentary Questions and other business where appropriate.  I can advise the Deputy that as of the end of September, the total strength of An Garda Síochána was 14,125. ",
        "showAs": " 721. Deputy Jim O'Callaghan asked the Minister for Justice the number of sworn members in An Garda Síochána at present. [44204/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 789,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_789",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_743",
          "showAs": "An Garda Síochána",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_743",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_743.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Justice  I have been informed by the Garda authorities that there are 829 penal warrants outstanding in the R District.  I am further informed that figures are based on penal warrants outstanding on 25 October 2024 in Coolock (R District).  All information contained in this report is based upon operational data from the Pulse system as was available on 31 October 2024, and is liable to change.  As the Deputy may be aware, difficulties in relation to the execution of warrants are a long-standing issue for many police services around the world, notably relating to persons actively seeking to evade detection and where limited identification information might be available to support enforcement.  These difficulties are compounded where the warrant has been outstanding for some years.  However, I am assured that An Garda Síochána executes warrants as expeditiously as possible, giving priority to the execution of warrants relating to serious crimes. ",
        "showAs": " 789. Deputy Jim O'Callaghan asked the Minister for Justice the number of penal warrants outstanding in the Garda R District as of 25 October 2024; and if she will make a statement on the matter. [45066/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 790,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_790",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_744",
          "showAs": "An Garda Síochána",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_744",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_744.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Justice  I have requested the information sought by the Deputy from the Garda authorities. Regrettably, this was not available in time and I will write to the Deputy once the information is to hand. ",
        "showAs": " 790. Deputy Jim O'Callaghan asked the Minister for Justice the number of Gardaí, by rank, attached to each divisional scenes of the crime unit as of 29 October 2024, in tabular form; and if she will make a statement on the matter. [45067/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 791,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_791",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_745",
          "showAs": "An Garda Síochána",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_745",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_745.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Justice  As the Deputy will be aware, under the Garda Síochána Act 2005 (as amended), the Garda Commissioner is responsible for the management and administration of An Garda Síochána, including the purchase, allocation, and effective and efficient use of Garda vehicles. As Minister, I have no role in these independent functions.  The unprecedented allocation of over €2.48 billion for 2025 to An Garda Síochána demonstrates the Government's commitment to ensuring An Garda Síochána has provision for the equipment, technology, facilities, fleet and personnel it needs to carry out vital policing work.  There are now over 3,500 Garda vehicles. This is the largest fleet ever available to An Garda Síochána and represents a 34% increase since 2015.  I am advised by Garda authorities that there are currently 2 vans allocated to the public order unit in the DMR North Division. The responsibility for the efficient deployment of all official Garda vehicles in each Division is assigned to the Divisional Officer, who may allocate vehicles between Stations as required by operational circumstances.  The purchase and allocation of vehicles by An Garda Síochána is made on the basis of identified operational demands, the availability of resources and is reviewed on a continual basis. ",
        "showAs": " 791. Deputy Jim O'Callaghan asked the Minister for Justice the number of Garda public order unit vans attached to DMR North as of 29 October 2024; and if she will make a statement on the matter. [45068/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 792,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_792",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_746",
          "showAs": "An Garda Síochána",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_746",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_746.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Justice  I have requested the information sought by the Deputy from the Garda authorities. Regrettably, this was not available in time and I will write to the Deputy once the information is to hand. ",
        "showAs": " 792. Deputy Jim O'Callaghan asked the Minister for Justice the number of new Garda cars and vans attached to each Garda district within DMR to date in 2024, in tabular form; and if she will make a statement on the matter. [45069/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 793,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_793",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_747",
          "showAs": "An Garda Síochána",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_747",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_747.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Justice  As the Deputy may be aware, under the Garda Síochána Act 2005, the Garda Commissioner is responsible for managing and controlling the administration and business of An Garda Síochána and for the allocation of Garda resources, in light of operational demands. This includes responsibility for the allocation of equipment among the various Garda divisions. As Minister, I have no direct role in that matter.  While the Commissioner is responsible for the management of Garda resources, I am in regular contact with him to ensure he has the resources needed to keep people safe. This commitment to supporting An Garda Síochána is reflected in the unprecedented allocation of €2.48 billion in Budget 2024, a 27% increase since 2020. This level of funding is allowing for sustained investment in recruitment, equipment and technology.  I have been informed by Garda authorities that the implementation of mobile fingerprint capabilities is dependent on the implementation of a new biometric (including fingerprint) identification system, which would meet the needs of my Department and Justice Sector agencies.  The requirement for the proposed new system was identified in a report commissioned by my Department. Officials within my Department are currently considering this report and any next steps required. ",
        "showAs": " 793. Deputy Jim O'Callaghan asked the Minister for Justice if funding will be provided for mobile fingerprint devices to be made available to frontline Gardaí; and if she will make a statement on the matter. [45070/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 794,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_794",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_748",
          "showAs": "An Garda Síochána",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_748",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_748.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Justice  As the Deputy will be aware, under the Garda Síochána Act 2005 (as amended), the Garda Commissioner is responsible for the management and administration of An Garda Síochána, including the purchase, allocation, and effective and efficient use of Garda vehicles. As Minister, I have no role in these independent functions.  The unprecedented allocation of over €2.48 billion for 2025 to An Garda Síochána demonstrates the Government's commitment to ensuring An Garda Síochána has provision for the equipment, technology, facilities, fleet and personnel it needs to carry out vital policing work.  There are now over 3,500 Garda vehicles. This is the largest fleet ever available to An Garda Síochána and represents a 34% increase since 2015.  The below table, provided to me by the Garda authorities, details the number of unmarked motorcycles allocated to and removed from the Garda fleet in 2023 and as of 31 October 2024. I am further advised that the purchase and allocation of vehicles by An Garda Síochána is made on the basis of identified operational demands, the availability of resources and is reviewed on a continual basis.     Year    Allocated    Removed      2023    0    0      2024 as on 31 October    1    0    ",
        "showAs": " 794. Deputy Jim O'Callaghan asked the Minister for Justice the number of new unmarked motorcycles added to the Garda fleet in the years of 2023 and to date in 2024; the number of unmarked motorcycles withdrawn from the fleet during same period, in tabular form; and if she will make a statement on the matter. [45071/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 795,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_795",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_749",
          "showAs": "Road Traffic Accidents",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_749",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_749.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Justice  Road safety is a shared responsibility, and while the whole of Government response is led by the Department of Transport, it is one which is taken very seriously across Government. I continue to engage with colleagues across Government to ensure that every effort is made to increase safety on our roads.  As the Deputy may be aware, road traffic laws are enforced by Gardaí assigned to Roads Policing and as part of the day-to-day duties of uniformed Gardaí nationwide. This includes a programme of high-visibility road safety and enforcement operations carried out in partnership with other state agencies.  After a shocking and tragic first quarter of the year, the Garda Commissioner has responded effectively and directed that all uniformed Gardaí are to undertake 30 minute of high visibility roads policing in each tour of duty. This increase in enforcement is, thankfully, correlated with a slowing down of that upward trend in the number of road fatalities.  Of course, all loss of life is a tragedy, and it is important that none of us become complacent.  I am advised by the Garda authorities that there have been a total of two fatal or serious injury collisions on the M50 between Junctions 7 and 11 this year. These figures are based on incidents occurring from 1 January 2024 to 31 October 2024, inclusive. ",
        "showAs": " 795. Deputy Jim O'Callaghan asked the Minister for Justice the number of serious and fatal road traffic collisions that Gardaí attended between Junctions 7-11 on M50 in both directions to date in 2024; and if she will make a statement on the matter. [45072/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 796,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_796",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_750",
          "showAs": "Road Traffic Offences",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_750",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_750.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Justice  As the Deputy will be aware, under the Garda Síochána Act 2005 (as amended), the Garda Commissioner is responsible for the administration and management of An Garda Síochána, including the recording of traffic offences, collisions and seizures of vehicles. As Minister, I have no role in such matters.  The unprecedented allocation of over €2.48 billion in Budget 2025 to An Garda Síochána demonstrates the Government's commitment to ensuring An Garda Síochána has provision for the equipment, technology, facilities, fleet and personnel it needs to carry out vital policing work.  I have been informed by the Garda authorities that 177 vehicles were seized for having no insurance in the Y district in 2023, and in 2024 up until the 30 October, a total of 215 vehicles were seized.  I am further informed that these vehicles were seized under section 41 of the Road Traffic Act.  I am informed that the figures provided are based on incidents which occurred from 1 January 2023 up until the 30 October 2024 inclusive.  All information contained in this report is based upon operational data from the Pulse system as was available on 31 October 2024 and is liable to change. ",
        "showAs": " 796. Deputy Jim O'Callaghan asked the Minister for Justice the number of vehicles seized for having no insurance within the Garda Y district in the years of 2023 and to date in 2024, in tabular form; and if she will make a statement on the matter. [45073/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 797,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_797",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_751",
          "showAs": "An Garda Síochána",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_751",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_751.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Justice  I have requested the information sought by the Deputy from the Garda authorities. Regrettably, this was not available in time and I will write to the Deputy once the information is to hand. ",
        "showAs": " 797. Deputy Jim O'Callaghan asked the Minister for Justice the number of public order instructor courses held for Gardaí within the DMR region in the years of 2023 and to date in 2024; the number of these courses that are scheduled to be held between now and year-end, in tabular form; and if she will make a statement on the matter. [45074/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 798,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_798",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_752",
          "showAs": "Age Identity Cards",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_752",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_752.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Justice  As the Deputy will be aware, the Garda Commissioner is responsible for the management and administration of Garda business under Section 26 of the Garda Síochána Act 2005 (as amended), which includes the administration of the Garda Age Card scheme. As Minister, I have no role in the issuing of Age Cards.  I advised by the Garda authorities that the Intoxicating Liquor Act 1988 (Age Card) Regulations 2010 provides for a voluntary Age Card scheme which can be obtained by individuals aged 18 and over to show that they have reached the legal age for purchasing alcohol.  The scheme is an important proof-of-age mechanism and has in co-operation with the licensed trade, helped to combat underage consumption of intoxicating liquor. The Garda National Youth Diversion Bureau (GNYDB) have responsibility for the Age Card scheme on behalf of An Garda Síochána.  Applications for the card are made online via the Age Card website (www.agecard.ie). The current fee for an Age Card is €10.  The number of age cards issued for 2024 up until 31 October 2024 is as follows:     YEAR    Age Cards Issued      2024    19,177    ",
        "showAs": " 798. Deputy Jim O'Callaghan asked the Minister for Justice the number of Garda age ID cards issued to date in 2024; and if she will make a statement on the matter. [45075/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 799,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_799",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_753",
          "showAs": "Bench Warrants",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_753",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_753.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Justice",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Justice  As the Deputy will appreciate, difficulties in relation to the execution of warrants, including bench warrants, are a long-standing issue for many police services around the world; notably relating to persons actively seeking to evade detection and where limited identification information might be available to support enforcement.  I am assured, however, that An Garda Síochána executes warrants as expeditiously as possible, giving priority to the execution of warrants relating to serious crimes.  The Deputy will also appreciate that the figure for outstanding bench warrants recorded by PULSE at any given time reflects an accumulation of old bench warrants which have arisen over the years. Therefore, the total figure for outstanding bench warrants as shown on PULSE may not be a reliable indicator of the number of 'live' warrants which are actually enforceable.  I am advised by the Garda authorities that the table below shows the number of bench warrants that were outstanding on the 29 October 2024 in Store Street District (C District).     Store Street (C District)    Outstanding    9 Months or Older      Bench Warrant    2,716    2,229     The figures provided were collated based on data from PULSE as of 31 October 2024. They are operational and liable to change. ",
        "showAs": " 799. Deputy Jim O'Callaghan asked the Minister for Justice the number of bench warrants that are currently outstanding in the Garda C district within DMR as of 29 October 2024; of the number of bench warrants, the number that have been outstanding for periods of nine months or more, in tabular form; and if she will make a statement on the matter. [45076/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 955,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_955",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_909",
          "showAs": "Childcare Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_909",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_909.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  I propose to take Questions Nos. 955, 956, 957, 958 and 959 together.  Due to their similarity PQs 44904/24, 44905/24, 44906/24, 44907/24 and 44908/24 will be taken together.  There are two types of subsidies available under the National Childcare Scheme:  • Universal Subsidies are available to all families with children under 15 years old. This subsidy is not means tested and provides €2.14 per hour towards the cost of a registered childcare place for a maximum of 45 hours per week.  • Income Assessed Subsidies are available to families with children aged between 24 weeks and 15 years. This subsidy is means tested and will be calculated based on individual circumstances. The rate will vary depending on the level of family income, child age and educational stage, and the number of children in a family.  This Department does not hold individualised fee data for parents as these are local agreements between parents and providers; instead a reduction in the average cost of ELC to parents is examined. To estimate this cost, data from Pobal on average weekly fees across the country was used. To achieve the desired reductions in fees, increases to the NCS universal subsidy were examined.  As these costings are based on an average fee, the impact of these changes would vary based on the level of fees within the services, patterns of usage and age of the child. The below estimates have been costed as such that all children in the scheme will have their costs reduced to at least the target value per month, in some cases the reduction will be greater.  The ESRI SWITCH model was then used to estimate the quantum of these changes and applied to the Departments baseline cost of the NCS. The results are given below in tabular form.     Max fees per month    NCS Universal Subsidy    Cost of change      Baseline    €2.14         150    €3.62    €234.10m      200    €3.36    €193.65m      250    €3.11    €154.57m      300    €2.85    €113.89m      350    €2.59    €72.86m     These estimates comes with a number of caveats, from September 2024 a number of enhancements were made to the NCS, the estimates factor in these changes:  Increase in universal subsidy from €1.40 to €2.14.  Extension of NCS to families availing of childminders  Increase in NCS sponsor subsidy to €5.30 per hour for all children over the age of 1.  The impact of these changes are yet to be determined and carry a risk of altering the above costings due to increased participation of childminders for example. As such extensions to the scheme are based on estimates.  In addition, this costing is made on the basis of a static system; that is, the model assumes that the level of usage of eligible ELC does not increase or decrease but remains static. Any changes to subsidies may create a change in behaviour of families, for example, return to/increased labour force participation and use of formal ELC for the first time. ",
        "showAs": " 955. Deputy Jim O'Callaghan asked the Minister for Children, Equality, Disability, Integration and Youth the estimated full year cost of reducing the maximum cost of childcare to €150 per child per month. [44904/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 956,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_956",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_909",
          "showAs": "Childcare Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_909",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_909.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  I propose to take Questions Nos. 955, 956, 957, 958 and 959 together.  Due to their similarity PQs 44904/24, 44905/24, 44906/24, 44907/24 and 44908/24 will be taken together.  There are two types of subsidies available under the National Childcare Scheme:  • Universal Subsidies are available to all families with children under 15 years old. This subsidy is not means tested and provides €2.14 per hour towards the cost of a registered childcare place for a maximum of 45 hours per week.  • Income Assessed Subsidies are available to families with children aged between 24 weeks and 15 years. This subsidy is means tested and will be calculated based on individual circumstances. The rate will vary depending on the level of family income, child age and educational stage, and the number of children in a family.  This Department does not hold individualised fee data for parents as these are local agreements between parents and providers; instead a reduction in the average cost of ELC to parents is examined. To estimate this cost, data from Pobal on average weekly fees across the country was used. To achieve the desired reductions in fees, increases to the NCS universal subsidy were examined.  As these costings are based on an average fee, the impact of these changes would vary based on the level of fees within the services, patterns of usage and age of the child. The below estimates have been costed as such that all children in the scheme will have their costs reduced to at least the target value per month, in some cases the reduction will be greater.  The ESRI SWITCH model was then used to estimate the quantum of these changes and applied to the Departments baseline cost of the NCS. The results are given below in tabular form.     Max fees per month    NCS Universal Subsidy    Cost of change      Baseline    €2.14         150    €3.62    €234.10m      200    €3.36    €193.65m      250    €3.11    €154.57m      300    €2.85    €113.89m      350    €2.59    €72.86m     These estimates comes with a number of caveats, from September 2024 a number of enhancements were made to the NCS, the estimates factor in these changes:  Increase in universal subsidy from €1.40 to €2.14.  Extension of NCS to families availing of childminders  Increase in NCS sponsor subsidy to €5.30 per hour for all children over the age of 1.  The impact of these changes are yet to be determined and carry a risk of altering the above costings due to increased participation of childminders for example. As such extensions to the scheme are based on estimates.  In addition, this costing is made on the basis of a static system; that is, the model assumes that the level of usage of eligible ELC does not increase or decrease but remains static. Any changes to subsidies may create a change in behaviour of families, for example, return to/increased labour force participation and use of formal ELC for the first time. ",
        "showAs": " 956. Deputy Jim O'Callaghan asked the Minister for Children, Equality, Disability, Integration and Youth the estimated full year cost of reducing the maximum cost of childcare to €200 per child per month. [44905/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 957,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_957",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_909",
          "showAs": "Childcare Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_909",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_909.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  I propose to take Questions Nos. 955, 956, 957, 958 and 959 together.  Due to their similarity PQs 44904/24, 44905/24, 44906/24, 44907/24 and 44908/24 will be taken together.  There are two types of subsidies available under the National Childcare Scheme:  • Universal Subsidies are available to all families with children under 15 years old. This subsidy is not means tested and provides €2.14 per hour towards the cost of a registered childcare place for a maximum of 45 hours per week.  • Income Assessed Subsidies are available to families with children aged between 24 weeks and 15 years. This subsidy is means tested and will be calculated based on individual circumstances. The rate will vary depending on the level of family income, child age and educational stage, and the number of children in a family.  This Department does not hold individualised fee data for parents as these are local agreements between parents and providers; instead a reduction in the average cost of ELC to parents is examined. To estimate this cost, data from Pobal on average weekly fees across the country was used. To achieve the desired reductions in fees, increases to the NCS universal subsidy were examined.  As these costings are based on an average fee, the impact of these changes would vary based on the level of fees within the services, patterns of usage and age of the child. The below estimates have been costed as such that all children in the scheme will have their costs reduced to at least the target value per month, in some cases the reduction will be greater.  The ESRI SWITCH model was then used to estimate the quantum of these changes and applied to the Departments baseline cost of the NCS. The results are given below in tabular form.     Max fees per month    NCS Universal Subsidy    Cost of change      Baseline    €2.14         150    €3.62    €234.10m      200    €3.36    €193.65m      250    €3.11    €154.57m      300    €2.85    €113.89m      350    €2.59    €72.86m     These estimates comes with a number of caveats, from September 2024 a number of enhancements were made to the NCS, the estimates factor in these changes:  Increase in universal subsidy from €1.40 to €2.14.  Extension of NCS to families availing of childminders  Increase in NCS sponsor subsidy to €5.30 per hour for all children over the age of 1.  The impact of these changes are yet to be determined and carry a risk of altering the above costings due to increased participation of childminders for example. As such extensions to the scheme are based on estimates.  In addition, this costing is made on the basis of a static system; that is, the model assumes that the level of usage of eligible ELC does not increase or decrease but remains static. Any changes to subsidies may create a change in behaviour of families, for example, return to/increased labour force participation and use of formal ELC for the first time. ",
        "showAs": " 957. Deputy Jim O'Callaghan asked the Minister for Children, Equality, Disability, Integration and Youth the estimated full year cost of reducing the maximum cost of childcare to €250 per child per month. [44906/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 958,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_958",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_909",
          "showAs": "Childcare Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_909",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_909.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  I propose to take Questions Nos. 955, 956, 957, 958 and 959 together.  Due to their similarity PQs 44904/24, 44905/24, 44906/24, 44907/24 and 44908/24 will be taken together.  There are two types of subsidies available under the National Childcare Scheme:  • Universal Subsidies are available to all families with children under 15 years old. This subsidy is not means tested and provides €2.14 per hour towards the cost of a registered childcare place for a maximum of 45 hours per week.  • Income Assessed Subsidies are available to families with children aged between 24 weeks and 15 years. This subsidy is means tested and will be calculated based on individual circumstances. The rate will vary depending on the level of family income, child age and educational stage, and the number of children in a family.  This Department does not hold individualised fee data for parents as these are local agreements between parents and providers; instead a reduction in the average cost of ELC to parents is examined. To estimate this cost, data from Pobal on average weekly fees across the country was used. To achieve the desired reductions in fees, increases to the NCS universal subsidy were examined.  As these costings are based on an average fee, the impact of these changes would vary based on the level of fees within the services, patterns of usage and age of the child. The below estimates have been costed as such that all children in the scheme will have their costs reduced to at least the target value per month, in some cases the reduction will be greater.  The ESRI SWITCH model was then used to estimate the quantum of these changes and applied to the Departments baseline cost of the NCS. The results are given below in tabular form.     Max fees per month    NCS Universal Subsidy    Cost of change      Baseline    €2.14         150    €3.62    €234.10m      200    €3.36    €193.65m      250    €3.11    €154.57m      300    €2.85    €113.89m      350    €2.59    €72.86m     These estimates comes with a number of caveats, from September 2024 a number of enhancements were made to the NCS, the estimates factor in these changes:  Increase in universal subsidy from €1.40 to €2.14.  Extension of NCS to families availing of childminders  Increase in NCS sponsor subsidy to €5.30 per hour for all children over the age of 1.  The impact of these changes are yet to be determined and carry a risk of altering the above costings due to increased participation of childminders for example. As such extensions to the scheme are based on estimates.  In addition, this costing is made on the basis of a static system; that is, the model assumes that the level of usage of eligible ELC does not increase or decrease but remains static. Any changes to subsidies may create a change in behaviour of families, for example, return to/increased labour force participation and use of formal ELC for the first time. ",
        "showAs": " 958. Deputy Jim O'Callaghan asked the Minister for Children, Equality, Disability, Integration and Youth the full year cost of reducing the maximum cost of childcare to €300 per child per month. [44907/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 959,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_959",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_909",
          "showAs": "Childcare Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_909",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_909.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  I propose to take Questions Nos. 955, 956, 957, 958 and 959 together.  Due to their similarity PQs 44904/24, 44905/24, 44906/24, 44907/24 and 44908/24 will be taken together.  There are two types of subsidies available under the National Childcare Scheme:  • Universal Subsidies are available to all families with children under 15 years old. This subsidy is not means tested and provides €2.14 per hour towards the cost of a registered childcare place for a maximum of 45 hours per week.  • Income Assessed Subsidies are available to families with children aged between 24 weeks and 15 years. This subsidy is means tested and will be calculated based on individual circumstances. The rate will vary depending on the level of family income, child age and educational stage, and the number of children in a family.  This Department does not hold individualised fee data for parents as these are local agreements between parents and providers; instead a reduction in the average cost of ELC to parents is examined. To estimate this cost, data from Pobal on average weekly fees across the country was used. To achieve the desired reductions in fees, increases to the NCS universal subsidy were examined.  As these costings are based on an average fee, the impact of these changes would vary based on the level of fees within the services, patterns of usage and age of the child. The below estimates have been costed as such that all children in the scheme will have their costs reduced to at least the target value per month, in some cases the reduction will be greater.  The ESRI SWITCH model was then used to estimate the quantum of these changes and applied to the Departments baseline cost of the NCS. The results are given below in tabular form.     Max fees per month    NCS Universal Subsidy    Cost of change      Baseline    €2.14         150    €3.62    €234.10m      200    €3.36    €193.65m      250    €3.11    €154.57m      300    €2.85    €113.89m      350    €2.59    €72.86m     These estimates comes with a number of caveats, from September 2024 a number of enhancements were made to the NCS, the estimates factor in these changes:  Increase in universal subsidy from €1.40 to €2.14.  Extension of NCS to families availing of childminders  Increase in NCS sponsor subsidy to €5.30 per hour for all children over the age of 1.  The impact of these changes are yet to be determined and carry a risk of altering the above costings due to increased participation of childminders for example. As such extensions to the scheme are based on estimates.  In addition, this costing is made on the basis of a static system; that is, the model assumes that the level of usage of eligible ELC does not increase or decrease but remains static. Any changes to subsidies may create a change in behaviour of families, for example, return to/increased labour force participation and use of formal ELC for the first time. ",
        "showAs": " 959. Deputy Jim O'Callaghan asked the Minister for Children, Equality, Disability, Integration and Youth the estimated full year cost of reducing the maximum cost of childcare to €350 per child per month. [44908/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 960,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_960",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_910",
          "showAs": "Childcare Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_910",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_910.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  This question requests the cost of reducing childcare fees so that families pay no more than €400 per week.  The NCS Universal Subsidy is available to all families with children under 15 years old. This subsidy is not means tested and provides €2.14 per hour towards the cost of a registered childcare place for a maximum of 45 hours per week.  This Department does not hold individualised fee data for parents as these are local agreements between parents and providers; instead a reduction in the average cost of ELC to parents is examined. To estimate these costs, data from Pobal on average weekly fees across the country was used.  The NCS is not currently designed to apply subsidies at family level and it is necessary to make some assumptions to support such a model. To ensure a cap of €400 per month for all families, data from Pobal on the number of children per family availing of the NCS was used. The first or only child in a family had their fees capped at €400 euro per month. This cap requires an increase to the universal subsidy for these children to €2.34 per hour. All children that are not the first child in the family had their universal subsidy set to the average weekly fee, which will theoretically cover their entire fee for full-time provision when averaged nationally.  As these costings are based on an average fee, the impact of this change would vary based on the level of fees within the services, patterns of usage and age of the child. The below estimates have been costed such that all families will have their costs reduced to at least €400 per month, in some cases the reduction will be greater.  The ESRI SWITCH model was then used to estimate the quantum of this change and applied to the Departments baseline cost of the NCS. The full year cost of this change was estimated at €121.65m.  This estimate come with a number of caveats, from September 2024 a number of enhancements were made to the NCS, the estimates factor in these changes:  Increase in universal subsidy from €1.40 to €2.14.  Extension of NCS to families availing of childminders  Increase in NCS sponsor subsidy to €5.30 per hour for all children over the age of 1.  The impact of these changes are yet to be determined and carry a risk of altering the above costings due to increased participation of childminders for example. As such extensions to the scheme are based on estimates.  As has been referenced previously the above costing is based on an average fee, the Department is aware of significant variation in fees but without enough information must use an average. The distribution of costs for first/only children versus additional children is based on current Pobal data, if this distribution were to change through increased NCS participation or more children per family availing of the NCS this cost would increase significantly.  Finally, this costing is made on the basis of a static system; that is, the model assumes that the level of usage of eligible ELC does not increase or decrease but remains static. Any changes to subsidies may create a change in behaviour of families, for example, return to/increased labour force participation and use of formal ELC for the first time. ",
        "showAs": " 960. Deputy Jim O'Callaghan asked the Minister for Children, Equality, Disability, Integration and Youth the estimated full year cost of reducing the maximum cost of childcare to €400 per family per month. [44910/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 961,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_961",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_911",
          "showAs": "Childcare Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_911",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_911.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  This question requests the cost of reducing childcare fees so that families pay no more than €500 per month.  The NCS Universal Subsidy is available to all families with children under 15 years old. This subsidy is not means tested and provides €2.14 per hour towards the cost of a registered childcare place for a maximum of 45 hours per week.  This Department does not hold individualised fee data for parents as these are local agreements between parents and providers; instead a reduction in the average cost of ELC to parents is examined. To estimate these costs, data from Pobal on average weekly fees across the country was used.  The NCS is not currently designed to apply subsidies at family level and it is necessary to make some assumptions to support such a model. To ensure a cap of €500 per month for all families, data from Pobal on the number of children per family availing of the NCS was used. The first or only child in a family had their fees capped at €500 euro per month.  Under the current NCS universal subsidy and based on the national average fee for full time childcare, families currently do not pay more than €500 per month for a single child. Because of this, the additional cost of this change is as a result of children that are not the first or only child claiming NCS in their family. These children had their universal subsidy set to the average weekly fee, which will theoretically cover their entire fee for full-time provision when averaged nationally. The universal subsidy for the first children in these multiple children families were adjusted down to reflect the €500 cap.  As these costings are based on an average fee, the impact of this change would vary based on the level of fees within the services, patterns of usage and age of the child. The below estimate has been costed such that all families will have their costs reduced to at least €500 per month, in some cases the reduction will be greater.  The ESRI SWITCH model was then used to estimate the quantum of this change and applied to the Departments baseline cost of the NCS. The full year cost of this change was estimated at €82.64m.  This estimate comes with a number of caveats, from September 2024 a number of enhancements were made to the NCS, the estimates factor in these changes:  Increase in universal subsidy from €1.40 to €2.14.  Extension of NCS to families availing of childminders.  Increase in NCS sponsor subsidy to €5.30 per hour for all children over the age of 1.  The impact of these changes are yet to be determined and carry a risk of altering the above costings due to increased participation of childminders for example. As such extensions to the scheme are based on estimates.  As has been referenced previously the above costing is based on an average fee, the Department is aware of significant variation in fees but without enough information must use an average. The distribution of costs for first/only children versus additional children is based on current Pobal data, if this distribution were to change through increased NCS participation or more children per family availing of the NCS this cost would increase significantly.  Finally, this costing is made on the basis of a static system; that is, the model assumes that the level of usage of eligible ELC does not increase or decrease but remains static. Any changes to subsidies may create a change in behaviour of families, for example, return to/increased labour force participation and use of formal ELC for the first time. ",
        "showAs": " 961. Deputy Jim O'Callaghan asked the Minister for Children, Equality, Disability, Integration and Youth the estimated full year cost of reducing the maximum cost of childcare to €500 per family per month. [44911/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 962,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_962",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_912",
          "showAs": "Childcare Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_912",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_912.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Children, Equality, Disability, Integration and Youth  I firmly believe the level of pay for early years educators and school-age childcare practitioners should reflect the value of their work for children, families, society and the economy.  The State is not the employer and therefore does not set the pay or conditions for employees in either early learning and care (ELC) or school-age childcare (SAC) services.  However, there is now, through the Joint Labour Committee (JLC) process, a formal mechanism established by which employer and employee representatives can negotiate minimum pay rates for ELC and SAC services, which are set down in Employment Regulation Orders (EROs). This is an independent process from the Department and neither I, nor my officials, have any role in the proceedings of the JLC and any associated negotiated minimum pay rates, the cost of which is borne by the employer.  Outcomes of the JLC negotiations are supported via the Governments Core Funding scheme. Among other objectives, Core Funding supports the ability of service providers to meet the additional costs resulting from the EROs for Early Years Services, as it provides increases in funding to early learning and childcare service providers to support improvements in staff wages, alongside a commitment to freeze parental fees.  On the basis of 2024 data supplied by Partner Services taking part in the Core Funding scheme, the estimated annual costs to employers of raising all the minimum pay rates specified in the EROs (for different grades and qualification levels) by the rates proposed in the question (making assumptions specified below in relation to equivalent increases for other roles specified in the EROs) are set out in the table:     % increase    Estimated Costs      5    €31,563,747.00      10    €72,089,481.00      15    €118,570,211.00      20    €168,639,653.00      25    €220,360,894.00     In relation to the estimates above, the following should be noted:  * The cost estimates are based on staff who had an hourly wage recorded in service providers’ submissions for Core Funding, but the Core Funding data has been extrapolated to provide an estimate for all staff working in the sector.  * Cost estimates are based on the most recent data available to the Department which was provided by service providers in May 2024, this data was provided prior to the new EROs for Early Years Services came into force on June 24th.  * Calculations are there based on minimum rates of pat set out in the initial ERO which came into effect in June 2024.  * The estimated costs are for the additional cost to employers of bringing staff, from their current wage or the minimum pay rates set out in the first EROs, whichever is higher, up to the new pay rate as listed in the request. E.g., for an early year’s educator, costs are estimated based on current rate of pay up to 5% above the current ERO rate for that role (ERO minimum rate for Educators 13.65+ increased listed of 5% = increase of 68c).  * Calculations are based on wage-data available at a point in time. Some services may have increased wages more recently, which would reduce the cost to services of moving from current wage-rates to the proposed wage rates in the question.  * The cost estimates only relate to staff and managers covered by the current EROs, i.e., the estimates exclude the cost of ancillary staff.  * The cost estimates do not attempt to account for the potential cost implications for the wages of staff who are currently earning more than the increased rates above current ERO minimum rates.  * It should be noted that the figures in the table are the additional cost to employers, rather than the additional costs to the State. Core Funding offers a contribution to staff costs. The €313m allocated for Core Funding may already support some employers to pay wage rates above ERO minimum rates.  * The figures in the table do not take into account the income currently received by those working in the sector who are self-employed and who derive their income from profits rather than wages. ",
        "showAs": " 962. Deputy Jim O'Callaghan asked the Minister for Children, Equality, Disability, Integration and Youth the estimated full year cost of increasing pay for childcare staff by 5%, 10%, 15%, 20%, and 25%, respectively. [44912/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 1012,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_1012",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_959",
          "showAs": "Dental Services ",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_959",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_959.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly. ",
        "showAs": " 1012. Deputy Jim O'Callaghan asked the Minister for Health the total number of children referred for dental extraction under general anaesthetic, per CHO area, for the years 2018 to 2024, in tabular form; and if he will make a statement on the matter. [43981/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 1013,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_1013",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_960",
          "showAs": "Dental Services ",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_960",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_960.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly. ",
        "showAs": " 1013. Deputy Jim O'Callaghan asked the Minister for Health the total number of children referred for four or more dental extractions under general anaesthetic, per CHO area, for the years 2018 to 2024, in tabular form; and if he will make a statement on the matter. [43982/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 1014,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_1014",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_961",
          "showAs": "Dental Services ",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_961",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_961.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly. ",
        "showAs": " 1014. Deputy Jim O'Callaghan asked the Minister for Health the total number of children referred for ten or more dental extractions under general anaesthetic, per CHO area, for the years 2018 to 2024, in tabular form; and if he will make a statement on the matter. [43983/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 1015,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_1015",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_962",
          "showAs": "Dental Services ",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_962",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_962.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly. ",
        "showAs": " 1015. Deputy Jim O'Callaghan asked the Minister for Health what service is available and accessible for children require restorative dental treatment under general anaesthetic in CHO 6, CHO 7 and CHO 9 and are not able to receive this care in Children’s Hospital Ireland; and if he will make a statement on the matter. [43984/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 1016,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_1016",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_963",
          "showAs": "Dental Services ",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_963",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_963.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  Officials in my Department engage with the HSE on an ongoing basis to understand and address the challenges in the provision of oral healthcare services. Some patients may require access to care under sedation to enable them to accept oral healthcare and treatment - which may include Inhalation Sedation, IV Sedation and General Anaesthetic.  General anaesthetic services for primary care oral healthcare patients are facilitated in a number of  locations. Most locations are HSE hospitals but in some cases lists are carried out in private  hospitals through local arrangements or access may involve the patient travelling to an  adjacent health region. Children with complex medical needs or who are under the age of 2  are referred to Our Lady’s Hospital Crumlin, and Temple Street Hospital.  The development of Oral Healthcare Services under General Anaesthesia at the Urgent Care Centre at Connolly Hospital is a joint development between HSE Oral Healthcare Services and Childrens Health Ireland (CHI) - who will provide clinical governance and continuity in patient pathways between primary care patients and those whose treatment is more appropriately provided through the CHI Consultant Oral Healthcare Service.  As an interface service between the HSE Oral Healthcare Services and CHI, completion and  commissioning of the unit requires the development of new patient care pathways, staffing  arrangements and service guidelines, the development of which is being undertaken against  a background of consolidation of existing children’s hospital units into a single service, as well as the transition to the Health Region model.  A level of investment in infrastructure and equipping has been completed, however, remaining  clinical governance and staffing arrangements for anaesthetic and nursing care need to be established in order to complete commissioning of the unit. ",
        "showAs": " 1016. Deputy Jim O'Callaghan asked the Minister for Health his plans for the Connolly Hospital paediatric dental general anaesthetic unit in James Connolly Hospital which was due to open in 2019 but has not opened since its construction and has remained idle; and if he will make a statement on the matter. [43985/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 1017,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_1017",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_964",
          "showAs": "Dental Services ",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_964",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_964.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly. ",
        "showAs": " 1017. Deputy Jim O'Callaghan asked the Minister for Health the number of vacancies of whole-time equivalent general dental surgeons, per CHO area, for the years 2018 to 2024, in tabular form; and if he will make a statement on the matter. [43986/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 1018,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_1018",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_966",
          "showAs": "Dental Services ",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_966",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_966.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly. ",
        "showAs": " 1018. Deputy Jim O'Callaghan asked the Minister for Health the number of vacancies of whole-time equivalent senior dental surgeons, per CHO area, for the years 2018 to 2024, in tabular form; and if he will make a statement on the matter. [43987/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 1019,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_1019",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_967",
          "showAs": "Dental Services ",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_967",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_967.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly. ",
        "showAs": " 1019. Deputy Jim O'Callaghan asked the Minister for Health the number of vacancies of whole-time equivalent principal dental surgeons, per CHO area, for the years 2018 to 2024, in tabular form; and if he will make a statement on the matter. [43988/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 1020,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_1020",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_968",
          "showAs": "Dental Services ",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_968",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_968.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly. ",
        "showAs": " 1020. Deputy Jim O'Callaghan asked the Minister for Health the number and percentage of eligible children in second and sixth class that were not targeted for dental screenings for the years 2018 to 2024, per LHO area, in tabular form; and if he will make a statement on the matter. [43989/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    },
    {
      "contextDate": "2024-11-05",
      "question": {
        "house": {
          "houseNo": "33",
          "showAs": "33rd Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33"
        },
        "questionNumber": 1021,
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2024-11-05/pq_1021",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_969",
          "showAs": "Dental Services ",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/dbsect_969",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2024-11-05/writtens/mul@/dbsect_969.xml"
            },
            "pdf": null
          }
        },
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly. ",
        "showAs": " 1021. Deputy Jim O'Callaghan asked the Minister for Health the number of dental treatment service scheme contracts held by private dentists, per LHO area, for the years 2018 to 2024, in tabular form; and if he will make a statement on the matter. [43990/24] ",
        "date": "2024-11-05",
        "by": {
          "showAs": "Jim O'Callaghan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Jim-O'Callaghan.D.2016-10-03",
          "memberCode": "Jim-O'Callaghan.D.2016-10-03"
        }
      }
    }
  ]
}