{
  "head": {
    "counts": {
      "questionCount": 156,
      "resultCount": 156
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The previous Action Plan for Insurance Reform, published in 2020, delivered substantial changes to reduce claims costs and create the conditions for a more competitive and affordable insurance market. Most notably, the rebalancing of the Duty of Care, reforming the Injuries Resolution Board (formerly PIAB) and the introduction of new Personal Injuries Guidelines.  There are clear indications that the market responded to the Government reform agenda. Key to this was the overhaul of the duty of care, the policy intent of which was to address ‘slips, trips and fall’ type claims, which are prevalent in the activity-based or heavy-footfall sectors. The Courts and Civil Law (Miscellaneous Provisions) Act 2023 further strengthened the duty of care, thereby helping to reduce the volume of costly litigation, particularly for “slips, trips and falls” cases that disproportionately affect hospitality and retail businesses. The National Claims Information Database (NCID), operated by the Central Bank of Ireland, also provides independent and transparent data on claims costs, settlement channels, and premium trends.  While certain reforms have begun to stabilise award levels, delays in litigation and wider inflationary factors continue to impact premiums. The Programme for Government commits to a comprehensive series of actions aimed at enhancing affordability, availability and transparency across the insurance sector. One of the first steps to deliver on these commitments is the 2025 Action Plan for Insurance Reform, which was published by the Government on 24th July. This Action Plan sets out an updated and comprehensive suite of targeted measures to further improve affordability, availability, and transparency across the sector. Key actions include faster release of NCID data, enhanced reporting standards, and ongoing engagement with both domestic and international insurers to encourage greater competition in the market. Similarly, the Office to Promote Competition in the Insurance Market (OPCIM) has been active in seeking to restore insurance availability in sectors that previously struggled, such as equestrian activities, inflatable hire, adventure tourism, childcare, and high-footfall SMEs like pubs and hospitality.  Deepening and widening the supply of insurance and securing a sustainable insurance market is a key priority of Government to ensure broader availability and affordability across all types of insurance. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 200. Deputy Tony McCormack asked the Tánaiste and Minister for Finance if he is satisfied that insurance reforms are being passed on to SMEs and retailers, who continue to face high premiums; and if he will make a statement on the matter. [69878/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "showAs": "Tony McCormack"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_214",
          "debateSectionId": "dbsect_214",
          "showAs": "Insurance Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_214.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_200",
        "questionNumber": 200
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Deputy Jack Chambers  I thank Deputy McCormack for his question. Last week, the Government published the accelerating infrastructure report and action plan. This is a comprehensive programme of actions designed to speed up the delivery of critical infrastructure across the State. This action plan responds to well-documented challenges of lengthy development timelines, fragmented processes and rising costs. These have all been identified as major barriers to achieving Ireland’s housing, energy and climate objectives. The report is evidence-based. It has been built on the research and analysis of my Department, the views received during the public consultation and stakeholder engagement undertaken by my Department over the summer and the expert input and advice from the members of the accelerating infrastructure task force. The plan sets out 30 targeted actions grouped under four pillars, each addressing a key area of reform. The actions address the 12 barriers to the timely delivery of infrastructure that were highlighted in the report published by my Department in July.  A four-week online and in-person public consultation last summer supported the preparation of that report published in July by providing an opportunity for stakeholders and the general public from across the country to feed into this work. I hosted events during this consultation period, including a regional event in Athlone.  The actions selected represent a transformative approach to streamlining development processes and significantly reducing delivery timelines, ensuring a more efficient and timely delivery of critical infrastructure nationwide. Together, these actions will ensure the record investment under the national development plan translates into faster, more efficient delivery of housing, energy and transport infrastructure, supporting Ireland’s economic growth, climate commitments and Delivering Homes, Building Communities. This will benefit every county and region of Ireland, as infrastructure projects play an essential role in supporting Ireland’s balanced economic growth and meeting the demands of a rapidly expanding population.  There are considerable infrastructure projects under way in County Offaly. I am sure the Deputy is aware of the Edenderry wastewater treatment plant, a number of regeneration projects and education and schools' projects across the county and the work being undertaken in the context of transport investment. \n Deputy Tony McCormack  I thank the Minister. The accelerating infrastructure report and action plan outlines significant reforms aimed at improving delivery of major projects, including streamlining approval processes, a single decision pathway for water investment and stronger co-ordination across agencies. These reforms are welcome. For Offaly, infrastructure is key for future economic development, enterprise growth and balanced regional progress.  The water supply project for the eastern and midlands region is central to this and will cross Offaly, with Dunkerrin and Tullamore identified for future outtakes. However, the spur connections and local system upgrades required to utilise that supply are currently planned in later phases. If delivered sequentially, the benefit to Offaly could be realised an awful lot sooner. The cost of doing this work would be cheaper now than it would be if it is done in the future. We have seen from other projects previously, second phases sometimes do not proceed for many years. If we want balanced growth in the region, we need to do this now, rather than in a second phase. The key point is that Offaly needs that spur, those integration works and the wastewater upgrades delivered together as one co-ordinated package, not in separate phases. \n Deputy Jack Chambers  We are keen to ensure all infrastructure in the State, including in County Offaly, is accelerated. At present, it takes 15 years to build a road and it can take up to ten years to deliver wastewater and water infrastructure and seven or eight years for electricity or energy infrastructure. These timelines are all too long to meet the growing demands of our population and economy.  As regards the eastern midlands water supply project, which is of interest to the Deputy, this is an issue on which we can engage with Irish Water. Obviously, it is critical that we advance the project for the east and midlands more generally. Irish Water is working through how it can accelerate the planning of the project and ensure it can commence. Whatever can be done to drive its delivery will be critical for the future development and growth of the east, as well as ensuring basic water supply. I will ask the project design team to respond directly to the Deputy on the issues with phasing or sequencing. \n Deputy Tony McCormack  A core feature of the new infrastructure plan is to improve transparency and accountability. For Offaly, we need clear visibility that the Shannon pipeline spur and the wastewater upgrades are progressing together and not in staggered phases. Will the Minister commit to a county-level delivery reporting, so communities in Tullamore, Edenderry, Birr, Clara and Banagher can track progress and gain confidence that these projects will be delivered in one integrated programme, unlocking real regional development for Offaly? \n Deputy Brian Brennan  I hope when we look at rural infrastructure that we also look at areas that have not been supported before. To take a template of Arklow, the town is blessed to have one of the finest wastewater treatment plants in Europe. The population of the town is about to explode, however. There is a new data centre, offshore wind farms and thousands of houses planned but we have only one bridge. The town will choke if the infrastructure development does not match other development. I am speaking about infrastructure in terms of roads and bridges, but also social infrastructure. I appeal to the Minister to ensure areas that have not been supported before are looked after in this new programme. \n Deputy Jack Chambers  To respond first to Deputy McCormack, again, the whole focus is on driving delivery. I take his point on the role of that particular project in the east and midlands. We will engage with Irish Water on it. Obviously, we do not want to delay the current design, which could possibly hold back the project by a number of years. There is a need to accelerate its delivery because it is a critical project for the State.  To respond to Deputy Brennan, we have tried to complement the prioritisation we have given in the national development plan with social infrastructure.  We have record levels of investment in transport infrastructure in the State of €24 billion. The Minister for housing, Deputy Browne, has also set out proposals for an infrastructure fund to try to complement housing delivery to support the broader infrastructure where there is significant housing development and having that enabling infrastructure. If we look at the overall capital allocation for education, for example, it is €7.5 billion over the next five years. This is to ensure we continue development of critical education infrastructure across the State. We have had record funding, for example, on sports capital to ensure we have sports infrastructure built in communities. This is something we are continuing to commit to. ",
        "questionType": "oral",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 14. Deputy Tony McCormack asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the way in which the new infrastructure report will benefit County Offaly, particularly in terms of investment and regional development; and if he will make a statement on the matter. [70413/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "showAs": "Tony McCormack"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/dbsect_15",
          "debateSectionId": "dbsect_15",
          "showAs": "Regional Development",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/mul@/dbsect_15.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_14",
        "questionNumber": 14
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I propose to take Questions Nos. 22, 23, 29, 32, 38, 54, 57, 66, 74, 78, 79 and 80 together.  Last week, the Government published the Accelerating Infrastructure Report and Action Plan. This is a comprehensive programme of actions designed to speed up the delivery of critical infrastructure across the State. This Action Plan responds to well-documented challenges of lengthy development timelines, fragmented processes, and rising costs. These have all been identified as major barriers to achieving Ireland’s housing, energy, and climate objectives.  The report is evidence-based. It has been built on the research and analysis of my Department, the views received during the public consultation and stakeholder engagement undertaken by my Department over the summer, and the expert input and advice from the members of the Accelerating Infrastructure Taskforce.  The Plan sets out 30 targeted actions grouped under four pillars, each addressing a key area of reform. The actions address the twelve barriers to the timely delivery of infrastructure that were highlighted in the Report on Stakeholder Consultation and Engagement with Emerging Themes on Infrastructure , published by my department in July.  A four-week online and in-person public consultation last summer supported the preparation of that Report published in July, by providing an opportunity for stakeholders and the general public, from across the country, to feed into this work. I hosted events during this consultation period, including a regional event in Athlone.  The actions selected represent a transformative approach to streamlining development processes and significantly reducing delivery timelines, ensuring a more efficient and timely delivery of critical infrastructure nationwide.  Together, these actions will ensure that the record investment under the National Development Plan (NDP) translates into faster, more efficient delivery of housing, energy, and transport infrastructure, supporting Ireland’s economic growth, climate commitments and Delivering Homes, Building Communities. This will benefit every county and region of Ireland as infrastructure projects play an essential role in supporting Ireland’s balanced economic growth across all local areas and meeting the demands of a rapidly expanding population. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 38. Deputy Tony McCormack asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the way in which rural counties will be prioritised under the new infrastructure framework, particularly in relation to transport links, enterprise development and investment in public services; and if he will make a statement on the matter. [70414/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "showAs": "Tony McCormack"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_67",
          "debateSectionId": "dbsect_67",
          "showAs": "Strategic Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_67.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_38",
        "questionNumber": 38
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Online safety and the safe and ethical use of digital technologies, including social media, is a key component of the Department’s Digital Strategy for Schools. Under the strategy, Webwise, the Irish Internet Safety Awareness Centre, promotes the autonomous, effective and safe use of the internet through a sustained information and awareness strategy targeting school leaders, teachers, parents and children themselves.  Webwise is funded by the Department of Education and Youth and co-funded through the European Commission and is part of the Irish Safer Internet Centre. Webwise develops and disseminates resources that help teachers integrate digital citizenship and online safety into teaching and learning in their schools, both primary and post-primary. The [ webwise.ie ] resource includes a dedicated School/Teachers Hub, a Parents Hub and a Youth Hub. The School/Teachers Hub includes a range of curricular supports for teachers that they can use when teaching pupils/students about online safety  Webwise also run campaigns addressing key topical issues as they arise. With the help of the Webwise Youth Advisory Panel, Webwise develops youth-oriented awareness raising resources and training programmes.  In addition, Oide Technology in Education, the Department funded support service, supports the integration of digital competence, including aspects of digital wellbeing and online safety, where relevant across teacher professional learning programmes delivered through the Oide support service network.  The existing curriculum from early childhood to senior cycle offers multiple opportunities for the development of digital skills and digital literacy, as follows:  • The Primary Curriculum Framework outlines ‘being a digital learner’ as one of seven key competencies. This seeks to support children to become curious, creative, confident, and critical users of digital technology while fostering responsible, safe and ethical use of technology.  • The Primary Language Curriculum highlights the importance of Digital Literacy which supports the child’s ability to locate, select and critically analyse relevant information in text, visual and audio.  • The Science, Technology, Engineering and Mathematics (STEM) Education Curriculum, looks at scientific inquiry, computational thinking and design thinking.  • The Wellbeing curriculum has learning outcomes related to the Media and Digital Wellbeing promoting the safe and ethical use of technology.  Reform of the curriculum at all levels is also underway which will ensure that our young people are equipped with the necessary digital skills and literacy required to participate fully in society.  The updated Junior Cycle SPHE specification includes a number of learning outcomes that relate to social media and the online world, including for example that students should be able to assess the benefits and difficulties associated with their online world, as well as discussing how to share personal information, images, opinions and emotions in a safe, responsible and respectful manner online.  The updated Senior Cycle SPHE specification include outcomes stating that students should be able to demonstrate the awareness and skills needed for nurturing healthy in-person and online relationships.  Schools may also choose to offer short courses which explicitly focus on digital skills. The National Council for Curriculum and Assessment (NCCA) has developed a short course in Digital Media Literacy through which students will learn to use digital technology, to discriminate between multiple sources of information and to participate safely in an online environment. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 114. Deputy Tony McCormack asked the Minister for Education and Youth the way in which students are currently being educated around safe and responsible use of social media; the future plans or curriculum developments being considered in this area; and if she will make a statement on the matter. [70426/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "showAs": "Tony McCormack"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_136",
          "debateSectionId": "dbsect_136",
          "showAs": "Education Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_136.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_114",
        "questionNumber": 114
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school referred by the Deputy has been approved to enter the Department's pipeline for school building projects, to provide four mainstream classrooms, one construction room and a four classroom Special Educational Needs (SEN) base under the Additional School Accommodation (ASA) Scheme. The project is devolved for delivery to the school authority.  The project received my departments approval to Stage 2a (detailed design) of the architectural planning design process in May 2025. This stage must include the development of the design along with an accurate cost plan which best meets the design as agreed at Stage 1. It is now within the remit of the school to progress this project.  The length of time a project takes to deliver depends on several factors, including scale and complexity and is subject to the time it takes to progress through the various design stages, and the statutory approval process.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 173. Deputy Tony McCormack asked the Minister for Education and Youth for an update on the progress of the building application for a school (details supplied); and the expected timeline for advancement of the project; and if she will make a statement on the matter. [70427/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "showAs": "Tony McCormack"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_197",
          "debateSectionId": "dbsect_197",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_197.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_173",
        "questionNumber": 173
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Further and Higher Education, Research, Innovation and Science (Deputy Marian Harkin)  My Department is taking a coordinated and targeted approach to supporting digital literacy and improving access to online services for older people, primarily through the implementation of the Government’s Adult Literacy for Life Strategy.  This ten-year Strategy recognises that digital capability is essential for full participation in society. A strong programme of supports is being delivered across Further Education and Training and community-based provision. A target of reducing the share of adults without basic digital skills from 47% to 20% by 2030 has been set.  Through the Collaboration and Innovation and REACH Funds, a strong suite of initiatives is underway to support older people - including tailored digital skills courses, one-to-one help hubs in libraries and community-based peer mentoring. These programmes are designed to build confidence, functional skills and the ability to use digital tools for everyday tasks such as communicating, accessing information and navigating online services.  In 2025, SOLAS allocated over €176,000 to Age Action to deliver two programmes - the University of the Third Age and Digital Literacy Programme and the Getting Started Digital Skills Programme – both aimed at enhancing digital skills among older people.  In addition, SOLAS is supporting Generation Ireland to pilot digital upskilling programmes for mid-career and workers aged 55 and over. In 2025, €0.5 million was allocated via SOLAS with €0.4 million identified for 2026.  I want to assure the Deputy that I remain committed to ensuring that older people can access the skills, technology and support needed to engage confidently with online services to ensure no one in society is excluded. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 258. Deputy Tony McCormack asked the Minister for Further and Higher Education, Research, Innovation and Science the plans to support digital literacy and improve access to online services for older people; and if he will make a statement on the matter. [64109/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "showAs": "Tony McCormack"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_271",
          "debateSectionId": "dbsect_271",
          "showAs": "Education and Training Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_271.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_258",
        "questionNumber": 258
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I am committed to supporting the delivery and development of youth services and youth-led community initiatives in Offaly, ensuring that both rural and urban communities benefit from these investments. Such services are central to fostering inclusion, participation, and leadership among young people. To achieve this, the department channels youth funding through the 16 Education and Training Boards (ETBs), which administer resources on our behalf. Funding is allocated annually to each ETB for youth services across their functional areas, rather than on a county-by-county basis. In this way, services in Offaly are supported through the allocations made to Laois and Offaly ETB (LOETB).  The department has made a significant investment in youth services in the LOETB area, with total funding rising from over €467,000 in 2020 to more than €890,000 in 2025. This represents an increase of over 91%, reflecting the Government’s commitment to strengthening youth provision and ensuring that young people in both rural and urban communities have access to quality supports and facilities.  The UBU Your Place Your Space scheme provides targeted youth funding to young people aged between 10 and 24 years who are identified as marginalised, vulnerable, or at risk of not flourishing. Through the ETBs, UBU supports a wide range of youth services across the country, ensuring that resources are directed to where they are most needed.  In 2025, over €460,000 was allocated to LOETB under the UBU scheme. This funding supports a number of local youth organisations, including those working with young people in Offaly. In addition, a further €20,000 was provided to LOETB under the Resilience and Effectiveness Scheme to strengthen the capacity of UBU-funded organisations in the ETB area and to enable them to respond to emerging needs.  Budget 2025 also provided an additional €1.2 million nationally for the establishment of ten new UBU services, each designed to deliver youth worker-led supports to young people in areas of greatest need. LOETB submitted a proposal for a new service in County Laois, and following a competitive assessment process, I am pleased to say that funding was awarded for a new rural UBU service – UBU Laois Connect – which will operate across Mountmellick, Mountrath, Rathdowney and surrounding areas.  Alongside this, the department has worked with the Child Poverty and Wellbeing Office in the Department of the Taoiseach to pilot a Summer 2025 Holiday Meals Programme. This initiative was designed to address holiday hunger among young people engaged with UBU services during the school summer break. Forty-one youth services nationwide participated, including the Offaly Traveller Movement, which provided hot meals to young people at risk of not having access to a substantial meal during the holiday period, with a budget of over €22,000. An external evaluation of the pilot has been commissioned by Education and Training Boards Ireland and is currently under review by department officials.  The Targeted Youth Employability Support Initiative (TYESI) is designed to engage and support young people aged 15–24 who are not in education, employment or training, and who may face barriers to participation. The initiative provides tailored, youth worker-led interventions to build confidence, develop skills, and improve employability prospects. In 2025, funding of €60,000 was allocated to the Offaly Traveller Movement to deliver TYESI supports in the Birr and Tullamore areas. This investment enables young people from marginalised communities to access structured programmes locally, while also strengthening pathways into further education, training, and employment opportunities.  The Local Youth Club Grant Scheme (LYCGS) provides essential support to volunteer-led youth clubs across the country, enabling young people to participate in safe, inclusive activities within their own communities. In LOETB, funding under the scheme has increased from €82,544 in 2024 to €99,191 in 2025, representing a rise of 20.17%. This enhanced investment helps ensure that young people can continue to access youth clubs locally, while also supporting the retention and training of volunteer youth leaders who play a vital role in running these clubs. In 2024, over 1,200 young people took part in clubs in their communities across the LOETB area, supported by more than 300 youth leaders. Through the LYCGS, the department is committed to sustaining grassroots youth work and strengthening opportunities for young people in rural communities such as Offaly.  The newly launched Youth Night initiative took place on 21 November this year, providing an opportunity for young people and their communities to come together and celebrate youth work. The initiative was supported by funding of €22,000 to LOETB, enabling numerous youth clubs and services across the ETB area to open their doors to the public on the night. This event showcased the vibrancy of local youth services, highlighted the role of youth leaders, and encouraged wider community engagement with youth facilities.  Finally, I am pleased to announce that, arising from Budget 2026, an additional €8 million in current and capital funding has been allocated to support the sustainability and development of youth services. This investment strengthens the foundation for inclusive, high-quality provision — ensuring continuity, expanding reach, and enabling services to respond to the evolving needs of Ireland’s diverse youth population. Importantly, this includes young people in rural parts of County Offaly, where youth services and youth-led community initiatives play a vital role in fostering participation, leadership, and social inclusion.  The department remains committed to supporting youth work at both national and local levels, recognising the importance of community-based engagement in both rural and urban areas. The increased funding will enable universal and targeted youth services to continue delivering tailored supports and safe, welcoming spaces for young people in Offaly and across the country. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 401. Deputy Tony McCormack asked the Minister for Education and Youth the steps she is taking to support youth facilities and youth-led community initiatives in rural parts of Offaly; and if she will make a statement on the matter. [68168/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "showAs": "Tony McCormack"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_395",
          "debateSectionId": "dbsect_395",
          "showAs": "Youth Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_395.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_401",
        "questionNumber": 401
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Deputy Tony McCormack  Like my colleague Deputy Brennan, I wish the Tánaiste the best with his new portfolio and look forward to working with him. \n Deputy Simon Harris  I thank Deputy McCormack very much for his kind words. I look forward to working with him. I also very much welcome this question because while I look at it from the Department of Finance perspective now, previously in the Department of Foreign Affairs and Trade I engaged significantly on trade and tariffs at an EU level. It is so important we continue to, as he rightly says, monitor the impact all these issues have or could have on the Irish and European economies were there to be further changes.  I very much welcome that the EU and the US have reached a deal on reciprocal trade. This provides much-needed certainty, or at least more certainty, to exporters. That said, tariffs continue to represent a clear headwind to domestic activity, particularly given the highly globalised nature of our economy. Updated analysis on the impact of tariffs on the economy was conducted by my Department and the ESRI. It was published alongside budget 2026 to reflect the current global tariff landscape. In this analysis, the introduction of tariffs is estimated to reduce our modified domestic demand by around 1.25% over the medium term when compared with a scenario with no tariffs, so it is having an impact. This represents a moderation in growth rather than a decline in economic activity.  It is difficult at this stage to make a definitive assessment of the impact tariff changes are currently having on the Irish economy. In the first three quarters of the year GDP recorded double-digit growth on an annual basis. Front-loading of pharmaceutical exports to the US in anticipation of tariffs played a key role in driving headline activity in the opening months of the year. The continued strength of GDP in recent quarters suggests structural factors may also be at work, including significant underlying demand for a limited range of subcategories of pharmaceutical exports. My Department will continue to monitor developments in economic activity as more data becomes available. It is also important to say that forecast done by my Department was on this idea of a 15% tariff. We need to remember pharma is still at 0% because we have not yet had the outcome of the section 232 process and we need to monitor that very closely as well.  It is evident global trade has become increasingly less conducive to the free and open exchange that characterised recent decades. In responding to the more challenging trading environment, this Government remains committed to ensuring the continued competitiveness and resilience of the Irish economy - controlling what we can control. \n Deputy Tony McCormack  Gabhaim buíochas leis an Tánaiste. Our economy has shown remarkable resilience in recent years and Irish exports have held up strongly despite global tariff uncertainties. That is a credit to our businesses. However, SMEs and retailers are operating on very tight margins and tariff-linked increases in import costs risk eroding their competitiveness on the ground. Will the Tánaiste outline what steps his Department can take to support SMEs and retail businesses in managing tariff-related cost pressures in order that they can remain competitive, protect jobs and continue contributing so strongly to Ireland’s economic performance? \n Deputy Simon Harris  The Deputy is very much right. That is the reason we set up the Government trade forum. We have in the room now all relevant Departments, including mine, along with the Departments of Foreign Affairs and Trade, public expenditure, agriculture and enterprise. We also have the IDA and Enterprise Ireland meeting ISME, Chambers Ireland, IBEC, the American Chamber of Commerce Ireland and all the various agencies so we can continue to hear from the front line exactly what challenges they face.  We continue to see an economy that is growing despite the tariffs. We continue to see a significant amount of what we export being exempt from the tariffs but it is why we have taken a number of decisions to try to support Irish businesses and SMEs. It is why we took the decision on the VAT rate on hospitality. It was not popular with everybody in this House but it makes a real difference in supporting cafés, restaurants, hotels serving food and the rural pub. It is also why, through the NDP, we are investing significantly in the infrastructure our towns, villages and cities need to remain competitive. We also published an action plan on market diversification with supports available through Enterprise Ireland. \n Deputy Tony McCormack  One area feeling the impact of tariffs more directly is the Irish whiskey sector. Irish Distillers, Tullamore Dew and other smaller whiskey producers are paying higher tariff rates in the American market than Scotch producers while American bourbon enters the EU with no equivalent tariff. Irish whiskey is an export success story and a major employer across rural Ireland. Will the Tánaiste work closely with our EU partners to secure improved tariff conditions for Irish spirits so brands like Tullamore Dew can compete fairly and continue to grow on the world stage? \n Deputy Simon Harris  I absolutely will. The Deputy is right. This is the sector that got away from the final deal. I know from talking to the EU Commission and counterparts this is the next big priority for Europe because of course it affects us here via Tullamore Dew and Irish Distillers but it also affects France, Italy and other countries, as well as Scotland, if you like, outside the EU. This is an issue we as a country and as a Union would have liked to see in the deal. From my conversations with Secretary Lutnick and Ambassador Greer, President Trump's trade representative, what we all have to do now is show good faith in delivering on the agreement that is in place. That work is under way on both the EU and US sides. Then we have to sit down around a table again and see whether there are areas where it simply makes sense to do more.  The Deputy is right. I have been in Washington, New York and across the United States and there are Irish companies and distillers that would have made investments in the US that would have created US jobs but that have stopped or at least paused those as a result of the impact of the tariffs. President Trump's agenda is about creating more jobs in his country. We can help with that agenda but the 15% tariff is a problem in relation to that. ",
        "questionType": "oral",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 7. Deputy Tony McCormack asked the Tánaiste and Minister for Finance his assessment of the impact recent international tariff changes are having on the Irish economy; and if he will make a statement on the matter. [64103/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "showAs": "Tony McCormack"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/debate/dbsect_19",
          "debateSectionId": "dbsect_19",
          "showAs": "Trade Relations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/debate/mul@/dbsect_19.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_7",
        "questionNumber": 7
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Government remains fully committed to the continued reform of the insurance sector, as set out in the Action Plan for Insurance Reform 2025-2029, published in July of this year. However, neither I as the Tánaiste and Minister for Finance, nor the Central Bank of Ireland, can intervene in insurance pricing or provision under the EU's Solvency II Directive.  Reforms taken by the previous Government have already reduced the weight of personal injury claims in overall settlements, and improved the composition of claims costs. In 2019, personal injury costs made up 72 percent of total claim cost, while material damage made up 28 percent. Today, personal injury accounts for 46 percent, while damage accounts for 54 percent. The Personal Injuries Guidelines are also having a positive impact on claim settlement procedures, with 78 percent of all claims are being settled under the new Guidelines.  The Injuries Resolution Board also has an important role, and continues to be the fastest and most cost-effective way of resolving personal injury claims. Resolving cases outside the courts reduces both claim costs and settlement times - benefitting all policyholders and reducing premium costs.  Minister for State for Financial Services, Credit Unions, and Insurance, Robert Troy T.D., has regularly engaged with industry to stress the Government’s expectation that cost savings are reflected in lower premiums and broader coverage availability. The Government remains fully committed to the continued reform of the insurance sector to address costs and to enhance availability of insurance for consumers across Ireland. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 20. Deputy Tony McCormack asked the Tánaiste and Minister for Finance the plans to address the continuing high cost of motor insurance; and if he will make a statement on the matter. [64104/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "showAs": "Tony McCormack"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_40",
          "debateSectionId": "dbsect_40",
          "showAs": "Insurance Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_40.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_20",
        "questionNumber": 20
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  Under the Health Act 2004, the Health Service Executive (HSE) is required to manage and deliver, or arrange to be delivered on its behalf, health and personal social services. The Minister for Health is prohibited from directing the HSE to provide a treatment or a personal service to any individual or to confer eligibility on any individual.  In relation to the particular query raised, as this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1011. Deputy Tony McCormack asked the Minister for Health if a hospital appointment will be expedited for a person (details supplied). [69740/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "showAs": "Tony McCormack"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_836",
          "debateSectionId": "dbsect_836",
          "showAs": "Hospital Appointments Status",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_836.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1011",
        "questionNumber": 1011
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  Addressing the issue of rural isolation requires a range of responses across Government Departments and agencies. My Department has a number of funding programmes which help to address rural isolation issues in communities including Offaly, focusing on the value of communities and social inclusion within our communities.  My Department provides funding to tackle social isolation and support those in our communities in most need of assistance through schemes such as the Social Inclusion and Community Activation Programme (SICAP), the Community Services Programme (CSP), the Seniors Alert Scheme, and the Local Enhancement Programme (LEP).  SICAP is Ireland’s primary social inclusion funding intervention, delivered locally by Local Development Companies to help those in the greatest need access supports to enable participation in communities. Offaly Local Development Company operate a range of services and supports aimed a reducing social isolation.  My Department’s CSP currently supports over 420 community organisations to provide local social, economic and environmental services that meet identified needs and provide employment locally and address disadvantage, contributing to sustainable, inclusive and empowered communities. Examples of organisations operating in Offaly include:  • North Offaly Community Development Network (NOCDN) is supported through an allocation of €175,500 for 2025 to provide a range of services, including home and garden maintenance to older and vulnerable people throughout North Offaly.  • Offaly Integrated Local Development Company has been allocated €106,500 for 2025 to support a meals-on-wheels distribution service in West and South Offaly.  • B.L.C. Developments Company has been awarded €49,860 in 2025 to operate meals-on-wheels and Active Age programmes across two community facilities.  My Department’s Senior Alerts Scheme provides grants for personal emergency alarms for older people. This scheme is supporting thousands of older people around the country to live in their own homes and communities with confidence.  In June this year I announced that the €7 million provided for the LEP scheme in 2025 will support almost 4,500 community groups delivering over 5,400 individual projects. In Offaly this supported 145 groups with combined funding of over €177,000. These projects include support for social clubs, choirs, and sports clubs. The scheme also supports Men’s and Women’s Sheds, which play an important role in reducing isolation. Additionally, in May, I announced €1 million in funding for Men’s Sheds. This funding will provide grants of up to €3,000 for sheds across the country.  Other supports such as those for Tidy Towns groups, Agricultural Shows, and funding for Public Libraries, all help to reduce social isolation and loneliness.  While transport matters are the responsibility for the NTA and the Minister for Transport, I would note that the TFI Local Link Laois Offaly service provides rural bus transport services across Offaly with services including Regular Rural Services and Door-to-Door Services. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 71. Deputy Tony McCormack asked the Minister for Rural and Community Development and the Gaeltacht the initiatives his Department is implementing to combat rural isolation in Offaly, particularly for older people and those without access to transport; and if he will make a statement on the matter. [68167/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "showAs": "Tony McCormack"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_105",
          "debateSectionId": "dbsect_105",
          "showAs": "Social Isolation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_105.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_71",
        "questionNumber": 71
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Garda Commissioner is responsible under Section 33 of the Policing, Security and Community Safety Act 2024 for the management and administration of An Garda Síochána, which includes the distribution and stationing of Garda personnel throughout the State. The Commissioner is independent in his functions under Section 34 of the Act.  In the interest of transparency, information in relation to the allocation of Gardaí by Division, Station and rank, and Garda Staff by Division and Station, including for Laois/Offaly Garda Division, is publicly available and can be found at the following link: www.garda.ie/en/about-us/our-departments/human-resources-and-people-development/garda-hr-directorate/garda-strength-breakdown-2025/  The Deputy should select the most recent month and access the file titled “Garda Members by Division District Station 2009 to the most recent date” for a breakdown of total Garda numbers by Garda station going back to 2009.  The Deputy should select the most recent month and access the file titled “Garda Staff by Division and Station to the most recent date” for a breakdown of total Garda Staff going back to 2010. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 99. Deputy Tony McCormack asked the Minister for Justice, Home Affairs and Migration if he will provide updated figures on Garda deployment levels in County Offaly; and if he will make a statement on the matter. [68161/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "showAs": "Tony McCormack"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_122",
          "debateSectionId": "dbsect_122",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_122.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_99",
        "questionNumber": 99
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Government is committed to tackling the scourge of anti-social behaviour and crime to build safer, stronger communities. I am conscious of the damaging impact on the quality-of-life which crime and anti social behaviour can have in our communities and a visible Garda presence is important to help people feel safe.  I am informed by the Garda authorities that Garda stations in Tullamore, Birr and Edenderry are open 24/7. Community Policing teams are also attending meetings and engaging with various community groups to hear their concerns and provide crime prevention advice.  I engage regularly with the Commissioner to ensure that he has the resources that he needs to fight crime. This is reflected in the record allocation of €2.59 billion in the Garda Vote for 2026 which will support the continued recruitment of Gardaí and Garda staff. The Garda budget will fund the recruitment of up to 1,000 new Gardaí, 200 more Garda staff and a doubling of the Garda Reserve to over 600 next year.  Recruitment to An Garda Síochána is gathering momentum and we now have a steady pipeline of new recruits entering the Garda College. 21 Probationer Gardaí have been assigned to the Laois/Offaly Garda Division over the last two years.  794 new recruits entered the Garda College this year and we can look forward to seeing those probationer Gardaí assigned throughout the country in 2026 as they attest from Templemore. It must also be noted that the allocation of newly attested Gardaí allows for currently serving Gardaí to transfer to other Divisions across the country and into specialist units.  Along with extra Gardaí and an enhanced, visible Garda presence, some of the other measures the Government are taking, include:  • The introduction of Local Community Safety Partnerships around the country, including in Offaly, to develop tailored Community Safety Plans for every area;  • Continued expansion of youth justice and youth diversion measures;  • New laws which criminalise the grooming of children into a life of crime;  • The deployment of body-worn cameras, with nationwide roll-out to follow the current pilot project;  • Proposing solutions to public order and anti-social behaviour through the Local Leadership Programme which brings together local stakeholders in a structured manner;  • Over €4 million allocated to 42 projects through the Community Safety Fund, which re-invests the proceeds of crime into local safety projects.  Local Community Safety Partnerships (LCSP) represent a significant step towards a more collaborative, responsive, and locally driven model of public safety. They will bring together a broad range of relevant stakeholders to address community safety issues in their area which will include residents, local councillors, community representatives, business and education representatives, and a range of public services including the HSE, Tusla, An Garda Síochána and the local authority. A core part of their work will be to draft a Community Safety Plan tailored to the community's needs.  From An Garda Síochána's perspective, a long-term strategic approach to tackle anti-social behaviour in communities assists in addressing potential problems before they arise. An Garda Síochána work collaboratively with Local Authorities, community leaders and groups to find solutions to problems associated with anti-social behaviour.  I can assure the Deputy that An Garda Síochána will always be on hand to respond to incidents, implement local policing plans as necessary and provide crime prevention advice to address the needs of the communities they serve. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 103. Deputy Tony McCormack asked the Minister for Justice, Home Affairs and Migration the actions he is taking to support Gardaí in tackling persistent antisocial behaviour in town centres in Offaly, including Tullamore, Birr and Edenderry; and if he will make a statement on the matter. [68162/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "showAs": "Tony McCormack"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_126",
          "debateSectionId": "dbsect_126",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_126.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_103",
        "questionNumber": 103
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " The Taoiseach  I propose to take Questions Nos. 13 to 23, inclusive, together.  Regulation, and the extent of any regulatory or administrative burden, has recently become a greater focus at European Union level and nationally as a means to further enhance competitiveness. At a European level, both simplification and implementation are important Commission priorities. The Commission is striving to simplify and lighten the administrative burden of European Union regulations to ensure they are proportionate, stable, coherent and technologically neutral.  Likewise, our national regulatory framework is a central focus for the Government as we strive to support competitiveness at a time of international economic uncertainty. In line with the programme for Government, we published an action plan on competitiveness and productivity on 10 September this year. The action plan includes actions across government to ensure the development of a more effective regulatory system which will support economic growth.  These actions reflect priority areas where targeted public policy intervention can have the greatest impact. These include a red-tape challenge to reduce regulation for SMEs; the application of the SME test by Government Departments to all measures, in particular policy initiatives where it is proposed to increase costs on small businesses; expediting the Environmental (Miscellaneous Provisions) Bill; commencing reforms, as we have done, under the Planning and Development Act 2024 to enhance delivery of infrastructure; and implementing the outstanding recommendations from the review of the administration of civil justice review group report.  Increased regulatory burden has also been identified as a barrier to infrastructure development and delivery. The Minister, Deputy Chambers, supported by the work of the accelerating infrastructure task force, this morning, with Government colleagues including me, the Tánaiste and the Minister of State, Deputy Harkin, published a plan which will include extensive regulatory reforms aimed at accelerating the delivery of critical infrastructure.  Today's plan provides the blueprint to reduce complexity and blockages in the system and deliver infrastructure with urgency. The changes we are initiating today are vital if we are to maintain our competitive position in an ever uncertain world. They are also necessary to support our citizens with top class public services, job security, access to housing and all other facilities necessary to enjoy the stability and good quality of life we are all entitled to expect.  The actions are ambitious but achievable, and delivering them will require commitment and co-operation across a broad and diverse range of stakeholders, from political, legal and public sectors, industry and society as a whole. We have established a cost-of-business advisory forum where business owners and representative bodies can speak directly to decision-makers about the real-world impact of regulations, fees and operational challenges. The work of that forum is under way. The Minister, Deputy McEntee, is working on the simplification omnibus packages put forward by the European Commission in a range of policy areas, most recently the Commission's digital simplification omnibus package, which was published last month.  My Department will play a co-ordinating role across these different regulatory reform initiatives, as outlined in the action plan on competitiveness and productivity, including the establishment of a central economic regulators' forum, and we will work with the Minister for Enterprise, Tourism and Employment and other Government colleagues on that agenda. \n Deputy Tony McCormack  I thank the Taoiseach for his response. I acknowledge the significant work he, the Minister, Deputy Chambers, and their two Departments are doing on infrastructure reform, particularly the steps being taken to modernise planning, reduce delays and ensure major projects move forward. Infrastructure reform is vital, but businesses and especially SMEs are also calling for a more streamlined regulatory environment. These firms consistently cite overlapping rules, slow approvals and heavy administrative demands as major obstacles to growth. Building on the work already happening on infrastructure, will the Taoiseach update the House on what specific measures his Department is pursuing to simplify compliance for SMEs, reduce unnecessary paperwork and make it easier for businesses to operate and expand? How will these reforms help to lower costs for employers and the taxpayer by making the system more efficient overall? \n Deputy Albert Dolan  It is vital that when we speak about regulatory reform, we talk about the administrative operations of existing systems in the function of the State. I will specifically reflect on the Sustainable Energy Authority of Ireland, SEAI, and the roll-out of grants. We are about to have a debate in this Chamber on energy costs. One thing that is vital is that the best way the Government can help to reduce energy costs in homes is to retrofit them for the future so that they simply do not need as much energy. That is the number one way to reduce the cost and it facilitates homes to be more efficient and takes pressure off the grid. The Government needs to do something to accelerate the rate at which homes can be retrofitted by the SEAI. For many constituents in my constituency, it is taking too long to get through the process of approval of the grant to construction. \n Deputy Ruairí Ó Murchú  We all accept there are huge issues with bureaucracy and red tape in planning. We should have seen simplification and streamlining. Conversations about this are occurring across Europe, but we know about the home-grown issues. It is an issue I have brought up previously, even within the planning systems involving State authorities. For example, Louth County Council is involved in the Ardee Education Together National School build and a particular issue has arisen. We do not have enough agility in the system. Multiple requests have gone in stating that there are not enough parking spaces. There are 21 spaces, including three disability spaces. There are only two set-down spaces for minibuses and there is a need for five as there are five autism spectrum disorder, ASD, classes and there is not even room for a full-size 52-seater bus to turn. There are 21 spaces for staff and there is a need for something closer to 40. \n An Ceann Comhairle  Thank you, Deputy. \n Deputy Ruairí Ó Murchú  It is possible to get this work done at this time, but if the works continue as planned, the problem will still need to be fixed but it could take more than €100,000, so we need something to be done. \n Deputy Darren O'Rourke  I raise the regulation of social media companies in the online space, particularly as it relates to children. The criticism that has been levelled at Coimisiún na Meán's online safety code is that an earlier draft had a recommendation that social media companies turn off recommender systems and it has been removed. Recommender systems profile people who are using apps and then drive them down often hateful and dangerous rabbit holes. It is not healthy for them or society. Will this be looked at? \n Deputy Ruth Coppinger  I raise regulatory reform of immigration and particularly family reunification. It is now being made much harder for many essential workers to be unified with their families, in particular migrant healthcare assistants who were brought over here on a visa programme and are working in private nursing homes. Last week on RTÉ radio, the Minister for justice was asked by the presenter whether these people are not entitled to a normal family life. They are caring for our older people and we have to show we care for them. The Minister's reply was that no one is forcing them to come here. That is absolutely heartless, shows zero empathy and is also completely counterproductive because many of them are nurses. They could go to other countries, but they have come to Ireland and are working below their grades or qualifications, giving huge added value to the nursing homes. I urge the Taoiseach to have a heart. We had a briefing here a few years ago, which Deputy Michael Healy-Rae attended because he knew the value of those healthcare assistants in nursing homes. These are essential workers and they will go elsewhere. \n An Ceann Comhairle  Thank you, Deputy. \n Deputy Ruth Coppinger  Please entitle them to have a normal family life. These mothers should not be separated from their kids. \n Deputy Paul Murphy  The programme for Government says the Government will move responsibility for the Multi-Unit Developments, MUD, Acts to the Department of housing from the Department of justice and establish a unit in the Housing Agency to regulate owners' management companies, OMCs, to ensure effective governance. That is important work that needs to happen. The problem is that it is not happening currently, but it has been agreed. Effectively what is holding it up is that, as a result of the Mulcreevy judgment, the primary legislation needs to be changed. At the moment, the MUD Act refers to the Minister for justice and not the Minister for housing. A simple amendment is needed to change the reference to the Minister for housing. Until that happens, all this work of regulatory oversight of OMCs and so on is simply not taking place. There was a meeting of the housing committee to discuss these issues. It invited various officials from the Department of housing and was told they could not come yet because their line Minister is not yet responsible for this. \n An Ceann Comhairle  Thank you, Deputy. \n Deputy Paul Murphy  The Housing Agency has not been allocated funding for doing any regulatory work as a result. This needs urgent action. \n Deputy Liam Quaide  There was a health committee session last week on the regulation of counselling and psychotherapy. In standards it has published, CORU has adopted a position that is entirely at odds with the main representative groups of those disciplines, which will reduce supervision requirements and remove mandatory personal therapy for trainees. These changes, if implemented, will degrade professional standards and undermine patient safety. CORU is showing a remarkable level of intransigence on these fundamentals of safe practice. Practitioners and representative bodies have warned that the proposals could also jeopardise recognition and mobility across the EU for counsellors and psychotherapists. We must protect high-quality training, preserve public confidence and ensure regulation strengthens, not weakens, these services.  I am not expressing some fringe opinion. The health committee was unanimous in supporting the counselling and psychotherapy representative groups and the session included some strong and insightful contributions from the Taoiseach's party colleagues, including Senator Costello. Will the Government immediately pause the CORU process, bring representative bodies and practitioners into full consultation and commit to reforms that prioritise client safety and high professional standards? \n Deputy Rose Conway-Walsh  I will talk about the regulation of quarries. The Taoiseach knows the price we have paid in this country and the price that families affected by the defective concrete blocks scandal have paid due to a lack of regulation.  Many of the homeowners I have spoken to in Mayo are not satisfied with the current regulations of quarries and in particular, that geologists are not examining the aggregate within the quarries that are being used to build homes now. I ask the Taoiseach to have a look at this area to see what can be done in that regard. It can be easily fixed by engaging and employing geologists to do the job and to make sure that people have confidence in the materials that are coming out of quarries. \n Deputy Richard Boyd Barrett  The Taxi Regulation Act 2013 clearly gives the Minister the power to impose regulations around the activities of dispatch companies. Today, for the third time in two weeks, taxi drivers in Dublin are protesting. There is a widespread protest against this across the country by taxi drivers over the behaviour of Uber, a multimillion euro company, that is trying to undermine the livelihood of nearly 20,000 taxi drivers by introducing a fixed fare system. This will undermine the regulated fare structure and therefore the livelihoods of taxi drivers and ultimately the industry itself. In the long run, as is clear from Uber's behaviour elsewhere in the world, it will not benefit the customer. Once the company gets hold of a market, fares and charges go up and the livelihoods of taxi drivers get smashed. Will the Taoiseach ask the Minister for Transport to impose such regulations to prevent Uber destroying the industry and livelihoods of taxi drivers around this fixed fare system and enforce the taxi regulation and meter stuff? \n The Taoiseach  Deputy McCormack raised infrastructure reform, particularly for small to medium-sized businesses. Some of the measures we have taken in respect of deferring the alignment of the minimum wage with the national living wage will help to avoid the escalation of costs because the SME sector has borne the brunt of a lot of additional costs over the past five years. There is no doubt the reduction in VAT on hospitality will help a lot of SMEs in the hospitality sector and hairdressing as well. The number of sick days leave is going to be quickly expanded. We have expanded it to three days. The cumulative cost of everything has been fairly excessive. The Small Business Forum is there to try to balance imposition on small business as well as the cost.  The other issue is the sequential approach to planning and regulations as opposed to a concurrent approach whereby instead of waiting for the planning to be done, agencies do the procurement. Instead of waiting for environmental assessments, doing them all in parallel would speed up a lot of activity. In many instances, we are constantly looking at the avoidance of increased cost for SMEs and trying to slow down the increased costs that have come their way. It is interesting the rate of youth employment has crept up in the past six to nine months. I believe that is related to costs on SMEs.  Deputy Dolan is correct that retrofitting is the most effective way to reduce costs. Between 2019 and September 2025, the Government provided over €1.5 billion in support to homeowners for over 228,000 upgrades, including 30,000 fully funded retrofits under the warmer homes scheme. It is estimated that if a deep retrofit is done, it can save a household up to €1,100 per year in energy costs. I get the Deputy's point that the administration of it needs to be faster. There is also resource demand in respect of it as well with some people not being able to afford to do retrofits because of the cost.  On Deputy Ó Murchú's issue, I do not have the specifics on Ardee Educate Together National School. I do not know what the interaction with the county council is, but in any event----- \n Deputy Ruairí Ó Murchú  The refusal to change----- \n The Taoiseach  They should sort it out. A school is an important facility. The county council should be facilitative in the building of a school. \n Deputy Ruairí Ó Murchú  It is not just the council. \n The Taoiseach  Deputy O'Rourke raised regulation online. We have now established the regulatory framework governing online. There is ongoing review in respect of it. Children must be protected. That has to be the optimal.  Deputy Coppinger raised healthcare assistants and family reunification. We have significant reunification in Ireland under our migration system, in particular when people leave direct provision who have residency. The Minister will bring forward legislation in respect of this and these are issues we can discuss in greater detail at that stage.  On Deputy Murphy's point, I will talk to the Ministers responsible. There has to be proper regulation of management companies. There are fundamental rights involved in terms of those complexes. I will pursue that with the Minister and see where we are in terms of amendment to primary legislation.  Deputy Quaide raised the issue of counselling and psychotherapy. On qualification frameworks and regulators generally, we want more therapists, but they have to be highly qualified. Public health is number one and the protection of the consumer. In some instances, they can be quite protectionist as well. The judgment called for regulators and I would like CORU to get the judgment right in terms of not having the bar so high that there are only highly qualified, and others are not. That is not just in terms of therapy and counselling; that is in terms of teaching and a range of other issues.  Deputy Conway-Walsh raised the regulation of quarries. I will talk to the Minister involved in that. We can overregulate too but I take the Deputy's point about the quality of aggregate and quality of the product. There are existing systems to deal with that. The SEAI is there. There are various regulatory bodies to deal with the quality of materials, but I will talk to the Minister in respect of that. New bodies were set up after the defective blocks scheme.  Deputy Boyd Barrett raised taxi regulation. I will talk to the Minister about the issues that the Deputy raised. There is a balance between consumers, those availing of taxis and the regulation of same. We had regulation a long time ago; it did not work. There was always an imbalance between supply and demand. I will look at this and will talk to the Minister for Transport in respect of it. He is fully aware of it. \n An Ceann Comhairle  We have a delegation of students visiting from Ukraine as our part of our EPAS programme hosted by Maynooth Post Primary School. They are most welcome. We had their president here yesterday, which we enjoyed immensely. ",
        "questionType": "oral",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Taoiseach"
        },
        "showAs": " 13. Deputy Tony McCormack asked the Taoiseach for an update on his Department’s plans to co-ordinate a range of actions aimed at regulatory reform. [50582/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "showAs": "Tony McCormack"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/debate/dbsect_16",
          "debateSectionId": "dbsect_16",
          "showAs": "Regulatory Reform",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/debate/mul@/dbsect_16.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_13",
        "questionNumber": 13
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Health  Under the Health Act 2004, the Health Service Executive (HSE) is required to manage and deliver, or arrange to be delivered on its behalf, health and personal social services. The Minister for Health is prohibited from directing the HSE to provide a treatment or a personal service to any individual or to confer eligibility on any individual.  In relation to the particular query raised, as this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 607. Deputy Tony McCormack asked the Minister for Health when a person (details supplied) will receive an appointment. [67898/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "showAs": "Tony McCormack"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_541",
          "debateSectionId": "dbsect_541",
          "showAs": "Hospital Appointments Status",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_541.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_607",
        "questionNumber": 607
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Deputy Neale Richmond  I thank the Deputy for his timely question. Ireland's diplomatic priorities are set out in the Department of Foreign Affair and Trade's statement of strategy for 2025 to 2028, which includes active diplomatic engagement in promoting peace, security and the protection of human rights abroad. We pursue these objectives against the backdrop of a changing geopolitical landscape and a wide range of challenges that require global solutions. In this context, the Government prioritises reinforcing the multilateral system and the international legal order with the UN Charter at its heart. The Government also prioritises developing and maintaining strong and wide-ranging bilateral relations with key international partners.  Our membership of the European Union, the world's longest and most successful peace project, is central to how we ensure our security, prosperity and well-being as a country. As the Minister outlined to Deputy Ó Muirí, our preparations to hold the Presidency of the Council of the European Union in the latter half of next year are well under way.  Ireland is actively engaged in international efforts to bring an end to Russia's illegal war of aggression against Ukraine. The Government is committed to providing continued political, humanitarian, economic and non-lethal military support to Ukraine. Responding to conflict in the Middle East is also a priority. The Government consistently advocates at EU and UN level for the two-state solution and the equal right to self-determination, peace and security for Palestinians and Israelis alike, as well as full adherence to international law and international humanitarian law.  Ireland continues to prioritise to the promotion of human rights in a period where human rights norms are facing considerable pushback. Reflecting our commitment in this area, Ireland's campaign for the election to a seat on the Human Rights Council from 2027 to 2029 was launched last week in New York. Ireland prioritises engagement in support of a stable and secure international environment through conflict prevention, peacekeeping and peacebuilding, disarmament and non-proliferation, and promoting the resolution of disputes through multilateral diplomacy based on the principles of the UN Charter. The Government also makes sure that we have a full focus on foreign and security policy and common security and defence policy in a range of multilateral institutions, including the UN, Organization for Security and Co-operation in Europe, OSCE, Organisation for Economic Co-operation and Development, OECD, and the Council of Europe. \n Deputy Tony McCormack  The Minister of State mentioned Ireland's commitment to peace and human rights. Given that negotiations between Russia and Ukraine are now under way, can Ireland use its strong reputation for principled diplomacy to support these efforts? Does the Minister of State see a role for Ireland within the EU, UN or OSCE in helping to reinforce the conditions for a credible, just and durable peace, including humanitarian protections and respect for international law? \n Deputy Neale Richmond  There are a couple of elements to that. The negotiations under way in Geneva between the US and Ukraine are welcome, but Ireland is not a direct party to them. One issue that came up at the Foreign Affairs Council, which I attended virtually yesterday, was the need for there to be an EU track to the negotiations. While there are three European countries around the negotiations, we want to make sure there is a real EU voice. Within that EU voice will be Ireland's voice. Ireland is clear that we want a just and lasting peace in Ukraine, one that is based on international law and respecting the territorial sovereignty of the people of Ukraine. To be blunt, there can be nothing about Ukraine without Ukraine. Equally, there can be nothing about Europe without Europe. Ireland will continue to push at UN level the need to respect international law. There are a number of cases before various international courts that Ireland will be a party to, highlighting concerns in relation to human rights abuses and, as the Minister alluded to, in relation to the forced abduction of children from Ukraine. \n Deputy Tony McCormack  Ireland's own peace process culminating in the Good Friday Agreement was built on dialogue, patience, international support and the difficult work of building trust between communities. With negotiations now taking place between Russia and Ukraine, does the Department see scope for Ireland to share the lessons we learned from our experience in areas like mediation, inclusive dialogue, confidence building and reconciliation?  Is the Government prepared to offer that expertise through purely civilian and diplomatic channels to international partners supporting this peace process? \n Deputy Neale Richmond  Yes, absolutely. When there is a ceasefire and a peace agreement in Ukraine, Ireland is fully prepared to play a real part in that. Just two weeks ago, I was in Colombia, one of 13 Irish Aid countries, and our programme work there is solely in relation to peace. The experience of Ireland has been put into action to uphold the 2016 peace agreement. I visited projects with decommissioned FARC guerillas who were being supported by the Irish Government to turn their backs on violence, engage on peace and lead far better lives. This is the sort of thing that we can offer to the world. Deputies in this Chamber regularly refer to this in the context of the situation in the Middle East, and that is true too. There are lots of Irish NGOs working in places like Ramallah in this regard.  Ukraine offers us a great opportunity but, first and foremost, let there be no equivocation about our support for the people of Ukraine. We want to make sure that real peace comes to Ukraine and that this happens through an absolute ceasefire as soon as possible. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Tony McCormack",
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29"
        },
        "questionType": "oral",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/mul@/dbsect_8.xml"
            }
          },
          "debateSectionId": "dbsect_8",
          "showAs": "Foreign Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/debate/dbsect_8"
        },
        "questionNumber": 6,
        "date": "2025-11-27",
        "showAs": " 6. Deputy Tony McCormack asked the Minister for Foreign Affairs and Trade if she will provide an update on Ireland’s current diplomatic priorities in light of recent international developments, with particular reference to Ireland’s role in promoting peace, security, and the protection of human rights abroad; and if she will make a statement on the matter. [66633/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_6"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 57 and 61 together.  I propose to take the questions put by Deputies McCormack and O'Connor on the Government Trade Forum together.  Since its establishment in February, the Forum has become an important strategic vehicle for engagement with key stakeholders on trade issues, including across Government, business organisations, trade unions and other representative groups.  Discussions at the trade forum have helped shape the national, multifaceted response to the trade challenges facing the country and the business sector.  The Government Trade Forum has also focused on the opportunities to further build on Ireland’s strong trade performance, considering the entirety of Ireland’s trading relationships, including for example opportunities arising from EU trade agreements, and consideration of how best to advance Ireland’s economic interests with our largest bilateral trading partners.  The Forum has met on nine occasions and has already shown its value, playing an important role in the Government’s response to emerging trade developments and opportunities. It has also enabled dialogue and information-exchange, through engaging with businesses from strategically important sectors of the economy, including pharmaceuticals, med-tech, semiconductors, aviation, agrifood and international financial services. The minutes of each Forum meeting are published and available online on ireland.ie.  In addition to addressing ongoing trade issues, the Forum takes a longer term-strategic view on trade issues. The Forum’s work programme is guided by a Work Plan for 2025, which is also available at ireland.ie. My Department is currently preparing a Work Plan for 2026 for consideration by the Forum members. A key focus for next year will be monitoring implementation of the Action Plan on Market Diversification, published by Government in August, which includes a range of actions by Government Departments and State agencies, with the objective of supporting businesses in their market diversification ambitions. I would propose that we will also continue with the high-level sectoral engagements.  I very much look forward to taking on the role as Chair in my capacity as Minister with responsibility for trade policy and I plan to convene a meeting of the Forum in the coming weeks and confirm dates for a series of further meetings for 2026. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Tony McCormack",
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_84.xml"
            }
          },
          "debateSectionId": "dbsect_84",
          "showAs": "Official Engagements",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_84"
        },
        "questionNumber": 57,
        "date": "2025-11-27",
        "showAs": " 57. Deputy Tony McCormack asked the Minister for Foreign Affairs and Trade when the next meeting of the Government Trade Forum will take place; and if she will make a statement on the matter. [66632/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_57"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  I propose to take Questions Nos. 112, 117, 133 and 144 together.  Since early November, there have been four outbreaks of highly pathogenic avian influenza (HPAI) caused by the H5N1 virus in turkey flocks in counties Carlow, Meath, Monaghan, and Laois.  My Department has been implementing disease control and eradication measures in line with the EU Animal Health Law provisions and national legislation. This includes the placing of 3km radius protection zones and 10km radius surveillance zones around each holding where an outbreak has occurred, and implementing surveillance and disease control measures within these zones.  Prior to this, an outbreak of HPAI occurred in a confined establishment in Cork in October, following which that establishment was closed while disease control measures were implemented in line with the legislation.  The H5N1 virus has been circulating in wild birds throughout the country during 2025, creating a serious and ongoing risk of infection to poultry and captive bird flocks.  I introduced mandatory biosecurity measures on 1st November and a housing order on 10th November for all poultry and captive bird owners, with similar measures being undertaken in Northern Ireland. My Department also meets regularly with poultry stakeholders to keep them appraised of this developing situation, with the most recent meeting taking place on 20th November.  The Animal Health and Welfare Act (2013) provides that compensation to owners of animals may be payable if a cull of those animals is directed by my Department in the event of a HPAI outbreak.  The compensation may relate to the animal that is culled, or to an animal product, animal feed or similar item that is destroyed in relation to the outbreak. The compensation may not exceed the open market value of the animal or item. Compensation is payable only to the owner of the animals or items affected.  Strong biosecurity remains our most effective tool for preventing the spread of this disease. All poultry and captive bird keepers should remain vigilant of any signs of the disease and to report any suspicion to their local Regional Veterinary Office without delay.  My Department issues regular updates on the avian influenza situation in Ireland and publishes guidance on the Government Website at www.gov.ie/birdflu ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Tony McCormack",
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_111.xml"
            }
          },
          "debateSectionId": "dbsect_111",
          "showAs": "Animal Diseases",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_111"
        },
        "questionNumber": 144,
        "date": "2025-11-27",
        "showAs": " 144. Deputy Tony McCormack asked the Minister for Agriculture, Food and the Marine the current status of avian influenza in the State; the measures his Department is taking to support poultry farmers and mitigate the risk of further outbreaks; and if he will make a statement on the matter. [66636/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_144"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  Bovine TB (bTB) is an ongoing challenge for Irish farmers. In recent years there has been a significant increase in bTB levels nationally. As at 16th November 2025, over a 12-month period the herd incidence is 5.87% having started to reduce in recent months.  Over time our understanding of bovine TB has increased and evolved and research has shown that our current approach to addressing disease levels on its own was not enough to control and ultimately eradicate bovine TB.  Earlier this year, I had extensive engagement with stakeholders and farming organisations to agree measures to tackle the current disease levels and in June I received the support of Government to introduce additional measures to the bovine TB programme.  On 9 September, I launched the ‘Bovine TB Action Plan: Addressing Bovine TB in Ireland’. There are 5 measures and 30 actions underpinned by scientific research, evidence and veterinary expertise in this action plan.  Support herds free of bTB to remain free  Reduce the impact of wildlife on the spread of bTB  Detect and eliminate bTB infection as early as possible in herds with a bTB breakdown and avoid a future breakdown  Help farmers improve all areas of on-farm biosecurity  Reduce the impact of known high-risk animals in spreading bTB  The aim of the Action Plan is to reset the bTB programme in the context of putting in place measures necessary to tackle the current disease situation. These measures are targeting both transmission between wildlife and cattle, and transmission between cattle.  I intend introducing some of the measures immediately in terms of communication and engagement with farmers while others will be introduced over the coming months and into 2026. As some of these measures require work on IT systems this work is being prioritised and will be rolled out in the coming months. Farmers and all stakeholders will be notified in advance of any changes to the TB programme through communication campaigns.  I have secured an increased budget allocation for the TB programme in Budget 2026, providing a total budget of €157 million. This additional funding is vital in addressing this disease and I am confident it will help drive down the incidences of bovine TB levels in future years through the implementation of the Action Plan. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Tony McCormack",
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_167.xml"
            }
          },
          "debateSectionId": "dbsect_167",
          "showAs": "Animal Diseases",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_167"
        },
        "questionNumber": 176,
        "date": "2025-11-27",
        "showAs": " 176. Deputy Tony McCormack asked the Minister for Agriculture, Food and the Marine for an update on the incidence of bovine tuberculosis nationally; the actions being taken to reduce herd infection levels and support affected farmers; and if he will make a statement on the matter. [66637/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_176"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_100",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_100",
          "showAs": "Sport and Recreational Development",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_100.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 69. Deputy Tony McCormack asked the Minister for Culture, Communications and Sport the measures his Department is taking to increase youth participation in sport, particularly in disadvantaged areas; and if he will make a statement on the matter. [64110/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_69",
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  This Government is committed to a \"Sport for All\" approach aimed at ensuring that all persons can partake equally in sport and physical activity regardless of gender, age, disability, or socio-economic status, or membership of any minority group.  Sport Ireland's network of Local Sports Partnerships (LSPs) plays a crucial role in implementing the National Sports Policy and increasing participation levels in sport and physical activity particularly in underrepresented groups. The LSPs deliver targeted programmes to range of cohorts including young persons, the unemployed and those living in disadvantaged communities.  In 2025, the LSP network received €11,945,000 in core funding and this was supplemented by additional investment from other funding streams, including Dormant Accounts Funding (DAF) and the European Social Fund (ESF+) Programme.  Through DAF, LSPs can connect national funding priorities with local community needs, ensuring funding reaches the groups, clubs and people that need it most. Funding totaling €1.32 million was allocated in 2025 to support 29 existing Community Sports and Physical Activity Hubs along with funding of four new Hubs. Led by LSPs, the Hubs will promote local engagement in sport and physical activity to assist disadvantaged areas. An additional €280,000 will go to the Urban Outdoor Adventure Initiatives, a fund that aims to provide outdoor adventure sports opportunities for disadvantaged communities and at-risk youth.  Sport Ireland has successfully applied to the European Social Fund (ESF+) Programme 2021-2027 and has been awarded €11 million for implementation of a social innovation and inclusion programme over the lifetime of the Programme. The ESF+ funding has enabled Sport Ireland to establish the Sport4Empowerment (S4E) Programme which aims to use sport and physical activity as tool for social inclusion and empowerment. S4E targets four population cohorts, including youth at risk and persons from disadvantaged backgrounds.  The Programme will see the phased employment of ESF+ Social Innovation in Sport Officers in each of the 29 LSPs. The Officers will be responsible for the piloting and implementation of range of new targeted programmes which aim to enhance the wellbeing, education, and economic prospects of participants. ",
        "questionNumber": 69,
        "by": {
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "showAs": "Tony McCormack"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_129",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_129",
          "showAs": "Health Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_129.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 111. Deputy Tony McCormack asked the Minister for Health the plans to ensure that children in Offaly and Laois can access local primary care occupational therapy services; and if she will make a statement on the matter. [64084/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_111",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 111,
        "by": {
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "showAs": "Tony McCormack"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_196",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_196",
          "showAs": "Primary Care Services",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_196.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 178. Deputy Tony McCormack asked the Minister for Health when primary care occupational therapy services will be restored in Offaly and Laois; and if she will make a statement on the matter. [64085/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_178",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 178,
        "by": {
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "showAs": "Tony McCormack"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_347",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_347",
          "showAs": "Broadband Infrastructure",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_347.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 476. Deputy Tony McCormack asked the Minister for Culture, Communications and Sport for an update on the roll out of the National Broadband Plan in rural counties, such as Offaly; whether delivery timelines are on track; and if he will make a statement on the matter. [59351/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_476",
        "answerText": "",
        "questionNumber": 476,
        "by": {
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "showAs": "Tony McCormack"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 102,
        "showAs": " 102. Deputy Tony McCormack asked the Minister for Transport the current position regarding the development of the N52 Link Road in County Offaly; the way in which the project will improve connectivity and safety in the midlands region; and if he will make a statement on the matter. [63387/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Tony McCormack",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "memberCode": "Tony-McCormack.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_102",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_59",
          "showAs": "Road Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_59",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_59.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  I propose to take Questions Nos. 102 and 124 together.  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the planning, design and construction of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals. In this context, TII is best placed to advise you on the status of the N52 Tullamore to Kilbeggan project.  Noting the above position, I have referred your question to TII for a direct reply. Please advise my private office if you do not receive a reply within 10 working days. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 124,
        "showAs": " 124. Deputy Tony McCormack asked the Minister for Transport the current status of the proposed N52 Link Road project in County Offaly; the stage the project is at within the Transport Infrastructure Ireland delivery pipeline; and if he will make a statement on the matter. [63386/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Tony McCormack",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "memberCode": "Tony-McCormack.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_124",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_59",
          "showAs": "Road Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_59",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_59.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Transport  I propose to take Questions Nos. 102 and 124 together.  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the planning, design and construction of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals. In this context, TII is best placed to advise you on the status of the N52 Tullamore to Kilbeggan project.  Noting the above position, I have referred your question to TII for a direct reply. Please advise my private office if you do not receive a reply within 10 working days. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "oral",
        "answerText": " Deputy Tony McCormack  What additional supports is the Department considering to help small and medium enterprises to manage current cost pressures and restore business confidence and will he make a statement on the matter? \n Deputy Alan Dillon  I thank the Deputy for his question. The Government acknowledges that the retail sector contributes to the economy of every city, town and village in Ireland. The sector provides highly important employment with over 220,000 people directly employed in retail. The programme for Government is clear on the intention to support small businesses and as the Minister of State with responsibility for retail, I am aware of the issues facing retailers.  The broad range of supports for the retail sector, including training programmes and funding to help retailers adapt to new challenges and opportunities in retail, can be found on the national enterprise hub, NEH. The NEH is an all-of-government service staffed by expertly trained advisers and is focused on helping businesses to access a range of Government supports. The hub brings together information and resources of over 250 Government supports from 32 different Departments and State agencies. The grow digital voucher offers up to €5,000 to small businesses, including retailers, to invest in technology such as e-commerce software, online booking systems and stock control, which are designed to enhance productivity and competitiveness.  The energy efficiency grant provides up to a maximum of €10,000, with a 75% contribution rate from the Government to support investment in technologies and equipment identified in a green for business, GreenStart or Sustainable Energy Authority of Ireland, SEAI, energy audit. The aim of the scheme is to reduce the impact of enterprises on the environment, thereby increasing the agility and resilience of these businesses.  In 2024, the Government introduced the power up grant and the increased cost of business, ICOB, scheme, which paid out over €400 million to businesses. Included in this was a second ICOB payment and a €4,000 power-up grant for businesses in the retail sector. The Department opened a reclassification appeals process this July, which allowed businesses in the retail sector that had initially misclassified their business category an opportunity to reclassify.  The cost of business advisory forum has been established, comprising SME and industry representative organisations, and the forum held its inaugural meeting in July. A report is due to the Government in the first quarter of next year, which will outline the forum's findings and highlight the steps that can be taken to mitigate rising costs. \n Deputy Tony McCormack  While Ireland's balance sheet looks good on paper and the country is doing well at the moment, some small- and medium-sized businesses, including in retail, are anxious. They are doing their best to keep their doors open, but margins are tight. All the schemes the Minister of State mentioned need a bit of investment from the businesses, which is just not there at the moment. Many tell me that they are not looking for handouts, but a bit of help to steady the ship, practical supports and clearer direction. Schemes like the power-up grant the Minister of State mentioned earlier made a real difference in the past. Will he outline what fresh supports or initiatives are being considered to help small businesses invest, grow and feel confident about the year ahead, particularly in rural counties such as Offaly where SMEs are the backbone of the local communities? \n Deputy Alan Dillon  Retail is evolving rapidly. We have seen significant changes in consumer habits. Shoppers now expect an online channel or experience, not just the physical presence on our high streets, as the Deputy experiences in Offaly, but also for them to offer multiple touchpoints, such as the implementation of websites, the digitalisation journey, mobile applications and in-store options. The Government is supporting businesses in that. There is a grow digital voucher of up to €5,000 for e-commerce platforms. We are also supporting business with consultancy advisers in digital transformation and local enterprise offices, LEOs. The Offaly office provides mentoring training and grants for lean, green and digital initiatives. We need to continue to support the retail sector, because we know how important it is. We are working with other Departments and with the Minister of State, Deputy Cummins, on planning statements around a retail strategy. That will ensure we have a balanced retail presence of physical stores and digitally integrated ones. \n Deputy Tony McCormack  That is encouraging but it is not what I am hearing on the ground. The feedback that I am getting from business owners is that they often do not know where to start. The Minister of State mentioned the local enterprise offices, which do great work in County Offaly and other counties around the country. We need to make sure that people know about these places. Whether they are applying for funding, going digital or managing rising costs, this needs to be made clearer to them. Would the Minister of State consider developing a more hands-on, locally focused SME guidance programme where trained mentors or advisers could visit businesses directly, offer tailored advice and connect them quickly to the right grants or supports? That kind of practical, person-to-person guidance could make a real difference in helping SMEs to build confidence and plan ahead. \n Deputy Alan Dillon  We are undertaking a review of the local enterprise offices to streamline them, reduce the administrative burden and make it easier for SMEs and businesses to access supports. We are conscious that we need to strengthen the role of the local enterprise offices because they have the local knowledge and are the touchpoint for many of these businesses in towns and villages across the country. They need that expert advice and mentoring to ensure that their businesses remain resilient and sustainable into the future. Through the work that we are doing in the cost of business advisory forum and the immediate financial relief that we are providing through the green transition and energy efficiency improvements, we want to support that because we know how important the retail sector is. As I said earlier, there are 220,000 jobs nationwide and we want to continue to support the Deputy's constituents in Offaly through sustainability and the competitiveness agenda, but also see how we can make it easier for businesses to access supports. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_12",
        "debateSection": {
          "debateSectionId": "dbsect_14",
          "showAs": "Business Supports",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/debate/dbsect_14",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/debate/mul@/dbsect_14.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Enterprise"
        },
        "questionNumber": 12,
        "by": {
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "showAs": "Tony McCormack"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 12. Deputy Tony McCormack asked the Minister for Enterprise, Tourism and Employment the measures being taken by his Department to support the retail sector; the initiatives in place to assist small and independent retailers facing cost pressures; and if he will make a statement on the matter. [61547/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Enterprise, Tourism and Employment  While my Department has not undertaken any specific economic assessment focused solely on the challenges and prospects for the Irish retail sector in 2025, the Government is actively and continuously monitoring trends affecting the sector. This includes tracking company registration and liquidation data, as well as broader economic and sectoral indicators.  Between January and May 2025, there were 74 liquidations in the retail sector, a 45% increase compared to the same period in 2024. However, only a portion of these closures were due to insolvencies, as there were 51 solvent liquidations during this time. It is also important to note that this has not occurred in isolation. 276 new retail businesses were registered during the same period, meaning that there has been a net increase in the number of these firms.  According to the latest CSO data, employment in the sector has expanded, increasing from just under 320,000 in Q2 2024 to just under 327,000 in Q2 2025, an increase of just over 2%. The Retail Sales Index shows a 3.5% increase in sales volumes in September 2025 compared to the same month in 2024. Card spending has also risen, with figures from the Central Bank of Ireland indicating an increase from just under €3.6 billion in September 2024 to just over €3.8 billion in September 2025, or about 6%.  Input costs are also easing on average, with the CSO’s Wholesale Price Index showing a 2.6% decline in the 12 months to September 2025. However, there has been a slight decline in consumer confidence, as reflected in the Credit Union Consumer Sentiment Index, which dropped from 74.1 in October 2024 to 59.9 in October 2025.  The Government acknowledges the challenges facing SMEs and the measures we have implemented to date, demonstrate our commitment to supporting enterprise, protecting jobs, and fostering a competitive, sustainable business environment. In particular, a series of measures have recently been adopted to help minimise cost pressures for Irish firms. These include extending the timeline for the introduction of the Living Wage by three years (to 2029) and a halt to any further increases under the Statutory Sick Leave scheme.  Most recently, the Government has taken action to address business costs through the publication of the Action Plan on Competitiveness and Productivity, and the convening of the Cost of Business Advisory Forum, both of which are commitments in the Programme for Government. The focus of the Action Plan on Competitiveness and Productivity is on actions that can be taken to strengthen Ireland’s competitiveness and productivity which in turn will lead to improvements in our economic performance.  Complementary to the Action Plan, the Cost of Business Advisory Forum delivers on the commitment to support small business, enterprise, and industries across a number of sectors. The Forums’ key objective is to examine and identify the concerns of enterprise around the impact of the rising cost of doing business in Ireland. The Forums is scheduled to report to Government in q3 2026. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_35",
        "debateSection": {
          "debateSectionId": "dbsect_66",
          "showAs": "Enterprise Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_66",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_66.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Enterprise"
        },
        "questionNumber": 35,
        "by": {
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "showAs": "Tony McCormack"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 35. Deputy Tony McCormack asked the Minister for Enterprise, Tourism and Employment if his Department has undertaken any recent analysis of the challenges and future prospects for the retail sector in Ireland; and if he will make a statement on the matter. [61548/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Social Protection  Jobseekers engaging with Intreo Employment Services can avail of a number of avenues into training and upskilling.  My Department works closely with the Department of Further and Higher Education and SOLAS to address barriers in, and increase uptake of further education and training.  In Pathways To Work 2021-2025, the national employment services strategy, the Government committed to providing up to 50,000 Further Education and Training (FET) placements for long-term unemployed jobseekers.  From the strategy’s launch to June 2025 there have been 173,185 Long-Term Unemployed learner commencements of FET courses, of which 71,885 were unique learners.  In that same period 27,213 people have been referred from Intreo to take up FET courses.  My Department supports jobseekers in further and higher education through the Back to Education Allowance, the Part Time Education Option (PTEO) and the Education Training and Development (EDT) option to raise educational and skill levels to help participants access the labour market.  The Part Time Education Option enables people in receipt of a jobseeker payment to attend part-time day/evening courses of education or training with the approval of their Employment Personal Advisor.  They must continue to satisfy the conditions of being available and genuinely seeking full time work.  The EDT option allows those in receipt of a jobseeker payment, with the approval of their Employment Personal Advisor, to continue receiving their payment while attending certain short education, training or development courses.  The normal eligibility conditions for their payment continue to apply.  The Back to Education Allowance (BTEA) provides income support to jobseekers who wish to enter a full-time FET course to improve their skills and assist them in finding quality employment.  The Training Support Grant (TSG) is available to jobseekers to fund short-term training and certification up to €1,000 per annum.  The Grant allows Employment Personal Advisors/Job Coaches to identify and address skills and certification gaps among jobseekers that prevent them from taking up an offer of employment.  Jobseekers on employment schemes such as Community Employment and Back to Work Enterprise Allowance are also eligible for Springboard+ courses. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_124",
        "debateSection": {
          "debateSectionId": "dbsect_146",
          "showAs": "Employment Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_146",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_146.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 124,
        "by": {
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "showAs": "Tony McCormack"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 124. Deputy Tony McCormack asked the Minister for Social Protection the steps being taken by his Department to improve access to training and upskilling opportunities for jobseekers, particularly those who have been long-term unemployed; and if he will make a statement on the matter. [61550/25] "
      }
    },
    {
      "contextDate": "2025-11-13",
      "question": {
        "date": "2025-11-13",
        "questionType": "written",
        "answerText": " Minister for Rural and Community Development and the Gaeltacht (Deputy Dara Calleary)  The Government is very aware of the impact of the increased cost of living pressures on low and middle income households. Budget 2026 therefore focused on targeting supports to those most in need.  Next year my Department will invest a total of €28.9 billion in social welfare in 2026, including over €1.15 billion of new measures targeted to assist households and €320 million to reduce child poverty.  Key Budget 2026 measures include:  • The largest Child Support Payment increase in the history of the State, with increases of €8 for children under 12 and €16 for children aged 12 and over. These increases will benefit over 300,000 children and bring the weekly payments up to €58 and €78 respectively.  • A €60 increase in Working Family Payment income thresholds for all families. This will result in the 48,000 families currently in receipt of this payment receiving an extra €36 weekly. In addition, it will allow more low-income families to become eligible for this payment.  • From January 2026 all households in receipt of the Working Family Payment will qualify for Fuel Allowance.  • A €5 increase in the Fuel Allowance rate.  • An expansion of the Back to School Clothing and Footwear Allowance to children aged 2 and 3 for eligible participants.  • A €20 increase in the Domiciliary Care Allowance.  • Record increases in the Carer’s Allowance weekly income disregard, with an increase of €375 to €1,000 for a single person, and an increase of €750 to €2,000 for a couple. The income limit for Carer’s Benefit will also increase by €375 to €1,000 per week. These changes will take effect from July 2026.  • To support people with a disability to transition into employment, allowing people on Disability Allowance and Blind Pension to retain Fuel Allowance for a period of 5 years if they leave the payment to take up employment from September 2026.  • A €10 increase in weekly social welfare payments  • A Christmas bonus to be paid to over 1.47 million long-term social welfare recipients.  The combined effect of these measures will work to protect people most at risk of poverty and support families with children, older people, carers, people with disabilities and jobseekers in communities across the country. ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-13/pq_137",
        "debateSection": {
          "debateSectionId": "dbsect_159",
          "showAs": "Cost of Living Issues",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/dbsect_159",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-13/writtens/mul@/dbsect_159.xml"
            }
          }
        },
        "to": {
          "uri": null,
          "roleCode": null,
          "roleType": null,
          "showAs": "Social"
        },
        "questionNumber": 137,
        "by": {
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "showAs": "Tony McCormack"
        },
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "showAs": " 137. Deputy Tony McCormack asked the Minister for Social Protection the measures her Department is taking to assist low- and middle-income households struggling with the rising cost of living, particularly in rural areas; and if he will make a statement on the matter. [61549/25] "
      }
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  This Government recognises that waiting times for Assessment of Need are too long.  The provision of an effective and efficient Assessment of Need system continues to be a Government priority.  Both this Department and the HSE are committed to addressing delays in the delivery of Assessments of Need and have been working intensively to progress measures to achieve this.  It is important to emphasise that, while children have a right to apply for an Assessment of Need, they do not need one in order to access health services, including those provided by Primary Care, Children’s Disability Network Teams or Mental Health Services. Nevertheless, demand for Assessments of Need has increased significantly in recent years, a reflection of both the increase in population and the number of families exploring all options for accessing services for their child.  The HSE system for collating Assessment of Need data does not provide detail on the waiting time for the delivery of Assessments of Needs.  However, at a national level, the HSE reports that the average duration of the assessment process, where a report has been completed, is 27.15 months.  This is for reports completed in Q3 of 2025.  As this is a national figure, there will be regional variations with some AONs being delivered within a shorter timeframe.  Over the past 2 years, there has been a noted improvement in the number of completed Assessments.  Over 4,100 were completed in 2024, an increase of 30% compared to 2023.  HSE data shows this trend is continuing with a 57% year-on-year increase in completed assessments in the first nine months of this year.  This has been achieved by a number of measures, including the Assessment of Need Targeted Waitlist Initiative. The Initiative targets those families waiting longest for Assessments of Need, with the HSE reimbursing clinicians directly through the procurement of capacity from approved private providers. Recent HSE data shows that over 6,300 clinical assessments have been commissioned from private providers since the Initiative started in June 2024. Budget 2026 provides for the continuation of this Initiative next year with €20 million provided for the delivery of some 6,000 clinical assessments.  While it is important to use private capacity to support the completion of Assessments of Need into 2026, we cannot rely on the private sector indefinitely and we must ensure that the public system can meet the clearly growing demand. This Department is working with the HSE to ensure the delivery of actions to support the efficient delivery of Assessments of Need within the public system. This includes improved training for staff involved in the delivery of AONs, additional administrative supports, and changes to processes where necessary to ensure an efficient and effective system.  This Government is also committed to ensuring children and their families who need early intervention and therapy input can access that support in a timely way.  I am pleased to say that progress has been made in this regard in recent times. Over the past two years, the Roadmap for Service Improvement for Disability Services for Children and Young People has been the key vehicle for enhancing children’s disability services. Through this Roadmap, a series of actions have been progressed to improve access to Children’s Disability Network Teams (CDNTs) who are providing supports and services to almost 45,000 children with complex needs.  Waiting lists for CDNT services have reduced by 18% in the first 8 months of this year, from 12,920 to 10,579 children.  This is a welcome improvement and one that must continue.  Recruitment and retention of Health and Social Care Professionals in CDNTs is a key Roadmap priority. Substantial effort and investment has been made in this regard. Funding was made available this year for the recruitment of 75 positions across the CDNTs, and Budget 2026 includes provisions for the funding of 150 posts next year.  This Department is working with the HSE to introduce specific recruitment and retention incentives for therapists to work in CDNTs.  We also need to develop a pipeline of future therapists through the third level education system to meet the continuing need for health and social care professionals.  In June, the Government approved an expansion in training places from September 2025 in disciplines critical to disability, health and education services.  Additionally alternative pathways into health and social care professions are being developed to widen access to critical skills areas. These include apprenticeships, tertiary programmes, graduate conversion and mature entry.  I can assure you that this Government will continually engage with the HSE, service providers and families to ensure that children with disabilities receive the therapies they need in a timely manner. ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Tony McCormack",
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_64.xml"
            }
          },
          "debateSectionId": "dbsect_64",
          "showAs": "Disabilities Assessments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_64"
        },
        "questionNumber": 106,
        "date": "2025-11-12",
        "showAs": " 106. Deputy Tony McCormack asked the Minister for Children, Disability and Equality the current average waiting time for assessments of need for children in County Offaly; the measures being taken by her Department to address delays in these assessments and ensure timely access to early intervention services; and if she will make a statement on the matter. [61544/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_106"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "to": {
          "showAs": "Children",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Tony McCormack",
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_132.xml"
            }
          },
          "debateSectionId": "dbsect_132",
          "showAs": "Disability Services",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_132"
        },
        "questionNumber": 171,
        "date": "2025-11-12",
        "showAs": " 171. Deputy Tony McCormack asked the Minister for Children, Disability and Equality the measures being taken by her Department to address the shortage of children’s disability services in County Offaly; for an update on staffing levels within the children’s disability network teams serving the area; and if she will make a statement on the matter. [61543/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_171"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_46",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Tony McCormack",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "memberCode": "Tony-McCormack.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_70",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_70",
          "showAs": "Naval Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_70.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 46. Deputy Tony McCormack asked the Tánaiste and Minister for Defence his plans to upgrade or expand the Naval Service fleet, particularly to strengthen Ireland’s capacity in maritime security, fisheries protection, and search and rescue operations; and if he will make a statement on the matter. [58780/25] ",
        "questionNumber": 46,
        "answerText": " Tánaiste and Minister for Defence  I propose to take Questions Nos. 39 and 46 together.  My priority as Minister for Defence is to ensure that the operational capability of the Army, Air Corps and Naval Service is maintained and developed. This is to enable the Defence Forces to carry out the roles assigned by Government. The acquisition, modernisation and upgrade of Defence Forces equipment is considered in the context of the established capability development and Equipment Development Planning processes.  In addition to the recent vessel replacement project that resulted in the purchase of two Inshore Patrol Vessels from New Zealand and the recently completed Mid-Life Extension Programme in respect of the two P50 class vessels, other projects such as the Naval Service fleet secondary armament replacement, provision of enhanced sub-sea awareness capabilities and procurement of Naval Service Reserve launches, along with the maritime element of the overall military radar programme, are among the various projects being progressed which will enhance the capacity and capability of the Naval Service.  The Commission on the Defence Forces specifically recommended a programme of naval vessel replacement, to ensure a balanced fleet is reached in the next decade. This recommendation has been accepted in principle by Government and as such work is underway to consider and inform next steps.  The progression of projects on the Equipment Development Plan will be managed within the allocated capital funding and in line with the Government’s Infrastructure Guidelines. The capital funding of €1.7 billion allocated to Defence in the latest National Development Plan covering the period 2026 to 2030 represents an increase of €600 million (55%) on the previous baseline of €1.1 billion. This increased funding will enable progress across a range of priority Defence equipment upgrade and replacement programmes over the coming years.  I am pleased to say that alongside these equipment enhancements figures provided by the Defence Forces for 2024 and to date in 2025 show an increased Naval Service strength. There have been 150 personnel inducted to the Naval Service in 2025, as of 30 September - 80 more than the same time last year. Conversely, 34 personnel have discharged from the Naval Service to the end of September- 17 fewer than the same time last year. In terms of specialists specifically, there have been a total of 16 Direct Entry specialist inductions achieved as at 30 September which represents a marked increase on previous years. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_49",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Tony McCormack",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "memberCode": "Tony-McCormack.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_49",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_49",
          "showAs": "National Security",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_49.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 49. Deputy Tony McCormack asked the Tánaiste and Minister for Defence the means by which the Naval Service is contributing to the protection of Ireland’s maritime territory and critical infrastructure, including subsea communication cables and offshore renewable energy installations; and if he will make a statement on the matter. [58781/25] ",
        "questionNumber": 49,
        "answerText": " Tánaiste and Minister for Defence  I propose to take Questions Nos. 17, 27, 49 and 59 together.  The Defence Forces routinely carry out monitoring and surveillance of Ireland’s Exclusive Economic Zone (EEZ) using both Naval Service assets and Air Corps maritime patrol aircraft. In addition to at sea monitoring, the Naval Operations Command Centre in Haulbowline carries out remote monitoring twenty four hours a day, seven days a week.  It is clear that protecting critical undersea infrastructure requires collaboration within the State as well as collaboration with other European states to provide a broader understanding of what is occurring in the greater maritime space. This means that Government Departments and agencies, infrastructure operators, the Defence Forces, the private sector and academia all have a part to play. Safeguarding critical undersea infrastructure requires a multifaceted approach with a wide variation of parties involved.  To that end, my Department has taken the lead in the development of a National Maritime Security Strategy following identification of maritime security as a priority in last year’s Defence Policy Review. This strategy is being developed in consultation with national and international stakeholders and I look forward to its submission to me before the end of this year.  Earlier this year, I approved the Defence Forces participation in the Common Information Sharing Environment (CISE). Joining CISE will support better monitoring and surveillance of growing threats at sea and will help improve the Defence Forces maritime domain awareness. This will aid their decision-making during complex maritime operational scenarios as well as their ability to share information with other EU maritime organisations.  I recently announced the signing of a multi-million euro contract with Thales DMS for the provision of towed sonar capability for the Defence Forces. The new sonar capability will be used on Irish Naval vessels to monitor activities in the Irish Exclusive Economic Zone (EEZ) and, in particular, in the vicinity of subsea communication cables or gas pipelines.  Ireland is actively participating in a number EU PESCO (Permanent Structure Cooperation) projects including, Critical Seabed Infrastructure Protection, Maritime Autonomous and semi-Autonomous Systems for Mine Countermeasures and Upgrade of Maritime Surveillance. These collaborations will enhance cooperation with EU participating states thus benefiting Ireland in the protections of undersea critical infrastructure by enhancing maritime surveillance, situational awareness, response effectiveness and integration of systems. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_96",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Tony McCormack",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "memberCode": "Tony-McCormack.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_99",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_99",
          "showAs": "Electricity Grid",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_99.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Climate",
          "roleCode": null
        },
        "showAs": " 96. Deputy Tony McCormack asked the Minister for Climate, Energy and the Environment the means by which the national electricity grid is being upgraded to support increased renewable energy generation, greater electrification and future demand; and if he will make a statement on the matter. [59350/25] ",
        "questionNumber": 96,
        "answerText": " Minister for Climate, Energy and the Environment  Investing in our electricity network, and ensuring it is fit for purpose, is overseen by the Commission for Regulation of Utilities (CRU) in five-year cycles called Price Reviews. The CRU is an independent regulator, accountable to a Committee of the Oireachtas and not to me as Minister. The CRU is responsible for, inter alia, the economic regulation of the Irish electricity system operators ESB Networks and EirGrid.  On 3 July, the CRU published its Draft Determination on Price Review 6 (PR6), setting out the proposed investment to take place in our electricity grid between 2026-2030. The CRU have proposed approval of an investment of up to €18.08 billion, with a €14.1 billion baseline investment guaranteed. The CRU are currently reviewing responses received to their public consultation and are expected to publish a final determination in December.  PR6 will see major investment in the onshore electricity grid and represents a step change in grid development and investment, a process which will see further progressive scaling during the 2030s to meet future targets. These investments will start to deliver the building blocks on which we will expand our onshore grid out to 2050.  PR6 will enable the delivery of over 500 capital network projects, the growth of our economy, the connection of new housing to our electricity system, the integration of greater renewable energy, both on and offshore, and decarbonisation. Implementation of PR6 will start immediately following approval by the CRU, with the investment to be undertaken next year already approved as part of the Network Tariff setting announced by CRU in August this year.  To ensure delivery of PR6 programme, Government are investing €3.5 billion in equity in EirGrid and ESB Networks. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_172",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Tony McCormack",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "memberCode": "Tony-McCormack.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_167",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_167",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_167.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 172. Deputy Tony McCormack asked the Tánaiste and Minister for Defence when he expects local bargaining 1% adjustments to be approved and to commence in the defence sector (details supplied); and if he will make a statement on the matter. [60512/25] ",
        "questionNumber": 172,
        "answerText": " Tánaiste and Minister for Defence  The Public Service Agreement 2024-2026, to which members of the Permanent Defence Forces are a party, provides for a Local Bargaining process. The parties can bring forward proposals, up to a maximum value equivalent to 3% of basic pay, with 1% to be paid from the current Agreement and the balance to be addressed in any successor pay agreement. The 1% allocation was due for implementation in September 2025.  Local Bargaining discussions are underway between the Department of Defence, military authorities and the Representative Associations PDFORRA and RACO. Several proposals have been forwarded to the Department of Public Expenditure for consideration. Once proposals have been approved, payments will start to be made under the Local Bargaining process, with effect from 1 September 2025.  As negotiations are ongoing it would be inappropriate to comment on specific details at this time. In accordance with the terms of the Local Bargaining mechanism, agreements reached under this mechanism will be published by the relevant sector. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_173",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Tony McCormack",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "memberCode": "Tony-McCormack.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_168",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_168",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_168.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Defence",
          "roleCode": null
        },
        "showAs": " 173. Deputy Tony McCormack asked the Tánaiste and Minister for Defence the way in which the Defence Forces are developing their unmanned aerial systems capability; and if he will make a statement on the matter. [60513/25] ",
        "questionNumber": 173,
        "answerText": " Tánaiste and Minister for Defence  A key priority for me as Minister for Defence is to ensure that the capabilities of the Defence Forces are maintained, developed and enhanced in order to ensure that the Defence Forces can carry out all of the roles assigned to it by Government.  Unmanned Aerial Systems (UAS) or drones are deployed across the Defence Forces. These are small and medium sized systems which provide situational awareness, intelligence, surveillance, target acquisition and reconnaissance (ISTAR) capabilities for deployed personnel in training and on operations both at home and overseas. These assets have no lethal offensive capabilities.  UAS are currently used by a number of branches within the Army such as by Ordnance Corps personnel to assist in the safe conduct of Explosive Ordnance Disposal (EOD) duties, as well as by Army Engineer personnel for activities such as Specialist Search and Clearance operations and training. The use of UAS serves to reduce risk exposure to personnel thereby increasing force protection and safety.  The Naval Service utilise UAS daily in the maritime domain for operations such as search and rescue, surveillance, fishery inspections, damage assessments, port and offshore installation security, and maritime pollution monitoring. The Naval Service have also used UAS to support overseas operations including during Operation Pontus in the Mediterranean.  The Air Corps utilise UAS for operator training, photography and videography, communications, infrastructure inspections, and support to air crash investigations.  Looking forward, as the Army’s existing UAS capability is reaching its end of life, market research is being conducted to assist in the procurement of replacement and enhanced capabilities. To that end, and in compliance with EU public procurement procedures, a Prior Information Notice was published earlier this year to alert the market of the planned procurement and for market research purposes. This planned procurement remains at market research stage and no decisions have been taken on the final capability requirements for the replacement systems.  Furthermore, a specific recommendation in relation to the further development of the Defence Forces’ RPAS (Remotely Piloted Aircraft System) capabilities was made by the Commission on the Defence Forces. The timeframe for implementation of this recommendation will be outlined in the updated Detailed Implementation Plan for the Report of the Commission on the Defence Forces, which is due to be published shortly. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 47. Deputy Tony McCormack asked the Minister for Education and Youth when Phase 2 of the building works at a school (details supplied) is scheduled to commence; if she will provide an update on the timeline for its completion; and if she will make a statement on the matter. [58779/25] ",
        "by": {
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "showAs": "Tony McCormack",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_47",
        "questionNumber": 47,
        "answerText": " Minister for Education and Youth  The school referred to by the Deputy was provided with a new school building on a greenfield site in January 2024 to cater for 4 mainstream classes, a Special Education Needs class and ancillary accommodation. The new school building is a sustainable timber modular construction and the project was delivered under the Department’s Project Manager framework. This programme provides project management supports to enable accommodation to be provided as quickly as possible and helps to ease the administrative workload for individual schools in relation to the management and delivery of devolved projects.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities.  In July, the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  All Government departments are expected to publish their sectoral NDP Implementation Plans in November. My department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  The school referred to by the Deputy currently has staffing of 2 mainstream classes, a special education needs class and a special education teacher post so there is therefore significant accommodation capacity available to the school at present. My department will continue to monitor the development of enrolments at the school in question in relation to the requirement for further accommodation and within the context of NDP Implementation priorities. ",
        "debateSection": {
          "showAs": "Schools Building Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_67",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_67.xml"
            }
          },
          "debateSectionId": "dbsect_67"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 93. Deputy Tony McCormack asked the Minister for Education and Youth Education for an update on the status of the proposed new school building for a school (details supplied); the steps her Department is taking to progress the project; and if she will commit to ensuring that the necessary timelines for site acquisition, planning, and construction are clarified and advanced as a matter of priority. [58778/25] ",
        "by": {
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "showAs": "Tony McCormack",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_93",
        "questionNumber": 93,
        "answerText": " Minister for Education and Youth  The project referred to by the Deputy has been devolved for delivery to the Laois Offaly Education Training Board (LOETB). A design team was appointed to progress the project through the necessary architectural stages of design, statutory approvals, procurement, and construction. The approved project brief will provide for a 400 pupil post primary school and 4-classroom special education unit.  In Quarter 2 2024, this project received Department approval to progress to Stage 2A (detailed design) of the architectural planning design process. This stage included the development of the design, and an accurate cost plan that best meets the design, as agreed.  In Quarter 2 2025, a Stage 2A report was submitted to the Department for review and is undergoing an intensive review from both a technical and cost perspective in accordance with the requirements of the Public Spending Code. Once this review is fully completed, the Department will engage with LOETB on the outcome.  In July, the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my Department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  All Government Departments are expected to publish their sectoral NDP Implementation Plans in November. My Department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.   Question No. 94 answered with Question No. 10.  ",
        "debateSection": {
          "showAs": "Schools Building Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_113",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_113.xml"
            }
          },
          "debateSectionId": "dbsect_113"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Education",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 757. Deputy Tony McCormack asked the Minister for Education and Youth the status of the proposed new school building for a school (details supplied) in County Offaly; if her Department has acquired or intends to acquire the identified site for the project; the stage the project is currently at within the School Building Programme; and if she will make a statement on the matter. [58710/25] ",
        "by": {
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "showAs": "Tony McCormack",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_757",
        "questionNumber": 757,
        "answerText": " Minister for Education and Youth  The project referred to by the Deputy has been devolved for delivery to the Laois Offaly Education Training Board (LOETB). A design team was appointed to progress the project through the necessary architectural stages of design, statutory approvals, procurement, and construction. The approved project brief will provide for a 400 pupil post primary school and 4-classroom special education unit.  In Quarter 2 2024, this project received Department approval to progress to Stage 2A (detailed design) of the architectural planning design process. This stage included the development of the design, and an accurate cost plan that best meets the design, as agreed.  In Quarter 2 2025, a Stage 2A report was submitted to the Department for review and is undergoing an intensive review from both a technical and cost perspective in accordance with the requirements of the Public Spending Code. Once this review is fully completed, the Department will engage with LOETB on the outcome.  In July, the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my Department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  All Government Departments are expected to publish their sectoral NDP Implementation Plans in November. My Department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "debateSection": {
          "showAs": "Schools Building Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_694",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_694.xml"
            }
          },
          "debateSectionId": "dbsect_694"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Social",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-10-22",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 98. Deputy Tony McCormack asked the Minister for Social Protection if he will report on his Department’s engagement with employers and the SME sector in relation to the introduction of auto-enrolment in 2026; and if he will make a statement on the matter. [57552/25] ",
        "by": {
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "showAs": "Tony McCormack",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-22/pq_98",
        "questionNumber": 98,
        "answerText": " Minister for Social Protection  The Programme for Government contains a commitment to introduce the Automatic Enrolment (AE) Retirement Savings System. The aim of introducing AE is to address the pension coverage gap that exists in Ireland and to provide workers with greater comfort and security regarding their retirement income. The new system - to be known as My Future Fund - will commence from 1 January 2026. The implementation of My Future Fund will pave the way for around 800,000 workers to be brought into a retirement savings scheme for the first time and I look forward to its implementation.  My Department’s engagement with employers and the SME sector in relation to the introduction of 'My Future Fund' is a key element in the communications strategy that has been developed to inform stakeholders of this important initiative. To date, thousands of employers and related professionals in HR and payroll have been directly reached through webinars, conferences and in person stakeholder meetings, most recently at the National Ploughing Championships. The second phase of the communications strategy commenced this summer with the launch of an advertising campaign on multiple media platforms. You may have seen the 'It all adds up' ice-cream advertisement that rolled out as part of this. It is envisaged that further guidance to employers will be provided in the lead up to the scheme's commencement and the form and content of this will be communicated closer to launch.  In addition to these activities, there is a very good, up-to-date information hub available to employers and anyone else who wants to learn more about My Future Fund and how it will work. This is at www.gov.ie/autoenrolment, and it includes links to information videos on the Department of Social Protection's YouTube channel.  Finally, it is important to note that employers will have very little to do to facilitate auto-enrolment being implemented because a new state agency called the National Automatic Enrolment Retirement Savings Authority (NAERSA) has been established to oversee and operate the new system. This includes taking care of all of the administrative processes involved around enrolment, contribution collection, investment, and providing access to accounts and information. Additionally, my Department has worked intensively with payroll providers over the past year to ensure their systems are changed to automate the deduction of contributions to My Future Fund. Accordingly, employers will not have to undertake any of their activities. Employers will simply be asked to register on the My Future Fund portal from the 1st December and provide payment details. Details of how to do this will be made available in a forthcoming advertising campaign over the coming weeks.  I hope this clarifies matters for the Deputy. ",
        "debateSection": {
          "showAs": "Pension Provisions",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-22/writtens/dbsect_119",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-22/writtens/mul@/dbsect_119.xml"
            }
          },
          "debateSectionId": "dbsect_119"
        }
      },
      "contextDate": "2025-10-22"
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Cabinet Committees",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/debate/mul@/dbsect_11.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/debate/dbsect_11",
          "debateSectionId": "dbsect_11"
        },
        "to": {
          "showAs": "Taoiseach",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " The Taoiseach  I propose to take Questions Nos. 1 to 14, inclusive, together.  The Cabinet committee on infrastructure last met on Thursday, 17 July and is scheduled to next meet on 3 November. The Cabinet committee works to drive infrastructure delivery and the implementation of the revised national development plan. We are prioritising the delivery of critical, growth-enhancing infrastructure, as outlined in the programme for Government. We have a responsibility to invest in the future and delivery of modern, sustainable and resilient infrastructure is vital for our national competitiveness, fostering regional development, delivering housing and meeting social needs.  The recently published review of the national development plan sets out the largest capital investment in the history of the State to unlock housing, upgrade water and energy infrastructure, deliver more roads and provide better public transport. In budget 2026 we announced €19.1 billion in Exchequer capital investment, an increase of €2 billion on 2025. This represents the highest annual spend to date in this country. Reform of delivery is also key to our approach. The new dedicated infrastructure division in the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation recently published its report outlining the most impactful barriers to infrastructure development, based on extensive consultation. This report has put significant detail behind what we already knew, that delivery of much needed infrastructure is taking too long.  Our regulatory and consent systems have evolved over time to the point where we have a complex landscape, characterised by an increasing number of decisions being referred to the courts for interpretation. All too frequently, this is leading to processes that take too long and an extremely conservative system. Next month, a detailed action plan to begin to tackle these barriers will be published. It will have a focused set of reforms that are practical, time-bound, and impactful. We will be taking action to strike a better balance between the rights of individuals and the public good. We will be simplifying regulation and consenting systems, reducing the administrative burden and cutting the red tape so that our systems are not delaying much-needed investment. The Government has now committed more than €275 billion to investment in infrastructure over the coming decade and the Cabinet committee will oversee the investment and the reforms required to maximise the efficiency with which it is delivered. \n Deputy Peter 'Chap' Cleere  I will speak about the construction of two brand-new multi-storey school buildings for the new post-primary schools, Kilkenny City Vocational School and Coláiste Pobail Osraí. These two schools have to be priority projects. Due to increasing numbers, the situation in these schools is unsustainable. They are currently under pressure to provide for existing and future student needs. The next phase of this project will be to release the funding and appoint the contractor. I hope - please God - that in a short time we will be turning the sod, which will make it real for people on the ground.  I acknowledge that €6 billion has been invested in schools nationally in the past five years and I welcome the July announcement of a further €7.5 billion for the Department of Education and Youth under the national development plan. However, this is a new chapter for both these schools We are looking forward to their development and to welcoming students into new buildings in the not-too-distant future. \n An Ceann Comhairle  Thank you, Deputy. \n Deputy Peter 'Chap' Cleere  We are counting on the Taoiseach's support to get these projects over the line as quickly as possible. \n Deputy Shane Moynihan  I welcome the urgency in the Taoiseach's reply on the need for us to build critical infrastructure to secure the growth of the country. As we seek to build more complex public infrastructure, such as public transport systems like the Luas for Lucan or primary care centres, in rapidly growing communities such as, in my constituency, Saggart, Rathcoole and parts of Citywest, it is important we ensure the international expertise we need to attract to the country to build that infrastructure is not put off by the long planing processes we have in place. If we are not attractive to those international companies and expertise, it will have the knock-on effect of increasing the cost of these projects in the future. We have to be aware of that and keep it to the front of our minds.  I also associate myself with the need for school buildings as a central part of infrastructure. I have raised a number of buildings in my constituency where we need to see progress with the Taoiseach and the Minister for education. Some are more than 40 years old and are in no condition for use at the moment. \n An Ceann Comhairle  Thank you, Deputy. \n Deputy Shane Moynihan  I encourage the Government to prioritise them as a matter of urgency. \n Deputy Séamus McGrath  I thank the Taoiseach for his reply. He mentioned the importance of investing in the future. Critical to that is investment in our city centres. Will he give an update on the task force for Cork city?  The programme for Government states that the model applied to the Dublin city task force will also be applied to Cork and will happen shortly. I hope this task force will deal with such strategic issues as improved transportation connectivity to Cork city, addressing issues around dereliction, vacancy and under-utilisation of buildings, investment in our public realm or streetscape, making the city a more attractive place to be and, critically from a day-to-day point of view, safety in our city centre and improved visibility of gardaí. I commend Cork City Council and Cork Business Association on their initiative of introducing wardens to the city centre recently. It was welcome. I hope the Taoiseach will give an update on when the Cork city task force will move on. \n Deputy Ruairí Ó Murchú  We have to see delivery of the catchment flood risk assessment and management, CFRAM, programme on flood protections, even in the short term. In estates like the one I am from, Bay Estate, there are issues with people trying to get flood insurance. Some who have bought houses recently are looking for letters of comfort which people used to get from the local authority, but are no longer available. The letters are to state the area has not been flooded. That issue needs to be dealt with in relation to the local authorities and insurance companies. However, beyond that we need to see delivery of CFRAM. That part of Dundalk is seriously suffering from the fact it does not have the requisite wastewater infrastructure. When we see heavy rains in my estate, we are incredibly worried about what will happen.  I am still waiting for a follow-up meeting with Uisce Éireann. I hope that will happen in the near future. However, we also need to ensure resourcing and finances are made available. \n Deputy Darren O'Rourke  I raise a number of important issues, including school buildings for Coláiste Ríoga in Dunshaughlin and Dunshaughlin Community National School, which have been waiting for a long time, despite having planning permission as far back as 2020. However, I will focus on the creaking wastewater treatment infrastructure. There have been numerous reports by the Environmental Protection Agency, EPA, and others on the need for investment in this infrastructure. It is welcome that there is a commitment to investment. How will projects be prioritised? I am particularly interested in the need for investment in the Kells wastewater treatment plant and in it happening as quickly as possible. \n Deputy Ruth Coppinger  A document was produced by Fingal County Council which identifies land banks, including one in Dublin 15 which could accommodate 20,000 homes.  Today, I received a reply from Fingal County Council. It has 105 families with termination notices or notices of eviction in Dublin 15 alone. I am coming to the Taoiseach as a TD from that area reporting a humanitarian crisis. I want to highlight some of the cases that our councillors are dealing with due to these notices of termination. One person has a child with cerebral palsy. Another person is in homeless accommodation with children who have no space to move and no area to play. Another person is in homeless accommodation and has to cross the M50 every single day. Another person has a child in an autism unit and, as the Taoiseach knows, it is very hard to get an alternative place if they lose their home. Another woman is still breastfeeding after having her newborn. There are many others with disabilities, autism and neurodiversity. When will we address the fact that instead of throwing money at developers, that money could have been given to councils to develop land banks like this, build real affordable homes and social homes, and end this humanitarian disaster? \n Deputy Paul Murphy  I want to ask about transport infrastructure, of which buses are the easiest, quickest and cheapest part to deploy. Every day, pretty much, I get emails about the state of the bus services in Ballycullen, Knocklyon and Rathfarnham. The 15 bus service is the busiest route in Dublin and the 15B is also grossly overcrowded. What is happening is that buses routinely fill up in the morning after the first few stops and then leave everyone behind at the later stops. This is a daily occurrence. One constituent says:  I now leave home at 7.15 a.m. to get to work for 9 a.m. My home is exactly 5 miles from the GPO. Who is accountable for privatising the buses? I do not remember getting to vote on it. I'm going to lose my job if this goes on.  A student says:  Something needs to be done quickly. I am increasingly desperate, anxious that I will miss something like an exam or something far more important than just a lecture in the near future.  For years, we have been promised that BusConnects is the answer but the A-spine is now delayed until the autumn of 2026 at the earliest, and it will likely be over capacity as soon as it starts. What is the Government planning to do to fix the bus service? \n Deputy Liam Quaide  Our two historic coastal towns in Cork East, Youghal and Cobh, are held back from realising their full potential by the absence of key infrastructural links. For Cobh, it is the lack of a second road access point to the Great Island. For Youghal, it is the failure to restore its rail connection with Midleton and, hence, its isolation from the eventual light rail system in the city. There are real and far-reaching impacts for residents of those towns as a result. They include safety on our congested roads and reduced potential for residential and economic development. In the case of Youghal, the daily quality of life impact of not having rail is grinding and immense. When will the Government show the infrastructural ambition that is needed in east Cork to allow Cobh and Youghal to reach their full, majestic potential? \n Deputy Peadar Tóibín  Storm Babet hit Cork two years ago. It caused damage estimated at about €200 million. It hammered the area, and it is very lucky that nobody was killed. Since then, practically nothing has been done. The area has been promised flood defences for decades but, in the best-case scenario, it is going to take eight years for those flood defences to come into play.  Navan is the largest town in the country without a rail line. More Meath people commute than in any other county and we commute further. Return journey times are about four hours at the moment. The former TD, Noel Dempsey, promised the rail line in 1994 but the best-case scenario is that it will be 2036 before it is built.  The Taoiseach said that the planning process has evolved. The planning process has not evolved. The Government created the planning process. We have the longest planning in Europe. We have the longest licensing and permits system in Europe. We have the longest tendering time in Europe at the moment. It is incredible. The whole system is falling apart. When will the Government reform it to make sure we can build infrastructure properly and on time in this country? \n Deputy Pádraig O'Sullivan  I raised an issue with the Taoiseach three weeks ago regarding the elective hospital in Cork. To be fair, the Taoiseach gave a good response and said it was a political decision that was made on the timing of the hospital, not a HSE decision. As I told the Taoiseach, the hospital was initially meant to take patients in 2027, but it is now looking like 2030 because the project will go from being a one-phase project to a multi-phase project. To be fair, the Taoiseach was quite forceful a number of weeks ago when he gave me his response. However, since that response, nothing has changed. I do not expect things to happen that quickly, to be fair, but the mood music is the same, unfortunately.  I would also reference capital projects in education, whether for ASD classes that were promised last year, extensions to buildings or new-build capital projects. The experience that I am hearing of in the House today is also being experienced by me, particularly in regard to the larger projects.  We talk about delivery here, and the Taoiseach has consistently talked about it since he was elected Taoiseach on the first occasion. Unfortunately, I am just seeing stalling, whether because of bureaucracy in the planning process, cost or issues with implementation. We need to ensure that the delivery is going to happen. \n Deputy Barry Heneghan  It is no surprise that I am bringing up the issue of private wires again. This is something that is going to reduce energy costs and speed up housing supply. It is a win-win for the Irish people. It will bypass bottlenecks in grid connections. I have recently been contacted by people who have solar farms that are waiting 18 to 24 months for connection. It will help businesses with large roof spaces to allow the loads and reduce their carbon footprints. It will also reduce the grid connection. It will enable large batteries for long-term energy storage to be more easily built out for our grid. With our offshore renewable energy, ORE, development, we are going to have huge curtailment. Electrolysis factories can easily be built for green hydrogen with private wires legislation. I urge that my Bill with the OPLA gets pushed through as fast as possible. It is going to benefit the Irish people. \n The Taoiseach  I thank the Deputies for raising these issues. I appreciate the focus from Deputy Cleere on Kilkenny City Vocational School and Coláite Pobail Osraí. I visited these schools many years ago with the late Bobby Aylward. I think his son was working there. I will certainly keep an eye on those and will talk to the Minister for education in respect of them. It is important. Substantial funding has been made available for education on the capital front. If we look at capital, we keep saying that delivery is not happening, and I did say that myself. At the same time, we are now spending the capital that has been allocated over the past two years. In 2020, 2021 and 2022, not all of the capital was spent and it was moved to other Departments to get spent. I refer to the past two to three years. This year, it is €2 billion-plus. We are at €19 billion, so we would have spent €17 billion last year. Inflation has happened and construction inflation has been higher than normal inflation, which has been a problem. The issue of European directives and European frameworks on the environmental side is proving very problematic in terms of flood relief programmes and so on, and there is no point in saying otherwise. I will pursue those.  Deputy Shane Moynihan reflected the idea that if we do not accelerate, we could lose international experience, which we are certainly seeking in respect of the metro and some of the more complex transport projects, such as light rail and so on. We have seen how that has worked in the past in terms of the Luas and other big developments. There are a lot of roadshows going on in terms of the implementation of the planning Act, the commencement of all regulations there, further legislation in respect of judicial review, which the Minister for justice is going to bring in, and the report coming back from the Minister, Deputy Chambers, in respect of removing the barriers and having a programme for the accelerated delivery of infrastructure projects. I know there are a number of school projects in the Deputy’s constituency that he has highlighted.  Deputy Seamus McGrath highlighted the need for investment in city centres. We significantly improved the living city initiative in the budget, which I advocated very strongly for. A lot will depend on the city council getting the maps back as quickly as possible for designation. With regard to shops, there will not be any timeline in respect of the date of the building, so any shop can convert and avail of the scheme. In terms of housing and other buildings, the year is now 1975 as opposed to 1915, so, hopefully, that will create some activity in the five cities and regional centres like Dundalk, Drogheda and other areas.  I have had meetings with the city council. People do not like the word “taskforce” in Cork - we are kind of fussy - so they are looking for a different title because the city has made progress. They had issues with that but, in any case, we are going to set up a group in terms of the roadmap for progress and a fresh approach to Cork city itself. It is important that we get the terms of reference and the focus right. Some work has been undertaken between UCC, the city council, the Cork Business Association and others in respect of how the city should progress. We want to make sure that in what we establish, we capture that and not duplicate or do something on a different strand or track.  The current development plan, up to 2028, is important. We are talking about a world class city driving local and regional growth and embracing diversity and inclusiveness. We have the large-scale regeneration projects in Cork docklands and Tivoli and the development of a much-enhanced, citywide public transport system. A lot of active travel projects have been delivered in Cork city. which is quite good to see. It is about bringing all of that together. I would be particularly interested in the inner city core - that we create new opportunities there. There is more work to be done for towns around the country in that respect. We need to bring more residential back in. This then creates new opportunities for a different kind of retail and hospitality into the future.  Deputy Ó Murchú referenced flood projection and CFRAM. I could not agree with the Deputy more. All the flood relief schemes are slow-moving, by definition, in terms of consultation with various groups, stakeholders and so forth. It is something I have raised with the Attorney General and others in terms of EU frameworks that govern a lot of this. Adaptation and flood relief are critical to the survival of towns and cities. They are urgent because of the impact of climate change, which is very real. \n Deputy Peadar Tóibín  Our averages are higher. \n The Taoiseach  Where we have implemented flood relief schemes, for example, Bandon, which I would be aware of, Fermoy and Clonmel, the impacts have been very significant in protecting those towns. The public good has to take precedence.  Deputy McGreehan raised the growth in population and the issue around wastewater treatment and so forth. Deputy O'Rourke raised the topic of school buildings, including a number in his area, creaking water infrastructure and the Kells wastewater treatment plant. We will be engaging with Irish Water given the additional it has now received.  Deputy Coppinger mentioned Fingal County Council. She said there are 20,000 homes. That is a matter for the council to get going. There is about €11 billion of public expenditure allocated to housing this year between capital, current and Exchequer funding. That is a lot of funding from the State side. We are not throwing money at developers. We are putting a lot of money into housing. We are putting a lot of money into social housing. \n Deputy Ruth Coppinger  They do not have the money for that, though. \n The Taoiseach  We need the private sector as well, in addition to the huge unprecedented public sector investment.  Deputy Paul Murphy raised public transport and the state of the bus services. A lot of investment has gone into the bus services. BusConnects has been slower because there has been huge consultation with people, residents and communities who had issues with BusConnects - let us be honest - and those were legitimate issues. We will continue to prioritise public services. It is not a privatised bus service. There is a substantial Bus Éireann contribution to public buses. Bus Éireann and Iarnród Éireann have expanded.  In reply to Deputy Quaide, there is work under way in respect of the alternative route into Cobh. There is the issue of the rail connection to the Youghal greenway. That is being developed but I get the issue. Cork to Midleton was the first railway expansion in its time and it reversed a trend lasting 50 or 60 years. It has been extremely effective. However, we need to continue to work on the economy within Youghal and create opportunities for people living in the town. It is an iconic and attractive area. That is something we have to continue to work on. We are very focused on the need to get that road situation into Cobh sorted. There are economic implications arising from that, in terms of releasing the docklands, the port, marina point and so on.  Deputy Tóibín raised Storm Babet. I dealt with some aspects of that in terms of the flood defence issues. The county council has worked on certain households and businesses and protecting them as interim steps, but, again, that is a complex scheme. It has numerous challenges and Midleton has numerous challenges in terms of potential flooding risks. That is understood. There is a lot of work going on to try to get that scheme going.  Deputy O'Sullivan raised the elective hospital. I put that back on the map at the time. I am going to pursue this. We have the site, and likewise in Galway. There has been a lot of school expansions in Cork as well. We will continue to focus to get more of those done, and more quickly. There are quite a number on the list that we need to get done. Now, with the allocation that has been given to education, we will certainly keep the pressure on to complete the projects. The Minister of State, Deputy Moynihan, is working particularly on the special education side to get special classes provided and get extensions done to accommodate extra autism classes.  Deputy Heneghen raised private wires. The Minister has got sanction from Cabinet and is progressing with the legislation. This is important because it will help some companies that are waiting for connection and so on. ",
        "questionType": "oral",
        "showAs": " 4. Deputy Tony McCormack asked the Taoiseach when the Cabinet committee on infrastructure will next meet. [46858/25] ",
        "questionNumber": 4,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Tony McCormack",
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_4"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Small and Medium Enterprises",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_70.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_70",
          "debateSectionId": "dbsect_70"
        },
        "to": {
          "showAs": "Foreign",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 104, 112, 141 and 159 together.  Deepening Ireland’s global engagement and driving trade and prosperity are core priorities for this Government and for my Department. Trade promotion in particular remains a key priority and there will be more than forty Ministerial-led trade missions to different parts of the world this year. Between now and the end of the year there will be trade missions supporting Irish business to the US, South Africa, Canada and Germany amongst others.  These of course involve close collaboration right across Government Departments and Agencies. My Department works closely with the Department of Enterprise, Tourism and Employment, given the lead role of that Department and the agencies under its remit on tourism and trade promotion, including supports provided to SMEs.  Tourism Ireland is responsible, for marketing the island of Ireland as a tourism destination working directly with partners in the tourism industry. Enterprise Ireland supports Irish companies expanding internationally and is the primary conduit for supports to SMEs such as the LeanPlus grant, GradStart, and the Dynamic Leadership – Roadmap to Growth programme.  My Department also plays a key role in coordinating Ireland’s overall international promotional work. This is primarily led through the Government Trade Forum, which I established earlier this year and which has already met on eight occasions. In addition to business representatives, the Forum also has the CEOs of the relevant State Agencies involved in trade promotion as part of its membership.  This work is also driven through the Headquarters Market Team which is co-chaired by officials in my Department and the Department of Enterprise, Tourism and Employment. Both bodies includes senior representatives from Tourism Ireland and Enterprise Ireland. Both the Government Trade Forum and the HQ Market Team oversee implementation of the Government’s new Action Plan on Market Diversification.  Under the Trade and Investment Strategy, our Ambassadors lead Local and Regional Market Teams, which includes all of the relevant State agencies including Tourism Ireland and Enterprise Ireland. These teams provide important strategic direction and effective coordination of Team Ireland’s activities overseas, with a view to maximising the value and impact of Ireland’s in-market promotional activities including on tourism promotion and supporting Irish businesses access to new markets.  Specific promotion activities supported by the diplomatic network include overseas trade and tourism missions organised by Enterprise Ireland and Tourism Ireland. More broadly, the diplomatic network also works to raise awareness of, and interest in, Ireland through annual global campaigns, particularly around St. Brigid’s Day, St. Patrick’s Day and Bloomsday.  My Department also leads coordination on major economic and public diplomacy initiatives, which serve to raise awareness of Ireland as a location to invest, study, live and do business. Examples of this include Ireland House at the South by Southwest (SXSW) Conference and Festival, which takes place in Austin, Texas, in March every year, and the recently completed Expo in Osaka, Japan.  My Department will continue to support mission-led initiatives in 2026, promoting Ireland as a tourism destination and a place to do business, as well as promoting Irish businesses, in close partnership with state agencies, and in line with our strategic priorities. ",
        "questionType": "written",
        "showAs": " 141. Deputy Tony McCormack asked the Tánaiste and Minister for Foreign Affairs and Trade the steps his Department and the diplomatic network are taking to support Irish small and medium enterprises seeking to enter new export markets; and if he will make a statement on the matter. [57060/25] ",
        "questionNumber": 141,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Tony McCormack",
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_141"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Diplomatic Representation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_110.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_110",
          "debateSectionId": "dbsect_110"
        },
        "to": {
          "showAs": "Foreign",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 155 and 172 together.  Global Ireland 2025 was launched by Government with the aim of doubling Ireland’s footprint and impact by 2025. Under the strategy, Ireland’s diplomatic footprint has expanded significantly with the opening or announcement of twenty-seven new missions.  In March 2024, five diplomatic missions were announced. They are embassies in Belgrade, Chisinau and Sarajevo; and consulates general in Málaga and Melbourne. The three embassies are now operational, with the consulates general scheduled to become so over the course of 2026. Budget 2026 includes an investment of €9.7 million in the opening and operation of these five new missions.  The Government will also invest an additional €2.5 million to reinforce Ireland’s mission network across the USA and strengthen Ireland’s presence in key locations around the world as part of our Market Diversification Strategy. This is a direct response to the new global trade challenges. As Minister responsible for trade policy, I know how important it is that we are responsive to meeting these economic challenges.  Budget 2026 sees us increase support for Irish citizens abroad. We will invest an additional €15 million into our Passport Service, while also investing an additional €1 million into the Emigrant Support Programme to support the government’s new diaspora strategy.  There has never been a more important time for Ireland to have a strong presence globally. The Government is committed to developing a Global Ireland 2040 strategy as an overarching masterplan to enhance Ireland’s place in the world, our influence in international affair, and to support the important work of our Embassies and Consulates promoting Ireland as a place to visit, work, invest or study. This is a Whole of Government strategy which will set out Ireland's place in the world and our diplomatic, economic and citizen priorities internationally. Decisions on further expansion of the diplomatic network will be made in the context of the new strategy. ",
        "questionType": "written",
        "showAs": " 172. Deputy Tony McCormack asked the Tánaiste and Minister for Foreign Affairs and Trade if he will provide an update on the expansion of Ireland’s diplomatic and consular network globally under the Global Ireland strategy; and if he will make a statement on the matter. [57061/25] ",
        "questionNumber": 172,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Tony McCormack",
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_172"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Cybersecurity Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_147.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_147",
          "debateSectionId": "dbsect_147"
        },
        "to": {
          "showAs": "Foreign",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  The EU remains unwavering and unequivocal in its strong condemnation of the persistent malicious activities posed by Russia. These form part of broader, coordinated, and long-standing hybrid campaigns aimed at threatening and undermining the security, resilience and democratic foundations of the EU, its Member States and its partners. These acts include disruption to critical infrastructure, cyber-attacks, spreading misinformation and disinformation, and attempts to interfere in electoral processes.  Like other Member States, Ireland is susceptible to these malicious acts and the Government takes the risks posed extremely seriously.  The EU continues to take a strategic approach towards Russia’s hybrid threats. Building on the development of the Hybrid, Cyber and FIMI (Foreign information and Manipulation Interference) Toolboxes, which establish a framework for a coordinated response to hybrid and cyber campaigns affecting the EU and its Member States, in October 2024 the EU introduced a new set of Restrictive Measures in view of Russia’s destabilising activities. A Hybrid Rapid Response Teams concept has also been developed to support EU Member States and partners. Ireland supports the full use of all means available to prevent, deter and respond to Russia’s hybrid and cyber activities – including through sanctions. Ireland welcomes new initiatives to support Europe’s readiness and protection, including the publication of the Preparedness Union Strategy. We look forward also to the introduction of a European Democracy Shield later this year, to enhance the ability of the EU and Member States to combat disinformation and malign online manipulation by foreign powers in Europe. Ireland’s membership of the European Centre of Excellence for Countering Hybrid Threats in Helsinki contributes to Ireland’s capacity building with regards to countering hybrid threats.  Domestically, the Government is implementing a range of relevant measures at national level to strengthen our resilience and combat threats from state and non-state actors. This includes measures to safeguard the electoral system and address disinformation through the Electoral Reform Act and the Online Safety and Media Regulation Act which provide for the establishment of An Coimisiún Toghcháin and Coimisiún na Meán respectively. These have specific powers in relation to countering disinformation. A National Counter Disinformation Strategy has also been published. Ireland has also increased investment in cyber security, including strengthening the role and resources of our National Cyber Security Centre, and enhancing our network security. ",
        "questionType": "written",
        "showAs": " 199. Deputy Tony McCormack asked the Tánaiste and Minister for Foreign Affairs and Trade the discussions he has had with EU counterparts in regard to Russian cyberattacks, disinformation, and political subversion aimed at weakening democracies and dividing societies; and if he will make a statement on the matter. [56958/25] ",
        "questionNumber": 199,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Tony McCormack",
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_199"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Trade Relations",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_148.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_148",
          "debateSectionId": "dbsect_148"
        },
        "to": {
          "showAs": "Foreign",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  Ireland is engaged on fostering economic investment and trade with Ukraine where possible, and is supportive of examining opportunities for private sector investment and cooperation, particularly in the context of the country’s recovery and reconstruction.  Ireland was represented at the Ukraine Recovery Conference in Rome on 10 July by Neale Richmond T.D., Minister of State at the Department of Foreign Affairs and Trade. This annual event is important in terms of mobilising continued international support for the recovery, reconstruction, reform, and modernisation of Ukraine. At the conference, Minister Richmond delivered a national statement, setting out Ireland’s commitment to maintaining its support for Ukraine, including for its recovery and reconstruction.  In addition to economic promotion work carried out by our embassy in Kyiv, Enterprise Ireland’s office in Warsaw is active in these efforts and is preparing for The Rebuild Ukraine: Construction and Energy Conference and Exhibition, to take place in Warsaw on 13 – 14 November.  Ireland is not currently considering such an appointment for Ukraine. ",
        "questionType": "written",
        "showAs": " 200. Deputy Tony McCormack asked the Tánaiste and Minister for Foreign Affairs and Trade if he has considered appointing a trade envoy to Ukraine to build relationships for the future; and if he will make a statement on the matter. [56959/25] ",
        "questionNumber": 200,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Tony McCormack",
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_200"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Small and Medium Enterprises",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_420.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_420",
          "debateSectionId": "dbsect_420"
        },
        "to": {
          "showAs": "Social",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Social Protection  The Programme for Government contains a commitment to introduce the Automatic Enrolment (AE) Retirement Savings System. The aim of introducing AE is to address the pension coverage gap that exists in Ireland and to provide workers with greater comfort and security regarding their retirement income. The new system - to be known as My Future Fund - will commence from 1 January 2026. The implementation of My Future Fund will pave the way for around 800,000 workers to be brought into a retirement savings scheme for the first time and I look forward to its implementation.  My Department’s engagement with employers and the SME sector in relation to the introduction of 'My Future Fund' is a key element in the communications strategy that has been developed to inform stakeholders of this important initiative. To date, thousands of employers and related professionals in HR and payroll have been directly reached through webinars, conferences and in person stakeholder meetings, most recently at the National Ploughing Championships. The second phase of the communications strategy commenced this summer with the launch of an advertising campaign on multiple media platforms. You may have seen the 'It all adds up' ice-cream advertisement that rolled out as part of this. It is envisaged that further guidance to employers will be provided in the lead up to the scheme's commencement and the form and content of this will be communicated closer to launch.  In addition to these activities, there is a very good, up-to-date information hub available to employers and anyone else who wants to learn more about My Future Fund and how it will work. This is at www.gov.ie/autoenrolment, and it includes links to information videos on the Department of Social Protection's YouTube channel.  Finally, it is important to note that employers will have very little to do to facilitate auto-enrolment being implemented because a new state agency called the National Automatic Enrolment Retirement Savings Authority (NAERSA) has been established to oversee and operate the new system. This includes taking care of all of the administrative processes involved around enrolment, contribution collection, investment, and providing access to accounts and information. Additionally, my Department has worked intensively with payroll providers over the past year to ensure their systems are changed to automate the deduction of contributions to My Future Fund. Accordingly, employers will not have to undertake any of their activities. Employers will simply be asked to register on the My Future Fund portal from the 1st December and provide payment details. Details of how to do this will be made available in a forthcoming advertising campaign over the coming weeks.  I hope this clarifies matters for the Deputy. ",
        "questionType": "written",
        "showAs": " 510. Deputy Tony McCormack asked the Minister for Social Protection the assistance or guidance his Department or agencies under the remit of his Department is providing to small business owners in relation to the introduction of auto-enrolment in 2026; and if he will make a statement on the matter. [57424/25] ",
        "questionNumber": 510,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Tony McCormack",
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_510"
      }
    },
    {
      "contextDate": "2025-10-21",
      "question": {
        "debateSection": {
          "showAs": "Hospital Appointments Status",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/mul@/dbsect_687.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-21/writtens/dbsect_687",
          "debateSectionId": "dbsect_687"
        },
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " Minister for Health  Under the Health Act 2004, the Health Service Executive (HSE) is required to manage and deliver, or arrange to be delivered on its behalf, health and personal social services. The Minister for Health is prohibited from directing the HSE to provide a treatment or a personal service to any individual or to confer eligibility on any individual.  In relation to the particular query raised, as this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "showAs": " 799. Deputy Tony McCormack asked the Minister for Health when an appointment will be made for a person (details supplied). [56824/25] ",
        "questionNumber": 799,
        "date": "2025-10-21",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Tony McCormack",
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-21/pq_799"
      }
    },
    {
      "contextDate": "2025-10-14",
      "question": {
        "debateSection": {
          "showAs": "Cabinet Committees",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/debate/mul@/dbsect_11.xml"
            },
            "pdf": null
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-14/debate/dbsect_11",
          "debateSectionId": "dbsect_11"
        },
        "to": {
          "showAs": "Taoiseach",
          "roleCode": null,
          "roleType": null,
          "uri": null
        },
        "answerText": " The Taoiseach  I propose to take Questions Nos. 1 to 12, inclusive, together.  The Cabinet committee on the economy, trade and competitiveness last met on 14 July and the next meeting is scheduled for 27 November. The membership comprises the Taoiseach; Tánaiste; Minister for Finance; Minister Public Expenditure, Infrastructure, Public Service Reform and Digitalisation; Minister for Climate, Energy and the Environment, and for Transport; Minister for Agriculture, Food, Fisheries and the Marine; Minister for Enterprise, Tourism and Employment; Minister for Culture, Communications and Sport; and Minister for Further and Higher Education, Research, Innovation and Science. Other Ministers and Ministers of State are invited to attend when requested.  The committee oversees the implementation of the programme for Government commitments related to sustainable economic and employment growth; trade; competitiveness and productivity; innovation; the national digital strategy and pensions.  Despite many external challenges we continue to see strong economic performance with record numbers of people in work, low unemployment and real wage growth. The economy continues to demonstrate its resilience and ability to adapt to changing global circumstances. As evidenced by last week's budget we will continue to advance an economic model founded on a well-established and successful pro-enterprise policy framework, a stable and sustainable regulatory and tax environment with sound management of the public finances and significant investment in the infrastructure, energy and skills required to ensure our future competitiveness and productivity.  In an increasingly unpredictable global economy a proactive approach to market diversification will promote Ireland's economic resilience, foster competitiveness and productivity and strengthen and support our trade and investment model ensuring sustainable growth. For example, last month I met with Prime Minister Carney. While in Ottawa I launched a comprehensive Ireland-Canada economic report. The report highlights that Ireland is now the tenth-largest investor in Canada, with inward investment flows of more than €14 billion. Trade agreements are essential to our efforts to strengthen our economy, increase market diversification, protect jobs and positively benefit enterprises and consumers alike through increasing their options, reducing tariffs and costs and maintaining standards. Irish and European Union exports to the world facilitated by trade agreements support more than 750,000 jobs here, which is approximately one in three jobs. This trade supports real livelihoods.  I ask the Opposition parties why they continually oppose the Canada-European Union Comprehensive Economic and Trade Agreement, CETA, when it has worked both ways and enhanced jobs in Ireland, created more jobs in Ireland and protected jobs. Yet the Opposition parties opposed it all the way. That is completely out of touch with and disconnected from what puts bread on the table in Ireland. We will continue as a Government to invest in the future of Ireland while preserving the jobs, stability and prosperity of today.  As with all policy areas, issues relating to the economy are regularly discussed also at full Cabinet meetings where all formal decisions are made. \n Deputy Malcolm Byrne  I strongly welcome the Taoiseach's commitment to the implementation of CETA and to the growth of our trade relations with Canada. However, I want to raise EU competitiveness. It is over a year since the publication of the Draghi report yet the European Policy Innovation Council, the Brussels-based think-tank states that only 11% of the recommendations are on the road to implementation. We are seriously falling behind in Europe in terms of competitiveness. One of the areas is network resilience and our digital infrastructure. We are shortly to publish the new national digital and AI strategy. The Taoiseach might give us an update on that. As part of Ireland's competitiveness strategy, will the Taoiseach ensure we will have the necessary digital infrastructure to be able to compete in this century? \n Deputy Shane Moynihan  Cuirim failte roimh an dul chun cinn atá á dhéanamh i leith saorthrádáil timpeall an domhain. Key to any free trade and any strong trading relationships is a strong, export-led economy driven by our indigenous firms. While the budget made some moves in increasing the attractiveness of entrepreneurship and developing an entrepreneurial economy, could other issues be considered such as setting up a number of metrics around how we measure the number of employees employed by indigenous SMEs and the proportion of corporation tax those companies pay? Can some funding be allocated or thought given to schemes designed to mentor new entrepreneurs from existing proven entrepreneurs who have been successful in this field? For those companies that we want to scale up and keep in Ireland can the Government make it easier for employee-share options to be made available in those companies to ensure everybody has bought into the success of those companies and that they are allowed to scale up?  We need to scale up our indigenous industry and I encourage the Taoiseach to consider that too. \n Deputy Shay Brennan  Internationally recognised digital hubs like Station F in Paris have profoundly transformed their local and regional economies by attracting start-ups, venture capital and cutting-edge innovation ecosystems. The Government has signalled strong backing for digital hubs as cornerstones of Ireland's economic competitiveness and future growth. Sandyford Business District is at an advanced stage of planning its own large-scale digital innovation campus. This is uniquely suited due to its strategic location, quality infrastructure and well-established international business community. With proactive Government support, Sandyford could emerge as a flagship hub of digital entrepreneurship and innovation on the European stage. How can local stakeholders best engage with and bring this opportunity to the Government's immediate attention to ensure it receives the co-ordinated backing necessary for success? \n Deputy Naoise Ó Cearúil  I spent my summer months drafting my first Bill to establish a national AI office. I was delighted to see on 8 September the Minister, Deputy Peter Burke, announcing that this office will be established. Indeed, in the budget last week funding was allocated for this very office. Can the Cabinet committee consider naming this office an oifig náisiúnta um intleacht shaorga, or ONIS for short? It is a good name, one we can all remember. It also fits with in with Acht na dTeangacha Oifigiúla as well. It is a name people will remember. Making sure it is in Irish will give it that little bit of strength as well. \n Deputy Tony McCormack  Our national success in enterprise depends on our competitiveness and our competitiveness depends on reliable energy infrastructure. In County Offaly we have a great energy infrastructure that is close to capacity. EirGrid is under real pressure to expand it. Offaly’s central location and long history in energy generation means it is ideally placed to help to meet that challenge. Bord na Móna, with its expertise and local presence, could play a key part in strengthening grid capacity across the midlands. I urge the Government to work with Bord na Móna and EirGrid to unlock Offaly’s full potential as an energy investment hub. \n Deputy Ruth Coppinger  The Government took a decision in the budget to give huge tax cuts to developers, the fast food industry and the hospitality sector to boost trade and competitiveness. In doing so, it has made people 2% worse off according to the ESRI and the bottom 10% of society are 4.4% worse off.  I will specifically ask the Taoiseach about electricity. We have the highest electricity costs in the EU and we hear that retail prices are three times higher than wholesale prices. Massive profiteering is taking place in electricity that will increase poverty, but it is also a huge cost on small businesses, which the Government claims it wants to help. When will we have a not-for-profit electricity sector? The Taoiseach talked as if it was a terrible thing in response to an earlier question. It would be hugely supported in society because it is the cost that is worrying people more than anything else. Average bills are also due to increase €207 more than last year with no support. \n An Ceann Comhairle  Thank you, Deputy. \n Deputy Ruth Coppinger  Maybe it is not such a bad idea after all to go back to the model we had in the 1970s and 1980s when people could afford electricity. \n Deputy Darren O'Rourke  In the audiovisual room this afternoon, a briefing organised by Deputy Guirke was addressed by Ciaran Staunton and Kelly Fincham on barriers faced by Irish citizens returning from abroad. They raised a range of barriers, such as access to driving licences and planning permission, but the issue I want to raise that relates to the economy and trade is the dearth of teachers, occupational therapists and other allied health professionals and the recognition of nursing qualifications from abroad. Is that something the Taoiseach can address to allow people to come home and contribute to the economy in the public sector or private sector? \n Deputy Paul Murphy  Education is crucial to competitiveness. We will not have it without teachers, yet many schools are in crisis situations. I will give one example from my constituency. St. Mary's Boys National School in Rathfarnham is set to lose another teacher next year, having lost one in September, unless the Government commits to reducing class sizes. I have been contacted by many parents, one of whom wrote to say:  My son is already in a class that exceeds the national average size. Without intervention, he may soon be placed in an even larger multigrade class, which would significantly affect the quality of his education. The school is currently just four pupils short of retaining its 16 class teachers.  In the budget, it was announced that 1,042 teachers will be hired, which will not cover the 1,046 teachers who will be retiring so it will not reduce the pupil-teacher ratio. The hospitality VAT rate cut cost the equivalent of hiring 7,800 teachers, illustrating where the Government's priorities lie. Will the Taoiseach commit to reducing class sizes? \n Deputy Emer Currie  I raise the deemed disposal rule for exchange traded funds, ETF. I welcome the reduction in the exit tax rate announced in the budget, but the rule itself remains the difficulty. Under the deemed disposal rule, investors are taxed every eight years on gains they have not realised. This creates an opportunity cost for savers. To pay the tax, investors may need to liquidate part of their ETF holdings or use cash that otherwise could have remained invested, meaning the long-term growth is reduced and the benefits of compounding are not fully realised. In both cases, I am told, it penalises prudent, long-term investments. Will the Taoiseach indicate whether the Government has any short- or long-term plans to address the rule? \n Deputy Rose Conway-Walsh  Energy costs in the State are astronomical and are having a detrimental impact on competitiveness. This rip-off of Irish customers was confirmed again today by a recent international report, which revealed that our retail electricity prices are three times higher than wholesale prices, one of the highest price gaps in the world. We are completely exposed to the price of fossil fuels on the international markets and this is driving up the cost of doing business here, with businesses being ripped off.  Decarbonising and renewable energy must be prioritised to address this, but the technology for businesses to decarbonise often requires an upfront investment that is unrealistic and too expensive for many businesses. Existing supports in place from Enterprise Ireland, under the green transition fund among others, are not seeing participation rates that will contribute to Ireland achieving its goals of reducing emissions by 51% by 2030 and climate neutrality by 2050. What additional measures to assist businesses to decarbonise is the Government putting in place to make energy more affordable, reduce the cost of doing business and boost our competitiveness? \n The Taoiseach  I thank all the Deputies who contributed. Deputy Malcolm Byrne was first out of the traps about the 11% of recommendations, which is quite low, implemented from the Draghi report. Ireland is already identifying the Single Market and some of the reforms in the Draghi and Letta reports for our Presidency of the European Union in the latter half of next year. We would like to see an acceleration of the implementation of the recommendations of the Draghi report because they are essential to European Union competitiveness. Draghi pointed out that barriers that exist are much more costly than any tariff imposed by the US, by three times in some cases.  The publication of the digital strategy and of an updated AI strategy is imminent. Aontaím leis an Teachta Shane Moynihan go bhfuil cúrsaí trádála ríthábhachtach ó thaobh cúrsaí geilleagair na tíre. On employee metrics, I fully agree we need to scale up indigenous companies. Looking strategically at the country into the future, there is an inextricable link between multinational investment and our own SMEs or indigenous enterprises. Many of them are part of the supply chain. Many have grown in expertise because of their relationships with multinational companies but there has been in issue with scaling and growing multinationals in such areas as life sciences or technology. The one area in which we have grown multinationals is food- and agriculture-based industries with such examples as Glanbia, Kerry Group and so on. There is certainly an issue in regard to employee share options and so forth.  Enterprise Ireland manages a leadership for growth programme for companies. In the past, they went to Harvard. I met representatives of 35 companies in New York recently. When I was at the UN , we did a bit of work with our companies and 35 are availing of the leadership for growth programme. They are SMEs. I have met many people who have been on that programme over the years and they all say it had a beneficial impact on their mindset, their ambitions as CEOs and how they had been organising their companies up to that point. Mentorship is extremely important and we work with many companies in the US and the larger Irish companies that help us to mentor emerging Irish companies. However, strategically, the future has to be to increase the scaling up of Irish-owned companies for long-term competitiveness.  Deputy Shay Brennan is on a similar mission, with a specific application to Sandyford. I met the owner of Station F recently. He is an innovative medical person. He is one of the first people I have met in Europe who I can say is a real business leader. We generally interact with US behemoths, such as the digital giants Google, Amazon and so on, but here is a French person, a European, who has a clear vision of the enterprise side and the digital side in particular, including incubation and so on. In terms of Sandyford and how to progress, engaging with Enterprise Ireland is critical in the whole area of incubation and supports available from that unit. Linking up with third level institutions is important in that area because it can give added heft and companies can draw on talent, ability and brains on the campus and link them to the business campus. I recommend those two options and if I can be of any help in talking to Enterprise Ireland and going out to see it, I will because the future is in creating hubs like that to enable entrepreneurship to flourish.  We can do more, if I am honest, on budgetary and fiscal policy, but we can only do so much in any one budget. Very often when we do things for entrepreneurship, they get attacked politically as looking after the wealthy or businesses and so on, whereas we are trying to enable an environment where jobs will be created in the future and they are good high-quality jobs.  Deputy  Ó Cearúil's suggestion on the national AI office was excellent. I will talk to the Minister in respect of oifig náisiúnta na h-intleachta saorga. The tuiseal ginideach was spot on. That was the old de Valera policy - name it in Irish and people will cop on and learn a bit of Irish along the way.  It is good news. We made rapid progress on the proposals. Many Deputies recommended the creation and establishment of a national AI office. It is only some months ago it was aired at Leaders’ Questions. We have moved to progressing that and putting it on a statutory basis. I think the AI issue is huge. We have a lot of catching up to do in Europe and in Ireland in respect of AI. There is also the relationship with energy use and AI, which is going to be very challenging, which means we will definitively need offshore wind from 2030 onwards to enable us to avail of the AI revolution. Okay, people will question it. Some are saying now it could be like dot.com, but it is here to stay long term. We need to make sure we can get our heads around it and be part of that agenda into the future. The general view worldwide is that Europe is way behind the United States and China in respect of this.  On Deputy McCormack’s point, because of their previous history Offaly and the midlands is well positioned to become an energy hub using Bord na Móna. I pay tribute to Bord na Móna. As a state company it has transformed very effectively from being a fossil fuel-based company with many climate issues to transforming it to almost the opposite agenda very quickly. It is a very good example of a state company aligning itself with state policy very quickly; not resisting it but going with it. I have been down there quite a lot with Bord na Móna which has enlisted third-party companies which are investing in energy projects in the midlands. The transition programme funding we have received from Europe and, indeed, the national transition funding should help to underpin the continuation of the midlands and Offaly as an energy hub into the future.  Deputy Coppinger spoke about not-for-profit. Someone has to pay in the end. You just cannot magic the grid or investment in it. There is an onus on the Deputy to identify the massive state investment that would be required in addition to what we are investing already to get to a not-for-profit electricity or energy system in Ireland. She referenced the 1970s and 1980s. I was a student in the early 1980s. The 1980s was not a good decade economically. \n Deputy Ruth Coppinger  I know. Fianna Fáil sent a lot of people emigrating. I remember it. \n The Taoiseach  I would not be sentimentally returning to the 1980s as a model for the future. I just would not do that. \n Deputy Ruth Coppinger  You are gas. \n An Ceann Comhairle  Deputy, please. \n The Taoiseach  The population was much lower. There have been dramatic changes in Irish society in terms of population growth, economic growth, the challenge of climate and all of that. It is not as simple as presented. We cannot keep doing one-off budget packages forever. That seems to be the suggestion from the Opposition----- \n Deputy Ruth Coppinger  We are saying to nationalise electricity. \n An Ceann Comhairle  Deputy, please. \n The Taoiseach  -----that we should have a one-off package this year, a one-off package next year and so on. We just cannot continue to do that.  Deputy O’Rourke raised an important issue. The qualifications issue pertains to some of the regulatory bodies in specific areas, namely the Medical Council, the Teaching Council – it may not like me saying this but I think it can be quite conservative – and some of the other bodies such as Coru. I have been in touch with the Minister for Health and the Department is moving on Coru. It says it is moving on therapists, for example. It is interesting. It has taken too long to register people who are clearly well qualified and have good international qualifications in speech and language, physio or occupational therapy and it could be a year or a year and a half before they are recognised here. We must be much more nimble. Then there are things like driving licences and all of that. There is a very legitimate issue in terms of people returning to live in Ireland from overseas and how we can reduce the barriers to them reintegrating into society and facilitating that.  Deputy Murphy spoke about education. If a school is four pupils short, he knows it can appeal on the basis of developing school status to retain a teacher. That system has been there for a long time for retaining teachers. Over the last number of years, we have significantly reduced the pupil teacher ratio. I am not saying that is in this case but sometimes it depends on how a principal or the management of a school will deploy teachers. They may have other priorities and they may do it in different ways. That also happens. In this case the Deputy is saying the school is down a teacher and due to lose again next year. I do not know if that is because of population demographics in the area or not but we are investing a lot in education in recent years and we will continue to do that.  Deputy Currie mentioned the exit tax rate in terms of funds and so on. I think the Finance Bill might be an opportunity for her to press that case with the Minister, Deputy Donohoe. That allows for more detailed examination of issues of that kind. I accept the basic principle that sustainable investment and good practice is what we should be encouraging and facilitating.  To Deputy Conway-Walsh I would say renewable energy is the key. Deputy Conway-Walsh is gone. I am kind of alarmed - there were terrible protests about having Leaders' Questions once a week and so on but the leaders of all the parties are not here at all. There we go. Deputy Conway-Walsh has left after asking her question. She will be back, I think, to be fair. \n An Ceann Comhairle  She is here. \n The Taoiseach  I am sorry, Deputy Conway-Walsh. I was just saying that renewable energy is the key and the green transition is the key. I accept her point. One of the issues we have is the over-reliance on fossil fuel important on a number of fronts. Energy security is the key one, by the way. Everybody here is complaining about the decision to have a LNG facility. It would be utterly irresponsible if we do not develop that. My concern is the time line to develop it because we have no back up if anything was to happen to the interconnectors. That is a big security vulnerability. \n An Ceann Comhairle  We have two questions left with 20 minutes and 30 seconds. ",
        "questionType": "oral",
        "showAs": " 5. Deputy Tony McCormack asked the Taoiseach when the Cabinet committee on the economy, trade and competitiveness will next meet. [46859/25] ",
        "questionNumber": 5,
        "date": "2025-10-14",
        "house": {
          "houseNo": "34",
          "showAs": "34th Dáil",
          "committeeCode": "",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "houseCode": "dail"
        },
        "by": {
          "showAs": "Tony McCormack",
          "memberCode": "Tony-McCormack.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-14/pq_5"
      }
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  I propose to take Questions Nos. 108, 113 and 121 together.  The Revised National Planning Framework (NPF) was finalised and approved by Government and the Oireachtas in April 2025. The Revised NPF identifies the need to plan for approximately 50,000 additional households per annum to 2040.  The Revised NPF provides the basis for the review and updating of Regional Spatial and Economic Strategies (RSESs) and local authority development plans to reflect such critical matters such as updated housing figures or projected jobs growth, including through the zoning of land for residential, employment and a range of other purposes.  To ensure that local authority development plans reflect the requirements of the NPF in respect of housing as soon as possible, I issued the NPF Implementation: Housing Growth Requirements Guidelines under section 28 of the Planning and Development Act 2000 in July 2025. These guidelines set out the housing demand scenario to 2040 for each local authority, by translating the NPF housing requirements into average annual figures and require planning authorities to commence the process of varying their development plan to meet the new housing growth requirements.  In addition to the baseline housing growth requirement, planning authorities have also been requested to address the scope for additional provision of up to 50% in excess of the baseline housing growth requirement, in light of the urgent need to increase housing delivery and to optimise the ability to deliver on the housing requirements of the Revised NPF. This approach recognises the fact that, for a variety of reasons, a relatively significant proportion of zoned lands are not activated over the period of a development plan.  Planning authorities are currently assessing their current development plan and undertaking a review of the adequacy of existing zoned lands to cater for the new Housing Growth Requirement figures and the potential for ‘additional provision’.  This review and analysis will inform the preparation of a Chief Executive’s report to be submitted to the elected members which will set out the position in respect of each local authority, and the Chief Executive’s recommendations to the members as to what variations to the Plan may be required in order to meet the requirements of the Guidelines. A copy of the Chief Executive’s report is required to be submitted to the Minister and to the Office of the Planning Regulator. Planning Authorities are currently undertaking this initial review and assessment and will be engaging with their elected members.  The zoning of land for particular purposes, including housing, is an exercise undertaken by planning authorities as part of their overall statutory plan function generally as part of a development plan under sections 9 to 13 of the Planning and Development Act, 2000 (as amended), but can at present also be carried out as part of a local area plan (LAP) process. The making of a development plan or an LAP is a reserved function of the elected members of each authority.  Section 31 of the Planning and Development Act 2000 empowers the Minister to direct a planning authority to take such measures as he or she may require to ensure that its development plan complies with the requirements of the Act. The statutory procedures governing the issuing of ministerial directions are found in sections 31, 31AM and 31AN of the 2000 Act.  The power to issue a direction is conditional on the Minister first receiving a formal recommendation on the matter from the Office of the Planning Regulator (OPR) and thereafter forming the opinion that one or more of the criteria set out in section 31(1) of the Act apply. These matters include, but are not limited to, where a plan fails to set out an overall strategy for the proper planning and sustainable development of the area, or a plan is not consistent with the objectives of the National Planning Framework (NPF) and the Regional Spatial and Economic Strategy (RSES).  Since its establishment in April 2019, the OPR has had statutory responsibility for the evaluation and assessment of local authority plans in accordance with section 31P of the Act. The Office is statutorily independent of the Minister in the performance of this function pursuant to section 31R of the Act.  The Planning and Development Act 2024, which is being commenced on a phased basis, includes updated arrangements for the issuing of national planning policy, through the replacement of section 28 Ministerial Guidelines with Government-approved National Planning Statements, along with revised arrangements for the issuing of draft and final directions to regional assemblies and local authorities to ensure consistency throughout the hierarchy of plan making. The provisions relating to National Planning Statements commenced on 2 October 2025.  National Planning Statements will include two distinct elements: (a) National Planning Policies and Measures, with which planning authorities will be required to be consistent in the exercise of their functions; and (b) National Planning Policy Guidance’, which planning authorities will be required to have due regard to. Where a new National Planning Statement is issued, regional assemblies, and in due course, planning authorities, will be required to submit a report to the Office of the Planning Regulator (OPR) setting out their view as to whether the RSES or development plan is materially consistent with the national planning policies and measures set out in the National Planning Statement.  Where the OPR is satisfied that there is a material inconsistency, and the steps proposed by the regional assembly or planning authority are sufficient to remove the material inconsistency, the expedited amendment procedures set out in the Act of 2024 may be invoked. If not satisfied, the OPR can make a recommendation to the Minister that a draft direction under the Act of 2024 should be issued. Furthermore, the OPR can make a recommendation to the Minister that such a draft direction should be issued where it does not receive a report from the regional assembly or planning authority and the OPR is of the opinion that there is a material inconsistency.  The Minister will be required to consider the OPR recommendation, statement of reasons and proposed terms for the draft direction and make a decision as to whether to accept that recommendation or not. ",
        "by": {
          "showAs": "Tony McCormack",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "memberCode": "Tony-McCormack.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "date": "2025-10-08",
        "questionNumber": 108,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/dbsect_104",
          "debateSectionId": "dbsect_104",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/mul@/dbsect_104.xml"
            }
          },
          "showAs": "Planning Issues"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-08/pq_108",
        "showAs": " 108. Deputy Tony McCormack asked the Minister for Housing, Local Government and Heritage the measures he intends to take to address the failure of some local authorities to implement national planning and rezoning recommendations in a timely and consistent manner; if he will publish details of the councils which are not complying; and if he will make a statement on the matter. [53756/25] "
      },
      "contextDate": "2025-10-08"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  I propose to take Questions Nos. 108, 113 and 121 together.  The Revised National Planning Framework (NPF) was finalised and approved by Government and the Oireachtas in April 2025. The Revised NPF identifies the need to plan for approximately 50,000 additional households per annum to 2040.  The Revised NPF provides the basis for the review and updating of Regional Spatial and Economic Strategies (RSESs) and local authority development plans to reflect such critical matters such as updated housing figures or projected jobs growth, including through the zoning of land for residential, employment and a range of other purposes.  To ensure that local authority development plans reflect the requirements of the NPF in respect of housing as soon as possible, I issued the NPF Implementation: Housing Growth Requirements Guidelines under section 28 of the Planning and Development Act 2000 in July 2025. These guidelines set out the housing demand scenario to 2040 for each local authority, by translating the NPF housing requirements into average annual figures and require planning authorities to commence the process of varying their development plan to meet the new housing growth requirements.  In addition to the baseline housing growth requirement, planning authorities have also been requested to address the scope for additional provision of up to 50% in excess of the baseline housing growth requirement, in light of the urgent need to increase housing delivery and to optimise the ability to deliver on the housing requirements of the Revised NPF. This approach recognises the fact that, for a variety of reasons, a relatively significant proportion of zoned lands are not activated over the period of a development plan.  Planning authorities are currently assessing their current development plan and undertaking a review of the adequacy of existing zoned lands to cater for the new Housing Growth Requirement figures and the potential for ‘additional provision’.  This review and analysis will inform the preparation of a Chief Executive’s report to be submitted to the elected members which will set out the position in respect of each local authority, and the Chief Executive’s recommendations to the members as to what variations to the Plan may be required in order to meet the requirements of the Guidelines. A copy of the Chief Executive’s report is required to be submitted to the Minister and to the Office of the Planning Regulator. Planning Authorities are currently undertaking this initial review and assessment and will be engaging with their elected members.  The zoning of land for particular purposes, including housing, is an exercise undertaken by planning authorities as part of their overall statutory plan function generally as part of a development plan under sections 9 to 13 of the Planning and Development Act, 2000 (as amended), but can at present also be carried out as part of a local area plan (LAP) process. The making of a development plan or an LAP is a reserved function of the elected members of each authority.  Section 31 of the Planning and Development Act 2000 empowers the Minister to direct a planning authority to take such measures as he or she may require to ensure that its development plan complies with the requirements of the Act. The statutory procedures governing the issuing of ministerial directions are found in sections 31, 31AM and 31AN of the 2000 Act.  The power to issue a direction is conditional on the Minister first receiving a formal recommendation on the matter from the Office of the Planning Regulator (OPR) and thereafter forming the opinion that one or more of the criteria set out in section 31(1) of the Act apply. These matters include, but are not limited to, where a plan fails to set out an overall strategy for the proper planning and sustainable development of the area, or a plan is not consistent with the objectives of the National Planning Framework (NPF) and the Regional Spatial and Economic Strategy (RSES).  Since its establishment in April 2019, the OPR has had statutory responsibility for the evaluation and assessment of local authority plans in accordance with section 31P of the Act. The Office is statutorily independent of the Minister in the performance of this function pursuant to section 31R of the Act.  The Planning and Development Act 2024, which is being commenced on a phased basis, includes updated arrangements for the issuing of national planning policy, through the replacement of section 28 Ministerial Guidelines with Government-approved National Planning Statements, along with revised arrangements for the issuing of draft and final directions to regional assemblies and local authorities to ensure consistency throughout the hierarchy of plan making. The provisions relating to National Planning Statements commenced on 2 October 2025.  National Planning Statements will include two distinct elements: (a) National Planning Policies and Measures, with which planning authorities will be required to be consistent in the exercise of their functions; and (b) National Planning Policy Guidance’, which planning authorities will be required to have due regard to. Where a new National Planning Statement is issued, regional assemblies, and in due course, planning authorities, will be required to submit a report to the Office of the Planning Regulator (OPR) setting out their view as to whether the RSES or development plan is materially consistent with the national planning policies and measures set out in the National Planning Statement.  Where the OPR is satisfied that there is a material inconsistency, and the steps proposed by the regional assembly or planning authority are sufficient to remove the material inconsistency, the expedited amendment procedures set out in the Act of 2024 may be invoked. If not satisfied, the OPR can make a recommendation to the Minister that a draft direction under the Act of 2024 should be issued. Furthermore, the OPR can make a recommendation to the Minister that such a draft direction should be issued where it does not receive a report from the regional assembly or planning authority and the OPR is of the opinion that there is a material inconsistency.  The Minister will be required to consider the OPR recommendation, statement of reasons and proposed terms for the draft direction and make a decision as to whether to accept that recommendation or not. ",
        "by": {
          "showAs": "Tony McCormack",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Tony-McCormack.D.2024-11-29",
          "memberCode": "Tony-McCormack.D.2024-11-29"
        },
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "houseCode": "dail",
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil"
        },
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "date": "2025-10-08",
        "questionNumber": 121,
        "questionType": "written",
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/dbsect_104",
          "debateSectionId": "dbsect_104",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-08/writtens/mul@/dbsect_104.xml"
            }
          },
          "showAs": "Planning Issues"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-08/pq_121",
        "showAs": " 121. Deputy Tony McCormack asked the Minister for Housing, Local Government and Heritage if his Department intends to exercise its powers to directly rezone land where local authorities fail to do so in line with national housing and planning objectives; the legislative basis for such intervention; and if he will make a statement on the matter. [53757/25] "
      },
      "contextDate": "2025-10-08"
    }
  ]
}