{
  "head": {
    "counts": {
      "questionCount": 5312,
      "resultCount": 5312
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Deputy Matt Carthy  The Minister of State may be aware that until last year, Monaghan had no respite facilities for children at all. The services it has currently are incredibly stretched. I ask the Minister of State to outline the proposals to provide additional respite capacity for both adults and children with disabilities in County Monaghan. \n Deputy Emer Higgins  HSE Capital and Estates Dublin and North East and the disability services in the Cavan-Monaghan IHA service area have identified a premises for sale that is suitable for the purposes of renovation to develop a HSE respite centre for children. The purchase transaction has been approved and completed. The keys of the premises have been transferred to HSE Capital and Estates Dublin and North East. The premises are located at Drumbear, Ballybay Road, County Monaghan.  Following the conclusion of the preliminary design stage with disability services in quarter 3 of 2025, the HSE Capital and Estates Dublin and North East office, through the appointed design team, has progressed with preparing a planning application for the proposed development, to be lodged no later than the end of January 2026. Subject to statutory approval of the planning application, it will be the HSE Capital and Estates Dublin and North East office’s intention to commence the preparation of tender documentation for the project. The HSE will then complete a capital project to prepare the property to deliver a five-bedroom residential respite facility.  HSE Capital and Estates Dublin and North East has advised that, if all of those steps go according to the timeframe set out, this project should be completed in quarter 4 of 2026. The number of children who will avail of respite in this new centre will be dependent on the assessed individual needs of each child and his or her family. In order to legally operate as a registered residential respite centre, a facility will need to meet the required standards for a designated respite centre, which is assessed and determined by the Health Information and Quality Authority, HIQA.  Cavan-Monaghan disability services secured a commitment for funding for an interim, two-year residential respite service for children in County Monaghan pending the development of the new HSE facility. The location of the interim children’s respite centre for Monaghan is at Urbalkirk, approximately 8 km from Monaghan town. The Talbot Group operates the service under a service arrangement with the HSE. The interim children’s respite centre, called Rainbow Lodge, became operational on 1 October 2024. Retention of this respite centre’s services will be contingent on future funding considerations. Cavan-Monaghan disability services helped prepare capital submission documents for the national HSE capital and property steering committee to seek approval and funding to provide a stand-alone respite centre for adults with an intellectual disability in County Cavan. \n Deputy Matt Carthy  I welcome that progress is being made on a permanent respite centre for children in Monaghan. However, I am deeply concerned by what the Minister of State referenced in relation to Rainbow Lodge, which is an interim measure. The Minister of State indicated that its future is contingent on funding. It would be completely unacceptable if Rainbow Lodge were closed before the permanent centre opened. I appeal to the Minister of State to take a hands-on approach to this. Even the new centre with five bedrooms is going to be at or above capacity on day one. I suggest it would make eminent sense for the HSE and the Department to ensure that Rainbow Lodge is maintained as a respite centre, even beyond the construction and completion of the new centre.  There is huge demand for respite services. Rainbow Lodge is operating well. It is incredibly popular with users and a huge relief to the families who have benefited from it. It would make sense to maintain both respite centres into the future. \n Deputy Emer Higgins  As the Deputy is aware, Rainbow Lodge is an interim children's respite centre. It came into operation on 1 October 2024. Retention of this respite centre service is contingent on future funding considerations. I take on board what the Deputy has said in relation to the new centre coming on board at the end of next year, and that there may perhaps be a gap. I take that feedback on board and will bring it back to my officials.  Regarding respite services for adults and children in County Monaghan, I draw the Deputy's attention to the fact that there is also Annalee View Respite Centre. The HSE disability service in IHA Cavan Monaghan operates one respite centre directly in County Cavan, which is in the Deputy’s area. Steadfast House is an overnight respite centre in County Monaghan. It is a HSE-funded, section 39 provider, which is funded under a service agreement with the HSE to provide 1,500 respite nights per year. Following the submission and approval of additional funding in 2024, the number of respite nights increased from 840 per annum to the current level of 1,500. Mountain View Respite Centre, in County Cavan, provides services for adults with physical and sensory disabilities from both Monaghan and Cavan. It opened in November 2026. \n Deputy Matt Carthy  The Minister of State said Rainbow Lodge is contingent on funding. She is the one who provides the funding. Has she allocated sufficient funding for Rainbow Lodge to operate throughout 2026?  Second, Annalee View is a respite centre that operates one week for adults and one week for children. The truth of the matter is that there is a deficiency in respite places. As the Minister of State outlined, it can be a lengthy process to provide new respite services. If we have a respite centre that is up and running, and operating well, which the users love and the families think is a great service, it would be illogical to close it down. I contend that if it is closed down, at some point in the future, another Minister will have to start the process all over again.  Will the Minister of State confirm that the funding is in place for 2026? Will she confirm that she will actively pursue keeping Rainbow Lodge open, even post the second and permanent respite centre being in place? \n Deputy Emer Higgins  The Deputy described a deficiency in respite care in Monaghan. I assure him that the Department and the HSE are currently auditing respite services to give us better visibility of the full picture regarding the provision but also, more importantly, the need. We have additional funding next year that we sought through budget negotiations. That will be part of the HSE's national services plan that is to be published. To clarify, we will be making the decisions as to where the funding goes based on the current level of provision locally but also based on need. The Deputy has clearly outlined a case for why Monaghan needs further investment. If the HSE figures add up on that, we will absolutely be looking at it. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 14. Deputy Matt Carthy asked the Minister for Children, Disability and Equality her proposals to provide additional respite capacity for adults and children with disabilities in County Monaghan. [72976/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_11",
          "debateSectionId": "dbsect_11",
          "showAs": "Disability Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_11.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_14",
        "questionNumber": 14
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 63. Deputy Matt Carthy asked the Minister for Children, Disability and Equality the number of children on the waiting list for an assessment of need in counties Cavan and Monaghan, respectively; and the number waiting more than three, six and 12 months. [72975/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_106",
          "debateSectionId": "dbsect_106",
          "showAs": "Disabilities Assessments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_106.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_63",
        "questionNumber": 63
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Deputy Matt Carthy  I have raised on a number of occasions issues relating to rPET plastic recycling in this State. With the introduction of the return scheme, which imposes a deposit charge on consumers every time they buy a plastic bottle that they then need to recoup, we need to ensure there is full transparency when it comes to all plastic that is collected under the scheme. Will the Minister of State detail the statistics relating to the number of rPET pellets that are recycled and produced in this State? \n Deputy Alan Dillon  I thank the Deputy for his question and interest in this area. As matters stand, there are no official statistics confirming the number of rPET pellets produced or utilised in the State or the amount exported from the State. While statistics for the recycling of plastic packaging waste are reported to Eurostat by the EPA on an annual basis, the EU’s list of waste codes does not isolate individual polymers and, therefore, it is not possible to establish how much of this PET material is in existence. This is a shortcoming in the system and Department officials have engaged with the European Commission in relation to expanding the list of waste codes to provide greater granularity for plastic polymers.  Ireland does not have some facilities which convert PET waste into rPET flakes or pellets, but we do not currently have a facility producing pellets of a food-grade quality. Due to strict EU food safety standards, rPET to be used in food or drink packaging must meet the highest recycling standard to be of food grade.  Prior to the introduction of the deposit return scheme, PET plastic waste collected through our waste collection system was mostly recycled abroad. Since the introduction of Re-Turn, the deposit return scheme, DRS, operator can confirm that in 2024, it collected a total of 12,057 tonnes of PET plastics, which were sold on the open market. A total of 4,037 tonnes of material, which equates to 34%, was bought by companies in Ireland.  For the first time, a separate and high-quality stream of PET is now available for recycling. Together with the requirement under the single use plastics directive to incorporate 25% of recycled plastic into PET beverage bottles from 2025, rising to 30% from 2030, the opportunity to invest in Ireland's circular economy has been boosted significantly. \n Deputy Matt Carthy  The deposit return scheme means that ordinary people are charged an additional cost every time they buy a plastic bottle and then they have to go to what is often a huge inconvenience of gathering the bottles to retrieve their deposit. There have been a lot of unforeseen consequences. For example, people's household waste charges have increased because domestic collectors are not, as was previously the case, receiving plastic bottles when collecting waste. With schemes such as this, we need to be careful that consumers and the general population do not see this as a burden rather than a mechanism to increase recycling and improve the circular economy. This is not helped by the fact that almost 70% of the plastic that is collected is exported to third countries, despite the fact that we have companies in Ireland, such as Shabra Plastics and Packaging Limited in my constituency, that have the capacity to recycle this product. Will the Minister of State take a hands-on approach to ensure that we increase significantly and substantially the amount of plastic that is recycled in this State under this scheme? \n Deputy Alan Dillon  I reassure the Deputy that Re-Turn has collected over 12,000 tonnes of this PET plastic, 34% of which, as I said earlier, is purchased by Irish companies. Separately, we have Repak, which funds the recycling of over 8,300 tonnes of plastic, 42% of which is reprocessed in Ireland. Is it enough? We need to do more and that is widely acknowledged. Certainly, with the introduction of the DRS, we have made a significant step forward with regard to fully recognising the stream of product that we have as a result of having a dedicated collection system for PET recycling.  We also recognise that we need to continue to invest in recycling infrastructure. That must grow and that is why, through the extended producer responsibility, EPR, schemes, Re-Turn and Repak are now investing in their domestic capacity. We are engaging with Re-Turn with regard to a bottle-to-bottle PET plant. Certainly, we want to have more domestic capacity for recycling. \n Deputy Matt Carthy  The lack of information and movement coming from the Department in this respect are completely unacceptable. The Government was quick to impose this charge on consumers but it has refused point blank to impose a charge on the use of virgin plastic, for example, something that would put a burden on the companies that are using virgin plastic, which is non-recyclable plastic. There are companies in this country that have the ability to recycle this product but Re-Turn sells the plastic to the highest bidder, regardless of the purpose or country. It means that people who are thinking they are doing the right thing recycling their plastic bottles can see their product going half way across the world in a way that no one could describe as being environmentally responsible. I will ask the question again.  Will the Minister of State take a hands-on approach? Rather than just taking the word of Re-Turn or Repak, will he ensure his Department is fully across every single detail and is not allowing something that is penalising Irish consumers or potentially putting Irish companies at risk by the actions that Re-Turn might be taking? \n Deputy Alan Dillon  To be clear, the plastic that is recycled is traded on the open market by Re-Turn. The State is constrained in intervening by EU state aid rules. That is why we comply through the EU waste framework, ensuring there is a regulatory environment to support Irish recyclers. All operators in Ireland can play a role in that . It is a complex challenge and we want to continue to provide support. With the supply chain we now have through PET plastic, we can continue to work with the industry on how we can support companies here and reduce our reliance on the export market. This is why Re-Turn is actively planning a multimillion euro facility to bring bottle-to-bottle PET recycling to Ireland. That would be a game-changer for many reasons would present a real circular economy initiative, to the Deputy's point, avoiding the exposure to the export market. \n Deputy Matt Carthy  The Government also needs to protect those Irish companies that are already recycling. ",
        "questionType": "oral",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 106. Deputy Matt Carthy asked the Minister for Climate, Energy and the Environment the number of rPET pellets produced in the State; the amount of this product utilised within the State and the amount exported. [72997/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/dbsect_24",
          "debateSectionId": "dbsect_24",
          "showAs": "Recycling Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/debate/mul@/dbsect_24.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_106",
        "questionNumber": 106
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  There are currently three measures within the Department that receive funding from carbon tax revenue: -  • Residential /Community Retrofit;  • Just Transition; and  • the Green Climate Fund.  The total carbon tax funding allocated to my Department for the period 2020-25 was €1.522 billion. A further €566 million is allocated for 2026.  Each of the measures received the following amounts during the period 2020-25:  • Residential & Community Energy Efficiency - €1.442 billion.  • Just Transition Fund - €36 million.  • The Green Climate Fund - €12 million  • Energy Poverty Upgrades - €13 million (2020)  • Electric Vehicle Grants - €16 million  • Electric Vehicle Charging Infrastructure - €3 million.  For 2026, the carbon tax funding of €566 million is being allocated as follows:  • Residential & Community Energy Efficiency - €558 million.  • Just Transition Fund - €6 million.  • The Green Climate Fund - €2 million. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 118. Deputy Matt Carthy asked the Minister for Climate, Energy and the Environment the funding allocated to his Department from the climate tax; and the allocations made therefrom. [72996/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_150",
          "debateSectionId": "dbsect_150",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_150.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_118",
        "questionNumber": 118
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I am advised by Revenue that the amounts raised through the Carbon Tax in each of the years 2019 to 2024 are shown in the following table. It is projected that receipts in 2025 will be in the region of €1,180m.      Year      Receipts €m       2024    1,067.5      2023    934.7      2022    790.6      2021    652.3      2020    493.6      2019    430.5       I am further advised by Revenue that a breakdown of carbon tax receipts, across all fuel and energy types, for the years 2019 to 2024 and previous years is published on the Revenue website at: www.revenue.ie/en/corporate/information-about-revenue/statistics/excise/receipts-volume-and-price/excise-receipts-commodity.aspx  The Deputy has requested the amount projected to be raised through the carbon tax in each of the years up until 2030. In July, my department published updated Carbon Tax Projected Exchequer Revenue Estimates (2013-2030) as part of the Tax Strategy Group paper on Energy, Environmental and Vehicle Tax. The updated carbon tax projected revenue estimates section of the paper examines how domestic climate change policies are expected to impact carbon tax yields, as our economy transitions to a low carbon economy in line with most recent climate action plan measures. This scenario analyses maps and links forward projected estimates of energy use and expected fuel requirements from the Sustainable Energy Authority of Ireland (SEAI) to carbon tax rates and exchequer net carbon tax receipts to examine the potential impact of the implementation of the Climate Action Plan actions between 2025 and 2030 based on the SEAI and the Environmental Protection Agency (EPA) ‘With Additional Measure’ (WAM) scenario and ‘With Existing Measure’ (WEM) scenario analysis. This paper is available on my Department's website: assets.gov.ie/static/documents/TSG_25-10_Energy_Environmental_and_Vehicle_Tax_UPD.pdf ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 204. Deputy Matt Carthy asked the Tánaiste and Minister for Finance the amount raised through the carbon tax in each of the years 2019 to 2024; and the amount projected to be raised in each of the years 2025 to 2030. [73037/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_218",
          "debateSectionId": "dbsect_218",
          "showAs": "Tax Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_218.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_204",
        "questionNumber": 204
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Liquid fuels used for motor or heating purposes are subject to excise duty in the form of Mineral Oil Tax (MOT). MOT comprises a carbon and a non-carbon component with the carbon component also being referred to as carbon tax. The application of carbon tax to petrol and auto-diesel was introduced in December 2009, followed by the extension of carbon taxation to other liquid fuels, including home heating oil, on 1 May 2010.  Ireland’s carbon tax regime is a carbon pricing mechanism which directly links the taxation of fossil fuels to carbon dioxide emissions: a single price is set for a tonne of carbon dioxide, and this price is then applied to each fuel type according to the level of carbon dioxide emitted by that fuel when it is combusted. In this way, the carbon tax applying to each fuel type reflects the level of carbon dioxide emissions that it releases.  Legislation was introduced in Finance Act 2020 to provide for annual increases in carbon tax rates up to May 2030, at which point all carbon tax rates will be based on charging €100 per tonne of carbon dioxide emissions. Carbon tax rates on petrol and auto-diesel are legislated to increase at Budget time each October up to and including 2029, with rates on other liable fuels such as heating kerosene and marked gas oil legislated to increase each May (i.e. after the winter heating season) up to and including 2030. This means that rates for the carbon component of MOT are set to increase a further four times for petrol and auto-diesel, and five times for heating fuels, over the remainder of the trajectory provided for in legislation.  For petrol, the MOT rate increases, inclusive of VAT, will total to 8.1 cents per litre over the remainder of the carbon tax trajectory. The annual increases will be 2.1 cents per litre for each of the next three years, and 1.8 cents per litre in 2029.  Inclusive of VAT the remaining four increases to the MOT rate on auto-diesel will total to 9.6 cents per litre. The annual increases will be 2.5 cents per litre for each of the next three years and 2.1 cents per litre in 2029.  Kerosene is the most commonly used oil for home heating. Inclusive of VAT the MOT rate increases on heating kerosene will total to 10.7 cents per litre over the remainder of the carbon tax trajectory. The annual amounts will be 2.2 cents per litre for each of the next four years and 1.9 cents per litre in 2030.  Marked gas oil is also used for heating. Inclusive of VAT the remaining five increases to MOT on marked gas oil will total to 11.2 cents per litre. The annual increases will be 2.3 cents per litre for each of the next four years and 2 cents per litre in 2030. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 250. Deputy Matt Carthy asked the Tánaiste and Minister for Finance the total amount by which he proposes to raise the price of petrol, diesel and home heating oil through increases to the carbon tax, in each year until 2030. [73038/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_261",
          "debateSectionId": "dbsect_261",
          "showAs": "Tax Collection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_261.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_250",
        "questionNumber": 250
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  I can confirm that officials in my Department, including in the Consulate General in Atlanta, are aware of this case and are providing ongoing consular assistance.  A dedicated consular officer in the Consulate has been assigned to the citizen and their family and they remain in close contact. The consular officer has provided support and advice to the citizen and their family in accordance with the Department’s Consular Assistance Charter. I can further confirm that staff of the Consulate General in Atlanta, including the Deputy Consul General, have undertaken consular visits.  I wish to assure the Deputy that officials in my Department will continue to provide all appropriate consular assistance to the citizen.  ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 268. Deputy Matt Carthy asked the Minister for Foreign Affairs and Trade if her attention has been drawn to the circumstances of an individual (details supplied); if consular assistance is being provided; and if she will make a statement on the matter. [73687/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_276",
          "debateSectionId": "dbsect_276",
          "showAs": "Consular Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_276.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_268",
        "questionNumber": 268
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 362 and 379 together.  Liquid fuels used for motor or heating purposes are subject to excise duty in the form of Mineral Oil Tax (MOT). MOT comprises a carbon and a non-carbon component with the carbon component also being referred to as carbon tax. The application of carbon tax to petrol and auto-diesel was introduced in December 2009, followed by the extension of carbon tax to other liquid fuels on 1 May 2010.  Ireland’s carbon tax regime is a carbon pricing mechanism which directly links the taxation of fossil fuels to carbon dioxide (CO2) emissions: a single price is set for a tonne of CO2 and this price is then applied to each fuel type according to the level of CO2 emitted by that fuel when it is combusted. In this way, the carbon tax applying to each fuel type reflects the level of CO2 emissions that it releases.  Legislation was introduced in Finance Act 2020 to provide for annual increases in carbon tax rates up to May 2030, at which point all carbon tax rates will be based on charging €100 per tonne of CO2 emissions. Carbon tax rates on petrol and auto-diesel are legislated to increase at Budget time each October up to and including 2029, with rates on other liable fuels such as heating kerosene and marked gas oil legislated to increase each May (i.e. after the winter heating season) up to and including 2030. This means that MOT rates on petrol and auto-diesel are set to increase a further four times, and MOT rates on heating fuels are set to increase a further five times, over the remainder of the trajectory provided for in legislation.  For petrol, the MOT increases, inclusive of VAT, will total to 8.1 cents per litre over the remainder of the carbon tax trajectory. The annual increases will be 2.1 cents per litre for each of the next three years, and 1.8 cents per litre in 2029.  Inclusive of VAT the remaining four increases to MOT on auto-diesel will total to 9.6 cents per litre. The annual increases will be 2.5 cents per litre for each of the next three years and 2.1 cents per litre in 2029.  Kerosene is the most commonly used oil for home heating. Inclusive of VAT, the MOT rate increases on heating kerosene will total to 10.7 cents per litre over the remainder of the carbon tax trajectory. The annual amounts will be 2.2 cents per litre for each of the next four years and 1.9 cents per litre in 2030.  Marked gas oil is also used for heating. Inclusive of VAT the remaining five increases to MOT on marked gas oil will total to 11.2 cents per litre. The annual increases will be 2.3 cents per litre for each of the next four years and 2 cents per litre in 2030. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 362. Deputy Matt Carthy asked the Tánaiste and Minister for Finance the number of times he plans to increase the cost of petrol, diesel and home heating oil until 2030; the cost to consumers of each increase; the compounded total cost of the increase, by increase and by category. [69333/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_360",
          "debateSectionId": "dbsect_360",
          "showAs": "Fuel Prices",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_360.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_362",
        "questionNumber": 362
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  Beneficiaries of Temporary Protection hold temporary permission to remain in Ireland, renewable annually for as long as the Directive remains in force.  On 15 July 2025, the Justice and Home Affairs Council extended Temporary Protection by a year until March 2027, providing certainty for beneficiaries who can continue to avail of the protections that the Directive provides.  The following table shows the number of temporary protection applications by month from 2023 until 2025.     Temporary Protection Applications    2023    2024    2025      Jan    2753    1587    842      Feb    3161    821    881      Mar    3263    1082    658      Apr    1972    757    600      May    2833    913    683      Jun    3205    1022    874      Jul    3487    1209    1351      Aug    2295    928    974      Sep    3059    1118    2077      Oct    3465    1092    1873      Nov    2315    919    1331      Dec    2301    1016    *656      Totals    34109    12464    *12800     * Up to 17 December 2025. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 566. Deputy Matt Carthy asked the Minister for Justice, Home Affairs and Migration the number of those from Ukraine who entered the State as beneficiaries of the temporary protection directive in each month of the past three years and to date in 2025, in tabular form; and if he will make a statement on the matter. [73679/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_539",
          "debateSectionId": "dbsect_539",
          "showAs": "International Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_539.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_566",
        "questionNumber": 566
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I am pleased to be able to inform the Deputy that there are requirements in law in relation to the quality of interpretation and translation in legal proceedings.  The right to fair procedures is a central tenet of our criminal justice system. Ireland opted in to the EU Directive on the right to interpretation and translation in criminal proceedings - eur-lex.europa.eu/legal-content/EN/TXT/?uri=celex:32010L0064 - and it was subsequently transposed into Irish law. This was done via two Statutory Instruments, one relating to Interpretation and Translation in Criminal Proceedings - www.irishstatutebook.ie/eli/2013/si/565/made/en/print , which relates to the arrangements to be put in place by the Courts Service in respect of the conduct of court proceedings and the second which relates to Interpretation and Translation for Persons in Custody in Garda stations - /www.irishstatutebook.ie/eli/2013/si/564/made/en/print.   Article 5 of the Directive requires Member States to take ‘concrete measures’ to ensure the quality of the interpretation and translation services. Both of the SI’s include provisions regarding the quality of interpretation.   The manner in which these instruments are implemented in practice is an operational matter for An Garda Síochána and the Courts. The Garda Commissioner is responsible for the management and administration of An Garda Síochána. I cannot intervene in operational Garda matters, which fall under the Garda Commissioner’s remit, including the processes by which translation and interpretation services are provided. Management of the courts and operational matters, including the management of interpretation services, are the responsibility of the Courts Service, which is independent in the exercising of its functions under the Courts Service Act 1998 and given the separation of powers in the Constitution.  The Irish Sign Language Act 2017, which provides for Irish Sign Language requirements for courts, falls under the remit of the Minster for Children, Disability and Equality. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 567. Deputy Matt Carthy asked the Minister for Justice, Home Affairs and Migration the reason there are requirements in law in relation to the competence of those providing Irish Sign Language interpretation for courts and public bodies but no such requirements in law in relation to the provision of other interpretation and translation in legal proceedings; and if he will make a statement on the matter. [73680/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_540",
          "debateSectionId": "dbsect_540",
          "showAs": "Court Procedures",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_540.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_567",
        "questionNumber": 567
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Garda Commissioner is responsible for the management and administration of An Garda Síochána under Section 33 of the Policing, Security and Community Safety Act 2024, which includes the distribution and stationing of Garda personnel throughout the State.  I am committed to ensuring that An Garda Síochána has the resources it needs to fight crime and a strengthened, well-resourced Garda organisation is central to this policy.  The Garda Vote in Budget 2026 includes unprecedented funding of €2.59 billion which will support the continued recruitment of Garda members and staff.  The overall Garda workforce includes 14,290 Garda members, 3,487 staff and 291 reserves.  In the interest of transparency, An Garda Síochána publish information in relation to resources which is publicly available and can be found at the following link:  www.garda.ie/en/about-us/our-departments/human-resources-and-people-development/garda-hr-directorate/garda-strength-breakdown-2025/  The Deputy should select the Garda Workforce figures for the latest month and access the file titled “Garda members by Division 2006 to the latest date ” for a breakdown of the current number of members of An Garda Síochána by Division.[ ] ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 568. Deputy Matt Carthy asked the Minister for Justice, Home Affairs and Migration the current number of members of An Garda Síochána; and if he will make a statement on the matter. [73681/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_541",
          "debateSectionId": "dbsect_541",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_541.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_568",
        "questionNumber": 568
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  There has been a significant increase in investment into the international protection system which, combined with digitisation and process re-engineering, has facilitated a major increase in processing capacity.  In 2024, the International Protection Office (IPO) delivered over 14,000 first decisions compared to over 8,500 in 2023, while the International Protection Appeals Tribunal (IPAT) closed around 3,100 appeals in 2024 compared to over 1,700 in 2023.  In 2025, to the end of November, there has been a 44% increase in the total number of first instance decisions made when compared to the same period in 2024. The IPAT has also increased the number of appeals completed to date in 2025 by 84% over the full year figure for 2024.  The following table shows the overall median processing time in months of applications for international protection in the years 2020 to 12 December 2025, by quarter.     Year    Quarter    Median      2020    Qtr 1    16      2020    Qtr 2    17      2020    Qtr 3    19      2020    Qtr 4    20      2021    Qtr 1    22      2021    Qtr 2    27      2021    Qtr 3    23      2021    Qtr 4    22      2022    Qtr 1    26      2022    Qtr 2    22      2022    Qtr 3    13      2022    Qtr 4    9      2023    Qtr 1    10      2023    Qtr 2    12      2023    Qtr 3    14      2023    Qtr 4    16      2024    Qtr 1    16      2024    Qtr 2    17      2024    Qtr 3    15      2024    Qtr 4    15      2025    Qtr 1    14      2025    Qtr 2    14      2025    Qtr 3    14      2025    Qtr 4*    14     *up to 12 December 2025  Accelerated processing was introduced in November 2022, and it now applies to those from designated safe countries of origin, applicants who have received protection elsewhere in Europe and those from a country with a particularly high number of applications.  The following table shows the median processing time in months of applications for international protection under the accelerated procedure in the years 2022 to date in 2025, by quarter.     Accelerated Procedure              Year    Quarter    Median      2022    Qtr 4    1      2023    Qtr 1    2      2023    Qtr 2    2      2023    Qtr 3    2      2023    Qtr 4    2      2024    Qtr 1    3      2024    Qtr 2    2      2024    Qtr 3    2      2024    Qtr 4    3      2025    Qtr 1    4      2025    Qtr 2    4      2025    Qtr 3    3      2025    Qtr 4*    2     * up to 12 December 2025  All IPO first instance decisions other than Refugee Status grants can be appealed to the International Protection Appeals Tribunal (IPAT).  The following table shows International Protection Appeals Tribunal median processing times in months for each quarter from 2020 to Q3 2025.     Year    Q1    Q2    Q3    Q4      2020    6    9    11    12      2021    15    16    13    14      2022    15    13    10    4      2023    6    6    6    7      2024    9    10    11    13      2025    15    16    16    -     Please note figures are correct at time of issue and may be subject to data cleansing.  My Department also continues to focus on preparing for the EU Migration and Asylum Pact in advance of June 2026. The Pact will provide a fair, sustainable and efficient asylum procedure. This will be achieved through convergence in asylum practices across the EU.  On 1 July, my Department introduced the first phase of a gradual transition to a new accelerated, end-to-end process for applicants entering the international protection system in Ireland. This new accelerated process mirrors elements of the future border procedure and screening required by the EU Pact on Migration and Asylum while still adhering to the existing International Protection Act 2015.  The new process is designed to enable testing of new border procedure timelines that will be required as part of the EU Pact requirements in June 2026. The border procedure allows 12 weeks to first and second-instance decisions and a further 12 weeks to return for those who receive negative decisions.  This first transition phase focused on accelerating the processing of applicants from three designated safe countries of origin: Georgia, India and Brazil. It also introduced elements of the future required screening process under the EU Pact.  During the initial three months of the transition, a total of 366 applicants were processed under these shorter timelines. While it is too soon to measure the six months total timeline permitted, the timeline of 12 weeks for first and second instance decision was achieved. This represents a significant shift from the current median processing times in the IPO and IPAT, and hence a significant reduction in costs for accommodation and other supports.  Phase two of the transition is currently underway, having launched on October 8, 2025 with the addition of the remaining 12 designated safe countries of origin. The impacts and learnings from expanding the transition will become clearer over the coming months. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 569. Deputy Matt Carthy asked the Minister for Justice, Home Affairs and Migration the average processing time of applications for international protection in the years 2020 to date in 2025, by quarter; and if he will make a statement on the matter. [73682/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_542",
          "debateSectionId": "dbsect_542",
          "showAs": "International Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_542.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_569",
        "questionNumber": 569
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  Ireland and the United Kingdom share a long history and common interest in the effective operation of the Common Travel Area (CTA). The invisible border on the island of Ireland is among the most tangible gains of the peace process and is essential to the continuing normalisation of relationships. Maintaining the integrity of the CTA and preventing its abuse in the context of immigration is an issue that I and my officials prioritise in our engagements with my United Kingdom (UK) counterparts.  Since my appointment as Minister for Justice, Home Affairs and Migration, I have had a number of engagements with the then UK Home Secretary, Yvette Cooper, where we discussed cooperation in respect of managing the Common Travel Area, and our shared objectives to provide for effective management of migration and border security. Importantly, we had in those engagements been able to reflect on the extensive engagement, cooperation and data-sharing at all levels between my Department’s officials and their Home Office counterparts, as well as the significant operational cooperation between the Gardaí, UK Border Force, UK policing services and the Police Service of Northern Ireland in relation to both immigration and criminal matters.  The Common Travel Area Forum (CTAF) acts as a steering committee for the ongoing work of protecting the CTA in relation to free movement of its citizens between both countries while at the same time ensuring that the CTA is not abused by those not entitled to avail of it. The Forum meets twice yearly but also meets more frequently in sub-group format to address particular elements of Ireland/UK co-operation, bringing together relevant subject matter expertise in various areas, such as Asylum. Regular updates on policy and operational developments in each jurisdiction, including the implementation of the EU Asylum and Migration Pact, are exchanged in these meetings.  This strong practical engagement and cooperation serves the mutual interests of both Ireland and the UK. I am looking forward to engaging with the current Home Secretary, Shabana Mahmood, in the coming weeks where this important engagement will continue.  The following table details meetings I have had with my UK authorities in the past year at which such matters were considered.     Date    Meeting      03/03/2025    Call with Home Secretary      06/03/2025    UK-IE Summit      31/03/2025    Border Security Summit      24/04/2025    British Irish Intergovernmental Conference      17/11/2025    British Irish Intergovernmental Conference      10/12/2025    Bi-lateral meeting with the UK Deputy Prime Minister, Lord Chancellor and Secretary of State for Justice, the Rt Hon David Lammy MP, and Attorney General for England and Wales Richard Hermer KC.      ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 570. Deputy Matt Carthy asked the Minister for Justice, Home Affairs and Migration for an update on all discussions he has held with British authorities on the Implementation of the EU Migration and Asylum Pact and its impact on the common travel area, including the date of each engagement, in tabular form; and if he will make a statement on the matter. [73683/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_543",
          "debateSectionId": "dbsect_543",
          "showAs": "Common Travel Area",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_543.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_570",
        "questionNumber": 570
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The presiding judge is entirely independent in the exercise of their judicial functions, and the decision to grant or refuse bail in a particular case is solely a matter for the court. With that said, it is totally unacceptable that offences are committed by people on bail. That is a direct breach of their promise made when bail is granted by the Court.  Our laws, particularly the Bail Act 1997 (as amended), provide for the refusal of bail in particular circumstances in line with the Constitution. In addition, the Bail Act provides that a person charged with a serious offence may be refused bail if the court is satisfied that this is necessary to prevent the commission of a serious offence.  Under the Bail Act, if a person fails to comply with any bail conditions, the judge may issue a bench warrant, mandating An Garda Síochána to arrest and bring the person before the court. In addition, the 2017 Act strengthened Garda powers to deal with breaches of bail, including a power to arrest, without warrant, a person where a member has reasonable cause to suspect that that person has breached, or is about to breach, a bail condition and the member considers the arrest necessary in order to prevent harm to, interference with, or intimidation of, a victim or witness.  While bail laws in Ireland are comprehensive, I am committed to ensuring they are fit for purpose while ensuring fundamental rights principles are adhered to. Last May, I announced that I intended to appoint a Senior Counsel to undertake an assessment of the current operation of bail in Ireland, both legal and practical. The commissioning of the report arose from concerns regarding bail processes and their applicability to recidivist offenders. Mr. Lorcan Staines SC was subsequently appointed to undertake the review. His report ‘An Assessment of the Efficacy of Bail Laws in Ireland’ was published by my Department in November 2025.  His recommendations include investment in improved information sharing systems for both An Garda Síochána and the Courts Service; the implementation of an adult bail supervision scheme to ensure the proper management of recidivist offenders; changes to bail legislation to significantly expand the conditions which may be attached to the granting of bail; and further legislative amendments to improve the legal framework surrounding bail, including consideration for the legal supports for the expected operational implementation of electronic monitoring in 2026. The electronic monitoring project is progressing - a request for tender for a pilot phase was published earlier this month and is expected to be operational in 2026.  I am committed to keeping our bail laws under review and any further useful amendments that are identified will be introduced as appropriate.  In relation to the data requested by the Deputy, the Garda Commissioner is responsible for the management and administration of An Garda Síochána under Section 33 of the Policing, Security and Community Safety Act 2024. This includes all operational policing and recording of data. However, to be of assistance I have sought the information requested in the Deputy's query and I will write to the Deputy further once it is available. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 571. Deputy Matt Carthy asked the Minister for Justice, Home Affairs and Migration the number of crimes recorded where the suspected offenders were on bail, by county and category of offence, to date in 2025, in tabular form; and if he will make a statement on the matter. [73684/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_544",
          "debateSectionId": "dbsect_544",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_544.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_571",
        "questionNumber": 571
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Attorney General has advised that a total blanket ban on disclosure of counselling records risks infringing the constitutional right to a fair trial and would likely lead to legal challenges, with convictions potentially being quashed as a result.  That said, I am advancing provisions to ensure that a victim’s counselling records can only be disclosed in court under very specific circumstances, ensuring that criminal proceedings take into account the victim’s constitutional right to personal privacy, acknowledging the important role of counselling in victims and survivors’ recovery, and not only the accused person’s constitutional right to a fair trial.  The law in this area was substantially reformed in 2017 by the insertion of section 19A of the Criminal Evidence Act 1992, creating a process designed to strike this balance by limiting disclosure to cases where the court finds that the evidential value in the record is such that the interests of justice require its disclosure. However, it appears that in practice this provision has not operated as intended.  In May, I secured Cabinet approval for the drafting of the General Scheme of the Criminal Law and Civil Law (Miscellaneous Provisions) Bill 2025. The General Scheme was before the Oireachtas Committee on Justice, Home Affairs and Migration for pre-legislative scrutiny on the 30th of September, where the proposed amendments to the current legislative framework governing the disclosure of counselling records in criminal trials was extensively discussed, together with other provisions. The Committee’s Report was published on 13 November, and on 16 December, I secured Government approval to publish the Bill and introduce it to the Houses of the Oireachtas.  The proposed legislation includes measures to ensure that counselling records are only disclosed where a court decides that they contain material that is genuinely relevant to the trial, taking into account the rights of victims. To achieve this, it amends the existing legislation by requiring that a disclosure hearing takes place in all cases, removing the provision that allows for this vital judicial oversight to be waived.  In each case, a judicial determination will be required before counselling records can be disclosed, which will take into account factors such as whether this step is actually necessary for the accused to defend the charges against them in the particular case, as well as the need to protect the privacy of victims and to vindicate the public interest in encouraging victims of sexual offences to seek counselling.  The deletion of subsection (17) will ensure that the framework under section 19A operates as originally intended, striking a balance between the victim’s rights and the accused person’s right to a fair trial. It is anticipated that this reform will copper-fasten the central role of judicial oversight in ensuring that counselling notes will be disclosed only in cases where the interests of justice require it, taking into account the rights of the victim and the crucial importance of counselling and therapy as part of a victim’s process of recovery.  Once enacted, the operation of the legislation will be kept under review, as is the case with all criminal legislation, to ensure that it is achieving its intended purpose. Additional changes to the current legislative framework around disclosure of counselling notes are also under consideration within my Department and will be brought forward at the earliest possible opportunity. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 576. Deputy Matt Carthy asked the Minister for Justice, Home Affairs and Migration if he will introduce a complete ban on the use of counselling notes in sexual offence trials, as recommended by the Oireachtas Committee on Justice, Home Affairs and Migration in its pre-legislative scrutiny report on the general scheme of the Criminal Law and Civil Law Bill 2025; and if he will make a statement on the matter.  [73739/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_549",
          "debateSectionId": "dbsect_549",
          "showAs": "Domestic, Sexual and Gender-based Violence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_549.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_576",
        "questionNumber": 576
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The State is currently accommodating almost 33,000 people in nearly 315 International Protection Accommodation Service (IPAS) centres around the country.  As we respond to changing trends, and work toward a more stable and sustainable accommodation system in this sector, accommodation is being developed and delivered through a range of channels, with a focus on developing more State-owned accommodation.  The Department continues to appraise the portfolio of existing accommodation with a view to consolidation where possible, along with better governance and compliance, and increased frequency of inspections of properties.  In 2025, 22 contracts have been terminated by the Department.  While details of specific contractual process are treated as confidential and commercially sensitive, reasons for termination would include value for money, or concerns about non-compliance with contractual terms. They may also relate to non-compliance with regulatory requirements such as building and fire regulations or planning matters. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 577. Deputy Matt Carthy asked the Minister for Justice, Home Affairs and Migration the number of contracts for international protection accommodation which have been terminated in 2025 to date, the specific reason why each contact was terminated, in tabular form; and if he will make a statement on the matter. [73740/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_550",
          "debateSectionId": "dbsect_550",
          "showAs": "International Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_550.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_577",
        "questionNumber": 577
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Deputy Matt Carthy  I would appreciate it if the Minister would inform the Dáil of the current numbers of personnel within each service of the Defence Forces, the current establishment figure and the number that will be required to meet level of ambition 2 under the commission on the future of the Defence Forces. \n Deputy Helen McEntee  I thank the Deputy. As of 31 October 2025, the strength of the Permanent Defence Force stood at 7,760 personnel, consisting of 6,237 Army, 739 Air Corps and 784 Naval Service personnel, as well as over 400 civilian members.  On foot of the recommendations from the report of the Commission on the Defence Forces, the Government approved a move, over a six-year period, to a level of Permanent Defence Force capability equivalent to level of ambition 2. This will require an additional 2,000 personnel, including a civilian component, beyond the 9,500 establishment figure that was set at the time of the commission's report. The establishment figure for the Permanent Defence Force has increased incrementally since 2022 to 9,739 to facilitate the implementation of the recommendations of the report of the Commission on the Defence Forces.  Working towards the achievement of level of ambition 2, budget 2026 provided a record allocation of €1.49 billion for the defence sector, an increase of €145 million on the previous year. These funds include provision for the recruitment of a net 400 additional Permanent Defence Force members per annum. In order to meet Government targets, the Defence Forces are making concerted efforts to ramp up recruitment. Increased training capacity is being progressed. I recently visited the Joint Induction Training Centre which has been established in Gormanston camp in my constituency in Meath and provides initial training to recruits from all three branches of the Defence Forces. There is a huge amount of investment going into the accommodation, the gym area and the canteen to ensure we can increase the number of personnel who can go through Gormanston camp and be trained. The Defence Forces advise that when fully operational, the centre will facilitate the training of up to 900 recruits per annum.  Last year saw a stabilisation in numbers with 708 inductions to the Permanent Defence Force and the military authorities have advised that they are targeting over 750 inductions for 2025, which is expected to result in an increase in the total strength of the Permanent Defence Force. There continues, thankfully, to be very strong interest in a career in the Defence Forces. \n Deputy Matt Carthy  We use the term \"level of ambition\" about the future of the Defence Forces. However, the level of ambition from the Government is absolutely pathetic considering where we are starting from and the situation we have as a result of Fianna Fáil and Fine Gael mismanagement. In December 2019, just prior to Fianna Fáil and Fine Gael coming together in the previous Government, the number of personnel in the Defence Forces was 8,700. We are supposed to celebrate that numbers are now a little over 7,700. There are 1,000 fewer personnel. This is at a time when the Government is planning to abandon the triple lock to send our Defence Forces to places it will not yet stipulate. The Minister tells us that we will have 750 inductions at best this year. Perhaps she could inform the Dáil how many discharges she expects within the Defence Forces this year because on average, it is approximately 750. Is she telling us that at the end of this year, we are effectively going to have no increase in the numbers of personnel in the Defence Forces? \n Deputy Helen McEntee  We all agree that more needs to be done and I do not think the Government is saying anything to the contrary. It is clear that there continues to be a very strong interest in a career in the Defence Forces with further growth this year. Let us look at the figures. A total of 14,879 applications have been received this year, up to the end of October. The most important thing that I need to focus on now is making sure that as many of those as possible get into training and that we retain as many of them as possible.  We have introduced a range of key enabling measures to support and drive Defence Forces recruitment and retention, working closely with the Defence Forces. These include increases in the maximum ages of recruitment and retirement, the extension of private secondary healthcare to all personnel and the application of the provisions of the working time directive across the Defence Forces, subject to certain exemptions. The patrol duty allowance payable to Naval Service personnel at sea has been doubled after ten days at sea in a calendar year, while the Naval Service tax credit has been extended for a further five years. There has also been significant progress on pay with all personnel benefiting from a further pay award made in August of this year. Money has been provided through the capital budget.  Significant work has already been done to try to ensure that the terms and conditions are improving for our members. There is a plan that has been worked through with the Defence Forces and my Department to set out exactly how we are going to achieve those targets.  It is not going to be straightforward or easy. I accept that. I am absolutely committed to doing everything I can. \n Deputy Matt Carthy  The difficulty is that the Minister's speech reflects, virtually verbatim, what we heard this time last year from the then Minister. There is no issue with applications or expressions of interest. We have seen that time and again. People are interested in the prospect of joining the Defence Forces. The difficulty is bringing them to the point when they are inducted and ensuring they are retained within the Defence Forces. Across the board, the Government does not have the ambition at the start or the policies at the end.  The difficulty is that the members of the Defence Forces have been telling us all, and specifically the Government, the measures that are required to actually address the retention and recruitment crisis we have been facing.  Has the Minister met with the Defence Forces' representative organisations? As a result of those meetings, if they took place, are there any new measures that the Minister now plans to bring forward? \n Deputy Helen McEntee  While the measures have not changed, what has changed is that the numbers are increasing. I appreciate that might not be at the rate or in the numbers we all want, but numbers have now stabilised and are moving in the right direction. My intention and ambition are to work directly with the Defence Forces to ensure they have the right structure and the capacity and ability to increase the number of recruits. We will see an increase in the numbers of men and women we can train in Gormanston.  I have not yet met the representative organisations but I have made it clear that I will meet all of them in the new year. I have met them in various contexts and I will sit down with them in the new year. I know that my Department has worked closely and has had very good relationships with the representative organisations. A lot of progress has been made, much of which has come directly from the Defence Forces. I was looking recently at what has happened in the past number of years and much of it has been at the request of the representative organisations. When I meet them, I will, of course, be engaging on the concerns and issues they have and their potential requests. It is important that we bed down the work being done at the moment and make sure that the changes taking place have time to bed into the system so we can start to see those numbers increase. ",
        "questionType": "oral",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 91. Deputy Matt Carthy asked the Minister for Defence the number of Defence Forces personnel required under level of ambition 2; the current establishment figure; and the current number within each service.  [71896/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/dbsect_21",
          "debateSectionId": "dbsect_21",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/debate/mul@/dbsect_21.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_91",
        "questionNumber": 91
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  The Naval Service currently has a fleet of eight vessels. Four of the vessels are regularly deployed on Maritime Defence and Security Operations (MDSO). These four vessels consist of three P60 class vessels as well as the L.É. Aoibhinn (P71) with all four vessels conducting patrols on a rotation basis.  Level of Ambition (LOA) 2 as outlined in the Commission on the Defence Forces (CoDF) Report, includes a recommendation for an accelerated programme of naval vessel replacements, to ensure a balanced fleet of nine modern ships.   Question No. 155 answered with Question No. 121.  ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 154. Deputy Matt Carthy asked the Minister for Defence the number of naval vessels that can currently be put to sea simultaneously; and the number required under Level of Ambition 2. [71895/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_91",
          "debateSectionId": "dbsect_91",
          "showAs": "Naval Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_91.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_154",
        "questionNumber": 154
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The first year in which ISIF had holdings in Palantir Technologies was 2023 and as reported for year-end 2023, those holdings were valued at €300,000. The most recent annual report is for the year ended December 2024 and ISIF’s holdings in Palantir Technologies at year end were valued at €950,000.  ISIF does not comment on individual investment decisions given commercial sensitivities. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 374. Deputy Matt Carthy asked the Tánaiste and Minister for Finance the date Ireland began to invest in a company (details supplied); the dates on which Ireland increased or decreased its holding and the values thereof; the reasons for increased investments or divestments; and if he will make a statement on the matter. [72269/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_272",
          "debateSectionId": "dbsect_272",
          "showAs": "Question Heading for question(s)  374",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_272.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_374",
        "questionNumber": 374
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The Department is aware of the situation regarding the service in question.  While no details can be shared regarding the specifics of the fee review decision nor the details of the current issue, the Department can confirm that the relevant stakeholders have been contacted.  Department officials will endeavour to support and ensure that all stakeholders are aware of all the options and supports available.  The Department does not want any service to be faced with financial sustainability issues and officials in the Department are committed to working with any such service to support them in delivering early learning and childcare for the public good. As such, in addition to the increased level of Core Funding for year 4 of the scheme and fee management developments, there are wider financial supports available from the Department where a service is experiencing financial difficulty or has concerns about their viability, which can be accessed while remaining within Core Funding.  Services are encouraged to avail of these supports by engaging with their local City and County Childcare Committee (CCC) in the first instance.  Contact details for all CCCs can be found on www.gov.ie/en/department-of-children-disability-and-equality/publications/city-and-county-c. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 847. Deputy Matt Carthy asked the Minister for Children, Disability and Equality if she will engage with a childcare provider (details supplied) to resolve the issues that threaten the closure of this service; and if she will make a statement on the matter. [72159/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_670",
          "debateSectionId": "dbsect_670",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_670.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_847",
        "questionNumber": 847
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, it has been referred to the Health Service Executive for attention and direct reply to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1078. Deputy Matt Carthy asked the Minister for Health the reason a decision was made to remove a full care package from a child (details supplied), if the full care package can be reinstated; and if she will make a statement on the matter. [72273/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_892",
          "debateSectionId": "dbsect_892",
          "showAs": "Departmental Correspondence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_892.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1078",
        "questionNumber": 1078
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  This government is fully committed to supporting students with special educational needs to fulfil their full potential and the Programme for Government makes a number of commitments to deliver on this objective.  There continues to be increasing demand for additional special school places to support students with complex needs. In response, sixteen new special schools have been established in recent years, and capacity has been expanded in a number of others. Five of these were established for the 2025/26 school year in counties, Cork, Dublin (2), Monaghan and Tipperary. A list of special schools is available on the department website via the following link Special Schools (www.gov.ie/en/department-of-education/organisation-information/special-schools/). Enrolment data for the 2025/2026 school year is being collated and not available at present.  The new special schools established over recent years have focused on providing additional places in our largest urban areas – Dublin and Cork. As you are aware five new special schools were established for the 2025/26 school year, two in County Dublin and one each in counties Cork, Monaghan and Tipperary. This will bring to 129 the number of NCSE supported special schools in the country. Details on special school enrolments are attached. It is estimated that a further 300 new special school places may be required each year for the coming years.  The department and NCSE have already begun planning in relation to further expanding special school capacity for the 2026/27 school year, examining available data on the growing need for special school places across the country. This involves a detailed analysis of enrolment trends and the potential for existing special schools in a region to expand. The distance that students are travelling to access an education that meets their needs is also considered in the decision-making process. Consideration is also given to the information the NCSE hold at local level on the number of children and young people seeking a special school place in a region.  The department’s preference is to increase provision in existing special schools where possible. Where this is not possible, the department and NCSE will consider the need to establish a new special school.  The NCSE is undertaking analysis of information provided through the Parents Notify process which closed on 1 October to plot demand for specialist places for the 2026/27 school year. Once the analysis is complete, the NCSE will be equipped to engage with schools to open new special classes in relevant areas.  My department and the NCSE are committed to ensuring that sufficient special education placements remain available for students with special educational needs and will continue to review and monitor the situation nationwide as to where new special schools are required. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 189. Deputy Matt Carthy asked the Minister for Education and Youth the details of the current special schools, by location; whether these schools are in permanent or interim/temporary buildings; the current number of children attending each school; the number waiting on a place in each school, in tabular form; and if she will make a statement on the matter. [70499/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_153",
          "debateSectionId": "dbsect_153",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_153.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_189",
        "questionNumber": 189
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Deputy Matt Carthy  Why is Irish taxpayers' money still being invested in companies that derive their profits from the illegal occupation of Palestinian territories? Will the Tánaiste give the House an update on efforts to divest from such companies? \n Deputy Simon Harris  I thank the Deputy for this question, in which he has rightly asked me to outline the progress that has been made in divesting State moneys from companies that derive profits from their activities in the occupied Palestinian territories. The Government is clear in its opposition to illegal Israeli settlements, which are contrary to international law and damaging to the pursuit of peace in the Middle East. Ireland has not been found wanting in its support of the Palestinian people and has taken practical steps at national, EU and international levels. Indeed, we have been recognised internationally as a leading voice on this. Ireland has provided over €100 million in support of the people of Palestine since 2023.  The Ireland Strategic Investment Fund, ISIF, has complete independence in implementing its investment strategy under the NTMA Acts through an investment committee that reports to the NTMA's board. ISIF has taken a decision to divest from six companies, all of which remain on the updated UN database. While divestment from these companies does not mean that Israel will stop maintaining its presence in the occupied Palestinian territories, sadly, ISIF will continue to monitor its investments.  It is important to state the companies are ones that operate all over the world. ISIF's investment in them represents a very small proportion of its overall investments. More broadly, as the Deputy knows, efforts to secure a just resolution to the Israel–Palestine conflict and to the genocidal activity taking place in Palestine are ongoing. Our focus must remain on strengthening the ceasefire and bringing about peace.  ISIF has taken a decision to divest from six companies, all of which remain on the updated UN database and with a total value at the time of divestment of approximately €2.95 million. The six companies are Bank Hapoalim BM, Bank Leumi Le-Israel BM, Israel Discount Bank Ltd., Mizrahi-Tefahot Bank Ltd., First International Bank Ltd. and Rami Levi Chain Stores Ltd. I will provide the Deputy with the list in writing.  ISIF does not comment on individual investments but a list of ISIF investments is available in the 2024 NTMA annual report. I have been informed that ISIF will continue to monitor its holdings to ensure investments remain aligned with its risk profile and investment parameters, but it does not comment on individual investments. I am due to meet officials from the NTMA shortly. \n Deputy Matt Carthy  It is not good enough that we continue to invest taxpayers' money in companies that derive their profits from a systemic apartheid regime, which involves the occupation of the West Bank in particular. We have known about this for years and that the occupation is illegal. We know of the real-life impact it has had. We also know that because Israel has faced no consequences whatsoever, it has continued to act with impunity, including through engaging in genocide in Gaza over the past couple of years. The very least we can do is ensure we are not investing public moneys in companies benefiting from all of this. While I welcome that there is divestment from six companies, that just shows that progress is far too slow. The Tánaiste indicated that he is going to meet officials from the NTMA. Is he going to instruct the NTMA to accelerate the process? \n Deputy Simon Harris  I will discuss and get an overview on a variety of issues with the NTMA at a first sit-down meeting. ISIF has divested from six companies on the UN database. The NTMA also divested from directly held sovereign bond holdings with a global portfolio across Egypt, Israel and Jordan in July 2025.  It is important to note, as my notes suggest, that companies can come onto and off the UN database.  Many of these companies are large, global companies. There needs to be that context too. These are large, global companies which can have a presence right across the world. Ireland's position on the occupied Palestinian territories has been clear and consistent in relation to their illegality. ISIF obviously has independence in relation to its investment strategy. That is not just independence that I say but independence under the law of the land, the NTMA Act, and under the investment committee that reports to the NTMA. \n Deputy Matt Carthy  Companies can come on and off the UN database list but the question is what the point of having it is if it does not ensure that states act accordingly. The UN database sets out those companies that are deriving profits directly from the occupied territories, but it does not even cover all of the companies that are benefiting from Israeli war crimes. One company, Palantir, for example, has seen Irish investment increase since 2021. We are at a point where our holdings are increasing but the value is increasing exponentially. This is a company that has provided the IDF with the resources to conduct its genocide. Is Ireland still investing in that company? Are there plans to divest from that company? \n Deputy Pearse Doherty  This issue has been raised for many years. We have a new finance Minister. I would like a bit of straight talking from this finance Minister about his position. We are all appalled by the genocide that we have seen before our eyes with 70,000 people slaughtered. Deputy Carthy talked about one company. When accusations were put to the CEO of that company that his equipment was involved in the killing of Palestinians in Gaza, he said that is true. The UN human rights report stated that the company had provided defence infrastructure, military software and AI that allows automated decision-making, so it is using AI to automate the slaughter of Palestinians. Sometimes there is not much we can do about that. We can raise our voice, have sanctions and so on but one thing we can do is not invest in the company that is proudly associated with the IDF and the genocide in Palestine. That is what we need to do. Deputy Harris is a new Minister. I want him to state clearly to the House whether he believes that taxpayers' money should be invested in companies like that. There are many companies across the world that our money could be invested in. The NTMA does a good job but surely to God the Tánaiste can make a statement here that any other decent Irish person would have no problem with. Do not invest in companies that are involved in supporting genocide. \n Deputy Simon Harris  When the Deputy uses words like \"any other decent Irish person\", I am not sure whether he is trying to suggest that we are indecent or to vilify. \n Deputy Pearse Doherty  I am hoping the Tánaiste would make the statement and join the rest. \n Deputy Simon Harris  I am wondering because the Deputy uses these loaded comments to suggest that he is decent and we are not. \n Deputy Pearse Doherty  It is not decent to invest in genocide. I am clear that it is not decent to invest in genocide and I think the Tánaiste would be stretching it to suggest----- \n An Cathaoirleach Gníomhach (Deputy John Paul O'Shea)  Deputy Doherty, the Tánaiste, without interruption please. \n Deputy Simon Harris  Do not shout me down. I do not know how long this bully-boy routine of shouting me down is going to go on but if the Deputy could just ask me a question and allow me to answer it, it is how a democracy works. Stop shouting me down. It is a bit of basic respect. \n Deputy Pearse Doherty  I am not shouting the Tánaiste down. I am just telling him it is not decent to invest in genocide. \n Deputy Simon Harris  The Deputy has been at this a long time. He knows the law of the land under the NTMA Act. Does he accept that the NTMA Act allows ISIF full independence in relation to its investment decisions? Does the Deputy accept that the Minister for Finance----- \n Deputy Pearse Doherty  I accept that the Minister for Finance----- \n Deputy Simon Harris  No, I am sorry, I am speaking. Then I will sit down and the Deputy can speak. \n Deputy Pearse Doherty  The Tánaiste is asking questions. \n Deputy Simon Harris  I am asking them rhetorically of the Chair. \n An Cathaoirleach Gníomhach (Deputy John Paul O'Shea)  The Tánaiste, without interruption please. \n Deputy Simon Harris  Does Dáil Éireann understand that under the NTMA Acts, the investment decisions of ISIF are completely and utterly independent? Deputy Doherty tried to do this to my predecessor, suggesting that he was making decisions in relation to it. It was not true then and it is not going to be true now. The Deputy is not going to do it to me. If the Deputy wants to bring forward legislative proposals to change things, bring them forward. \n Deputy Pearse Doherty  We have legislation. The Government is blocking it in the committee. \n Deputy Simon Harris  We can have the discussion. The Deputy is asking me in parliamentary question time.  The second point I want to make, amidst the heckling on a serious issue, is that I do not need to be lectured on how to support the people of Palestine. Ask the Palestinian President, Prime Minister or ambassador how they have found our levels of support. I do not need a lecture from the Deputy. Is it his position that ISIF should not have any ability to invest in massive global companies that have presence right across the world, in many countries, including European countries, some which might even have headquarters in Ireland, if they have a presence in----- \n An Cathaoirleach Gníomhach (Deputy John Paul O'Shea)  We are out of time. \n Deputy Pearse Doherty  If they are involved in genocide in genocide, the answer is very simple, yes. \n Deputy Simon Harris  Is that the Deputy's position? That raises very serious questions. \n Deputy Pearse Doherty  If they are involved in genocide, yes. I think any decent person would say the same thing. \n Deputy Simon Harris  The consequences of that are very significant. \n Deputy Pearse Doherty  The Tánaiste did not answer any questions I put to him. At least Paschal answered the questions----- \n An Cathaoirleach Gníomhach (Deputy John Paul O'Shea)  Deputy, please address the Chair. \n Deputy Simon Harris  The Deputy misses Paschal. \n Deputy Pearse Doherty  -----yet the Tánaiste is giving me lectures on democracy. ",
        "questionType": "oral",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 14. Deputy Matt Carthy asked the Tánaiste and Minister for Finance the progress he has made divesting State moneys from companies that derive profits from their activities in the occupied Palestinian territories. [64395/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/debate/dbsect_25",
          "debateSectionId": "dbsect_25",
          "showAs": "National Treasury Management Agency",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/debate/mul@/dbsect_25.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_14",
        "questionNumber": 14
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  Liquid fuels used for motor or heating purposes are subject to excise duty in the form of Mineral Oil Tax (MOT). MOT comprises a carbon and a non-carbon component with the carbon component also being referred to as carbon tax. The application of carbon tax to petrol and auto-diesel was introduced in December 2009, followed by the extension of carbon taxation to other liquid fuels on 1 May 2010.  Ireland’s carbon tax regime is a carbon pricing mechanism which directly links the taxation of fossil fuels to carbon dioxide (CO2) emissions: a single price is set for a tonne of CO2 and this price is then applied to each fuel type according to the level of CO2 emitted by that fuel when it is combusted. In this way, the carbon tax applying to each fuel type reflects the level of CO2 emissions that it releases.  Legislation was introduced in Finance Act 2020 to provide for annual increases in carbon tax rates up to May 2030, at which point all carbon tax rates will be based on charging €100 per tonne of CO2 emissions. Carbon tax rates on petrol and auto-diesel are legislated to increase at Budget time each October up to and including 2029, with rates on other liable fuels such as heating kerosene and marked gas oil legislated to increase each May (i.e. after the winter heating season) up to and including 2030. This means that MOT rates on petrol and auto-diesel are set to increase a further four times, and MOT rates on heating fuels are set to increase a further five times, over the remainder of the trajectory provided for in legislation.  Overall rates of MOT, and rates for the carbon component, up to 2030, are set out in Schedules 2 and 2A respectively of the Finance Act 1999 (as amended). I am advised by Revenue that a non-statutory consolidation of the MOT provisions of Finance Act 1999 is published on Revenue’s website at www.revenue.ie/en/companies-and-charities/documents/excise/legislation/mot-primary-law.pdf. Carbon tax rates as set out in Schedule 2A are published on page 40 of this document. Current MOT rates are also published on Revenue’s website at https://www.revenue.ie/en/tax-professionals/tdm/excise/excise-duty-rates/energy-excise-duty-rates.pdf.  Tables 1 to 4 below detail the annual carbon tax rate changes which are legislated to impact on petrol, auto-diesel, heating kerosene, and marked gas oil respectively up to 2030. For completeness, current rates, along with non-carbon and total MOT rates, are also included. In addition, the tables detail future annual MOT rate increases per litre of fuel, inclusive of VAT calculated at current VAT rates of 23% on auto-fuels, and 13.5% on heating fuels.   Table 1: Petrol       Petrol rate from      Charge per tonne of CO2      MOT carbon per 1,000 litres      MOT non-carbon per 1,000 litres      Total MOT per 1,000 litres      Total MOT per litre incl. VAT      Future increase per litre incl. VAT       8 Oct 2025    €71.00    €164.30    €541.84    €706.14    86.9c    N/A      14 Oct 2026    €78.50    €181.65    €541.84    €723.49    89.0c    2.1c      13 Oct 2027    €86.00    €199.01    €541.84    €740.85    91.1c    2.1c      11 Oct 2028    €93.50    €216.37    €541.84    €758.21    93.3c    2.1c      10 Oct 2029    €100.00    €231.41    €541.84    €773.25    95.1c    1.8c       The total increase in MOT per litre VAT inclusive for petrol over the remainder of the carbon tax trajectory is 8.1 cents.   Table 2: Auto-diesel       Auto-diesel rate from      Charge per tonne of CO2      MOT carbon per 1,000 litres      MOT non-carbon per 1,000 litres      Total MOT per 1,000 litres      Total MOT per litre incl. VAT      Future increase per litre incl. VAT       8 Oct 2025    €71.00    €190.04    €425.72    €615.76    75.7c    N/A      14 Oct 2026    €78.50    €210.11    €425.72    €635.83    78.2c    2.5c      13 Oct 2027    €86.00    €230.18    €425.72    €655.90    80.7c    2.5c      11 Oct 2028    €93.50    €250.26    €425.72    €675.98    83.1c    2.5c      10 Oct 2029    €100.00    €267.66    €425.72    €693.38    85.3c    2.1c     The total increase in MOT per litre VAT inclusive for auto-diesel over the remainder of the carbon tax trajectory is 9.6 cents.   Table 3: Heating kerosene       Heating kerosene rate from      Charge per tonne of CO2      MOT carbon per 1,000 litres      MOT non-carbon per 1,000 litres      Total MOT per 1,000 litres      Total MOT per litre incl. VAT      Future increase per litre incl. VAT       1 May 2025    €63.50    €160.81    €0.00    €160.81    18.3c    N/A      1 May 2026    €71.00    €179.81    €0.00    €179.81    20.4c    2.2c      1 May 2027    €78.50    €198.80    €0.00    €198.80    22.6c    2.2c      1 May 2028    €86.00    €217.80    €0.00    €217.80    24.7c    2.2c      1 May 2029    €93.50    €236.79    €0.00    €236.79    26.9c    2.2c      1 May 2030    €100.00    €253.25    €0.00    €253.25    28.7c    1.9c       The total increase in MOT per litre VAT inclusive for heating kerosene over the remainder of the carbon tax trajectory is 10.7 cent.   Table 4: Marked Gas Oil (MGO)       Marked Gas Oil rate from      Charge per tonne of CO2      MOT carbon per 1,000 litres      MOT non-carbon per 1,000 litres      Total MOT per 1,000 litres      Total MOT per litre incl. VAT      Future increase per litre incl. VAT       1 May 2025    €63.50    €172.14    €47.36    €219.50    24.9c    N/A      1 May 2026    €71.00    €192.47    €47.36    €239.83    27.2c    2.3c      1 May 2027    €78.50    €212.80    €47.36    €260.16    29.5c    2.3c      1 May 2028    €86.00    €233.13    €47.36    €280.49    31.8c    2.3c      1 May 2029    €93.50    €253.47    €47.36    €300.83    34.1c    2.3c      1 May 2030    €100.00    €271.09    €47.36    €318.45    36.1c    2.0c       The total increase in MOT per litre VAT inclusive for MGO over the remainder of the carbon tax trajectory is 11.2 cent. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 62. Deputy Matt Carthy asked the Tánaiste and Minister for Finance the number of times he intends to increase the cost of petrol, diesel and home heating oil until 2030; the cost to consumers of each increase; and the compounded total cost of the increase, by increase and by category. [64394/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_77",
          "debateSectionId": "dbsect_77",
          "showAs": "Fuel Prices",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_77.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_62",
        "questionNumber": 62
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I wish to confirm to the Deputy, that my Department is in receipt of an application from the school in question under the Department's Additional School Accommodation (ASA) scheme.  The purpose of my Department’s ASA scheme is to ensure that essential mainstream classroom accommodation and accommodation for pupils with special education needs is available to cater for pupils enrolled each year, where the need cannot be met by the school’s existing accommodation.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In addition, repurposing and optimisation of existing accommodation capacity across the school estate has been a key enabler of timely, local provision of special class capacity in a way that supports best practice in inclusion and integration. Circa 80% of new special classes in 2025/26 are being facilitated in repurposed classroom accommodation.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  My department will publish our sectoral NDP Implementation Plan shortly. This plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  The application is currently being assessed and when finalised the school authority will be contacted directly with a decision. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 417. Deputy Matt Carthy asked the Minister for Education and Youth the status of a funding request submitted by a school (details supplied); and if she will make a statement on the matter. [69750/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_371",
          "debateSectionId": "dbsect_371",
          "showAs": "Departmental Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_371.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_417",
        "questionNumber": 417
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 586, 587, 588, 589, 610, 612, 613 and 615 together.  The right to fair procedures is a central tenet of our criminal justice system. Ireland opted in to the EU Directive on the right to interpretation and translation in criminal proceedings and it was subsequently transposed into Irish law. This was done via two Statutory Instruments, one relating to Interpretation and Translation in Criminal Proceedings, which relates to the arrangements to be put in place by the Courts Service in respect of the conduct of court proceedings and the second which relates to Interpretation and Translation for Persons in Custody in Garda stations.  Article 5 of the Directive reads that Member States are required to take ‘concrete measures’ to ensure the quality of the interpretation and translation services. A 2018 European Commission report on the implementation of Directive did not flag any issues of concern regarding Ireland’s approach to same and there are no open infringement proceedings underway in this regard. The manner in which these instruments are implemented in practice is an operational matter for An Garda Síochána and the Courts.  The Garda Commissioner is responsible for the management and administration of An Garda Síochána. I cannot intervene in operational Garda matters that fall under the Garda Commissioner’s remit, including the processes by which translation and interpretation services are provided. To be of assistance, I have requested the information sought in this regard from the Garda authorities. Regrettably, this was not available in time and I will write to the Deputy further once the information is to hand.  Management of the courts and operational matters, including the management of interpretation services, are the responsibility of the Courts Service, which is independent in the exercising of its functions under the Courts Service Act 1998 and given the separation of powers in the Constitution. To be of assistance, I have referred the questions regarding costs and other operational matters to the Courts Service for direct reply. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 610. Deputy Matt Carthy asked the Minister for Justice, Home Affairs and Migration the amount spent on interpreters in the courts in each of the past five years; the name of each companies used; the breakdown of the amount paid to each company used, in tabular form; and if he will make a statement on the matter. [69358/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_502",
          "debateSectionId": "dbsect_502",
          "showAs": "Courts Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_502.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_610",
        "questionNumber": 610
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I have requested the information sought by the Deputy from the Garda authorities. Regrettably, this was not available in time and I will write to the Deputy once the information is to hand. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 611. Deputy Matt Carthy asked the Minister for Justice, Home Affairs and Migration the amount spent on interpreters by An Garda Síochána in each of the past five years; the name of each company used; the breakdown of the amount paid to each company used, in tabular form; and if he will make a statement on the matter. [69359/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_515",
          "debateSectionId": "dbsect_515",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_515.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_611",
        "questionNumber": 611
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 586, 587, 588, 589, 610, 612, 613 and 615 together.  The right to fair procedures is a central tenet of our criminal justice system. Ireland opted in to the EU Directive on the right to interpretation and translation in criminal proceedings and it was subsequently transposed into Irish law. This was done via two Statutory Instruments, one relating to Interpretation and Translation in Criminal Proceedings, which relates to the arrangements to be put in place by the Courts Service in respect of the conduct of court proceedings and the second which relates to Interpretation and Translation for Persons in Custody in Garda stations.  Article 5 of the Directive reads that Member States are required to take ‘concrete measures’ to ensure the quality of the interpretation and translation services. A 2018 European Commission report on the implementation of Directive did not flag any issues of concern regarding Ireland’s approach to same and there are no open infringement proceedings underway in this regard. The manner in which these instruments are implemented in practice is an operational matter for An Garda Síochána and the Courts.  The Garda Commissioner is responsible for the management and administration of An Garda Síochána. I cannot intervene in operational Garda matters that fall under the Garda Commissioner’s remit, including the processes by which translation and interpretation services are provided. To be of assistance, I have requested the information sought in this regard from the Garda authorities. Regrettably, this was not available in time and I will write to the Deputy further once the information is to hand.  Management of the courts and operational matters, including the management of interpretation services, are the responsibility of the Courts Service, which is independent in the exercising of its functions under the Courts Service Act 1998 and given the separation of powers in the Constitution. To be of assistance, I have referred the questions regarding costs and other operational matters to the Courts Service for direct reply. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 612. Deputy Matt Carthy asked the Minister for Justice, Home Affairs and Migration the average rate per hour paid to individuals working as interpreters in the courts and separately for An Garda Síochána in each of the past five years, in tabular form; and if he will make a statement on the matter. [69360/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_502",
          "debateSectionId": "dbsect_502",
          "showAs": "Courts Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_502.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_612",
        "questionNumber": 612
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 586, 587, 588, 589, 610, 612, 613 and 615 together.  The right to fair procedures is a central tenet of our criminal justice system. Ireland opted in to the EU Directive on the right to interpretation and translation in criminal proceedings and it was subsequently transposed into Irish law. This was done via two Statutory Instruments, one relating to Interpretation and Translation in Criminal Proceedings, which relates to the arrangements to be put in place by the Courts Service in respect of the conduct of court proceedings and the second which relates to Interpretation and Translation for Persons in Custody in Garda stations.  Article 5 of the Directive reads that Member States are required to take ‘concrete measures’ to ensure the quality of the interpretation and translation services. A 2018 European Commission report on the implementation of Directive did not flag any issues of concern regarding Ireland’s approach to same and there are no open infringement proceedings underway in this regard. The manner in which these instruments are implemented in practice is an operational matter for An Garda Síochána and the Courts.  The Garda Commissioner is responsible for the management and administration of An Garda Síochána. I cannot intervene in operational Garda matters that fall under the Garda Commissioner’s remit, including the processes by which translation and interpretation services are provided. To be of assistance, I have requested the information sought in this regard from the Garda authorities. Regrettably, this was not available in time and I will write to the Deputy further once the information is to hand.  Management of the courts and operational matters, including the management of interpretation services, are the responsibility of the Courts Service, which is independent in the exercising of its functions under the Courts Service Act 1998 and given the separation of powers in the Constitution. To be of assistance, I have referred the questions regarding costs and other operational matters to the Courts Service for direct reply. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 613. Deputy Matt Carthy asked the Minister for Justice, Home Affairs and Migration the number of times an interpreter has been used in the Courts in each of the past five years; and if he will make a statement on the matter. [69362/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_502",
          "debateSectionId": "dbsect_502",
          "showAs": "Courts Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_502.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_613",
        "questionNumber": 613
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I have requested the information sought by the Deputy from the Garda authorities. Regrettably, this was not available in time and I will write to the Deputy once the information is to hand. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 614. Deputy Matt Carthy asked the Minister for Justice, Home Affairs and Migration the number of times an interpreter has been used for interviews by An Garda Síochána in each of the past five years; and if he will make a statement on the matter. [69363/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_516",
          "debateSectionId": "dbsect_516",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_516.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_614",
        "questionNumber": 614
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 586, 587, 588, 589, 610, 612, 613 and 615 together.  The right to fair procedures is a central tenet of our criminal justice system. Ireland opted in to the EU Directive on the right to interpretation and translation in criminal proceedings and it was subsequently transposed into Irish law. This was done via two Statutory Instruments, one relating to Interpretation and Translation in Criminal Proceedings, which relates to the arrangements to be put in place by the Courts Service in respect of the conduct of court proceedings and the second which relates to Interpretation and Translation for Persons in Custody in Garda stations.  Article 5 of the Directive reads that Member States are required to take ‘concrete measures’ to ensure the quality of the interpretation and translation services. A 2018 European Commission report on the implementation of Directive did not flag any issues of concern regarding Ireland’s approach to same and there are no open infringement proceedings underway in this regard. The manner in which these instruments are implemented in practice is an operational matter for An Garda Síochána and the Courts.  The Garda Commissioner is responsible for the management and administration of An Garda Síochána. I cannot intervene in operational Garda matters that fall under the Garda Commissioner’s remit, including the processes by which translation and interpretation services are provided. To be of assistance, I have requested the information sought in this regard from the Garda authorities. Regrettably, this was not available in time and I will write to the Deputy further once the information is to hand.  Management of the courts and operational matters, including the management of interpretation services, are the responsibility of the Courts Service, which is independent in the exercising of its functions under the Courts Service Act 1998 and given the separation of powers in the Constitution. To be of assistance, I have referred the questions regarding costs and other operational matters to the Courts Service for direct reply. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 615. Deputy Matt Carthy asked the Minister for Justice, Home Affairs and Migration the list of all the languages for which an interpreter was required in the courts, in each of the past five years, in tabular form; and if he will make a statement on the matter. [69364/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_502",
          "debateSectionId": "dbsect_502",
          "showAs": "Courts Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_502.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_615",
        "questionNumber": 615
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  It is a central priority for me that our international protection and immigration systems are robust and enforced.  Under Section 15(1) of the International Protection Act 2015, a person who wishes to make a claim for international protection in Ireland must be at the frontier of the State or already be present in the State.  The immigration history of individuals who apply for International Protection are noted as part of the application process; this will include information related to the manner in which they entered the State. While this information is recorded as part of an individual application for protection, this data is not managed in a format that would make it readily accessible.  In preparation for the implementation for the EU Migration Pact in the second half of 2026, new arrangements for data collation and reporting are being put in place; this will include enhanced reporting capabilities in relation to matters such as prior immigration history. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 669. Deputy Matt Carthy asked the Minister for Justice, Home Affairs and Migration the number of those who entered the State as international students who have applied for asylum in 2025 and in each of the past five years, in tabular form; and if he will make a statement on the matter. [69785/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_542",
          "debateSectionId": "dbsect_542",
          "showAs": "Asylum Applications",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_542.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_669",
        "questionNumber": 669
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I published the Sectoral Investment Plan for Justice 2026-2030 on Thursday 4 December 2025. The allocation of €2.18 billion which I negotiated, will support major capital projects in the Justice sector from 2026-2030.  Details of the Plan have been published on my Department's website at www.gov.ie/en/department-of-justice-home-affairs-and-migration/press-releases/minister-jim-ocallaghan-secures-cabinet-approval-for-218-billion-sectoral-investment-plan-for-justice-2026-2030/  Some of the key allocations include:  • €528m to deliver the Prisons Capital Plan which includes nearly €500m to deliver more than 1,500 prison spaces  • Investment of €364m in Garda buildings and €460m in digital systems including body worn cameras  • A new approach to investing in the security of the State with €200m for a modern Security HQ, new technology for national security, border security, the National Cyber Security Centre and new National Security Authority.  • €369m funding for the Courts Service for courthouses and technology  • Funding for a new mortuary in Dublin  • €200m to develop state-owned accommodation for immigration purposes  • Major digital investment of €81m across the Department and justice agencies to support a modern immigration system. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 704. Deputy Matt Carthy asked the Minister for Justice, Home Affairs and Migration if his Department intends to publish a NDP sectoral plan; and if he will make a statement on the matter. [70146/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_563",
          "debateSectionId": "dbsect_563",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_563.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_704",
        "questionNumber": 704
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter I have asked the HSE to respond to the deputy as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1016. Deputy Matt Carthy asked the Minister for Health further to Parliamentary Question No. 2454 of 29 April 2025, if it is proposed to review the position regarding the establishment of a neurology hub in the Cavan/Monaghan region to assist patients to have access to integrated services without requiring hospital in-patient care; and if she will make a statement on the matter. [69753/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_841",
          "debateSectionId": "dbsect_841",
          "showAs": "Hospital Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_841.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1016",
        "questionNumber": 1016
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  Our Rural Future committed to developing an effective rural proofing approach.  My Department commissioned a body of research on rural proofing, available online, which sets out some of the key international evidence in relation to rural proofing.  A Rural Proofing Pilot was subsequently undertaken on four key initiatives across a number of Government Departments.  Currently, the Cabinet Handbook requires all government proposals being submitted by memo for government to outline the impact of the given proposal on rural areas.  The pilot evidenced that a level of rural proofing is already taking place within the current system, although it may not be labelled with a formal ‘rural proofing’ tag. In recognising this, my Department developed a Guide to Rural Proofing for Policy Makers to build on and strengthen the existing approach.  The Guide, which includes a simplified Rural Proofing Assessment template and key resources, aims to provide a clear outline of what rural proofing is and to make rural proofing easy to understand and implement. The principal purpose is to aid and support policy makers to ‘think rural’ when developing policies to help ensure government policies understand, and take account of, specific needs and capacities of rural communities.  The Guide, available online, has been circulated to all Government Departments to be added to the suite of tools/processes used by policy makers.  The importance of rural proofing has also been highlighted in bilateral meetings with Departments in the development of the new Our Rural Future policy from 2026.  This will help ensure that actions developed across Government to support the policy implementation will more effectively consider the impacts for rural areas, helping result in better outcomes for rural communities. There is also evidence of early engagement by Departments in the development of key strategies, which can help ensure the principles of effective rural proofing are built into the design of those strategies.  I am confident the guide will serve as a practical and user friendly tool for Departments to support that process and help ensure that rural issues are fully taken account of in the development of major policy initiatives across Government. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 46. Deputy Matt Carthy asked the Minister for Rural and Community Development and the Gaeltacht if he will report on their implementation of a rural proofing model. [68521/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_84",
          "debateSectionId": "dbsect_84",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_84.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_46",
        "questionNumber": 46
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development (Deputy Dara Calleary)  The Community Recognition Fund (CRF) was first introduced in 2023 to recognise the huge efforts made by communities in welcoming and supporting people coming to Ireland. Under the fund a total of €100 million has been provided to local authorities to support cities, towns and villages nationwide.  Under the initial €50 million allocation in 2023, some 908 projects were approved. All projects submitted to my Department by local authorities were successful in receiving funding  Under the CRF 2024, projects were approved over three phases across 2024 and 2025. In total 569 projects have been approved under CRF 2024, while 15 applications submitted by local authorities to my Department for approval were not allocated funding. It should be noted that each local authority had a set financial allocation and were given the opportunity to replace unsuccessful applications with alternative projects in order to utilise their full allocation.  The emphasis is now to ensure that all projects are delivered in the coming months so that communities can benefit from this investment.  While there was no additional allocation in 2025 under CRF, my Department continues to support the development of community infrastructure through it range of investment programmes.  The attached table sets out the number of applications that were successful and unsuccessful under both iterations of the fund in each county.   CRF Successful & unsuccessful projects  ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 66. Deputy Matt Carthy asked the Minister for Rural and Community Development and the Gaeltacht the number of applications received per year 2023-2024 and per county for funding under the Community Recognition Fund; the number that were successful and unsuccessful, respectively, in each county; the allocation that will be provided to each county in 2025; and if he will make a statement on the matter. [68520/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_100",
          "debateSectionId": "dbsect_100",
          "showAs": "Community Development Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_100.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_66",
        "questionNumber": 66
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Deputy Matt Carthy  The Minister has stated publicly on a number of occasions that a significant proportion - in fact, the vast majority - of those seeking international protection in this State are coming from Britain via the common travel area. It seems logical to most people that we need a bilateral agreement with Britain to ensure those international protection applicants who should be processed in Britain are returned there in a timely manner. What progress is being achieved in securing such an agreement? \n Minister for Justice, Home Affairs and Migration (Deputy Jim O'Callaghan)  I thank Deputy Carthy for his question. He is correct in identifying that there clearly is a lot of fluidity between asylum applications in the United Kingdom and Ireland because individuals can travel freely from Britain to Northern Ireland and, because of the common travel area, there is no barrier to individuals travelling south from Northern Ireland into this jurisdiction. Similarly, it operates in the other way. Many people can fly into Dublin Airport, freely travel up to Northern Ireland and then readily transfer over to Britain. It is an issue in the context of assessing applications for international protection.  It is important to set out the situation that pertained previously. Prior to Britain leaving the European Union, Britain was part of the Dublin III regulation and, therefore, returns could operate in respect of people who had come from Britain and applied for asylum here. After Brexit that changed. Promptly after Brexit, we designated the United Kingdom as a safe third country but that was fairly rapidly challenged and the court ruled it could not be categorised thus for a period. Then, earlier this year, on 11 March, I designated the UK as a safe third country. However, because the UK is outside of the EU, we do not have an operationalised system of returns between the UK and Ireland at present. My officials are in discussion with officials from the Home Office and I will be talking to the Home Secretary again in the week after next. I had very good engagement with the previous Home Secretary and I assume I will have the same good engagement with the current one. That said, I have to point out that the political reality is such that the UK is not going to enter into an agreement with Ireland whereby it simply takes back individuals who have applied for asylum in Ireland because they emanated from the UK. We can see what is happening in France. I agree with Deputy Carthy that there has to be greater engagement with the UK and I am in the process of doing that. \n Deputy Matt Carthy  The Minister will be aware that this week, the Oireachtas Joint Committee on Justice, Home Affairs and Migration in its pre-legislative scrutiny report on the international protection Bill asked that consideration be again given to opting out of the EU migration and asylum pact because that pact does not take cognisance of the fact we operate within a common travel area. Ireland is in the unique position of being an EU member state that also has a common travel area with a state outside of the EU. It is becoming increasingly clear that the pact fails to take account of Ireland's unique challenges. I am concerned at the lack of priority that the Minister is giving to what is a programme for Government commitment to prioritise working with the British Government to introduce further measures in respect of the common travel area. No progress has been made.  Is the Minister going to take account of the pre-legislative scrutiny report from the committee and prioritise this issue? It needs to be prioritised. \n Deputy Jim O'Callaghan  Progress has been made with the British Government. There is very good engagement between my Department and the Home Office. The only way we will be able to resolve the issues of concern to the Deputy and me is through collaboration and co-operation with the British Government. He keeps mentioning that we should not have opted in to the pact, but he must then present to the public the consequence of that. The consequence of not opting in is that the 2015 International Protection Act would still apply, as would the 2004 directives giving effect to that. It is not as simple as saying that we should not have opted in to the pact. If we had not opted in to the pact, we would still have the same issue under the 2015 legislation and that does not resolve the issue we are facing. There needs to be an awareness that opting in to the pact has not precluded us from doing what we want to do. The reason we have had a significant change is that the British have left the European Union. It is as a result of the British leaving the EU that we have this issue in our common travel area. I would appreciate if Deputy Carthy and Sinn Féin would say that the common travel area is for the benefit of citizens of Ireland and the UK and not for anyone else. That would be a considerable contribution. \n Deputy Matt Carthy  I will say that if it makes the Minister happier. \n Deputy Niall Collins  Well done. That is one in a row and the first time he has said it. \n Deputy Matt Carthy  The Minister should also say, as all of us in this House should say, that managing migration would be much easier if we were doing it on an all-Ireland basis within a unitary state framework and that, therefore, we should try to advance the reunification of our country for that and many other reasons.  In 2020, Ireland and Britain agreed informal, non-legally binding operational arrangements to return asylum seekers to each other. How many have been returned to Britain from Ireland? I ask the Minister to provide real figures. Different percentages have been cited in terms of the numbers that are coming through the common travel area. We do not know the numbers for sure because we are not compiling data on people who might, for example, have come for tourism or on student or work visas and subsequently applied for international protection, or on those who applied in any other way. If the figures are anywhere close to those that have been cited, then it is negligence that ensuring we have an arrangement in place is not at the top of the Minister's list to . As he rightly says, the British Government has a potential benefit from this as well if what it is stating is the case. \n Deputy Matt Carthy  In response to the Deputy's specific questions, in 2019, of 35 people transferred, 33 were sent to the United Kingdom. In 2020, of eight people transferred, seven were sent to the UK. This is at the top of my list. In fact, I am criticised for trying to deal with issues in respect of international protection and for giving too much priority to it but it is an absolutely essential issue. In terms of what the Deputy said about the figures, what we have is an assessment that the figures are very high because huge percentages of people are applying for international protection at the International Protection Office, IPO. They are not applying at the airport and while it is not conclusive, we believe it is strongly persuasive evidence that those individuals who apply for asylum at the IPO are coming south over the Border. That is supported anecdotally as well. The percentage of people applying for asylum at the IPO is 87%.  As I have said previously, there are many people going in the other direction. When I speak to the Home Secretary, she will be saying to me that she has great concern about people flying into Dublin Airport and coming into Britain through Northern Ireland. \n Deputy Matt Carthy  Then let us have a bilateral agreement. \n Deputy Jim O'Callaghan  They have a bilateral agreement with the French and it is one in, one out. They are realistic politicians. \n Deputy Matt Carthy  We have a common travel area. \n Deputy Jim O'Callaghan  That agreement is one in, one out. ",
        "questionType": "oral",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 73. Deputy Matt Carthy asked the Minister for Justice, Home Affairs and Migration the progress that has been made to secure a bilateral agreement with Britain to ensure those international protection applicants who should be processed in Britain can be returned there in a timely manner; and if he will make a statement on the matter. [68314/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/dbsect_19",
          "debateSectionId": "dbsect_19",
          "showAs": "International Protection",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/mul@/dbsect_19.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_73",
        "questionNumber": 73
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Deputy Matt Carthy  It is now several months since the Minister received the report on the civil legal aid review, which in itself took three years to complete. Recommendation 22 of that report called for an immediate review of the Legal Aid Board's capacity to administer the current civil legal aid scheme. Will the Minister advise whether that has been commenced and when it is expected to be complete? \n Deputy Jim O'Callaghan  As the Deputy knows, the Legal Aid Board is the statutory body responsible for the provision of civil legal aid and advice to qualifying individuals. There are two parts to it, one is legal advice while the other is legal representation. Eligibility for the scheme is determined by reference to a financial assessment. The Legal Aid Board provides enormous assistance, particularly in the area of family law and, indeed, going back to what we were talking about earlier, international protection.  The Deputy is correct in that the former Chief Justice, Mr. Justice Frank Clarke, was asked in June 2022 to conduct a review. Two reports actually were published in July 2025 which contained recommendations relating to the income threshold allowances and other financial aspects of the scheme. Since the overall available income eligibility threshold is influenced by the level of deductible allowances any changes must be considered in the round and the potential implications that such changes might have on the operation of the scheme. While the review highlights the need for comprehensive legal aid reform it also recognises that the current legal aid system must function effectively in the meantime. A critical aspect of any implementation will, therefore, be careful sequencing of reforms. However, I want the Deputy to know that in my Department, officials are considering the reports and are putting together proposals that will come to me for the purpose of implementing the recommendations.  The Deputy is correct in noting that the review group recognised that immediate action is required on the financial eligibility thresholds. It favoured an increase in the available income threshold from €18,000 to €23,500 as soon as possible. I want to see that achieved. I have instructed officials in my Department that I want to see it achieved. However, I have to inform the Deputy that I cannot just do that by the stroke of a pen. Once I do that, the demand for services is going to increase quite significantly. I need to ensure that I have the lawyers available to provide the increase in services. It is an important question and progress is being made on it. \n Deputy Matt Carthy  Having heard the number of announcements the Minister has made over the past year without any changes happening, it concerns me when he has not even made an announcement in respect of this. That says to me that there is not an appreciation yet of the urgency here. There is a real crisis right now in accessing civil legal aid. That means there is a crisis in access to justice. The income limits, incredibly, have not changed since 2006. We are told by everybody involved that the fee structure means we do not have enough private lawyers carrying out legal aid work. That is creating problems in some parts of the country where there are basically no supports available, particularly for vulnerable people, including victims of domestic violence, who just cannot get the representation they need.  I am told by those who work in the area that the civil legal aid services are virtually on the brink of collapse, unless something is done urgently. I hear what the Minister is saying in terms of asking his officials to do this and wanting to do that. Will he give us a timeframe and clarity as to when we will see action in this area? \n Deputy Jim O'Callaghan  It is important that I got the report, read it and published it and that we tried to consider how we could implement it. I regret to say that it cannot happen overnight. The Deputy might think that can happen in government, that a Minister can say, \"I am going to do this\" and that it happens. It is important to announce what one's policy objective is, however. It is important for me to say that I want to see the recommendations in respect of the financial eligibility set out in the majority report implemented.  It is also important to emphasise that funding for legal aid and legal advice has increased significantly in recent years. In budget 2021, my Department's allocation to the free legal advice centres, FLAC, trebled from €98,000 to €294,000. It is important that I made an announcement this year which was followed up with actual money. The budget allocation for FLAC for 2026 increased significantly from €500,000 to €750,000. The increased funding will allow them to prioritise callers and assist people who are seeking legal aid and legal assistance. Work is, therefore, being done. I am not going to just give a timeline but I have instructed officials in my Department that I want to see the recommendations set out in Frank Clarke's report implemented in respect of financial eligibility. \n Deputy Matt Carthy  For all the recommendations and the fact we need a whole overview of the civil legal aid scheme, two things need to be addressed, namely, income thresholds and fees. I do not believe that even the income thresholds suggested in the majority report are going to be sufficient to provide for access to the justice that I think the Minister will agree is integral. We need to get those two things sorted very quickly. While there has been no movement on that side, there is potentially a lot of additional pressure coming. I do not know whether the Minister followed the pre-legislative scrutiny discussions but people who work in this area have highlighted the burden that will be placed on them by the international protection Bill. Additional work is going to be put on the civil legal aid process. The Minister is adding to the pressures but not providing the solutions. What does the Minister intend to do to address the concerns around the international protection Bill? Crucially, when are we going to see the income thresholds and fees addressed? \n Deputy Jim O'Callaghan  In terms of international protection, Deputy Carthy is right about that. A significant number of people are seeking legal aid from the Legal Aid Board in respect of international protection. In fact, 11,689 applicants sought legal aid services in relation to international protection last year, which was an increase from nearly 10,000 the year before. That is hugely demanding for the Legal Aid Board. I am increasing the funding to the Legal Aid Board. The current budget allocation for the board for 2026 is €72 million, which is made up of €36.5 million for the pay budget and €35.6 million for the non-pay budget. When it comes to international protection and the enactment of the new international protection Bill, obviously there is a requirement within that, that we are going to provide legal counsel to individuals who are seeking assistance in respect of the international protection process. I will have to fund that. That funding will have to be made available. That will happen immediately, as of 12 June next year.  I am committed to changing the financial eligibility rules. However, I am not going to give a date here when I do not have certainty that it will be complied with by that date. ",
        "questionType": "oral",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 77. Deputy Matt Carthy asked the Minister for Justice, Home Affairs and Migration if he has initiated an immediate review of the Legal Aid Board’s capacity to administer the current civil legal aid scheme, as recommended by the review of civil legal aid; when he expects this review to be completed; and if he will make a statement on the matter. [68322/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/dbsect_23",
          "debateSectionId": "dbsect_23",
          "showAs": "Legal Aid",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/mul@/dbsect_23.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_77",
        "questionNumber": 77
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Deputy Matt Carthy  The Minister and Department seem to have at last recognised that the accommodation recognition scheme paid in respect of Ukrainian accommodation has had and is having an impact on the private rental market and what I consider the undisputed fact that landlords are using the scheme to avoid tenancy obligations. Will the Minister outline when he intends to bring forward proposed changes to the accommodation recognition scheme? \n Deputy Jim O'Callaghan  As the Deputy will be aware, this year we changed the payment under the accommodation recognition payment, ARP, from €800 per month to €600 per month. I know there were concerns about that change as to what impact it would have on those individuals being accommodated. I am pleased to say it has not had, in our opinion, a significantly detrimental impact and has not led to very many people who were being accommodated pursuant to that payment losing their accommodation. The accommodation recognition payment was a useful measure. It was a goodwill payment to recognise the contribution of hosts who opened up their homes to temporary protection beneficiaries from Ukraine. Some 41,500 people are being accommodated in over 23,000 hosted accommodations supported by this scheme. The ARP is not intended to be a substitute for rent. Indeed, it is not payable where there is a rental agreement in place between the host and the guest. According to research from the Irish Red Cross, the vast majority of hosts who avail of the ARP were never and have no future plans to be landlords. I am aware of concerns about the impact of the scheme on the private rental market. Analysis carried out by the RTB for my colleague, the Minister for housing, suggests that some landlords could be diverting accommodation from the private rental sector to benefit from the ARP. It is difficult to reach definitive conclusions on the matter given wider issues impacting housing supply. I can, however, confirm that the Government agreed to a proposal brought jointly by the Minister for housing and me for the governing legislation to be amended to limit eligibility for the ARP to properties that are not rental properties. I think that will meet the Deputy's concerns. I am pleased to inform the Deputy that drafting of the necessary legislative amendments to give effect to the decision is well advanced. The proposal follows the measure implemented earlier this year where we reduced the ARP from €800 to €600. \n Deputy Matt Carthy  I will agree with the Minister on one point - the accommodation recognition payment was a goodwill gesture for people who opened up their homes to Ukrainians fleeing war. It is very laudable and supported by everybody, I think, in this House. It was then extended and since then the impact of the ARP scheme on the rental market is seen in communities across the State. The Minister and the Government have refused to accept amendments Sinn Féin has brought forward that would limit the scheme to avoid the damage being done in the private rental sector. I welcome that there has been a belated acknowledgement by the Government that the scheme has impacted the private rental sector. We know landlords are availing of the scheme because they are incentivised to do so. Under the ARP, landlords get a tax-free payment. Crucially, and this is the reason we have not seen any distinction in the number since the reduced payment, they are able to avail of a top-up payment from their tenants without any regulation whatsoever. They are completely freed of any tenancy obligations that they would have for any other tenant. \n An Leas-Cheann Comhairle  Thank you, Deputy. \n Deputy Matt Carthy  It was blatantly obvious this was going to have an impact on the private rental market, and it is blatantly obvious that it is having an impact on the private rental market. \n An Leas-Cheann Comhairle  Thank you, Deputy. Please conclude. \n Deputy Matt Carthy  When will changes actually be brought forward, rather than just these cloudy timelines the Minister has been providing? \n Deputy Jim O'Callaghan  I disagree that it was blatantly obvious at the time it was introduced that it was going to have an impact on the private rental sector. We are not even sure at present that it is having an impact. There may be issues in respect of it. It is hard to definitively establish that. We are ensuring it will not be able to affect the private rental sector because we are going to limit eligibility for the ARP to properties that are not rental properties. That will ensure it will not have any distorting impact on the private rental sector. We also reduced the fee from €800 to €600 per month in respect of individuals giving goodwill accommodation. We also need to recognise, when you look at the number of people accommodated under the ARP - at present, it is about 41,500 - if it fell apart, if it was taken away and if there was no ARP, where would those people be accommodated? The Minister of State, Deputy Brophy, and I are trying to insist that if people with temporary protection are working, they have to pay for their own accommodation. There are people who will still need to be provided with State accommodation. This is probably the cheapest mechanism available at present. \n Deputy Matt Carthy  Here we go again. The Minister finally announced that there would be a recognition of the potential impact on the rental market months ago and he is still talking about himself and the Minister for housing bringing something forward at some unspecified time. What is really infuriating for so many people is the Government has yet to recognise that this scheme is deeply unfair. It provides a non-means-tested housing support to one group of people in need of housing that is not available to others. There is a situation where one person might be in employment, on good wages and is able to access housing support through the ARP and somebody else who might be on a lower income is not able to avail of it. Landlords tell me this is the absolute best in terms of their conditions because they have no obligations to the tenant and they can get a tax-free payment and top-up payments. For most of the period this scheme has been in place, the Government has refused to accept Sinn Féin's concerns or take on board any of our amendments. Now, the Minister is saying he recognises there are problems and he will bring forward some changes but will not specify exactly what they are or tell us when they will actually be brought in. It is time for real clarity and honesty. \n Deputy Jim O'Callaghan  I do not recall Sinn Féin objecting to the ARP when the previous Minister, Deputy O'Gorman, introduced it at the time temporary protection was granted. \n Deputy Matt Carthy  It was for hosts in their own homes at that stage. \n Deputy Jim O'Callaghan  It was a necessary measure for the purpose of providing accommodation to the large number of people from Ukraine who came here. The Deputy said the Minister of State, Deputy Brophy, and I have not done anything but we have. We reduced it from €800 to €600. I would have thought it is clearly the case we are gradually trying to introduce further measures in respect of it. We are bringing forward legislation to ensure it cannot be used in respect of rental properties so that the issues about which the Deputy and I are concerned will not apply. It is wrong to suggest it is having a completely distorting impact on the rental sector. It is predominantly used to accommodate people who have been granted temporary protection and individuals whom, if they are not accommodated pursuant to the ARP, the State will probably have to look at some other mechanism of accommodation. ",
        "questionType": "oral",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 91. Deputy Matt Carthy asked the Minister for Justice, Home Affairs and Migration when he will introduce changes to the accommodation recognition scheme in the light of its impact on the private rental market and the fact that landlords are using this scheme to avoid tenancy obligations; and if he will make a statement on the matter. [68324/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/dbsect_31",
          "debateSectionId": "dbsect_31",
          "showAs": "Housing Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/debate/mul@/dbsect_31.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_91",
        "questionNumber": 91
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  Getting more Gardaí on our streets to prevent and detect crime is my first priority as Minister.  The Programme for Government commits to examining a range of further measures to enable An Garda Síochána recruit 5,000 members across the next five years. This Government is committed to ensuring that An Garda Síochána has the resources it needs and Budget 2026 provides unprecedented funding of €2.59 billion to support recruitment and staffing.  The Garda Trainee allowance increased from €305 to €354 per week with effect from 1 October 2024 and has almost doubled – an increase of €170 per week.  Insofar as further increases to the allowance are concerned, these will be considered in the normal course and in the context of the overall Garda recruitment situation.  It is worth highlighting however, that for first time ever, there were two Garda recruitment competitions held this year. There was significant interest in both competitions, with over 11,100 people applying to join An Garda Síochána this year. This demonstrates that there is a strong and sustained interest in a career as a Garda amongst the public.  It is clear that recruitment into An Garda Síochána is now gathering real momentum. I was delighted to see 223 Gardaí enter Templemore earlier this month, the largest single intake in over a decade. This was the second intake of 200 or more this year. Overall, 794 trainees have entered the Garda College in 2025, the highest number since 2018. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 92. Deputy Matt Carthy asked the Minister for Justice, Home Affairs and Migration to outline his plans to increase the Garda training allowance; and if he will make a statement on the matter. [68326/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_115",
          "debateSectionId": "dbsect_115",
          "showAs": "An Garda Síochána",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_115.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_92",
        "questionNumber": 92
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  As the Deputy will be aware, the Historical Investigation Unit structure was a proposal contained in the Stormont House Agreement specific to Northern Ireland.  In this jurisdiction, the Garda National Bureau of Criminal Investigation, led by the Assistant Commissioner for Organised and Serious Crime, holds a national investigative remit and is specialised in the area of major crime investigation. It undertakes and supports investigations on the direction of the Garda Commissioner.  The Deputy will also be aware that the expertise of the Serious Crime Review Team (SCRT), established in 2007 to provide for independent review of historical investigations, including homicides, is available where appropriate. These reviews constitute an independent examination of evidence and other material, gathered during investigation and to ensure that it conforms to approved standards; that the investigation has been thorough, conducted with integrity and objectivity; and to identify further investigative opportunities. The remit of the SCRT is broad and would include reviews of Troubles-related cases, where appropriate.  I am assured that, in circumstances where historic offences have not been resolved, the investigations remain open and the Garda authorities will, and do, follow up fully, on any new evidence or information that becomes available to them, whether that comes from the public, from other police services or from their own investigations.  I can also assure the Deputy that the Government is determined to fulfil our shared responsibilities as co-guarantors of the Good Friday Agreement. The Programme for Government explicitly states our commitment to play our full part in legacy processes and to address the legacy of the conflict in this jurisdiction. As the Deputy will be aware, the Government at its meeting on 1 October formally approved the Joint Framework on the Legacy of the Troubles agreed with the British Government and announced on 19 September last. As part of this, the Government has committed to facilitating the cooperation of the relevant Irish authorities with the UK Legacy Commission, once established, to the fullest extent possible. The UK Government also commits to reciprocal cooperation by the UK authorities with investigations, inquests and inquiries on the same basis and in the same spirit.  As recognised in the Joint Framework investigations into Troubles-related incidents should be victim-centred. To further support this objective, the Garda Commissioner has committed to the establishment by the end of this year of a dedicated unit as a central point of contact for victims and families in relation to Troubles-related investigations undertaken by An Garda Síochána.  As I set out in my reply of 26 November 2025 to the Deputy, there is no intention that the unit will be an investigative unit. The investigation of Troubles-related cases will continue to be undertaken by the relevant Garda Division in which the incident occurred with the support of national units as required. This is the most appropriate and effective approach in this jurisdiction. An Garda Síochána has also committed, where possible, to endeavour to answer questions that a family may have in relation to the investigation of a Troubles-related incident and provide a report to the family. The provision of a family report may not prejudice an ongoing criminal investigation or prosecution. I am committed to keeping these arrangements under review. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 106. Deputy Matt Carthy asked the Minister for Justice, Home Affairs and Migration if he will establish a historical investigations unit to allow for independent police investigation into unresolved deaths and incidents of torture or ill treatment as proposed by the Irish Council for Civil Liberties and the Committee on the Administration of Justice; and if he will make a statement on the matter. [68323/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_130",
          "debateSectionId": "dbsect_130",
          "showAs": "Departmental Policies",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_130.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_106",
        "questionNumber": 106
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  The Criminal Injuries Compensation Scheme continues to play an important and significant role in providing practical support by way of monetary compensation to victims of violent crime. The Government is committed to reforming the Scheme, including by placing it on a statutory footing as provided for in the Programme for Government, and work is currently being advanced in relation to this.  In 2021, the then Government agreed to introduce a revised Scheme and a number of immediate reforms were introduced. This was acknowledged as a first step toward improving the operation of the Scheme. Following this, an inter-departmental working group was established, which is chaired by my Department, to examine matters pertaining to further reform of the Scheme including placing it on a statutory footing.  While this work is continuing, the Law Reform Commission (LRC) is examining the broader topic of victim compensation as part of its Fifth Programme of Law Reform. I understand that the LRC is expected to report shortly.  Reform of the Criminal Injuries Compensation Scheme will need to take into account a recent judgment in the Court of Justice of the European Union.  My Department is considering the implications of this judgment and I expect to bring forward amendments to the Scheme in due course. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 128. Deputy Matt Carthy asked the Minister for Justice, Home Affairs and Migration when legislation to place the Criminal Injuries Compensation Tribunal on a statutory footing will be introduced; and if he will make a statement on the matter. [68325/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_153",
          "debateSectionId": "dbsect_153",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_153.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_128",
        "questionNumber": 128
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I can confirm to the Deputy, that the school in question submitted an application in September 2025 for capital funding, under the Additional School Accommodation (ASA) scheme, for a Music room, Textiles room, Design and Computer Graphics room, Multimedia room and a Science lab and prep area.  My department had previously approved a traditional build project here for a Home Economics room, Engineering room and prep area and a Construction studies room. This project is currently at stage 2b. In addition, the school was approved 2 Modular Mainstream classrooms in 2023 and this accommodation has been delivered.  A further application for the ASA scheme was submitted in February 2025 for special class accommodation and a replacement mainstream classroom. The school had requested that this accommodation be added to their traditional build project. However, given the delays this would have entailed, the school agreed to allow its stage 2b project to proceed and to have its accommodation needs reviewed at a later stage. The school was advised as an interim measure that they could apply for funding to reconfigure current accommodation for a special class.  I can confirm that the school’s applications for additional accommodation are currently being considered and the school will be contacted directly once a decision has been made.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. In addition, repurposing and optimisation of existing accommodation capacity across the school estate has been a key enabler of timely, local provision of special class capacity in a way that supports best practice in inclusion and integration. Circa 80% of new special classes in 2025/26 are being facilitated in repurposed classroom accommodation.  Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs. It is planned that circa 80 school building projects will progress to construction across 2026 and 2027 as part of a 2-year rolling programme.  All Government departments are expected to publish their sectoral NDP Implementation Plans shortly. My department’s plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  I can confirm that the applications from the school in question will be considered in this context. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 287. Deputy Matt Carthy asked the Minister for Education and Youth further to Parliamentary Question No. 350 of 25 November 2025, the timeframe in which the application for additional accommodation by a school (details supplied) will be decided; if she will expedite this process considering the severe pressure on the school at present; and if she will make a statement on the matter. [68696/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_274",
          "debateSectionId": "dbsect_274",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_274.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_287",
        "questionNumber": 287
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  While bail laws in Ireland are comprehensive, I am committed to ensuring they are fit for purpose while ensuring fundamental rights principles are adhered to. Last May, I announced that I intended to appoint a Senior Counsel to undertake an assessment of the current operation of bail in Ireland, both legal and practical.  The commissioning of the report arose from concerns regarding bail processes and their applicability to recidivist offenders. These concerns were acknowledged in my apology to the family of the late Shane O’Farrell, who was tragically killed in August 2011, when struck by a car driven by a person who was on bail for a series of offences at the time.  Mr Lorcan Staines SC was subsequently appointed to undertake the review and was asked to include appropriate recommendations, considering the requirements of constitutional justice and the impossibility of refusing bail to every person accused of an offence, particularly a summary offence. His report ‘An Assessment of the Efficacy of Bail Laws in Ireland’ has been completed and was published by my Department last week. I would like to express my thanks to Lorcan Staines for his work in compiling this comprehensive report.  His recommendations include investment in improved information sharing systems for both An Garda Síochána and the Courts Service; the implementation of an adult bail supervision scheme to ensure the proper management of recidivist offenders; changes to bail legislation to significantly expand the conditions which may be attached to the granting of bail; and further legislative amendments to improve the legal framework surrounding bail, including consideration for the legal supports for the expected operational implementation of electronic monitoring in 2026. The electronic monitoring project is progressing and a request for tender for a pilot phase is expected to be issued later this week, and to be operational in Quarter 1 of 2026.  The report provides a detailed analysis that will greatly assist in considering how our criminal justice system might better respond to recidivist offenders who persistently break summary laws. Some of the recommendations relate to actions that are already in progress or under consideration within my Department and any further useful amendments that are identified will be introduced as appropriate. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 384. Deputy Matt Carthy asked the Minister for Justice, Home Affairs and Migration the timeframe for the implementation of proposals contained in the report entitled an Assessment of the Efficacy of Bail Laws in Ireland; and if he will make a statement on the matter. [68951/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_351",
          "debateSectionId": "dbsect_351",
          "showAs": "Legislative Reviews",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_351.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_384",
        "questionNumber": 384
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the HSE to respond to the deputy directly. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 454. Deputy Matt Carthy asked the Minister for Health further to Parliamentary Question Nos. 134 of 20 November 2025, and 943 of 25 November 2025, the current status of the review to assess the resources required to change the final check-in time at the minor injuries unit at Monaghan Hospital to 8pm; when this review will be completed; and if she will make a statement on the matter. [68697/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_402",
          "debateSectionId": "dbsect_402",
          "showAs": "Departmental Reviews",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_402.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_454",
        "questionNumber": 454
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, it has been referred to the Health Service Executive for attention and direct reply to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 242. Deputy Matt Carthy asked the Minister for Health if it can be ensured that a person (details supplied) is scheduled for treatment at the Brain Injury and Stroke Programme at the National Rehabilitation Hospital as a matter of urgency; and if she will make a statement on the matter. [68222/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_208",
          "debateSectionId": "dbsect_208",
          "showAs": "Hospital Appointments Status",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_208.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_242",
        "questionNumber": 242
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the planning, design and construction of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals. In this context, TII is best placed to advise you on the status of this project.  Noting the above position, I have referred your question to TII for a direct reply updating you as to the latest status of the N2 Ardee to Castleblayney Project. Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 144. Deputy Matt Carthy asked the Minister for Transport the funding allocation in 2026 for the N2 Ardee to Castleblayney road scheme; the estimated date for completion of this scheme; and if he will make a statement on the matter. [68061/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_130",
          "debateSectionId": "dbsect_130",
          "showAs": "Road Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_130.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_144",
        "questionNumber": 144
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the planning, design and construction of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals. In this context, TII is best placed to advise you on the status of this project.  I can confirm that €3,000,000 has been allocated for the N2 Clontibret to the Border scheme in 2025. As with all national roads projects in the NDP, the delivery programme for the project will be kept under review for 2026 and considered in terms of the overall funding envelope available to TII.  Noting the above position, I have referred your question to TII for a direct reply. Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 145. Deputy Matt Carthy asked the Minister for Transport the funding allocation in 2026 for the N2 Clontibret to the Border road scheme; the estimated date for completion of this scheme; and if he will make a statement on the matter. [68062/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_131",
          "debateSectionId": "dbsect_131",
          "showAs": "Road Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_131.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_145",
        "questionNumber": 145
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for children with special educational needs.  In order to support the NCSE and forward planning my department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE that they are seeking a special educational placement for their child. An earlier date of 1 October was set for parents to do so.  This notification process will provide the NCSE with valuable information as to which children will continue to require a special class as they progress to post-primary level and details on students who require a place for the first time.  The earlier date will allow for earlier sanctioning of classes for the 2026/27 school year, and it is the aim of the NCSE to sanction the majority of new special classes by 31 December 2025.  The NCSE will have a clear picture of the local demand for special class places for the 2026/2027 school year after they review and assess all of the information which has been provided through the parents' notification process which closed on 1 October.  Once the NCSE has fully collated and assessed this information, the NCSE will be in a position to engage with schools across the country to open new special classes. The NCSE will also have due regard to any vacant places in existing special classes in an area and any places that will become available through the normal movement of children leaving primary or post-primary school.  With any date for applications for supports, it is important that those who come forward after that date are assured that they are not forgotten or excluded from the system. I would like to stress that the NCSE will continue to support all children and young people made known to them after 1 October in their existing placement with appropriate supports, however, it is important for planning purposes that an earlier timeframe is worked to in which the NCSE has as much local knowledge and detail as possible in order to plan what new provision is required.  My department and the NCSE are committed to ensuring that sufficient special education placements remain available for children with special educational needs and will continue to review and monitor the situation as to where new specialist provision is required. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 281. Deputy Matt Carthy asked the Minister for Education and Youth if she will ensure that the second classroom at the ASD unit at a school (details supplied) will be opened in early 2026; and if she will make a statement on the matter. [67986/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_257",
          "debateSectionId": "dbsect_257",
          "showAs": "School Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_257.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_281",
        "questionNumber": 281
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  This PQ has been deferred, a response will issue in 10 working days. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 522. Deputy Matt Carthy asked the Minister for Health the services and organisations that will be supported by a project (details supplied); the amount each service or organisation will receive; and if she will make a statement on the matter. [67335/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Matt-Carthy.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Matt-Carthy.D.2020-02-08",
          "showAs": "Matt Carthy"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_465",
          "debateSectionId": "dbsect_465",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_465.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_522",
        "questionNumber": 522
      },
      "contextDate": "2025-12-02"
    }
  ]
}