{
  "head": {
    "counts": {
      "questionCount": 105,
      "resultCount": 105
    }
  },
  "results": [
    {
      "contextDate": "2020-06-23",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/mul@/dbsect_752.xml"
            }
          },
          "debateSectionId": "dbsect_752",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-23/writtens/dbsect_752",
          "showAs": "Jobseeker's Benefit"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-23/pq_833",
        "to": {
          "roleType": null,
          "showAs": "Employment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 833,
        "showAs": " 833. Deputy Norma Foley asked the Minister for Employment Affairs and Social Protection if seasonal workers who have been unable to take up employment due to the Covid-19 pandemic will be able to stay on jobseeker's benefit even in instances in which they no longer have a sufficient number of stamps; and if she will make a statement on the matter. [12048/20] ",
        "answerText": " Minister for Employment Affairs and Social Protection (Regina Doherty)  Jobseeker's benefit is a weekly payment to people who have lost their employment and who satisfy the scheme's statutory conditions including the requirement to have sufficient social insurance contributions paid. This benefit is paid for 9 months (234 days) for people with 260 or more PRSI contributions paid and for 6 months (156 days) for people who have less than 260 paid.  Where a person has exhausted their claim for jobseeker’s benefit they may apply for support under the means tested jobseeker’s allowance.  I trust that this clarifies the matter. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-23",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_136.xml"
            }
          },
          "debateSectionId": "dbsect_136",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_136",
          "showAs": "Flood Prevention Measures"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_157",
        "to": {
          "roleType": null,
          "showAs": "Public",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 157,
        "showAs": " 157. Deputy Norma Foley asked the Minister for Public Expenditure and Reform if emergency funding will be provided for works at Carrahane, Ardfert, County Kerry. [11624/20] ",
        "answerText": " Minister of State at the Department of Public Expenditure and Reform  I propose to take Questions Nos. 157 and 158 together.  Local flooding issues are a matter, in the first instance, for each local authority to investigate and address. I understand the works at Ardfert as described in the Deputy’s question relate to repairs to a private embankment. The Office of Public Works has no responsibility for this embankment and as such any repairs would fall within the remit of the local authority.  I am further advised that the Department of Housing, Planning and Local Government has overall responsibility for Government policy on coastal strategy.  Local Authorities lead on identifying works to protect the coast in their respective areas and are responsible for the repair and maintenance of any existing seawalls within their administrative area.  Local authorities may carry out flood mitigation and coastal protection works using its own resources or apply under the OPW’s Minor Flood Mitigation Works and Coastal Protection Scheme, which makes funds available to local authorities to undertake minor works or studies to address localised coastal protection or flooding problems within their administrative areas.  The eligibility criteria of this scheme, including a requirement that any measures are cost beneficial, are published on the OPW website www.gov.ie/opw  Minor Works funding has previously been approved for work near the location in question at Kerries, and it remains open to the Council to submit a further funding application for flood mitigation works under the Scheme for the location referred to in this question.  Any application received will be considered in accordance with the scheme's eligibility criteria and the overall availability of resources for flood risk management. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_136.xml"
            }
          },
          "debateSectionId": "dbsect_136",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_136",
          "showAs": "Flood Prevention Measures"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_158",
        "to": {
          "roleType": null,
          "showAs": "Public",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 158,
        "showAs": " 158. Deputy Norma Foley asked the Minister for Public Expenditure and Reform if emergency funding will be provided for works to repair a breach of the sea wall at the Kerries, Tralee, County Kerry. [11625/20] ",
        "answerText": " Minister of State at the Department of Public Expenditure and Reform  I propose to take Questions Nos. 157 and 158 together.  Local flooding issues are a matter, in the first instance, for each local authority to investigate and address. I understand the works at Ardfert as described in the Deputy’s question relate to repairs to a private embankment. The Office of Public Works has no responsibility for this embankment and as such any repairs would fall within the remit of the local authority.  I am further advised that the Department of Housing, Planning and Local Government has overall responsibility for Government policy on coastal strategy.  Local Authorities lead on identifying works to protect the coast in their respective areas and are responsible for the repair and maintenance of any existing seawalls within their administrative area.  Local authorities may carry out flood mitigation and coastal protection works using its own resources or apply under the OPW’s Minor Flood Mitigation Works and Coastal Protection Scheme, which makes funds available to local authorities to undertake minor works or studies to address localised coastal protection or flooding problems within their administrative areas.  The eligibility criteria of this scheme, including a requirement that any measures are cost beneficial, are published on the OPW website www.gov.ie/opw  Minor Works funding has previously been approved for work near the location in question at Kerries, and it remains open to the Council to submit a further funding application for flood mitigation works under the Scheme for the location referred to in this question.  Any application received will be considered in accordance with the scheme's eligibility criteria and the overall availability of resources for flood risk management. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_255.xml"
            }
          },
          "debateSectionId": "dbsect_255",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_255",
          "showAs": "Covid-19 Pandemic Supports"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_281",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 281,
        "showAs": " 281. Deputy Norma Foley asked the Minister for Education and Skills if supports will be made available for students in view of the fact students are not eligible for jobseeker’s allowance and there are no summer employment prospects to help defray costs for education and so on due to the Covid-19 crisis. [11387/20] ",
        "answerText": " Minister for Education and Skills  I am conscious of the difficulties being experienced by students and their families as a result of the COVID-19 pandemic. The key supports available to students are Student Grant Scheme and related supports, such as the Student Assistance Fund and the Fund for Students with Disabilities. These supports have a fundamental role to play in assisting students in further and higher education.  The 2020/21 SUSI Grant Scheme opened for applications in April and the priority closing date is 9 July. Further information in relation to student grant assistance is available from SUSI’s website ( www.susi.ie ). The telephone number for SUSI’s Helpdesk is 0761 087 874.  My officials are in contact with their counterparts in the Department of Employment Affairs and Social Protection. They have advised me that full-time students who had part-time employment when the COVID-19 Pandemic Unemployment Payment was introduced in March can avail of this support payment.  The Student Assistance Fund (SAF) provides financial assistance to students experiencing financial difficulties while attending third level. Students can be assisted towards the rent, childcare costs, transport costs and books/class materials. Higher Education Institutions have been given the autonomy to maximise the flexibility in the Student Assistance Fund to enable them to support students during the COVID-19 situation. Details of this fund are available from the Access Office in the third level institution attended. This fund is administered on a confidential, discretionary basis. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_256.xml"
            }
          },
          "debateSectionId": "dbsect_256",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_256",
          "showAs": "Teacher Training"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_282",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 282,
        "showAs": " 282. Deputy Norma Foley asked the Minister for Education and Skills if student teachers will be accommodated on teaching practice in schools for the 2020 to 2021 school year. [11390/20] ",
        "answerText": " Minister for Education and Skills  School Placement is a critical part of initial teacher education (ITE) as it enables the student teacher to experience teaching and learning in a variety of contexts, and to participate in school life in a way that is structured and supported.  Initial teacher education programme providers are currently preparing their school placement schedules and calendars for the next academic year in line with the Teaching Council’s guidelines in relation to school placement.  Officials from my Department and the Teaching Council have been in close communication and will facilitate consultation with all relevant stakeholders over the coming period to consider school placement arrangements in the context of any Covid-19 restrictions and guidelines for re-opening schools in the coming school year.  Safeguarding the continuance of quality learning experiences for student teachers engaged in programmes of initial teacher education is of paramount concern. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_411.xml"
            }
          },
          "debateSectionId": "dbsect_411",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_411",
          "showAs": "Covid-19 Pandemic Supports"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_457",
        "to": {
          "roleType": null,
          "showAs": "Business",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 457,
        "showAs": " 457. Deputy Norma Foley asked the Minister for Business, Enterprise and Innovation if she will amend the restart grant to include a cohort of businesses and groups that are currently excluded, for example, bed and breakfasts, small bus operators and community centres; and if not, if she will consider introducing a new grant to meet the restart needs of those excluded. [11507/20] ",
        "answerText": " Minister for Business, Enterprise and Innovation  The Restart Grant support is just one part of the wider €12bn package of supports for commercial firms of all sizes, which includes the wage subsidy scheme, grants, low-cost loans, write-off of commercial rates and deferred tax liabilities, all of which will help those businesses to continue trading and to maintain employment.  To avail of the Restart Grant, applicants must be a commercial business and be in the Local Authorities’ Commercial Rates Payment System, and:  - have a turnover of less than €5m and have 50 or less employees.  - have suffered a projected 25%+ loss in revenue from 1 April 2020 to 30th June 2020.  - commit to remain open or to reopen if it was closed.  - declare the intention to retain employees that are benefitting from the Temporary Wage Subsidy Scheme (TWSS).  The primary objective, therefore, is to get funding into small businesses that:  - Are reliant solely on local trading income;  - Are financially independent from any group structure;  - Have suffered significant financial losses;  - Have had to bear ongoing fixed costs or faced costs associated with re-opening the business;  - Provide local paid employment.  In that context, sporting and community organisations are not eligible because they are not primarily commercial organisations and have sources of income other than commercial sales for example, membership fees.  On Friday 8th May, my colleagues Michael Ring TD, Minister for Rural and Community Development and Seán Canney TD, Minister of State with responsibility for Community Development, announced the launch of a €40 million package of supports for Community and Voluntary Organisations, Charities and Social Enterprises. The package includes a €35 million ‘COVID-19 Stability Fund’ which will provide a level of support to qualifying organisations who are most in need and have seen their trading and/or fundraising income drop significantly during the crisis.  Regarding any further targeted supports specifically aimed at the tourism sector, my colleague the Minister for Transport, Tourism and Sport has formed a dedicated Tourism Recovery Taskforce, made up of leaders from varying sections of the industry, who will work together to deal with the many challenges ahead in a dynamic and innovative manner. It has been tasked with identifying measures required to enable Irish tourism to recover from the devastating effects of Covid-19.  For a full list of supports for business please see https://dbei.gov.ie/en/What-We-Do/Supports-for-SMEs/COVID-19-supports/ . ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_611.xml"
            }
          },
          "debateSectionId": "dbsect_611",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_611",
          "showAs": "Covid-19 Tests"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_677",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 677,
        "showAs": " 677. Deputy Norma Foley asked the Minister for Health if persons can apply to have an antibody test to confirm definitively if they have had Covid-19. [11389/20] ",
        "answerText": " Minister for Health  The ECDC has advised that immunoassays detecting specific antibodies against SARS-CoV-2 (COVID-19) will play an important role in the future for epidemiological surveillance, evaluation of immunity and the outcome of future vaccination studies. However, the reliability of serological tests remains a major issue as does the interpretation of what immunity means and how long it might last. These remain active research questions.  The ECDC have reported that over 60 rapid SARS-CoV-2 antibody tests have been CE marked to date, and many more continue to be placed on the market. Prior to the introduction of new serological assays [antibody tests] clinical validation studies are required to confirm that test performance can be replicated in the context in which the test is intended to be used.  Following a request from the National Public Health Emergency Team (NPHET) the HSE and Health Protection Surveillance Centre (HPSC) are proceeding with plans to undertake a national population sero-prevalence study. This work is being carried out jointly by HPSC and NVRL, in collaboration with the Central Statistics Office and Department of Health.  This first use of antibody testing, as has occurred in other countries, will be to estimate the prevalence of immunity in the general population by conducting a population based sero-prevalence survey to measure the prevalence of antibodies to SARS-CoV-2 virus in a representative  sample of the Irish population in two geographically defined areas. Ethics approval for the study was granted by the National Research Ethics Committee for COVID-19 on 4 June. All persons aged 12-69 years living in Ireland can be randomly selected to participate. Those randomly selected, who consent to participate, will complete a questionnaire and have a blood sample taken.  Samples will be analysed at the National Virus Reference Laboratory (NVRL) for the detection of antibodies to the virus. For those who do not speak English, arrangements will be in place to enable them to participate via translated material and interpreters. Those who need assistance to support decision making will be provided with these supports, on request. The study will commence on 15 June, with results being available toward the end of August. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_631.xml"
            }
          },
          "debateSectionId": "dbsect_631",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_631",
          "showAs": "Hospital Appointments Status"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_707",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 707,
        "showAs": " 707. Deputy Norma Foley asked the Minister for Health the status of an orthopaedic hospital appointment for a person (details supplied) at Croom Hospital. [11509/20] ",
        "answerText": " Minister for Health  Under the Health Act 2004, the Health Service Executive (HSE) is required to manage and deliver, or arrange to be delivered on its behalf, health and personal social services. Section 6 of the HSE Governance Act 2013 bars the Minister for Health from directing the HSE to provide a treatment or a personal service to any individual or to confer eligibility on any individual.  The National Waiting List Management Policy, a standardised approach to managing scheduled care treatment for in-patient, day case and planned procedures, since January 2014, has been developed to ensure that all administrative, managerial and clinical staff follow an agreed national minimum standard for the management and administration of waiting lists for scheduled care. This policy, which has been adopted by the HSE, sets out the processes that hospitals are to implement to manage waiting lists.  In response to the Covid-19 pandemic the HSE had to take measures to defer all non-urgent elective scheduled care activity, including outpatient clinics. This was to ensure patient safety and that all appropriate resources were made available for Covid-19 related activity and time-critical essential work. This decision was in line with the advice issued by the World Health Organisation, and the National Action Plan published on 16 March. The trajectory of the disease means there is now an opportunity for increasing the provision of non-covid care including more routine care.  My Department, the HSE and the National Treatment Purchase Fund are currently working together to estimate the impact of Covid 19 on Scheduled Care waiting lists, in order to be prepared to address any backlog or pent up demand. My Department continues to ensure that the resources available throughout our health system are best utilised at this unique and challenging time.  In relation to the particular query raised, as this is a service matter, I have asked the HSE to respond to the Deputy directly. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_428.xml"
            }
          },
          "debateSectionId": "dbsect_428",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_428",
          "showAs": "Dental Services "
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_725",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 725,
        "showAs": " 725. Deputy Norma Foley asked the Minister for Health if the issue of PPE provision for dentists in the medical card system will be raised with the HSE in view of the fact PPE was promised some weeks ago and has not been provided [11623/20] ",
        "answerText": " Minister for Health  I propose to take Questions Nos. 473 and 725 together.  The Government has put in place a suite of measures to support small, medium and larger businesses that are negatively impacted by COVID-19 including a Restart grant for which application can be made on line to local authorities. The Department of Business, Enterprise and Innovation has published a Return to Work Safely Protocol, which is designed to support employers and workers to put measures in place that will prevent the spread of COVID-19 in the workplace. The Health and Safety Authority also provides information and advice for employers and employees in this regard.  The HPSC supports the use of the normal Personal Protective Equipment (PPE) used in routine dentistry. The Dental Council has indicated that dentists should take a case by case assessment when deciding if additional PPE is warranted.  My Department is working with the HSE on the issue of PPE over and above that which is used in routine dentistry. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_713.xml"
            }
          },
          "debateSectionId": "dbsect_713",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_713",
          "showAs": "Road Network"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_809",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 809,
        "showAs": " 809. Deputy Norma Foley asked the Minister for Transport, Tourism and Sport if funds will be made available for emergency works on the Cliff Road, Ballyheigue, County Kerry, which is in a hazardous state at present. [11388/20] ",
        "answerText": " Minister for Transport, Tourism and Sport  The improvement and maintenance of regional and local roads (RLR) is the statutory responsibility of the relevant local authority in accordance with the provisions of Section 13 of the Roads Act 1993. Works on those roads are funded from Councils' own resources supplemented by State road grants. The initial selection and prioritisation of works to be funded is also a matter for the Council.  The 2020 regional and local road allocations were announced earlier this year  and all grant funding available to the Department has now been allocated. Details of the regional and local road grant allocations and payments to local authorities are outlined in the regional and local road grant booklets which are available in the Oireachtas Library.  Local authorities may carry out repairs from the RLR grants available to them and from their own resources and in this context, it is open to each Council to determine and reprioritise its work programme in order to address emergency works. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_854.xml"
            }
          },
          "debateSectionId": "dbsect_854",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_854",
          "showAs": "Covid-19 Pandemic Unemployment Payment"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_1015",
        "to": {
          "roleType": null,
          "showAs": "Employment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1015,
        "showAs": " 1015. Deputy Norma Foley asked the Minister for Employment Affairs and Social Protection her plans to pay arrears of the pandemic unemployment payment; and the time frame for same. [11386/20] ",
        "answerText": " Minister for Employment Affairs and Social Protection  I propose to take Questions Nos. 970, 1015 and 1036 together.  The emergency Covid-19 Pandemic Unemployment Payment has been introduced as a time-limited emergency measure so that payments can be made as quickly as possible to the large number of people who have become fully unemployed due to the pandemic.  During the month of March, my Department received and processed jobseeker claims equivalent in number to a three year claim-load. These applications were processed as quickly as possible, with almost 59,000 people paid in the first week of the scheme, 283,000 people paid in the following week, and over 507,000 people in the third week of the scheme. To date, almost 6.5 million payments have issued to just over 670,000 individuals at a cost of over €2.25 Billion.  Currently, the Department is focused on processing and managing payments to ensure that they continue to be made to all who qualify for them. The work involved in doing this is complex, with people joining and leaving the scheme each week, along with management of overlaps between the Covid-19 Pandemic Unemployment Payment and the Revenue Temporary Wage Subsidy Scheme.  The Department is aware that many people are due some arrears and that each person’s case is unique. This means that each person’s application may need to be individually reviewed. Accordingly, I am advised that the figures requested by the Deputy are not available at this time.  It will take time to review all of the applications and assess for back payments. I can assure the Deputies that all cases will be examined and where arrears arise they will be processed and claimants will be notified.  I trust this clarifies the matter for the Deputies. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-16",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/mul@/dbsect_876.xml"
            }
          },
          "debateSectionId": "dbsect_876",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-16/writtens/dbsect_876",
          "showAs": "Covid-19 Pandemic"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-16/pq_1023",
        "to": {
          "roleType": null,
          "showAs": "Employment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1023,
        "showAs": " 1023. Deputy Norma Foley asked the Minister for Employment Affairs and Social Protection if she will address the urgent case of seasonal workers whose stamps are running out and are not being catered for by the pandemic unemployment payment; and if she will address the issue of stamps running out for this cohort of workers due to the pandemic and include them in the payment. [11508/20] ",
        "answerText": " Minister for Employment Affairs and Social Protection  I propose to take Questions Nos. 1002, 1004, 1011 and 1023 together.  The COVID 19 pandemic unemployment payment was introduced as a time limited emergency measure in response to the pandemic that will now be payable until 10 August 2020, further to the recent Government announcement.  The conditions for receipt of this payment are that a person must be of working age between 18 and up to 66 years old, have been in employment immediately before 13 March 2020 and have lost their employment due to the pandemic and are not being paid by their employer.  If a person was in not in employment immediately prior to 13 March 2020 but was due to take up summer employment they are not eligible to receive the pandemic unemployment payment.  It would be impossible to construct a scheme based on claims of potential or prospective but unrealised employment, particularly where the economy was operating at full-employment with many unfilled vacancies prior to the onset of the COVID 19 pandemic.  Jobseekers benefit is payable for 9 months for people with 260 or more PRSI contributions paid or 6 months if they have less than 260 contributions paid.  Where a person exhausts their claim for jobseekers benefit or they have insufficient contributions paid they may apply for support under the means tested jobseeker's allowance.  In respect of students, the Student Universal Support Ireland (SUSI) Grant, payable by the Department of Education and Skills, represents the primary support for persons pursuing third level education.  The matter of supports for students for the forthcoming academic year should be referred to the Minister for Education and Skills.  Any person who is experiencing financial hardship may be eligible for other financial supports under the means tested supplementary welfare allowance scheme.  I trust that this clarifies the matter. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-16",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_22.xml"
            }
          },
          "debateSectionId": "dbsect_22",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_22",
          "showAs": "Passport Applications"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_31",
        "to": {
          "roleType": null,
          "showAs": "Foreign",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 31,
        "showAs": " 31. Deputy Norma Foley asked the Tánaiste and Minister for Foreign Affairs and Trade his plans for the reopening of passport offices; and the status of passport applications that were finalised as per tracking advice and awaiting dispatch. [10280/20] ",
        "answerText": " Tánaiste and Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 19, 23, 26, 31 and 38 together.  Once the potential impact of Covid-19 became obvious, contingency planning commenced to minimise the impact of restrictions on the delivery of passport services. In particular, plans were put in place to ensure that we continued to provide an emergency service for the issuance of passports in cases of serious illness or death abroad. The Passport Service also assisted those whose applications were regarded as urgent. While staff were on site during the pandemic, carrying out this necessary work, they also produced approximately 6,000 additional passports. The additional passports were adult passport renewal applications received online which required minimum staff intervention.  Personnel from the Passport Office were also redeployed into other essential public service roles, such as Covid-19 contact tracing for the HSE and working with the Department of Employment Affairs and Social Protection to facilitate the processing of Covid-related benefits.  The Passport Office has now started a phased return to full operation. This planning is in line with the wider Government plan to reopen in phases. The Passport Service resumed processing of non-essential online applications this week (in Phase 2 of the Government roadmap). The Passport Service has a great deal of experience in dealing with peaks in demand, and we believe that we are well-placed to ensure the online service will be meeting its usual turnaround times of approximately two weeks by phase 3 in July.  The Passport Online service has won awards for its user-friendly process, including a NALA award for the use of plain English. If an applicant is not familiar with using a computer, a friend or relative with basic computer skills can help them to apply online – the process only takes ten minutes to complete. Passport Online can also facilitate social distancing, given that a renewal application for an adult does not require the signature of a witness.  Passport Online expanded in 2019 to include first time applicants, both children and adults, in Ireland, Northern Ireland, Great Britain and Europe. Irish citizens, including children, can also renew their passports online 24/7, from anywhere in the world. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_163.xml"
            }
          },
          "debateSectionId": "dbsect_163",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_163",
          "showAs": "State Examinations"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_183",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 183,
        "showAs": " 183. Deputy Norma Foley asked the Minister for Education and Skills if he will accommodate students that wish to take a written leaving certificate exam by allowing them to do so in August 2020 (details supplied); and if he will make a statement on the matter. [10282/20] ",
        "answerText": " Minister for Education and Skills  The timeframe for sitting the postponed Leaving Certificate 2020 examinations cannot be determined at this time pending public health advice that would identify a safe period of time to do so and the number of candidates in each subject has been identified. It is not expected that students who seek to rely on the results of the postponed examinations will be able to commence a third level place in the 2020/2021 academic year. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_164.xml"
            }
          },
          "debateSectionId": "dbsect_164",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_164",
          "showAs": "Education Policy"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_184",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 184,
        "showAs": " 184. Deputy Norma Foley asked the Minister for Education and Skills his plans to provide schools and students with the necessary software to accommodate blended learning in schools in September 2020; and if he will make a statement on the matter. [10283/20] ",
        "answerText": " Minister for Education and Skills  As part of the implementation of the Digital Strategy for Schools 2015-2020 Enhancing Teaching Learning and Assessment, funding of €210m for ICT Infrastructure will be distributed to schools over the five years of the Strategy. €110m has issued over the lifetime of the strategy to date with €40m recently issuing in the form of a grant payment to all eligible schools and a further €10m top-up funding issued to all schools to enable schools to further support any of their students experiencing difficulty in engaging with remote learning.  In the context of the current public health crisis the funding can be focussed on assisting schools to address ICT needs including devices, software and other ICT solutions to support the provision of remote learning. This can include the purchase of ICT devices that can be shared with students who do not have access to devices, essential learning platforms and other ICT infrastructure to support the provision of remote learning.  Since the announcement that schools would close and the extension of that closure, my Department has provided guidance to schools and teachers in the education sector to ensure that they continue to work and to engage with their students to continue the delivery of education. A series of guidance notes to support schools to effectively support and engage with their students are published on my Department's website at: https://www.education.ie/en/covid-19/#guidance. Further guidance will continue to be compiled to address the various challenges that arise for schools in providing programmes of continued learning in the remote learning environment and to accommodate blended learnign solutions if requried. Various surveys and studies has conducted across the education system has informed the development of guidance.  Resources to support the transition to distant learning are being provided by the Department support service, the Professional Development Service for Teachers (PDST), at https://www.pdst.ie/DistanceLearning. Scoilnet the Department’s educational portal has open access to a wide variety of resources and information developed by various services including: the PDST, Junior Cycle for Teachers (JCT), the National Educational Psychological Service (NEPS), the National Council for Special Education. These resources can all be accessed at https://www.scoilnet.ie/support/. Scoilnet also provides open access to extensive educational resources including Worldbook Online, at www.scoilnet.ie  Schools have been asked to be conscious of students who may not have access to online facilities or where digital solutions may not be appropriate and to consider this actively in their approaches to delivering remote learning. As part of reopening of society roadmap and the lifting of current restrictions, school and college buildings are now opened for access by teachers for the organisation and distribution of remote learning in line with public health advice and restrictions and essential work that cannot be done remotely with continued observance of public health guidelines. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_165.xml"
            }
          },
          "debateSectionId": "dbsect_165",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_165",
          "showAs": "Teacher Training Provision"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_185",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 185,
        "showAs": " 185. Deputy Norma Foley asked the Minister for Education and Skills his plans to provide training for teachers that may have to implement a blended teaching approach in September 2020; and if he will make a statement on the matter. [10284/20] ",
        "answerText": " Minister for Education and Skills  Since the closure of schools on 12 March, my Department has provided a range of guidelines for schools and teachers in relation to the continuity of learning. In addtion, the Teacher Education Support Services funded by my Department have provided a range of Continuing Professional Development (CPD) supports to schools and teachers, particularly in the area of supporting digital teaching and learning.  As the Deputy will be aware, my Department continues to work on developing guidelines for schools, schools leaders and teachers on the re-opening of schools after the summer. My Department will be guided by the public health advice on re-opening of schools. My Department has also undertook extensive consultation with the education partners in relation to the issues facing schools and teachers in terms of re-opening schools.  I am confident that guidelines for schools on re-opening after the summer will be available shortly and if required any information in relation to blended teaching and associated supports will also be provided at that time. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_166.xml"
            }
          },
          "debateSectionId": "dbsect_166",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_166",
          "showAs": "Mental Health Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_186",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 186,
        "showAs": " 186. Deputy Norma Foley asked the Minister for Education and Skills the specific mental health and well-being resources available to students at this time; the resources available to leaving certificate students that are coping with a particularly stressful and unprecedented experience of education; and if he will make a statement on the matter. [10285/20] ",
        "answerText": " Minister for Education and Skills  I am acutely aware of the challenges faced by students, teachers and families at this difficult time. The welfare of students and that of their families is front and centre in all decision making. My Department has worked closely with the Department of Health and the HSE on the In This Together campaign which aims to help everyone in Ireland to Stay Connected, Stay Active, and look after their Mental Wellbeing throughout the Covid-19 Emergency. The In This Together campaign draws together the huge range of advice and support that is available for people of all ages. To support the wellbeing and mental health of our Leaving Certificate students at this time, a dedicated page on the InThis Together site contains online advice for Leaving Certificate students. This webpage includes a series of supports on managing wellbeing, stress and anxiety, developed by NEPS. The webpage also includes links to more individualised support for students to access, should these be needed. It is recognised that some vulnerable groups of students may require a more focused, stepped-up level of intervention and the Department has worked with the Department of Health and HSE to ensure the most appropriate services and resources are clearly signposted for those students. A planning group has been established by my colleague, the Minister for Health and includes representatives from the Department of Health, the HSE, and the NGO sector, in recognition of the fact that prior to, during and following national emergencies there is a need to support certain members of the population with their emotional, cognitive, social and physical needs.  The stepped care approach recognises that at present, there already exists services that offer online text and telephone supports to people seeking mental health information and advice. These include the Samaritans; Pieta House; MyMind; Turn2Me; Aware; Crisis Text Ireland; Shine; BeLongTo; LGBT Ireland; Jigsaw; Bodywhys and Childline. The YourMentalHealth.ie website provides a ‘one-stop-shop’ portal for people seeking information, supports and services, including information on accessing urgent help and a mental health text messaging support service is available 24 hours a day, 7 days each week to connect people with trained volunteers. These services augment the work of NEPS and assist students who may be feeling anxious at this time. In addition, additional support services have been identified for the general population that can assist students and their families at this time.  During this challenging time the school building may be closed but schools have structures in place to support students. It has often been the case, that the first port of call for Leaving Certificate students who are experiencing distress has been their school. Schools have developed excellent and flexible systems of support. Many schools have a designated Student Support Team, while other schools have equivalent systems and structures, but may use different terminology to describe their arrangements, such as ‘Care Team’ or ‘Pastoral Care Team’. Either way, the structures schools have in place will continue to have a key role identifying issues and students for discussion by the Student Support Team with appropriate action/ follow-up. In these uncertain times, the familiarity of these school structures and personnel will offer continuity and reassurance to students. A guidance document for Post-Primary Schools on supporting the wellbeing of students and the role of Student Support Teams was written by NEPS and has been published by my Department.  NEPS psychologists continue to be available to provide advice and support to school principals, teachers, students, parents. NEPS provides consultation for school staff who may have concerns about individual students. NEPS supports schools in putting interventions in place for students with identified difficulties, and in signposting to more specialist support, when needed, including onward referral to the HSE and other local mental health services.  NEPS is proactively exploring a number of innovative ways to continue to provide educational psychological services to school communities at this time.  My Department is developing a plan for supporting the wellbeing of school communities as part of the plan for reopening schools. A key element of supporting wellbeing at this time is the need for schools to manage and support transitions, including those transitions that have been impacted by school closures. Neps is developing guidance on transitions for all students including students with special and additional needs. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_167.xml"
            }
          },
          "debateSectionId": "dbsect_167",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_167",
          "showAs": "Covid-19 Pandemic Supports"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_187",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 187,
        "showAs": " 187. Deputy Norma Foley asked the Minister for Education and Skills the financial resources that will be made available to schools for the 2020/2021 academic year to facilitate the meeting of Covid-19 stay safe measures; and if he will make a statement on the matter. [10286/20] ",
        "answerText": " Minister for Education and Skills  On the 1st May 2020, the Taoiseach announced as part of the “Roadmap for Reopening Society and Business” that schools will commence opening on a phased basis at the beginning of the 2020/2021 academic year.  The Department is currently working with the Education Partners and relevant stakeholders in planning for this re-opening which will be based on public health advice. A core objective will be to ensure that schools and other education settings can re-open and operate in a safe manner that is consistent with public health advice. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_168.xml"
            }
          },
          "debateSectionId": "dbsect_168",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_168",
          "showAs": "Covid-19 Pandemic"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_188",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 188,
        "showAs": " 188. Deputy Norma Foley asked the Minister for Education and Skills his plans to make training available to staff, management and school communities on best practice implementation of Covid-19 stay safe measures in advance of the 2020/2021 school year; and if he will make a statement on the matter. [10287/20] ",
        "answerText": " Minister for Education and Skills  To assist with the development of contingency plans for the re-opening and operation of schools in an environment that may require social distancing and other public health requirements, my Department is engaging with education partners and relevant stakeholders. This work will be based on the National Return to Work Safely Protocol that was published by Government and will also be informed by guidance and experience from other jurisdictions.  As part of this engagement, each of the education partners were given the opportunity to outline the key issues that they would like to have considered in the context of re-opening schools. The issues raised by the education partners include those referred to by the Deputy in his question.  A core objective of the contingency plans will be to ensure that schools and other education settings can reopen and operate in a safe manner that is consistent with public health advice. Following consultation, currently underway with the education partners, guidance will issue to schools as soon as possible on the logistical and curricular arrangements to be put in place to facilitate the phased re-opening of schools. This guidance will provide a framework for individual schools to develop plans for the re-opening of school in accordance with their own circumstances, the context and needs of their staff and students and in compliance with public health guidelines.  ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_169.xml"
            }
          },
          "debateSectionId": "dbsect_169",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_169",
          "showAs": "Covid-19 Pandemic Supports"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_189",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 189,
        "showAs": " 189. Deputy Norma Foley asked the Minister for Education and Skills if extra resources will be made available to schools to ensure students will not have to share resources, for example, library books and so on. [10288/20] ",
        "answerText": " Minister for Education and Skills  On the 1st May 2020, the Taoiseach announced as part of the “Roadmap for Reopening Society and Business” that schools will commence opening on a phased basis at the beginning of the 2020/2021 academic year.  The Department is currently working with the Education Partners and relevant stakeholders in planning for this re-opening which will be based on public health advice. A core objective will be to ensure that schools and other education settings can re-open and operate in a safe manner that is consistent with public health advice. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_170.xml"
            }
          },
          "debateSectionId": "dbsect_170",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_170",
          "showAs": "Special Educational Needs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_190",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 190,
        "showAs": " 190. Deputy Norma Foley asked the Minister for Education and Skills his plans for the implementation of traditional summer programmes for children with additional needs; and if he will make a statement on the matter. [10289/20] ",
        "answerText": " Minister for Education and Skills  My Department is planning to provide a summer education programme for children with significant special educational needs as soon as it is safe to do so and in accordance with public health advice.  It is intended that this programme will be similar to the July Provision of previous years.  The Summer Education Programme will take place for children with significant special educational needs enrolled in special schools, special classes and mainstream classes.  The programme will be reliant on schools, teachers and Special Needs Assistants (SNAs) choosing to participate on a voluntary basis.  Planning is under way and an announcement will be made shortly. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_171.xml"
            }
          },
          "debateSectionId": "dbsect_171",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_171",
          "showAs": "Education Policy"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_191",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 191,
        "showAs": " 191. Deputy Norma Foley asked the Minister for Education and Skills if arrangements for the leaving certificate in 2021 are being explored in view of the loss of class time in 2020 and a likely similar scenario in 2021; his plans to amend courses or make an allowance for same (details supplied); and if he will make a statement on the matter. [10290/20] ",
        "answerText": " Minister for Education and Skills  Following the school closure in March 2020, my Department published a range of guidance to assist schools and teachers in ensuring continuity of teaching and learning for students as well as supporting their wellbeing during the COVID-19 pandemic.  This guidance aimed, inter alia, to ensure regular engagement of students in lessons, tasks and learning experiences across the range of curriculum subjects, provision of regular assignments and regular, practical, supportive and customised feedback on work submitted.  Schools adopted various ways to engage with their students in accordance with the technology and broadband resources available in school and at home, including by post, e-mails, communication apps, the school website, use of other digital communicative platforms, including live meetings. Schools were asked to be conscious of pupils who may not have access to online facilities and to adapt approaches so that these pupils continued to have the opportunity to participate in learning.  The aim of these distant learning approaches, the guidance which issued to all schools and the regular engagement with students, was to ensure that students stayed connected with and progressed their learning. These actions will, therefore, have helped to minimise the impact of school closure.  In the context of planning for a return to school which is underway, my Department is, inter alia, considering the curriculum, i.e. what needs to be put in place to support ongoing progression for learners and addressing any shortfall that may result from school closures. Those going into sixth year in post primary schools are a group that will receive a particular focus in the context of preparations for the Leaving Certificate examinations in 2021.  My Department is acutely aware of the challenges faced by students at this difficult time, and how the current circumstances will continue to present challenges into the future. The welfare of students is, and will continue to be, front and centre in all decision making. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_174.xml"
            }
          },
          "debateSectionId": "dbsect_174",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_174",
          "showAs": "School Transport"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_194",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 194,
        "showAs": " 194. Deputy Norma Foley asked the Minister for Education and Skills if an extension of the school bus service will be provided for the 2021 school year from Annascaul village to Inch, County Kerry to accommodate nineteen students that are reliant on such a service. [10311/20] ",
        "answerText": " Minister of State at the Department of Education and Skills (John Halligan)  School Transport is a significant operation managed by Bus Éireann on behalf of the Department.  The purpose of my Department's School Transport Scheme is, having regard to available resources, to support the transport to and from school of children who reside remote from their nearest school.  In the current school year over 120,000 children, including over 14,200 children with special educational needs, are transported in over 5,000 vehicles on a daily basis to primary and post-primary schools throughout the country covering over 100 million kilometres at a cost of over €219m in 2019.  A minimum number of 10 eligible children residing in a distinct locality, as determined by Bus Éireann, are required before consideration may be given to the establishment or retention of school transport services, provided this can be done within reasonable cost limits.  All school transport services are reviewed over the summer months. Arising from this review, routes may be altered, extended or withdrawn depending on the number and location of eligible children who will be availing of school transport for the following school year.  Children who are eligible for school transport and who have completed the application process on time will be accommodated on school transport services where such services are in operation.  Children who are not eligible for school transport, but who completed the application process on time, will be considered for spare seats that may exist after eligible children have been facilitated; such seats are referred to as concessionary seats.  Because of the nature of concessionary transport for non-eligible children and the priority of providing places for eligible children, there may be an excess of demand over supply for concessionary places, in these cases Bus Éireann will allocate tickets for spare seats using a random selection process.  Under the terms of the scheme, the availability of concessionary transport varies from year to year based on the capacity on the buses running on all of the various routes and the number of eligible children accommodated on each route.  In cases where the Department is satisfied that the nearest school is full, eligibility for school transport will be determined based on the distance that children reside from their next nearest school having regard to ethos and language. If a family has further information in regard to the closest school being full they should contact School Transport Section of my Department. Further information in this regard is available on my Department's website www.education.ie. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_184.xml"
            }
          },
          "debateSectionId": "dbsect_184",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_184",
          "showAs": "School Staff"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_205",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 205,
        "showAs": " 205. Deputy Norma Foley asked the Minister for Education and Skills if the need to maintain 2019/2020 teacher allocations will be addressed; and if teacher allocations will be increased for the 2020/2021 school year in view of additional demands placed on schools as a result of Covid-19 stay safe measures. [10429/20] ",
        "answerText": " Minister for Education and Skills  Budget 2020 has provided for a budget of more than €11 billion for the Department of Education and Skills in 2020. This is the highest ever allocation to the sector and an increase of nearly €2 billion since 2016.  The number of teachers has increased from 63,556 in 2015/16 to almost 70,900 in 2019/20, an increase of over 7,300 teaching posts.  Teacher numbers at primary level have increased by almost 3,500 when comparing the 2015/16 school year with the current school year and this has led to a steady improvement in the pupil teacher ratio and average class size statistics during this period.  The latest figures in relation to pupil teacher ratio show an improved ratio of teachers to students from 16:1 to 15.2:1 at primary level when comparing the 2015/16 school year to the 2018/19 school year. Average class sizes at primary level improved from 24.9 to 24.3 in the same period. Corresponding statistics from post primary level show an improved ratio of teachers to students from 13.8:1 to 13:1 during the same period.  The annual staffing schedule determines the allocation of teachers to schools. For the current school year, it operates on a general average of 26 pupils to every 1 teacher (26:1) which is historically the lowest ever allocation ratio at primary level. At post-primary level teachers are allocated at a ratio of 19:1 in the Free Education System and 23:1 to schools in the fee-charging sector.  The National Return to Work Safely Protocol will inform discussions with all education partners so that appropriate guidance for schools is developed and arrangements put in place in time for the new school year. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_267.xml"
            }
          },
          "debateSectionId": "dbsect_267",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_267",
          "showAs": "Covid-19 Pandemic"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_298",
        "to": {
          "roleType": null,
          "showAs": "Business",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 298,
        "showAs": " 298. Deputy Norma Foley asked the Minister for Business, Enterprise and Innovation if sector specific guidelines are available to businesses for a safe reopening of same; if businesses are required to tailor guidelines to meet their own needs; and the person or body charged with responsibility for overseeing the implementation of the guidelines. [10281/20] ",
        "answerText": " Minister for Business, Enterprise and Innovation  Under the reconfiguration of the Government’s Roadmap for Reopening Society and Business announced on the 5th June, there are now just two remaining phases instead of three, with Phase 3 starting on the 29th of June, and Phase 4 on the 20th of July. Further work will be carried out in the coming days and weeks to determine which actions will take place in each phase. Updates to the roadmap can be found at www.gov.ie.  The Roadmap is a living document and Government has demonstrated great flexibility in its decision to accelerate the phases as set out in the original Roadmap.  The input and advice of National Public Health Emergency Team (NPHET) informed the Government’s decision to proceed with Phase 2 and to accelerate elements of the Roadmap. The Government also had regard to a paper which was developed by my Department in conjunction with the Department of Finance and the Department of Public Expenditure and Reform to provide an updated assessment of the economic impact of the COVID-19 pandemic and to identify, from an economic perspective, some priority issues for re-opening of economic activity under Phase 2. This paper, “Economic Considerations for Reinstating Economic Activity - Update for Phase 2”, is available on my Department’s website at https://dbei.gov.ie/en/Publications/Publication-files/Economic-Considerations-for-Reinstating-Economic-Activity-Update-for-Phase-2.pdf.  On 8th June the Minister for Health, Simon Harris T.D., signed SI No.206 of 2020, Health Act 1947 (Section 31A – Temporary Restrictions)(COVID-19)(No. 2) Regulations. These Regulations, which shall remain in operation until 29th June, provide for the unwinding of certain restrictions, including the reopening of retail outlets and extending the distance that may be travelled for specified purposes. The Regulations also provide for continued restrictions for some businesses or services and for offences, including in relation to events. Businesses should carefully review these Regulations.  Where a business is not specifically listed in SI No.206 of 2020, it should review the Roadmap and the updates carefully and carry out a detailed assessment of its activities with regard to the continuing public health measures. Businesses should, based on their assessment, identify which category in which phase of reopening they will be in a position to reopen safely and in line with the continued public health measures. It is not necessary for businesses to seek official authorisation to reopen.  Bodies such as the National Standards Authority of Ireland, the HSE and the HSA have provided guidance, advice and best practice for a number of sectors in that regard.  The National Standards Authority of Ireland’s ‘Retail Protection and Improvement Guide’ helps retailers manage business continuity during the COVID-19 emergency. The NSAI will also be publishing guidelines for shopping centres in the coming days. Please visit www.nsai.ie for further updates.  In response to their request, I met recently with members of the hairdressing and beauty industry via teleconference where they discussed developing guidelines and safety protocols, with reference to the Government’s Return to Work Safely Protocol. I requested that, where sectors are developing such protocols or guides, they should work together to align this work. Last week the Irish Hairdressing Federation submitted their protocol to my Department and I have sent this to my colleague, the Minister for Health, Simon Harris TD and to the HSE.  In line with the national Return to Work Safely protocol, Fáilte Ireland, in association with relevant authorities and following consultation with all industry sectors, has published guidelines for reopening of various sectors of the tourism industry and these are available here https://covid19.failteireland.ie/industry-updates/guidelines-for-re-opening-published/. Based on public health advice, this guidance document aims to assist businesses within the tourism sector in re-opening, helping them ensure that measures concerning health and safety are incorporated throughout all aspects of business operations in order to reduce the risk of the spread of COVID-19 in the workplace.  The National Return to Work Safely Protocol is a useful guide for businesses in making their assessments and adapting their workplace procedures and practices to comply fully with the COVID-19 related public health protection measures. It sets out in very clear terms for employers and employees the steps that they must take firstly before a workplace reopens, and then while it continues to operate. The Protocol is available at https://dbei.gov.ie/en/Publications/Return-to-Work-Safely-Protocol.html. The Health and Safety Authority, which is an agency of my Department, is the lead agency in overseeing compliance with the National Return to Work Safely Protocol in the workplace. If employers or employees need further guidance on the Protocol, the HSA Helpline can be contacted at 1890 289 389 or wcu@hsa.ie.  In order to assist businesses to address the challenges posed by COVID-19, the Government has put in place a comprehensive suite of supports for firms of all sizes, which includes the wage subsidy scheme, grants, low-cost loans, write-off of commercial rates and deferred tax liabilities. These supports are designed to build confidence, to further assist businesses in terms of the management of their companies and to allow them to begin looking to the future and start charting a path forward for weeks and months ahead . For a full list of supports for business please see https://dbei.gov.ie/en/What-We-Do/Supports-for-SMEs/COVID-19-supports/.  I recognise the impact that this pandemic is having on businesses right across the country. I know that employers and employees want to get back to work and I support them in that ambition, but it must be safe to do so. My Department contributed to the considerations around the phased re-opening of sectors under Phases 1 and 2 and I will work within Government to secure further details and clarity for businesses as we progress through the phases outlined in the Roadmap.  It is important to note that all decisions taken by Government on the timing of any lifting of restrictions as envisaged in the next two phases of the Roadmap will be informed by the public health advice at the time. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_377.xml"
            }
          },
          "debateSectionId": "dbsect_377",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_377",
          "showAs": "Covid-19 Pandemic"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_413",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 413,
        "showAs": " 413. Deputy Norma Foley asked the Minister for Health the definition of small, medium and large-sized gatherings in view of the fact this information is vital to those in the process of planning weddings and other events. [10277/20] ",
        "answerText": " Minister for Health  The Government’s Roadmap for Reopening Society & Business, published on 1 May 2020, sets out an indicative path to the easing of COVID 19 restrictions and other actions in order to facilitate the reopening of Ireland’s society and economy in a phased manner. Phase 1 was introduced on 18 May 2020 and, as the Deputy is aware, the Government confirmed the move to Phase 2 of Roadmap for Reopening Society & Business from Monday, 8 June 2020. Information and advice about the restrictions that have been eased as part of Phase 2 and the measures that are now in place are available on the Government website at http://www.gov.ie/phase2.  The Roadmap specifies that decisions in relation to which actions will be taken and which public health measures might be lifted will be made in accordance with the Framework for Future Decision-Making which is as follows:  1. Before each Government consideration of the easing of restrictions, the Department of Health will provide a report to the Government regarding the following on/off trigger criteria:  a. The latest data regarding the progression of the disease,  b. The capacity and resilience of the health service in terms of hospital and ICU occupancy,  c. The capacity of the programme of sampling, testing and contact tracing,  d. The ability to shield and care for at risk groups,  e. An assessment of the risk of secondary morbidity and mortality as a consequence of the restrictions.  2. It will also provide risk-based public health advice on what measures could be modified in the next period.  3. The Government would then consider what restrictions could be lifted, having regard to the advice of the Department of Health as well as other social and economic considerations, e.g. the potential for increased employment, relative benefits for citizens and businesses, improving national morale and wellbeing etc.  4. It is acknowledged that there is also an ongoing possibility that restrictions could be re-imposed and this process will be carried out on an ongoing basis once every 3 weeks.  As is clear from the framework described above, it is the Government rather than I or my Department that will decide on any modifications to the current public health measures in place and those decisions will be informed by the status of the on/off trigger criteria and the public health advice received at the time that a decision is being made.  The exact numbers of person which can attend events in future phases have not been determined in advance. As with all other decisions under the Roadmap, these will be informed, at the time that the decision is made, by the status of the on/off trigger criteria and the public health advice received. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_378.xml"
            }
          },
          "debateSectionId": "dbsect_378",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_378",
          "showAs": "Covid-19 Pandemic"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_414",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 414,
        "showAs": " 414. Deputy Norma Foley asked the Minister for Health if he will consider increasing the number of persons permitted to attend a funeral mass in view of the fact the current small numbers are adding to the stress and trauma of an already difficult situation for families. [10278/20] ",
        "answerText": " Minister for Health  The Government’s Roadmap for Reopening Society & Business, published on 1 May 2020, sets out an indicative path to the easing of COVID 19 restrictions and other actions in order to facilitate the reopening of Ireland’s society and economy in a phased manner.  Phase 1 was introduced on 18 May 2020 and, as the Deputy is aware, the Government confirmed the move to Phase 2 of Roadmap for Reopening Society & Business from Monday, 8 June 2020. Information and advice about the restrictions that have been eased as part of Phase 2 and the measures that are now in place are available on the Government website at http://www.gov.ie/phase2.  The Roadmap specifies that decisions in relation to which actions will be taken and which public health measures might be lifted will be made in accordance with the Framework for Future Decision-Making which is as follows:  1. Before each Government consideration of the easing of restrictions, the Department of Health will provide a report to the Government regarding the following on/off trigger criteria:  a. The latest data regarding the progression of the disease,  b. The capacity and resilience of the health service in terms of hospital and ICU occupancy,  c. The capacity of the programme of sampling, testing and contact tracing,  d. The ability to shield and care for at risk groups,  e. An assessment of the risk of secondary morbidity and mortality as a consequence of the restrictions.  2. It will also provide risk-based public health advice on what measures could be modified in the next period.  3. The Government would then consider what restrictions could be lifted, having regard to the advice of the Department of Health as well as other social and economic considerations, e.g. the potential for increased employment, relative benefits for citizens and businesses, improving national morale and wellbeing etc.  4. It is acknowledged that there is also an ongoing possibility that restrictions could be re-imposed and this process will be carried out on an ongoing basis once every 3 weeks.  As is clear from the framework described above, it is the Government rather than I or my Department that will decide on any modifications to the current public health measures in place and those decisions will be informed by the status of the on/off trigger criteria and the public health advice received at the time that a decision is being made.  As the Deputy quite rightly points out bereavement is a difficult time for every family. Adhering to the public health advice makes it even more difficult, but these precautions are in place to protect everyone. From the start of Phase 2 (8 June, 2020) up to 25 people can be in attendance at a funeral service and burial / cremation ceremonies while observing strict social distancing guidance such as keeping 2 metres apart, maintaining hand hygiene and respiratory etiquette, as well as the wearing of face coverings.  Funeral Directors and officiators are requested to remind and encourage mourners to comply with public health guidance for the safety of all attending a funeral.  It is also important to note that any indoor events after a funeral must comply with the public health guidance applicable to indoor visits, that is limited to a maximum of 6 persons indoors. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_601.xml"
            }
          },
          "debateSectionId": "dbsect_601",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_601",
          "showAs": "Community Employment Schemes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_652",
        "to": {
          "roleType": null,
          "showAs": "Employment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 652,
        "showAs": " 652. Deputy Norma Foley asked the Minister for Employment Affairs and Social Protection if she will consider extending the contract of community employment supervisors that are obliged to retire at 66 years of age that wish to continue working by one year in view of the Covid-19 pandemic. [9952/20] ",
        "answerText": " Minister for Employment Affairs and Social Protection  Firstly, I would like to acknowledge the valuable and dedicated service that CE sponsoring bodies provide in running CE schemes throughout the country. CE supervisors, as employees of those organisations, are an integral part of that good work.  CE is an active labour market programme designed to provide eligible long-term unemployed people and others with an opportunity to engage in useful work within their communities on a temporary, fixed term basis. The programme is delivered through independent CE sponsoring bodies that receive state funding from the Department to cover the cost of CE employee remuneration.  Funding for CE supervisors is available until the person reaches the state pension age. CE supervisors may apply for a State Pension on retirement from CE.  CE is a working age activation scheme and CE supervisors who continue to be funded through CE must be of working age. As you will appreciate, if my Department continues to fund CE supervisors that have reached the state pension age it would significantly impact on the opportunities for those people who are still of working age and also, would undermine the reputation of CE as an active labour market programme.  A number of CE supervisors have retired over the course of the Covid-19 emergency and recruitment of new CE supervisors has been managed by CE sponsoring bodies using processes that are in line with existing national guidelines. The recruitment of new CE supervisors offers valuable employment opportunities to those of working age, including those who may be unemployed at present. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_607.xml"
            }
          },
          "debateSectionId": "dbsect_607",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_607",
          "showAs": "Covid-19 Pandemic Unemployment Payment"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_676",
        "to": {
          "roleType": null,
          "showAs": "Employment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 676,
        "showAs": " 676. Deputy Norma Foley asked the Minister for Employment Affairs and Social Protection her plans to accommodate the payment of arrears due to persons in receipt of the pandemic unemployment payment. [10279/20] ",
        "answerText": " Minister for Employment Affairs and Social Protection  I propose to take Questions Nos. 658 and 676 together.  The emergency Covid-19 Pandemic Unemployment Payment has been introduced as a time-limited emergency measure so that payments can be made as quickly as possible to the large number of people who have become fully unemployed due to the pandemic.  During the month of March, my Department received and processed jobseeker claims equivalent in number to a three year claim-load. These applications were processed as quickly as possible, with almost 59,000 people paid in the first week of the scheme, 283,000 people paid in the following week, and over 507,000 people in the third week of the scheme. To date, almost 6 million payments have issued to just over 670,000 individuals at a cost of over €2 Billion.  Currently, the Department is focused on processing and managing payments to ensure that they continue to be made to all who qualify for them. The work involved in doing this is complex, with people joining and leaving the scheme each week, along with management of overlaps between the Covid-19 Pandemic Unemployment Payment and the Revenue Temporary Wage Subsidy Scheme.  The Department is aware that many people are due some arrears and that each person’s case is unique. This means that each person’s application may need to be individually reviewed.  It will take time to review all of the applications and assess for back payments. The Department is committed to reviewing cases as quickly as possible.  I can assure the Deputies that all cases will be examined and where arrears arise they will be processed and claimants will be notified.  I trust this clarifies the matter for the Deputies. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-09",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/mul@/dbsect_653.xml"
            }
          },
          "debateSectionId": "dbsect_653",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-09/writtens/dbsect_653",
          "showAs": "Housing Estates"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-09/pq_722",
        "to": {
          "roleType": null,
          "showAs": "Housing",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 722,
        "showAs": " 722. Deputy Norma Foley asked the Minister for Housing, Planning and Local Government if the case of a housing estate (details supplied) will be investigated. [10404/20] ",
        "answerText": " Minister for Housing, Planning and Local Government  Section 10 of the Finance (Local Property Tax) Act 2012 (as amended), enabled the Minister for Housing, Planning and Local Government to prescribe a list of unfinished housing developments to which an exemption from the local property tax applies. An exemption from the local property tax applies to developments listed in the Schedule to the Finance (Local Property Tax) Regulations 2013 (S.I. No. 91/2013).  The list of unfinished housing developments eligible for the exemption was compiled by local authorities, utilising the categorisation employed for the purposes of the National Housing Survey. Only developments (and parts of developments) that were deemed by local authorities to be in a “seriously problematic condition”, regardless of whether a developer was on or off site, were included in the Finance (Local Property Tax) Regulations 2013. These Regulations applied to 421 developments, comprising approximately 5,100 homes, which remain exempt from LPT.  In response to the specific matter in question, my Department has been in contact with Kerry County Council and my officials have been advised by the Council that the Estate was not included within the list of “unfinished housing estates” developments listed in the Schedule to the Finance (Local Property Tax) Regulations 2013, as it did not meet the criteria for inclusion of a development or part thereof for Property Tax Waiver. Accordingly, the occupier of any house within the Estate is liable for the local property tax. I understand, however, that the Bond provider has relinquished the bond to Kerry County Council. The Council, with this funding, will now be arranging to have the outstanding works completed in the Estate.  There were a number of approaches adopted towards addressing the legacy of unfinished housing developments, including the development of Site Resolution Plans (SRPs) for the finalisation of works on site to render estates as habitable as possible and the launch of the Public Safety Initiative (PSI) to address immediate public safety issues. In addition, Budget 2014 contained a special provision, in the form of a targeted €10m Special Resolution Fund (SRF).  An Annual Progress Report was compiled and published every year from 2012 to 2018. These reports are available on the Department’s website. For ease of access, the most recent report published in February 2018 is available at the following link: https://www.housing.gov.ie/housing/rebuilding-ireland/national-housing-development-survey/publication-2017-annual-progress  As outlined in the Annual Progress Report 2017 (link provided above), the number of unfinished housing developments has reduced by 91% from around 3,000 developments in 2010, to 256 developments in 2017. A list of unfinished housing estates can also be found under the ‘unfinished’ tab layer on the MyPlan website available at the following link: www.myplan.ie  Given the significant progress made, there are no plans at this time to revise the list of developments included in the Schedule to the Finance (Local Property Tax) Regulations 2013, either by removing or adding developments to it. Local authorities will continue to assess the best options for resolution of unfinished developments and/or developments that are to be taken in charge. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-09",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_111.xml"
            }
          },
          "debateSectionId": "dbsect_111",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_111",
          "showAs": "Tourism Industry"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_134",
        "to": {
          "roleType": null,
          "showAs": "Public",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 134,
        "showAs": " 134. Deputy Norma Foley asked the Minister for Public Expenditure and Reform the reason for his decision to close Skellig Michael to visitors this season; the reason the decision was taken so early prior to the lifting of restrictions for the tourism sector without an opportunity to gauge the way in which matters might progress or improve in the interim; and if the decision is subject to an ongoing review. [9315/20] ",
        "answerText": " Minister of State at the Department of Public Expenditure and Reform (Kevin Boxer Moran)  In making the decision to close Skellig for the remainder of the 2020 season, OPW had to have regard to the safety of a range of individuals including Visitors to the island, OPW staff and Boatmen and their employees.  It was the OPW assessment that given the particular nature of the Skellig site and the means of transit to it, the comparisons with other landside environments are not valid and the risks to public health could not be sufficiently mitigated.   This is particularly the case given the regular incidence of illness / vomiting among visitors on the trip, the frequent necessity for Guides to administer close support & first aid to visitors and the lack of any water and public hand washing facilities on the island.  In addition, there are significant on-island restrictions on movement of visitors with considerable physical danger involved in stepping off island pathways when meeting others, the likelihood of people ventilating / panting heavily in close proximity to fellow visitors and the presence of safety chain handrails in a number of locations that could not be adequately sterilised between every use.   The OPW also concluded that, having regard to the best public health advice available, it was unlikely that Covid-19 would have disappeared fully from Ireland within the four months remaining in the season to the extent that these special factors present at Skellig Michael would be rendered irrelevant and a reopening would be feasible.  Notwithstanding the likely health barriers to reopening at a later stage, there are also significant operational issues involved in opening Skellig Michael and necessary fixed expenditures by Boatmen on safety equipment, insurances etc which are required before operations can start.   Having assessed these issues and consulted with relevant stakeholders, it is clear to the OPW that even absent the public health complications, a late restart to the season is not feasible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_166.xml"
            }
          },
          "debateSectionId": "dbsect_166",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_166",
          "showAs": "Covid-19 Pandemic"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_216",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 216,
        "showAs": " 216. Deputy Norma Foley asked the Minister for Education and Skills the reason newly qualified teachers who have not completed the required 60-day block teaching requirement by 12 March 2020 are being disadvantaged (details supplied); and if he will make a statement on the matter. [8854/20] ",
        "answerText": " Minister for Education and Skills  I propose to take Questions Nos. 194, 196, 203, 207, 216, 250, 306, 317, 318 and 322 together.  The Teaching Council is the statutory body with responsibility for professional standards at all stages of the teaching career. It has established standards for post-qualification professional practice, as set out in Droichead, the integrated professional induction framework for newly qualified primary and post-primary teachers.  Due to Covid-19 and the unprecedented situation of school closures, on May 22nd last the Teaching Council announced revised arrangements which provide additional flexibility to support newly qualified teachers (NQTs) engaging in Droichead in 2019/2020 to complete the process. These arrangements balance the core principles of the policy which is the school based supportive process coupled with engagement in additional professional learning activities.  The Council has made a significant concession for NQTs who had not completed the full Droichead process within the minimum period of time by 12 March. This includes the recognition of all elements of Droichead which have been completed up to that date i.e. additional professional learning activities, observations, professional conversations, cluster meetings, Taisce (the professional learning portfolio) and days/hours taught. In normal circumstances this would not be the position.  Droichead as a process is not simply about teaching time. From a professional standards point of view, it requires the agreement of the NQT and the Professional Support Team in the school that a quality induction process has occurred over the minimum period of time specified.  I am, however, also aware of concerns raised regarding a smaller group of NQTs who had not met the minimum time requirement by 12 March. I understand the Teaching Council intends to further review their situation i.e. how the Professional Support Teams and any NQTs who may be potentially affected can verify that a quality induction process has occurred throughout the period since 12 March in the context of remote teaching and learning.  The Teaching Council will communicate the outcome of this review to all concerned within the next two weeks. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_184.xml"
            }
          },
          "debateSectionId": "dbsect_184",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_184",
          "showAs": "School Staff"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_217",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 217,
        "showAs": " 217. Deputy Norma Foley asked the Minister for Education and Skills his plans for teacher allocation in primary and secondary schools for the 2020/2021 school term; and his plans to increase the allocation of teachers to meet the demands of social distancing requirements due to the Covid-19 crisis. [8855/20] ",
        "answerText": " Minister for Education and Skills  Budget 2020 has provided for a budget of more than €11 billion for the Department of Education and Skills in 2020. This is the highest ever allocation to the sector and an increase of nearly €2 billion since 2016.  The number of teachers has increased from 63,556 in 2015/16 to almost 70,900 in 2019/20, an increase of over 7,300 teaching posts.  Teacher numbers at primary level have increased by almost 3,500 when comparing the 2015/16 school year with the current school year and this has led to a steady improvement in the pupil teacher ratio and average class size statistics during this period.  The latest figures in relation to pupil teacher ratio show an improved ratio of teachers to students from 16:1 to 15.2:1 at primary level when comparing the 2015/16 school year to the 2018/19 school year.  Average class sizes at primary level improved from 24.9 to 24.3 in the same period. Corresponding statistics from post primary level show an improved ratio of teachers to students from 13.8:1 to 13:1 during the same period.  The annual staffing schedule determines the allocation of teachers to schools.  For the current school year, it operates on a general average of 26 pupils to every 1 teacher (26:1) which is historically the lowest ever allocation ratio at primary level.  At post-primary level teachers are allocated at a ratio of 19:1 in the Free Education System and 23:1 to schools in the fee-charging sector.  The National Return to Work Safely Protocol will inform discussions with all education partners so that appropriate guidance for schools is developed and arrangements put in place in time for the new school year. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_182.xml"
            }
          },
          "debateSectionId": "dbsect_182",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_182",
          "showAs": "Third Level Education"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_274",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 274,
        "showAs": " 274. Deputy Norma Foley asked the Minister for Education and Skills if he will engage with third-level institutes and universities to seek clarification regarding their plans for online courses for the 2020/2021 academic year (details supplied); and if he will make a statement on the matter. [9252/20] ",
        "answerText": " Minister for Education and Skills  I propose to take Questions Nos. 215 and 274 together.  Higher Education Institutions are autonomous institutions and are entitled to regulate their own academic affairs and administrative processes. Therefore the timelines for re-opening, and the manner in which courses are conducted, are a matter for each institution to decide.  The national co-ordination group for tertiary education is meeting on a regular basis to consider key issues impacting the tertiary sector, including arrangements for re-opening institutions. These arrangements will be dependent on public health advice, and will be communicated to learners as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_228.xml"
            }
          },
          "debateSectionId": "dbsect_228",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_228",
          "showAs": "School Staff"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_275",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 275,
        "showAs": " 275. Deputy Norma Foley asked the Minister for Education and Skills if schools will not lose a teacher for the 2020/2021 school year in view of the fact increased health and safety requirements due to Covid-19 make it vital that schools have sufficient teachers available to implement same. [9271/20] ",
        "answerText": " Minister for Education and Skills  The key factor for determining the level of staffing resources provided at individual school level is the staffing schedule for the relevant school year and pupil enrolments on the previous 30 September.  The redeployment of all surplus permanent/CID holding teachers is the mechanism used to fill teaching posts and is key to the ability of the Department to manage within its payroll budget.  The redeployment panels are currently transacting and schools are filling teaching vacancies for the 2020/21 school year.  The National Return to Work Safely Protocol will inform discussions with all education partners so that appropriate guidance for schools is developed and arrangements put in place in time for the new school year. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_248.xml"
            }
          },
          "debateSectionId": "dbsect_248",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_248",
          "showAs": "Special Educational Needs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_303",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 303,
        "showAs": " 303. Deputy Norma Foley asked the Minister for Education and Skills his plans to fully continue the July provision in summer 2020; and the details of same. [9494/20] ",
        "answerText": " Minister for Education and Skills  My Department is aware of concerns that the closure of schools has impacted hardest upon families who have children with complex needs whose wellbeing and engagement with learning depend very much on the routine of school and their relationships with other students, teachers and Special Needs Assistants.  They have also lost out on specialist supports during this closure period.  My Department has taken a number of initiatives to support children and young people who are at risk of educational disadvantage during the period of school closures.  These include –  - Guidance issued to all schools to support the ongoing learning of children with special educational needs and children who are at risk of disadvantage;  - Guidance and resources developed by the National Council for Special Education (NCSE) on supporting children with special educational needs  - €10m in ICT grant funding to schools towards the purchase of technology and devices to support students at risk of educational disadvantage.  - Continued funding of Home Tuition or, where this is not possible, flexibility to bank hours for use at a later time in the year  - Resources to support good mental health and wellbeing amongst students produced by the National Educational Psychological Service (NEPS)  - To help schools plan for the new academic year, schools have been informed that their SNA allocation is being frozen at this year’s level and there is provision for additionality where this might be required. No school will therefore have a lower allocation for the next school year.  - The Middletown Centre for Autism has developed a range of online resources for children and young people with Autism and their parents on education provision in the Home.  Unfortunately, due to the Covid-19 health crisis, it is not possible to deliver the normal July Provision programme in the same way and at the same time as in other years.  However my Department is planning for a summer provision type programme for children with complex needs this year as soon as it is safe to do so and in accordance with public health advice.  The primary aim of the proposed programme would be to limit potential regression in learning thereby ensuring in so far as possible that these children can reintegrate and transition into their planned education setting for next year with their peers.  This may be done through a targeted level of supports to address regression of social skills and re-establish tolerance of routines paving the way for reintegrating full time into education when schools reopen in the autumn.  Planning is underway and consultations with stakeholders have commenced. The willingness of schools, teachers and SNAs to participate are key to the provision of a summer education programme.  An announcement will be made as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_249.xml"
            }
          },
          "debateSectionId": "dbsect_249",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_249",
          "showAs": "Special Educational Needs"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_304",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 304,
        "showAs": " 304. Deputy Norma Foley asked the Minister for Education and Skills the status of the 2020 July programme (details supplied); his plans to run the programme in summer 2020; if it will be incorporated into the July provision initiative; and if he will consider involving SNAs in order to meet new health and safety requirements. [9495/20] ",
        "answerText": " Minister for Education and Skills  My Department is aware of concerns that the closure of schools has impacted hardest upon families who have children with complex needs whose wellbeing and engagement with learning depend very much on the routine of school and their relationships with other students, teachers and Special Needs Assistants.  They have also lost out on specialist supports during this closure period.  My Department has taken a number of initiatives to support children and young people who are at risk of educational disadvantage during the period of school closures.  These include –  - Guidance issued to all schools to support the ongoing learning of children with special educational needs and children who are at risk of disadvantage;  - Guidance and resources developed by the National Council for Special Education (NCSE) on supporting children with special educational needs  - €10m in ICT grant funding to schools towards the purchase of technology and devices to support students at risk of educational disadvantage.  - Continued funding of Home Tuition or, where this is not possible, flexibility to bank hours for use at a later time in the year  - Resources to support good mental health and wellbeing amongst students produced by the National Educational Psychological Service (NEPS)  - To help schools plan for the new academic year, schools have been informed that their SNA allocation is being frozen at this year’s level and there is provision for additionality where this might be required. No school will therefore have a lower allocation for the next school year.  - The Middletown Centre for Autism has developed a range of online resources for children and young people with Autism and their parents on education provision in the Home.  Unfortunately, due to the Covid-19 health crisis, it is not possible to deliver the normal July Provision programme in the same way and at the same time as in other years.  However my Department is planning for a summer provision type programme for children with complex needs this year as soon as it is safe to do so and in accordance with public health advice.  The primary aim of the proposed programme would be to limit potential regression in learning thereby ensuring in so far as possible that these children can reintegrate and transition into their planned education setting for next year with their peers.  This may be done through a targeted level of supports to address regression of social skills and re-establish tolerance of routines paving the way for reintegrating full time into education when schools reopen in the autumn.  Planning is underway and consultations with stakeholders have commenced. The willingness of schools, teachers and SNAs to participate are key to the provision of a summer education programme.  An announcement will be made as soon as possible. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_412.xml"
            }
          },
          "debateSectionId": "dbsect_412",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_412",
          "showAs": "Enterprise Support Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_494",
        "to": {
          "roleType": null,
          "showAs": "Business",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 494,
        "showAs": " 494. Deputy Norma Foley asked the Minister for Business, Enterprise and Innovation if sector specific supports will be made available to secure the viability of bus and coach operators going forward in view of the fact such operators are essential to the tourism sector and the transport network here. [9580/20] ",
        "answerText": " Minister for Business, Enterprise and Innovation  In order to assist businesses to address the challenges posed by COVID-19, the Government has put in place a comprehensive suite of supports for firms of all sizes, which includes the wage subsidy scheme, grants, low-cost loans, write-off of commercial rates and deferred tax liabilities.  These supports are designed to build confidence, to further assist businesses in terms of the management of their companies and to allow them to begin looking to the future and start charting a path forward for weeks and months ahead. For a full list of supports for business please see  https://dbei.gov.ie/en/What-We-Do/Supports-for-SMEs/COVID-19-supports/ .  The full range of Enterprise Ireland, Local Enterprise Office (LEO) and Údarás na Gaeltachta grant and advisory supports continue to be available to eligible firms to help with strategies to access finance, commence or ramp-up online trading activity, reconfigure business models, cut costs, innovate, diversify markets and supply chains and to improve competitiveness.  In that regard, Government will continue to explore funding potential for all enterprises including micro-enterprises as they work through the challenges facing them, including through any mechanisms allowable through the EU’s state aid framework.  The SBCI Covid-19 Working Capital Scheme was announced on 11 March and opened for eligibility applications on 23 March which also include bus and coach operators. The Covid-19 Working Capital Scheme is offered by my Department in cooperation with the Department of Agriculture, Food and the Marine, and is supported by the InnovFin SME Guarantee facility. The scheme is operated by the SBCI. It currently makes available a fund of up to €200 m to eligible businesses that have been negatively affected by impacts arising from the outbreak of Covid-19 to enable those businesses to innovate, change or adapt in response to the current business environment. Following my further announcement on April 8 this Scheme is now being expanded to make available an additional €250 million in lending, which will bring the total amount of lending available under this scheme to €450 million.  The Future Growth Loan Scheme makes up to €300 million of loans available with a term of 8-10 years and is operated by the Strategic Banking Corporation of Ireland (SBCI) though participating lenders. We have seen strong demand for the scheme since its launch in April 2019 across all sectors and regions including in exporting businesses and family businesses.  These measures are in addition to the €150m of funding capacity in the Government’s Credit Guarantee Scheme, which is available to bus and coach operators.  For microenterprises (under 10 employees), Microfinance Ireland (MFI) are administering special COVID-19 Loans, with an additional €13m in capital support bringing its total lending capacity up to €20m for the coming period. There is also a substantial reduction in interest rates on these loans from 7.8% to 4.5%. Loans can be made up to €50,000 with no repayments required and no interest charged in the first six months.  I can assure the Deputy that I continue to work with my colleagues across Government to examine further appropriate supports to assist businesses impacted by Covid-19.  My colleague, Minister Shane Ross T.D., Minister for Transport, Tourism and Sport may be able to provide more specific guidelines or supports designed to suit your particular business. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_533.xml"
            }
          },
          "debateSectionId": "dbsect_533",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_533",
          "showAs": "Dental Services "
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_615",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 615,
        "showAs": " 615. Deputy Norma Foley asked the Minister for Health the reason dentists treating patients on behalf of the HSE are without the necessary PPE to carry out their work in view of the fact the receipt of same was guaranteed within 48 hours (details supplied); and if he will make a statement on the matter. [8853/20] ",
        "answerText": " Minister for Health  As this is a service matter it has been referred to the HSE for attention and direct reply to the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_534.xml"
            }
          },
          "debateSectionId": "dbsect_534",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_534",
          "showAs": "Speech and Language Therapy"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_616",
        "to": {
          "roleType": null,
          "showAs": "Health",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 616,
        "showAs": " 616. Deputy Norma Foley asked the Minister for Health the provision being made for the return to work of speech and language therapists (details supplied); and the point at which speech and language therapists will be free to return to work in view of the fact it is unclear in the Roadmap for Reopening Society and Business. [8856/20] ",
        "answerText": " Minister of State at the Department of Health (Finian McGrath)  As the Deputy's question relates to a service matter, it has been referred to the HSE for direct reply. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_799.xml"
            }
          },
          "debateSectionId": "dbsect_799",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_799",
          "showAs": "Tourism Policy"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_980",
        "to": {
          "roleType": null,
          "showAs": "Transport",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 980,
        "showAs": " 980. Deputy Norma Foley asked the Minister for Transport, Tourism and Sport if representation from bus and coach operators will be included on the new Tourism Recovery Taskforce. [9581/20] ",
        "answerText": " Minister for Transport, Tourism and Sport (Shane Ross)  I propose to take Questions Nos. 895 and 980 together.  The Tourism Recovery Taskforce was established by Minister of State Brendan Griffin and I on 20 May 2020. The purpose of the Taskforce is to prepare a Tourism Recovery Plan for submission to the Ministers which will include a set of recommendations on how best the Irish tourism sector can adapt and recover in the changed tourism environment as a result of the Covid-19 crisis. The plan will identify priority aims, key enablers and market opportunities for the sector for the period 2020-2023. The Taskforce may consult with stakeholders to inform its deliberations and will report back later this year.  The Taskforce is made up of an independent chairperson and 13 other members from a broad spectrum of backgrounds including tourism policy, tourism enterprise, international, private and public service. The Minister of State and I selected members on the basis of each person's capacity to bring his/her personal knowledge, skills, experience, competence, capability, strategic leadership and ideas to the work of the group. We have appointed individuals who, together, will work for the good of Irish Tourism as a whole. I can assure the Deputy that in the same manner that no sector was deliberately included, no sector was deliberately excluded.  It is envisaged that the Taskforce will establish working groups to carry out specific tasks and that the Taskforce will undertake a widespread stakeholder consultation process whereby all sectors and interested parties will have an opportunity to provide constructive inputs and innovative ideas on how this vital sector to our economy can adapt and recover in a meaningful and sustainable way. Representatives from the coach hire and chauffeur drive sector will have an opportunity to contribute to the work of the Taskforce in this way.  I should also point out that in addition to the Tourism Recovery Taskforce, there are other fora whereby tourism stakeholders, including representatives from the coach and chauffeur sector, can contribute. Representatives from the sector have been invited to participate in Fáilte Ireland’s Covid Advisory Group which meets on a weekly basis. Furthermore, officials on the Transport side in my Department are in regular contact with the representatives of the coach sector in the context of the difficulties its members are facing as a result of the Covid crisis. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_913.xml"
            }
          },
          "debateSectionId": "dbsect_913",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_913",
          "showAs": "Childcare Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_1025",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1025,
        "showAs": " 1025. Deputy Norma Foley asked the Minister for Children and Youth Affairs the childcare measures in place for front-line workers; and her definition of the term \"front-line worker\".  [9316/20] ",
        "answerText": " Minister for Children and Youth Affairs (Katherine Zappone)  On Friday 1 May, the Government released its Roadmap for Reopening Society and Business, which sets out Ireland's plan for lifting COVID-19 restrictions through five phases. The re-opening of Early Learning and Care and School-Age Childcare (ELC and SAC) services will be guided by this framework and will be underpinned by the Government's Return to Work Safely Protocol, expert advice, available evidence and consultation with ELC and SAC stakeholder representatives and providers themselves.  The future stages of the Roadmap's re-opening of ELC/SAC services are stated as follows:  Phase 3 (29 June), opening of crèches, childminders and preschools for children of essential workers in a phased manner with social distancing and other requirements applying.  Phase 4 (20 July), opening of crèches, childminders and preschools for children of all other workers on a gradually increasing phased basis and slowly increasing thereafter.  The sector has many questions regarding how the Roadmap will be implemented to enable services to re-open. While the COVID-19 emergency called for overnight action on closures, it is my ambition that the phased re-opening will enable sufficient time and planning to re-open in an orderly, safe and sustainable manner. I would like to reassure providers, practitioners, parents and children that I will be doing my utmost to support the sector in offering as smooth a transition as possible to the phased and restricted re-opening of ELC and SAC services.  My Department is currently working with the sector to answer the many questions that exist. This is complex work and must balance a number of important issues, including those mentioned by the Deputy around capacity. Informed by NPHET and public health guidance, consideration is being given to a range of these issues, including:  - Minimising the public health risk, especially given the difficulty of maintaining social distancing among young children and those caring for them,  - Ensuring the need for any restrictions to be consistent with young children’s well-being and development needs and for ELC and SAC provision at each phase to be child-centred.  - Providing ELC for pre-school children, meeting parental demand for ELC and SAC as the economy reopens, and meeting the commitment to retain places for families who paid for ELC and SAC before COVID-19, all while restricting capacity and thereby reducing adult-child ratios.  - Ensuring financial sustainability of the sector when capacity restrictions limit income and parents cannot afford to cover any higher costs with higher fees.  - Ensuring a sufficient number of qualified ELC and SAC practitioners, given likelihood of reduced adult-child ratios and existing challenges with recruitment and retention.  A further key factor is that, in the best interests of children and parents, children should, as far as possible, be enabled to return to the childcare service they attended pre-COVID-19. Given the changed model of interaction and the time lapse since children last attended, it is important that there is as much continuity as possible for children. In light of the necessary changes, parents may also feel more reassured by placing their children in the care of childcare practitioners with whom they already have a relationship. Familiarity with other children attending the service and their parents may also help with the settling-in phase.  I am actively engaging with key stakeholders in the sector to make sure that the work on re-opening services is informed by the practical reality across the country. I have established and Chair an Advisory Group that includes representatives chosen by the sector, specifically the Association of Childhood Professionals, Community Forum, Early Childhood Ireland, National Childhood Network, PLÉ and Seas Suas. The group also includes Tusla, Pobal, SIPTU and Childminding Ireland. The first meeting of this Advisory Group took place on 13 May and I held follow up meetings on 15 and 19 May. A schedule of weekly meetings has also been agreed.  The proposals for re-opening which are in development will have due regard to Public Health guidance over the phases of easing of restrictions.  I am conscious that the proposed timelines are subject to further NPHET advice, and decisions from Government.  Identifying essential workers, who will be eligible for childcare as part of this reopening, is part of the wider Government effort to ensure that society and business are re-opened in a carefully managed and safe manner.  There are a number of key decisions to be made across Government that will impact significantly on the ELC and SAC sector, including the future of emergency measures such as the Revenue operated Temporary Wage Subsidy Scheme, the Department of Employment Affairs and Social Protection operated Pandemic Unemployment Payment, and other business supports. The proposals for re-opening ELC and SAC services necessarily interact with these schemes and so I will be relying on whole of Government plans, which impact the ELC and SAC sector.  It is my fervent hope that every early education and childcare service  around the country is currently considering how it can be part of helping Ireland get back to work, and how it can support children from June 29th in the very difficult circumstances they have experienced in recent months.  I will undertake to update the Deputy as soon as the work on re-opening services is at a more advanced stage. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_914.xml"
            }
          },
          "debateSectionId": "dbsect_914",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_914",
          "showAs": "Childcare Services"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_1026",
        "to": {
          "roleType": null,
          "showAs": "Children",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1026,
        "showAs": " 1026. Deputy Norma Foley asked the Minister for Children and Youth Affairs the measures and works which will be required in childcare facilities going forward to meet Covid-19 requirements. [9317/20] ",
        "answerText": " Minister for Children and Youth Affairs (Katherine Zappone)  On Friday 1 May, the Government released its Roadmap for Reopening Society and Business, which sets out Ireland's plan for lifting COVID-19 restrictions through five phases. The re-opening of Early Learning and Care and School-Age Childcare (ELC and SAC) services will be guided by this framework and will be underpinned by the Government's Return to Work Safely Protocol, expert advice, available evidence and consultation with ELC and SAC stakeholder representatives and providers themselves.  Expert guidance on the safe reopening of childcare services during the COVID-19 pandemic was published by the HSE Health Protection Surveillance Centre (HPSC) on Friday, 29 May. The guidance recommends use of a “play pod” model which restricts interactions between closed groups of children and adults as an alternative to social distancing, on the basis that social distancing is not possible between young children. Based on advice provided by the HPSC I do not propose to change Regulations in relation to either the adult-child ratios or the floor-space requirements for ELC or SAC services as such changes are unnecessary where \"play pods\" are in use.  Services are now being asked to apply the guidance to their setting and determine what capacity they may offer. It is expected that a significant amount of capacity will be available in individual services that reopen in the summer, subject to, for example, their space, room layout and staffing availability.  Whilst there are 4,500 Early Learning and Care and School-Age Childcare services in the country, fewer than 2,000 of these normally remain open in July and August.  I have been engaging intensively with a number of organisations representing the childcare sector, through an Advisory Group. A range of additional guidance and resources to assist the sector to prepare for reopening are currently being prepared and will start to issue in the coming days and continue over the remaining weeks before opening.  Since 2015 my Department has administered an annual capital funding programme, under which service providers registered with Tusla are invited to apply for capital funding to increase the capacity of their services,  or to maintain and improve their services.  In 2020 I secured €7.2m in capital funding for early learning and care (ELC)  and school age care (SAC).  I launched the application programme for the 2020 Capital Programme on 28 February but this had to be suspended due to the Covid-19 pandemic.  I am currently reviewing the allocation of the 2020 capital budget and I intend to launch a new capital grant programme in the coming days.  In doing so, I am conscious that demand for childcare services after COVID may be reduced, at least initially. I believe the best use of capital funding in 2020 will be made through supporting services and places already in existence, to reopen after the closure period, and to support them meet the new HPSC guidance.  The application process for the 2020 Capital programme, which will be administered by Pobal, will go live shortly. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_1007.xml"
            }
          },
          "debateSectionId": "dbsect_1007",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_1007",
          "showAs": "Disability Allowance"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_1125",
        "to": {
          "roleType": null,
          "showAs": "Employment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1125,
        "showAs": " 1125. Deputy Norma Foley asked the Minister for Employment Affairs and Social Protection the status of a disability appeal by a person (details supplied). [9338/20] ",
        "answerText": " Minister for Employment Affairs and Social Protection (Regina Doherty)  An application for Disability Allowance by the person concerned was disallowed by a Deciding Officer of the Department on 19 October 2019.  I am informed by the Social Welfare Appeals Office that no appeal from the person concerned was received in that office until 27 April 2020.  In the normal course, an appeal against the decision of a Deciding Officer must be made within 21 days of a decision being notified.  Appeals received outside of this time limit may be accepted at the discretion of the Chief Appeals Officer.  In view of the length of time which has elapsed since the person concerned was notified of the decision and in the absence of any explanation for the failure to submit an appeal within the prescribed timeframe, I am advised by the Social Welfare Appeals Office that an appeal has not been registered in this case.  However, the Appeals Office has sought an explanation for the failure to submit an appeal within the prescribed timeframe and, on receipt of the response, will determine whether a late appeal can be accepted and registered.  The Social Welfare Appeals Office functions independently of the Minister for Employment Affairs and Social Protection and of the Department and is responsible for determining appeals against decisions in relation to social welfare entitlements.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-06-03",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/mul@/dbsect_1008.xml"
            }
          },
          "debateSectionId": "dbsect_1008",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-06-03/writtens/dbsect_1008",
          "showAs": "Carer's Allowance"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-06-03/pq_1126",
        "to": {
          "roleType": null,
          "showAs": "Employment",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 1126,
        "showAs": " 1126. Deputy Norma Foley asked the Minister for Employment Affairs and Social Protection the status of an application for a carer’s allowance by a person (details supplied). [9339/20] ",
        "answerText": " Minister for Employment Affairs and Social Protection (Regina Doherty)  Carer's allowance (CA) is a means-tested social assistance payment made to a person who is habitually resident in the State and who is providing full-time care and attention to a child or an adult who has such a disability that as a result they require that level of care.  An application for CA was received from the person concerned on 17 April 2020.  It is a condition for receipt of a CA that the person being cared for must have such disability that they require full-time care and attention.  This is defined as requiring from another person, continual supervision and frequent assistance throughout the day in connection with normal bodily functions or continual supervision in order to avoid danger to him or herself and likely to require that level of care for at least twelve months.  The evidence submitted in support of the application was examined and the deciding officer decided that this evidence did not indicate that the requirement for full-time care was satisfied.  The person concerned was notified on 5 May 2020 of this decision, the reason for it and of his right of review and appeal.  The person concerned requested a review of this claim on 14 May 2020 but failed to submit further medical evidence in support of his application.  Correspondence requesting further medical evidence issued to the person concerned in support of his application. I am advised that to date no further medical evidence to support this request has been received.  Once the required information has been received and a decision made, the person concerned will be notified directly of the outcome.  I hope this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-06-03",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-05-27",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/mul@/dbsect_100.xml"
            }
          },
          "debateSectionId": "dbsect_100",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/dbsect_100",
          "showAs": "Drainage Schemes"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-27/pq_94",
        "to": {
          "roleType": null,
          "showAs": "Public",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 94,
        "showAs": " 94. Deputy Norma Foley asked the Minister for Public Expenditure and Reform if the necessary funding will be provided as a matter of urgency to carry out emergency improvement works to the embankment at Cromane Lower, Killorglin, County Kerry; and if he will make a statement on the matter. [8097/20] ",
        "answerText": " Minister of State at the Department of Public Expenditure and Reform (Kevin Boxer Moran)  The Office of Public Works (OPW) carries out a programme of Arterial Drainage Maintenance to a total of 11,500 km of river channel and approximately 730 km of embankments. These maintenance works relate to arterial drainage schemes completed by the OPW under the Arterial Drainage Acts 1945 and 1995.  The embankment in question does not form part of any arterial drainage scheme under the auspices of this office.  Local flooding issues are a matter, in the first instance, for each local authority to investigate and address. For areas not covered by the Arterial Drainage Maintenance Programme, the OPW operates a Minor Flood Mitigation Works and Coastal Protection Scheme. It is open to all Local Authorities to submit a funding application under the Scheme. This administrative Scheme’s eligibility criteria, including a requirement that any measures are cost beneficial, are published on the OPW website, www.opw.ie. Any application received is considered in accordance with the scheme eligibility criteria, and having regard to the overall availability of resources for flood risk management. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-27",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-05-27",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/mul@/dbsect_107.xml"
            }
          },
          "debateSectionId": "dbsect_107",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/dbsect_107",
          "showAs": "SOLAS Training and Education Programmes "
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-27/pq_108",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 108,
        "showAs": " 108. Deputy Norma Foley asked the Minister for Education and Skills if Safe Pass training has resumed; the date for it to resume; and if Safe Passes that have expired have been extended. [8095/20] ",
        "answerText": " Minister of State at the Department of Education and Skills (John Halligan)  I propose to take Questions Nos. 101, 104, 105, 108, 191, 238 and 291 together.  Under the Safety, Health and Welfare at Work (Construction) Regulations 2013, construction workers in Ireland are legally bound to hold a valid Safe Pass Registration Card. The Minister for Business, Enterprise and Innovation recently amended these regulations to extend the validity of Safe Pass cards with an expiration date after the 1st March 2020 for the duration of the Covid-19 emergency period.  The delivery of Safe Pass courses is currently suspended in accordance with public health measures. SOLAS has examined the potential for online delivery as a means of continuing national construction health and safety courses while adhering to public health measures. No immediate solution has been identified that is equitable with the existing Safe Pass course delivery model, in being accessible to all eligible workers, provides real time course participants supports (literacy and numeracy) and interpreter services, as well as ensuring assessment integrity.  The timeline for return of Safe Pass training is under consideration, informed by public health advice. Contingency plans are also being put in place to support delivery of Safe Pass training within health and social distancing guidelines once restrictions are lifted. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-27",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-05-27",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/mul@/dbsect_208.xml"
            }
          },
          "debateSectionId": "dbsect_208",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/dbsect_208",
          "showAs": "Student Accommodation"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-27/pq_286",
        "to": {
          "roleType": null,
          "showAs": "Education",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 286,
        "showAs": " 286. Deputy Norma Foley asked the Minister for Education and Skills the action he will take with operators of student accommodation to seek refunds for students who left the accommodation on the instruction of his Department on 12 March 2020. [8098/20] ",
        "answerText": " Minister for Education and Skills  I propose to take Questions Nos. 231 and 286 together.  My Department is working with representatives from the higher education sector to address the challenges faced by students in this difficult time. I understand, based on the information available to me, that the majority of students in university-owned accommodation will receive pro-rata refunds if they have vacated their accommodation. While I would wish to see this principle applied in the case of students who were residing in privately owned student accommodation also, it is not within the remit of my Department to direct any accommodation provider to offer a refund. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-27",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-05-27",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/mul@/dbsect_409.xml"
            }
          },
          "debateSectionId": "dbsect_409",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/dbsect_409",
          "showAs": "Covid-19 Pandemic"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-27/pq_471",
        "to": {
          "roleType": null,
          "showAs": "Business",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 471,
        "showAs": " 471. Deputy Norma Foley asked the Minister for Business, Enterprise and Innovation when casual traders can return to work. [8100/20] ",
        "answerText": " Minister for Business, Enterprise and Innovation  The Government’s Roadmap for Reopening Society and Business sets out five stages for unlocking the restrictions put in place to contain the Coronavirus, at three week intervals. The Roadmap sets out how we can keep the level of transmission of COVID-19 as low as possible while balancing continuing restrictions in proportion with the positive social and economic benefits which will be brought about by businesses reopening. It is important to note that all decisions taken by Government on the timing of any lifting of restrictions as envisaged in Phases 2 to 5 of the Roadmap will be guided by the public health advice at the time.  On 15th May the Government announced that we would move to Phase 1 of the Roadmap from Monday May 18th. This is in line with advice received from the National Public Health Emergency Team (NPHET). The categories of workers, list of retailers and other facilities that can reopen under Phase 1 are available on the Government’s website gov.ie.  Businesses should review the Roadmap carefully and carry out a detailed assessment of their activities with regard to the continuing public health measures. Businesses should, based on their assessment, identify which category in which phase of reopening they will be in a position to reopen safely and in line with the continued public health measures. It is not necessary for businesses to seek official authorisation to reopen.  The National Return to Work Safely Protocol is a useful guide for businesses in making their assessments and adapting their workplace procedures and practices to comply fully with the COVID-19 related public health protection measures. It sets out in very clear terms for employers and workers the steps that they must take firstly before a workplace reopens, and then while it continues to operate.   The Protocol is available at https://dbei.gov.ie/en/Publications/Return-to-Work-Safely-Protocol.html.  The Health and Safety Authority, which is an agency of my Department, is the lead agency in overseeing compliance with the Protocol in the workplace. If employers or employees need further guidance on the Protocol, the HSA Helpline can be contacted at 1890 289 389 or wcu@hsa.ie.  In order to assist businesses to address the challenges posed by COVID-19, the Government has put in place a comprehensive suite of supports for firms of all sizes, which includes the wage subsidy scheme, grants, low-cost loans, write-off of commercial rates and deferred tax liabilities. These supports are designed to build confidence, to further assist businesses in terms of the management of their companies and to allow them to begin looking to the future and start charting a path forward for weeks and months ahead . For a full list of supports for business please see https://dbei.gov.ie/en/What-We-Do/Supports-for-SMEs/COVID-19-supports/.  On 8th May the Government agreed details of a further support which will give direct grant aid to micro and small businesses to help them with the costs associated with reopening and re-employing workers following COVID-19 closures. The Restart Grant is available to businesses with a turnover of less than €5m and employing 50 people or less, which were closed or impacted by at least a 25% reduction in turnover out to 30th June 2020. It is a contribution towards the cost of re-opening or keeping a business operational and re-connecting with employees and customers. The grant is equivalent to the rates bill of the business in 2019, with a minimum payment of €2,000 and a maximum payment of €10,000.  I recognise the impact that this pandemic is having on businesses right across the country. I know that employers and employees want to get back to work and I support them in that ambition, but it must be safe to do so. My Department contributed to the considerations around the phased re-opening of sectors and I will work within Government to secure further details and clarity for businesses as we progress through the phases outlined in the Roadmap.  A wide range of stakeholders including employers, unions and representative groups were consulted and their advice formed part of the considerations when drawing up the Roadmap. It is a living document and Government has the ability to amends its plans depending on the circumstances existing as we progress through each phase. It will be subject to regular review in the context of the progression or suppression of the disease in Ireland or new guidance or research that emerges from other sources. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-27",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    },
    {
      "contextDate": "2020-05-27",
      "question": {
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/mul@/dbsect_410.xml"
            }
          },
          "debateSectionId": "dbsect_410",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2020-05-27/writtens/dbsect_410",
          "showAs": "Covid-19 Pandemic Supports"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2020-05-27/pq_472",
        "to": {
          "roleType": null,
          "showAs": "Business",
          "uri": null,
          "roleCode": null
        },
        "questionNumber": 472,
        "showAs": " 472. Deputy Norma Foley asked the Minister for Business, Enterprise and Innovation the supports in place to benefit bus and coach operators that are parked up as a result of the Covid-19 pandemic. [8101/20] ",
        "answerText": " Minister for Business, Enterprise and Innovation  In order to assist businesses to address the challenges posed by COVID-19, the Government has put in place a comprehensive suite of supports for firms of all sizes, which includes the wage subsidy scheme, grants, low-cost loans, write-off of commercial rates and deferred tax liabilities.  These supports are designed to build confidence, to further assist businesses in terms of the management of their companies and to allow them to begin looking to the future and start charting a path forward for weeks and months ahead . For a full list of supports for business please see https://dbei.gov.ie/en/What-We-Do/Supports-for-SMEs/COVID-19-supports/ .  The full range of Enterprise Ireland, Local Enterprise Office (LEO) and Údarás na Gaeltachta grant and advisory supports continue to be available to eligible firms to help with strategies to access finance, commence or ramp-up online trading activity, reconfigure business models, cut costs, innovate, diversify markets and supply chains and to improve competitiveness.  In that regard, Government will continue to explore funding potential for all enterprises including micro-enterprises as they work through the challenges facing them, including through any mechanisms allowable through the EU’s state aid framework.  For bus and coach operators, the SBCI Covid-19 Working Capital Scheme was announced on 11 March and opened for eligibility applications on 23 March. The Covid-19 Working Capital Scheme is offered by my Department in cooperation with the Department of Agriculture, Food and the Marine, and is supported by the InnovFin SME Guarantee facility. The scheme is operated by the SBCI. It currently makes available a fund of up to €200 m to eligible businesses that have been negatively affected by impacts arising from the outbreak of Covid-19 to enable those businesses to innovate, change or adapt in response to the current business environment. Following my further announcement on April 8 this Scheme is now being expanded to make available an additional €250 million in lending, which will bring the total amount of lending available under this scheme to €450 million.  The Future Growth Loan Scheme makes up to €300 million of loans available with a term of 8-10 years and is operated by the Strategic Banking Corporation of Ireland (SBCI) though participating lenders. We have seen strong demand for the scheme since its launch in April 2019 across all sectors and regions including in exporting businesses and family businesses.  These measures are in addition to the €150m of funding capacity in the Government’s Credit Guarantee Scheme, which is available to bus and coach operators.  For microenterprises (under 10 employees), Microfinance Ireland (MFI) are administering special COVID-19 Loans, with an additional €13m in capital support bringing its total lending capacity up to €20m for the coming period. There is also a substantial reduction in interest rates on these loans from 7.8% to 4.5%. Loans can be made up to €50,000 with no repayments required and no interest charged in the first six months.  I can assure the Deputy that I continue to work with my colleagues across Government to examine further appropriate supports to assist businesses impacted by Covid-19.  My colleague, Minister Shane Ross T.D., Minister for Transport, Tourism and Sport may be able to provide more specific guidelines or supports designed to suit your particular business. ",
        "questionType": "written",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/33",
          "chamberType": "house",
          "committeeCode": "",
          "showAs": "33rd Dáil",
          "houseNo": "33",
          "houseCode": "dail"
        },
        "date": "2020-05-27",
        "by": {
          "showAs": "Norma Foley",
          "memberCode": "Norma-Foley.D.2020-02-08",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Norma-Foley.D.2020-02-08"
        }
      }
    }
  ]
}