{
  "head": {
    "counts": {
      "questionCount": 249,
      "resultCount": 249
    }
  },
  "results": [
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 50. Deputy Brian Brennan asked the Minister for Children, Disability and Equality the steps she is taking to alleviate the concerns of an organisation (details supplied) ahead of the introduction of new regulations; and if she will make a statement on the matter. [73190/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "showAs": "Brian Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_92",
          "debateSectionId": "dbsect_92",
          "showAs": "Legislative Measures",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_92.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_50",
        "questionNumber": 50
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 77. Deputy Brian Brennan asked the Minister for Children, Disability and Equality if she will consider regularising pay and pensions for creche and early years educators on an annualised basis; and if she will make a statement on the matter. [73262/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "showAs": "Brian Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_121",
          "debateSectionId": "dbsect_121",
          "showAs": "Childcare Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_121.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_77",
        "questionNumber": 77
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  The Warmer Homes Scheme aims to improve the energy efficiency and warmth of homes owned by people at risk of energy poverty by providing fully funded retrofits. The scheme is operated by the Sustainable Energy Authority of Ireland (SEAI) on behalf of my Department and is funded through carbon tax receipts and the European Regional Development Fund.  Increased awareness of the multiple benefits of retrofit and improvements to the Warmer Homes Scheme is driving increased levels of demand for the scheme. The increase in depth of retrofit to an average value of just over €29,000 per home is also reflected in the waiting times as more significant works take a longer time per home to complete.  The average waiting time under the scheme, from application to completion of upgrade works, to date in 2025, was 21 months for the worst performing homes. The represents a decrease from an average of 26 months for homes completed in 2022.  The reduction in waiting times follows a range of measures introduced by my Department and the SEAI, including: the allocation of additional staff to the scheme; a significantly increased budget allocation; active contract engagement and management by the SEAI to increase contractor output; as well as actions to address ongoing supply chain pressures.  Importantly, the SEAI have recently launched, on 8 December, a procurement process to establish a new €1.2 billion contractor panel to be in place in Q2 next year. This will support continued growth with a focus on scale, quality and output under the scheme.  Delivering free energy upgrades to low-income households and reducing the waiting times for the Warmer Homes Scheme is a key priority for my Department and the SEAI. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 121. Deputy Brian Brennan asked the Minister for Climate, Energy and the Environment the efforts being made to reduce the waiting time for people who have applied for the warmer homes scheme; and if he will make a statement on the matter. [73221/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "showAs": "Brian Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_152",
          "debateSectionId": "dbsect_152",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_152.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_121",
        "questionNumber": 121
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  My Department chairs the Offshore Wind Delivery Taskforce (OWDT) and the Accelerating Renewable Electricity Taskforce (ARET) which bring together the key stakeholders, including the Department of Housing, Local Government and Heritage and the regulators, CRU and MARA, to ensure a cohesive approach to policymaking, designed to reduce the barriers facing renewable electricity generation projects. The 2025/26 Key Actions for the OWDT and ARET were published in June and July.  Under the aegis of the ARET, a number of dedicated working groups operate to ensure that permitting processes and spatial planning for renewables meet the requirements of relevant EU Regulations/Directives including the Renewable Energy Directive as well as ensuring that the statutory planning policy hierarchy supports the delivery of the national renewable electricity targets for onshore wind and solar PV. The Minister for Housing, Local Government, and Heritage has responsibility for planning matters.  In September, the Offshore Wind Energy Clearing House was established to build on the work of the OWDT and directly address identified barriers to the delivery of our offshore renewable energy sector.  In addition, the Minister for Public Expenditure, Infrastructure, Public Service Reform, and Digitalisation established the Accelerating Infrastructure Taskforce in May this year, to support the unblocking of barriers and accelerating infrastructure delivery. On 3 December, Government published the Accelerating Infrastructure Report and Action Plan to help drive the efficient delivery of infrastructure across Ireland, which includes 30 actions designed to remove barriers. This report will support the work of the ARET and the Offshore Wind Clearing House and the Department of Climate, Energy and the Environment will furthermore support its delivery. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 165. Deputy Brian Brennan asked the Minister for Climate, Energy and the Environment the steps he is taking to remove bureaucracy and red tape for the progress of infrastructural developments, such as wind and solar energy projects, designed to assist in meeting climate targets; and if he will make a statement on the matter. [73218/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "showAs": "Brian Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_192",
          "debateSectionId": "dbsect_192",
          "showAs": "Energy Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_192.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_165",
        "questionNumber": 165
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 540. Deputy Brian Brennan asked the Minister for Social Protection when the carer's allowance payment and arrears will be issued to a person (details supplied) following successful appeal; and if he will make a statement on the matter. [73399/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "showAs": "Brian Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_512",
          "debateSectionId": "dbsect_512",
          "showAs": "Social Welfare Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_512.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_540",
        "questionNumber": 540
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  School secretaries and caretakers are at the heart of the school and are the key interface between students, parents, school leaders and other staff. Without them, our schools would be unsustainable. In supporting these vital school staff members, we also support the school community as a whole.  My Department has been engaging with Fórsa and the Department of Public Expenditure, Infrastructure, Public Service Reform and Digitalisation over the past number of weeks under the auspices of the Workplace Relations Commission in relation to a number of claims including a claim for a comparable pension entitlement.  The matter has now been referred to the Labour Court, and a hearing will take place on 12th January 2026. The parties remain in process, and my department remains committed and ready to engage with Fórsa to reach a resolution on this important matter.  As with any industrial relations process, where engagement is sensitive and complex, the matters under discussion are confidential until this process concludes. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 231. Deputy Brian Brennan asked the Minister for Education and Youth for an update on discussions with school secretaries and caretakers; and if she will make a statement on the matter. [72703/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "showAs": "Brian Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_214",
          "debateSectionId": "dbsect_214",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_214.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_231",
        "questionNumber": 231
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  For former apprentices who wish to seek proof that they successfully completed their apprenticeship, SOLAS’s recommended course of action is to apply for a Record of Attainment. An individual seeking this should contact their local Education and Training Board (ETB) and Training Advisor, who will provide the application form and explain the application process. In this case, I note from the details supplied that the relevant ETB has provided this form, along with instructions for apprentices who completed an apprenticeship after the 31st of August 1986 in requesting their Record of Attainment. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 441. Deputy Brian Brennan asked the Minister for Further and Higher Education, Research, Innovation and Science further to Parliamentary Question No. 960 of 25 November 2025, if assistance can be offered to a person (details supplied) with getting access to a statement of results; and if he will make a statement on the matter. [72702/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "showAs": "Brian Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_392",
          "debateSectionId": "dbsect_392",
          "showAs": "Departmental Correspondence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_392.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_441",
        "questionNumber": 441
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  The School Transport Scheme is a significant operation managed by Bus Éireann on behalf of the Department of Education and Youth.  The scheme has expanded significantly over the past six years. In that time, the numbers of children and young people using the service have grown from under 120,000 pupils in 2018 to over 180,000 pupils in 2025, which equates to an increase of close to 50%.  Under the current terms of the schemes, children are eligible for transport at primary level where they reside not less than 3.2 kilometres from and are attending their nearest primary school, and at post primary level where they reside not less than 4.8 kilometres from and are attending their nearest post primary school/education centre as determined by the Department/Bus Éireann, having regard to ethos and language.  Any pupils/students who do not meet these criteria are deemed not eligible, or otherwise known as concessionary applicants, and are allocated a ticket based on the availability of a seat when all eligible children have been catered for. Where demand exceeds available tickets, Bus Éireann will allocate tickets using an agreed selection process.  Bus Éireann has advised that pupils in the Aughrim and Annacurra areas are considered concessionary to Coláiste Bhríde Carnew. Currently there are 3 services operating from these areas.  The School Transport 2030 report was published in early 2024 following a comprehensive analysis and review of the scheme as it currently operates. The recommended changes to the schemes include expansion of the current eligibility criteria, addressing current operational challenges and moving towards better integration with public transport to ensure the best value for money to the Exchequer. It is proposed to expand access to the scheme so that an additional 100,000 pupils can be carried by 2030. It was outlined at the time of the review’s publication that due to the scale of the scheme it would be prudent to implement the changes on a phased basis.  A phased implementation of the review’s recommendations began at the start of the 2024/2025 school year in conjunction with the Department of Transport and Bus Éireann.? A total of 14 pilot projects took place that year and will continue for the 2025/2026 school year.  Following the closing date for payment for the 2025/2026 school year the Department, in collaboration with Bus Éireann, assessed where dedicated school transport/pilots may be successfully delivered, and a further 11 pilots were approved. The Department has asked Bus Éireann to review where additional capacity may be available for concessionary pupils who paid on time and would become eligible if the revised school transport scheme criteria was rolled out in full.  Due to ongoing challenges in the wider transport sector, including availability of drivers and vehicles, any expansion of services must be carefully planned and phased. While pilot projects are being considered in select areas to test revised eligibility criteria, these pilots are limited in scope and capacity.  All pilots – including those which commenced in the 2024/2025 school year – are being monitored and a further evaluation will take place at the end of the 2025/2026 school year. Findings from these evaluations will guide the planning and implementation needed for a national rollout of a revised School Transport Scheme.  Implementation of the recommendations of the review will continue to be planned subject to resources being available to meet the increased demand. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 519. Deputy Brian Brennan asked the Minister for Education and Youth if additional school transport pilot routes have been added for the 2026-2027 school year to further expand the rollout of the scheme and to address identifiable need in hotspot areas where concessionary demand is greatest, such as students attending a school (details supplied) from the Annacurra and Aughrim area; and if she will make a statement on the matter. [72524/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "showAs": "Brian Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_408",
          "debateSectionId": "dbsect_408",
          "showAs": "School Transport",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_408.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_519",
        "questionNumber": 519
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  Funding for sports facilities in schools is primarily a matter for the Department of Education and Youth.  Third level colleges, Education and Training Boards and schools are eligible to apply to my Department's Community Sport Facility Fund (CSFF) jointly with sports clubs. Such applications must provide evidence of facility-sharing arrangements that will allow sports clubs to use the proposed facilities throughout the year when not in use by the school.  In line with previous rounds of the Fund, a review of the current funding round is being undertaken.  I have asked my Department to prepare for a further round of the CSFF in 2026. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 533. Deputy Brian Brennan asked the Minister for Culture, Communications and Sport the conditions under which a school can apply for sports capital funding; and if he will make a statement on the matter. [71815/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "showAs": "Brian Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_417",
          "debateSectionId": "dbsect_417",
          "showAs": "Sports Funding",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_417.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_533",
        "questionNumber": 533
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Agriculture, Food and the Marine  The Protection of the Native Irish Honey Bee Bill 2021 which is a Private Members Bill is currently before Dáil Éireann, Second Stage. The Bill seeks to ban the importation of non native honey bees. Progression of the Bill through Dáil Éireann is subject to the procedures of the Oireachtas.  When the Bill was proceeding through the Seanad my Department raised some concerns in relation to imposing a statutory ban on the importation of non-native honey bees as it could constitute a restriction on trade under EU Regulations.  Following advice received from the Office of the Attorney General, my Department procured independent scientific evidence and in October 2023, a 12 month contract was signed with the National University of Ireland, Galway for the provision of research services on the native Irish honey bee (Apis mellifera mellifera).  The research work concluded in December 2024, and the research report was subsequently evaluated by an external expert. Following the completion of the evaluation the research service provider (NUIG) was afforded the opportunity to respond to the evaluator’s comments. This process has recently concluded and is under consideration. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 774. Deputy Brian Brennan asked the Minister for Agriculture, Food and the Marine for an update on the enactment of the Native Irish Honeybee Bill 2021 to ensure the protection of native species; and if he will make a statement on the matter. [71810/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "showAs": "Brian Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_615",
          "debateSectionId": "dbsect_615",
          "showAs": "Agriculture Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_615.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_774",
        "questionNumber": 774
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  I propose to take Questions Nos. 22, 23, 29, 32, 38, 54, 57, 66, 74, 78, 79 and 80 together.  Last week, the Government published the Accelerating Infrastructure Report and Action Plan. This is a comprehensive programme of actions designed to speed up the delivery of critical infrastructure across the State. This Action Plan responds to well-documented challenges of lengthy development timelines, fragmented processes, and rising costs. These have all been identified as major barriers to achieving Ireland’s housing, energy, and climate objectives.  The report is evidence-based. It has been built on the research and analysis of my Department, the views received during the public consultation and stakeholder engagement undertaken by my Department over the summer, and the expert input and advice from the members of the Accelerating Infrastructure Taskforce.  The Plan sets out 30 targeted actions grouped under four pillars, each addressing a key area of reform. The actions address the twelve barriers to the timely delivery of infrastructure that were highlighted in the Report on Stakeholder Consultation and Engagement with Emerging Themes on Infrastructure , published by my department in July.  A four-week online and in-person public consultation last summer supported the preparation of that Report published in July, by providing an opportunity for stakeholders and the general public, from across the country, to feed into this work. I hosted events during this consultation period, including a regional event in Athlone.  The actions selected represent a transformative approach to streamlining development processes and significantly reducing delivery timelines, ensuring a more efficient and timely delivery of critical infrastructure nationwide.  Together, these actions will ensure that the record investment under the National Development Plan (NDP) translates into faster, more efficient delivery of housing, energy, and transport infrastructure, supporting Ireland’s economic growth, climate commitments and Delivering Homes, Building Communities. This will benefit every county and region of Ireland as infrastructure projects play an essential role in supporting Ireland’s balanced economic growth across all local areas and meeting the demands of a rapidly expanding population. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 66. Deputy Brian Brennan asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation if specific emphasis will be placed on accelerating infrastructural development in towns and villages where current infrastructure does not match existing need and plans for future growth; and if he will make a statement on the matter. [70626/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "showAs": "Brian Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_67",
          "debateSectionId": "dbsect_67",
          "showAs": "Strategic Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_67.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_66",
        "questionNumber": 66
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " An Leas-Cheann Comhairle  Deputy Timmins is taking this question. \n Deputy Edward Timmins  For Deputy Brennan, yes. There are four schools in Wicklow under Project Dargle: St. Kevin's Community College, Dunlavin; Coláiste Bhríde, Carnew; Arklow CBS; and Avondale Community College in Rathdrum. These schools are all in need of the proposed development. The areas they serve are growing in population. With the new, hugely increased housing targets for County Wicklow, these developments are needed more than ever. What is the current status of these builds? \n Deputy Michael Moynihan  Since 2020, the Department of education has invested over €6 billion in school projects throughout the country under the national development plan, involving the completion of over 1,300 school building projects. Over €159 million has been invested in schools across County Westmeath and €234 million in schools across County Wicklow in that period.  Project Dargle, the project bundle referred to by the Deputy, comprises seven post-primary schools in Westmeath and Wicklow devolved for delivery to the National Development Finance Agency, NDFA. These school building projects are flagship projects and will provide new, modernised, high-quality, permanent facilities catering for almost 6,000 students. This will transform the education infrastructure for these school communities now and in the decades ahead, enabling students to benefit from purpose-built facilities.  All seven schools are at stage 2b of the architectural design process. This is an important stage which allows for detailed design and planning, obtaining necessary statutory permissions and preparation of tender documents. Stage 2b is being finalised at the moment. The length of time a project takes to go through each stage varies depending on a number of factors, including scale and complexity.  In July, the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026 to 2030 under the national development plan. As part of this allocation, the Department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to the project's roll-out, the approach will be to continue to maximise the capacity of the existing school estate in the first instance and to provide necessary additional capacity through a targeted and prioritised project roll-out over the course of the 2026 to 2030 period to meet the most urgent and prioritised needs.  The Department will continue to provide guidance and practical support as required. The NDFA will engage directly with school authorities to keep them fully informed. \n Deputy Edward Timmins  With the Minister of State's indulgence, I will go through each of the four schools.  First is St. Kevin's Community College, Dunlavin. Demand for places continues to grow. Planning has been in place for over two years. Dunlavin and its hinterland population continue to grow and the school serves east Kildare as well as west Wicklow. There is a plan for four rooms for special classes. The lack of suitable rooms in the current build means students' options are limited. The library is now a classroom. Computer rooms have been converted to general classrooms.  Second is Avondale Community College in Rathdrum. The new school campus will see capacity at the secondary school increase from 660 to 1,000 students. The school is far over capacity. Many rooms and spaces are no longer fit for purpose but the school cannot invest in upgrades or fixes to classrooms, practical rooms and laboratories. This is completely stalled. They are waiting on the new build. \n Deputy Michael Moynihan  I thank the Deputy for his ongoing interest in these projects across Wicklow. Wicklow is one of the major challenges we have in terms of school capacity each year. At post-primary level, there is always a challenge. The projects are at stage 2b, with full planning permission granted. I have had a number of conversations with Deputies this morning about projects where planning permission is awaited but in these cases it has been granted.  I take the points the Deputy made about capacity issues in Dunlavin, Rathdrum and across Wicklow. It is great to see there will be four additional special classrooms in St. Kevin's Community College. This is what we need for an integrated policy. It is at stage 2b and is being finalised at the moment. I will ensure the Department and everybody concerned works closely to finalise it as fast as possible. \n Deputy Edward Timmins  Coláiste Bhríde, Carnew, is a special case. It seeks inclusion of a playing pitch with the building project. The new school will have a capacity for 1,000 students but there is no playing pitch included.  The school currently has the land required and planning permission but the key issue is the cost of levelling the site. It put a proposal to the NDFA for pitch groundworks, which was rejected, but it still hopes the Department will reconsider. The current building at Arklow CBS is simply unfit for purpose.  There is a project, for which we have been promised a sod-turning next May, in Blessington Community College in west Wicklow. That project has been put back on a number of occasions. The school is currently full of prefabs. It desperately needs a school building in what is a massively growing town just 19 miles from where we sit today. I ask that this project move to final tender stage and a contractor be appointed as soon as possible. \n Deputy Ruairí Ó Murchú  We know there is a particular issue in relation to planning for school builds. There is a lack of flexibility in the system and there needs to be a greater level of agility. I brought this issue up previously with regard to Ardee Educate Together National School. It is a national school and a great build but the problem is there are 21 parking spaces and double that number are needed. There are only two set-down places for minibuses for children with disabilities who are brought to the school and there is a need for five. There is a lot of space to do this but building is about to continue, which means that when the situation is eventually resolved, it will be a lot more costly. Engagement is needed between Louth County Council, the design team, contractors and the Department. If an official could come back to me with a response, we could get a solution for the school. \n Deputy Michael Moynihan  I would appreciate if Deputy Ó Murchú could pass me the roll number of the school. We will then take up the matter and I will see what we can do with it.  On the school in Blessington, I do not have the details to hand but we will come back to Deputy Timmins on it. I take his point in relation to the sod-turning and so forth. There is nothing more frustrating than commitments being given and deadlines being passed.  On the schools in Carnew and Arklow, these are parts of projects that have been delivered under the NDFA. With regard to the level of commitment by the Department to move these projects on under a new system, this will be very informative for the Department into the future.  Deputy Timmins asked about the project in Carnew. I will come back to him on that. The Department does not have a bottomless pot of money. There is a lot of pressure on the system, particularly in Wicklow, with regard to school places. I will endeavour to get a more detailed response for the Deputy on the issues he raised. Suffice to say, these projects are bundled together and we are committed to working through them. ",
        "questionType": "oral",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 99. Deputy Brian Brennan asked the Minister for Education and Youth the position regarding a school (details supplied); and if she will make a statement on the matter. [70576/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "showAs": "Brian Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/dbsect_29",
          "debateSectionId": "dbsect_29",
          "showAs": "Schools Building Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/debate/mul@/dbsect_29.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_99",
        "questionNumber": 99
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Education and Youth  Enabling students with special educational needs to receive an appropriate education is a priority for this Government. It is also a key priority for me, my department and for the National Council for Special Education (NCSE).  The vast majority of students with special educational needs are supported to attend mainstream classes with their peers. Where students with more complex needs require additional supports, special class and special school places are provided. This is in keeping with policy on an inclusive education, which promotes that students will be supported to receive an education in the most inclusive setting possible.  In 2026, over €3 billion will be spent supporting students with special educational needs. It will ensure that specialist capacity continues to grow by providing 3,000 specialist places. The majority of these places will be available in special classes within mainstream schools. In addition this funding provides for an increase our special educational posts by 860 special education teacher and over 1,700 special needs assistant (SNA) posts. This will mean we will have almost 46,000 professionals dedicated to supporting students with special educational needs in our schools. This is one of the highest annual increases in posts to date and demonstrates this government’s commitment to supporting students with special educational needs.  Budget 2026 has also provided for a number of new initiatives such as funding for the roll out of the Education Therapy Service (ETS), the introduction of extra special education teaching hours for post-primary schools to support coordination and transition efforts and a special school package to support the unique challenges these schools face.  The Department of Education and Youth and the NCSE will also, this year, look at the profile of existing special schools. This work will ensure children and young people with complex educational needs can apply to their local special school and not have to travel long distances to access an appropriate education.  In order to support the NCSE and forward planning my department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE that they are seeking a special educational placement for their child.  The NCSE is currently collating the data and information received by 1 October through the Parents Notify process and are engaging with schools regarding where specialist provision is best placed for the 2026/27 school year. It is expected that many of these special classes will be sanctioned by 31 December 2025.  My department and the NCSE are committed to delivering an education system that is of the highest quality and where every child and young person feels valued and is actively supported and nurtured to reach their full potential. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 178. Deputy Brian Brennan asked the Minister for Education and Youth her plans for the introduction of additional special classes and supplementary supports for children with special educational needs where existing services are not currently sufficient; and if she will make a statement on the matter. [70589/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "showAs": "Brian Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_202",
          "debateSectionId": "dbsect_202",
          "showAs": "Special Educational Needs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_202.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_178",
        "questionNumber": 178
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Health  The HSE operates the EU Treatment Abroad Scheme (TAS), for persons entitled under EU Regulation 883/04. The TAS is a consultant led scheme and allows for an Ireland-based public consultant to refer a public patient who is normally resident in Ireland for treatment in the public healthcare system of another EU member state, the UK or Switzerland. Subject to the EU Regulations and Guidelines, the TAS provides for the cost of approved public treatments in another EU/EEA member state, the UK or Switzerland through the issue of form S2 (IE) where the treatment is:  • among the benefits provided for by Irish legislation;  • not available in Ireland;  • not available within the time normally necessary for obtaining it in Ireland, taking account of the patient's current state of health and the probable course of the disease;  • medically necessary and will meet the patient’s needs;  • a proven form of medical treatment and not experimental or test treatment;  • provided in a recognised public hospital or other institution that will accept EU/EEA form S2 (IE) and;  • is under the control of a registered medical practitioner.  The HSE provides further information for patients on the HSE TAS website: www2.hse.ie/services/schemes-allowances/treatment-abroad-scheme/.  It is important to note that the EU Treatment Abroad Scheme facilitates patient to access planned healthcare in the public healthcare system of another EU/EEA member state, the UK or Switzerland. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 561. Deputy Brian Brennan asked the Minister for Health the assistance available to a person (details supplied) to access surgery abroad to provide treatment not offered in Ireland for a life threatening condition; and if she will make a statement on the matter. [70925/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "showAs": "Brian Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_532",
          "debateSectionId": "dbsect_532",
          "showAs": "Departmental Functions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_532.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_561",
        "questionNumber": 561
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The Help to Buy (HTB) incentive, is a scheme to assist first-time purchasers with the deposit they need to buy or build a new house or apartment. It also aims to encourage additional supply of new houses by supporting demand.  HTB provides a refund of Income Tax and Deposit Interest Retention Tax (DIRT) paid in Ireland over the previous four years, subject to limits outlined in the legislation.  The level of support available to first time buyers under the HTB scheme, is whichever is the lesser of:  • €30,000; or  • 10 per cent of the purchase price of the new property; or,  • the amount of Income Tax and DIRT paid in the four years before application for the relief.  Based on the latest available data (30 November 2025), the scheme has supported over 61,000 individuals or couples to buy or build their own home.  A comprehensive independent review of the scheme was carried out by external consultants in 2022. While this review included a number of recommended amendments to the scheme, it did not recommend an increase to the €500,000 house price limit.  The Programme for Government commits to the retention and revision of the HTB scheme. As the Deputy will appreciate, any revisions to the scheme would have to take into account the effective operation of the scheme and the impact any proposed changes would have on the broader housing market, as such these matters will remain under review. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 316. Deputy Brian Brennan asked the Tánaiste and Minister for Finance if future changes to the help-to-buy scheme are being considered to increase the completed price limit, taking into account huge increases in building costs; and if he will make a statement on the matter. [69791/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "showAs": "Brian Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_282",
          "debateSectionId": "dbsect_282",
          "showAs": "Housing Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_282.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_316",
        "questionNumber": 316
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for children with special educational needs.  It is important to remember that the majority of children with special educational needs are supported to attend mainstream schools with their peers. For children with more complex educational needs special classes can be provided and for children with the most complex educational needs a special school place can be provided.  In order to support the NCSE and forward planning my department published Circular 0039/2025. This circular informs school management and patrons of measures introduced to support forward planning and reiterates the need for parents to inform the NCSE that they are seeking a special educational placement for their child. An earlier date of 1 October was set for parents to do so.  This notification process will provide the NCSE with valuable information as to which children will continue to require a special class as they progress to post-primary level and details on students who require a place for the first time.  The earlier date will allow for earlier sanctioning of classes for the 2026/27 school year, and it is the aim of the NCSE to sanction the majority of new special classes by 31 December 2025.  The NCSE will have a clear picture of the local demand for special class places for the 2026/2027 school year after they review and assess all of the information which has been provided through the parents' notification process which closed on 1 October.  Once the NCSE has fully collated and assessed this information, the NCSE will be in a position to engage with schools across the country to open new special classes. The NCSE will also have due regard to any vacant places in existing special classes in an area and any places that will become available through the normal movement of children leaving primary or post-primary school.  I would like to stress that the NCSE will continue to support all children made known to them after the October deadline also, however, it is important for planning purposes that we set an earlier timeframe for which the NCSE has as much local knowledge and detail as possible in order to plan what new provision is required.  My department and the NCSE continue to forward plan to provide further new special schools and expand existing special schools where there is a need for additional capacity.  My department and the NCSE are committed to ensuring that sufficient special education placements remain available for children with special educational needs and will continue to review and monitor the situation, including in County Wexford and engage with relevant schools in this regard. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 389. Deputy Brian Brennan asked the Minister for Education and Youth for an update on future expansion and admission plans for a school (details supplied); and if she will make a statement on the matter. [69134/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "showAs": "Brian Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_349",
          "debateSectionId": "dbsect_349",
          "showAs": "School Management",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_349.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_389",
        "questionNumber": 389
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  On 25 April 2023, the Government approved additional measures under the Housing for All Action Plan to incentivise the activation of increased housing supply and help reduce housing construction costs, including the introduction of temporary time-limited arrangements for the waiving of local authority “section 48” development contributions and the refunding of Uisce Éireann water and waste water connection charges.  The Government recognised that measures needed to be put in place to help address cost and viability with a view to incentivising the activation of a pipeline of new housing commencements, and assisting in the delivery of supply as quickly as possible. The waiver scheme applied to all permitted residential development including multi-unit developments, self-build houses and one-off houses, student accommodation and sheltered housing.  The schemes initially applied for one year to all permitted residential development that commenced on site between 25 April 2023 (the date of the Government Decision approving the measure) and 24 April 2024, and that are completed not later than 31 December 2025. On 23 April 2024, the Government approved an extension for the waiving of local authority “section 48” development contributions in respect of residential development commenced not later than 31 December 2024 and the refunding of Uisce Éireann water and waste water connection charges in respect of residential development commenced not later than 30 September 2024.  In April 2024, the final date for the completion of development works on qualifying houses under the schemes was extended from 31 December 2025 to 31 December 2026. There are no plans to extend or re-introduce the waiver scheme.  The new national housing plan  Delivering Homes, Building Communities, was  published on 13 November 2025 . It is a wide-ranging action plan focused on activating housing supply and targeting homelessness. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 505. Deputy Brian Brennan asked the Minister for Housing, Local Government and Heritage if his Department has any plans to reinstate the development contribution waiver scheme; if there are other incentives being considered for those who wish to commence building within the next year; and if he will make a statement on the matter. [69786/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "showAs": "Brian Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_440",
          "debateSectionId": "dbsect_440",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_440.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_505",
        "questionNumber": 505
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Transport  The improvement and maintenance of regional and local roads is the statutory responsibility of each local authority, in accordance with the provisions of Section 13 of the Roads Act 1993. Works on those roads are funded from Councils' own resources supplemented by State road grants. The initial selection and prioritisation of works to be funded is a matter for the local authority.  There has been a significant increase in Exchequer funding in recent years with an Exchequer investment of €713 million in our regional and local roads this year. This represents an increase of 25% in funding when compared to 2021.  As regards Wexford County Council's 2025 allocation of €23,310,350 compared to the 2024 allocation of €23,437,550, this is due to the fact that following Storm Babet the Council was allocated €2 million in 2024 for severe weather repair. The allocation in 2025 for severe weather repairs is €700,000.  The National Development Plan Review 2025 sets out capital ceilings for transport to 2030. The Department has recently published the sectoral investment plan for transport which will inform road funding priorities in the coming years.  As regards 2026, regional and local road grant allocations will be finalised following the publication of the Revised Estimates Volume and will take into account the expenditure outturn on projects and programmes in the preceding year. Within the budget available, the objective is to allocate funding to eligible local authorities on as equitable a basis as possible taking the length of the road network into account. The main focus of the grants continues to be the protection and renewal of the regional and local road network. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 115. Deputy Brian Brennan asked the Minister for Transport the provisions in place to provide a catch-up fund for counties like Wexford, to meet the gap in funding and the true cost of maintaining the roads; and if the county will see an increase to the 2026 budget having seen a reduction in 2025; and if he will make a statement on the matter. [67690/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "showAs": "Brian Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_102",
          "debateSectionId": "dbsect_102",
          "showAs": "Road Network",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_102.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_115",
        "questionNumber": 115
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The conditions to be satisfied for payment of means tested payments are outlined in social welfare legislation and include an assessment of means which includes any income or assets which a person owns. In addition, specific legislation held within Part 3 of Rule 2(1) of the Third Schedule of the Social Welfare Consolidation Act 2005 states that where a person has directly or indirectly deprived themselves of any income or property in order to qualify for a payment, or for a higher rate than they would otherwise be entitled, that income or the value of the property shall be taken to be part of the means of that person.  The current legislation does not provide specifically for situations where the deprivation was made a number of years ago, nor does it provide for a time frame for the means derived from such deprivation to cease to apply or be reduced.  However a working group has been established in my department to examine the matter. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 388. Deputy Brian Brennan asked the Minister for Social Protection his plans to introduce legislation that provides for a specific timeframe following which, a previous determination of incomes ceased to apply when the applicant disputes the Department's findings and suffers financial hardship (details supplied); and if he will make a statement on the matter. [68016/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "showAs": "Brian Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_347",
          "debateSectionId": "dbsect_347",
          "showAs": "Legislative Measures",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_347.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_388",
        "questionNumber": 388
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Justice, Home Affairs and Migration  The Accommodation Recognition Payment is a tax-free monthly payment available to those providing accommodation to people who arrived in Ireland under the EU Temporary Protection Directive since March 2022. The scheme, which was introduced in July 2022, is provided for under Part 2 of the Civil Law (Miscellaneous Provisions) Act 2022.  The original scheme termination date was set as 31 March 2023 to align with the duration of temporary protection under Council Directive 2001/55/EC of 20 July 2001, as activated by Council Decision (EU) 2022/382 of 4 March 2022 (www.eur-lex.europa.eu/legal-content/EN/TXT/?uri=CELEX:32022D0382) To date, the scheme has been extended three times to align with previous extensions of the Temporary Protection Directive (TPD), most recently to 31 March 2026. The scheme may be further extended by Ministerial Order, subject to Oireachtas approval and consultation with relevant Ministers.  The monthly contribution rate was originally set at €400 from 4 March 2022. It was then increased to €800 from 1 December 2022 to coincide with the introduction of the ‘Offer a Home’ scheme. The rate was subsequently reduced to €600 from 1 June 2025. This change was one of several measures introduced by my Department to ensure that such temporary and timebound supports for temporary protection beneficiaries from Ukraine are proportionate and equitable.  The future of the ARP will be considered further in the context of the extension of TPD to March 2027 and planning across Government for a coordinated approach to transitioning out of temporary protection having regard to the Council Recommendation of 4 June 2025 in this regard. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 402. Deputy Brian Brennan asked the Minister for Justice, Home Affairs and Migration his plans to ensure continuity of support following the expiry of the accommodation recognition payment scheme in March 2026; and if he will make a statement on the matter. [67534/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "showAs": "Brian Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_361",
          "debateSectionId": "dbsect_361",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_361.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_402",
        "questionNumber": 402
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  SOLAS has advised my officials that there is no dedicated funding stream within the FET sector for the promotion and running of Irish night classes in adult education. However, Education and Training Boards (ETBs) assess the demand for FET programmes to be delivered through Irish within communities and, where practicable, deliver programmes to meet identified needs.  Several ETBs, particularly those servicing Gaeltacht areas, participate in the Breacadh Scheme. Breacadh assists ETBs by producing teaching, learning, and other resources through Irish, and by providing tutor training and curriculum development support. ETBs also offer Irish language classes across a variety of levels on a sessional, part-time and evening class basis. Provision that leads toward accreditation at National Framework for Qualifications (NFQ) Level 3 upwards is available.  In addition, charities and other organisations can apply to their ETB for the Adult Literacy for Life (ALL) Collaboration and Innovation and REACH Funds. This includes Irish language projects and organisations, subject to meeting eligibility criteria. The ALL Collaboration and Innovation Fund supports programmes addressing unmet literacy needs in adults, while REACH primarily seeks to engage disadvantaged learners in adult education. Coiste Forbartha Chnoc Fola and Meitheal Pleanala Teanga an Iarthuaiscirt (MPTIT), for example, received €6,820 this year to provide a nine-week course in digital skills for older adults integrating the Irish language with unmet digital literacy needs.  It is a matter for individual ETBs to make decisions on which providers to fund, through well-established grant application processes, and to programme FET services, in response to local need and within allocated budgets. In line with the functions set out in the Education and Training Board Act of 2013, as Minister, I have no role in such operational matters. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 718. Deputy Brian Brennan asked the Minister for Further and Higher Education, Research, Innovation and Science if there are grants available for the promotion and running of Irish night classes in adult education; and if he will make a statement on the matter. [68140/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "showAs": "Brian Brennan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_645",
          "debateSectionId": "dbsect_645",
          "showAs": "Adult Education Provision",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_645.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_718",
        "questionNumber": 718
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  I propose to take Questions Nos. 21, 23, 41 and 50 together.  At this critical juncture for Ukraine, after almost 4 years of brutal Russian aggression, I want to emphasise Ireland’s unequivocal support and solidarity.  I attended the meeting of the Foreign Affairs Council on 20 November where Ukraine’s Foreign Minister Sybiha spoke about recent Russian attacks against Ukraine. I also participated in a meeting of the Foreign Affairs Council on 26 November, also addressed by Foreign Minister Sybiha.  I welcome the ongoing efforts of President Trump and the United States to end Russia’s war of aggression against Ukraine and achieving a just and lasting peace and security for Ukraine.  It is more important than ever that Europe and the United States continue to work together to achieve this.  The emerging US proposals, as well as plans for further negotiations, represent a step forward. I welcome the progress made at Sunday’s meetings between US and Ukraine in Geneva. We look forward to these talks continuing in a positive manner and to further progress being achieved.  Ukraine is engaging positively and constructively in these discussions despite the ongoing Russian military assault on its towns and cities, ports and critical energy infrastructure.  It is crucial that any agreement upholds Ukraine’s sovereignty and independence based on respect for the principles of the UN Charter. The fundamental principle that borders cannot be changed by force must be upheld.  Any agreement must also protect Ukraine and Europe’s vital security. That means strong, credible guarantees that ensure Ukraine can defend its sovereignty and to avoid a repetition of the past.  This is not just vital for Ukraine - it is also vital for the European Union and all its Member States, including Ireland.  The Taoiseach and I remain in close contact with our European partners to achieve this. The Taoiseach took part in a meeting the European Council on 24 November and a meeting of the leaders of the “Coalition of the Willing” on 25 November.  The threat posed by Russia extends beyond Ukraine. We have recently seen the airspace of our EU partners violated by drones and planes and other hybrid activities within the EU. The Government has strongly condemned these hybrid activities.  The Government takes the risks posed by these activities and the transformed security landscape in Europe very seriously.  We are actively and constructively engaging in the development of EU policies aimed at combatting hybrid threats and in particular Russia’s campaign of hybrid activity against the EU and its Member States.  We will continue to work with our EU partners to strengthen our collective resilience. Domestically, the Government is implementing a range of relevant measures at national level to combat hybrid threats from state and non-state actors. ",
        "to": {
          "showAs": "Foreign",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Brian Brennan",
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_56.xml"
            }
          },
          "debateSectionId": "dbsect_56",
          "showAs": "Ukraine War",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_56"
        },
        "questionNumber": 23,
        "date": "2025-11-27",
        "showAs": " 23. Deputy Brian Brennan asked the Minister for Foreign Affairs and Trade her assessment of the current situation in Ukraine and the threat posed to Europe by Russia; and if she will make a statement on the matter. [66674/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_23"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Agriculture, Food and the Marine  In recent years we have seen a significant increase in bTB levels nationally. In 2024 over 6,000 farm families were affected by a bTB outbreak and herd incidence was over 6%.  As at 16th November 2025 on a 12 month basis herd incidence has fallen below 6% nationally. However, I wish to acknowledge that herd incidence is over 12% in Wicklow East, over 17% in Wicklow West and over 6% in Wexford.  I have undertaken extensive engagement with stakeholders and farming organisations to agree measures to tackle the current disease levels, and in June I received the support of government to introduce additional measures to the Bovine TB programme.  On 9 September, I launched the ‘Bovine TB Action Plan: Addressing Bovine TB in Ireland’. There are 5 measures and 30 actions underpinned by scientific evidence, research and veterinary expertise  Support herds free of bTB to remain free  Reduce the impact of wildlife on the spread of bTB  Detect and eliminate bTB infection as early as possible in herds with a bTB breakdown and avoid a future breakdown  Help farmers improve all areas of on-farm biosecurity  Reduce the impact of known high-risk animals in spreading bTB  The aim of the Action Plan is to reset the bTB programme in the context of putting in place measures necessary to tackle the current disease situation. These measures are targeting both transmission between wildlife and cattle, and transmission between cattle.  Some of these measures require work on IT systems which is being prioritised in my Department and will be rolled out in the coming months. Farmers and all stakeholders will be notified in advance of the introduction of these changes to the TB programme through communication campaigns. I will also, as part of the implementation of the Action Plan, be introducing a scheme in 2026 for improving on-farm badger biosecurity which will support farmers in taking steps in reducing the risk of badger to cattle and cattle to badger transmission of bovine TB.  I have also received an increased budget for the TB programme with €157 million allocated in budget 2026. This will allow the TB programme to focus on driving down disease through the implementation of the measures laid out in the bTB Action Plan. ",
        "to": {
          "showAs": "Agriculture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Brian Brennan",
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_116.xml"
            }
          },
          "debateSectionId": "dbsect_116",
          "showAs": "Animal Diseases",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_116"
        },
        "questionNumber": 118,
        "date": "2025-11-27",
        "showAs": " 118. Deputy Brian Brennan asked the Minister for Agriculture, Food and the Marine the progress of the Bovine TB Action Plan in view of the impact of TB on Wicklow and Wexford farmers; and if he will make a statement on the matter. [66671/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_118"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The purpose of the Climate Action Summer Works Scheme (CASWS) is to enable individual school authorities to undertake small-scale building works on a devolved basis that, ideally, can be carried out during the summer months or at other times that avoid disrupting the operation of the school. The CASWS operates on a multi-annual basis across a number of categories of works.  It is envisaged that approvals in any given year will involve a spread of categories rather than the traditional single category at a time. This is aimed at managing market capacity and maximising value for money opportunities for school authorities.  The CASWS will operate on a multi-annual basis, In November 2025 the Minister announced the first tranche of approvals under the new Climate Action Summer Works Scheme. 297 projects were approved to proceed and involve primary, post primary and special schools, along with projects in all counties and across all categories of works. The investment in the first tranche of applications is in the region of €90m. It should be noted that 14 schools in Counties Wicklow and Wexford were approved in the first tranche.  Given that funding is limited in any particular year it is necessary to prioritise applications. Under the new climate action summer works scheme which operates on a multi annual basis, like previous summer works schemes, applications from schools that are not reached for funding or market prioritisation reasons in 2026 will qualify to be assessed for purposes of the funding available for climate action summer works in subsequent years.  Full details of the of the announcement and the list of schools approved in the first tranche, the Circular (0029/2025) for the scheme and guidance documents for schools can be found at the below link;  [ gov.ie Summer Works Scheme (www.gov.ie/en/department-of-education/services/summer-works-scheme/). ] ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Brian Brennan",
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_251.xml"
            }
          },
          "debateSectionId": "dbsect_251",
          "showAs": "Schools Building Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_251"
        },
        "questionNumber": 291,
        "date": "2025-11-27",
        "showAs": " 291. Deputy Brian Brennan asked the Minister for Education and Youth whether there will be any additional funding allocated under the summer works scheme for the 2025-2026 term; if not, the reason only five schools in the Wicklow Wexford constituency were successful in their applications under this scheme; and if she will make a statement on the matter. [66795/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_291"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The purpose of the Climate Action Summer Works Scheme (CASWS) is to enable individual school authorities to undertake small-scale building works on a devolved basis that, ideally, can be carried out during the summer months or at other times that avoid disrupting the operation of the school. The CASWS operates on a multi-annual basis across a number of categories of works.  It is envisaged that approvals in any given year will involve a spread of categories rather than the traditional single category at a time. This is aimed at managing market capacity and maximising value for money opportunities for school authorities.  The CASWS will operate on a multi-annual basis, In November 2025 the Minister announced the first tranche of approvals under the new Climate Action Summer Works Scheme. 297 projects were approved to proceed and involve primary, post primary and special schools, along with projects in all counties and across all categories of works. The investment in the first tranche of applications is in the region of €90m. It should be noted that 14 schools in Counties Wicklow and Wexford were approved in the first tranche.  Given that funding is limited in any particular year it is necessary to prioritise applications. Under the new climate action summer works scheme which operates on a multi annual basis, like previous summer works schemes, applications from schools that are not reached for funding or market prioritisation reasons in 2026 will qualify to be assessed for purposes of the funding available for climate action summer works in subsequent years.  Full details of the of the announcement and the list of schools approved in the first tranche, the Circular (0029/2025) for the scheme and guidance documents for schools can be found at the below link;  [ gov.ie Summer Works Scheme (www.gov.ie/en/department-of-education/services/summer-works-scheme/ ]). ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Brian Brennan",
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_252.xml"
            }
          },
          "debateSectionId": "dbsect_252",
          "showAs": "Schools Building Projects",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_252"
        },
        "questionNumber": 292,
        "date": "2025-11-27",
        "showAs": " 292. Deputy Brian Brennan asked the Minister for Education and Youth whether any additional funding will be allocated under the summer works scheme for the 2025/2026 term; if not, the reason only five schools in the Wicklow-Wexford constituency were successful in their applications under this scheme; and if she will make a statement on the matter. [66796/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_292"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Culture, Communications and Sport  I am conscious of the contribution that festivals make to the artistic and cultural life of local communities and how they make destinations more attractive to domestic and international tourists. I recognise also the challenges involved in arranging festivals, often involving significant financial outlay and commitments and a great deal of voluntary activity. Accordingly, my Department and the relevant agencies under its aegis support the staging of festivals.  In that regard my Department runs a Small Scale Local Festivals and Summer Schools Scheme. The Scheme is designed to support local cultural festivals which are not in receipt of other central Government monies and which may not be eligible under funding criteria for larger scale events supported by Fáilte Ireland, the Arts Council and similar bodies. Events which are funded by the Arts Council and/or Fáilte Ireland are not eligible. Funding available under this scheme is typically capped at €5,000.  Full details of the scheme are available on my Departments website at [ www.gov.ie/en/publication/89595-small-scale-local-festivals-and-summer-schools ]/.  This scheme is subject to a competitive assessment process, and applications are marked on the following criteria:  • Extent to which the projects meets the objectives of the scheme  • Realistic in terms of scale, costs, assistance sought and timeframe for delivery  • Demonstrate capacity to deliver project  • Level of own or supporting contribution (non-state) towards the project  The Festivals and Summer Schools 2025 scheme is now closed to applications, but expressions of interest can be emailed to [ festivals@ccs.gov.ie ] for notification of 2026 applications under this Scheme.  The Arts Council also provides financial support to a range of festivals, large and small, both single art form and multidisciplinary arts festivals. Strategic Funding supports organisations which are critical to the national arts infrastructure while the Festivals Investment Scheme is specifically designed to offer support to local/voluntary organisations to develop arts festivals.  As part of their Strategically Funded Festivals, Fáilte Ireland supports a diverse selection of larger festivals and events throughout the country. The Regional Festival Scheme, which they also support, is available to local community festivals and is administered by the local authorities. Each local authority manages their own application and grant process. ",
        "to": {
          "showAs": "Culture",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Brian Brennan",
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_291.xml"
            }
          },
          "debateSectionId": "dbsect_291",
          "showAs": "Departmental Funding",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_291"
        },
        "questionNumber": 338,
        "date": "2025-11-27",
        "showAs": " 338. Deputy Brian Brennan asked the Minister for Culture, Communications and Sport the funding streams available for a festival (details supplied); and if he will make a statement on the matter. [66761/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_338"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  Fuel Allowance (FA) may be payable to certain households in receipt of long term social welfare payments. The allowance is subject to a means test and is paid only to those who live alone or with certain exempted people. Only one Fuel Allowance is payable per household.  Entitlement to FA for the person concerned ceased on 17 July 2025 when the Department became aware that their household consists of another person who is receiving a Fuel Allowance with their own Social Welfare payment. In these circumstances, only one Fuel Allowance is payable, this remains in payment to the other FA recipient.  I trust this clarifies the matter for the Deputy.   ",
        "to": {
          "showAs": "Social",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Brian Brennan",
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_334.xml"
            }
          },
          "debateSectionId": "dbsect_334",
          "showAs": "Social Welfare Payments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_334"
        },
        "questionNumber": 392,
        "date": "2025-11-27",
        "showAs": " 392. Deputy Brian Brennan asked the Minister for Social Protection the reason the October lump sum fuel allowance payment did not issue to a person (details supplied); the steps that can be taken to issue them with a payment to cover essential fuel costs during cold weather; and if he will make a statement on the matter. [66797/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_392"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  Disability Allowance (DA) is a weekly allowance paid to people with a specified disability who are aged 16 or over and under the age of 66. This disability must be expected to last for at least one year and the allowance is subject to medical assessment, a means test, and habitual residency conditions.  I can confirm the Department received an application for DA from the person concerned on 01 August 2025. Based on all the information available to the Department, their claim was disallowed as they did not satisfy the qualifying medical criteria for the scheme. The person concerned was notified in writing of the decision on 11 September 2025. They were also notified of their entitlement to request a review and/or appeal of the decision.  The person concerned lodged an appeal with the Social Welfare Appeals Office (SWAO). The Department received notification of the appeal, and all the relevant information pertaining to the appeal were submitted to the SWAO on 07 November 2025. The person concerned will be notified directly in writing by SWAO regarding the outcome of their appeal.  I trust this clarifies the position for the Deputy. ",
        "to": {
          "showAs": "Social",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Brian Brennan",
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_336.xml"
            }
          },
          "debateSectionId": "dbsect_336",
          "showAs": "Social Welfare Benefits",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_336"
        },
        "questionNumber": 394,
        "date": "2025-11-27",
        "showAs": " 394. Deputy Brian Brennan asked the Minister for Social Protection the reason the claim for disability allowance was refused for a person (details supplied); the options available at this time; and if he will make a statement on the matter. [66824/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_394"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  Carer’s Allowance (CA) is a means-tested social assistance payment made to a person who is habitually resident in the State and who provides full-time care and attention to a child or adult with a disability that requires such a level of care.  An application for CA was received from the person concerned on 05 August 2025.  As part of the decision process, the application was referred for the professional opinion of a Department Medical Assessor. The claim was disallowed as the Deciding Officer, having regard to the opinion of the Medical Assessor, decided that the information supplied did not show that the care recipient required full time care.  The person concerned was notified of this decision in writing on 12 November 2025. They were also notified of their right to have the decision reviewed (where further information is available) or to appeal the decision to the Social Welfare Appeals Office (SWAO).  A request to appeal this decision was lodged with the Department on 20 November 2025 and forwarded to the Social Welfare Appeals Office (SWAO). The file was sent to the SWAO on 24 November 2025 and is currently awaiting decision.  I hope this clarifies the position for the deputy.   ",
        "to": {
          "showAs": "Social",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Brian Brennan",
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_337.xml"
            }
          },
          "debateSectionId": "dbsect_337",
          "showAs": "Social Welfare Benefits",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_337"
        },
        "questionNumber": 395,
        "date": "2025-11-27",
        "showAs": " 395. Deputy Brian Brennan asked the Minister for Social Protection the reason the claim for carers allowance was refused for a person (details supplied); and the options available at this time; and if he will make a statement on the matter. [66825/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_395"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  My department implements a wide range of schemes and supports which are available to community organisations and other groups across the country. While there is not a scheme specifically for community festivals, there may be an avenue of support available under the LEADER programme.  Funding under the 2023-2027 LEADER programme is not targeted at any particular group or sector or activity in rural communities. Rather, it is focused on a thematic approach to rural development under the headings of firstly, Economic Development and Job Creation, secondly, Rural Infrastructure and Social Inclusion, and thirdly, Sustainable Development of the Rural Environment and Climate Change Mitigation and Adaptation.  Funding for activities such as a community organised music festival may be available under one of these themes. However, it should be noted that the LEADER programme does not fund operational costs of a project, such as salaries or insurance, and it does not provide multi-annual funding to a project.  In order for a project to be eligible for LEADER funding, the proposed activity must be compatible with the actions outlined in the approved LEADER Local Development Strategy in the area concerned and it must comply with the EU Regulations and Operating Rules in place for the programme.  The programme is administered by Local Action Groups (LAGs) across the country. Prospective applicants should, in the first instance, contact their relevant LAG, through its Implementing Partner to discuss the eligibility of the project and the funding that may be available. The Implementing Partner in County Wicklow is County Wicklow Partnership and they may be contacted by phone at 0402-20955 or by emailing info@wicklowpartnership.ie. ",
        "to": {
          "showAs": "Rural",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Brian Brennan",
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_524.xml"
            }
          },
          "debateSectionId": "dbsect_524",
          "showAs": "Departmental Funding",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_524"
        },
        "questionNumber": 600,
        "date": "2025-11-27",
        "showAs": " 600. Deputy Brian Brennan asked the Minister for Rural and Community Development and the Gaeltacht the funding streams available for a festival (details supplied); and if he will make a statement on the matter. [66762/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_600"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "showAs": " 436. Deputy Brian Brennan asked the Minister for Education and Youth the reason for the delay in issuing payment to a person (details supplied) under the home-based summer programme; when payment can be expected; and if she will make a statement on the matter. [65984/25] ",
        "debateSection": {
          "showAs": "Departmental Data",
          "debateSectionId": "dbsect_417",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_417",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_417.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Brian Brennan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "memberCode": "Brian-Brennan.D.2024-11-29"
        },
        "questionNumber": 436,
        "answerText": " Minister of State at the Department of Education and Youth  Details of the 2025 Summer Programme were published on the 13th of February 2025. For this year’s programme, funding of €62 million was secured in Budget 2025. The level of funding this year represents a 55% increase on the funding previously provided and all of this funding will be utilised to meet the needs of our most vulnerable children.  All schools have an opportunity to run a programme for those children who need it the most. These children can continue to be supported, nurtured and encouraged to engage in a fun and inclusive educational setting.  The main priority again in 2025 is ensuring that those children with the most complex special educational needs, especially in special schools, should have access to a school-based summer programme.  Where a school is not running a Summer Programme or a place on a school-based programme is unavailable, the Home-based programme is available for pupils with complex special educational needs.  The Department’s ultimate goal remains to ensure that every child with special educational needs continues to be supported both in school and on the Summer Programme. The Summer Programme plays a vital role in achieving this and we are committed to expanding the programme’s reach and impact each year so that every child can benefit.  In relation to the claims referred to by the Deputy, I understand that they have been processed in line with the terms of the scheme and payment should issue in the next available pay date which is 4th December 2025.  The Department wishes to sincerely thank teachers and SNAs who participate in the Summer Programme. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_436",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 585. Deputy Brian Brennan asked the Minister for Housing, Local Government and Heritage if there is any mechanism, existing or discretionary, that would allow a sole-director small business to qualify for the vacant property grant, given that the renovation is strictly for personal residential use to bring a derelict property in a small town back to use; and if he will make a statement on the matter. [66217/25] ",
        "debateSection": {
          "showAs": "Vacant Properties",
          "debateSectionId": "dbsect_527",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_527",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_527.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Brian Brennan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "memberCode": "Brian-Brennan.D.2024-11-29"
        },
        "questionNumber": 585,
        "answerText": " Minister for Housing, Local Government and Heritage  The Vacant Property Refurbishment Grant, introduced in July 2022, provides a grant of up to €50,000 for the refurbishment of vacant properties for occupation as a principal private residence and for properties which will be made available for rent. A top-up grant of up to €20,000 is available where the property is confirmed to be derelict, bringing the total grant available for a derelict property up to a maximum of €70,000. In order to qualify for the grant, the property must be vacant for two years or more at the time of application.  A maximum of two grants are available to any applicant, of which one must be in respect of a home they intend to occupy as their principal private residence and the other may be in respect of a property which will be made available for rent. The grant is not currently available to registered companies or developers. Applications can only be made by named individuals. Applicants may transfer a property from company ownership into their individual ownership in order to apply for the grant.  The housing plan Delivering Homes, Building Communities 2025-2030 has committed to improve and expand the Vacant Property Refurbishment Grant by introducing an 'Above the Shop' top up grant and my Department is currently progressing this work. The plan also commits to exploring an extension of the 'Above the Shop' grant to micro companies. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Housing",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_585",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 960. Deputy Brian Brennan asked the Minister for Further and Higher Education, Research, Innovation and Science if assistance can be offered to a person (details supplied); and if he will make a statement on the matter. [65547/25] ",
        "debateSection": {
          "showAs": "Departmental Inquiries",
          "debateSectionId": "dbsect_865",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_865",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_865.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Brian Brennan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "memberCode": "Brian-Brennan.D.2024-11-29"
        },
        "questionNumber": 960,
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  For former apprentices seeking proof of successful completion of their apprenticeship programme, SOLAS recommends applying for a Record of Attainment.  A Record of Attainment (ROA) is issued to craftspeople who meet the criteria for the former national craft certificate. An individual seeking this should contact their local Education and Training Board (ETB) and Training Advisor, who will provide the application form and explain the application process. Once the ETB has approved the application, they will send it to SOLAS and the applicant will be issued with a ROA and a craft card.  If an individual encounters any difficulty contacting their local ETB, they should contact the National Apprenticeship Office by email at apprenticeship@nao.ie with “Record of Attainment” in the subject line and include relevant details. A copy of the registration record can also be requested by email or through direct contact with SOLAS. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Further and Higher Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_960",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Culture",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_82",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_82",
          "showAs": "Sports Funding",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_82.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 49. Deputy Brian Brennan asked the Minister for Culture, Communications and Sport if funding streams are available for large-scale community sports facilities for towns such as Arklow, which has a growing population of over 16,000 people and requires significant investment in this area; and if he will make a statement on the matter. [64358/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_49",
        "answerText": " Minister of State at the Department of Culture, Communications and Sport  The Large Scale Sports Infrastructure Fund (LSSIF) was established under the National Sports Policy, published on 25 July 2018, to provide Exchequer support for larger sports facility projects, typically those requiring investments greater than the maximum available under the Community Sports Facilities Fund (CSFF).  The first allocations under LSSIF 2018 were announced in January 2020 with €86.4 million awarded to 33 different projects. Additional funding of €37.6 million was allocated to 27 of these projects in December 2023, bringing the total awarded under LSSIF 2018 to €124 million.  In 2024, the second round of LSSIF received an unprecedented demand for funding. On 4 November 2024, grants totalling €173 million were awarded to 35 projects. As a result of the significant demand, a range of valid applications did not receive an LSSIF allocation at the initial allocation stage.  With regard to a future round of the LSSIF, I am committed to ensuring sustained investment in sports facilities to meet our ambitious goals for sports participation nationwide. The Programme for Government commits to maintaining sports funding to get more people participating in all levels of sport, particularly targeting cohorts in society where there are lower than average participation levels.  My current focus is on ensuring project delivery under the first two rounds of the LSSIF and this process will inform any decisions regarding the timing of a future round. No decisions have yet been made regarding the next round of LSSIF. ",
        "questionNumber": 49,
        "by": {
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "showAs": "Brian Brennan"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_31",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/debate/dbsect_31",
          "showAs": "Ambulance Service",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/debate/mul@/dbsect_31.xml"
            }
          }
        },
        "questionType": "oral",
        "showAs": " 86. Deputy Brian Brennan asked the Minister for Health for an update on developments with the ambulance service in the south east; and if she will make a statement on the matter.  [64352/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_86",
        "answerText": " Deputy Brian Brennan  It would be remiss of me not to take this opportunity to mention that people from north Wexford have experienced a number of serious medical emergencies abroad. I thank the Minister and her staff for their prompt response and service in these sensitive matters for the families concerned. The responses by the Departments of Health and Foreign Affairs and Trade and the HSE have been really appreciated by the families. One case is still ongoing and I am working closely with the family on it. I must mention one of the Minister's staff, Bríd, who has been more than helpful.  My question asks for an update on developments with the ambulance service in the south east. \n Deputy Jennifer Carroll MacNeill  The Government remains committed to investing in and developing the National Ambulance Service, NAS, including in the south east. The allocation in 2025 includes an additional €28 million of new service development funding for up to 180 additional posts. Those posts will focus on strengthening front-line emergency services, expanding alternative care pathways and developing specialist services, including critical care retrieval.  Government investment in NAS has increased by 64% since 2020. The HSE Dublin and South-East region is served by 14 NAS ambulance bases. Two NAS pathfinder teams aimed at older persons operate from Waterford and St. Luke's hospital in Kilkenny. Four NAS community paramedics also operate in the region. The south-east region has benefitted from two additional 24-7 emergency ambulances based in Tipperary and Arklow. Additionally, it is served by the NAS national clinical hub, which offers alternative pathway options for low-acuity patients.  The Deputy will be aware of ongoing NAS capital projects in the region, including new ambulance bases for New Ross and Gorey, which are scheduled to proceed to detailed design phase shortly. In addition, a new ambulance base regional training facility and business support hub project is planned for Carlow town and is proceeding towards detailed design phase. \n Deputy Brian Brennan  I welcome the strong investment. The Gorey and Arklow area is one of the fastest-growing areas in Ireland. When we add in the coastal area between Castletown and Cahore, there are an extra 40,000 people every summer. The capacity really is stretched. I ask for continued investment in specialised advanced paramedics and community paramedics, who provide a vital service in communities. Second, what is the status of the promised national ambulance training college in the area? The model in Limerick was rolled out very successfully. I understand we are looking at the nursing residential triage tool that allows patients in nursing homes to be treated in situ . \n Deputy Jennifer Carroll MacNeill  We continue to invest at pace. There are an additional 500 NAS staff since 2020, with the total going from approximately 2,000 to 2,500, which is a very considerable increase of 26%. That increase is needed to ensure the distribution of staff and the different ways in which they can try to keep people close to home, particularly older people whom we do not want having to present at acute hospitals. The south-east region currently has 14 ambulance bases, with 277 whole-time equivalent staff, including paramedics, advanced paramedics and advanced emergency medical technicians. We have new development funding in 2025 for two additional 24-7 ambulances. There is the new rapid response vehicle operating from Newcastle, County Wicklow. The south-east region is served also by 50 active community first responder groups, which play an enormous role. Further aeromedical support is provided to the region by the NAS helicopter emergency service and the Irish Coast Guard. These are the different ways in which we are trying to provide support and divert lower-acuity patients. \n Deputy Brian Brennan  I ask the Minister to give a further commitment of funding for non-emergency patient services. In my constituency, Arklow Cancer Support is an example of a charity doing incredible work providing a wonderful transport service for vulnerable cancer patients to and from appointments. It operates on a shoestring and spends a huge amount of time and effort on fund-raising. All the measures we have discussed will put less pressure on Wexford hospital, which provides an excellent service in the south east but is stretched. Although this issue is under the remit of the Minister of State, Deputy Butler, I must point out that the lack of acute mental health services is a real issue in the south east.  The measures I outlined will put less pressure on Wexford hospital. \n Deputy Jennifer Carroll MacNeill  I recognise the work done by volunteer groups like Arklow Cancer Support and the support they give to cancer patients travelling for blood tests, infusion services and so on. The HSE is not a land development or transport company. I recognise there are many different groups providing an enormous service to cancer patients, some with some measure of State support and others not. While the HSE will never be a transport company, I have met Volunteer Ireland to ask it to compile a list of all the different volunteer groups who provide transport services for health patients, cancer patients or in the disability space - many overlap and intercept. When I have that complete list, I will sit with the Minister for rural affairs, Deputy Calleary, and in particular the Minister of State, Deputy Buttimer, who sits both in the Department of rural affairs and the Department of Transport. There is something we have not yet imagined in terms of rural support services and transport services. It is not the responsibility of the HSE. It should not really be. We cannot do high-quality cancer care and transport. That is not the role but there is something better, more imaginative and more co-ordinated that can be done. I am grateful for the opportunity to discuss it today. ",
        "questionNumber": 86,
        "by": {
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "showAs": "Brian Brennan"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Social",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_372",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_372",
          "showAs": "Social Welfare Benefits",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_372.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 500. Deputy Brian Brennan asked the Minister for Social Protection the history of and current status of the carer's allowance claim for a person (details supplied); and if he will make a statement on the matter. [65036/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_500",
        "answerText": " Minister for Social Protection  Carer's Allowance (CA) is a means-tested social assistance payment made to a person who is habitually resident in the State and who is providing full-time care and attention to a child or an adult who has such a disability that as a result they require that level of care.  I can confirm that the person concerned has been in receipt of CA since 14 February 2019.  Once claims are in payment, my Department undertakes periodic reviews to ensure that there is continued entitlement to payment. As part of a review of the entitlement to CA of the person concerned, a request for information issued on 29 August 2025.  It is a condition for receipt of CA that every claimant shall furnish such certificates, documents, information and evidence as may be required for the purposes of deciding their claim.  As the information requested was not received, a further reminder issued on 23 October 2025.  As the person concerned failed to respond, it has not been possible to determine if they continue to satisfy the necessary conditions for continued receipt of CA from 03 December 2025.  Their last payment will be lodged to their bank account on 27 November 2025.  The person was notified in a letter dated 13 November 2025 of their right to have the decision reviewed (where further information is available) or to appeal the decision to the Social Welfare Appeals Office (SWAO). ",
        "questionNumber": 500,
        "by": {
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "showAs": "Brian Brennan"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 498,
        "showAs": " 498. Deputy Brian Brennan asked the Minister for Education and Youth the status of the emergency works application for a school (details supplied); when a decision will be made; and if she will make a statement on the matter. [63679/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Education"
        },
        "by": {
          "showAs": "Brian Brennan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "memberCode": "Brian-Brennan.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_498",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_418",
          "showAs": "School Accommodation",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_418",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_418.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Education and Youth  The school to which the Deputy refers submitted an application for funding under the Emergency Works Scheme (EWS) for external environment works on 24 October 2025.  The application in question is currently being reviewed by the technical area within the EWS. Once a technical recommendation has been received back from the technical team, the EWS team will engage further with the school as appropriate. The EWS team is aware of the urgent nature of the works required and will keep the school informed throughout the process. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 724,
        "showAs": " 724. Deputy Brian Brennan asked the Minister for Social Protection if he will consider an addition fuel payment for polio survivors (details supplied); and if he will make a statement on the matter. [63706/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Social"
        },
        "by": {
          "showAs": "Brian Brennan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "memberCode": "Brian-Brennan.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_724",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_573",
          "showAs": "Social Welfare Eligibility",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_573",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_573.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Social Protection  The Fuel Allowance Scheme is means tested and assists pensioners and other welfare dependent householders with meeting the cost of their heating needs during the winter season. The Fuel Allowance is a payment of €33 per week for 28 weeks giving a total per recipient of €924 each year from October to April at an estimated cost of €400 million in 2025. As part of Budget 2026 I was delighted to announced that the weekly rate of Fuel Allowance will increase by €5 to €38 a week from January 2026. This equates to €1,064 in a fuel season.  Fuel Allowance is not the only support provided by my Department, direct support towards energy costs is also provided to qualifying low-income households, through schemes such as the Household Benefits Package as wells as through Additional Needs Payments.  The Household Benefits Package is universally available to those aged 70 and older, and those between 66 and 70, must meet certain qualifying criteria. The Household Benefits comprises the Electricity/Gas Allowance of €35 per month and the Free Television Licence Scheme which is worth €160 per year with a total value per year of €580. Over 532,000 households are in receipt of the Electricity/Gas element of the Household Benefits package at an estimated cost of €224 million in 2025.  Additional Needs Payments as part of the Supplementary Welfare Allowance scheme, are provided to people who have essential expenses, which they cannot meet from their own resources, including people who face difficulties in meeting fuel bills.  Furthermore, under the scheme, a Heating Supplement may be paid to assist people that have exceptional heating costs due to ill health, infirmity or a medical condition and are unable to meet those costs out of household income. Heating Supplement is not restricted to the fuel season and can be paid throughout the full year.  Significant supports are available from my Department especially to those who require help towards their heating cost due to a medical condition. Any introduction of an additional fuel payment for polio survivors would needed to be considered in the wider budgetary context.  Separately, any person who considers that they may have an entitlement to an Additional Needs Payment is encouraged to contact their local community welfare service. There is a National Community Welfare Contact Centre in place - 0818-607080 - which will direct callers to the appropriate office. In addition, applications can be made online via www.mywelfare.ie.  I trust this clarifies the matter for the Deputy. ",
        "date": "2025-11-18"
      }
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  As the Deputy is aware, my Department recently engaged with schools that have received additional mainstream teaching allocation posts informing them of a new pilot initiative which sought to automate the process for issuing the relevant Furniture and Equipment and ICT grant funding to qualifying schools. Whilst it was initially envisaged that these payments could be facilitated over the September-October period some additional measures have been identified for inclusion in this pilot process and these are in the process of being implemented. My Department will engage further with the affected schools in due course to advise on next steps. ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Brian Brennan",
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_468.xml"
            }
          },
          "debateSectionId": "dbsect_468",
          "showAs": "School Funding",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_468"
        },
        "questionNumber": 545,
        "date": "2025-11-12",
        "showAs": " 545. Deputy Brian Brennan asked the Minister for Education and Youth when an outstanding payment will be made to a school (details supplied); and if she will make a statement on the matter. [61866/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_545"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  Carer's Allowance (CA) is a means-tested social assistance payment made to a person who is habitually resident in the State and who is providing full-time care and attention to a child or an adult who has such a disability that as a result they require that level of care.  I can confirm that my Department received an application for CA from the person concerned on 24 July 2024.  The application was referred to a local Social Welfare Inspector on 01 August 2024 to confirm that all the conditions for receipt of CA are satisfied.  The person concerned informed the Social Welfare Inspector by phone on the 03 September 2024 that they wished to withdrawn their claim for CA.  The claim was subsequently withdrawn and the person concerned was notified in writing of this decision on 13 September 2024.  To date no review or appeal request has been received from the person concerned.  It is also open to the person concerned to re apply for CA by completing a new CR1 application form.  For their convenience an application form has been forwarded by post to the address of the person concerned.  I hope this clarifies the position for the Deputy. ",
        "to": {
          "showAs": "Social",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Brian Brennan",
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_581.xml"
            }
          },
          "debateSectionId": "dbsect_581",
          "showAs": "Social Welfare Benefits",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_581"
        },
        "questionNumber": 662,
        "date": "2025-11-12",
        "showAs": " 662. Deputy Brian Brennan asked the Minister for Social Protection the current status of a carers allowance application for a person (details supplied); and if he will make a statement on the matter. [61611/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_662"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The basic Supplementary Welfare Allowance (SWA) provides immediate assistance for those in need who are awaiting the outcome of a claim or an appeal for a primary social welfare payment or do not qualify for payment under other State schemes. SWA Payments are administered by Community Welfare Officers (CWOs) in the Community Welfare Service (CWS) considering the requirements of the legislation and all the relevant circumstances of the case.  According to Department records, the person concerned applied for basic SWA on the 23/06/2025. Where a person has an outstanding overpayment with the Department, 15% of any social welfare payment is automatically deducted from their weekly payment. The customer has the opportunity to bring any concerns that they may have in relation to the reoccurring deduction to the attention of the CWO at the time of their in-person interview, or on receipt of their award letter.  In this case I have arranged that the relevant CWO will contact the person concerned to discuss their debt repayment arrangements, and make adjustments if appropriate.  I trust this clarifies the matter for the Deputy. ",
        "to": {
          "showAs": "Social",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Brian Brennan",
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_589.xml"
            }
          },
          "debateSectionId": "dbsect_589",
          "showAs": "Social Welfare Payments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_589"
        },
        "questionNumber": 670,
        "date": "2025-11-12",
        "showAs": " 670. Deputy Brian Brennan asked the Minister for Social Protection if the overpayment being taken from the weekly supplementary welfare allowance of a person (details supplied) can be reduced to avoid hardship; and if he will make a statement on the matter. [61754/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_670"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The criteria for Fuel Allowance are framed in order to direct the limited resources available to the Department in as targeted a manner as possible.  To qualify for the Fuel Allowance payment, a person must satisfy all the qualifying criteria, this ensures that the Fuel Allowance payment is targeted at those who are more vulnerable to fuel poverty, including those reliant on social protection payments for longer periods and who are unlikely to have additional resources of their own.  While consideration is always given to suggested improvements to my Department's schemes, awarding the Fuel Allowance payment solely due to a medical condition and regardless of means would change the targeted nature of the scheme.  Any such change would have to be considered in the context of scheme policy and budgetary negotiations.  My Department does provide Additional Needs Payments to people who have essential expenses, which they cannot meet from their own resources, including people who face difficulties in meeting fuel bills.  Furthermore, under the scheme, a Heating Supplement may be paid to assist people that have exceptional heating costs due to ill health, infirmity or a medical condition and are unable to meet those costs out of household income.  Heating Supplement is not restricted to the fuel season and can be paid throughout the full year.  Any person who considers that they may have an entitlement to an Additional Needs Payment is encouraged to contact their local community welfare service.  There is a National Community Welfare Contact Centre in place - 0818-607080 - which will direct callers to the appropriate office.  In addition, applications can be made online via www.mywelfare.ie.  I trust this clarifies the matter for the Deputy. ",
        "to": {
          "showAs": "Social",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Brian Brennan",
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/mul@/dbsect_594.xml"
            }
          },
          "debateSectionId": "dbsect_594",
          "showAs": "Social Welfare Eligibility",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-12/writtens/dbsect_594"
        },
        "questionNumber": 680,
        "date": "2025-11-12",
        "showAs": " 680. Deputy Brian Brennan asked the Minister for Social Protection if consideration will be given to payment of fuel allowance to polio survivors (details supplied); and if he will make a statement on the matter. [61953/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-12/pq_680"
      },
      "contextDate": "2025-11-12"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_269",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Brian Brennan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "memberCode": "Brian-Brennan.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_249",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_249",
          "showAs": "Social Welfare Benefits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_249.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Social",
          "roleCode": null
        },
        "showAs": " 269. Deputy Brian Brennan asked the Minister for Social Protection if the application for disability allowance will be expedited for a person (details supplied) to allow access to further education; and if he will make a statement on the matter. [60606/25] ",
        "questionNumber": 269,
        "answerText": " Minister for Social Protection  I am advised by the Social Welfare Appeals Office that an Appeals Officer, having fully considered all of the available evidence, has decided to allow the appeal of the person concerned by way of a summary decision.  The person concerned will be notified of the Appeals Officer’s decision in the coming days. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_271",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Brian Brennan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "memberCode": "Brian-Brennan.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_251",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_251",
          "showAs": "Social Welfare Benefits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_251.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Social",
          "roleCode": null
        },
        "showAs": " 271. Deputy Brian Brennan asked the Minister for Social Protection the status of the invalidity pension application by a person (details supplied); when a decision will be made; and if he will make a statement on the matter. [60609/25] ",
        "questionNumber": 271,
        "answerText": " Minister for Social Protection  Invalidity Pension (IP) is a payment for people who are permanently incapable of work because of illness or incapacity and for no other reason and who satisfy the pay related social insurance (PRSI) contribution conditions.  The person concerned has been awarded IP with effect from 21 August 2025 and will receive their first payment and all arrears due for the period 21 August 2025 to 5 November 2025 to their nominated bank account on 6 November 2025. The person referred to was notified of this decision on 3 November 2025.  I hope this clarifies the position for the Deputy. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "question": {
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-06/pq_272",
        "house": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseCode": "dail",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseNo": "34",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Brian Brennan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "memberCode": "Brian-Brennan.D.2024-11-29"
        },
        "debateSection": {
          "debateSectionId": "dbsect_252",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/dbsect_252",
          "showAs": "Social Welfare Benefits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-06/writtens/mul@/dbsect_252.xml"
            },
            "pdf": null
          }
        },
        "questionType": "written",
        "date": "2025-11-06",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Social",
          "roleCode": null
        },
        "showAs": " 272. Deputy Brian Brennan asked the Minister for Social Protection the reason a carers support grant application for a person (details supplied) was not approved, following the award of carers benefit for a person with autism who is been cared for full-time; and if he will make a statement on the matter. [60611/25] ",
        "questionNumber": 272,
        "answerText": " Minister for Social Protection  Carer's Benefit was awarded to the person concerned from 18 September 2025.  As the person was not entitled to Carer's Benefit on the first Thursday in June 2025, there is no automatic entitlement to the 2025 CSG grant.  However, my Department received an application for the stand-alone CSG from the person concerned on 13 October 2025. In their application, the person confirmed that they were in employment for 33 hours per week up to 14 September 2025. As a result, the application was disallowed on the grounds the person does not meet the condition of the grant that the carer must not be in employment / training for more than 18.5 hours a week.  A letter issued to the person concerned on 22 October 2025, informing them of the above decision and advising them of their right of review and appeal.  I hope this clarifies the matter for the Deputy. "
      },
      "contextDate": "2025-11-06"
    },
    {
      "contextDate": "2025-11-05",
      "question": {
        "by": {
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29",
          "showAs": "Brian Brennan",
          "memberCode": "Brian-Brennan.D.2024-11-29"
        },
        "questionNumber": 158,
        "questionType": "written",
        "answerText": " Minister for Justice, Home Affairs and Migration  Matters relating to the Israeli Settlements in the Occupied Palestinian Territory (Prohibition of Importation of Goods) Bill 2025 fall within the remit of the Minister for Foreign Affairs and Trade. Responsibility for equality policy rests with the Department of Children, Disability and Equality (DCDE).  I can, however, advise the Deputy that the Public Sector Equality and Human Rights Duty, contained in Section 42 of the Irish Human Rights and Equality Commission Act 2014, applies to public bodies in the Republic of Ireland, placing a statutory obligation on public bodies to have regard to human rights and equality considerations in the performance of their functions. The duty supports a public service-wide approach to equality, human rights and inclusion.  Section 42 (1) states that public bodies shall, in the performance of their functions, have regard to the need to:  (a) eliminate discrimination,  (b) promote equality of opportunity and treatment of its staff and the persons to whom it provides services, and  (c) protect the human rights of its members, staff and the persons to whom it provides services.  Section 42(2) sets out the key steps a public body must take to support compliance with the statutory obligations under section 42 of the Act. These steps are to:  (a) carry out an assessment of the human rights and equality issues it believes to be relevant to the functions and purpose of the body (‘human rights and equality assessment’);  (b) put in place policies, plans and actions to address the issues identified in its human rights and equality assessment;  (c) publish its human rights and equality assessment, and the policies, plans and actions in place or proposed to be put in place to address the issues identified in that assessment, in a manner that is accessible to the public in its strategic plan, (howsoever described);  (d) report, in a manner that is accessible to the public, on developments and achievements – in respect of the policies, plans and actions in place or proposed to be put in place to address issues identified in its assessment - in its annual report (howsoever described).  The Act gives the Irish Human Rights and Equality Commission (IHREC) powers to monitor and provide information, guidance and education to public bodies to understand and meet these statutory obligations. ",
        "to": {
          "uri": null,
          "roleType": null,
          "showAs": "Justice",
          "roleCode": null
        },
        "date": "2025-11-05",
        "debateSection": {
          "debateSectionId": "dbsect_184",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/dbsect_184",
          "showAs": "Human Rights",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-05/writtens/mul@/dbsect_184.xml"
            }
          }
        },
        "showAs": " 158. Deputy Brian Brennan asked the Minister for Justice, Home Affairs and Migration to consider enacting legislation regarding human rights (details supplied); and if he will make a statement on the matter. [60441/25] ",
        "house": {
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "committeeCode": "",
          "houseNo": "34",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-05/pq_158"
      }
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Enterprise",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 600. Deputy Brian Brennan asked the Minister for Enterprise, Tourism and Employment the proposed timescale for the introduction of a single application procedure for immigration and employment permission; and if he will make a statement on the matter. [58788/25] ",
        "by": {
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "showAs": "Brian Brennan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_600",
        "questionNumber": 600,
        "answerText": " Minister of State at the Department of Enterprise, Tourism and Employment  On 13 December 2022, the Government agreed in principle to develop a single application procedure for employment permits and immigration permissions, in line with the recast Single Permit Directive. Since then, my Department has engaged extensively with the Department of Justice, Home Affairs and Migration (DJHAM) to progress this commitment.  A May 2024 Government decision agreed, in principle, that Ireland should opt-into the Single Permit Directive. To facilitate this, a programme management team, co-chaired by my Department and DJHAM, was established to oversee the implementation of a single procedure for employment and immigration permissions. Work is ongoing and aiming for implementation in 2027.  A crucial step in creating a single application procedure between my Department and DJHAM is the interoperability of our respective systems. I am pleased to inform you that the new ‘Employment Permits Online’ system launched earlier this year, providing a secure, cloud-based system for the application, processing, and issuance of employment permits. This system, which sits on a Microsoft Power Platform is based on similar technologies that the DJHAM’s various systems are expected to move to and will support the infrastructure required for a single application process across the two departments.  In addition to this important milestone, the project management team, co-chaired by my Department and the DJHAM have been laying the groundwork for the enhanced sharing of information between our IT systems, any legislative changes required for this, and engaging with EU bodies and Member States with processes in place that are similar to what we are currently developing. With a modern, adaptable employment permit system now in place, this collaboration will continue in earnest over the next year, focusing on initial streamlining while working towards a fully implemented single application procedure by 2027.  In the short-term and in recognition of the Market Diversity Action Plan, both Departments are actively exploring options to expedite visa processing for critical skills employment permit holders in high-demand sectors. ",
        "debateSection": {
          "showAs": "Immigration Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_548",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_548.xml"
            }
          },
          "debateSectionId": "dbsect_548"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Social",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 1216. Deputy Brian Brennan asked the Minister for Social Protection the current status of the child benefit application for a person (details supplied); when the payment will commence; and if he will make a statement on the matter. [59141/25] ",
        "by": {
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "showAs": "Brian Brennan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_1216",
        "questionNumber": 1216,
        "answerText": " Minister for Social Protection  Child Benefit is a monthly payment to the parents or guardians of children under 16 years of age. Child Benefit can also be claimed for children aged 16,17, 18 and 19 if they are in full-time education or full-time training or have a disability and cannot support themselves.  A Child Benefit claim was received from the person concerned on 9th September 2025 and was assigned to a deciding officer. Clarification was needed before a decision could be made on the claim, the deciding officer issued a request for further information to the person concerned. A decision will be made when all of the relevant information is received and the person concerned will be informed in writing.  I trust that this clarifies the matter for the Deputy. ",
        "debateSection": {
          "showAs": "Social Welfare Payments",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1045",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1045.xml"
            }
          },
          "debateSectionId": "dbsect_1045"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Rural",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-11-04",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 2178. Deputy Brian Brennan asked the Minister for Rural and Community Development and the Gaeltacht whether his Department has any suitable funding streams for a project (details supplied); and if he will make a statement on the matter. [58626/25] ",
        "by": {
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "showAs": "Brian Brennan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-04/pq_2178",
        "questionNumber": 2178,
        "answerText": " Minister of State at the Department of Rural and Community Development and the Gaeltacht  My Department's mission is to promote rural and community development and to support vibrant, inclusive and sustainable communities throughout Ireland. In furtherance of this, my Department drafts policies and manages strategic interventions and funding programmes that support economic, social and cultural development in both urban and rural communities.  I was delighted, along with Minister Calleary, to secure €611 million in funding for Rural and Community Development and the Gaeltacht for 2026, which will support the government’s ongoing commitment to building stronger, vibrant communities, both rural and urban.  Schemes that may be of interest for the project referred to include CLÁR, the Community Services Programme, the Scheme to Support National Organisations and the Social Inclusion and Community Activation Programme (SICAP), which offers small scale grants to support community organisations.  In delivering on our remit my department liaises with stakeholders in communities around the country on an ongoing basis, including through the Local Authorities, Local Community Development Committees, Public Participation Networks and the Local Development Companies, to ensure that supports provided are timely and appropriate to the needs of communities.  I would encourage all groups, projects and organisations to engage with these structures to ensure they are aware of funding opportunities as they become available. ",
        "debateSection": {
          "showAs": "Departmental Funding",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/dbsect_1884",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-04/writtens/mul@/dbsect_1884.xml"
            }
          },
          "debateSectionId": "dbsect_1884"
        }
      },
      "contextDate": "2025-11-04"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "showAs": "Housing",
          "uri": null,
          "roleType": null
        },
        "questionType": "written",
        "date": "2025-10-22",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house"
        },
        "showAs": " 88. Deputy Brian Brennan asked the Minister for Housing, Local Government and Heritage if the additional funding for a CPO of vacant properties will be eligible for use for properties outside of URDF areas; and if not, the measures that will be in place to alleviate vacancy and dereliction in smaller towns and villages; and if he will make a statement on the matter. [57530/25] ",
        "by": {
          "memberCode": "Brian-Brennan.D.2024-11-29",
          "showAs": "Brian Brennan",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Brian-Brennan.D.2024-11-29"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-10-22/pq_88",
        "questionNumber": 88,
        "answerText": " Minister for Housing, Local Government and Heritage  Addressing vacancy and dereliction is a key priority for Government.  The Vacant Homes Action Plan, published in January 2023, set out the various actions being pursued to return vacant properties back into use as homes. In March, I published the 2025 Progress Report which shows the significant progress that is being made and it is available on my Department's website at the following link: gov - Vacant Homes Action Plan 2023-2026 (www.gov.ie) www.gov.ie/en/publication/df86c-vacant-homes-action-plan-2023-2026/.  The CPO Activation Programme was launched by my Department in April 2023. The Programme encourages a proactive and systematic approach by local authorities to address vacancy and dereliction. As part of the Programme, guidance and supports are provided for local authorities to actively use their legislative powers under the Housing Act and the Derelict Sites Act to compulsorily acquire vacant and derelict properties, where engagement with owners has been unsuccessful.  Implementation of the Programme requires cross team co-operation and co-ordination in each local authority to support a focused approach to addressing vacancy and dereliction. This is occurring in local authorities with reorganisation of staff resources and establishment of other structures to support co-ordination.  There are a range of funding options in place to support local authorities in using their compulsory purchase powers to acquire vacant and dereliction properties and bring them back into use:  • The Urban Regeneration and Development Fund, with €150 million being provided under Call 3. This is available for local authorities to acquire vacant or derelict properties and sites for re-use or sale. The number of properties approved for the URDF acquisition programme is now over 1,370;  • Under the Social Housing Investment Programme local authorities and Approved Housing Bodies are being supported to acquire and re-develop vacant and derelict buildings and sites, from single properties to more extensive buildings or blocks for social housing;  • Loan funding is also available from the Housing Finance Agency; and  • Local authorities can use their own resources to finance the compulsory purchase and acquisition of vacant and derelict properties.  My Department, along with the Property Optimisation Unit in the Housing Agency, will continue to support local authorities in taking a proactive and systematic approach to identifying vacant and derelict properties and engaging with owners to bring those properties back into use, including through the use of their compulsory purchase powers.  I firmly believe that the commitment Government has made to addressing vacancy and dereliction and the actions taken will continue to play a vital role in delivering homes across the country. ",
        "debateSection": {
          "showAs": "Vacant Properties",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-22/writtens/dbsect_108",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-10-22/writtens/mul@/dbsect_108.xml"
            }
          },
          "debateSectionId": "dbsect_108"
        }
      },
      "contextDate": "2025-10-22"
    }
  ]
}