{
  "head": {
    "counts": {
      "questionCount": 7701,
      "resultCount": 7701
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport. The National Transport Authority (NTA) has responsibility for the planning and development of public transport infrastructure, including the provision of bus stops/shelters nationally.  There is a commitment under the Programme for Government to ensure that public transport operators provide safe and accessible access for all passengers and a commitment to work with local authorities and national bodies to improve public transport options and infrastructure.  Noting the NTA's responsibility in the matter, I have referred the Deputy's question to the NTA for a direct reply. Please contact my private office if you do not receive a reply within 10 days. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 319. Deputy Niamh Smyth asked the Minister for Transport further to Parliamentary Question No. 271 of 4 November 2025, the anticipated timeframe for a decision on the provision of additional or revised bus stop facilities at Ardkill Place, Ballinagh, County Cavan, under the bus stop enhancement programme; and if he will make a statement on the matter. [73497/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_323",
          "debateSectionId": "dbsect_323",
          "showAs": "Bus Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_323.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_319",
        "questionNumber": 319
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I wish to inform the deputy that officials in my department have carried out a review of the salary scale point for the teacher referred to and they have corresponded directly with the teacher. Arrears of payment in respect of this review shall issue to her on 31st December 2025.  Separately, the teacher has submitted an application to recognise her teaching service abroad. A decision on the application to recognise the teaching service abroad to progress further up the salary scale is being considered and a decision letter will issue shortly. I wish to apologise for the delay in receiving a decision, there are a huge volume of applications on hand at the moment. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 460. Deputy Niamh Smyth asked the Minister for Education and Youth if she will review the case of a person (details supplied) who has been seeking the correction of her pay scale and recognition of service following a period of career break and study leave; if she will clarify why the appropriate pay scale adjustment has not yet been applied despite the submission of the required documentation and confirmation that the matter was to be corrected; what steps are being taken by her Department to resolve this issue without further delay; and if she will make a statement on the matter. [73512/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_436",
          "debateSectionId": "dbsect_436",
          "showAs": "School Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_436.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_460",
        "questionNumber": 460
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  As the National Women and Infants Health Programme leads on the management, organisation and delivery of maternity, gynaecological and neonatal services, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 647. Deputy Niamh Smyth asked the Minister for Health if she will review the correspondence (details supplied); if she will address the concerns raised; and if she will make a statement on the matter. [73397/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_621",
          "debateSectionId": "dbsect_621",
          "showAs": "Departmental Correspondence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_621.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_647",
        "questionNumber": 647
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  The Apostille and Authentications Unit in the Department of Foreign Affairs and Trade is the competent authority to legalise public Irish documents for use abroad. After confirming that a signature, seal or stamp is genuine, an apostille or authentication stamp is affixed to the document and signed. This enables public documents issued in Ireland to be recognised in another country.  Turnaround times for this service can vary depending on the type of service used. Documents submitted via post have an average turnaround time of between three to seven working days from date of receipt.  Citizens can also choose to attend the walk in counter service for their apostille and authentication needs, where the average turn around time for requests is 30 minutes.  More information can be found on our website at: www.ireland.ie/documentauthentication  I am delighted to confirm that the documents referred to in this instance were received by this office on Thursday December 4th, processed and returned to the applicant on Monday December 8th. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 33. Deputy Niamh Smyth asked the Minister for Foreign Affairs and Trade if she will review correspondence (details supplied); if this process can be expedited due to the circumstances; and if she will make a statement on the matter. [72799/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_57",
          "debateSectionId": "dbsect_57",
          "showAs": "Departmental Functions",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_57.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_33",
        "questionNumber": 33
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Culture, Communications and Sport  The National Broadband Plan (NBP) is the government's initiative to deliver high speed broadband services to all premises in Ireland.  The premises in question is in the BLUE area on the broadband map which is available on my Department's website: www.gov.ie/en/publication/5634d-national-broadband-plan-map/  The BLUE area represents those areas where commercial providers are either currently delivering or have plans to deliver high-speed broadband services. The Department defines high-speed broadband as a connection with minimum speeds of 30Mbps download and 6Mbps upload.  The activities of commercial operators delivering high-speed broadband within BLUE areas are not planned or funded by the State and the Department has no statutory authority to intervene in that regard.  As per information available at www.openeir.ie/fibre/broadband-checker, the premises is included in open eir's Full Fibre deployment programme and an order can be placed for full fibre gigabit connection from any of open eir’s retail service providers.  The Department does not have statutory powers to compel property owners (such as a neighbour) to grant access necessary for a connection to a commercial operator and has no function to mediate between premises’ owners and commercial operators. If a resolution is not forthcoming the end user is advised to raise a query via the Department’s webform which can be accessed by clicking on “contact us” in the Contact section on www.gov.ie/en/publication/5634d-national-broadband-plan-map/ and the Department may escalate with the commercial operator to investigate this matter further should there be a case to do so. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 253. Deputy Niamh Smyth asked the Minister for Culture, Communications and Sport if he will review the case of a person (details supplied) who has been unable to obtain a fibre broadband connection to their home in a location (details supplied), despite fibre infrastructure being located within close proximity; the steps a company (details supplied) and its contractors have taken to resolve access issues relating to the relevant distribution point; if alternative technical solutions have been considered to progress the connection where access to a neighbouring property is no longer permitted; and if he will make a statement on the matter. [73199/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_232",
          "debateSectionId": "dbsect_232",
          "showAs": "National Broadband Plan",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_232.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_253",
        "questionNumber": 253
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Culture, Communications and Sport  The National Broadband Plan (NBP) is the government's initiative to deliver high speed broadband services to all premises in Ireland.  The estate and the premises at the Eircode provided in the question are in the BLUE area on the broadband map which is available on my Department's website: www.gov.ie/en/publication/5634d-national-broadband-plan-map/  The BLUE area represents those areas where commercial providers are either currently delivering or have plans to deliver high-speed broadband services. The Department defines high-speed broadband as a connection with minimum speeds of 30Mbps download and 6Mbps upload.  The activities of commercial operators delivering high-speed broadband (HSBB) within BLUE areas are not planned or funded by the State and the Department has no statutory authority to intervene in that regard.  The estate and the premises at the eircode provided in the question are currently capable of receiving speeds in excess of 30 mbps from open eir’s local High Speed Broadband cabinet per information available at bbchecker.comreg.ie/.  The premises along with the rest of the estate is also included in open eir’s Full Fibre to the Home (FTTH) deployment programme per information available at www.openeir.ie/fibre/broadband-checker.  The Department does not have sight of information that provides an estimated timeline of when open eir will provide a full fibre connection. However, open eir have communicated to the Department that they will fibre enable the estate as part of their fibre upgrade plan and 9 properties in the estate have already been fibre enabled by open eir in November 2025.  If a person lives in the BLUE area and after contacting their Retail Service Provider are told they cannot get access to greater than 30Mbps, they should raise a query via the webform which can be accessed by clicking on “contact us” in the Contact section on www.gov.ie/en/publication/5634d-national-broadband-plan-map/ and the Department will escalate with the commercial operator to investigate this matter further. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Culture"
        },
        "showAs": " 260. Deputy Niamh Smyth asked the Minister for Culture, Communications and Sport if he will review correspondence regarding broadband connectivity (details supplied) and address the concerns raised; and if he will make a statement on the matter. [72785/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_239",
          "debateSectionId": "dbsect_239",
          "showAs": "National Broadband Plan",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_239.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_260",
        "questionNumber": 260
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  On 23 April 2024, the Government approved an extension for the waiving of the development contributions in respect of residential development commenced not later than 31 December 2024 and the refunding of Uisce Éireann water and wastewater connection charges in respect of residential development commenced not later than 30 September 2024. The date for the completion of development works on qualifying houses under the schemes was extended from 31 December 2025 to 31 December 2026.  It is not proposed to extend the terms of the scheme again beyond that already approved by Government. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 277. Deputy Niamh Smyth asked the Minister for Housing, Local Government and Heritage if he will review correspondence regarding the multi-unit residential development refund scheme for water/wastewater connection charges (details supplied); if there are plans to extend this scheme; and if he will make a statement on the matter. [72589/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_257",
          "debateSectionId": "dbsect_257",
          "showAs": "Departmental Correspondence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_257.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_277",
        "questionNumber": 277
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Health  After a hearing in the Labor Court in June, it was recommended that a final extension of the current Special Scheme to the 31st of December 2025, at which point anyone remaining on the scheme should transition to the Public Service Sick Leave Scheme. Any employee of the public health sector remaining unwell beyond that date, may utilise the full provisions of the Public Service Sick Leave Scheme which will provide further support. Employees who did not qualify for the Special Scheme but are also impacted by Long-Covid may also utilise the supports of the sick leave scheme. The sick leave scheme provides full pay for three months, followed by half pay for three months, and after that, Temporary Rehabilitative Remuneration may be applied for, which, if granted, provides up to a further 547 days of paid leave. The Critical Illness Protocol that forms part of the sick leave scheme may also provide additional supports if granted. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 396. Deputy Niamh Smyth asked the Minister for Health if she will review correspondence (details supplied); if there are any plans to extend the scheme or move people to a different payment [72853/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_348",
          "debateSectionId": "dbsect_348",
          "showAs": "Departmental Correspondence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_348.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_396",
        "questionNumber": 396
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Health  Under the Health Act 2004, the Health Service Executive (HSE) is required to manage and deliver, or arrange to be delivered on its behalf, health and personal social services. The Minister for Health is prohibited from directing the HSE to provide a treatment or a personal service to any individual or to confer eligibility on any individual.  In relation to the health issues raised, as this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 941. Deputy Niamh Smyth asked the Minister for Health if she will review matters raised in correspondence (details supplied); if they will be prioritised considering the ongoing decline in their condition; if she will clarify the person's position on the waiting list; the expected timeline for treatment; and if she will make a statement on the matter. [71575/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_755",
          "debateSectionId": "dbsect_755",
          "showAs": "Departmental Reviews",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_755.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_941",
        "questionNumber": 941
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  Under the Health (Pricing and Supply of Medical Goods) Act 2013, the HSE has statutory responsibility for decisions on the pricing and reimbursement of medicines and medical devices; therefore, the matter has been referred to the HSE for attention and direct reply to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 957. Deputy Niamh Smyth asked the Minister for Health if she will review the case of a person (details supplied); if she will address the concerns raised; whether there are plans to approve the medication required for this condition for reimbursement under the drugs scheme; and if she will make a statement on the matter. [71718/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_770",
          "debateSectionId": "dbsect_770",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_770.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_957",
        "questionNumber": 957
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1144. Deputy Niamh Smyth asked the Minister for Health if she will review the case of a person (details supplied); if the cross-border directive repayment for this individual can be expedited; and if she will make a statement on the matter. [72505/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_961",
          "debateSectionId": "dbsect_961",
          "showAs": "Departmental Correspondence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_961.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1144",
        "questionNumber": 1144
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for policy and overall funding in relation to public transport; however, I am not involved in the day-to-day operations of public transport. The National Transport Authority (NTA) has statutory responsibility for securing the provision of public passenger transport services nationally and for the scheduling and timetabling of these services in conjunction with the relevant transport operators.  As Minister for Transport, I continue to engage with the NTA on an ongoing basis in relation to maintaining high operational standards on all forms of public transport.  In light of the NTA's responsibility in this area, I have forwarded the Deputy's query to the NTA for direct reply. Please advise my private office if you do not receive a response within ten working days. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 322. Deputy Niamh Smyth asked the Minister for Transport if he will review correspondence (details supplied); if he will address concerns raised therein; and if he will make a statement on the matter. [70932/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_335",
          "debateSectionId": "dbsect_335",
          "showAs": "Departmental Reviews",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_335.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_322",
        "questionNumber": 322
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 562. Deputy Niamh Smyth asked the Minister for Health the reason a person (details supplied) is receiving only 12 hours of home support per week, despite the HSE’s previous indication that 22 hours per week were being provided; if she will address the ongoing absence of weekend home support cover for both individuals; if the promised respite placement from 13-26 January has been formally communicated to the family; and if she will make a statement on the matter. [70942/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_534",
          "debateSectionId": "dbsect_534",
          "showAs": "Home Help Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_534.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_562",
        "questionNumber": 562
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 622. Deputy Niamh Smyth asked the Minister for Health if the case of a person (details supplied) will be reviewed and advice provided on the matter; if they can be moved to the local facility where they are on a list or remain where there are until a bed becomes available to avoid upset; and if she will make a statement on the matter. [71293/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_596",
          "debateSectionId": "dbsect_596",
          "showAs": "Departmental Reviews",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_596.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_622",
        "questionNumber": 622
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter and under the Health (Pricing and Supply of Medical Goods) Act 2013, the HSE has statutory responsibility for decisions on the pricing and reimbursement of medicines and medical devices, this question has been referred to the HSE for attention and direct reply to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-10",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 316. Deputy Niamh Smyth asked the Minister for Health to review the case of a person (details supplied); the reasons this person was refused the treatment referenced in the correspondence; the options available to them; and if she will make a statement on the matter. [70569/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/dbsect_262",
          "debateSectionId": "dbsect_262",
          "showAs": "Medicinal Products",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-10/writtens/mul@/dbsect_262.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-10/pq_316",
        "questionNumber": 316
      },
      "contextDate": "2025-12-10"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Housing, Local Government and Heritage  The Multi-Annual Rural Water Programme (MARWP) is the primary capital funding stream supporting group water schemes, with a focus on ensuring the supply of safe drinking water to households.  Under this cycle of the programme covering the period 2024 to 2026, almost 900 individual applications for funding were received, with more than €180 million approved for over 550 projects.  The Expert Panel, which is tasked with assessing applications and making recommendations for funding under MARWP, has completed its review of the final 30 more complex applications, including the application referenced in the details supplied.  An announcement on the outcome of these remaining applications will be made shortly. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 511. Deputy Niamh Smyth asked the Minister for Housing, Local Government and Heritage the status of an application made to the rural water section (details supplied) in relation to the issue of manganese; and if he will make a statement on the matter. [70004/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_446",
          "debateSectionId": "dbsect_446",
          "showAs": "Water Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_446.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_511",
        "questionNumber": 511
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  I am advised by the Social Welfare Appeals Office that the person concerned submitted an appeal on the decision to refuse their Carers Allowance application. Having considered all the available evidence the Appeals Officer found that the evidence provided did not indicate that the person concerned was providing a total of at least 35 hours care to the care recipient each week at the time of the original application, as required by the governing legislation and the appeal was disallowed on 1st October 2025.  The person concerned then submitted a request for a review of this decision under section 317 of the Social Welfare consolidation act on the 19th of November 2025. The Appeals Officer, having considered that review and the new evidence provided did not find that the original decision was incorrect, and the review was subsequently disallowed on 5th December 2025. The Appeals Officer has provided detailed information in the review decision that outlines the full reasons for their decision which should further assist the person concerned in understanding the reasons for these decisions.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 545. Deputy Niamh Smyth asked the Minister for Social Protection if he will review the case of a person (details supplied); if the decision can be expedited due to the extended waiting time; and if he will make a statement on the matter. [69460/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_473",
          "debateSectionId": "dbsect_473",
          "showAs": "Departmental Correspondence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_473.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_545",
        "questionNumber": 545
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The person concerned was awarded a pro-rata state pension contributory on 21 October 2025 under the Ireland/Australia bilateral agreement. This pension was awarded with effect from 14 October 2018. Arrears due were paid into their account on 5 December 2025.  I hope this clarifies the position for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 568. Deputy Niamh Smyth asked the Minister for Social Protection if he will review the case of a person (details supplied); if, in view of their circumstances, arrears will be expedited; and if he will make a statement on the matter. [70006/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_486",
          "debateSectionId": "dbsect_486",
          "showAs": "Departmental Reviews",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_486.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_568",
        "questionNumber": 568
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, it has been referred to the Health Service Executive for attention and direct reply to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1049. Deputy Niamh Smyth asked the Minister for Health if a hospital appointment will be expedited for a person (details supplied); and if she will make a statement on the matter. [70036/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_872",
          "debateSectionId": "dbsect_872",
          "showAs": "Hospital Appointments Status",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_872.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1049",
        "questionNumber": 1049
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  When attending Higher Education Institutions, a student contribution is paid by all individuals enrolled for education, including apprentices. I remain committed to easing the financial burden on apprentices, students and families to access education in a financially sustainable way.  To that end, I secured €2.5 million in Budget 2026 to permanently lower higher education costs for apprentices. This will permanently lower the student contribution by 17% for more than 14,000 apprentices in the 2025/26 academic year.  All craft apprentices are employees. During the on-the-job phases of a craft apprenticeship, apprentices are paid a wage by their employer. Neither SOLAS nor DFHERIS are responsible for setting apprentice wages. For the majority of craft apprentices, minimum wage rates are agreed between employers and unions via collective bargaining.  Allowances for travel, accommodation and meals are available to craft apprentices. In addition, there are targeted supports for learners from disadvantaged socioeconomic backgrounds to help increase access to apprenticeship, such as the Access to Apprenticeship Initiative. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1092. Deputy Niamh Smyth asked the Minister for Further and Higher Education, Research, Innovation and Science to review correspondence (details supplied); if he will address the concerns raised; and if he will make a statement on the matter. [69093/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_912",
          "debateSectionId": "dbsect_912",
          "showAs": "Apprenticeship Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_912.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_1092",
        "questionNumber": 1092
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Minister for Transport (Deputy Darragh O'Brien)  I propose to take Questions Nos. 191 and 192 together.  I note the costs set out by the company over the period 2021-2025 and that the policy responsibility spans a number of Government Departments.  As Minister for Transport, I am committed to supporting the haulage and road freight sector. In recent years my Department has provided targeted short-term financial supports to operators impacted by the sharp increase in the cost of diesel and other operating costs due to the war in Ukraine.  The collaborative approach taken during Brexit, and COVID was invaluable, and we have now established a permanent Road Freight Forum to continue this dialogue. My Department and I will continue to engage with industry representatives through the Road Freight Forum and Logistics and Supply Chain Skills Group, to develop medium and long-term policies to support the haulage and road freight sector to overcome the dynamic issues they are facing.  I wish to draw your attention to the schemes which provide for electrification of Heavy Duty Vehicle (HDV) fleets and have set out additional information below, in an appendix, for your information.  As Minister for Transport, I also have responsibility for overall policy and funding in relation to the national roads programme. Under the Roads Acts 1993-2015, the operation and management of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned.  Therefore, matters relating to the day-to-day operations regarding national roads, including toll roads, are within the remit of TII. More specifically, the statutory power to levy tolls, to make toll byelaws and to enter into agreements with private investors, are vested in TII under Part V of the Roads Act 1993 (as amended). Moreover, the contracts for the privately-operated toll schemes are commercial agreements between TII and the Public Private Partnership (PPP) concessionaires concerned. Noting the above position, I have referred the question regarding tolls to TII for a direct reply. Please advise my private office if you do not receive a reply within ten working days.  Matters concerning fuel fall under my remit as Minister for Climate, Energy and the Environment. In this regard, The Government is committed to a just transition to climate neutrality that leaves no one behind. Just transition builds on the principles of evidence-based approaches; ensuring that people are equipped with the right skills to benefit from the net zero economy; cost-sharing and equity; and social dialogue with impacted people and communities.  The allocation of Carbon Tax revenues contribute to the principle of cost-sharing. To ensure that the impact of carbon tax increases are progressive through redistribution, Budget 2025 allocated €951 million in carbon tax supports to a range of programmes that support Ireland’s transition to a low carbon economy and protect those most vulnerable. Allocations were prioritised to targeted social welfare interventions; residential and community energy efficiency upgrades; and programmes to incentivise sustainable agriculture and transport initiatives.  With regard to taxation of fuels, all transport fuels are subject to excise duty in the form of Mineral Oil Tax (MOT), and to Value-Added Tax (VAT).  Auto-diesel is the predominant fuel in the transport sector and in November 2021 the applicable MOT rate was €535.46 per 1,000 litres. The current rate of €615.76 per 1,000 litres reflects an increase of €80.30 per 1,000 litres to the carbon component. This increase has been implemented in four equal amounts each October since 2021 under the 10-year carbon tax trajectory.  The Diesel Rebate Scheme (DRS) provides a partial rebate of MOT to qualifying road haulage and bus transport operators, when the average retail price of auto-diesel exceeds €1.00 per litre excluding VAT. The DRS repayment rate has been at the maximum level for almost four years. This is in additional to VAT registered businesses’ ability to deduct the VAT charged on the purchase of business inputs, such as auto diesel or HVO. In 2024 the DRS scheme provided over €31 million in support to haulage companies.  Matters concerning the minimum wage and statutory sick pay are the responsibility of the Department of Enterprise, Trade and Employment. Employment Pay Related Social Insurance and Pension Auto-Enrolment are the responsibility of the Department of Social Protection.     Appendix - Additional Information on Electrification of HGV Fleets   The Zero-Emission Heavy Duty Vehicle Purchase Grant Scheme (ZEHDV) opened in February 2024. The Scheme awards grants to assist companies and enterprises who wish to buy zero-emission heavy duty vehicles (ZEHDV) which are supported by the Scheme instead of buying the diesel equivalent. In November 2024, the scheme was expanded to include purchase grants for recharging infrastructure. The Zero-Emission Heavy Duty Vehicle (ZEHDV) Purchase Grant Scheme is funded by the Department of Transport and administered by Transport Infrastructure Ireland. In July 2025, a fleet assessment scheme was introduced to evaluate current electrical capacity, identify potential upgrades to transformers and substations, and plan for smart energy management systems to avoid excessive demand charges and grid constraints.  The EV Fleet Assessment Grant is a government-funded support scheme that helps businesses explore the transition to electric vehicles (EVs). The scheme offers financial support for an independent fleet assessment carried out by a qualified energy advisor.  The assessment provides:  • A detailed review of your existing fleet, including mileage and fuel consumption  • Identification of routes and vehicles suitable for electrification  • A tailored EV charging plan to support your transition  • Guidance on the type and scale of charging infrastructure required  This support is available to large enterprises, SMEs, and semi-state bodies seeking to decarbonise their fleet but unsure where to begin. Eligible businesses can receive up to €4,000 for fleets of 5–50 vehicles or up to €8,000 for fleets of 51+ vehicles. Site assessments will be supported to evaluate current electrical capacity, identify potential upgrades to transformers and substations, and plan for smart energy management systems to avoid excessive demand charges and grid constraints.  The Zero Emission Vehicles Ireland (ZEVI) division of the Department of Transport engage with the IRHA both individually and as part of ZEVI’s wider Public-Private Vehicles Stakeholder Group and Zero Emission Heavy Duty Vehicles Subgroup. In addition, the IRHA are also part of the HDV Electrification Pathway Working Group which was established in February by ZEVI to support the electrification of the heavy-duty fleet in Ireland. The Working Group is represented by organisations from across the road transport and logistics sector, charge point operators, vehicle manufacturers, motor industry representatives, academia and public policy officials.  The purpose of the Group is to:  • Ensure strong industry input into the development of a HDV Electrification Pathway  • Share knowledge and learnings with a view to progressing HDV electrification  • Investigate barriers to the uptake of zero emission heavy duty vehicles  • Establish the strengths and opportunities for the roll out of HDV infrastructure  • Identify domestic and international case studies that provide opportunities for further knowledge sharing.  The Working Group has been tasked with producing a HDV Electrification Pathway Report. The objective of the Report is to support the electrification of the heavy-duty fleet in Ireland and offer practical solutions and a roadmap towards 2040 and is expected to be published in early 2026. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 191. Deputy Niamh Smyth asked the Minister for Transport if he will review concerns raised by a transport and logistics business (details supplied); if he will address the issues highlighted in the correspondence; and if he will make a statement on the matter. [68560/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_203",
          "debateSectionId": "dbsect_203",
          "showAs": "Haulage Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_203.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_191",
        "questionNumber": 191
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Transport (Deputy Darragh O'Brien)  I propose to take Questions Nos. 191 and 192 together.  I note the costs set out by the company over the period 2021-2025 and that the policy responsibility spans a number of Government Departments.  As Minister for Transport, I am committed to supporting the haulage and road freight sector. In recent years my Department has provided targeted short-term financial supports to operators impacted by the sharp increase in the cost of diesel and other operating costs due to the war in Ukraine.  The collaborative approach taken during Brexit, and COVID was invaluable, and we have now established a permanent Road Freight Forum to continue this dialogue. My Department and I will continue to engage with industry representatives through the Road Freight Forum and Logistics and Supply Chain Skills Group, to develop medium and long-term policies to support the haulage and road freight sector to overcome the dynamic issues they are facing.  I wish to draw your attention to the schemes which provide for electrification of Heavy Duty Vehicle (HDV) fleets and have set out additional information below, in an appendix, for your information.  As Minister for Transport, I also have responsibility for overall policy and funding in relation to the national roads programme. Under the Roads Acts 1993-2015, the operation and management of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned.  Therefore, matters relating to the day-to-day operations regarding national roads, including toll roads, are within the remit of TII. More specifically, the statutory power to levy tolls, to make toll byelaws and to enter into agreements with private investors, are vested in TII under Part V of the Roads Act 1993 (as amended). Moreover, the contracts for the privately-operated toll schemes are commercial agreements between TII and the Public Private Partnership (PPP) concessionaires concerned. Noting the above position, I have referred the question regarding tolls to TII for a direct reply. Please advise my private office if you do not receive a reply within ten working days.  Matters concerning fuel fall under my remit as Minister for Climate, Energy and the Environment. In this regard, The Government is committed to a just transition to climate neutrality that leaves no one behind. Just transition builds on the principles of evidence-based approaches; ensuring that people are equipped with the right skills to benefit from the net zero economy; cost-sharing and equity; and social dialogue with impacted people and communities.  The allocation of Carbon Tax revenues contribute to the principle of cost-sharing. To ensure that the impact of carbon tax increases are progressive through redistribution, Budget 2025 allocated €951 million in carbon tax supports to a range of programmes that support Ireland’s transition to a low carbon economy and protect those most vulnerable. Allocations were prioritised to targeted social welfare interventions; residential and community energy efficiency upgrades; and programmes to incentivise sustainable agriculture and transport initiatives.  With regard to taxation of fuels, all transport fuels are subject to excise duty in the form of Mineral Oil Tax (MOT), and to Value-Added Tax (VAT).  Auto-diesel is the predominant fuel in the transport sector and in November 2021 the applicable MOT rate was €535.46 per 1,000 litres. The current rate of €615.76 per 1,000 litres reflects an increase of €80.30 per 1,000 litres to the carbon component. This increase has been implemented in four equal amounts each October since 2021 under the 10-year carbon tax trajectory.  The Diesel Rebate Scheme (DRS) provides a partial rebate of MOT to qualifying road haulage and bus transport operators, when the average retail price of auto-diesel exceeds €1.00 per litre excluding VAT. The DRS repayment rate has been at the maximum level for almost four years. This is in additional to VAT registered businesses’ ability to deduct the VAT charged on the purchase of business inputs, such as auto diesel or HVO. In 2024 the DRS scheme provided over €31 million in support to haulage companies.  Matters concerning the minimum wage and statutory sick pay are the responsibility of the Department of Enterprise, Trade and Employment. Employment Pay Related Social Insurance and Pension Auto-Enrolment are the responsibility of the Department of Social Protection.     Appendix - Additional Information on Electrification of HGV Fleets   The Zero-Emission Heavy Duty Vehicle Purchase Grant Scheme (ZEHDV) opened in February 2024. The Scheme awards grants to assist companies and enterprises who wish to buy zero-emission heavy duty vehicles (ZEHDV) which are supported by the Scheme instead of buying the diesel equivalent. In November 2024, the scheme was expanded to include purchase grants for recharging infrastructure. The Zero-Emission Heavy Duty Vehicle (ZEHDV) Purchase Grant Scheme is funded by the Department of Transport and administered by Transport Infrastructure Ireland. In July 2025, a fleet assessment scheme was introduced to evaluate current electrical capacity, identify potential upgrades to transformers and substations, and plan for smart energy management systems to avoid excessive demand charges and grid constraints.  The EV Fleet Assessment Grant is a government-funded support scheme that helps businesses explore the transition to electric vehicles (EVs). The scheme offers financial support for an independent fleet assessment carried out by a qualified energy advisor.  The assessment provides:  • A detailed review of your existing fleet, including mileage and fuel consumption  • Identification of routes and vehicles suitable for electrification  • A tailored EV charging plan to support your transition  • Guidance on the type and scale of charging infrastructure required  This support is available to large enterprises, SMEs, and semi-state bodies seeking to decarbonise their fleet but unsure where to begin. Eligible businesses can receive up to €4,000 for fleets of 5–50 vehicles or up to €8,000 for fleets of 51+ vehicles. Site assessments will be supported to evaluate current electrical capacity, identify potential upgrades to transformers and substations, and plan for smart energy management systems to avoid excessive demand charges and grid constraints.  The Zero Emission Vehicles Ireland (ZEVI) division of the Department of Transport engage with the IRHA both individually and as part of ZEVI’s wider Public-Private Vehicles Stakeholder Group and Zero Emission Heavy Duty Vehicles Subgroup. In addition, the IRHA are also part of the HDV Electrification Pathway Working Group which was established in February by ZEVI to support the electrification of the heavy-duty fleet in Ireland. The Working Group is represented by organisations from across the road transport and logistics sector, charge point operators, vehicle manufacturers, motor industry representatives, academia and public policy officials.  The purpose of the Group is to:  • Ensure strong industry input into the development of a HDV Electrification Pathway  • Share knowledge and learnings with a view to progressing HDV electrification  • Investigate barriers to the uptake of zero emission heavy duty vehicles  • Establish the strengths and opportunities for the roll out of HDV infrastructure  • Identify domestic and international case studies that provide opportunities for further knowledge sharing.  The Working Group has been tasked with producing a HDV Electrification Pathway Report. The objective of the Report is to support the electrification of the heavy-duty fleet in Ireland and offer practical solutions and a roadmap towards 2040 and is expected to be published in early 2026. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 192. Deputy Niamh Smyth asked the Minister for Transport if he will review concerns raised by a transport and logistics business (details supplied); if he will address the issues highlighted in the correspondence; and if he will make a statement on the matter. [68561/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_203",
          "debateSectionId": "dbsect_203",
          "showAs": "Haulage Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_203.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_192",
        "questionNumber": 192
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  As this question refers to service matters, I have asked the Health Service Executive (HSE) to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-04",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 392. Deputy Niamh Smyth asked the Minister for Children, Disability and Equality if she will review the case of a person (details supplied); if she will provide an update on their request for an increase in their personal assistant budget; and if she will make a statement on the matter. [68961/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/dbsect_360",
          "debateSectionId": "dbsect_360",
          "showAs": "Departmental Reviews",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-04/writtens/mul@/dbsect_360.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-04/pq_392",
        "questionNumber": 392
      },
      "contextDate": "2025-12-04"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The Department is aware of the situation regarding the service in question.  While no details can be shared regarding the specifics of the fee review decision nor the details of the current issue, the Department can confirm that officials are actively discussing next steps and will contact all stakeholders to discuss the situation shortly.  Department officials will endeavour to support and ensure that all stakeholders are aware of all the options and supports available.  As part of the Case Management process, City or County Childcare Committees (CCC) assist services with issues and difficulties that arise. The CCC may refer Core Funding-partner services facing difficulties to Pobal and the Department to be considered for Sustainability Funding. Sustainability Funding is intended to prevent significant issues that threaten the viability of a service. Any service seeking these supports should contact their City or County Childcare Committee.  City and County Childcare Committees (CCCs) offer a range of assistance to parents in Ireland to help them find and access childcare services in their local area. CCCs can assist in identifying services in their area that have current vacancies, which is particularly helpful in areas with high demand. They guide parents on what to look for when visiting a service, what questions to ask, and how to make an informed decision that aligns with their child's needs. Parents can contact their local CCC directly for this information and support. Contact details for all CCCs can be found on: www.gov.ie/en/department-of-children-disability-and-equality/publications/city-and-county-c. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 220. Deputy Niamh Smyth asked the Minister for Children, Disability and Equality to review the case of an afterschool service (details supplied); and if she will make a statement on the matter. [68182/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_190",
          "debateSectionId": "dbsect_190",
          "showAs": "After-School Support Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_190.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_220",
        "questionNumber": 220
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 236. Deputy Niamh Smyth asked the Minister for Health the reason for the delay with the introduction of a machine (details supplied) coming into commission; and if she will make a statement on the matter. [68181/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_202",
          "debateSectionId": "dbsect_202",
          "showAs": "Hospital Equipment",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_202.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_236",
        "questionNumber": 236
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Health  As your query is regarding an individual case relating to service matters, I have requested the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-03",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 249. Deputy Niamh Smyth asked the Minister for Health the reason a person (details supplied) has been waiting over nine days in Cavan General Hospital for a scan; and if she will make a statement on the matter. [68259/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/dbsect_212",
          "debateSectionId": "dbsect_212",
          "showAs": "Hospital Appointments Status",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-03/writtens/mul@/dbsect_212.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-03/pq_249",
        "questionNumber": 249
      },
      "contextDate": "2025-12-03"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  This Government is committed to ensuring that every child has a positive school experience, with access to qualified and engaged teachers who are dedicated to supporting their learning.  A range of measures have been introduced to support schools in their recruitment efforts. One such measure is the PME Fee Refund Scheme. The Department published Circular 0069/2024 Professional Master of Education (PME) Fee Refund Scheme in September 2024. This circular provides the eligibility criteria and application process for the scheme. The circular also states that applicants must be newly qualified teachers that have successfully completed a PME programme in 2024 calendar year. The completion of the course work in itself does not satisfy the requirement that applicants have successfully completed their PME programme. To have successfully completed a PME programme, a student must have received their results from the provider showing the successful completion of the programme.  As part of the verification process, the Department confirmed with the Teaching Council those applicants who graduated with a PME qualification in 2024.  Over 1,800 applications were received. My Department continues to process applications and expects to have payments processed for eligible applications in the coming weeks. Almost 1,400 teachers have been paid to date and further payments will issue as applications are finalised.  I can confirm that my Department has been in contact with the person referred to in the question in relation to their application. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 214. Deputy Niamh Smyth asked the Minister for Education and Youth if she will review the case of a person (details supplied); if she will provide an update on this person's PME scheme application; and if she will make a statement on the matter. [67351/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_198",
          "debateSectionId": "dbsect_198",
          "showAs": "Education Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_198.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_214",
        "questionNumber": 214
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school to which the Deputy refers was approved to enter the department’s pipeline for a project under my Department's Additional School Accommodation (ASA) Scheme. The project will provide nine general classrooms, two SET rooms, three Science labs & two prep area and a four classroom SEN base. The project was devolved for delivery to Cavan & Monaghan ETB.  Following departmental approval, the project received planning permission with conditions in March 2024. One condition required the demolition of an existing school building, which led to appeals being lodged with An Bord Pleanála. In response, the department advised Cavan & Monaghan ETB and the design team to prepare a revised design and costings based on an alternative approach. This alternative retained the building through extensive refurbishment works and reduced the scope of the planned extension by excluding rooms now accommodated in the refurbished structure. As a result of this revised proposal, all appellants withdrew their appeals.  A developed design and updated cost report for this option was submitted to the department in Q1 2025. Additional information was requested and subsequently provided in Q2 2025. The report is now under review from both technical and cost perspectives, in line with the requirements of the Public Spending Code.  The Department with be in contact with Cavan & Monaghan ETB once this review has been completed. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 282. Deputy Niamh Smyth asked the Minister for Education and Youth for an update on a project (details supplied); and if she will make a statement on the matter. [67996/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_259",
          "debateSectionId": "dbsect_259",
          "showAs": "Departmental Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_259.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_282",
        "questionNumber": 282
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school referred to by the Deputy was approved to enter the Departments pipeline of school buildings projects to provide the following accommodation: eight General Classrooms, four Special Education Tuition rooms, one Music Room, one Textiles Room, one Art Room, one Multimedia Room, two Science Laboratories and Preparation Area, one Library and a General Purpose/Dining Hall. The project has been devolved for delivery to the school authority.  A Stage 2b report was submitted to my Department in October 2025 and is currently undergoing a detailed review from a technical and cost perspective. Given the scale and complexity of this project the Stage 2b report will require a thorough and intensive review from both a technical and cost perspective in accordance with the requirements of the Public Spending Code. All projects, including this one, will undergo the necessary due diligence outlined in the Public Infrastructure Guidelines. Managing timing, scope, and cost is crucial to staying within budgetary limits for the overall program.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  My department is now preparing an NDP implementation plan which is due for publication later in the year. This plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 283. Deputy Niamh Smyth asked the Minister for Education and Youth for an update on a project (details supplied); and if she will make a statement on the matter. [67997/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_260",
          "debateSectionId": "dbsect_260",
          "showAs": "Departmental Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_260.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_283",
        "questionNumber": 283
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school referred to by the Deputy was approved under the Additional School Accommodation Scheme to provide twenty three general classrooms, five SET rooms, one Multimedia room, one DCG room, three Science labs and two prep areas, one Home Economics room, one Art room, one Construction Studies room, one Engineering Room, one Tech prep room, one Staff room, one GP/Dining room and a two classroom SEN base, along with refurbishment works to local Community Centres to deliver interim teaching space. The project is devolved to Cavan and Monaghan Education and Training Board for delivery.  I can confirm that this project received my departments approval to progress to Stage 2b (developed design) of the architectural planning design process in December 2023. In June 2025 the Stage 2b report, which is post planning was received by my department.  Given the scale and complexity of this project the Stage 2b report will require a thorough and intensive review from both a technical and cost perspective in accordance with the requirements of the Public Spending Code. All projects, including this one, will undergo the necessary due diligence outlined in the Public Infrastructure Guidelines. Managing timing, scope, and cost is crucial to staying within budgetary limits for the overall program.  Since 2020, my department has invested over €6 billion in our schools throughout the country under the National Development Plan, involving the completion of over 1,300 school building projects. Government support for this investment, including by way of supplementary capital funding, has delivered real benefits for school communities. Supplementary capital funding of €210 million approved by Government has brought the total capital allocation for 2025 for my department to €1.6 billion.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs. In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  My department is now preparing an NDP implementation plan which is due for publication later in the year. This plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 284. Deputy Niamh Smyth asked the Minister for Education and Youth the position regarding a project (details supplied); and if she will make a statement on the matter. [67998/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_261",
          "debateSectionId": "dbsect_261",
          "showAs": "Departmental Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_261.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_284",
        "questionNumber": 284
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  I can confirm that my department is in receipt of an application for funding under the Additional Schools Accommodation (ASA) scheme from the school in question. The application was received in September 2025 and sought accommodation in the form of a Music room, Textiles room, Design and Computer Graphics room, Multimedia room and a Science lab and Prep area.  The purpose of my department’s ASA scheme is to ensure that essential mainstream classroom accommodation and accommodation for pupils with special education needs is available to cater for pupils enrolled each year, where the need cannot be met by the school’s existing accommodation or by available accommodation at other schools in the area.  I am pleased to inform the Deputy that the school in question was approved a traditional build project for a Home economics room, an Engineering room and prep area, and a Construction studies prep area, and this project is currently at stage 2b. In addition, the school was approved two modular Mainstream classrooms in 2023, and this project is now complete.  I can advise the Deputy that the school also submitted an application under the ASA scheme in February 2025 for special class accommodation and a replacement mainstream classroom. The school had requested that this accommodation be added to their traditional build project however given the delays this would have entailed the school agreed to allow its stage 2b project proceed and to have its accommodation needs reviewed at a later stage. The school was advised, as an interim measure, that they could apply for funding to reconfigure current accommodation for a special class.  The school’s applications for additional accommodation are currently being considered and the school will be contacted directly once a decision has been made. I can only seek to assure you that we will advance this matter as quickly as possible and that we are very conscious that where additional accommodation is required, a significant lead-in time is necessary for a variety of reasons. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 288. Deputy Niamh Smyth asked the Minister for Education and Youth for an update on a project (details supplied); and if she will make a statement on the matter. [68003/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_264",
          "debateSectionId": "dbsect_264",
          "showAs": "Departmental Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_264.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_288",
        "questionNumber": 288
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school to which the Deputy refers was approved to enter the department’s pipeline for a project under my Department's Additional School Accommodation (ASA) Scheme. The project will provide four General classrooms, seven SET rooms, three Science labs/two Prep rooms, two Engineering rooms, two Tech rooms/two Prep rooms, one Graphics room, one Art room, one Home Economics room, one Textiles room, five Project stores, one General Purpose Hall and a two Classroom SEN base. Delivery of this project has been devolved to Cavan & Monaghan ETB.  I can confirm that this project received my departments approval to go to planning in May 2025 and my department now awaits a post planning (developed design) report from Cavan & Monaghan ETB for review.  At this early stage, it is not possible to predict when a significant school building project of this nature will go to construction, nor when it will be completed, as progress depends upon many contingent factors that can arise.  My department will continue to engage with the school authority to provide practical advice and assistance on this much needed project. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 289. Deputy Niamh Smyth asked the Minister for Education and Youth for an update on project (details supplied); and if she will make a statement on the matter. [68004/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_265",
          "debateSectionId": "dbsect_265",
          "showAs": "Departmental Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_265.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_289",
        "questionNumber": 289
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The position outlined in my reply to Parliamentary Question No. 126 of 5 November 2025 remains the same, which set out that there are no minimum terms of employment associated with this programme, which remains at the discretion of each local authority in accordance with section 159 of the Local Government Act 2001 which provides that each Chief Executive is responsible for the staffing and organisational arrangements necessary for carrying out the functions of the local authority for which he/she is responsible. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 310. Deputy Niamh Smyth asked the Minister for Housing, Local Government and Heritage further to Parliamentary Question No. 126 of 5 November 2025, to review the correspondence (details supplied); to address the issue raised therein; and if he will make a statement on the matter. [67365/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_288",
          "debateSectionId": "dbsect_288",
          "showAs": "Heritage Promotion",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_288.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_310",
        "questionNumber": 310
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  Disability Allowance (DA) is a means-tested payment for people aged 16 to under 66 with a specified disability substantially restricting their ability to work. The person must also satisfy a means test and be habitually resident in the State.  The Department received application for DA on 13 May 2025. This was initially disallowed due to insufficient medical evidence. The person concerned was informed of her right to request a review or appeal. Following receipt of further medical evidence, a review was conducted that upheld the original decision on 16 June 2025.  Subsequently, the person concerned successfully appealed this decision, and DA was awarded from 14 May 2025, with notification issued on 15 September 2025. Payments commenced on 8 October 2025.  Backdating can be allowed up to six months where good cause is shown, including incapacity due to illness or infirmity. Lack of knowledge alone is not sufficient but complex circumstances such as hospitalisation and medical incapacity will be considered. The person concerned was in receipt of an alternative welfare payment during the DA decision & appeal process, this would impact the amount payable in arrears along with the backdating review.  Officials from my Department will examine the details provided by the Deputy and see if backdating of the DA claim can be applied in this individual's case. They will contact the person concerned directly if any further information is required.  On the matter of the overpayment and the withholding of a portion of her DA arrears, the Department is obliged to recoup overpayments in a timely manner, including offsetting arrears against any debt owed, as permitted under statutory regulations.  I trust this clarifies the position for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 362. Deputy Niamh Smyth asked the Minister for Social Protection if he will consider correspondence from a person (details supplied); and if he will make a statement on the matter. [67959/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_324",
          "debateSectionId": "dbsect_324",
          "showAs": "Departmental Correspondence",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_324.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_362",
        "questionNumber": 362
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 447. Deputy Niamh Smyth asked the Minister for Agriculture, Food and the Marine if he will outline all grants and funding supports available to farmers for the repair or restoration of farm buildings; and if he will make a statement on the matter. [67269/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_391",
          "debateSectionId": "dbsect_391",
          "showAs": "Agriculture Supports",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_391.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_447",
        "questionNumber": 447
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Agriculture"
        },
        "showAs": " 448. Deputy Niamh Smyth asked the Minister for Agriculture, Food and the Marine the forestry grants and funding schemes that are currently open for applications; and if he will make a statement on the matter. [67290/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_392",
          "debateSectionId": "dbsect_392",
          "showAs": "Forestry Sector",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_392.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_448",
        "questionNumber": 448
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Health  Under the Health Act 2004, the Health Service Executive (HSE) is required to manage and deliver, or arrange to be delivered on its behalf, health and personal social services. The Minister for Health is prohibited from directing the HSE to provide a treatment or a personal service to any individual or to confer eligibility on any individual.  In relation to the particular query raised, as this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 575. Deputy Niamh Smyth asked the Minister for Health the status of the case of a person (details supplied) who has been waiting over 24 months for a knee operation; and if she will make a statement on the matter. [67680/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_512",
          "debateSectionId": "dbsect_512",
          "showAs": "Hospital Waiting Lists",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_512.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_575",
        "questionNumber": 575
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  As the Deputy is aware, the decision on eligibility for a student grant is a matter, in the first instance, for the awarding authority, SUSI to determine.  The qualifying criteria for the special rate of maintenance grant in the 2025/2026 academic year as specified under the Student Grant Scheme 2025 are as follows:  1. Students must qualify for the standard rate of grant;  2. Total reckonable income (net of income disregards and Increase for Qualified Child) must not exceed €27,400 for undergraduate students, and  3. As at 31st December 2024, the reckonable income must include one of the eligible long-term social welfare payments prescribed in the Student Grant Scheme.  With regard to the specific application, I have been advised by my officials that the student to whom the Deputy refers was awarded the full Non-adjacent standard rate of maintenance grant by the awarding authority, SUSI, together with 100% student contribution or 100% tuition fees whichever applies. While the student’s reckonable income was under the 2025/2026 threshold of €27,400, they were not in receipt of an eligible special rate payment on 31st December 2024.  If the student's circumstances change and they are awarded an eligible payment in the future they may request an internal review by emailing the SUSI Support Desk at support@susi.ie.  In terms of other supports available, students in third-level institutions experiencing exceptional financial need can apply for support under the Student Assistance Fund (SAF). Students can apply for the SAF to help with either temporary or ongoing financial difficulties and can be assisted towards their rent, childcare costs, transport costs, medical costs and books/class materials. This Fund is administered on a confidential, discretionary basis and assists students, in a sensitive and compassionate manner, who might otherwise be unable to continue their third level studies due to their financial circumstances. Details of this fund are available from the Access Office in the third level institution attended.  In addition, tax relief at the standard rate of tax may be claimed in respect of tuition fees paid for approved courses at approved colleges of higher education including approved undergraduate and postgraduate courses in EU Member States and in non-EU countries. Further information on this tax relief is available from the Revenue Commissioners website: www.revenue.ie. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 702. Deputy Niamh Smyth asked the Minister for Further and Higher Education, Research, Innovation and Science to review the case of a person (details supplied); the reason this person was refused the special rate of SUSI; and if he will make a statement on the matter. [67305/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_629",
          "debateSectionId": "dbsect_629",
          "showAs": "Grant Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_629.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_702",
        "questionNumber": 702
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  As the Deputy is aware, the decision on eligibility for a student grant is a matter, in the first instance, for the awarding authority, SUSI to determine.  As per Article 22 (3) of the Student Grant Scheme 2025, in calculating reckonable income, the awarding authority shall consider income from all sources whether it arises in the State or not. Article 22 (5) states that, for the purposes of determining the reckonable income of an applicant, the aggregate of any of the following shall be deducted - overtime payments earned in the reference period that are not recurring payments.  Where an applicant is aggrieved by a determination of the awarding authority, they may appeal in the first instance to SUSI. Where a student has had an appeal turned down in writing by an appeals officer in SUSI and remains of the view that the scheme has not been interpreted correctly in their case, an appeal may be submitted to the independent Student Grants Appeals Board within the required time-frame.  The student referred to submitted an appeal to the Independent Student Grant Appeals Board (the Board) and the appeal was considered by the Board on the 21 October 2025. The Board requested additional documentation in relation to overtime payments. The Board considered the documentation which included payslips submitted by the student and determined that overtime payments were recurring. Therefore these payments must be included in calculating reckonable income.  The determination of the Board was communicated directly to the student on that date and the decision of the Board is final.  Your attention is drawn to Section 21(6) of the Student Support Act 2011 which sets out provisions for appealing to the High Court on a point of law.  In terms of other supports available, students in third-level institutions experiencing exceptional financial need can apply for support under the Student Assistance Fund (SAF). Students can apply for the SAF to help with either temporary or ongoing financial difficulties and can be assisted towards their rent, childcare costs, transport costs, medical costs and books/class materials. This Fund is administered on a confidential, discretionary basis and assists students, in a sensitive and compassionate manner, who might otherwise be unable to continue their third level studies due to their financial circumstances. Details of this fund are available from the Access Office in the third level institution attended.  In addition, tax relief at the standard rate of tax may be claimed in respect of tuition fees paid for approved courses at approved colleges of higher education including approved undergraduate and postgraduate courses in EU Member States and in non-EU countries. Further information on this tax relief is available from the Revenue Commissioners website: www.revenue.ie. ",
        "questionType": "written",
        "date": "2025-12-02",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 703. Deputy Niamh Smyth asked the Minister for Further and Higher Education, Research, Innovation and Science to review the case of a person (details supplied); if there is any avenue available to seek a review or appeal of the decision in question; and if he will make a statement on the matter. [67343/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/dbsect_630",
          "debateSectionId": "dbsect_630",
          "showAs": "Grant Payments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-02/writtens/mul@/dbsect_630.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-02/pq_703",
        "questionNumber": 703
      },
      "contextDate": "2025-12-02"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The purpose of the Climate Action Summer Works Scheme (CASWS) is to enable individual school authorities to undertake small-scale building works on a devolved basis that, ideally, can be carried out during the summer months or at other times that avoid disrupting the operation of the school. The CASWS operates on a multi-annual basis across a number of categories of works.  It is envisaged that approvals in any given year will involve a spread of categories rather than the traditional single category at a time. This is aimed at managing market capacity and maximising value for money opportunities for school authorities.  The CASWS will operate on a multi-annual basis. In November 2025, the Minister announced the first tranche of approvals under the new Climate Action Summer Works Scheme. 297 projects were approved to proceed and involve primary, post primary and special schools, along with projects in all counties and across all categories of works. The investment in the first tranche of applications is in the region of €90m.  Given that funding is limited in any particular year it is necessary to prioritise applications. Under the new climate action summer works scheme which operates on a multi annual basis, like previous summer works schemes, applications from schools that are not reached for funding or market prioritisation reasons in 2026 will qualify to be assessed for purposes of the funding available for climate action summer works in subsequent years. So schools can rest assured that their applications remain live and any costs incurred in the employment of a consultant to assist the schools in making their application has not been wasted but was necessary for the following reasons:  • For a professional diagnosis of the full nature and extent of the proposed project.  • To verify the absolute necessity for the project relative to the impact of not doing it.  • To provide a detailed breakdown of the cost, A breakdown of costs must be provided, including costs per m² of building area affected by the proposed works.  • To inform the prioritisation of projects on the basis of professional objective information.  It is anticipated that the next tranche of approvals will be in the latter half of 2026.  Full details of the of the announcement and the list of schools approved in the first tranche, the Circular (0029/2025) for the scheme and guidance documents for schools can be found at the below link;  [ gov.ie Summer Works Scheme ] (www.gov.ie/en/department-of-education/services/summer-works-scheme/). ",
        "to": {
          "showAs": "Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Niamh Smyth",
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_261.xml"
            }
          },
          "debateSectionId": "dbsect_261",
          "showAs": "Departmental Inquiries",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_261"
        },
        "questionNumber": 301,
        "date": "2025-11-27",
        "showAs": " 301. Deputy Niamh Smyth asked the Minister for Education and Youth to review correspondence from a school regarding a scheme (details supplied); if she will review the costs and points being made for the application by the school; and if she will make a statement on the matter. [66864/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_301"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  As this is an operational matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "to": {
          "showAs": "Health",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Niamh Smyth",
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_507.xml"
            }
          },
          "debateSectionId": "dbsect_507",
          "showAs": "Departmental Schemes",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_507"
        },
        "questionNumber": 579,
        "date": "2025-11-27",
        "showAs": " 579. Deputy Niamh Smyth asked the Minister for Health if she will review matters raised in correspondence (details supplied) regarding the fair deal scheme; if she will address the concerns raised; and if she will make a statement on the matter. [67239/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_579"
      },
      "contextDate": "2025-11-27"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science  Officials from my Department are engaging with SUSI to collect and collate the information requested by the Deputy. I will be back to the Deputy as soon as possible. ",
        "to": {
          "showAs": "Further and Higher Education",
          "roleType": null,
          "roleCode": null,
          "uri": null
        },
        "by": {
          "showAs": "Niamh Smyth",
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03"
        },
        "questionType": "written",
        "house": {
          "committeeCode": "",
          "houseNo": "34",
          "showAs": "34th Dáil",
          "chamberType": "house",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34"
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/mul@/dbsect_523.xml"
            }
          },
          "debateSectionId": "dbsect_523",
          "showAs": "Departmental Correspondence",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-27/writtens/dbsect_523"
        },
        "questionNumber": 599,
        "date": "2025-11-27",
        "showAs": " 599. Deputy Niamh Smyth asked the Minister for Further and Higher Education, Research, Innovation and Science if he will review the case of a person (details supplied); if an avenue is available for them to seek a review or appeal of the decision in question; if the specific questions set out in correspondence will be addressed; and if he will make a statement on the matter. [67218/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-27/pq_599"
      },
      "contextDate": "2025-11-27"
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 103. Deputy Niamh Smyth asked the Minister for Climate, Energy and the Environment if he will review correspondence regarding a person (details supplied); if, in view of the circumstances the person will be eligible for a grant; and if he will make a statement on the matter. [66683/25] ",
        "answerText": "",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_103",
        "debateSection": {
          "showAs": "Grant Payments",
          "debateSectionId": "dbsect_106",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_106.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_106"
        },
        "date": "2025-11-26",
        "questionNumber": 103,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Niamh Smyth",
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03"
        },
        "questionType": "written",
        "to": {
          "showAs": "Climate",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "contextDate": "2025-11-26",
      "question": {
        "showAs": " 299. Deputy Niamh Smyth asked the Minister for Health the reason a person (details supplied) has not been seen by mental health services; and if she will make a statement on the matter. [66473/25] ",
        "answerText": "",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-26/pq_299",
        "debateSection": {
          "showAs": "Mental Health Services",
          "debateSectionId": "dbsect_258",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/mul@/dbsect_258.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-26/writtens/dbsect_258"
        },
        "date": "2025-11-26",
        "questionNumber": 299,
        "house": {
          "showAs": "34th Dáil",
          "houseNo": "34",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "chamberType": "house",
          "committeeCode": ""
        },
        "by": {
          "showAs": "Niamh Smyth",
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03"
        },
        "questionType": "written",
        "to": {
          "showAs": "Health",
          "roleCode": null,
          "roleType": null,
          "uri": null
        }
      }
    },
    {
      "question": {
        "showAs": " 298. Deputy Niamh Smyth asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation to review correspondence from a local authority (details supplied); and if he will make a statement on the matter. [65600/25] ",
        "debateSection": {
          "showAs": "Local Authorities",
          "debateSectionId": "dbsect_292",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_292",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_292.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Niamh Smyth",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "memberCode": "Niamh-Smyth.D.2016-10-03"
        },
        "questionNumber": 298,
        "answerText": "",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Public Expenditure",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_298",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "showAs": " 377. Deputy Niamh Smyth asked the Minister for Education and Youth for an update on the new school for a location (details supplied); and if she will make a statement on the matter. [65445/25] ",
        "debateSection": {
          "showAs": "Schools Building Projects",
          "debateSectionId": "dbsect_369",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/dbsect_369",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-25/writtens/mul@/dbsect_369.xml"
            }
          }
        },
        "date": "2025-11-25",
        "by": {
          "showAs": "Niamh Smyth",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "memberCode": "Niamh-Smyth.D.2016-10-03"
        },
        "questionNumber": 377,
        "answerText": " Minister for Education and Youth  The State owned property in Castleblaney has been repurposed to a high standard and this has facilitated the establishment of Monaghan Community Special School for the 2025/26 school year. The property provides a good location for developing the school.  The National Council for Special Education (NCSE) is the statutory body responsible for the provision of special education and allocating supports for children with special educational needs.  My Department and the NCSE monitors the need for additional special class and special school capacity very closely and will continue to monitor the situation in County Monaghan and engage with the school patron, Cavan and Monaghan ETB in this regard. ",
        "to": {
          "roleType": null,
          "uri": null,
          "showAs": "Education",
          "roleCode": null
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-25/pq_377",
        "questionType": "written",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "chamberType": "house",
          "houseNo": "34"
        }
      },
      "contextDate": "2025-11-25"
    },
    {
      "question": {
        "to": {
          "roleCode": null,
          "uri": null,
          "showAs": "Health",
          "roleType": null
        },
        "house": {
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": "",
          "houseCode": "dail",
          "showAs": "34th Dáil"
        },
        "date": "2025-11-20",
        "debateSection": {
          "debateSectionId": "dbsect_461",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/dbsect_461",
          "showAs": "Hospital Charges",
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-20/writtens/mul@/dbsect_461.xml"
            }
          }
        },
        "questionType": "written",
        "showAs": " 591. Deputy Niamh Smyth asked the Minister for Health if she will review correspondence (details supplied) regarding an accident and emergency charge issued by Cavan General Hospital; her views on whether the application of this charge was correct in circumstances where the patient could not be admitted due to the unavailability of beds;; and if she will make a statement on the matter. [64711/25] ",
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-20/pq_591",
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionNumber": 591,
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth"
        }
      },
      "contextDate": "2025-11-20"
    },
    {
      "question": {
        "date": "2025-11-19",
        "house": {
          "chamberType": "house",
          "houseCode": "dail",
          "showAs": "34th Dáil",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "committeeCode": "",
          "houseNo": "34"
        },
        "questionType": "written",
        "by": {
          "memberCode": "Niamh-Smyth.D.2016-10-03",
          "showAs": "Niamh Smyth",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03"
        },
        "showAs": " 173. Deputy Niamh Smyth asked the Minister for Social Protection if a request (details supplied) can receive consideration in view of the person's medical circumstances; and if he will make a statement on the matter. [64038/25] ",
        "to": {
          "roleType": null,
          "showAs": "Social",
          "roleCode": null,
          "uri": null
        },
        "debateSection": {
          "formats": {
            "pdf": null,
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/mul@/dbsect_146.xml"
            }
          },
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-19/writtens/dbsect_146",
          "showAs": "Social Welfare Schemes",
          "debateSectionId": "dbsect_146"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-19/pq_173",
        "answerText": " Minister for Social Protection  Under the Make Work Pay initiative, a person is entitled to retain their entitlement to Free Travel for a period of 5 years after their entitlement to Disability Allowance ceases due to taking up employment. The entitlement of the person concerned to Free Travel was linked to their Disability Allowance payment. The 5 year extension of the Free Travel entitlement is now due to end and the person concerned will be notified in writing.  Persons, aged over 17 and under 66, who are medically certified as being unfit to drive may also qualify for Free Travel. To qualify, a person must:  • have never been medically fit to drive due to a disability; or  • be deemed medically unfit to drive for a period of at least one year.  There is no requirement to satisfy a means test or that the person be in receipt of a Social Protection payment to qualify for Free Travel for those medically unfit to drive.  Application forms are available to download from the on www.gov.ie/ft. Alternatively, application forms may be obtained from any Intreo Centre, or by contacting the Free Travel Section by telephone at 0818 200 400 or by email at freetravelqueries@welfare.ie. Information in relation to Free Travel is also available on the Citizen's Information website.  I hope this clarifies the matter for the Deputy. ",
        "questionNumber": 173
      },
      "contextDate": "2025-11-19"
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 203,
        "showAs": " 203. Deputy Niamh Smyth asked the Minister for Climate, Energy and the Environment if he will review matters raised in correspondence (details supplied); if he will address the specific questions raised therein; and if he will make a statement on the matter. [62886/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Climate"
        },
        "by": {
          "showAs": "Niamh Smyth",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "memberCode": "Niamh-Smyth.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_203",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_162",
          "showAs": "Energy Policy",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_162",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_162.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister for Climate, Energy and the Environment  The introduction of a private wire’s regime is a priority for the Government as set out in the Programme for Government. Following on from the approval of the Policy Statement on Private Wires by Government on 15 July this year, my Department is working on drafting the general scheme for the private wires legislation. It is hoped to have the general scheme approved by Government by the end of the year, after which the drafting of the Bill will commence. The legislation will be drafted to reflect the guiding principles of the policy statement and clarify the necessary regulation for the building of Private Wires in the policy’s 4 specified use cases.  It is envisaged that the Bill will be enacted in 2026 following Oireachtas approval. The necessary secondary legislation and regulations will then follow.  At this time a pilot phase is not anticipated and more information on the specificities of the regulation will follow in the coming months. Engagement with key stakeholders is ongoing. ",
        "date": "2025-11-18"
      }
    },
    {
      "contextDate": "2025-11-18",
      "question": {
        "questionNumber": 257,
        "showAs": " 257. Deputy Niamh Smyth asked the Minister for Transport if he will review the case of a person (details supplied); if the decision on the RSA compensation claim could be expedited; if consideration will be given to reimbursing the cost of two additional driving lessons booked, one the day before and one on the morning of the cancelled test, which proven unnecessary due to the last-minute cancellation; and if he will make a statement on the matter. [62859/25] ",
        "house": {
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "chamberType": "house",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34",
          "committeeCode": ""
        },
        "to": {
          "uri": null,
          "roleType": null,
          "roleCode": null,
          "showAs": "Transport"
        },
        "by": {
          "showAs": "Niamh Smyth",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Niamh-Smyth.D.2016-10-03",
          "memberCode": "Niamh-Smyth.D.2016-10-03"
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-11-18/pq_257",
        "questionType": "written",
        "debateSection": {
          "debateSectionId": "dbsect_205",
          "showAs": "Driver Test",
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/dbsect_205",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-11-18/writtens/mul@/dbsect_205.xml"
            },
            "pdf": null
          }
        },
        "answerText": " Minister of State at the Department of Transport  Under the Road Safety Authority Act 2006, the Road Safety Authority (RSA) has statutory responsibility for the National Driver Testing Service. In that regard, the operation of the service does not fall under the direct control of the Minister and it would not be appropriate for the Minister to intervene in individual cases.  Given the RSA's responsibility in this matter, I have referred the Deputy's question to the RSA for direct response. Please contact my office if a reply is not received within ten days. ",
        "date": "2025-11-18"
      }
    }
  ]
}