{
  "head": {
    "counts": {
      "questionCount": 3068,
      "resultCount": 3068
    }
  },
  "results": [
    {
      "question": {
        "answerText": " Minister of State at the Department of Children, Disability and Equality  Under the Disability Act, an Assessment of Need is an assessment process carried out by the HSE where a person is of the opinion that he/she may have a disability, for anyone born after 1st June 2002. It first establishes whether the person has a disability (as defined within the Act). It then identifies the health and education needs of the person with a disability and the services required to meet those needs.  On December 9th, Government announced a series of reforms to the Assessment of Need process which will make the process more effective and efficient for children and families. These reforms include changes to Part 2 of the Disability Act, 2005, which provides for Assessments of Need.  The General Scheme of the Disability (Amendment) Bill 2025 was approved by Government on 9 December and will be published on the Department’s website shortly. As part of the development of the General Scheme, a Regulatory Impact Assessment was prepared, and this will also be published.  These changes will not remove any rights for parents to apply for an Assessment of Need for their child, nor will they alter the statutory six-month timeline set out in the Disability Act.  Ensuring that there are sufficient resources allocated to the delivery of the Assessment of Need process, both in terms of staffing and financial resources, continues to be focus for the Department and the HSE.  In 2026, the HSE is establishing eleven new teams, initially, to support HSE assessment processes, including Assessments of Need. Each team will include a psychologist, a speech and language therapist, an occupational therapist, and an administrator, to provide clinical guidance where required throughout the process.  Work is also ongoing to increase the staffing capacity of the HSE Assessment of Need Teams including assessment officers, liaison officers and administrative supports.  Budget 2026 also provides €20million in funding for the continuation of the Targeted Waitlist Initiative. This supports the delivery of Assessments of Need to those families who have been waiting the longest, through the procurement of clinical assessments from approved private providers.  Recent HSE data shows that over 6,300 clinical assessments have been commissioned from private providers since the Initiative started in June 2024. It is expected that a further 6,000 clinical assessments will be commissioned in 2026.  The provision of an effective and efficient Assessment of Need system continues to be a priority for Government. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 27. Deputy Pádraig O'Sullivan asked the Minister for Children, Disability and Equality if recruitment has commenced for the expansion of the 11 proposed inreach specialist teams, and for the additional assessment and liaison officers announced as part of the recent reforms to the assessment of need process; the number of positions approved; the roles being recruited for; and if she will make a statement on the matter. [72282/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_69",
          "debateSectionId": "dbsect_69",
          "showAs": "Disabilities Assessments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_69.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_27",
        "questionNumber": 27
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  Under the Disability Act, an Assessment of Need is an assessment process carried out by the HSE where a person is of the opinion that he/she may have a disability, for anyone born on/after 1st June 2002. It first establishes whether the person has a disability (as defined within the Act). It then identifies the health and education needs of the person with a disability and the services required to meet those needs.  Application numbers for the four Cork LHOs increased by 29% to 1,497 in the first nine months of this year compared to the same period in 2024. At the same time, the number of completed assessment of need reports increased by 15.5% to 760 for the same period compared to 2024. This is in line with an overall increase in both applications and in completed reports nationally.  On December 9th, Government announced a series of reforms to the Assessment of Need process which will make the process more effective and efficient for children and families and move towards more assessments being delivered within the statutory 6-month timeframe.  These reforms will include legislative changes to Part 2 of the Disability Act 2005, which addresses Assessment of Need. These changes will not remove any rights for parents to apply for an Assessment of Need for their child, nor will they alter the statutory six-month timeline set out in the Disability Act.  As part of the reforms to the Assessment of Need process, additional supports will be provided for the assessment officers including:  • The development of new statutory guidelines to ensure that Assessments of Need focus on identifying a child’s needs, engaging in more intensive assessments only where required to identify those needs.  • The establishment by the HSE of eleven new teams, initially, to support HSE assessment processes, including Assessments of Need. Each team will include a psychologist, a speech and language therapist, an occupational therapist, and an administrator, providing clinical guidance where required throughout the process. The final design, specific functions and locations of the teams are currently being finalised by the HSE.  • A continued focus by the HSE on the training and development of assessment officers.  The Department is also working with the HSE to identify further opportunities to enhance processes and increase administrative supports for HSE assessment officers.  The provision of an effective and efficient Assessment of Need system continues to be a priority for the Government. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 74. Deputy Pádraig O'Sullivan asked the Minister for Children, Disability and Equality if the recently announced reforms to the assessment of need process will address regional disparities, especially in Cork where there are severe shortages; if regions with the longest waiting lists will receive priority hiring and deployment of in reach teams; and if she will make a statement on the matter. [72283/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_117",
          "debateSectionId": "dbsect_117",
          "showAs": "Disabilities Assessments",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_117.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_74",
        "questionNumber": 74
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  The Home Energy Upgrade Loan Scheme is intended to play a crucial role in helping homeowners invest in energy upgrades to make their homes warmer, healthier and more comfortable, with lower emissions and lower bills.  The scheme is available nationwide and homeowners can borrow from €5,000 to €75,000 on an unsecured basis for a term of up to 10 years with rates from as low as 2.99% (price varying depending on the finance provider).  Loan applications are processed, validated and approved by the participating finance providers.  Only loans that have been drawn down under the scheme are uploaded by the finance providers to the Strategic Banking Corporation of Ireland's (SBCI) reporting system.  At the end of September 2025, there were 776 loans drawn to a value of €38,258,801. The Deputy may wish to note that as uptake figures in certain counties mean that it could be possible to identify individual homeowners, regional figures are reported instead. To end September 2025, 111 loans were drawn in the South West region to a value of €5,462,381.  In line with the Programme for Government’s commitment to “Promote the €500 million Home Energy Upgrade Loan Scheme, offering low interest loans for home energy upgrades, from €5,000 to €75,000”, my Department continues to work closely with the SBCI, the SEAI and the participating finance providers to increase awareness of, and demand for, the scheme and drive additional uptake in 2025 and beyond.  The details for home energy upgrades in Cork in 2025 to end November, broken down by the schemes requested, are provided in the following table. Please note that while some of these homeowners may have also drawn down the Home Energy Upgrade Loan, no data is available linking these schemes.  The total number of homes retrofitted under SEAI schemes in 2023 was 47,953 and in 2024 was 53,984.  From January to end November 2025, 52,415 upgrades have been completed representing sustained and significant increases each year.   Home Energy Upgrades in Cork – January 2025 to 30 November 2025       Scheme      Number of Property Upgrades      Amount Funded       National Home Energy Upgrade Scheme    145    €3,087,935      Better Energy Homes    1,287    €3,090,633      Solar PV    3811    €7,346,040      Warmer Homes Scheme    730    €14,334,618       Total – Cork 2025      5,973      €27,859,226       ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 125. Deputy Pádraig O'Sullivan asked the Minister for Climate, Energy and the Environment the number of approvals and drawdowns for the home energy upgrade scheme loan in Cork city and Cork county to date in 2025, in tabular form (details supplied); and if he will make a statement on the matter. [72248/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_156",
          "debateSectionId": "dbsect_156",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_156.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_125",
        "questionNumber": 125
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Climate, Energy and the Environment  Energy Security in Ireland to 2030 was published in November 2023 and outlines a strategy to ensure energy security in Ireland for this decade, while ensuring a sustainable transition to a carbon neutral energy system by 2050. The report was published as part of an Energy Security Package, containing a range of supplementary analyses, consultations, and reviews, which have informed the recommendations and actions related to energy security.  The 28 actions outlined in Energy Security in Ireland to 2030 are overseen by the Energy Security Group (ESG), which is chaired by the Secretary General of my Department and attended by officials from relevant Government Departments and Agencies.  The table below provides an update of the actions to end Q3 2025.     ACTION    STATUS    ESTIMATED TIMELINE FOR DELIVERY      1. To transpose the European Energy Efficiency Directive    IN PROGRESS    Several pieces of legislation which will transpose the majority of the Energy Efficiency Directive are nearing completion and it is anticipated that they will be enacted in Q1 2026. The Department is awaiting the publication of Commission guidance, which was originally due in March 2024, before it can complete the transposition of the remaining parts of the Directive. The Department has engaged with the Commission in relation to this.      2. To standardise the approach used to evaluate the affordability of new and existing policy initiatives on consumers    IN PROGRESS    Priorities have been realigned under the PfG resulting in the establishment of a National Energy Affordability Taskforce (NEAT). The drafting, publication and implementation of a National Energy Affordability Action Plan will be a key output of the NEAT. The relevant actions in the ESP are being incorporated into the work programme of the NEAT.      3. To improve the ways that homes and businesses can  manage their energy use by providing an evidence-based  programme of communications activity and by supporting  ‘active consumers’ through smart metering and smart  energy services    IN PROGRESS    Q1 2026  The National Energy Demand Strategy and consumer strategy in particular will assist consumers in managing their energy use.    In addition, there are a number of more medium term measures under way in DCEE and its agencies towards this end, including the work of the Heat and Built Environment Taskforce (retrofitting, renewable heat, district heating networks, decarbonisation of heating and operational energy use optimisation in the building stock), SEAI’s Pathfinder programme for the public sector and DCEE’s Commercial roadmap for businesses seeking to decarbonise.      4. To review gas connection policy and introduce gas demand  flexibility measures    IN PROGRESS    Q1 2026      5.To identify and support new, innovative approaches to  integrating large-scale demand sustainably into Ireland’s  energy systems that align with the overriding objective  to decarbonise    IN PROGRESS    Q1 2026. Large Energy User Connection Policy published by CRU 12 December. Other related measures ongoing.      6. To utilise the National Energy and Climate Plan to ensure all policy incentives are aligned on a regular basis    COMPLETE    COMPLETE      7. To work within the updated European Electricity Market Design to continue to reduce emissions associated with Ireland’s conventional capacity over the medium-term    IN PROGRESS    2030      8. To complete implementation of the CRU Security of Electricity Supply Programme    IN PROGRESS    2027      9. To increase resilience by implementing an updated, risk-based, evidence-based reliability standard in the electricity sector    IN PROGRESS    2027      10. To implement consenting reforms and align to planning reforms to provide greater certainty to the sector    IN PROGRESS    Environment (Misc. Provisions) Bill, 2025 has completed Dáil Éireann, Third Stage. Primary legislation in place by end Q1 2026. Secondary legislation to be developed over the course of 2026 with phased implementation to end 2026.      11. To ensure a fit for purpose electricity grid that supports Ireland’s energy and climate ambition    IN PROGRESS    Q4 2030      12. To accelerate delivery of power system flexibility    IN PROGRESS    2026      13. To successfully complete and integrate additional Electricity Interconnections    IN PROGRESS    The Celtic Interconnector is a 700 MW electricity interconnector currently being built between Brittany and East Cork, promoted, and developed by EirGrid, and French counterpart, Reseau de Transporte d’Électricite (RTÉ). Scheduled completion will be Spring 2028.  The Greenlink Interconnector project is a 500 MW subsea and underground electricity interconnector cable linking grids in Ireland (Wexford) and GB (Wales) with flow in both directions. It has been operational since Q1 2025.  The MaresConnect Interconnector project between Ireland (Greater Dublin Area) and GB (Wales). Regulatory progress has seen cap and floor obtained in UK with Cap and Floor minded granting in Ireland with a final decision due 2026. Project commissioning is aimed for 2030.      14. To finalise studies to inform the development of long-term gas storage solutions which can store renewable gas, in particular hydrogen    IN PROGRESS    Research due Q4 2028      15. To secure the existing onshore ‘Inch gas pipeline’ for wider strategic uses    IN PROGRESS    Ongoing - Gas Networks Ireland (GNI), Ireland’s gas transmission system operator, is continuing to engage with relevant stakeholders.      16. To ensure a fit for purpose gas grid, that supports Ireland’s energy and climate ambition    IN PROGRESS    CRU and GNI are undertaking a number of initial measures to support this medium- to long-term action.      17. To create a Strategic Gas Emergency Reserve to protect Ireland in the event of a gas supply disruption as Ireland makes a secure transition to majority renewable energy    IN PROGRESS    Work on the Strategic Gas Emergency Reserve (SGER) project is progressing steadily, with recent site selection announcement achieving a crucial milestone.      18.To strengthen supply chain of secondary fuels for Gas-fired power generation    IN PROGRESS    Substantively completed in 2024, with ongoing analysis of this area to continue in 2026 between relevant bodies.      19. To resolve Long-Term Sourcing Issues for improved Oil Security    COMPLETE    Analysis commissioned and complete on Refining in Ireland      20. To expand the energy expertise and capacity available to Government and representing Ireland Internationally    IN PROGRESS    Chief Technical Adviser appointed, with a new team in place. Dedicated graduate recruitment in place. New International division established and resources at EU level enhanced.      21. To regularly review the scope, functions and resourcing of the delivery organisations that are driving the energy transition    IN PROGRESS    Ongoing.      22. To integrate the forecasting framework for the electricity and gas sectors    IN PROGRESS    2027      23. To extend International Energy Agreements to support energy security    IN PROGRESS    MoU in place and continuing engagement with the UK.      24. To continue to regularly Review Energy Emergency Exercises and Preparedness    IN PROGRESS    Ongoing. Exercises conducted, future exercises planned and actions being implemented following each Exercise.      25. To update the approach to Industry and Stakeholder Engagement in policy deliberation    IN PROGRESS    Ongoing across multiple forums.      26. To enhance energy sector oversight and governance    IN PROGRESS    Ongoing. Review of CRU ongoing to enhance oversight, governance, resources and engagement with the CRU.      27. To establish Annual Energy Security Reporting and Regular Energy Security Reviews    IN PROGRESS    2026      28. To establish a permanent Energy Security Group    COMPLETE    COMPLETE      ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Climate"
        },
        "showAs": " 135. Deputy Pádraig O'Sullivan asked the Minister for Climate, Energy and the Environment if he will provide an update on all of the actions in the energy security review; the estimated timeline for completion/delivery of each action; and if he will make a statement on the matter. [72249/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_167",
          "debateSectionId": "dbsect_167",
          "showAs": "Energy Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_167.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_135",
        "questionNumber": 135
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  While neither I as Tánaiste and Minister for Finance, nor the Central Bank, can intervene directly in pricing under EU Solvency II rules, ensuring that consumers have access to affordable insurance cover is a key priority for this Government.  Considerable progress in this area has already been made. A significant number of reforms were delivered under the 2020 Action Plan for Insurance Reform that have contributed to stabilising the market, including the introduction of the Personal Injuries Guidelines, rebalancing of the duty of care, and legislative enhancements to the Injuries Resolution Board.  Together, these steps have helped reduce claims costs, improve consistency in personal injury awards, and create a more predictable environment for insurers. They have also supported the entry of new providers into the market and encouraged existing companies to broaden their risk appetite.  The 2025 Action Plan for Insurance Reform, launched on 24 July, sets out a comprehensive set of targeted measures to further improve affordability, availability, and transparency across the insurance sector. Among the priority actions is a strong emphasis on enhancing market competitiveness by engaging directly with the international insurance market to attract new providers to Ireland. This approach aims to expand supply, drive greater competition, and reduce cost.  The Office to Promote Competition in the Insurance Market (OPCIM) also continues to play a central role in enhancing competition to address rising premiums. With its mandate expanded under the Programme for Government, the Office remains instrumental in promoting competition and in identifying opportunities to attract additional providers.  Securing a more sustainable and competitive market through deepening and widening the supply of insurance in Ireland remains a key priority, with the goal of enhancing affordability and availability for consumers across all types of insurance. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 226. Deputy Pádraig O'Sullivan asked the Tánaiste and Minister for Finance the steps being taken to address rising insurance premiums for consumers; and if he will make a statement on the matter. [68208/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_240",
          "debateSectionId": "dbsect_240",
          "showAs": "Insurance Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_240.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_226",
        "questionNumber": 226
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  I propose to take Questions Nos. 202 and 251 together.  The Deputy should note that my Department and I share concerns that the Disabled Drivers and Disabled Passengers Scheme or DDS is no longer fit-for-purpose and believe it should be replaced with a needs-based, grant-led approach for necessary vehicle adaptations that could serve to improve the functional mobility of the individual.  Under the aegis of the Department of the Taoiseach, the sub-group convened to progress the National Disability Inclusion Strategy proposals for a needs-based, grant-aided, modern vehicle adaptation supports to replace the DDS, generated a report that was submitted to the Department of the Taoiseach. In considering this report, it has been proposed that a new grant-based scheme be developed and led by the Department of Transport.  The Department of Transport is beginning the development of this new scheme. The existing DDS remains with the Department of Finance and will continue to be reviewed in the context of new scheme developments by the Department of Transport.  As the Deputy will be aware, when this government took office, we committed to a step change in the delivery of supports and services for people with disability and their families.  Budget 2026 is the first step in delivering on this ambition, providing some €3.83 billion to specialist disability services next year, an unprecedented increase of €618 million, or almost 20%.  This funding will be vital in delivering the National Human Rights Strategy for Disabled People. The commitment to develop a new scheme by the Department of Transport, and in this context review the Disabled Drivers and Disabled Passengers Scheme, are strong commitments in this strategy. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 251. Deputy Pádraig O'Sullivan asked the Tánaiste and Minister for Finance his plans to make changes to the disabled drivers scheme; if he will consider expanding eligibility and modernising the scheme; and if he will make a statement on the matter. [68207/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_216",
          "debateSectionId": "dbsect_216",
          "showAs": "Departmental Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_216.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_251",
        "questionNumber": 251
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The Deputy should note that my Department and I share concerns that the Disabled Drivers and Disabled Passengers Scheme or DDS is no longer fit-for-purpose and believe it should be replaced with a needs-based, grant-led approach for necessary vehicle adaptations that could serve to improve the functional mobility of the individual.  Under the aegis of the Department of the Taoiseach, the sub-group convened to progress the National Disability Inclusion Strategy proposals for a needs-based, grant-aided, modern vehicle adaptation supports to replace the DDS, generated a report that was submitted to the Department of the Taoiseach. In considering this report, it has been proposed that a new grant-based scheme be developed and led by the Department of Transport.  The Department of Transport is beginning the development of this new scheme. The existing DDS remains with the Department of Finance and will continue to be reviewed in the context of new scheme developments by the Department of Transport.  As the Deputy will be aware, when this government took office, we committed to a step change in the delivery of supports and services for people with disability and their families.  Budget 2026 is the first step in delivering on this ambition, providing some €3.83 billion to specialist disability services next year, an unprecedented increase of €618 million, or almost 20%.  This funding will be vital in delivering the National Human Rights Strategy for Disabled People. The commitment to develop a new scheme by the Department of Transport, and in this context review the Disabled Drivers and Disabled Passengers Scheme, are strong commitments in this strategy. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 354. Deputy Pádraig O'Sullivan asked the Tánaiste and Minister for Finance his plans to make changes to the disabled drivers scheme; if he will consider expanding eligibility and modernising the scheme; and if he will make a statement on the matter. [69455/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_353",
          "debateSectionId": "dbsect_353",
          "showAs": "Tax Reliefs",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_353.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_354",
        "questionNumber": 354
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  While neither I as Tánaiste and Minister for Finance, nor the Central Bank, can intervene directly in pricing under EU Solvency II rules, ensuring that consumers have access to affordable insurance cover is a key priority for this Government.  Considerable progress in this area has already been made. A significant number of reforms were delivered under the 2020 Action Plan for Insurance Reform that have contributed to stabilising the market, including the introduction of the Personal Injuries Guidelines, rebalancing of the duty of care, and legislative enhancements to the Injuries Resolution Board.  Together, these steps have helped reduce claims costs, improve consistency in personal injury awards, and create a more predictable environment for insurers. They have also supported the entry of new providers into the market and encouraged existing companies to broaden their risk appetite.  The new Action Plan for Insurance Reform, launched on 24 July, sets out a comprehensive set of targeted measures to further improve affordability, availability, and transparency across the insurance sector. Among the priority actions is a strong emphasis on enhancing market competitiveness by engaging directly with the international insurance market to attract new providers to Ireland. This approach aims to expand supply, drive greater competition, and reduce cost.  The Office to Promote Competition in the Insurance Market (OPCIM) also continues to play a central role in enhancing competition to address rising premiums. Taking account of the Programme for Government commitments, the Office remains important in promoting competition and in identifying opportunities to attract additional providers.  Securing a more sustainable and competitive market through deepening and widening the supply of insurance in Ireland remains a key priority, with the goal of enhancing affordability and availability for consumers across all types of insurance. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 355. Deputy Pádraig O'Sullivan asked the Tánaiste and Minister for Finance the steps being taken to address rising insurance premiums for consumers; and if he will make a statement on the matter. [69456/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_354",
          "debateSectionId": "dbsect_354",
          "showAs": "Insurance Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_354.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_355",
        "questionNumber": 355
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-18",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 727. Deputy Pádraig O'Sullivan asked the Minister for Health the number of discretionary medical card applications received for persons aged over 70 in 2025; the number approved; the number refused; the number of appeals lodged following refusals; and, of those appeals, the number granted on review; and the number in which the original decision was upheld; and if she will make a statement on the matter. [73690/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/dbsect_699",
          "debateSectionId": "dbsect_699",
          "showAs": "Medical Cards",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-18/writtens/mul@/dbsect_699.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-18/pq_727",
        "questionNumber": 727
      },
      "contextDate": "2025-12-18"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 127. Deputy Pádraig O'Sullivan asked the Minister for Defence the measures her Department is taking to ensure the budget for the Reserve Defence Force will be sufficient for the coming year; and if she will make a statement on the matter.  [72679/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_126",
          "debateSectionId": "dbsect_126",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_126.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_127",
        "questionNumber": 127
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 315 and 316 together.  The Diet Supplement, administered under the Supplementary Welfare Allowance scheme, is payable to qualifying persons, in receipt of the supplement prior to February 2014, who have been prescribed a special diet because of a specified medical condition. There are currently 579 people in receipt of Diet Supplement.  A review of the costs of healthy eating and specialised diets by the Irish Nutrition and Dietetic Institute was commissioned by my Department during 2013. The research showed that the average costs across all the retail outlets of the diets supplemented under the scheme could be met from within one-third of the minimum personal rate of social welfare payment, i.e. the Basic Supplementary Welfare Allowance rate, which was then paid at €186 per week, and is currently €242. Based on this evidence, the Diet Supplement scheme was discontinued for new applicants from 1 February 2014.  Recipients continue to receive the Diet Supplement at their existing rate of payment for as long as they continue to have an entitlement to the scheme or until their circumstances change. This measure ensured that nobody was immediately worse off by the closure of the scheme.  Any decision to re-instate the Diet Supplement would require further analysis and would have to be considered in the context of the budgetary process.  However, my Department provides Additional Needs Payments as part of the Supplementary Welfare Allowance scheme to help meet essential expenses that a person cannot pay from their weekly income or other personal and household resources. Any person who considers they may have an entitlement to an Additional Needs Payment is encouraged to contact their local community welfare service. There is a National Community Welfare Contact Centre in place - 0818-607080 - which will direct callers to the appropriate office. In addition, applications can be made online via www.mywelfare.ie.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 315. Deputy Pádraig O'Sullivan asked the Minister for Social Protection if consideration will be given to introducing a gluten-free food allowance for pensioners with coeliac disease due to the extra cost associated with their dietary needs; and if he will make a statement on the matter. [72700/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_280",
          "debateSectionId": "dbsect_280",
          "showAs": "Social Welfare Benefits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_280.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_315",
        "questionNumber": 315
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  I propose to take Questions Nos. 315 and 316 together.  The Diet Supplement, administered under the Supplementary Welfare Allowance scheme, is payable to qualifying persons, in receipt of the supplement prior to February 2014, who have been prescribed a special diet because of a specified medical condition. There are currently 579 people in receipt of Diet Supplement.  A review of the costs of healthy eating and specialised diets by the Irish Nutrition and Dietetic Institute was commissioned by my Department during 2013. The research showed that the average costs across all the retail outlets of the diets supplemented under the scheme could be met from within one-third of the minimum personal rate of social welfare payment, i.e. the Basic Supplementary Welfare Allowance rate, which was then paid at €186 per week, and is currently €242. Based on this evidence, the Diet Supplement scheme was discontinued for new applicants from 1 February 2014.  Recipients continue to receive the Diet Supplement at their existing rate of payment for as long as they continue to have an entitlement to the scheme or until their circumstances change. This measure ensured that nobody was immediately worse off by the closure of the scheme.  Any decision to re-instate the Diet Supplement would require further analysis and would have to be considered in the context of the budgetary process.  However, my Department provides Additional Needs Payments as part of the Supplementary Welfare Allowance scheme to help meet essential expenses that a person cannot pay from their weekly income or other personal and household resources. Any person who considers they may have an entitlement to an Additional Needs Payment is encouraged to contact their local community welfare service. There is a National Community Welfare Contact Centre in place - 0818-607080 - which will direct callers to the appropriate office. In addition, applications can be made online via www.mywelfare.ie.  I trust this clarifies the matter for the Deputy. ",
        "questionType": "written",
        "date": "2025-12-17",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 316. Deputy Pádraig O'Sullivan asked the Minister for Social Protection if his Department has considered the impact of the high cost of gluten-free food on pensioners with coeliac disease; and whether he will explore options to support affected individuals, such as a potential allowance or subsidy to offset these costs. [72701/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/dbsect_280",
          "debateSectionId": "dbsect_280",
          "showAs": "Social Welfare Benefits",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-17/writtens/mul@/dbsect_280.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-17/pq_316",
        "questionNumber": 316
      },
      "contextDate": "2025-12-17"
    },
    {
      "question": {
        "answerText": " Minister for Defence  As I announced last week, the revised NDP Capital allocation for the Defence Vote Group will provide €1.7 billion in capital funding to Defence out to 2030. This represents an increase of €600 million (55%) on the previous baseline of €1,100 million. For 2026, the Defence capital allocation will increase by €85 million to €300 million. Full details of the Defence NDP 2026-2030 Sectoral Plan are available on the Government website gov.ie.  Capital Investment in Defence primarily provides for the renewal, retention and acquisition of major defence equipment and defence infrastructural development – expenditure which enhances and supports military capabilities and contributes to a more secure and resilient society.  The Defence Forces Infrastructure Development Plan (IDP) currently sets out a programme of infrastructural project delivery to 2027. It reflects the complex environment in which the Defence Forces operate and the corresponding need for appropriate infrastructure to provide for accommodation and training of personnel, as well as the maintenance and storage of equipment.  The IDP is iterative in nature thus ensuring that it remains relevant and that investment is targeted where most needed and aligns with a range of other factors encompassing funding availability, delivery capacity, timing, interdependency with equipment projects and linkage to strategic capability development goals.  Within these overarching IDP structures, the Personnel Support Services Resource Centre, the Infrastructure and Utilities Office and several ablution areas within Collins Barracks Cork have benefitted from recent upgrades. In addition, an accommodation upgrade is also underway in Block 1, Collins Barracks while a refurbishment of the Security Duty Centre and the development of a new Garaging Facility in Collins Barracks are currently at a design stage.  Over the 2026-2030 timeframe, €400 million is being allocated to infrastructural investment on the Defence NDP Sectoral Plan, a level of funding, which will inform and enable associated future IDP processes and deliver enhanced accommodation, offices, gyms etc to military installations throughout the country, together with more targeted investment on the development of specific requirements such as aircraft hangars and naval berthage capacity. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 146. Deputy Pádraig O'Sullivan asked the Minister for Defence the additional defence funding allocated under the revised National Development Plan that will be provided for Collins Barracks, Cork; and if she will make a statement on the matter. [71838/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_84",
          "debateSectionId": "dbsect_84",
          "showAs": "National Development Plan",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_84.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_146",
        "questionNumber": 146
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Defence  At present, construction is ongoing for the refurbishment of Block 1 Officer/NCO Accommodation. This project is to provide 25 bedrooms for those personnel based in Collins Barracks in the newly refurbished Block. It is expected to be completed in mid-2026.  The Deputy may also wish to note that the new Accommodation Block for 41 personnel was completed in 2024 increasing the supply of single living-in (SLI) accommodation for enlisted personnel stationed in Collins Barracks  My Department also allocates funding each year to the Defence Forces for the maintenance, repair and upkeep of its building stock. This year a devolved budget of €12.5 million was assigned by my Department to the Defence Forces for these tasks. The individual prioritisation of specific projects to be carried out is solely a matter for the Defence Forces in keeping with the delegated nature of this budget. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Defence"
        },
        "showAs": " 152. Deputy Pádraig O'Sullivan asked the Minister for Defence the measures being taken to create additional accommodation for military personnel in Collins Barracks, Cork; and if she will make a statement on the matter. [71839/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_89",
          "debateSectionId": "dbsect_89",
          "showAs": "Defence Forces",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_89.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_152",
        "questionNumber": 152
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Foreign Affairs and Trade  Throughout 2025, my Department has made significant progress in delivering on our commitments under the Programme for Government. Updates on relevant commitments are set out in tabular form below. My Department has continued to deliver on behalf of Irish citizens at home and abroad in this time.  In addition to these commitments on which my Department leads, co-leads or plays a significant role, DFAT also contributes to the delivery of a number of other Programme for Government commitments that are led by other Government departments.      Commitment      Progress in the last 12 months       Use the resources of our diplomatic missions and agencies to deliver ambitious targets.    The mission network continues to deliver on all aspects of our high level objectives, guided by the Department's Statement of Strategy, by deepening our global engagement and driving trade and prosperity, responding to the complex global geopolitical context, serving our citizens and communities abroad, and promoting peace and reconciliation on the island of Ireland. The mission network works in close partnership with State agencies as part of Team Ireland overseas.      Support a new US-based Economic Advisory panel which would be made up of senior Irish or Irish-linked decision makers in key business sectors.    The Strategic Economic Advisory Panel (SEAP) was established in Q1 2025. SEAP meetings were held in Washington D.C. in March and in New York in September 2025, attended by the Taoiseach, the Tánaiste and a range of US-based industry leaders, covering a wide range of topics relating to Ireland’s economic relationship with the United States.      Support an open, multilateral, rules-based trade system, promoting free trade policies and economic growth.    Ireland has continued to work closely along with European Union partners to promote free trade policies and in particular to advocate for a strong multilateral trading system with a modernised World Trade Organization at its core. In August, the Government’s Action Plan on Market Diversification was published as a comprehensive approach to promoting Ireland’s trade, tourism, investment and research objectives, and supporting businesses in their market diversification ambitions. The Department also coordinates national engagement at the OECD where Ireland takes a consistent approach in support of an open, multilateral, rules-based trade system, promoting free trade policies and economic growth, including at the OECD. In 2025, the Department also coordinated Ireland’s national engagement at the G20, where Ireland participated as a guest of the South African Presidency in 2025.      Support an ambitious EU trade agenda, promoting new Free Trade Agreements, with proper assurances regarding sustainability, human rights and the protection of our agricultural sector.    Ireland has continued to support an ambitious EU trade agenda, with progress across several negotiations including with Indonesia and India. Ireland has also supported EU engagement with the US as we work towards a new mutually beneficial trade and investment relationship. Throughout, Ireland has consistently emphasised the need for strong sustainability and human rights provisions, and has worked to ensure that agricultural sensitivities are protected. Ireland was active in seeking to secure agreement between the Council and the European Parliament on revising the EU GSP Regulation which is an important tool for providing non-reciprocal, preferential access to the EU for developing and least developed countries. Political agreement was reached on 1 December.    The Arbitration (Amendment) Bill 2025 has passed Second Stage in the Dáil. The Bill, once passed, will enable ratification of the EU-Canada Comprehensive Economic and Trade Agreement (CETA) and other international agreements containing similar investment dispute resolution provisions, including those with Chile, Mexico, Singapore and Vietnam      Work with like-minded EU countries to stand up for Irish farmers and defend our interests in opposing the current Mercosur trade deal.    The Government has continued to engage at EU level – with both the European Commission and with counterparts in like-minded EU Member States – to voice our concerns with the EU-Mercosur agreement and to interrogate the outcome of negotiations to assess if our concerns have been adequately addressed.      Ensure there is continued support for climate finance delivered through Ireland’s Overseas Development Aid programme, particularly in areas where communities are vulnerable to climate impacts.    At COP26, held in Glasgow in November 2021, the Taoiseach announced that Ireland would provide at least €225 million in climate finance per year to developing countries by 2025. By the end of 2025, we will reach this target. Climate Finance reports are published in arrears. In March 2025, the 2023 Climate Finance Report was launched and highlighted that Ireland provided €159.2 million in international climate finance.      Actively support climate initiatives to address the severe effects of drought, famine, and lack of clean water in collaboration with international partners.    During 2025 Ireland’s climate programming continued to focus on supporting countries and communities most seriously in need, including countries impacted by drought, famine and lack of access to water. For example, in 2025 Ireland provided €5.5 million to the United Nations Central Emergency Relief Fund Climate Action Account which is mandated to respond to climate induced emergencies, €2.5 million to the International Federation of Red Cross and Red Crescent Societies Global Climate Resilience Platform and €1.5 million to Start Ready. These are emergency response pooled mechanisms for climate induced disasters. Additionally, Ireland continued its partnership with Concern Worldwide, providing €5 million for activities dedicated to addressing acute malnutrition (wasting) in children in the vulnerable drought-prone border regions of Somalia, Ethiopia and Kenya.      Actively advocate for the rights of LGBTQI+ individuals both in Ireland and internationally.    The promotion and protection of the rights of LGBTQI+ persons is a domestic and foreign policy priority for Ireland. Ireland participates in the International Day Against Homophobia, Transphobia and Biphobia (IDAHOT) and annual Pride events. Ireland is a member of the Equal Rights Coalition, and meets with the group regularly to continue to work on the promotion and protection of the human rights of LGBTQI+ persons globally, while countering the current pushback on LGBTQI+ rights.      Engage in discussions at key international forums, including the EU and the UN, to uphold the universal nature of human rights, ensuring that these rights apply equally to all individuals, regardless of gender identity, sexual orientation, or any other characteristic.    Ireland strongly supports efforts in international human rights fora to promote the rights of LGBTQI+ persons, including at the UN Human Rights Council and the UN General Assembly.    Ireland strongly supported the renewal of the mandate of the UN Independent Expert on protection against violence and discrimination based on sexual orientation and gender identity (SOGI) at the 59th session of the Human Rights Council in July. Ireland also delivered a national statement at the 59th Session of the Human Rights Council, at the Interactive Dialogue with the Special Rapporteur on SOGI, and a statement at the Third Committee of the 80th Session of the UN General Assembly, at the Interactive Dialogue with the Independent Expert on Discrimination based on SOGI. Ireland is also a member of the Group of Friends of the mandate of the Independent Expert on SOGI.  This year at the UN Human Rights Council’s Universal Periodic Review, Ireland raised the rights on LGBTQI+ persons in the recommendations made to: Jamaica, Liberia, Libya, Malawi, Mongolia, Panama, Armenia, Grenada, Guyana, Kiribati, Türkiye and Bosnia Herzegovina.    The promotion and protection of the rights of LGBTQI+ persons is also a priority in Ireland’s campaign for membership of the Human Rights Council, launched in September in New York by the Tánaiste.      Give effect to the International Holocaust Remembrance Alliance ‘Working Definition of Antisemitism’ and implement the EU declaration on ‘Fostering Jewish Life in Europe’.    Senior members of the Government meet regularly with representatives of Ireland’s Jewish communities, including the Taoiseach, the Tánaiste, the Minister for Justice, and the Minister of State for European Affairs. Most recently, the Tánaiste met with representatives of Ireland’s Jewish community in September. DFAT officials also maintain regular contact with the Jewish community.    Ireland provides an annual grant towards the upkeep of the Auschwitz memorial. This year we provided €50,000 recognizing the importance of the 80th anniversary event.    The Department of Foreign Affairs and Trade has worked with JACI (Jewish Arts and Culture Ireland) to develop an exhibition on the links between Lithuania and Ireland’s Jewish Community.    This year, Ireland continued the Crocus project, where young children plant yellow crocus bulbs in October, which bloom in January in remembrance of the victims.      Support artists to access international opportunities through increased funding for Culture Ireland and support for our embassies to promote more bilateral exchanges.    There has been an expansion of specialist cultural attaché programme with new appointments in India, China and South East Asia.      Promote an all-island approach to hosting major international sporting events, building on the Major International Events policy, including supporting the hosting of the 2027 Ryder Cup, Euro 2028, the T20 Cricket World Cup 2030, the Open Championships and bidding for major competitions.    The continuation of a structured and strategic approach to securing the hosting of major sporting events that can deliver all-island benefits, including co-hosting opportunities, is being considered as part of the International Sport Diplomacy Strategy currently under development. This will be informed by the Major International Sports Events Policy and Strategy Framework 2024. Work is also ongoing to establish a formal structure across Government for the coordination of major sporting events.      Maintain and continue to grow the Global Ireland Media Challenge Fund to build capacity of Irish media outlets to undertake quality reporting on international geopolitical events.    The latest application window for the Global Ireland Media Challenge Fund was opened in January 2025, following which six additional media organisations were awarded funding for the 2025-2026 period. Match funding of 52% was achieved and participating organisations have undertaken to create over 2,000 original content pieces under video, print and social media over the 18 month term.      Support the development of the Savings and Investment Union, seeking opportunities to improve competition in key financial sectors and to support the green and digital transitions.    We are actively involved in progressing associated EU legislative measures for a Savings and Investment Union.    Ireland proactively and collaboratively engaged in the negotiations for an EU-wide 2040 climate target. We agreed to a highly ambitious target to reduce emissions by 90% by 2040, based on 1990 levels, while securing stronger language on food security, forestry and land use, renewable energy, and a just transition – including energy affordability. For digital, Ireland strongly supports the ambitious digital simplification package and we are developing a strong, coherent and stable digital regulatory framework. Ireland is making efforts towards increasing resilience and decreasing dependencies in critical digital value chains in an open manner, which means maintaining access to open markets, interoperability, and international collaboration.      Support and implement the European Green Deal, unlocking more of Europe’s renewable energy potential through enhanced EU co-operation and improved European grid connectivity.    Ireland is accelerating the green energy transition by advancing policies which enhance affordability for businesses and households while enabling faster adoption of renewables and robust energy security.    Ireland is also prioritising an EU-wide approach to deployment and investment in grid infrastructure in order to enhance our competitiveness and has engaged proactively with the Commission in the lead up to its publication of the European Grids Package on 16 December 2025.    Projects such as the Celtic Interconnector between Ireland and France, which will be a key first step towards expanding and diversifying interconnections, are also progressing.      Ensure there is an ambitious new European Budget settlement, protecting existing EU programmes and taking action on strategic priorities.    The proposal for the 2028 – 2034 Multiannual Financial Framework was published in July and September this year. Since then, DFAT and the Department of Finance, as co-leads on Ireland’s position, have coordinated across Government to ensure Irish priorities and ambitions are well communicated and advanced. Negotiations are ongoing, and Ireland’s EU Presidency, will come at a critical juncture in this process.      Prioritise economic competitiveness in the EU and continue to promote international trade, as it is vital to the Irish economy.    We are working to implement the files of the Competitive Compass outlined by the Commission. Ireland has also worked to take forward the implementation of the EU Single Market Strategy and is calling for the early publication of the Single Market Roadmap to 2028 with concrete targets and timelines. Moreover, we are opposing the application of a “European Preference” across our industrial policy toolkit. We are prioritising an open economy with free and fair competition and the deepening of the Single Market, which should remain the EU’s main approach to enhancing competitiveness. We are also advocating for Strengthening EU-US cooperation and are expressing caution regarding approaches that could disrupt transatlantic investment flows or global value chains.      Work to strengthen the application and monitoring of the rule of law across the EU, ensuring the non-partisan application of the Rule of Law mechanism, and ensure that all citizens in all member states feel equally protected from those who threaten our values, including their own governments.    Ireland continues to be a strong advocate for the Rule of Law within the EU. We recognise the importance of having the necessary tools to monitor developments across EU Member States and to respond to challenges where they arise. We are therefore supporting efforts led by Commissioner McGrath to strengthen mechanisms to ensure respect for the rule of law in all EU Member States. DFAT worked closely with the Attorney General in preparing Ireland’s national intervention in support of the European Commission’s infringement case against Hungary’s National Sovereignty Protection Law. Through DFAT’s European Enlargement and Fundamental Values Fund (EEFV), Ireland is also providing financial assistance to civil society groups and other bodies in EU Member States where the rule of law is under pressure.      Support sanctions against countries seeking to undermine European democracy.    Ireland implements EU and UN sanctions; this commitment is in progress.      Reduce where possible the regulatory burden simplifying EU rules for the SME and Farming sectors.    The Department has coordinated work across Government on the EU’s simplification agenda to help reduce the regulatory burden, notably for SMEs and farming communities. We have worked with EU partners to make progress on the implementation of the eight Omnibus simplification packages proposed by the Commission so far, which the Commission estimates will lead to administrative savings across the EU of €11 billion per year.      Deliver on plans to increase the number of Irish people applying for positions in the institutions of the European Union, including a communications campaign targeted at school leavers and graduates highlighting the opportunities available, and a partnership with third level providers to do the same.    The Department continues implementing the “A Career for EU strategy” to increase Irish representation in EU institutions. In 2025, physical outreach at second and third-level careers fairs promoted EU careers to school leavers and graduates, while targeted social media campaigns encouraged professional applicants. Minister of State for European Affairs and Defence, Thomas Byrne, TD, addressed students at Higher Options and participated in local radio interviews. The dedicated website ireland.ie/en/eu-jobs received thousands of visits. Extensive training and supports continue for Irish candidates.      Uphold the Irish language’s full status as an official language of the European Union.    The Government is resolute in upholding the Irish language's full and secure status within the EU. Irish is a full official and working language of the Union, and there is no question of its status being diminished. This position is guaranteed by the Treaties and the subsequent Council Regulation No. 2021/168. Since 1 January 2022, Irish has enjoyed complete parity with the EU’s other 23 official languages. This means that all key EU legislative acts and documents are translated into Irish, and citizens have the right to correspond with the EU institutions in Irish. Ireland remains committed to promoting and strengthening the Irish language across the European institutions, recognising its deep cultural and national significance, and its firm foundation as a Treaty language of the Union.      Develop and promote projects which build links and understanding with other EU capitals and regions in the fields of culture, education, research and innovation.    In 2025, Ireland actively promoted Irish culture across EU Member States through a €250,000 fund disbursed through the Mission network in the EU. This funding is specifically allocated to Irish Embassies and Consulates throughout the region to support and facilitate cultural and educational initiatives that showcase Irish heritage, arts and identity. The funding enables Missions to develop and implement targeted cultural programmes that resonate with local audiences across different EU MS.      Stand by the EU’s accession promises, promoting a positive enlargement strategy for Ukraine, the Western Balkans, Moldova and Georgia.    Ireland has continued to promote and support progressing EU Enlargement policy and individual candidacies on a merit-basis. EU Enlargement will be a key priority of our upcoming EU Presidency and Ireland will seek to advance the candidacies of all candidate and potential candidate countries where conditions have been met. In advance of our EU Presidency, in September 2025, Ireland opened embassies in three candidate countries, in Bosnia Herzegovina, Moldova and Serbia. The Minister of State for European Affairs has also visited Albania, Kosovo, Moldova, Montenegro, North Macedonia and Ukraine throughout 2025 and reaffirmed Ireland’s strong support for their respective EU accession paths. Ireland has also supported several projects to support candidate and potential candidate countries’ EU accession processes, some of which are outlined below.      Promote closer co-operation with candidate countries, assisting these nations to align with EU standards.    A three year 'Ireland for EU Enlargement Programme', funded through EU and Trade Divisions' EU Enlargement and Fundamental Values fund, is being delivered by the Institute of Public Administration (IPA) together with the Podgorica-based Western Balkans Regional School of Public Administration (ReSPA) to support capacity building in candidate countries focusing on the Rule of Law, digitalisation and economic transformations. In November, 48 senior officials from candidate countries travelled to Dublin for further classes and engagements to build capacity and awareness of EU standards and policies.    Ireland has also made a contribution of €1.5 million towards the “Ukraine2EU”, a programme supporting Ukraine’s EU accession path and which is being implemented by Lithuania’s Central Project Management Agency.      Introduce a new John Hume Fund in honour of one of Ireland’s greatest ever patriots and only member of the European Parliament to win a Nobel Prize. This is to be awarded annually by that Parliament to a person or organisation who promotes reconciliation and shared prosperity in Europe.    EU and Trade Policy Division within DFAT has established a new European Parliament Unit this year. The purpose of this unit is to maximise opportunities for effective Irish engagement with the European Parliament, both as a key partner in our ongoing work and in particular with a view to an effective Irish Presidency in 2026. As part of this work, the unit has engaged in initial outreach around the establishment of a John Hume Fund, conducting research on existing awards granted by the European Parliament and gathering views from relevant interlocutors, with a view to recommending a way forward on the establishment of a new fund.      Publish plans for our upcoming Presidency to deliver against strategic priorities for Europe and Ireland.    Work is ongoing to develop Ireland's Presidency priorities and policy programme. In line with convention, Ireland's policy programme for the Presidency will be finalised and published in June 2026      Host an informal meeting of the European Council and a meeting of the European Political Community in Ireland during the Presidency, as well as a programme of between 16 and 20 informal Council meetings at Ministerial level.    Extensive planning work has continued to prepare for the programme of meetings to be hosted across Ireland during our EU Presidency. These will include a summit of the European Political Community, an informal meeting of the European Council and 22 informal Ministerial meetings. Overall, we expect to host more than 250 Presidency events here. DFAT has chaired monthly Inter-Departmental meetings on Operational Presidency Planning to support delivery of the Presidency meeting programme in Ireland.      Seek to bring some of the high-level meetings of our Presidency to cities and counties across Ireland, ensuring the entire country benefits from the profile the Presidency brings.    Planning is underway for six informal Ministerial meetings, as well a range of other conferences, official-level meetings and other events, to take place in regional locations.      Provide for a sustainability policy for the Presidency.    A sustainability policy for Ireland’s EU Presidency in 2026 is in final development and will be launched in Q1 2026.      Continue to work with partners in the region to advocate for an immediate ceasefire in Gaza, the return of all hostages and a surge of humanitarian aid. We will also work with partners to help rebuild Gaza as soon as practicable.    Ireland has welcomed the ceasefire and the agreement on the first phase of the Comprehensive Plan to end the war in Gaza. This is an important first step on a road to peace. Ireland continues to call for humanitarian aid to be directed throughout the entire Gaza Strip at scale.    Ireland has provided 177 tonnes of supplies including tents, blankets, water cans and other vital household items to Gaza under Ireland’s Rapid Response Initiative. 10 trucks of carrying food, supported by Irish Aid in partnership with Plan Ireland, arrived in Gaza in recent weeks for distribution to people who urgently need it. Ireland will also provide an additional €6 million in humanitarian aid for people in Gaza as UN and humanitarian agencies prepare to ramp up aid supplies following the ceasefire. This new contribution brings Ireland’s support for the people of Palestine since October 2023 to more than €102 million, and support in 2025 to over €36 million.      Seek to grow the international coalition of countries supporting a two-state solution through recognition of the State of Palestine and continue to advocate for internationally sponsored political negotiations on achieving a peaceful and secure Israel and Palestine.    Ireland stands ready to play our part in working towards a sustainable peace between Israel and Palestine through the implementation of the two-State solution. Ireland was active in preparing the UN High-level Conference on the Two-State Solution held in New York from 28 - 30 July. The outcome document from the meeting – the New York Declaration – has been endorsed by 142 countries. The Taoiseach attended the re-convened Conference during UN High Level Week in late September. We welcome that the actions in the New York Declaration have influenced the drafting of the US Comprehensive Plan to End the Gaza Conflict. Ireland is an active member of the Global Alliance for the Implementation of the Two-State Solution and will host a meeting of the Global Alliance in Ireland in late January, where we will share elements of our own experience of a successful peace process in Northern Ireland.      Continue to seek the application of International Law and justice to all sides in the current conflict through the international court system.    Ireland has continued to seek the application of International Law and justice to all sides in the current conflict through the international court system by participation in relevant International Court of Justice proceedings, and support to the International Criminal Court.      Advocate for a meaningful interpretation of Israel’s human rights obligations under the EU-Israel association agreement at European Commission level and continue to advocate a review of the EU Trade Agreement.    Ireland has consistently called for the EU to take concrete action in response to egregious Israeli breaches of human rights and democratic principles. Ireland welcomes proposals from the European Commission to suspend the core trade-related provisions of the EU-Israel Association Agreement. The proposals are a significant step forward. Ireland has made clear our view that the EU must keep the package of measures proposed in response to Israeli human rights and other breaches on the table. In her State of the Union address, the President of the European Commission was clear on the rationale for tabling the package of proposals, which remain valid.      Progress legislation prohibiting goods from Occupied Palestinian Territories following the July 2024 International Court of Justice Advisory Opinion.    In June 2025, the Government approved the General Scheme of the Israeli Settlements in the Occupied Palestinian Territory (Prohibition of Importation of Goods) Bill. The main purpose of the Bill is to prohibit the importation of goods into the State from Israeli settlements in the occupied Palestinian territory, including East Jerusalem, in line with the Programme for Government commitment to progress that legislation. The next steps in the process, including the timeline for the progress of the Bill, are being considered.      Continue to oppose and condemn Hamas and other groups which bring terror and destruction to their own people and others.    Ireland has consistently condemned Hamas and stated that the PA is the only credible and legitimate interlocutor on the Palestinian side and must be fully engaged.      ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Foreign"
        },
        "showAs": " 175. Deputy Pádraig O'Sullivan asked the Minister for Foreign Affairs and Trade the progress made over the past 12 months on each of her Department’s Programme for Government commitments, in tabular form; and if she will make a statement on the matter. [72192/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_109",
          "debateSectionId": "dbsect_109",
          "showAs": "Programme for Government",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_109.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_175",
        "questionNumber": 175
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Transport  As Minister for Transport, I have responsibility for overall policy and exchequer funding in relation to the National Roads Programme. Under the Roads Acts 1993-2015 and in line with the National Development Plan (NDP), the operation and management of individual national roads is a matter for Transport Infrastructure Ireland (TII), in conjunction with the local authorities concerned. This is also subject to the Infrastructure Guidelines and the necessary statutory approvals. In this context, TII is best placed to advise you in relation to the N22 at Carrigrohane, Co. Cork.  Noting the above position, I have referred your question to TII for a direct reply. Please advise my private office if you do not receive a reply within 10 working days. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 286. Deputy Pádraig O'Sullivan asked the Minister for Transport if he will undertake works on the Carrigrohane straight road, N22 in Cork, to resurface the road and upgrade the streetlights (details supplied); and if he will make a statement on the matter. [71860/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_202",
          "debateSectionId": "dbsect_202",
          "showAs": "Road Projects",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_202.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_286",
        "questionNumber": 286
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Transport"
        },
        "showAs": " 321. Deputy Pádraig O'Sullivan asked the Minister for Transport the progress made over the past 12 months on each of his Department’s Programme for Government commitments, in tabular form; and if he will make a statement on the matter. [72204/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_229",
          "debateSectionId": "dbsect_229",
          "showAs": "Programme for Government",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_229.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_321",
        "questionNumber": 321
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  It was not possible for my Department to provide the information sought in the time available. I will, however, make arrangements to provide the information to the Deputy in line with Standing Orders. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 373. Deputy Pádraig O'Sullivan asked the Tánaiste and Minister for Finance the progress made over the past 12 months on each of his Department’s Programme for Government commitments, in tabular form; and if he will make a statement on the matter. [72190/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_271",
          "debateSectionId": "dbsect_271",
          "showAs": "Programme for Government",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_271.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_373",
        "questionNumber": 373
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  My Department’s mission is to drive the delivery of better public services, living standards and infrastructure for the people of Ireland. The Department's overall priorities are set out in its Statement of Strategy 2025-2028, which was published in September 2025. The strategy outlines how my Department will achieve its goals in the context of the Programme for Government and overarching policy frameworks. My Department has already made significant progress across its overall strategic priorities and Programme for Government actions to date in 2025, as illustrated by the summary of progress on relevant Programme for Government actions in the attached table.   DPER Programme for Government Commitments  ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 390. Deputy Pádraig O'Sullivan asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the progress made over the past 12 months on each of his Department’s Programme for Government commitments, in tabular form; and if he will make a statement on the matter. [72191/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_289",
          "debateSectionId": "dbsect_289",
          "showAs": "Programme for Government",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_289.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_390",
        "questionNumber": 390
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Enterprise, Tourism and Employment  I propose to take Questions Nos. 403 and 410 together.  The Deputy has asked for details of the progress made over the past 12 months on each of my Department’s Programme for Government commitments. I am pleased to report that since January 2025, my Department has made substantial progress in delivering on the commitments set out in the Programme for Government with significant progress achieved across a wide range of areas. Our focus has been on supporting enterprise, fostering innovation, strengthening tourism, and ensuring high-quality employment opportunities across all regions of Ireland.  Employment continues to grow strongly, with 30,700 jobs created in the year to Q3 2025, bringing total employment to over 2.82 million. This represents an increase of 1.1% compared to Q3 2024, with regional employment outside Dublin rising by 23,700 (+1.2%).  Inward investment has remained robust. IDA Ireland supported 179 investments by global companies in the first half of 2025, a 37% increase on the same period last year, expected to deliver cutting-edge research and development and create over 10,000 jobs. IDA also launched its new five-year strategy, Adapt Intelligently: A Strategy for Sustainable Growth and Innovation 2025–2029, aligning with Programme for Government objectives.  Enterprise Ireland continues to drive export growth, with client companies achieving exports of €36.75 billion in 2024, up 7% on the previous year. Over 234,000 people are now employed in EI-supported companies.  Key policy initiatives have been advanced, including the publication of the Action Plan on Competitiveness and Productivity in September, supported by €3.68 billion in allocations under the National Development Plan Review 2025.  We launched the Government’s Action Plan on Market Diversification and led trade missions to Japan, Canada, the UAE, and the United States. A Small Business Unit was established, fulfilling a key Programme for Government commitment, and we convened the first meeting of the Cost of Business Advisory Forum. Regulations were signed to implement the EU Directive on reducing administrative burdens and simplifying corporate sustainability reporting.  In line with the Programme for Government a key priority of mine is reducing red tape and simplifying processes for small businesses. Key highlights in this regard include:  • Grant simplification: The newly established Small Business Unit has reviewed all Local Enterprise Office (LEO) grant schemes, resulting in a reduction of application questions, down 47% for Business Expansion Grants, 30% for the Green for Business Grant and 28% for the Feasibility Grant with further reductions targeted.  • 'Once only' principle: Work is underway to merge application processes across different grants, ensuring businesses only need to provide their data once.  • Faster approvals: Enterprise Ireland has been tasked with achieving a 24-hour turnaround time for grant application approvals.  • EU regulatory relief: Ireland was among the first in Europe to sign regulations exempting 80% of small businesses from the scope of the EU Corporate Sustainability Reporting Directive (CSRD), with a two-year delay granted to others pending further EU negotiations.  • SME Test expansion: In 2024, 26 SME Tests were applied across 8 Government Departments, 10 of which were conducted by the Department of Enterprise, Tourism and Employment. These tests assess the impact of new legislation on small businesses and propose mitigation measures. This figure is expected to increase with all departments mandated to apply SME Tests for new policies.  • Listening to businesses: My officials are actively engaging with stakeholders through the Enterprise and Retail Forums and the Cost of Business Advisory Forum to identify high-impact burdens and opportunities for reform  • Digital transformation: 95% of filings with the Companies Registration Office are now online and the Workplace Relations Commission has implemented Robotic Process Automation to streamline complaint handling.  • Business support access: The National Enterprise Hub has handled over 7,500 enquiries, simplifying access to over 250 supports from 29 departments and agencies.  • Regulatory modernisation: Updates to the Companies Act, the introduction of SCARP (Small Companies Administrative Rescue Process), and reforms to co-operative legislation are making compliance more flexible and accessible.  • EU engagement: The Department of Enterprise, Tourism and Employment continues to shape EU policy through active participation in working groups, supporting simplification efforts such as the EU Startup and Scaleup Strategy and the forthcoming Digital Simplification Package.  In line with the Programme for Government commitment, tourism policy has been strengthened with its functions transferring to my Department and with the launch of A New Era for Irish Tourism, Ireland’s new National Tourism Policy Statement, and the publication of the Tourism Sectoral Adaptation Plan 2025–2030, the first of its kind for the sector. These initiatives aim to ensure balanced regional development and resilience in the face of climate change.  Innovation remains central to our agenda. Under the Disruptive Technologies Innovation Fund, €159 million has been awarded to 27 projects addressing major societal and economic challenges. We launched Ireland’s first Semiconductor Strategy, positioning Ireland as a key player in Europe’s semiconductor future. Additional commitments have been advanced through convening of the Employment Law Review Group, the publication of the Action Plan to Promote Collective Bargaining 2026–2030. The Employment Permits function has had a very strong year, reducing the backlog to its lowest level since 2022 and achieving the fastest processing timelines to date. The permit system digitally transformed facilitating the more efficient and secure processing permits with critical skills processing times down to 10 days. This progress is critical given the service’s central role in enabling business growth and job creation, supporting Ireland’s economic development over recent years. New categories of permits issued including town planners, and a seasonal permits scheme.  In the Programme for Government, there is a firm commitment to support the central role played by the Workplace Relations Commission and the Labour Court in industrial relations and employment matters. A new chair of the Labour Court was appointed in April and the WRC continues to play a critical role in ensuring that employment rights are upheld for all, recovering over €2 million in unpaid wages on foot of 5,156 inspections completed during 2024. The WRC plays a leading role in contributing to the harmonious industrial relations climate with data for conciliation services showing an 85% success rate.  I secured Government agreement to adopt a distributed model of implementation of the EU Artificial Intelligence (AI) Act. This approach will build on the deep knowledge and expertise of the established sectoral regulators. Following this in September 2025 a national single point of contact has also been established within the department to streamline coordination between Irish regulators, the European Commission, and stakeholders. The Single Point of Contact serves as the interface with the public, other Member States, and EU-level counterparts with its purpose to streamline communication and coordination for the implementation and enforcement of the AI Act.  Over the last 18 months my Department’s Officials have been putting in place the structures for a successful Presidency and have been working through the Department of Foreign Affairs and Trade’s Interdepartmental Groups on Presidency Policy Priorities and Operation Planning on progressing Ireland’s policy priorities and operational planning for the Presidency. This work will continue right up to 1st July 2026 when Ireland assumes the Presidency of the Council of the European Union. My Department’s Presidency Planning Team will continue to collaborate across government to ensure that all perspectives are heard and considered in a fair and inclusive manner.  In line with commitments in the Programme for Government my Department continued work to strengthen the Competition and Consumer Protection Commission. the CCPC to strengthen its mandate through the addition to and enhancement of its senior leadership team. In addition, the recruitment of an additional CCPC Member is ongoing, and the CCPC has recently commenced the recruitment of two Senior Directors who will have a direct role in supporting the Members to ensure it can continue to deliver on its important brief. In parallel, the Department is reviewing the legislative framework governing consumer protection fines. Future penalties are expected to align with those applicable to competition law infringements, ensuring greater consistency and impact across the regulatory landscape.  Further progress includes commissioning research to inform the review of Personal Injuries Guidelines, launch of the new Action Plan for Insurance Reform which 11 actions for delivery by my Department and new mediation service from the Personal Injuries Resolution Board. I have also launched a public consultation on the new National Life Sciences Strategy, and announced €170 million investment in European Space Agency programmes to support innovation and technology commercialisation.  Supported by Ministers Dillon and Smyth good progress is being made across all relevant commitments beyond the main achievements highlighted above, in fulfilment of the Programme for Government. Full details of these achievements and ongoing initiatives will be published in the Department’s Annual Report for 2025. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Enterprise"
        },
        "showAs": " 410. Deputy Pádraig O'Sullivan asked the Minister for Enterprise, Tourism and Employment the progress made over the past 12 months on each of his Department’s Programme for Government commitments, in tabular form; and if he will make a statement on the matter. [72195/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_301",
          "debateSectionId": "dbsect_301",
          "showAs": "Programme for Government",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_301.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_410",
        "questionNumber": 410
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school to which the Deputy refers submitted an application for funding under the Emergency Works Scheme (EWS) for a Mechanical & Electrical project.  The purpose of the Emergency Works Scheme (EWS) is to provide funding specifically for unforeseen emergencies. It does so by ensuring the availability of funding for urgent works to those schools that are in need of resources as a result of an emergency situation.  An emergency is deemed to be a situation which poses an immediate risk to health, life, property, or the environment, which is sudden, unforeseen and requires immediate action, and in the case of a school, if not corrected would prevent the school or part thereof from opening.  The EWS operates on the basis of the minimal scope of works required to remedy an emergency situation. The EWS usually provides an interim solution until such time as a comprehensive solution can be provided under the Summer Works Scheme (SWS).  The school's EWS application was refused on the basis that works being sought did not qualify for funding under the EWS and were more appropriate to an SWS project. However, the option remains open to the school to appeal this decision. Appeals will only be considered if they are submitted through the Esinet system and should contain additional relevant information that was not provided as part of the original application. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 462. Deputy Pádraig O'Sullivan asked the Minister for Education and Youth for an update on a school’s application for a lift upgrade (details supplied); and if she will make a statement on the matter. [71844/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_351",
          "debateSectionId": "dbsect_351",
          "showAs": "School Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_351.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_462",
        "questionNumber": 462
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The school to which the Deputy refers submitted an application for funding under the Emergency Works Scheme (EWS) for a roof works project.  The purpose of the Emergency Works Scheme (EWS) is to provide funding specifically for unforeseen emergencies. It does so by ensuring the availability of funding for urgent works to those schools that are in need of resources as a result of an emergency situation.  An emergency is deemed to be a situation which poses an immediate risk to health, life, property, or the environment, which is sudden, unforeseen and requires immediate action, and in the case of a school, if not corrected would prevent the school or part thereof from opening.  The EWS operates on the basis of the minimal scope of works required to remedy an emergency situation. The EWS usually provides an interim solution until such time as a comprehensive solution can be provided under the Summer Works Scheme (SWS).  The school's EWS application was refused on the basis that works being sought did not qualify for funding under the EWS and were more appropriate to an SWS project. However, the option remains open to the school to appeal this decision. Appeals will only be considered if they are submitted through the Esinet system and should contain additional relevant information that was not provided as part of the original application. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 463. Deputy Pádraig O'Sullivan asked the Minister for Education and Youth when a decision will be made on a school’s application for emergency works (details supplied); and if she will make a statement on the matter. [71845/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_352",
          "debateSectionId": "dbsect_352",
          "showAs": "School Facilities",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_352.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_463",
        "questionNumber": 463
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  My officials are working to consolidate the information sought by the Deputy in relation to the progress made over the past 12 months on each of my Department’s Programme for Government commitments. I will arrange to have the material compiled and forwarded to the Deputy as soon as it is available. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 486. Deputy Pádraig O'Sullivan asked the Minister for Education and Youth the progress made over the past 12 months on each of her Department’s Programme for Government commitments, in tabular form; and if she will make a statement on the matter. [72193/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_377",
          "debateSectionId": "dbsect_377",
          "showAs": "Programme for Government",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_377.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_486",
        "questionNumber": 486
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Housing, Local Government and Heritage  The information requested is being compiled and will be forwarded to the Deputy in accordance with Standing Orders. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Housing"
        },
        "showAs": " 600. Deputy Pádraig O'Sullivan asked the Minister for Housing, Local Government and Heritage the progress made over the past 12 months on each of his Department’s Programme for Government commitments, in tabular form; and if he will make a statement on the matter. [72199/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_472",
          "debateSectionId": "dbsect_472",
          "showAs": "Programme for Government",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_472.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_600",
        "questionNumber": 600
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Social Protection  The objective of the School Meals Programme is to provide regular, nutritious food to children to support them in taking full advantage of the education provided to them. The programme is an important component of policies to encourage school attendance and extra educational achievement.  The primary relationship is between the school and supplier. All schools who wish to avail of funding under the programme are responsible for choosing their schools meals supplier on the open market, in a fair and transparent manner in accordance with public procurement rules. These rules clearly define the successful tenderer’s responsibilities and obligations, including in relation to compliance with Nutritional Standards for School Meals and Nutritional Standards for Hot School Meals .  Riverstown National School have confirmed they have started their procurement process to obtain a school meals supplier. Once this is concluded and they have selected a supplier they will then submit their application to my Department for Hot School Meals funding. The school principal and school board of management will decide a start date for the Hot School Meals Programme that best meets the needs in their school. Schools apply annually for School Meals Funding.  I trust this clarifies the matter. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Social"
        },
        "showAs": " 625. Deputy Pádraig O'Sullivan asked the Minister for Social Protection the reason a school in Cork (details supplied) is experiencing a delay in having their school meals rolled out; if the timeline will be reviewed considering that the school is one of the only ones in the area without a school hot meal in place; and if he will make a statement on the matter. [71722/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_487",
          "debateSectionId": "dbsect_487",
          "showAs": "School Meals Programme",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_487.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_625",
        "questionNumber": 625
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Justice, Home Affairs and Migration  I propose to take Questions Nos. 700 and 741 together.  Delivering on the commitments laid out in the Programme for Government is a priority for me as Minister, my Department and my colleagues, Ministers of State Colm Brophy and Niall Collins. Working with them, I want to ensure that our justice system is modern, efficient, and responsive to the needs of all of our people. To serve the fundamental need of all people to feel safe and secure in their homes and in their communities.  I was pleased to recently publish the new Statement of Strategy for my Department for 2025–2028. The Strategy aligns with the Programme for Government, sets out my Department’s strategic direction to 2028 and will further the work towards our shared vision of a safe, fair and inclusive Ireland.  Some of my Department's achievements regarding commitments set out in the Programme for Government (PfG) since the formation of the Government are set out below.  Garda Recruitment  My first priority as Minister for Justice is to get more Gardaí out onto our streets preventing the commission of crime through high visibility patrols. Increased recruitment and appropriate civilianisation where possible are vital to achieving this as is modern technology and equipment and active management of Garda resources. The PfG commits to recruiting at least 5,000 Gardaí in the coming five years. As we strengthen An Garda Síochána, we will see more Gardaí visible in our communities tackling and preventing crime.  This year 794 new recruits have been welcomed into the Garda College in Templemore. This is the highest number recruited since 2018. This includes an intake of 223 trainees in November, the largest single intake in over a decade. Recruitment into An Garda Síochána is now gathering real momentum. New Garda recruits are already making an impact in their communities and the ongoing recruitment of new Gardaí will see further progress in increasing Garda numbers across the State.  Policing, Security and Community Safety Act 2024  On 2 April 2025, I was pleased to commence the landmark Policing, Security and Community Safety Act 2024, in line with the PfG.  As a result, the following bodies were established:  • The new Garda Board  • The Policing and Community Safety Authority (replacing the existing Policing Authority and Garda Síochána Inspectorate)  • Fiosrú – the Office of the Police Ombudsman  • The Office of the Independent Examiner of Security Legislation  • The National Office for Community Safety  The Act strengthens and consolidates independent, external oversight of An Garda Síochána; makes community safety a whole of government and multi-agency responsibility and enhances the internal governance of An Garda Síochána by establishing a new non-executive board which is a corporate governance standard across the public and private sectors.  Tackling Anti-Social Behaviour  The Government’s focus on youth diversion and interventions is a keystone in the Youth Justice Strategy, which is a forward-thinking plan designed to address the unique challenges faced by young people in Ireland. At its core, the Strategy emphasises early intervention, prevention, family support, and community engagement. It includes key objectives aligned with PfG commitments, aimed at promoting positive behavioural change, and it is only by targeting this behaviour that we can break the cycle of offending by young people. YDPs work with young people at risk of crime and anti-social behaviour to divert them away from criminal behaviour and towards better life outcomes.  In November, I was pleased to announce with Minister of State Collins that the State’s network of Youth Diversion Projects (YDPs) has been successfully rolled out nationwide, making these critical interventions available to young people at risk of engaging in criminal activity no matter where they live in Ireland.  Prisons and Penal Policy  A multi-year building programme is currently progressing at several key sites across the prison estate. To accelerate delivery, agreement has been secured for six major projects to bypass the first approval gate of the Infrastructure Guidelines. This decision is expected to bring forward delivery timelines on those six projects by 12 to 18 months. This acceleration reflects the priority placed by the PfG on strengthening the prison system’s resilience and supporting the Irish Prison Service to provide safe, secure and humane accommodation.  Electronic Monitoring  My Department is leading a cross-agency project to introduce electronic monitoring for specific categories of individuals, as committed to in the Programme for Government, and in line with existing legal provisions. Existing legislation, including the Bail Act 1997, as amended, the Criminal Justice Act 2006, as amended and the Sex Offender Act 2001, as amended, provide for electronic monitoring, in certain circumstances.  I had committed to the publication of a Request for Tender (RFT) for the provision of an electronic monitoring service provider by the end of 2025. This Request for Tender has now been published with a closing date of the 16 January 2026 at 5pm.  My Department is tendering for an electronic monitoring service provider for a 12-month pilot phase, which will focus on individuals on temporary release nationally and those admitted to bail in a pilot area. It is proposed to utilise 30 to 50 electronic tags during this phase. This is expected to provided capacity to electronically monitor between 90 and 150 people in a year, but exact numbers monitored will depend on a range of factors including individuals’ lengths of time on bail or on temporary release, and individuals’ personal circumstances, including ongoing suitability and compliance with conditions.  The pilot approach will allow for processes and procedures to be tested before a wider scale national rollout, while also supporting the agencies involved to build capability and knowledge of the electronic monitoring system. Insights from the pilot will inform any future national rollout and procurement. The pilot is expected to be operational in 2026.  A Modern Courts and Legal System  I am committed to enacting essential legislative reform to modernise and streamline our Courts and legal system including:  General Scheme of the Civil Reform Bill  I obtained Government approval to prepare a General Scheme of a Civil Reform Bill. The Civil Reform Bill is a key implementation measure of the Kelly Report of the Review of the Administration of Civil Justice. As part of the Bill, it is my intention to introduce provisions which will codify the existing law on judicial review by placing it on a statutory basis. The measures should achieve greater transparency in the law and lead to a more streamlined review process.  Key reforms should ensure that the system cannot be misused on purely technical grounds, that the public interest is placed at the heart of judicial review, costs are reduced where possible and litigants have sufficient standing to properly challenge decisions. Given the significant challenges currently facing our State in terms of housing shortages, energy deficits, inadequate water supplies and climate change, all of which are exacerbated by the demands of a rising population, we can no longer delay on reform of the judicial review system. I am confident that the Bill will remove weaknesses in the current law, eliminate impediments to progress and deliver reform for the public benefit. I am also confident that measures in the Bill preserve the right of the citizen to ensure that public bodies act lawfully and are accountable for their decisions.  General Scheme of the Criminal Law and Civil Law (Miscellaneous Provisions) Bill 2025  In May, I secured Government approval to progress the General Scheme of the Criminal Law and Civil Law (Miscellaneous Provisions) Bill 2025, which inter alia significantly expands the courts' powers to conduct criminal proceedings remotely, provides for the digitalisation of court documents in such proceedings, criminalises the exploitative practice of seeking sex in lieu of rent, amends the law on disclosure of counselling records in sexual offence trials, and empowers the Gardaí to direct the removal of face coverings in certain public order situations.  The Bill also incorporates legislative amendments to the Criminal Justice (Community Service) Act 1983 and the Criminal Justice (Community Service) (Amendment) Act 2011 to provide that the limit of community service hours be increased from 240 up to 480 hours. This action also includes the requirement for the judiciary to consider community service be mandatory where considering a custodial sentence of up to 2 years or less. It is anticipated that the Bill will be published this year.  I was pleased to receive Cabinet approval for the Bill today 16 December.  Family Law Reform  The ongoing reform of the Family Justice system, for the benefit of families and children, is another of my key priorities.  On 28 April, I hosted my first meeting of the Family Justice Development Forum, and I look forward to the next one planned for 19 January.  This was followed in May by the publication of the Review of the Operation of the In Camera Rule in Family Law Proceedings. The review, a key action in the Family Justice Strategy, was conducted by a team from University College Cork and Trinity College Dublin and is an important piece of research which details the perspectives of many stakeholders regarding the current understanding and operation of the in-camera rule in family law proceedings. Importantly, it includes the views of those who have been parties in such proceedings. Officials from my Department are currently engaging with a variety of stakeholders and working on a policy paper regarding how some of the recommendations made in the report could be implemented.  In August of this year, I published two tenders for the provision of new family law services aimed at making our system more transparent and better for children. The first is for a Private Family Law Reporting Project to provide transparency for the public and increase awareness and understanding of family law proceedings while ensuring that children’s and parents’ right to privacy is upheld. I am pleased to say that the Child Law Project has been contracted to deliver the three year project and work on it has commenced. The second is for a service to provide a new and innovative way to hear children’s voices in private family law proceedings. The Children’s Court Advocate Pilot Project will initially be established in Waterford and Clonmel, ensuring that all children to whom guardianship, custody or access applications relate can have the opportunity to be informed about the proceedings relating to them and have their voice heard without any cost to families.  In October this year I launched a social media campaign to promote a culture of paying child maintenance. This was a recommendation in the Review of the Enforcement of Child Maintenance Orders. Work on implementing the other recommendations in the review is ongoing with child maintenance guidelines and an accompanying calculator due to be launched in January.  In November I hosted a stakeholder event where the OECD and the World Justice Project released the preliminary findings of my Department’s first Legal Needs Survey. The survey forms part of a project Ireland is participating in to develop people-centred justice services to enhance access to justice, including in family justice. I look forward to the full findings being published in 2026.  Domestic, Sexual, and Gender-Based Violence Strategy  Combatting all forms of domestic, sexual and gender-based violence (DSGBV) has been of central importance for me since taking office.  In June, I published the final implementation plan of the five-year ‘Zero Tolerance’ National DSGBV Strategy setting out the delivery targets and collective action to end 2026. The plan builds on the DSGBV commitments set out in the PfG and contains 95 specific actions across the four pillars of the Istanbul Convention. There is a strong emphasis on delivery, collective responsibility, and meaningful outcomes.  Amongst the key deliverables are actions already underway in respect of significant legislative reform commitments including:  • Prioritising the drafting of the Guardianship of Infants (Amendment) Bill that will, in certain situations, allow for the removal of guardianship rights from individuals convicted of killing the other parent or guardian of their child;  • Limiting the disclosure of counselling records in rape and sexual assault cases;  • Banning sex for rent under the Criminal Law and Civil Law (Miscellaneous Provisions) Bill 2025;  • Introducing the Criminal Law (Sexual Offences, Domestic Violence, and International Instruments) Bill 2025 which will introduce the Domestic Violence Register of Judgments - known as ‘Jennie’s Law’ - bringing greater transparency and accountability for serious offenders;  • Establishing the necessary legislative basis to provide for Operation Encompass, which will enable An Garda Síochána to share information with schools when a child has been exposed to domestic violence.  As part of the Zero Tolerance Strategy, Government committed to doubling domestic violence accommodation capacity in Ireland by the end of 2026 from 141 to 282 family units.  The following safe accommodation target was set earlier this year  • 52 new family refuge units by the end of 2026  • 45 new safe homes by the end of 2026  • 50 new units under construction by the end of 2026  Therefore, by the end of 2026 it is envisaged to have 94 safe homes and 193 refuge units completed, bringing total safe accommodation to 287, with 50 further refuge units under construction. I am continuing to work with Cuan, my Department and the Department of Housing to ensure we are exhausting all measures to increase the pace of delivery for this much needed additional capacity.  Immigration  My Department has taken action to significantly improve immigration enforcement measures and increase removals in line with commitments set out in the PfG. This includes the renewed use of chartered deportation flights. To date this year 4,454 deportation orders have been signed and 1,952 people have departed the State under various mechanisms.  In keeping with the PfG commitment to significantly enhance the delivery of public services digitally, phase one of my Department's Immigration Customer Service Portal, which enables applicants to check their immigration application status, book first-time registration appointments, and submit queries, has been operational since last October. To the end of Q3 2025, more than 195,000 customers have registered, with over 150,000 queries resolved and in excess of 88,000 registration appointments made.  In April I secured Government approval to draft the International Protection Bill, the most significant reform of Irish asylum laws in the history of the State in line with the EU Migration and Asylum Pact. The Pact is a new EU framework to manage migration and asylum for the long-term. The overall objective of the Pact is to provide a fair, sustainable and efficient asylum procedure. These important changes include streamlining the decisions process, streamlining the returns process, a new ‘Border procedure’ with a three-month time limit for decisions, and new institutional arrangements for international protection decisions and appeals.  State-Owned Accommodation  I am committed to reforming Ireland’s international protection system to ensure its efficiency and robustness. A stable and sustainable accommodation network is a central element of that reform and a key PfG commitment. State-owned centres are part of the Government’s long-term plan to reduce the reliance on private accommodation providers resulting in better value for money of public funds and a more efficient international protection system. The purchase of the Citywest Hotel in June was a significant step in achieving this.  The viability of other properties that could be utilised as state-owned accommodation is currently being accessed.  Integration  Work on the publication of a new national Migration and Integration Strategy is ongoing as referenced in the PfG.  The Minister of State for Migration, Colm Brophy, recently announced the 37 projects set to receive over €1.5m in funding under the Ireland Against Racism Fund 2025. This Fund enables non-government and community organisations to provide national and regional projects and local initiatives that combat racism and promote racial equality. The Fund is a key part of the National Action Plan Against Racism (NAPAR) which was informed by the experiences of people who have been directly affected by racism.  This is in addition to the Integration Fund which combines two previously run funds – the International Protection Integration Fund (IPIF) and the Communities Integration Fund (CIF). Since their inception, these funds have provided close to €10m in funding to more than 1,000 projects across the country. This fund is for projects supporting migrant integration in areas such as sport, education, employment, and culture. Results of the 2025 Integration Fund were announced in November. 117 projects were awarded a total of €3.6m.  Transfers of Responsibilities  In line with PfG commitments, responsibility for integration, International Protection Accommodation Services (IPAS), and the Ukraine Division transferred to my Department from the Department of Children, Equality, Disability, and Equality on 1 May 2025. This transfer includes the transfer of all staff, approximately 340 people, alongside a substantial budget transfer of approximately €2.1 billion. As my Department had existing responsibility for immigration and migration and the processing of applications for international protection, this transfer underpins a more cohesive and strategic approach to migration and integration.  The National Cyber Security Centre (NCSC) also transferred to my Department from the Department of the Environment, Communications and Climate on 2 June 2025. The NCSC is the lead government agency on cyber security.  Responsibility for the Irish Film Classification Office (IFCO) transferred from my Department on 1 August to the Department of Culture, Communications and Sport. This transfer was carried out in line with the Programme for Government and aligns the work of IFCO with the Department responsible for culture. Responsibility for the Property Services Regulatory Authority (PSRA), as well as the Property Services Appeal Board, also transferred from my Department on 1 August to the Department of Housing, Local Government and Heritage. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Justice"
        },
        "showAs": " 741. Deputy Pádraig O'Sullivan asked the Minister for Justice, Home Affairs and Migration the progress made over the past 12 months on each of his Department’s Programme for Government commitments, in tabular form; and if he will make a statement on the matter. [72200/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_552",
          "debateSectionId": "dbsect_552",
          "showAs": "Programme for Government",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_552.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_741",
        "questionNumber": 741
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Children, Disability and Equality  The Department is currently collating the information requested and a reply will issue directly to the Deputy on this matter as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Children"
        },
        "showAs": " 850. Deputy Pádraig O'Sullivan asked the Minister for Children, Disability and Equality the progress made over the past 12 months on each of her Department’s Programme for Government commitments, in tabular form; and if she will make a statement on the matter. [72194/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_673",
          "debateSectionId": "dbsect_673",
          "showAs": "Programme for Government",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_673.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_850",
        "questionNumber": 850
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1050. Deputy Pádraig O'Sullivan asked the Minister for Health the progress made over the past 12 months on each of her Department’s programme for Government commitments, in tabular form; and if she will make a statement on the matter.  [72198/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_863",
          "debateSectionId": "dbsect_863",
          "showAs": "Programme for Government",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_863.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1050",
        "questionNumber": 1050
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1055. Deputy Pádraig O'Sullivan asked the Minister for Health if her Department carried out an assessment of the financial or clinical impact of introducing a blister pack charge, particularly for older people; and if she will make a statement on the matter. [72225/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_869",
          "debateSectionId": "dbsect_869",
          "showAs": "Pharmacy Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_869.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1055",
        "questionNumber": 1055
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1066. Deputy Pádraig O'Sullivan asked the Minister for Health the number and grades of additional clinical staff identified as necessary to increase patient access to orthodontic services; when recruitment for these posts will commence; the projected impact this staffing increase is expected to have on current waiting lists; and whether funding for these additional posts has been ring-fenced; and if she will make a statement on the matter. [72257/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_879",
          "debateSectionId": "dbsect_879",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_879.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1066",
        "questionNumber": 1066
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1067. Deputy Pádraig O'Sullivan asked the Minister for Health the details of the proposed once-off orthodontic grant of €3,000 for eligible patients; the criteria that will be used to determine eligibility; the way in which the allocation of the grant will operate in practice; whether this measure is intended to permanently supplement public capacity or serve as a temporary intervention to address waiting list pressures; and if she will make a statement on the matter. [72258/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_880",
          "debateSectionId": "dbsect_880",
          "showAs": "Dental Services ",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_880.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1067",
        "questionNumber": 1067
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1068. Deputy Pádraig O'Sullivan asked the Minister for Health the way in which the proposed orthodontic grant will interact with the existing 20% tax relief on orthodontic treatment; if her Department has estimated the total net out-of-pocket cost remaining for families after both supports; whether measures are being considered for families who cannot claim tax relief due to low income or non-taxpayer status; and if she will make a statement on the matter.  [72259/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_881",
          "debateSectionId": "dbsect_881",
          "showAs": "Dental Services ",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_881.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1068",
        "questionNumber": 1068
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  As this is an operational matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1069. Deputy Pádraig O'Sullivan asked the Minister for Health the reason 890 clients in Cork were awaiting home support at the end of October 2025, representing 3,130 hours of unmet need, including 543 awaiting a new home support service and 347 awaiting additional hours; the actions being taken by the HSE South West to address these delays; and if she will make a statement on the matter. [72260/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_882",
          "debateSectionId": "dbsect_882",
          "showAs": "Home Help Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_882.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1069",
        "questionNumber": 1069
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, it has been referred to the Health Service Executive for attention and direct reply to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1070. Deputy Pádraig O'Sullivan asked the Minister for Health the steps her Department is taking to address the recruitment and retention challenges for Health Care Assistant staff in Cork and Kerry, given the acknowledged impact on service delivery and waiting times; and if she will make a statement on the matter. [72261/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_883",
          "debateSectionId": "dbsect_883",
          "showAs": "Departmental Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_883.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1070",
        "questionNumber": 1070
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, it has been referred to the Health Service Executive for attention and direct reply to the Deputy. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1071. Deputy Pádraig O'Sullivan asked the Minister for Health the number of Health Care Assistants (Home Support) in Cork and Kerry in 2025; the number of candidates screened and appointed; the extent to which these campaigns will address the staffing shortages reported by the HSE Southwest; and if she will make a statement on the matter. [72262/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_884",
          "debateSectionId": "dbsect_884",
          "showAs": "Home Help Service",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_884.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1071",
        "questionNumber": 1071
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1072. Deputy Pádraig O'Sullivan asked the Minister for Health the reason no autism diagnostic assessments are being conducted directly within primary care in the HSE Southwest; the reason a primary care autism team has not been established to provide this service; and if she will make a statement on the matter. [72263/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_885",
          "debateSectionId": "dbsect_885",
          "showAs": "Primary Care Centres",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_885.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1072",
        "questionNumber": 1072
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1073. Deputy Pádraig O'Sullivan asked the Minister for Health the cost of outsourcing autism diagnostic assessments in the HSE Southwest; the number of assessments delivered through private providers in each of the past three years; whether direct provision through a primary care team will reduce these costs; and if she will make a statement on the matter. [72264/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_886",
          "debateSectionId": "dbsect_886",
          "showAs": "Departmental Data",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_886.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1073",
        "questionNumber": 1073
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As this is a service matter, I have asked the Health Service Executive to respond to the Deputy directly, as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1074. Deputy Pádraig O'Sullivan asked the Minister for Health the staffing levels required to provide an in-house autism diagnostic service within primary care in the Southwest; whether recruitment for these posts has begun or is planned; and if she will make a statement on the matter. [72265/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_887",
          "debateSectionId": "dbsect_887",
          "showAs": "Health Services Staff",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_887.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1074",
        "questionNumber": 1074
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Health  As the Health Service Executive is responsible for the delivery of public healthcare infrastructure projects, I have asked the HSE to respond to you directly in relation to this matter. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1075. Deputy Pádraig O'Sullivan asked the Minister for Health the reason for the delay in commencing construction of the new ten-bed rehabilitative residential unit in Midleton to replace the Owenacurra facility; the updated timeline for completion; and if she will make a statement on the matter. [72266/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_889",
          "debateSectionId": "dbsect_889",
          "showAs": "Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_889.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1075",
        "questionNumber": 1075
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Health  As this is a service matter, I have asked the Health Service Executive to respond directly to the Deputy as soon as possible. ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Health"
        },
        "showAs": " 1076. Deputy Pádraig O'Sullivan asked the Minister for Health if community mental health teams in the HSE Southwest are currently accepting more new cases than they are discharging; the actions which are being taken to address capacity pressures; and if she will make a statement on the matter. [72267/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_890",
          "debateSectionId": "dbsect_890",
          "showAs": "Mental Health Services",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_890.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1076",
        "questionNumber": 1076
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": "",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 1176. Deputy Pádraig O'Sullivan asked the Minister for Further and Higher Education, Research, Innovation and Science the progress made over the past 12 months on each of his Department’s programme for Government commitments, in tabular form; and if he will make a statement on the matter.  [72202/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_991",
          "debateSectionId": "dbsect_991",
          "showAs": "Programme for Government",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_991.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1176",
        "questionNumber": 1176
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Rural and Community Development and the Gaeltacht  I propose to take Questions Nos. 1181 and 1187 together.  The Programme for Government, Securing Ireland’s Future , is a programme of investment and reform, backed by ambitious actions, which will support significant progress in addressing critical challenges.  Since this Government was formed, my Department has achieved significant progress across all actions for which it is responsible across the areas of rural development, community development, and Gaeltacht and the Islands. Comprehensive updates are set out in the table at the following link, and these updates demonstrate the extent of delivery across both policy and schemes in 2025.   Progress on Department Programme  ",
        "questionType": "written",
        "date": "2025-12-16",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Rural"
        },
        "showAs": " 1187. Deputy Pádraig O'Sullivan asked the Minister for Rural and Community Development and the Gaeltacht the progress made over the past 12 months on each of his Department’s Programme for Government commitments, in tabular form; and if he will make a statement on the matter. [72197/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/dbsect_995",
          "debateSectionId": "dbsect_995",
          "showAs": "Programme for Government",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-16/writtens/mul@/dbsect_995.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-16/pq_1187",
        "questionNumber": 1187
      },
      "contextDate": "2025-12-16"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  As Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitisation, I am responsible for setting the overall capital allocations across Departments and for monitoring monthly expenditure at Departmental level.  In the 2021 National Development Plan (NDP) review, the Government originally committed €165 billion in capital investment for the period 2021-30, and subsequently agreed to additional funding of €2.25 billion in March 2024 for 2024-2026.  The revised National Development Plan, published in July, set out €275.4 billion in public capital investment to 2035 – the largest and most significant capital injection in our economy in the history of the State. Following the agreement of the revised NDP in July 2025, gross capital expenditure ceilings for all sectors have now been set out to 2030.  National Strategic Outcome (NSO) 10 refers to access to quality childcare, education and health services. Under the 2025 NDP review, the Government allocated €795 million to the Department of Children, Disability and Equality and a total of €9,250 million to the Department of Health for the 2026-2030 period.  A range of projects and projects have already been delivered under NSO 10 since the 2021 NDP review, including for example:  • €6.9 billion invested in capital infrastructure primary and post primary level schools resulting in over 1,200 projects completed; and  • Under the Healthy Ireland Framework, 18 Sláintecare Healthy Communities have been established in disadvantaged areas, 4,500 people benefit from the Sláintecare Age-Friendly Healthy Homes Scheme and over 500 GAA clubs provide the holistic Healthy Clubs model to members and communities.  A full list of projects and programmes for each of the ten National Strategic Outcomes can be found in the regular publications by my Department on the gov.ie site:  • The capital investment tracker provides a composite update on the progress of all major investments with an estimated cost of greater than €20 million.  • The myProjectIreland interactive map details projects across the country and provides details on specific projects by county and contains smaller investments such as schools and health facilities.  • The Project Ireland 2040 Annual and Regional Reports highlight achievements and give a detailed overview of the public investments that have been made throughout the country, including detail from across Government on the national strategic objectives.  • The forthcoming Project Ireland 2024 Annual and Regional Reports will provide full and up to date detail on delivery of the National Strategic Outcomes. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 55. Deputy Pádraig O'Sullivan asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the progress to date under the National Strategic Outcome 10 of the National Development Plan 2021 – 2030; and if he will make a statement on the matter. [67800/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_95",
          "debateSectionId": "dbsect_95",
          "showAs": "National Development Plan",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_95.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_55",
        "questionNumber": 55
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation  Last week, I published the Accelerating Infrastructure Report and Action Plan. This sets out a comprehensive programme of actions to tackle delays in delivering capital projects.  The Plan sets out 30 targeted actions grouped under four pillars, each addressing a key area of reform:  The first pillar is Legal Reform. Reforms here aim to achieve a better balance towards the common good by addressing the incentives that drive a disproportionate reliance on the courts in planning and regulatory matters. While access to justice remains protected, the reforms will reduce incentives for excessive litigation, clarify rules on standing and remedies, and introduce fast-track pathways for nationally significant projects that are in the common good, through the development of new legislation.  The second pillar is Regulatory Reform and Simplification. This means identifying where regulation leads to excessive process rather than improved outcomes. It also means examining the structure of our regulatory environment, the practices applied by regulatory bodies, and how they communicate with one another and applicants. In practical terms, I think that there is scope for improved outcomes by applying parallel processes, mandating statutory timelines, and measuring the performance of our regulatory bodies  The third pillar is Coordination and Delivery Reform. This implements the reforms outlined in the Programme for Government. It means my Department assuming a more central coordination role on critical infrastructure, providing certainty to other Government Departments and utilities through multiyear funding commitments to underpin 5-year sectoral plans and reforms to the Infrastructure Guidelines. Across Government, it means driving and embedding a delivery-first culture, including, where appropriate, a balance between risk and delivery that incorporates the potential cost of delay.  The final pillar is Public Acceptance. Fundamentally, without improved public acceptance, critical infrastructure will be subject to delays, leaving broader society worse off. Government and utilities need to do a better job in promoting the social value of infrastructure to communities openly and transparently using tools like a benefits realisation framework that can demonstrate these societal benefits.  Taken together, these reforms will deliver faster approvals, shorter timelines, improved coordination, and greater public trust. They will ensure that record investment under the NDP translates into timely, cost-effective delivery of housing, energy and transport infrastructure that supports Ireland’s housing targets, climate commitments, and economic competitiveness. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Public Expenditure"
        },
        "showAs": " 82. Deputy Pádraig O'Sullivan asked the Minister for Public Expenditure, Infrastructure, Public Service Reform and Digitalisation the way in which he and his Department plan to address delays in delivering capital projects; and if he will make a statement on the matter. [67799/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_116",
          "debateSectionId": "dbsect_116",
          "showAs": "Strategic Infrastructure",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_116.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_82",
        "questionNumber": 82
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  The project to which the Deputy refers has been devolved for delivery to the Joint Managerial Board (JMB).  Coláiste an Phiarsaigh was approved as a new large scale capital project for the provision of a 750 pupil post primary school with four Special Educational Needs (SEN) classrooms.  The project is currently at Stage 2b of the architectural design process. This allows for detailed design and planning, obtaining the necessary statutory permissions and the preparation of tender documents. Planning permission for this project was obtained in September 2025. The Design Team are now working to complete the Stage 2b report for submission to the Department.  In July the Government announced a capital allocation of €7.55 billion for the Department of Education and Youth for the period 2026-2030 under the National Development Plan. As part of this NDP allocation my department will place a strong emphasis on provision for children with special educational needs, with a particular focus on meeting annual school place needs.  In relation to project rollout for Large-Scale projects and Additional School Accommodation scheme projects, the approach will be to continue to maximise the capacity of the existing school estate as much as possible in the first instance and provide necessary additional capacity through targeted and prioritised project rollout over the course of 2026 to 2030 period to meet the most urgent and prioritised needs.  Government departments are currently in the process of publishing their sectoral NDP Implementation Plans. The sectoral plan for the Education and Youth sector will be published next week and the first tranche of projects to progress to construction will be published in January. This NDP Implementation Plan will optimise outputs from the NDP allocations, with a strong focus on maximising existing school capacity, progressing priority projects where local capacity across schools in the area is insufficient, and ensuring delivery that is affordable, offers value for money, and meets functional needs.  The current status of all projects is listed on a county-by-county basis at www.gov.ie. under item number 10 and this is updated on a regular basis to reflect project progress through the various stages of capital appraisal, site acquisition, design, tender and construction. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 143. Deputy Pádraig O'Sullivan asked the Minister for Education and Youth for an update on the development and extension plans for a school in Cork (details supplied); and if she will make a statement on the matter. [67783/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_166",
          "debateSectionId": "dbsect_166",
          "showAs": "School Accommodation",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_166.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_143",
        "questionNumber": 143
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Education and Youth  Tusla Education Support Service (TESS) is under the remit of my department since 1 January 2021.  TESS operates under the Education (Welfare) Act, 2000, a piece of legislation that emphasises the promotion of school attendance, participation and retention. TESS has three strands: the statutory Educational Welfare Service (EWS) and the two school support services the Home School Community Liaison Scheme (HSCL) and the School Completion Programme (SCP). The three TESS strands work together collaboratively with schools, parents and guardians and other relevant services to achieve the best educational outcomes for children and young people.  Parents have a legal duty to ensure that their child, who is attending a recognised school, is at school on every day that the school is open, unless there is a genuine reason for him or her not to attend.  TESS has developed a five-year plan for school attendance (2023-2028). The plan is targeted and collaborative and will focus on policy, practice, implementation of the Multi-Dimensional Multi-Tiered System of Supports (MD-MTSS) and the expansion of TESS services to schools and families, employing innovative ways to meet the needs of vulnerable learners. The plan is structured on five distinct themes of work where actions are outlined to improve attendance. Further information is available at [ TESS_5_Year_Plan_for_School_Attendance_2023-2028.pdf ]  Each school is required to have a set of attendance practices and strategies that promote good attendance among all students. As part of the five-year plan, TESS has published a series of attendance webinars to support schools. The seven webinars in the series are available for schools to view at;-  [ National School Attendance CampaignTusla - Child and Family Agency ]  During the 2023/2024 school year, all recognised schools also received a once off grant from my department aimed at promoting regular school attendance. Schools received an allocation based on their enrolment, with schools in the DEIS programme receiving either an increase of 1.5 times or twice the amount allocated per student, depending on the DEIS classification. The total amount allocated was over €6m.  In the current school year, TESS has delivered a national multi-media school attendance campaign, promoting the importance of regular school attendance for all students. Consultation with key stakeholders took place to build the key campaign messages. The multimedia campaign aims to raise awareness of the importance of school attendance with parents and caregivers, to communicate the benefits of daily attendance at school and to signpost supports where families are experiencing school attendance problems.  My department, in collaboration with TESS, the National Parents Council and the HSE, has created a dedicated website landing page [ www.gov.ie/schoolattendance ] to direct the public to the available supports and advice.  TESS teams are working collaboratively with schools and communities to provide interventions, including the implementation of a new Multi-dimensional - Multi-tiered System of Support (MD-MTSS) framework, known as Anseo, which provides schools with tools to effectively plan to improve school attendance. The implementation of this model is intended to create practices, structures, and tools that will assist schools in improving attendance outcomes for schools and students. It will develop and strengthen responses for young people experiencing school avoidance behaviours. The model was successfully piloted in four schools before being rolled out to sixty additional schools from the start of the current school year. It will be rolled out to further schools in early 2026. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Education"
        },
        "showAs": " 168. Deputy Pádraig O'Sullivan asked the Minister for Education and Youth the measures her department is taking to address the increase in absenteeism in primary and secondary schools, considering the results of a recent large scale mixed method study showed a growing trend of students missing school post Covid–19; and if she will make a statement on the matter. [67784/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_192",
          "debateSectionId": "dbsect_192",
          "showAs": "Education Policy",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_192.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_168",
        "questionNumber": 168
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister of State at the Department of Further and Higher Education, Research, Innovation and Science  Minister Lawless and I have prioritised the growth of craft apprenticeships to support critical trades like plumbing and electrical which are key to delivering the National Development Plan.  In Budget 2026, an additional investment of €79 million was secured to expand apprenticeship delivery.  €2.5 million investment was also secured to reduce higher education costs for apprentices. This means fees will be permanently lowered by 17% for more than 11,000 craft apprentices in the 2025/26 academic year, making participation more accessible.  I have also prioritised the promotion of apprenticeships as a valued tertiary education option. My department sponsors WorldSkills Ireland, and when I attended it this September, I saw strong engagement from schools nationwide. It showcases skills based occupations and raises awareness of the opportunities that skills based careers and apprenticeships offer.  The Apprentice of the Year and Apprentice Employer of the Year awards celebrate excellence and highlight how apprenticeships address skills needs across sectors. These efforts, combined with strong government investment, have delivered real results. Annual craft apprenticeship registrations have grown by 63%, from 4,377 in 2020 - the year my department was formed - to 7,113 in 2024.  Building on this progress, the Government will launch the Action Plan for Apprenticeship 2026 - 2030 next year, targeting 12,500 annual registrations by 2030 of which two thirds are in craft and construction. With the investment in Budget 2026 bringing the total apprenticeship current funding to over €410 million in 2026, there is a strong foundation to achieve this goal and continue growing the craft apprenticeship system. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 221. Deputy Pádraig O'Sullivan asked the Minister for Further and Higher Education, Research, Innovation and Science the further actions he will take to increase craft apprenticeship participation given the additional funding allocated in Budget 2026; and if he will make a statement on the matter. [66416/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_233",
          "debateSectionId": "dbsect_233",
          "showAs": "Apprenticeship Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_233.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_221",
        "questionNumber": 221
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Minister for Further and Higher Education, Research, Innovation and Science (Deputy James Lawless)  My Department is committed to positioning apprenticeships as a valued pathway for secondary school students and driving their continued development, with a strong focus on the construction sector.  Through the Action Plan for Apprenticeship 2021–2025 and its successor, the Apprenticeship Action Plan 2026–2030, currently in preparation, we are shaping a long-term vision for apprenticeship in Ireland. This work is complemented by the Careers in Construction Action Plan, which sets out 20 targeted actions to promote inclusive and sustainable careers, particularly for women, young people, and under-represented groups.  Annual registrations have grown from 6,177 in 2019 to 9,352 in 2024, setting a strong foundation for the target of 12,500 per year by 2030. The range of programmes has expanded to 78, covering traditional trades and emerging sectors.  To foster early engagement, the Initial Vocational Education and Training (iVET) module is now available to all Transition Year students, offering hands-on exposure to vocational pathways through FET and apprenticeship taster courses, career talks, and workshops.  My Department also funds WorldSkills Ireland, which attracted over 30,000 students from more than 300 schools, showcasing the talent and ambition of Ireland’s apprentices.  These efforts underline our commitment to making apprenticeships, including in construction, a respected and attractive option for young people. ",
        "questionType": "written",
        "date": "2025-12-11",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Further and Higher Education"
        },
        "showAs": " 249. Deputy Pádraig O'Sullivan asked the Minister for Further and Higher Education, Research, Innovation and Science if he can provide an update on the Programme for Government target of 12,500 annual apprenticeship registrations; the efforts his Department is making to promote apprenticeships to school leavers given the urgent need for them in the construction sector; and if he will make a statement on the matter. [66417/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/dbsect_262",
          "debateSectionId": "dbsect_262",
          "showAs": "Apprenticeship Programmes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-11/writtens/mul@/dbsect_262.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-11/pq_249",
        "questionNumber": 249
      },
      "contextDate": "2025-12-11"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The Government is taking a comprehensive and proactive approach to improving competition in the Irish insurance sector, through the efforts of the Office for the Promotion of Competition in the Insurance Market (OPCIM). The new Programme For Government - Securing Ireland’s Future calls for the expansion/support of the Office and work is underway to add additional resources. It continues to play an important role in connecting various stakeholders – insurers, brokers, representative groups, among others – and facilitating engagement on issues relating to the availability of insurance across the market.  The 2020 Action Plan brought significant changes, including reforms to the Duty of Care, enhancements to the Injuries Resolution Board, and the implementation of new Personal Injuries Guidelines. These changes contributed to a more stable and competitive insurance market, helping to attract new providers such as OUTsurance, Revolut, and an influx of Managing General Agents. Additionally, OPCIM has been instrumental in restoring insurance availability in sectors that previously struggled, such as equestrian activities, inflatable hire, adventure tourism, childcare, and high-footfall SMEs like pubs and hospitality.  The new Action Plan, published on 24 July, sets out a comprehensive set of targeted measures to further improve affordability, availability, and transparency across the insurance sector. There are several priority actions, including actions that place a key focus on the Office and enhancing market competitiveness by proactively engaging with the insurance market to encourage new entrants into the Irish insurance market, which will further boost supply and enhance the availability of insurance.  Through the combined efforts of OPCIM, the Department of Finance, and other stakeholders, the Government remains committed to fostering a more open and competitive insurance market. These actions are designed to ensure that businesses, community groups, and consumers across Ireland benefit from increased insurance capacity, better pricing, and greater choice. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 33. Deputy Pádraig O'Sullivan asked the Tánaiste and Minister for Finance the steps being taken to improve competition in the insurance sector in Ireland; and if he will make a statement on the matter. [63660/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_53",
          "debateSectionId": "dbsect_53",
          "showAs": "Insurance Industry",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_53.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_33",
        "questionNumber": 33
      },
      "contextDate": "2025-12-09"
    },
    {
      "question": {
        "answerText": " Tánaiste and Minister for Finance  The Help to Buy (HTB) incentive, is a scheme to assist first-time purchasers with the deposit they need to buy or build a new house or apartment. It also aims to encourage additional supply of new houses by supporting demand.  HTB provides a refund of Income Tax and Deposit Interest Retention Tax (DIRT) paid in Ireland over the previous four years, subject to limits outlined in the legislation.  The level of support available to first time buyers under the HTB scheme, is whichever is the lesser of:  • €30,000; or  • 10 per cent of the purchase price of the new property; or,  • the amount of Income Tax and DIRT paid in the four years before application for the relief.  Based on the latest available data (31 October 2025), the scheme has supported over 60,000 individuals or couples to buy or build their own home.  I am advised by Revenue that the table below sets out details of the HTB claims approved over each of the past five years in respect of properties in County Cork and the number of applicants associated with these claims.      Year      Approved Claims (Cork)      Associated Applicants (Cork)        2020     820    1,530       2021     1,080    1,980       2022     970    1,810       2023     1,020    1,890       2024     1,470    2,560     Figures have been rounded to the nearest 10.  I am further advised that, while HTB claimants are required to give details of the county in which the relevant property is located, they are not required to declare the specific local authority area. Therefore, Revenue does not have data from which to provide a breakdown by Cork City Council and Cork County Council. ",
        "questionType": "written",
        "date": "2025-12-09",
        "to": {
          "roleType": null,
          "roleCode": null,
          "uri": null,
          "showAs": "Finance"
        },
        "showAs": " 42. Deputy Pádraig O'Sullivan asked the Tánaiste and Minister for Finance the number of help-to-buy claims approved in Cork city and Cork county over the past five years; the number of applicants associated with these claims; and if he will make a statement on the matter. [63659/25] ",
        "house": {
          "committeeCode": "",
          "chamberType": "house",
          "showAs": "34th Dáil",
          "houseCode": "dail",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/house/dail/34",
          "houseNo": "34"
        },
        "by": {
          "memberCode": "Pádraig-O'Sullivan.D.2019-11-29",
          "uri": "https://data.oireachtas.ie/ie/oireachtas/member/id/Pádraig-O'Sullivan.D.2019-11-29",
          "showAs": "Pádraig O'Sullivan"
        },
        "debateSection": {
          "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/dbsect_61",
          "debateSectionId": "dbsect_61",
          "showAs": "Housing Schemes",
          "formats": {
            "xml": {
              "uri": "https://data.oireachtas.ie/akn/ie/debateRecord/dail/2025-12-09/writtens/mul@/dbsect_61.xml"
            },
            "pdf": null
          }
        },
        "uri": "https://data.oireachtas.ie/ie/oireachtas/question/2025-12-09/pq_42",
        "questionNumber": 42
      },
      "contextDate": "2025-12-09"
    }
  ]
}